{
  "last_updated": "2026-01-04T14:18:52.485Z",
  "total_news_count": 63,
  "news": [
    {
      "Ticker": "NVDA",
      "Date": "2026-01-04",
      "Time": "21:29:00",
      "Source": "Motley Fool",
      "Title": "4 Stocks to Buy in January That Could Join Nvidia in the $1 Trillion Club by 2030",
      "URL": "https://finance.yahoo.com/m/a41f3aeb-184f-3589-8db0-b8f76d76f055/4-stocks-to-buy-in-january.html",
      "Content": "4 Stocks to Buy in January That Could Join Nvidia in the $1 Trillion Club by 2030\n\nDaniel Foelber, The Motley Fool\nSun, January 4, 2026 at 5:29 AM PST 6 min read\n\nIn this article: NVDA\n\nORCL\n\nV\n\nXOM\n\nAVGO\n\nKey Points Visa and ExxonMobil are highly efficient businesses that return capital to shareholders through buybacks and dividends.\nOracle is a high-risk, high-potential-reward bet on increased demand for artificial intelligence (AI) infrastructure.\nNetflix deserves a premium valuation.\n10 stocks we like better than Visa ›\n\nNvidia (NASDAQ: NVDA) ended 2025 as the most valuable company in the world. It is one of nine S&P 500 (SNPINDEX: ^GSPC) stocks with market capitalizations exceeding $1 trillion -- the others being Apple , Alphabet , Microsoft , Amazon , Meta Platforms , Broadcom , Tesla , and Berkshire Hathaway .\nEli Lilly , Walmart , and JPMorgan Chase only need to rise 14% or less to expand the list to 12 companies.\nHere's why Visa (NYSE: V) , ExxonMobil (NYSE: XOM) , Oracle (NYSE: ORCL) , and Netflix (NASDAQ: NFLX) have what it takes to be winning investments over the next five years and join the $1 trillion club by 2030.\n1. Visa Visa's path to $1 trillion is fairly straightforward. The payment processor has high margins, a reasonable valuation , and steady earnings growth, and returns tons of capital to shareholders through buybacks and dividends.\nVisa can generate high single-digit or double-digit earnings growth even during challenging periods.\nDespite slowdowns in consumer spending, Visa grew non-generally accepted accounting principles (non-GAAP) earnings per share by 14% in 2025. If Visa can maintain that growth rate going forward, it could reach a market cap well beyond $1 trillion by 2030.\n\n2. ExxonMobil ExxonMobil will need to double in five years to surpass $1 trillion in market cap. It absolutely has what it takes.\nExxonMobil is generating gobs of free cash flow (FCF) and high earnings, even though oil prices are hovering around four-year lows. It has reduced its production costs and can break even at low oil prices, and has plenty of upside potential during a higher-price environment. It also has a growing low-carbon business and a massive refining and marketing segment.\n\nExxonMobil's corporate plan through 2030 forecasts double-digit earnings growth even if oil and gas prices are mediocre. Although the U.S. Energy Information Administration is only forecasting $55 per Brent crude oil barrel in 2026, oil prices could rise in the coming years due to economic demand fueled by artificial intelligence (AI), as well as overall economic growth and geopolitical tensions.\nEither way, ExxonMobil doesn't need a lot of help from oil prices to grow earnings at a solid pace. A 15% annual growth rate, compounded over five years, would double earnings. Given the stock's reasonable volatility, it could double as well, pole-vaulting ExxonMobil over the $1 trillion bar.\n\nStory Continues\nIn the meantime, ExxonMobil investors will benefit from its stable and growing 3.4% dividend, which ExxonMobil has increased for 43 consecutive years.\n3. Oracle Oracle almost surpassed $1 trillion in market cap in September before falling over 40% from that high due to concerns about its AI spending and mounting debt.\nOracle is ramping up spending to build out data center infrastructure to grow its cloud computing market share, especially for high-performance computing workflows. It exited its most recent quarter with $523 billion in remaining performance obligations, signaling demand is high for its infrastructure. But Oracle needs to convert capital expenditures into earnings. In the meantime, it is FCF negative, making Oracle a leveraged bet on increased AI adoption.\n\nDespite its risks, Oracle's potential is impossible to ignore. Oracle is a great buy for investors who agree that its aggressive AI investments are the right long-term move and are willing to endure what will likely be a highly volatile period in the stock price.\n4. Netflix Over the last six months, Netflix's market cap has slipped from over $560 billion to under $400 billion due to a mix of valuation concerns and uncertainties regarding its planned acquisition of Warner Bros. Discovery (NASDAQ: WBD) . Netflix will probably receive regulatory approval for the acquisition, but still faces challenges from Paramount Skydance (NASDAQ: PSKY) , which is attempting a hostile takeover of Warner Bros. Discovery.\n\nBut with or without Warner Bros. Discovery, Netflix has what it takes to steadily grow earnings through a combination of global subscriber growth and pricing power. If Netflix were to acquire Warner Bros. Discovery, it could create a highly lucrative top-tier streaming platform that features content from both Netflix and HBO, as well as a revamped ad-supported tier.\nEven without HBO, Netflix has mastered the art of aligning content spending with steady subscription revenues, thanks to its depth and breadth of content -- from building global franchises from scratch like Stranger Things , to the success of KPop Demon Hunters.\nNetflix has already demonstrated impeccable pricing power with multiple price increases in a relatively short amount of time and a crackdown on password sharing that was largely accepted by users -- even during a period when people are pulling back on discretionary spending. So even if it doesn't quite crack the $1 trillion club, I still fully expect Netflix to be a winning investment and outperform the S&P 500 over the next five years.\n\nStart the new year off right with these top stocks With the broader indexes around all-time highs, it's easy to get enamored by the companies that could surge in value in the coming months or in 2026. But a far more rewarding approach is to invest in companies that have what it takes to compound in value over the long term.\nVisa, ExxonMobil, Oracle, and Netflix certainly fit that mold. That's why I expect all four stocks to outperform the S&P 500 and join the $1 trillion club over the next five years, even though they are currently far from reaching that milestone.\n\nShould you buy stock in Visa right now? Before you buy stock in Visa, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Visa wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $490,703 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,157,689 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 966 % — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of January 4, 2026.\nJPMorgan Chase is an advertising partner of Motley Fool Money. Daniel Foelber has positions in Nvidia and Oracle and has the following options: short March 2026 $240 calls on Oracle. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Berkshire Hathaway, JPMorgan Chase, Meta Platforms, Microsoft, Netflix, Nvidia, Oracle, Tesla, Visa, Walmart, and Warner Bros. Discovery. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\n4 Stocks to Buy in January That Could Join Nvidia in the $1 Trillion Club by 2030 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AMZN",
      "Date": "2026-01-04",
      "Time": "21:00:43",
      "Source": "Yahoo Finance Video",
      "Title": "Amazon stock lagged in 2025: Why it could bounce back in 2026",
      "URL": "https://finance.yahoo.com/video/amazon-stock-lagged-2025-why-130043025.html",
      "Content": "Amazon stock lagged in 2025: Why it could bounce back in 2026\n\nYahoo Finance Video and Brian Sozzi\nSun, January 4, 2026 at 5:00 AM PST\n\nIn this video: AMZN\n\nAmazon ( AMZN ) has been a laggard among the \"Magnificent Seven\" this year, but the stock could see gains in 2026.\nLaffer Tengler Investments CEO and CIO Nancy Tengler joins Morning Brief with Yahoo Finance Executive Editor Brian Sozzi to discuss what investors should expect from Amazon's stock in 2026.\nTo watch more expert insights and analysis on the latest market action, check out more Morning Brief .\n\nVideo Transcript\n\n00:00 Speaker A\nI think people forgot about Amazon. uh, underperform this year. I wrote a story yesterday on Yahoo Finance saying laying out why the stock could rise 50% next year. I got a lot of uh, let's say negative feedback on that. Very important, I wasn't making this call. I was just laying out the reasons why it could happen. Am I out of my mind here?\n00:22 Speaker B\nWelcome to the investment business.\n00:25 Speaker B\nUm no, I saw it and I do agree. I think there are a number it it's been a laggard. Uh they delivered robust earnings. I mean, really a massive earnings beat last quarter. Um the AWS business is very mature but still growing at 20%. and they and they offered this tidbit that I didn't see many people talk about and that is that October growth in that business was bigger than the whole third quarter. So, I I wouldn't underestimate them. Traium is at full capacity and uh has a backlog and it's a stock that's trading at a peg of 1.4 times. If you go back and look at the S&P historically, it's traded at a peg of 1.5 to two times. Um so I think this company is fairly valued um and has the ability to deliver not just robust earnings growth, but free cash flow is going to increase next year to levels we haven't seen in five years.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "NVDA",
      "Date": "2026-01-04",
      "Time": "20:54:16",
      "Source": "Investor's Business Daily",
      "Title": "Dow Jones Futures: How Will Markets React To Trump's Venezuela Action? Nvidia, AMD, Taiwan Semi Due",
      "URL": "https://finance.yahoo.com/m/d3aa3714-1ae7-36bd-90d6-a7ef43eaf2f8/dow-jones-futures%3A-how-will.html",
      "Content": "Dow Jones Futures: How Will Markets React To Trump's Venezuela Action? Nvidia, AMD, Taiwan Semi Due\n\nED CARSON\nSun, January 4, 2026 at 4:54 AM PST 8 min read\n\nIn this article: NVDA\n\n^DJI\n\nAMD\n\nTSM\n\n^GSPC\n\nPresident Trump said the U.S. will \"run\" Venezuela after capturing Nicolas Maduro, but left his regime in charge. Nvidia, AMD CEOs speak at CES Monday.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AMD",
      "Date": "2026-01-04",
      "Time": "20:54:16",
      "Source": "Investor's Business Daily",
      "Title": "Dow Jones Futures: How Will Markets React To Trump's Venezuela Action? Nvidia, AMD, Taiwan Semi Due",
      "URL": "https://finance.yahoo.com/m/d3aa3714-1ae7-36bd-90d6-a7ef43eaf2f8/dow-jones-futures%3A-how-will.html",
      "Content": "Dow Jones Futures: How Will Markets React To Trump's Venezuela Action? Nvidia, AMD, Taiwan Semi Due\n\nED CARSON\nSun, January 4, 2026 at 4:54 AM PST 8 min read\n\nIn this article: NVDA\n\n^DJI\n\nAMD\n\nTSM\n\n^GSPC\n\nPresident Trump said the U.S. will \"run\" Venezuela after capturing Nicolas Maduro, but left his regime in charge. Nvidia, AMD CEOs speak at CES Monday.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "MSFT",
      "Date": "2026-01-04",
      "Time": "19:46:36",
      "Source": "Benzinga",
      "Title": "Microsoft (MSFT) Stock Moves Lower As Investors Assess Its AI Edge Against Google",
      "URL": "https://finance.yahoo.com/news/microsoft-msft-stock-moves-lower-114636146.html",
      "Content": "Microsoft (MSFT) Stock Moves Lower As Investors Assess Its AI Edge Against Google\n\nHenry Khederian\nSun, January 4, 2026 at 3:46 AM PST 3 min read\n\nIn this article: MSFT\n\nGOOG\n\n^GSPC\n\nMETA\n\nAMZN\n\nMicrosoft Corp (NASDAQ: MSFT ) shares are down Friday morning as the investors continue to weigh its competitive position in the AI space. This decline comes amid the S&P 500 and Nasdaq-100 trading flat to start 2026.\nAnalyst Touts Azure's Gains, Flag Risks For Google's Model On Wednesday, John Freeman , co-founder and senior analyst at Ravenswood Partners , discussed the potential impact of Microsoft's Azure on Alphabet Inc’s (NASDAQ: GOOGL ) AI business, suggesting that Google's traditional revenue model could be at risk due to advancements in AI. The analyst highlighted that Microsoft's Azure is positioned as a leading AI cloud provider, which could significantly influence future growth.\n\nDon't Miss:\nThe AI Marketing Platform Backed by Insiders from Google, Meta, and Amazon — Invest at $0.85/Share\nMissed Tesla? EnergyX Is Tackling the Next $200 Billion Opportunity — Lithium\nFreeman pointed out that Microsoft's investments in AI infrastructure, including a $19 billion CAD commitment in Canada, are expected to enhance its data center capacity and digital sovereignty.\nThis strategic move is seen as a way to bolster its competitive edge against Google, which may face challenges in maintaining its revenue streams as AI technologies evolve.\nThe broader market is trading mixed Friday morning, with the Nasdaq-100 dropping around 0.25% midday.\nTrending: An EA Co-Founder Shapes This VC Backed Marketplace— Now You Can Invest in Gaming's Next Big Platform\n\nTechnical Analysis Microsoft stock is currently trading 2.5% below its 20-day simple moving average (SMA) and 5.1% below its 100-day SMA, indicating some short-term weakness. Over the past 12 months, shares have increased approximately 13.01%, and they are currently positioned closer to their 52-week lows than highs.\nThe RSI is at a neutral level, suggesting that the stock is neither overbought nor oversold at this time. Meanwhile, MACD is below its signal line, indicating bearish pressure on the stock.\n\nThe combination of neutral RSI and bearish MACD suggests mixed momentum.\nKey Resistance : $489.50\nKey Support : $471.00\nEarnings & Analyst Outlook Investors are looking ahead to the next earnings report on January 28.\nEPS Estimate : $3.96\nRevenue Estimate : $80.27 billion\nValuation : P/E of 34.4x (Indicates premium valuation)\nSee Also: If there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it ?\n\nAnalyst Consensus & Recent Actions The stock carries a Buy Rating with an average price target of $631.94 . Recent analyst moves include:\n\nStory Continues\nWedbush : Outperform (Target $625.00)\nDA Davidson : Buy (Target $650.00)\nRothschild & Co : Upgraded to Neutral (Lowered Target to $500.00)\nValuation Insight: While the stock trades at a premium P/E multiple, the strong consensus and 20% expected earnings growth suggest analysts view this growth as justification for the 34% upside to analyst targets.\n\nTop ETF Exposure Fidelity Nasdaq Composite Index ETF (NASDAQ: ONEQ ): 9.54% Weight\niShares Global 100 ETF (NYSE: IOO ): 9.94% Weight\nXtrackers S&P 500 Scored & Screened ETF (NYSE: SNPE ): 9.60% Weight\nSignificance: Because MSFT carries such a heavy weight in these funds, any significant inflows or outflows for these ETFs will likely force automatic buying or selling of the stock.\n\nRead Next: Missed the AI Boom's Biggest IPOs? This Platform Lets Everyday Investors Access Private Tech Early\nImage: Shutterstock\nUNLOCKED: 5 NEW TRADES EVERY WEEK. Click now to get top trade ideas daily , plus unlimited access to cutting-edge tools and strategies to gain an edge in the markets.\nGet the latest stock analysis from Benzinga:\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Microsoft (MSFT) Stock Moves Lower As Investors Assess Its AI Edge Against Google originally appeared on Benzinga.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "GOOG",
      "Date": "2026-01-04",
      "Time": "19:46:36",
      "Source": "Benzinga",
      "Title": "Microsoft (MSFT) Stock Moves Lower As Investors Assess Its AI Edge Against Google",
      "URL": "https://finance.yahoo.com/news/microsoft-msft-stock-moves-lower-114636146.html",
      "Content": "Microsoft (MSFT) Stock Moves Lower As Investors Assess Its AI Edge Against Google\n\nHenry Khederian\nSun, January 4, 2026 at 3:46 AM PST 3 min read\n\nIn this article: MSFT\n\nGOOG\n\n^GSPC\n\nMETA\n\nAMZN\n\nMicrosoft Corp (NASDAQ: MSFT ) shares are down Friday morning as the investors continue to weigh its competitive position in the AI space. This decline comes amid the S&P 500 and Nasdaq-100 trading flat to start 2026.\nAnalyst Touts Azure's Gains, Flag Risks For Google's Model On Wednesday, John Freeman , co-founder and senior analyst at Ravenswood Partners , discussed the potential impact of Microsoft's Azure on Alphabet Inc’s (NASDAQ: GOOGL ) AI business, suggesting that Google's traditional revenue model could be at risk due to advancements in AI. The analyst highlighted that Microsoft's Azure is positioned as a leading AI cloud provider, which could significantly influence future growth.\n\nDon't Miss:\nThe AI Marketing Platform Backed by Insiders from Google, Meta, and Amazon — Invest at $0.85/Share\nMissed Tesla? EnergyX Is Tackling the Next $200 Billion Opportunity — Lithium\nFreeman pointed out that Microsoft's investments in AI infrastructure, including a $19 billion CAD commitment in Canada, are expected to enhance its data center capacity and digital sovereignty.\nThis strategic move is seen as a way to bolster its competitive edge against Google, which may face challenges in maintaining its revenue streams as AI technologies evolve.\nThe broader market is trading mixed Friday morning, with the Nasdaq-100 dropping around 0.25% midday.\nTrending: An EA Co-Founder Shapes This VC Backed Marketplace— Now You Can Invest in Gaming's Next Big Platform\n\nTechnical Analysis Microsoft stock is currently trading 2.5% below its 20-day simple moving average (SMA) and 5.1% below its 100-day SMA, indicating some short-term weakness. Over the past 12 months, shares have increased approximately 13.01%, and they are currently positioned closer to their 52-week lows than highs.\nThe RSI is at a neutral level, suggesting that the stock is neither overbought nor oversold at this time. Meanwhile, MACD is below its signal line, indicating bearish pressure on the stock.\n\nThe combination of neutral RSI and bearish MACD suggests mixed momentum.\nKey Resistance : $489.50\nKey Support : $471.00\nEarnings & Analyst Outlook Investors are looking ahead to the next earnings report on January 28.\nEPS Estimate : $3.96\nRevenue Estimate : $80.27 billion\nValuation : P/E of 34.4x (Indicates premium valuation)\nSee Also: If there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it ?\n\nAnalyst Consensus & Recent Actions The stock carries a Buy Rating with an average price target of $631.94 . Recent analyst moves include:\n\nStory continues\nWedbush : Outperform (Target $625.00)\nDA Davidson : Buy (Target $650.00)\nRothschild & Co : Upgraded to Neutral (Lowered Target to $500.00)\nValuation Insight: While the stock trades at a premium P/E multiple, the strong consensus and 20% expected earnings growth suggest analysts view this growth as justification for the 34% upside to analyst targets.\n\nTop ETF Exposure Fidelity Nasdaq Composite Index ETF (NASDAQ: ONEQ ): 9.54% Weight\niShares Global 100 ETF (NYSE: IOO ): 9.94% Weight\nXtrackers S&P 500 Scored & Screened ETF (NYSE: SNPE ): 9.60% Weight\nSignificance: Because MSFT carries such a heavy weight in these funds, any significant inflows or outflows for these ETFs will likely force automatic buying or selling of the stock.\n\nRead Next: Missed the AI Boom's Biggest IPOs? This Platform Lets Everyday Investors Access Private Tech Early\nImage: Shutterstock\nUNLOCKED: 5 NEW TRADES EVERY WEEK. Click now to get top trade ideas daily , plus unlimited access to cutting-edge tools and strategies to gain an edge in the markets.\nGet the latest stock analysis from Benzinga:\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Microsoft (MSFT) Stock Moves Lower As Investors Assess Its AI Edge Against Google originally appeared on Benzinga.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AMZN",
      "Date": "2026-01-04",
      "Time": "14:33:00",
      "Source": "Motley Fool",
      "Title": "Is This a Rare Buying Opportunity for Amazon Stock?",
      "URL": "https://finance.yahoo.com/m/cf9f079e-2b97-3c4f-95f0-d8ad8feb74c7/is-this-a-rare-buying.html",
      "Content": "Is This a Rare Buying Opportunity for Amazon Stock?\n\nMarc Guberti, The Motley Fool\nSat, January 3, 2026 at 10:33 PM PST 4 min read\n\nIn this article: AMZN\n\nMETA\n\nGOOG\n\nKey Points Amazon has multiple high-growth business segments, despite low stock returns in 2025.\nThis mismatch presents a buying opportunity, especially as Amazon continues to harness artificial intelligence.\nAmazon's online ads are boosting margins while catching up to Meta Platforms and Alphabet.\n10 stocks we like better than Amazon ›\n\nAmazon (NASDAQ: AMZN) has been a reliable long-term performer, but the growth stock didn't have a spectacular 2025. The growth stock only gained 5% despite strong financial results throughout the year, and this mismatch makes Amazon look promising.\nIt has made great strides in e-commerce, online advertising, cloud computing, and artificial intelligence (AI), four industries that are poised for long-term growth. That's enough to warrant a closer look, and when you dig into recent results, Amazon's stock seems undervalued at current levels.\nOnline ads can boost margins Amazon's margins have received a massive boost in recent years as its business diversifies beyond online retail. While Amazon Web Services has taken center stage in the company's long-term plans, investors should also consider the growth in Amazon's online advertising segment.\nThat part of the business was up by 24% year over year in Q3, reaching $17.7 billion. Although ad revenue is a little less than 10% of Amazon's total revenue, it is a high-margin business. Amazon is also competing with tech giants Meta Platforms (NASDAQ: META) and Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) with online ads. Meta Platforms earned $51.2 billion in Q3, while Alphabet brought in $65.9 billion from ads.\n\nAmazon's ad business is catching up to the two adtech leaders. It's still growing at a great pace despite the one-year stock gains not reflecting that.\nArtificial intelligence enables multiple tailwinds While some AI stocks are speculative, Amazon is already making money with this technology. Amazon Web Services revenue growth has accelerated and achieved a 20% year-over-year growth rate, returning to 2022 growth levels, according to Amazon CEO Andy Jassy.\nArtificial intelligence requires more cloud computing, and that has resulted in more companies turning to Amazon Web Services. Amazon's cloud platform also lets businesses build AI agents.\n\nAmazon is also using internal Trainium2 chips to power parts of its cloud platform. Trainium2 AI chips can reduce Amazon's chip costs, making it easier for the company to expand its AI presence. These same AI chips are generating strong demand and can become another valuable segment under Amazon's corporate umbrella. For instance, Trainium2 AI chips grew by 150% sequentially and are now a multibillion-dollar business.\n\nStory Continues\nAmazon is also using AI to enhance its offerings, such as its online marketplace. AI lets Amazon present personalized product recommendations and display ads that are more likely to get clicks.\nThe tech giant's stock price movements over the past year do not reflect the quality of the business. Amazon's overall revenue increased by 13% year-over-year in Q3, while net income rose by 38% year-over-year. Both of those rates are higher than the stock's one-year return, which may set the stage for a 2026 rally.\n\nShould you buy stock in Amazon right now? Before you buy stock in Amazon, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Amazon wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $490,703 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,157,689 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 966 % — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of January 4, 2026.\nMarc Guberti has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, and Meta Platforms. The Motley Fool has a disclosure policy .\nIs This a Rare Buying Opportunity for Amazon Stock? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-01-04",
      "Time": "11:30:19",
      "Source": "Benzinga",
      "Title": "Perplexity CEO Says On-Device AI Threatens Data Centers As Industry Faces '$10 Trillion Question' — Apple, Qualcomm Positioned To Benefit",
      "URL": "https://finance.yahoo.com/news/perplexity-ceo-says-device-ai-033019227.html",
      "Content": "Perplexity CEO Says On-Device AI Threatens Data Centers As Industry Faces '$10 Trillion Question' — Apple, Qualcomm Positioned To Benefit\n\nMohd Haider\nSat, January 3, 2026 at 7:30 PM PST 3 min read\n\nIn this article: AAPL\n\nQCOM\n\nNVDA\n\nPEAI.PVT\n\nHPQ\n\nAravind Srinivas , CEO of Perplexity AI , which is backed by Jeff Bezos and Nvidia Corp. (NASDAQ: NVDA ), issued a contrarian warning about the future of artificial intelligence, saying on-device intelligence running on personal devices could disrupt the centralized data center model driving massive infrastructure investments.\n\nLocalized AI Could Upend Data Center Industry “The biggest threat to a data center is if the intelligence can be packed locally on a chip that’s running on the device and then there’s no need to inference all of it on like one centralized data center,” Srinivas said in a podcast interview with Prakhar Gupta released last week.\nSrinivas, who has previously worked at OpenAI , Google Brain , and DeepMind , said that AI running directly on personal devices could reduce the need for centralized data centers .\n\nDon't Miss:\nThe AI Marketing Platform Backed by Insiders from Google, Meta, and Amazon — Invest at $0.85/Share\nMissed Tesla? EnergyX Is Tackling the Next $200 Billion Opportunity — Lithium\n“That really disrupts the whole data center industry like it doesn’t make sense to spend all this money $500 billion, $5 trillion whatever on building all the centralized data centers across the world,” he said, calling it a “$10 trillion question, hundred trillion dollar question.”\nHe also highlighted scenarios where AI running locally could learn from repeated tasks on individual devices, adapting over time and automating user activities.\n“It adapts to you and over time starts automating a lot of the things you do. That way you don’t have to repeat it. That’s your intelligence. You own it. It’s your brain,” Srinivas said.\n\nTrending: 7 Million Gamers Already Trust Gameflip With Their Digital Assets — Now You Can Own a Stake in the Platform\nChip Companies and OEMs Positioned to Benefit Apple Inc. (NASDAQ: AAPL ) has “a massive advantage” due to its M1 chips and power-efficient devices, according to Srinivas. Qualcomm Inc. (NASDAQ: QCOM ) and original equipment manufacturers, including Apple, Samsung (OTC: SSNLF ), Lenovo (OTC: LNVGF ), and HP Inc. (NYSE: HPQ ) could also benefit from distributing AI-enabled devices.\n\nHowever, technical barriers remain. Srinivas noted that no AI model has yet been released that can run efficiently on a local chip while completing tasks reliably.\nThe Indian-born entrepreneur expects early adoption on MacBooks or iPads before reaching smartphones.\nImplications For Robotics And Labor He also discussed the potential for AI in the physical world, especially in robotics. Srinivas said AI could transform the labor market by automating many tasks now done by humans, echoing concerns raised by Geoffrey Hinton who is often called the ‘Godfather of AI’.\n\nStory Continues\nSee Also: If there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it ?\nIndustry Risks The U.S. economy is becoming increasingly reliant on AI, raising concerns about a potential AI bubble. If such a bubble bursts, centralized data centers could become a “ single point of failure ,” with widespread economic repercussions.\nSrinivas’s caution highlights a crucial question for the AI and tech industries: will centralized data centers continue to be the foundation of the digital economy as AI becomes more dispersed, or will intelligence on personal devices radically transform the sector?\n\nRead Next: Missed the AI Boom's Biggest IPOs? This Platform Lets Everyday Investors Access Private Tech Early\nPhoto courtesy: Shutterstock\nUp Next: Transform your trading with Benzinga Edge's one-of-a-kind market trade ideas and tools. Click now to access unique insights that can set you ahead in today's competitive market.\nGet the latest stock analysis from Benzinga:\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Perplexity CEO Says On-Device AI Threatens Data Centers As Industry Faces '$10 Trillion Question' — Apple, Qualcomm Positioned To Benefit originally appeared on Benzinga.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AAPL",
      "Date": "2026-01-04",
      "Time": "11:30:19",
      "Source": "Benzinga",
      "Title": "Perplexity CEO Says On-Device AI Threatens Data Centers As Industry Faces '$10 Trillion Question' — Apple, Qualcomm Positioned To Benefit",
      "URL": "https://finance.yahoo.com/news/perplexity-ceo-says-device-ai-033019227.html",
      "Content": "Perplexity CEO Says On-Device AI Threatens Data Centers As Industry Faces '$10 Trillion Question' — Apple, Qualcomm Positioned To Benefit\n\nMohd Haider\nSat, January 3, 2026 at 7:30 PM PST 3 min read\n\nIn this article: AAPL\n\nQCOM\n\nNVDA\n\nPEAI.PVT\n\nHPQ\n\nAravind Srinivas , CEO of Perplexity AI , which is backed by Jeff Bezos and Nvidia Corp. (NASDAQ: NVDA ), issued a contrarian warning about the future of artificial intelligence, saying on-device intelligence running on personal devices could disrupt the centralized data center model driving massive infrastructure investments.\n\nLocalized AI Could Upend Data Center Industry “The biggest threat to a data center is if the intelligence can be packed locally on a chip that’s running on the device and then there’s no need to inference all of it on like one centralized data center,” Srinivas said in a podcast interview with Prakhar Gupta released last week.\nSrinivas, who has previously worked at OpenAI , Google Brain , and DeepMind , said that AI running directly on personal devices could reduce the need for centralized data centers .\n\nDon't Miss:\nThe AI Marketing Platform Backed by Insiders from Google, Meta, and Amazon — Invest at $0.85/Share\nMissed Tesla? EnergyX Is Tackling the Next $200 Billion Opportunity — Lithium\n“That really disrupts the whole data center industry like it doesn’t make sense to spend all this money $500 billion, $5 trillion whatever on building all the centralized data centers across the world,” he said, calling it a “$10 trillion question, hundred trillion dollar question.”\nHe also highlighted scenarios where AI running locally could learn from repeated tasks on individual devices, adapting over time and automating user activities.\n“It adapts to you and over time starts automating a lot of the things you do. That way you don’t have to repeat it. That’s your intelligence. You own it. It’s your brain,” Srinivas said.\n\nTrending: 7 Million Gamers Already Trust Gameflip With Their Digital Assets — Now You Can Own a Stake in the Platform\nChip Companies and OEMs Positioned to Benefit Apple Inc. (NASDAQ: AAPL ) has “a massive advantage” due to its M1 chips and power-efficient devices, according to Srinivas. Qualcomm Inc. (NASDAQ: QCOM ) and original equipment manufacturers, including Apple, Samsung (OTC: SSNLF ), Lenovo (OTC: LNVGF ), and HP Inc. (NYSE: HPQ ) could also benefit from distributing AI-enabled devices.\n\nHowever, technical barriers remain. Srinivas noted that no AI model has yet been released that can run efficiently on a local chip while completing tasks reliably.\nThe Indian-born entrepreneur expects early adoption on MacBooks or iPads before reaching smartphones.\nImplications For Robotics And Labor He also discussed the potential for AI in the physical world, especially in robotics. Srinivas said AI could transform the labor market by automating many tasks now done by humans, echoing concerns raised by Geoffrey Hinton who is often called the ‘Godfather of AI’.\n\nStory Continues\nSee Also: If there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it ?\nIndustry Risks The U.S. economy is becoming increasingly reliant on AI, raising concerns about a potential AI bubble. If such a bubble bursts, centralized data centers could become a “ single point of failure ,” with widespread economic repercussions.\nSrinivas’s caution highlights a crucial question for the AI and tech industries: will centralized data centers continue to be the foundation of the digital economy as AI becomes more dispersed, or will intelligence on personal devices radically transform the sector?\n\nRead Next: Missed the AI Boom's Biggest IPOs? This Platform Lets Everyday Investors Access Private Tech Early\nPhoto courtesy: Shutterstock\nUp Next: Transform your trading with Benzinga Edge's one-of-a-kind market trade ideas and tools. Click now to access unique insights that can set you ahead in today's competitive market.\nGet the latest stock analysis from Benzinga:\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Perplexity CEO Says On-Device AI Threatens Data Centers As Industry Faces '$10 Trillion Question' — Apple, Qualcomm Positioned To Benefit originally appeared on Benzinga.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "TSM",
      "Date": "2026-01-04",
      "Time": "10:31:17",
      "Source": "Benzinga",
      "Title": "TSMC Secures One-Year US Export License To Keep China Chip Operations Running: Report",
      "URL": "https://finance.yahoo.com/news/tsmc-secures-one-us-export-023117235.html",
      "Content": "TSMC Secures One-Year US Export License To Keep China Chip Operations Running: Report\n\nAnanya Gairola\nSat, January 3, 2026 at 6:31 PM PST 2 min read\n\nIn this article: TSM\n\nTaiwan Semiconductor Manufacturing Co. (NYSE: TSM ) has secured a one-year U.S. export license allowing it to import the U.S. chipmaking equipment into its China operations.\nUS Grants Annual License For TSMC's China Operations On Thursday, TSMC said the U.S. Department of Commerce has approved an annual export license covering its Nanjing fabrication plant, reported Reuters.\nThis allows U.S.-controlled equipment to be supplied without requiring separate approvals from individual vendors.\nThe company told the publication that the license will help maintain uninterrupted manufacturing operations and ensure timely product deliveries.\n\nDon't Miss:\nMissed Nvidia and Tesla? RAD Intel Could Be the Next AI Powerhouse — Just $0.85 a Share\nGM-Backed EnergyX Is Solving the Lithium Supply Crisis — Invest Before They Scale Global Production\nPolicy Shift Follows Expiry Of Longstanding Exemptions The approval comes after Washington allowed special exemptions — known as validated end-user status — for select foreign chipmakers operating in China to expire at the end of December.\nUnder the new framework, companies must apply for export licenses regularly rather than rely on broad, open-ended waivers.\n\nSouth Korea's Samsung Electronics Co. Ltd. (OTC: SSNLF ) and SK Hynix have also received similar licenses.\nFocus Remains On Limiting Advanced Chip Capabilities TSMC's Nanjing facility produces 16-nanometer and other mature-node chips, not the company's most advanced semiconductors. TSMC also operates a separate chip plant in Shanghai.\nSee Also: An EA Co-Founder Shapes This VC Backed Marketplace— Now You Can Invest in Gaming's Next Big Platform\nU.S. export controls are designed to curb China's access to advanced semiconductor technology while minimizing disruption to global supply chains and allied firms.\n\nLimited Financial Impact For TSMC In its 2024 annual report, TSMC said its Nanjing operations accounted for about 2.4% of total revenue.\nMeanwhile, TSMC has come under investor scrutiny after a magnitude 7.0 earthquake off northeastern Taiwan triggered precautionary measures at several of its facilities, raising concerns about potential production disruptions.\n\nThe $1.28 trillion chip giant has gained more than 46% over the past year, buoyed by strong demand driven by its role as a major supplier to Nvidia Corp. (NASDAQ: NVDA ) and Apple Inc. (NASDAQ: AAPL ).\nRead Next:\nIf there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it ?\nSam Altman Says AI Will Transform the Economy — This Platform Lets Investors Back Private Tech Early\n\nStory Continues\nPhoto courtesy: Jack Hong via Shutterstock\nUNLOCKED: 5 NEW TRADES EVERY WEEK. Click now to get top trade ideas daily , plus unlimited access to cutting-edge tools and strategies to gain an edge in the markets.\nGet the latest stock analysis from Benzinga:\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article TSMC Secures One-Year US Export License To Keep China Chip Operations Running: Report originally appeared on Benzinga.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AAPL",
      "Date": "2026-01-04",
      "Time": "04:38:48",
      "Source": "Motley Fool",
      "Title": "Apple CEO Tim Cook Just Loaded Up on Nike Stock. Should You?",
      "URL": "https://finance.yahoo.com/m/9c2d489d-6cc6-307a-8cbf-de8e5af92c59/apple-ceo-tim-cook-just.html",
      "Content": "Apple CEO Tim Cook Just Loaded Up on Nike Stock. Should You?\n\nDaniel Sparks, The Motley Fool\nSat, January 3, 2026 at 12:38 PM PST 5 min read\n\nIn this article: NKE\n\nAAPL\n\nKey Points Tim Cook bought 50,000 shares of Nike stock.\nThe Apple CEO is a director on Nike's board.\nNike recently returned to top-line growth, but there are still some major concerns.\n10 stocks we like better than Nike ›\nWhen Apple (NASDAQ: AAPL) CEO Tim Cook purchased 50,000 shares of Nike (NYSE: NKE) in late December, it got a lot of attention and even sent shares of the athletic apparel and shoe company sharply higher. After all, not only is Cook a successful businessman, but he is a Nike insider. The CEO sits on Nike's board of directors.\nInvestors sometimes treat insider buying as a simple signal: management (or board members) think the stock is undervalued. Sometimes that's right. But investors shouldn't follow blindly.\nSo, is Nike stock a good buy today or not? Let's take a look.\nCook's buy matters, but so does the context Notably, Cook's purchase was an open market one. This means it wasn't part of a stock option compensation plan (or a similar plan). Rather, he had to pay full price for his shares. Additionally, the purchase was sizable, totaling nearly $3 million. It also nearly doubled his stake in the company. Given the size of the purchase and the significant increase in Cook's stake, it's not surprising that the market interpreted the purchase as good news.\n\nStill, it's important to remember that Cook is a Nike director.\nThat doesn't mean the purchase is meaningless. But it does mean he may have incentives beyond pure return maximization. Directors often want to demonstrate alignment with shareholders, reinforce confidence during a rough stretch, or meet (or stay ahead of) internal ownership expectations. In other words, it can be both a sincere vote of confidence and a governance-minded move.\nA rough patch Investors should look beyond Cook's purchase to answer this simple question: Does Nike's business momentum (or lack of it) and valuation offer an attractive risk-reward right now?\nUnfortunately, I don't think so.\nNike's turnaround is making progress, but the business still looks challenged.\n\nRevenue in the company's second quarter of fiscal 2026 (a period ended on Nov. 30, 2025), rose just 1% year over year. Further, the composition of this revenue was probably even more discouraging than this anemic headline figure. Yes, wholesale revenue rose 8% year over year, but its higher-margin Nike Direct revenue fell 8%. Nike Direct is the company's direct-to-consumer channel, made up of Nike-owned stores and sales through its digital platforms. So, this channel speaks to the company's brand power with consumers, given how directly these channels are tied to its business and to consumers.\n\nStory Continues\nNike's profitability also moved in the wrong direction. Gross margin fell 300 basis points to 40.6%, and net income declined 32% to $792 million.\nSome of Nike's near-term problems are self-inflicted as it tries to reposition parts of its business and sharpen its product and brand message so that it can perform better over the long term. But Nike still has a lot of work to do.\n\n\"NIKE is in the middle innings of our comeback,\" said Nike CEO Elliott Hill in the company's latest earnings release, adding that the company is working through its \"Win Now\" strategic actions, including \"strengthening partner relationships\" and \"rebalancing our portfolio...\"\nMeanwhile, the athleisure space remains intensely competitive , as the company faces major competition from younger brands like Lululemon , Vuori, and Hoka, as well as more established brands like Adidas . Of course, Nike's brand still has enormous global equity. But consumers have more choices than ever.\nA look at valuation I'd be more willing to recommend Nike in the middle of its turnaround and an intensely competitive environment, but shares arguably don't look cheap enough. Sure, the company's dividend yield of 2.6% is solid, and Nike has an exceptional balance sheet. But with earnings moving in the wrong direction and sales barely growing, it's tough to justify the stock's price-to-earnings ratio of 37.\n\nEven Nike's forward price-to-earnings is high, at 40. Measuring its price as a multiple of analysts' expected earnings per share over the next year, the fact that Nike's forward price-to-earnings ratio is higher than its trailing price-to-earnings ratio shows that analysts expect earnings to remain under pressure.\nGiven the competitive intensity in athleisure, declining sales in its direct-to-consumer channel, margin pressure, and ongoing uncertainty as far as tariffs go, I personally will be staying on the sidelines.\nCook's buy in Nike stock is interesting. But, for me, that's about all it is.\nShould you buy stock in Nike right now? Before you buy stock in Nike, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nike wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $490,703 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,157,689 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 966 % — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of January 3, 2026.\nDaniel Sparks and his clients have positions in Apple. The Motley Fool has positions in and recommends Apple, Lululemon Athletica Inc., and Nike. The Motley Fool has a disclosure policy .\nApple CEO Tim Cook Just Loaded Up on Nike Stock. Should You? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "TSLA",
      "Date": "2026-01-04",
      "Time": "03:19:04",
      "Source": "Investor's Business Daily",
      "Title": "Tesla Q4 Vehicle Deliveries Fall 16% But Analysts Say It's All About The Robotaxi",
      "URL": "https://finance.yahoo.com/m/2d0cb659-5f6f-3d91-bdce-872cc6472646/tesla-q4-vehicle-deliveries.html",
      "Content": "Tesla Q4 Vehicle Deliveries Fall 16% But Analysts Say It's All About The Robotaxi\n\nKIT NORTON\nSat, January 3, 2026 at 11:19 AM PST 5 min read\n\nIn this article: TSLA\n\nTesla delivered 418,227 electric vehicles in the fourth quarter, down 15.6% from 495,570 in Q4 2024. TSLA shares angled higher early before falling in Friday' stock market. The EV giant reported Friday that fourth-quarter deliveries included 406,585 Model 3 and Model Y EVs, as well as 11,642 \"other\" vehicles, which include the Model S, Model X and Cybertruck.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "TSM",
      "Date": "2026-01-03",
      "Time": "23:10:24",
      "Source": "24/7 Wall St.",
      "Title": "Here’s Why Taiwan Semiconductor Manufacturing Holds the Keys to AI’s Explosive Growth",
      "URL": "https://finance.yahoo.com/m/e1169e67-2524-3ccc-b665-107561426dfe/here%E2%80%99s-why-taiwan.html",
      "Content": "Here’s Why Taiwan Semiconductor Manufacturing Holds the Keys to AI’s Explosive Growth\n\nRich Duprey\nSat, January 3, 2026 at 7:10 AM PST 5 min read\n\nIn this article: TSM\n\nTSMWF\n\nGOOG\n\nNVDA\n\nQuick Read Taiwan Semiconductor Manufacturing ( TSM ) controls advanced packaging capacity that determines which AI chipmakers can scale production.\nGoogle reportedly cut its 2026 TPU production target from 4 million to 3 million units due to limited access to Taiwan Semiconductor’s CoWoS packaging.\nNvidia secured over half of Taiwan Semiconductor’s CoWoS capacity through 2027.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Ticker": "SWKS",
      "Date": "2026-01-03",
      "Time": "21:46:14",
      "Source": "Simply Wall St.",
      "Title": "Should You Think About Buying Skyworks Solutions, Inc. (NASDAQ:SWKS) Now?",
      "URL": "https://finance.yahoo.com/news/think-buying-skyworks-solutions-inc-134614460.html",
      "Content": "Should You Think About Buying Skyworks Solutions, Inc. (NASDAQ:SWKS) Now?\n\nSimply Wall St\nSat, January 3, 2026 at 5:46 AM PST 3 min read\n\nIn this article: SWKS\n\nSkyworks Solutions, Inc. ( NASDAQ:SWKS ), might not be a large cap stock, but it saw significant share price movement during recent months on the NASDAQGS, rising to highs of US$80.66 and falling to the lows of US$60.50. Some share price movements can give investors a better opportunity to enter into the stock, and potentially buy at a lower price. A question to answer is whether Skyworks Solutions' current trading price of US$64.40 reflective of the actual value of the mid-cap? Or is it currently undervalued, providing us with the opportunity to buy? Let’s take a look at Skyworks Solutions’s outlook and value based on the most recent financial data to see if there are any catalysts for a price change.\n\nThis technology could replace computers: discover the 20 stocks are working to make quantum computing a reality.\nWhat Is Skyworks Solutions Worth? The stock seems fairly valued at the moment according to our valuation model. It’s trading around 18% below our intrinsic value, which means if you buy Skyworks Solutions today, you’d be paying a reasonable price for it. And if you believe the company’s true value is $78.52, then there’s not much of an upside to gain from mispricing. So, is there another chance to buy low in the future? Given that Skyworks Solutions’s share is fairly volatile (i.e. its price movements are magnified relative to the rest of the market) this could mean the price can sink lower, giving us an opportunity to buy later on. This is based on its high beta, which is a good indicator for share price volatility.\n\nSee our latest analysis for Skyworks Solutions\nWhat kind of growth will Skyworks Solutions generate? Investors looking for growth in their portfolio may want to consider the prospects of a company before buying its shares. Although value investors would argue that it’s the intrinsic value relative to the price that matter the most, a more compelling investment thesis would be high growth potential at a cheap price. Skyworks Solutions' earnings over the next few years are expected to increase by 32%, indicating a highly optimistic future ahead. This should lead to more robust cash flows, feeding into a higher share value.\n\nWhat This Means For You Are you a shareholder? SWKS’s optimistic future growth appears to have been factored into the current share price, with shares trading around its fair value. However, there are also other important factors which we haven’t considered today, such as the financial strength of the company. Have these factors changed since the last time you looked at the stock? Will you have enough confidence to invest in the company should the price drop below its fair value?\n\nStory Continues\nAre you a potential investor? If you’ve been keeping tabs on SWKS, now may not be the most optimal time to buy, given it is trading around its fair value. However, the optimistic prospect is encouraging for the company, which means it’s worth diving deeper into other factors such as the strength of its balance sheet, in order to take advantage of the next price drop.\n\nWith this in mind, we wouldn't consider investing in a stock unless we had a thorough understanding of the risks. In terms of investment risks, we've identified 1 warning sign with Skyworks Solutions , and understanding this should be part of your investment process.\nIf you are no longer interested in Skyworks Solutions, you can use our free platform to see our list of over 50 other stocks with a high growth potential.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "INTC",
      "Date": "2026-01-03",
      "Time": "20:04:01",
      "Source": "Insider Monkey",
      "Title": "Intel (INTC) Draws Strategic Nvidia Investment as Chip Testing Plans Shift",
      "URL": "https://finance.yahoo.com/news/intel-intc-draws-strategic-nvidia-120401205.html",
      "Content": "Intel (INTC) Draws Strategic Nvidia Investment as Chip Testing Plans Shift\n\nGhazal Ahmed\nSat, January 3, 2026 at 4:04 AM PST 1 min read\n\nIn this article: INTC\n\nNVDA\n\nTSM\n\nIntel Corporation (NASDAQ: INTC ) is one of the Best AI Stocks to Buy under $50 . On December 29, Reuters reported that Nvidia has purchased Intel shares worth $5 billion, carrying out a transaction ‌announced in September.\nThe AI chipmaker had announced back then that it would pay $23.28 per share for Intel ⁠common stock, buying over 214.7 million Intel shares at the price set out in the agreement, as per Monday's filing. The deal forms part of a broader strategic agreement to co-develop chips for data centers and personal computers.\nThe share purchase comes just a week after Reuters reported that Nvidia Corp. has halted a test to use Intel’s advanced 18A manufacturing process to make advanced chips. The AI chipmaker tested the so-called 18A process but stopped moving forward, the report said.\nInvestors had been closely watching Intel's advanced 18A as a milestone that could help the company compete more directly with Taiwan Semiconductor Manufacturing Company in advanced chip manufacturing. However, the halt now raises concerns about the company’s ability to regain ground in the foundry race.\n\nIntel Corporation (NASDAQ:INTC) designs, manufactures, and sells computer products and technologies, delivering data storage, computer, networking, and communications platforms.\nWhile we acknowledge the potential of INTC as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 10 Trending AI Stocks on Wall Street and 10 AI Stocks Investors Are Watching\nDisclosure: None.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AAPL",
      "Date": "2026-01-03",
      "Time": "20:00:18",
      "Source": "Simply Wall St.",
      "Title": "Apple's (NASDAQ:AAPL) investors will be pleased with their solid 112% return over the last three years",
      "URL": "https://finance.yahoo.com/news/apples-nasdaq-aapl-investors-pleased-120018791.html",
      "Content": "Apple's (NASDAQ:AAPL) investors will be pleased with their solid 112% return over the last three years\n\nSimply Wall St\nSat, January 3, 2026 at 4:00 AM PST 3 min read\n\nIn this article: AAPL\n\nThe most you can lose on any stock (assuming you don't use leverage) is 100% of your money. But if you buy shares in a really great company, you can more than double your money. For example, the Apple Inc. ( NASDAQ:AAPL ) share price has soared 109% in the last three years. How nice for those who held the stock!\n\nSo let's assess the underlying fundamentals over the last 3 years and see if they've moved in lock-step with shareholder returns.\nWe've found 21 US stocks that are forecast to pay a dividend yield of over 6% next year. See the full list for free.\nWhile markets are a powerful pricing mechanism, share prices reflect investor sentiment, not just underlying business performance. By comparing earnings per share (EPS) and share price changes over time, we can get a feel for how investor attitudes to a company have morphed over time.\nDuring three years of share price growth, Apple achieved compound earnings per share growth of 7.2% per year. This EPS growth is lower than the 28% average annual increase in the share price. So it's fair to assume the market has a higher opinion of the business than it did three years ago. It is quite common to see investors become enamoured with a business, after a few years of solid progress.\nYou can see below how EPS has changed over time (discover the exact values by clicking on the image).\nWe know that Apple has improved its bottom line lately, but is it going to grow revenue? Check if analysts think Apple will grow revenue in the future.\nWhat About Dividends? When looking at investment returns, it is important to consider the difference between total shareholder return (TSR) and share price return . The TSR is a return calculation that accounts for the value of cash dividends (assuming that any dividend received was reinvested) and the calculated value of any discounted capital raisings and spin-offs. Arguably, the TSR gives a more comprehensive picture of the return generated by a stock. In the case of Apple, it has a TSR of 112% for the last 3 years. That exceeds its share price return that we previously mentioned. The dividends paid by the company have thusly boosted the total shareholder return.\n\nA Different Perspective Apple shareholders are up 12% for the year (even including dividends). But that was short of the market average. On the bright side, the longer term returns (running at about 16% a year, over half a decade) look better. Maybe the share price is just taking a breather while the business executes on its growth strategy. While it is well worth considering the different impacts that market conditions can have on the share price, there are other factors that are even more important. Consider risks, for instance. Every company has them, and we've spotted 2 warning signs for Apple you should know about.\n\nStory Continues\nFor those who like to find winning investments this free list of undervalued companies with recent insider purchasing, could be just the ticket.\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "KLAC",
      "Date": "2026-01-03",
      "Time": "08:31:42",
      "Source": "Insider Monkey",
      "Title": "Strong AI Tailwinds Lift KLAC Despite Ongoing China Export Risks",
      "URL": "https://finance.yahoo.com/news/strong-ai-tailwinds-lift-klac-003142011.html",
      "Content": "Strong AI Tailwinds Lift KLAC Despite Ongoing China Export Risks\n\nVardah Gill\nFri, January 2, 2026 at 4:31 PM PST 2 min read\n\nIn this article: KLAC\n\nKLA Corporation (NASDAQ: KLAC ) is included among the 20 Best Performing Dividend Stocks in 2025 .\nPhoto by Dan Dennis on Unsplash\nKLA Corporation (NASDAQ:KLAC) is up nearly 97% since the start of 2025. Analyst sentiment has followed that move. Jefferies upgraded the shares to Buy and lifted its price target to $1,500. Oppenheimer kept an Outperform rating and set a $1,400 target. Those calls helped reinforce momentum and pushed investor confidence higher.\n\nThe broader backdrop has also helped. SEMI expects semiconductor equipment sales to hit a record in 2025, driven largely by AI-related investment. Those macro tailwinds fueled a rally across the sector, lifting many equipment names at the same time.\nEarlier in October, KLA Corporation (NASDAQ:KLAC) forecast second-quarter revenue above Wall Street estimates. Management pointed to strong AI-linked demand for its chipmaking tools, while also calling out growing risks tied to its China exposure amid ongoing US–China trade tensions.\nDemand for advanced chips that support generative AI workloads has continued to climb. That trend benefits niche suppliers like KLA, whose equipment is used inside semiconductor manufacturing facilities, commonly known as fabs.\n\nTrade policy remains a clear headwind. KLA expects US export restrictions to reduce sales by $300M to $350M over the next five quarters. The company said this reflects “additional market access loss related to certain customers in China resulting from extended export controls from the U.S. government,” according to a letter to shareholders.\nKLA Corporation (NASDAQ:KLAC) is based in Milpitas, California. The company designs wafer fab equipment and supplies process control and yield management systems used across the semiconductor industry.\nWhile we acknowledge the potential of KLAC as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 14 Best Pharma Dividend Stocks to Buy in 2026 and 14 Best Dividend Aristocrats to Invest in Heading into 2026 .\nDisclosure: None.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AMD",
      "Date": "2026-01-03",
      "Time": "07:07:00",
      "Source": "TheStreet",
      "Title": "Nvidia, AMD in focus ahead of key event",
      "URL": "https://finance.yahoo.com/m/41695bd7-ee27-36be-a002-40f17e5366a9/nvidia%2C-amd-in-focus-ahead-of.html",
      "Content": "Nvidia, AMD in focus ahead of key event\n\nMoz Farooque\nFri, January 2, 2026 at 3:07 PM PST 4 min read\n\nIn this article: NVDA\n\nAMD\n\n^SOX\n\nAs January gets underway, AI stocks are in for a kicker at the CES event.\nNvidia ( NVDA ) and Advanced Micro Devices ( AMD ) are in the spotlight, with both expected to use the event as a stepping stone to shape the next phase of the AI race.\nHaving covered multiple tech cycles over the past several years, I know that stock markets typically don’t turn on earnings alone.\n\nThey need market-moving catalysts to give the narrative a much-needed kick in the pants.\nAI chip stocks, in particular, have had a rough time of late.\nFor color, the PHLX Semiconductor Index dropped nearly 5% from its December 10 record ( 7,490 ) to its December 31 close ( 7,083 ).\nNevertheless, according to Wedbush Securities , both AI bellwethers are positioned to deliver some of the conference’s most compelling headlines.\nWedbush says Nvidia, AMD expectations at stake for CES 2026 For Nvidia, CEO Jensen Huang will take the stage in his signature leather jacket to reinforce the AI leader's vision around data centers, robotics, and what Wedbush calls the next phase of the AI revolution.\nAMD will have its own moment, with CEO Lisa Su delivering the opening keynote, featuring key updates across PCs, data centers, and edge AI.\n\nWith valuations mostly stretched and expectations running high, the CES event could therefore help set the tone for what’s to come for these AI giants in 2026.\nMore Tech Stocks:\nMorgan Stanley sets jaw-dropping Micron price target after event\nNvidia’s China chip problem isn’t what most investors think\nQuantum Computing makes $110 million move nobody saw coming\nMorgan Stanley drops eye-popping Broadcom price target\nApple analyst sets bold stock target for 2026\nWedbush sees CES as a critical opening act for Nvidia and AMD , as expectations run sky-high.\nWedbush analysts offered further insight.\nAnalysts also expect updates linked to Nvidia’s robust software platforms, including gaming and simulation, underscoring that its AI story extends far beyond hyperscale customers.\n\nFor AMD , Wedbush expects major Ryzen updates and concrete updates around AI PCs, data centers, and edge computing. Moreover, AMD will be looking to build a platform, not just offer alternatives.\nCES 2025 recap: what Nvidia and AMD showed last year That said, here’s the lowdown from last year’s event for both tech giants.\nNvidia showed off its powerful Cosmos platform for “physical AI,” positioning it as a foundation for real-world deployment.\nNvidia introduced Blackwell-based GeForce RTX 50 Series GPUs while highlighting new RTX-PC AI tooling (including NIM microservices/Blueprints).\nAMD rolled out its AI PC portfolio, covering Ryzen AI Max/Max PRO , and expanded Ryzen AI 300 chips tailored to Copilot+ PCs.\nAMD leaned into gaming/graphics with Ryzen X3D desktop chips and Ryzen Z2 handheld processors. Also, it offered previews of the Radeon RX 9070- series (RDNA 4) GPUs and FSR 4.\n\nStory Continues\nAt CES 2026, the real fight is over AI CES 2026 runs January 6 to 9 in Las Vegas , and though it has historically been more of a gadget showcase, this year it’s shaping up to be the year’s first high-stakes tech meeting.\nInvestors expect a needle-moving event, spearheaded by concrete roadmaps, partnerships, and major commitments.\nFor the biggest chipmakers, CES will be all about owning the AI conversation early . Nvidia will seek to reinforce its dominance by rallying partners with demos, keynotes, and industry-wide signaling.\n\nRelated: Cathie Wood shells out $1.3 million on biotech stock\nAMD will look to rain on Nvidia’s parade.\nBy spotlighting new PC platforms and capitalizing on a larger OEM market share , AMD will aim to carve out its own lane for AI-driven growth.\nFor perspective, the AI trade has lost its luster lately, and big-name skepticism targets are growing louder.\nFront and center is the “Big Short” Michael Burry , who is openly comparing the current AI frenzy to past manias.\nBurry delivered a scathing takedown of Nvidia.\nThat’s exactly why Nvidia and AMD will be looking for a strong start to set the tone early in 2026.\nBig banks reset targets on Nvidia and AMD Nvidia and AMD both had a solid outing at the stock market last year.\nFor perspective, Nvidia stock ended 2025 up 41% , while AMD posted an 83% gain .\nNow, Wall Street is recalibrating its expectations for 2026, with investors in “show-me” mode when it comes to AI.\nBank of America : Nvidia buy, $275 price target; AMD buy, $300 price target\nSource: Investing.com\nMorgan Stanley : Nvidia overweight, $250 price target; AMD equal weight, $260 price target\nUBS : Nvidia buy, $235 price target; AMD buy, $300 price target\nGoldman Sachs : Nvidia buy , $250 price target; AMD neutral, $210 price target\nSource: Investing.com\nJPMorgan : Nvidia overweight , $250 price target; AMD neutral, $270 price target\nSource: Barron's\nRelated: Veteran analyst resets AI stock buy list for 2026\nThis story was originally published by TheStreet on Jan 2, 2026, where it first appeared in the Technology section. Add TheStreet as a Preferred Source by clicking here.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "SIMO",
      "Date": "2026-01-03",
      "Time": "07:00:06",
      "Source": "Zacks",
      "Title": "Silicon Motion (SIMO) Exceeds Market Returns: Some Facts to Consider",
      "URL": "https://finance.yahoo.com/news/silicon-motion-simo-exceeds-market-230006158.html",
      "Content": "Silicon Motion (SIMO) Exceeds Market Returns: Some Facts to Consider\n\nZacks Equity Research\nFri, January 2, 2026 at 3:00 PM PST 3 min read\n\nIn this article: SIMO\n\n^GSPC\n\n^DJI\n\n^IXIC\n\nIn the latest trading session, Silicon Motion (SIMO) closed at $93.76, marking a +1.14% move from the previous day. The stock exceeded the S&P 500, which registered a gain of 0.19% for the day. Elsewhere, the Dow saw an upswing of 0.66%, while the tech-heavy Nasdaq depreciated by 0.03%.\nThe chip company's shares have seen an increase of 1.85% over the last month, surpassing the Computer and Technology sector's gain of 0.02% and the S&P 500's gain of 0.54%.\n\nMarket participants will be closely following the financial results of Silicon Motion in its upcoming release. The company's earnings per share (EPS) are projected to be $1.31, reflecting a 43.96% increase from the same quarter last year. Alongside, our most recent consensus estimate is anticipating revenue of $260.55 million, indicating a 36.3% upward movement from the same quarter last year.\nFor the annual period, the Zacks Consensus Estimates anticipate earnings of $3.55 per share and a revenue of $863.29 million, signifying shifts of +3.5% and 0%, respectively, from the last year.\nIt is also important to note the recent changes to analyst estimates for Silicon Motion. These latest adjustments often mirror the shifting dynamics of short-term business patterns. Hence, positive alterations in estimates signify analyst optimism regarding the business and profitability.\n\nEmpirical research indicates that these revisions in estimates have a direct correlation with impending stock price performance. To utilize this, we have created the Zacks Rank, a proprietary model that integrates these estimate changes and provides a functional rating system.\nThe Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has remained steady. Silicon Motion currently has a Zacks Rank of #2 (Buy).\nValuation is also important, so investors should note that Silicon Motion has a Forward P/E ratio of 19 right now. This valuation marks a discount compared to its industry average Forward P/E of 21.6.\n\nOne should further note that SIMO currently holds a PEG ratio of 0.9. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. As the market closed yesterday, the Computer - Integrated Systems industry was having an average PEG ratio of 0.85.\nThe Computer - Integrated Systems industry is part of the Computer and Technology sector. This group has a Zacks Industry Rank of 17, putting it in the top 7% of all 250+ industries.\n\nStory Continues\nThe Zacks Industry Rank assesses the vigor of our specific industry groups by computing the average Zacks Rank of the individual stocks incorporated in the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nTo follow SIMO in the coming trading sessions, be sure to utilize Zacks.com.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nSilicon Motion Technology Corporation (SIMO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "CSCO",
      "Date": "2026-01-03",
      "Time": "06:45:07",
      "Source": "Zacks",
      "Title": "Cisco Systems (CSCO) Stock Slides as Market Rises: Facts to Know Before You Trade",
      "URL": "https://finance.yahoo.com/news/cisco-systems-csco-stock-slides-224507291.html",
      "Content": "Cisco Systems (CSCO) Stock Slides as Market Rises: Facts to Know Before You Trade\n\nZacks Equity Research\nFri, January 2, 2026 at 2:45 PM PST 3 min read\n\nIn this article: CSCO\n\n^GSPC\n\n^DJI\n\n^IXIC\n\nIn the latest trading session, Cisco Systems (CSCO) closed at $76.04, marking a -1.29% move from the previous day. The stock fell short of the S&P 500, which registered a gain of 0.19% for the day. Meanwhile, the Dow gained 0.66%, and the Nasdaq, a tech-heavy index, lost 0.03%.\nShares of the seller of routers, switches, software and services witnessed a loss of 0.94% over the previous month, trailing the performance of the Computer and Technology sector with its gain of 0.02%, and the S&P 500's gain of 0.54%.\n\nThe investment community will be paying close attention to the earnings performance of Cisco Systems in its upcoming release. The company's earnings per share (EPS) are projected to be $1.02, reflecting a 8.51% increase from the same quarter last year. Simultaneously, our latest consensus estimate expects the revenue to be $15.12 billion, showing a 8.06% escalation compared to the year-ago quarter.\nFor the annual period, the Zacks Consensus Estimates anticipate earnings of $4.1 per share and a revenue of $60.59 billion, signifying shifts of +7.61% and +6.95%, respectively, from the last year.\nInvestors should also note any recent changes to analyst estimates for Cisco Systems. These revisions help to show the ever-changing nature of near-term business trends. As a result, upbeat changes in estimates indicate analysts' favorable outlook on the business health and profitability.\n\nOur research shows that these estimate changes are directly correlated with near-term stock prices. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.\nRanging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has witnessed a 0.8% increase. Cisco Systems currently has a Zacks Rank of #3 (Hold).\nInvestors should also note Cisco Systems's current valuation metrics, including its Forward P/E ratio of 18.77. This denotes a premium relative to the industry average Forward P/E of 17.47.\n\nIt's also important to note that CSCO currently trades at a PEG ratio of 2.34. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. By the end of yesterday's trading, the Computer - Networking industry had an average PEG ratio of 1.61.\nThe Computer - Networking industry is part of the Computer and Technology sector. At present, this industry carries a Zacks Industry Rank of 30, placing it within the top 13% of over 250 industries.\n\nStory Continues\nThe Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nRemember to apply Zacks.com to follow these and more stock-moving metrics during the upcoming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nCisco Systems, Inc. (CSCO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AAPL",
      "Date": "2026-01-03",
      "Time": "05:23:30",
      "Source": "Investor's Business Daily",
      "Title": "Apple Stock Initiated At Neutral. Here's Why.",
      "URL": "https://finance.yahoo.com/m/589555f0-f81f-3e59-8789-bdeee505777d/apple-stock-initiated-at.html",
      "Content": "Apple Stock Initiated At Neutral. Here's Why.\n\nPATRICK SEITZ\nFri, January 2, 2026 at 1:23 PM PST 2 min read\n\nIn this article: AAPL\n\nInvestment bank Raymond James on Friday resumed coverage of Apple stock with a market perform, or neutral, rating.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "CSCO",
      "Date": "2026-01-03",
      "Time": "05:11:43",
      "Source": "Insider Monkey",
      "Title": "Cisco Systems, Inc. (CSCO) Draws Mixed Trading Sentiment as Options Activity Remains Balanced",
      "URL": "https://finance.yahoo.com/news/cisco-systems-inc-csco-draws-211143855.html",
      "Content": "Cisco Systems, Inc. (CSCO) Draws Mixed Trading Sentiment as Options Activity Remains Balanced\n\nLaiba Immad\nFri, January 2, 2026 at 1:11 PM PST 2 min read\n\nIn this article: CSCO\n\nWe recently compiled a list of the 10 Best Long-Term Investments for Kids . Cisco Systems, Inc. is placed seventh among the best long-term investments .\nTheFly reported on December 22 that shares of CSCO declined 26 cents to $78.16, reflecting mixed sentiment in the options market. Options volume was roughly in line with the average, with 51,000 contracts traded and calls outpacing puts, resulting in a put/call ratio of 0.77, above the typical level of 0.64.\n\nImplied volatility (IV30) fell 1.28 points to 18.8, placing it in the bottom quartile of the past year and indicating an expected daily move of $0.93. Meanwhile, the flattened put-call skew suggested a modestly bullish tone, pointing to cautious optimism among options traders despite the slight drop in shares.\nKen Wolter / Shutterstock.com\nSeparately, on December 17, Cisco Systems, Inc. (NASDAQ:CSCO) received a boost when Morgan Stanley analyst Meta Marshall maintained an Overweight rating and raised the price target from $82 to $91. In the research note, Marshall highlighted CSCO’s strong performance in AI-related growth drivers, noting that the company had surpassed $1 billion in AI-related orders, reaching $1.3 billion from hyperscale customers. This momentum suggests that AI-driven revenue could contribute around 5% of CSCO’s total business by fiscal year 2026, up from approximately 2% currently.\n\nCisco Systems, Inc. (NASDAQ:CSCO) designs and sells a broad range of technologies across networking, security, collaboration, and applications. The company is currently leveraging its acquisition of Splunk to enhance its recurring software revenue and observability capabilities.\nWhile we acknowledge the potential of CSCO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now . Disclosure: None.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "ADI",
      "Date": "2026-01-03",
      "Time": "05:10:16",
      "Source": "Insider Monkey",
      "Title": "Analog Devices, Inc. (ADI) Balances Analyst Optimism With Insider Share Sale",
      "URL": "https://finance.yahoo.com/news/analog-devices-inc-adi-balances-211016300.html",
      "Content": "Analog Devices, Inc. (ADI) Balances Analyst Optimism With Insider Share Sale\n\nLaiba Immad\nFri, January 2, 2026 at 1:10 PM PST 1 min read\n\nIn this article: ADI\n\nWe recently compiled a list of the 10 Best Long-Term Investments for Kids . Analog Devices, Inc. stands third among the best long-term investments.\nTheFly reported on December 19 that Truist Securities analyst William Stein maintained a Hold rating on ADI while raising the price target to $291 from $258. The update reflects the firm’s latest assessment of the company’s valuation outlook, though the Hold rating indicates a cautious stance on near-term stock movement.\nAdditionally, on December 18, a Form 4 filing with the SEC revealed that Martin Cotter, Senior Vice President of Vertical Business Units at Analog Devices, Inc. (NASDAQ:ADI), sold 5,000 shares of common stock on December 17. The transaction was executed at an average price of $271.19, totaling approximately $1.36 million. Following this sale, Cotter retains direct ownership of 59,664 shares, valued at roughly $16.18 million.\n\nAnalog Devices, Inc. (NASDAQ:ADI) is a global semiconductor leader headquartered in Wilmington, Massachusetts, that designs, manufactures, tests, and markets analog, mixed-signal, and digital signal processing integrated circuits (ICs), software, and subsystems used to bridge the physical and digital worlds.\nWhile we acknowledge the potential of ADI as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now . Disclosure: None.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AMD",
      "Date": "2026-01-03",
      "Time": "05:02:24",
      "Source": "Yahoo Finance Video",
      "Title": "CES 2026: Nvidia, AMD, Intel, & more to make announcements",
      "URL": "https://finance.yahoo.com/video/ces-2026-nvidia-amd-intel-210224074.html",
      "Content": "CES 2026: Nvidia, AMD, Intel, & more to make announcements\n\nYahoo Finance Video\nFri, January 2, 2026 at 1:02 PM PST\n\nIn this video: AMD\n\n005380.KS\n\n005385.KS\n\n005387.KS\n\n005389.KS\n\nThe 2026 Consumer Electronics Show (CES) is coming up next week in Las Vegas.\nYahoo Finance Technology Editor Dan Howley sits down with Yahoo Finance Markets and Data Editor Jared Blikre on Market Domination to explain what investors should expect from the event and from key names like Nvidia ( NVDA ) and AMD ( AMD ).\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination .\n\nVideo Transcript\n\n00:00 Speaker A\nIt is a new year and to kick it off in style, the Consumer Electronics show will be one of the biggest tech conferences. CES is kicking off on January 6th under the bright lights of Las Vegas, and tech editor Dan Howley is here with what to expect. Dan, tell us.\n00:15 Dan Howley\nYeah, Jared, there's going to be a number of big announcements at this year's show. The the first obviously, will probably, and biggest, be out of Nvidia. They're hosting their own press event on January 5th. CEO Jensen Wong will take the stage. He did it last year as well. They announced a number of new products, a new chip for a smaller bitesize desktop AI computer, as well as a number of different software innovations that they've really been pushing as of late. They also brought out their kind of digital army of robots. It was basically a a a video recording uh and then a little tiny robot uh care of Star Wars uh took the stage alongside of him.\n00:54 Dan Howley\nUh outside of Nvidia, we're also expecting to see AMD host their own press event with CEO Lisa Sue. Uh we'll see Intel and Qualcomm both host press events as well related to their respective chips. Uh and then overall, we should see a ton of AI. I mean, you know, the chips themselves are are, you know, obviously enough to say that AI is going to dominate, but uh you can expect to see a lot of robots, uh a lot of smart home devices. You can even see some wearables that are AI powered. And those usually, you know, so far we haven't seen anything too interesting as far as AI powered wearables outside of maybe, you know, the intelligence built into smart glasses or smart watches. There's never been a dedicated device that's really taken off. Open AI is supposedly working on one, don't expect it at CES. Uh and then finally, uh Autos. Autos have been a big part of CES as of late.\n01:54 Dan Howley\nUh they continue to do so and we'll likely see things ranging from flying cars to uh different types of boats. Uh we know that there'll be some major automakers like Hyundai on hand, uh Sony and Honda, their uh Afeela vehicle will be there as well. Uh and so it's going to be a jam-packed show, but again, I think the big takeaway is going to be from Nvidia. They're the the hottest uh company on the market right now and what they're doing in AI as well as AI from the the rest of the companies at the show.\n02:18 Speaker A\nDan, we got about 30 seconds. So I'm just going to ask you real quickly, any surprises over the last few weeks that have jumped into your attention span uh that might kind of give us a hint of what 2026 has in store for us in tech?\n02:32 Dan Howley\nYeah, I mean the the Nvidia Groc uh kind of licensing deal, non-exclusive licensing deal. Uh I think it was estimated $20 billion. That was really interesting and it just kind of shows where Nvidia sees its its future at this point, you know, making these kinds of investments and new types of chip technologies or different types of chip tech chip technologies to really hold on to the lead that it has.\n03:00 Dan Howley\nUh you know, I I think we're going to continue to see these kinds of not necessarily acquisitions, but you know, licensing agreements will hire some executives from a company, uh things along those lines. Uh they really kind of became popular in 2025 and I think we'll continue to see them through 2026. It's a a way for companies to kind of avoid the scrutiny of acquiring a company, taking it over entirely, while still getting some of that knowhow and IP.\n03:22 Speaker A\nAll right, Dan, appreciate it. We'll see you soon.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "INTC",
      "Date": "2026-01-03",
      "Time": "05:02:24",
      "Source": "Yahoo Finance Video",
      "Title": "CES 2026: Nvidia, AMD, Intel, & more to make announcements",
      "URL": "https://finance.yahoo.com/video/ces-2026-nvidia-amd-intel-210224074.html",
      "Content": "CES 2026: Nvidia, AMD, Intel, & more to make announcements\n\nYahoo Finance Video\nFri, January 2, 2026 at 1:02 PM PST\n\nIn this video: AMD\n\n005380.KS\n\n005385.KS\n\n005387.KS\n\n005389.KS\n\nThe 2026 Consumer Electronics Show (CES) is coming up next week in Las Vegas.\nYahoo Finance Technology Editor Dan Howley sits down with Yahoo Finance Markets and Data Editor Jared Blikre on Market Domination to explain what investors should expect from the event and from key names like Nvidia ( NVDA ) and AMD ( AMD ).\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination .\n\nVideo Transcript\n\n00:00 Speaker A\nIt is a new year and to kick it off in style, the Consumer Electronics show will be one of the biggest tech conferences. CES is kicking off on January 6th under the bright lights of Las Vegas, and tech editor Dan Howley is here with what to expect. Dan, tell us.\n00:15 Dan Howley\nYeah, Jared, there's going to be a number of big announcements at this year's show. The the first obviously, will probably, and biggest, be out of Nvidia. They're hosting their own press event on January 5th. CEO Jensen Wong will take the stage. He did it last year as well. They announced a number of new products, a new chip for a smaller bitesize desktop AI computer, as well as a number of different software innovations that they've really been pushing as of late. They also brought out their kind of digital army of robots. It was basically a a a video recording uh and then a little tiny robot uh care of Star Wars uh took the stage alongside of him.\n00:54 Dan Howley\nUh outside of Nvidia, we're also expecting to see AMD host their own press event with CEO Lisa Sue. Uh we'll see Intel and Qualcomm both host press events as well related to their respective chips. Uh and then overall, we should see a ton of AI. I mean, you know, the chips themselves are are, you know, obviously enough to say that AI is going to dominate, but uh you can expect to see a lot of robots, uh a lot of smart home devices. You can even see some wearables that are AI powered. And those usually, you know, so far we haven't seen anything too interesting as far as AI powered wearables outside of maybe, you know, the intelligence built into smart glasses or smart watches. There's never been a dedicated device that's really taken off. Open AI is supposedly working on one, don't expect it at CES. Uh and then finally, uh Autos. Autos have been a big part of CES as of late.\n01:54 Dan Howley\nUh they continue to do so and we'll likely see things ranging from flying cars to uh different types of boats. Uh we know that there'll be some major automakers like Hyundai on hand, uh Sony and Honda, their uh Afeela vehicle will be there as well. Uh and so it's going to be a jam-packed show, but again, I think the big takeaway is going to be from Nvidia. They're the the hottest uh company on the market right now and what they're doing in AI as well as AI from the the rest of the companies at the show.\n02:18 Speaker A\nDan, we got about 30 seconds. So I'm just going to ask you real quickly, any surprises over the last few weeks that have jumped into your attention span uh that might kind of give us a hint of what 2026 has in store for us in tech?\n02:32 Dan Howley\nYeah, I mean the the Nvidia Groc uh kind of licensing deal, non-exclusive licensing deal. Uh I think it was estimated $20 billion. That was really interesting and it just kind of shows where Nvidia sees its its future at this point, you know, making these kinds of investments and new types of chip technologies or different types of chip tech chip technologies to really hold on to the lead that it has.\n03:00 Dan Howley\nUh you know, I I think we're going to continue to see these kinds of not necessarily acquisitions, but you know, licensing agreements will hire some executives from a company, uh things along those lines. Uh they really kind of became popular in 2025 and I think we'll continue to see them through 2026. It's a a way for companies to kind of avoid the scrutiny of acquiring a company, taking it over entirely, while still getting some of that knowhow and IP.\n03:22 Speaker A\nAll right, Dan, appreciate it. We'll see you soon.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-01-03",
      "Time": "05:00:06",
      "Source": "Investor's Business Daily",
      "Title": "Funds Plow Money Into AppLovin, Broadcom, Google — And This Top 100 Stock",
      "URL": "https://finance.yahoo.com/m/27ad62cb-8474-3e41-b47b-5d23f46f707e/funds-plow-money-into.html",
      "Content": "Funds Plow Money Into AppLovin, Broadcom, Google — And This Top 100 Stock\n\nMATTHEW GALGANI\nFri, January 2, 2026 at 1:00 PM PST 2 min read\n\nIn this article: AEIS\n\nAPP\n\nAVGO\n\nGOOG\n\nOne of the best stocks of 2025 and in demand among the best mutual funds, Advanced Energy looks to power a new breakout.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AMD",
      "Date": "2026-01-03",
      "Time": "03:34:30",
      "Source": "GuruFocus.com",
      "Title": "AMD Shares Are Climbing -- AI Memory Demand Fuels Analyst Optimism",
      "URL": "https://finance.yahoo.com/news/amd-shares-climbing-ai-memory-193430129.html",
      "Content": "AMD Shares Are Climbing -- AI Memory Demand Fuels Analyst Optimism\n\nNauman Khan\nFri, January 2, 2026 at 11:34 AM PST 1 min read\n\nIn this article: AMD\n\nThis article first appeared on GuruFocus .\nAdvanced Micro Devices ( NASDAQ:AMD ) shares climbed about 5% on Friday as analysts grew more upbeat about the company's earnings power.\nWarning! GuruFocus has detected 5 Warning Signs with AMD.\nIs AMD fairly valued? Test your thesis with our free DCF calculator.\n\nWall Street sees booming AI-related demand for high-performance computing and data-center memory as a key growth driver. New Ryzen and EPYC processors, along with refreshed AI accelerators, are strengthening AMD's product mix.\nTighter graphics-memory supply has supported higher GPU prices, helping margins, analysts say. Several brokerages have fine-tuned price targets and lifted estimates in recent sessions.\nTrading activity and technical signals point to strong buy sentiment, while AMD's market cap tops hundreds of billions, reflecting investor optimism.\nMany analysts expect memory revenue to remain strong into early 2026 as data centers shift from hard drives to faster SSDs, supporting long-term demand.\nAnalysts and investors will watch upcoming earnings, product rollouts and chip supply dynamics for signs that AI demand is sustainable into 2026.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "INTC",
      "Date": "2026-01-03",
      "Time": "03:34:26",
      "Source": "GuruFocus.com",
      "Title": "Intel Stock Rises as Panther Lake Launch and Foundry Ambitions Drive Optimism",
      "URL": "https://finance.yahoo.com/news/intel-stock-rises-panther-lake-193426097.html",
      "Content": "Intel Stock Rises as Panther Lake Launch and Foundry Ambitions Drive Optimism\n\nNauman Khan\nFri, January 2, 2026 at 11:34 AM PST 1 min read\n\nIn this article: INTC\n\nNVDA\n\nAMD\n\nTSM\n\nThis article first appeared on GuruFocus .\nIntel Corp ( NASDAQ:INTC ) shares rose about 5% on Friday as U.S. stocks are firmer to start 2026, as heavyweight chip names stabilized after late-2025 declines.\nInvestors are probing Intel's ( NASDAQ:INTC ) manufacturing roadmap and its ability to translate process gains into steadier earnings and foundry wins.\n\nA key focus is Panther Lake, Intel's next laptop processor on the 18A node, which is central to rebuilding its manufacturing edge.\nWarning! GuruFocus has detected 5 Warning Signs with AMD.\nIs AMD fairly valued? Test your thesis with our free DCF calculator.\nThe foundry narrative is mixed. Reuters reported Nvidia tested Intel's 18A process but did not proceed, while Intel said 18A work is progressing and seeing interest in its 14A technologies.\nNvidia's ( NASDAQ:NVDA ) $5 billion purchase of Intel shares underscores high-profile partnerships that may bolster confidence.\nTraders will watch Intel's quarterly update and data on manufacturing yields, with estimating earnings date of Jan. 29.\nCompetition from Advanced Micro Devices ( NASDAQ:AMD ) and Taiwan Semiconductor Manufacturing ( NYSE:TSM ) is a benchmark for Intel's progress.\nNear-term moves in Intel stock are likely to track chip-sector sentiment and macro data that shifts rate-cut expectations.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-01-03",
      "Time": "01:43:00",
      "Source": "Motley Fool",
      "Title": "Is Broadcom Stock a Buy After the Dip?",
      "URL": "https://finance.yahoo.com/m/3825e3e6-af22-399b-8c46-a5407401e8f1/is-broadcom-stock-a-buy-after.html",
      "Content": "Is Broadcom Stock a Buy After the Dip?\n\nWill Ebiefung, The Motley Fool\nFri, January 2, 2026 at 9:43 AM PST 5 min read\n\nIn this article: AVGO\n\nOPAI.PVT\n\nKey Points Some investors are feeling skittish about the high levels of capital spending on AI.\nOne important player, Broadcom, has a big opportunity in custom chip production.\n10 stocks we like better than Broadcom ›\nSemiconductor giant Broadcom (NASDAQ: AVGO) is one of the big winners in the recent generative artificial intelligence (AI) boom that started with the launch of OpenAI's ChatGPT in 2022. Shares have soared by roughly 350% in three years as investors bet on its ability to capitalize on the soaring demand for advanced computing hardware.\n\nThat said, some market participants feel that the AI boom might be getting ahead of itself as companies overspend on data centers without a meaningful guarantee of future returns. This uncertainty has sent Broadcom's stock down by around 15% from its all-time high of $412.\nLet's dig deeper into the pros and cons of the stock to see if this dip is a buying opportunity or a signal for investors to stay far away.\nWhy are investors getting nervous? The stock's recent slide came after Broadcom's fourth-quarter earnings report in mid-December. On the surface, the numbers were fantastic.\nRevenue jumped 28% year over year to a record of $18 billion, driven by soaring demand for AI semiconductor revenue, which rose 74% in the period. This operating segment reflects sales of Broadcom's advanced computer hardware to AI data centers, and management expects the momentum to continue into 2026 as demand for these products continues to surge.\n\nBroadcom's bottom line is also looking great, with net income doubling to $8.5 billion. With numbers like these, it's hard to believe shares are on a two-week downtrend. However, the correction makes more sense when you look at some of the uncomfortable dynamics of the AI industry itself.\nAccording to analysts at Goldman Sachs , hyperscalers are on track to spend an eye-popping $527 billion on AI-related capital expenditures (capex) , with some of this going to hardware produced by companies like Broadcom. The problem is that the scale of the spending doesn't really match up with the profits generated by AI-related software services.\nDeutsche Bank expects ChatGPT creator OpenAI to lose $140 billion by 2029. And despite being one of the top hardware spenders (with roughly $125 billion in capex for 2025), Amazon saw its cloud computing revenue rise by a relatively modest $5.6 billion compared to the prior-year period. The fear is that eventually shareholders will start to push back on all the AI spending. After all, this is money that could be going to buybacks or dividends.\n\nStory Continues\nBroadcom might be better positioned than Nvidia It is fair to assume that AI-related capex spending could soon drop to reasonable levels, which could reduce the growth potential of infrastructure providers like Broadcom. That said, the company is better positioned to weather a potential fallout than the industry leader, Nvidia. To understand why, we must first look at the reasons why AI development is so expensive and generally unprofitable right now.\n\nRunning and training large language models like ChatGPT requires thousands of expensive AI accelerators (such as Nvidia's Blackwell series), which consume significant amounts of energy. Broadcom's semiconductor business actually helps solve this problem by helping its clients develop appl ication-specific integrated circui ts (ASICs). These are custom chips designed to do a specific workload, making them cheaper and easier to run than Nvidia's large, general-purpose chips.\nObviously, ASICs won't be the magic bullet that makes AI companies stop burning through money. But they are the natural first step as companies seek to reduce their reliance on expensive third-party hardware. In October, cloud giant Google selected Broadcom to build its first in-house AI processor chips. This development follows a deal with OpenAI to co-develop AI accelerators and Ethernet solutions.\n\nIs Broadcom stock a buy? Broadcom's ability to benefit from the transition to custom chips makes it a strong bet in the generative AI opportunity. That said, the AI boom is getting long in the tooth, and investors may want to wait until there is more clarity about the sustainability of current industry hardware spending before taking a position in such a highly exposed stock.\n\nShould you invest $1,000 in Broadcom right now? Before you buy stock in Broadcom, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Broadcom wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $505,641 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,143,283 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 974 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 29, 2025\nWill Ebiefung has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Goldman Sachs Group, and Nvidia. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nIs Broadcom Stock a Buy After the Dip? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AMD",
      "Date": "2026-01-03",
      "Time": "00:08:01",
      "Source": "Barchart",
      "Title": "Dear AMD Stock Fans, Mark Your Calendars for January 5",
      "URL": "https://finance.yahoo.com/m/5baf4bb2-4f60-384f-ae36-408d075d8ac9/dear-amd-stock-fans%2C-mark.html",
      "Content": "Dear AMD Stock Fans, Mark Your Calendars for January 5\n\nChris MacDonald\nFri, January 2, 2026 at 8:08 AM PST 3 min read\n\nIn this article: AMD\n\nNVDA\n\nAmong the world's largest semiconductor makers, Nvidia (NVDA) remains the go-to choice for investors. And rightfully so—looking at this stock's long-term chart, investors who have stuck with this name have outperformed the market by an incredible margin in recent decades.\nOf course, it's not just a one-horse race, regardless of what the media tries to tell you. Rival Advanced Micro Devices (AMD) is another top name worth considering, and one that's actually outperformed Nvidia on a year-to-date basis (YTD). Surging 77% to end 2025, AMD roughly doubled Nvidia's performance this year (the world's largest chipmaker still surged 39% higher in 2025, so not bad). Thus, there are plenty of eyeballs already on AMD as 2026 kicks off.\n\nMore News from Barchart NVDA, NKE, and CM: Bet on These 3 Stocks With Surging Unusual Options Activity for 2026 Gains\nAfter Record Runs for Western Digital and Sandisk in 2025, Consider This 1 Data Center Storage Stock for 2026\nCrowdStrike Insiders Are Offloading CRWD Stock. Should You?\nStop Missing Market Moves: Get the FREE Barchart Brief – your midday dose of stock movers, trending sectors, and actionable trade ideas, delivered right to your inbox. Sign Up Now!\nAs it turns out, there's another major catalyst on the horizon investors are watching when it comes to both companies. Analysts at Wedbush have pointed out that AMD's CEO, Lisa Su, is expected to make the keynote address at the upcoming Consumer Electronics Show (CES) in Las Vegas on this date, with the potential for a big announcement to come.\n\nWhy Is This Catalyst So Important for AMD? I think the key announcements for AMD for this coming year are indeed likely to come at this event. CES is the biggest show in the world when it comes to anything tied to consumer electronics and is honestly one of the key shows I've always wanted to attend, for this reason. Many CEOs are expected to make big product announcements, from technological upgrades to next-generation technology expected to be released over the course of the year.\n\nI'd expect to see a strong narrative from Lisa Su around the company's roadmap moving forward, and Wedbush analysts tend to agree. They think that some “significant” technological improvements to AMD's core Ryzen chips could be announced at this conference. Doing so may propel a range of mega-cap tech companies who are looking for reasons to buy AMD chips (at a lower price point) to do so. Especially if the output differential between these Ryzen chips and Nvidia's new Blackwell and Rubin chips isn't as wide as it appears now.\n\nStory Continues\nWe'll have to see, of course, what is ultimately announced. But any sort of meaningful improvements in AMD's core CPU chip technology could spur greater investor interest in 2026 and take this stock's recent momentum to new levels. It does appear that AMD has retained strong pricing power, reflected in the company's margins above. If these margins expand further in the coming quarters, and AMD can show a cash flow growth profile that's above Wall Street estimates, I certainly think this is a stock that could be off to the races.\n\nSo, What Does Wall Street Think? As it turns out, Wedbush is just one of 44 analysts currently covering AMD stock. With a consensus price target of $285.05 per share on AMD stock, analysts believe that this chipmaker could have roughly 33% upside from current levels.\nThat's a healthy potential gain for investors looking to add some momentum to their portfolios in 2026. Indeed, momentum-driven growth stocks have provided most of the gains in the markets over the course of the past decade and a half. Thus, for those who think this trend is likely to continue and risk-on sentiment will remain in the coming year, AMD's fundamentals do point in a very positive direction right now.\nOn the date of publication, Chris MacDonald did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AMD",
      "Date": "2026-01-03",
      "Time": "00:01:04",
      "Source": "StockStory",
      "Title": "Why Are AMD (AMD) Shares Soaring Today",
      "URL": "https://finance.yahoo.com/news/why-amd-amd-shares-soaring-160104506.html",
      "Content": "Why Are AMD (AMD) Shares Soaring Today\n\nAnthony Lee\nFri, January 2, 2026 at 8:01 AM PST 2 min read\n\nIn this article: AMD\n\n^IXIC\n\nNVDA\n\nAVGO\n\nWhat Happened? Shares of computer processor maker AMD (NASDAQ:AMD) jumped 5.3% in the morning session after investor optimism grew following favorable analyst predictions for 2026 and anticipation of new product announcements.\nThe move came as top Wall Street analysts predicted a potential 32% jump in the stock's value for 2026, building on significant gains from the previous year. This positive outlook was tied to AMD's role in the artificial intelligence sector, driven by demand for high-performance computing and data centers. Adding to the excitement were rumors that the company planned to reveal a new, faster Ryzen chip and a new generation of processors at the upcoming CES 2026 conference. AMD's stock also benefited from a broader rally in tech stocks, as fresh excitement surrounding the prospects of AI lifted the sector.\n\nAfter the initial pop the shares cooled down to $220.34, up 2.9% from previous close.\nIs now the time to buy AMD? Access our full analysis report here .\nWhat Is The Market Telling Us AMD’s shares are extremely volatile and have had 30 moves greater than 5% over the last year. In that context, today’s move indicates the market considers this news meaningful but not something that would fundamentally change its perception of the business.\nThe previous big move we wrote about was 14 days ago when the stock gained 6.8% on the news that investor optimism around artificial intelligence fueled broad market gains. Technology stocks with a focus on artificial intelligence once again led the market higher, boosting the Nasdaq and S&P 500. Companies at the forefront of the AI boom, such as Nvidia and Broadcom, saw significant jumps in their share prices. The rally reflects a renewed belief among investors in the transformative potential of AI technology to drive future growth and productivity. The rally was further supported by a surprise cooling in the November consumer price index (CPI) report, which triggered market pricing for additional rate cuts in the coming year. This created a more favorable environment for growth-oriented companies.\nInvestors who bought $1,000 worth of AMD’s shares 5 years ago would now be looking at an investment worth $2,387.\nThe 1999 book Gorilla Game predicted Microsoft and Apple would dominate tech before it happened. Its thesis? Identify the platform winners early. Today, enterprise software companies embedding generative AI are becoming the new gorillas. Click here for access to our special report that reveals one profitable leader already riding this wave .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "CSCO",
      "Date": "2026-01-02",
      "Time": "23:23:00",
      "Source": "Zacks",
      "Title": "CSCO's Security Revenues Decline: Can Strong Portfolio Revive Growth?",
      "URL": "https://finance.yahoo.com/news/cscos-security-revenues-decline-strong-152300215.html",
      "Content": "CSCO's Security Revenues Decline: Can Strong Portfolio Revive Growth?\n\nAniruddha Ganguly\nFri, January 2, 2026 at 7:23 AM PST 3 min read\n\nIn this article: CSCO\n\nOKTA\n\nFTNT\n\nCisco Systems ’ CSCO Security revenues fell 2% year over year to $1.98 billion in the first quarter of fiscal 2026. Customers shift to cloud subscriptions compared with on-premise deals for Splunk, and lower revenues from prior generation products negatively impacted top-line growth. Cisco’s Security offerings primarily include Network Security, Identity and Access Management, Secure Access Service Edge (SASE) and Threat Intelligence, Detection, and Response offerings.\n\nHowever, Cisco’s new and refreshed products, which comprise roughly one-third of its security portfolio, are expected to help in reviving top-line growth. Solutions like SecureAccess, XDR, Hypershield, AI Defense and refreshed firewalls are driving order growth. In the first quarter of fiscal 2026, Cisco saw mid-teens growth in demand for next-gen firewalls, and roughly 3,000 customers have purchased a new product since launch.\n\nSplunk continues to gain traction with annualized recurring revenues and product remaining performance obligations growing double digits in the first quarter of fiscal 2026. Cisco believes the shift to cloud subscriptions reflects greater adoption and expansion of Splunk products. The addition of Splunk has strengthened CSCO’s TIDR offerings. The company has been integrating Cisco Extended Detection and Response (XDR) with Splunk Enterprise Security to create a unified and highly effective solution that helps in preventing, detecting, and responding to sophisticated cyber threats.\n\nThe Zacks Consensus Estimate for second-quarter fiscal 2026 service revenues is pegged at $2.16 billion, indicating 2.6% growth over the figure reported in the year-ago quarter.\n\nCSCO Faces Tough Competition in the Security Domain Cisco is facing stiff competition from Fortinet FTNT and Okta OKTA in the security domain.\n\nFortinet's AI-powered security operations business is accelerating rapidly. The company powers more than 20 AI-driven solutions through its FortiAI technology across three main areas: FortiAI-Protect for secure AI usage, FortiAI-Assist for AI-assisted operations, and FortiAI-SecureAI for secure LLM and AI systems. With more than 500 issued and pending AI patents, Fortinet is well-positioned to capitalize on growing AI security demand. The company launched its Secure AI Data Center solution, the industry's first end-to-end framework specifically designed for AI workloads, delivering high-capacity connectivity and up to 69% lower energy consumption than alternative solutions.\n\nOkta’s offerings include Okta AI, a suite of AI-powered capabilities embedded across several products, which empowers organizations to harness AI to build better experiences and protect against cyberattacks. The company benefits from strong demand for its new products, including Identity Governance, Privileged Access, Device Access, Fine Grained Authorization, Identity Security Posture Management and Identity Threat Protection with Okta AI. The company expects revenues to see a CAGR of 16% between fiscal 2023 and fiscal 2026. Okta expects revenues between $2.906 billion and $2.908 billion for fiscal 2026, indicating year-over-year growth of 11%.\n\nStory Continues\nCSCO Share Price Performance, Valuation & Estimates Cisco shares have appreciated 30.8% in a year, underperforming the broader Zacks Computer and Technology sector’s return of 24.2%.\nCSCO Stock Beats Sector\n\nImage Source: Zacks Investment Research\n\nThe CSCO stock is trading at a premium, with a trailing 12-month price/book of 6.49X compared with the Zacks Computer - Networking industry’s 6.13X. Cisco has a Value Score of D.\nCSCO Stock is Overvalued\n\nImage Source: Zacks Investment Research\n\nThe Zacks Consensus Estimate for second-quarter fiscal 2026 earnings is currently pegged at $1.02 per share, unchanged over the past 30 days, suggesting 8.5% growth from the figure reported in the year-ago quarter.\n\nCisco Systems, Inc. Price and Consensus Cisco Systems, Inc. price-consensus-chart | Cisco Systems, Inc. Quote\n\nThe Zacks Consensus Estimate for fiscal 2026 earnings is currently pegged at $4.10 per share, unchanged over the past 30 days, suggesting 7.6% growth from the figure reported in fiscal 2025.\n\nCisco currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nCisco Systems, Inc. (CSCO) : Free Stock Analysis Report\nFortinet, Inc. (FTNT) : Free Stock Analysis Report\nOkta, Inc. (OKTA) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-01-02",
      "Time": "23:05:00",
      "Source": "Barrons.com",
      "Title": "Nvidia, AMD, and Broadcom Are Facing Off. How the 2026 AI Chips Battle Is Shaping Up.",
      "URL": "https://finance.yahoo.com/m/addd5bdc-4a61-3d4e-868b-6eded84848ed/nvidia%2C-amd%2C-and-broadcom-are.html",
      "Content": "Nvidia, AMD, and Broadcom Are Facing Off. How the 2026 AI Chips Battle Is Shaping Up.\n\nAdam Clark\nFri, January 2, 2026 at 7:05 AM PST 5 min read\n\nIn this article: INTC\n\nAMD\n\nAVGO\n\nNVDA\n\nNvidia, AMD and Broadcom are planning big things this year year. These are the biggest developments to watch in the AI chip sector in 2026.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-01-02",
      "Time": "22:10:34",
      "Source": "Insider Monkey",
      "Title": "Benchmark Boosts Broadcom’s (AVGO) Price Target Amid AI Chip Growth",
      "URL": "https://finance.yahoo.com/news/benchmark-boosts-broadcom-avgo-price-141034796.html",
      "Content": "Benchmark Boosts Broadcom’s (AVGO) Price Target Amid AI Chip Growth\n\nSheryar Siddiq\nFri, January 2, 2026 at 6:10 AM PST 2 min read\n\nIn this article: AVGO\n\nANTH.PVT\n\nMETA\n\nGOOG\n\nOPAI.PVT\n\nBroadcom Inc. (NASDAQ: AVGO ) ranks among the best AI stocks to buy according to analysts . Citing robust development in the AI semiconductor industry, Benchmark increased its price target for Broadcom Inc. (NASDAQ:AVGO) from $385 to $485 on December 12, retaining a Buy rating on the company’s shares. According to Broadcom Inc. (NASDAQ:AVGO), its AI semiconductor division achieved $6.5 billion in Q4, improving 76% year-over-year and 25% sequentially.\nThe company reported $21 billion in orders from Anthropic over the last two quarters, while its six-quarter AI order backlog climbed to $73 billion. Broadcom’s list of clients now includes giants like Meta, ByteDance, and Google, as well as an additional contract with OpenAI to supply $1 billion in chips by late 2026.\n\nAccording to Reuters, while Broadcom’s backlog is scheduled to ship over the next 18 months, CFO Kirsten Spears warned that margins could fall. She stated that the Q1 consolidated gross margin is likely to fall roughly 100 basis points sequentially, owing to a higher percentage of AI revenue.\nAnalysts quoted by Reuters emphasize two main risks for the company, including its excessive concentration on just five AI customers, and weaker margins on AI systems, which are likely to account for a greater share of the total revenue in coming quarters, notably in the second half of fiscal year 2026.\nBroadcom Inc. (NASDAQ:AVGO) designs, develops, and supplies various semiconductor devices and infrastructure software solutions worldwide. The company operates in two segments: Semiconductor Solutions and Infrastructure Software.\n\nWhile we acknowledge the potential of AVGO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 10 Best Magic Formula Stocks for 2025 and 10 Best Retirement Stocks to Buy According to Hedge Funds .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "ADI",
      "Date": "2026-01-02",
      "Time": "20:00:19",
      "Source": "Simply Wall St.",
      "Title": "Those who invested in Analog Devices (NASDAQ:ADI) five years ago are up 89%",
      "URL": "https://finance.yahoo.com/news/those-invested-analog-devices-nasdaq-120019019.html",
      "Content": "Those who invested in Analog Devices (NASDAQ:ADI) five years ago are up 89%\n\nSimply Wall St\nFri, January 2, 2026 at 4:00 AM PST 3 min read\n\nIn this article: ADI\n\nGenerally speaking the aim of active stock picking is to find companies that provide returns that are superior to the market average. And in our experience, buying the right stocks can give your wealth a significant boost. For example, long term Analog Devices, Inc. ( NASDAQ:ADI ) shareholders have enjoyed a 73% share price rise over the last half decade, well in excess of the market return of around 59% (not including dividends). On the other hand, the more recent gains haven't been so impressive, with shareholders gaining just 28%, including dividends.\n\nSo let's investigate and see if the longer term performance of the company has been in line with the underlying business' progress.\nTrump has pledged to \"unleash\" American oil and gas and these 15 US stocks have developments that are poised to benefit.\nThere is no denying that markets are sometimes efficient, but prices do not always reflect underlying business performance. One way to examine how market sentiment has changed over time is to look at the interaction between a company's share price and its earnings per share (EPS).\nDuring five years of share price growth, Analog Devices achieved compound earnings per share (EPS) growth of 6.9% per year. This EPS growth is lower than the 12% average annual increase in the share price. So it's fair to assume the market has a higher opinion of the business than it did five years ago. That's not necessarily surprising considering the five-year track record of earnings growth. This optimism is visible in its fairly high P/E ratio of 58.57.\nThe graphic below depicts how EPS has changed over time (unveil the exact values by clicking on the image).\nWe know that Analog Devices has improved its bottom line lately, but is it going to grow revenue? Check if analysts think Analog Devices will grow revenue in the future.\nWhat About Dividends? When looking at investment returns, it is important to consider the difference between total shareholder return (TSR) and share price return . Whereas the share price return only reflects the change in the share price, the TSR includes the value of dividends (assuming they were reinvested) and the benefit of any discounted capital raising or spin-off. So for companies that pay a generous dividend, the TSR is often a lot higher than the share price return. As it happens, Analog Devices' TSR for the last 5 years was 89%, which exceeds the share price return mentioned earlier. This is largely a result of its dividend payments!\n\nA Different Perspective It's nice to see that Analog Devices shareholders have received a total shareholder return of 28% over the last year. Of course, that includes the dividend. That gain is better than the annual TSR over five years, which is 14%. Therefore it seems like sentiment around the company has been positive lately. In the best case scenario, this may hint at some real business momentum, implying that now could be a great time to delve deeper. It's always interesting to track share price performance over the longer term. But to understand Analog Devices better, we need to consider many other factors. Take risks, for example - Analog Devices has 1 warning sign we think you should be aware of.\n\nStory Continues\nOf course Analog Devices may not be the best stock to buy . So you may wish to see this free collection of growth stocks.\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "SWKS",
      "Date": "2026-01-02",
      "Time": "19:27:02",
      "Source": "MT Newswires",
      "Title": "Loop Capital Adjusts Price Target on Skyworks Solutions to $65 From $75, Maintains Hold Rating",
      "URL": "https://finance.yahoo.com/news/loop-capital-adjusts-price-target-112702155.html",
      "Content": "PREMIUM\nLoop Capital Adjusts Price Target on Skyworks Solutions to $65 From $75, Maintains Hold Rating\n\nMT Newswires\nFri, January 2, 2026 at 3:27 AM PST\n\nIn this article: SWKS\n\nSkyworks Solutions (SWKS) has an average rating of hold and mean price target of $82.75, according t\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-01-02",
      "Time": "12:04:57",
      "Source": "StockStory",
      "Title": "2 Reasons to Like QCOM (and 1 Not So Much)",
      "URL": "https://finance.yahoo.com/news/2-reasons-qcom-1-not-040457796.html",
      "Content": "2 Reasons to Like QCOM (and 1 Not So Much)\n\nKayode Omotosho\nThu, January 1, 2026 at 8:04 PM PST 3 min read\n\nIn this article: QCOM\n\n^GSPC\n\nQualcomm trades at $171.30 per share and has stayed right on track with the overall market, gaining 5.5% over the last six months. At the same time, the S&P 500 has returned 9.9%.\nIs now the time to buy QCOM? Find out in our full research report, it’s free for active Edge members .\nWhy Does QCOM Stock Spark Debate? Having been at the forefront of developing the standards for cellular connectivity for over four decades, Qualcomm (NASDAQ:QCOM) is a leading innovator and a fabless manufacturer of wireless technology chips used in smartphones, autos and internet of things appliances.\nTwo Positive Attributes: 1. Skyrocketing Revenue Shows Strong Momentum A company’s long-term sales performance can indicate its overall quality. Any business can put up a good quarter or two, but the best consistently grow over the long haul. Luckily, Qualcomm’s sales grew at an impressive 15.3% compounded annual growth rate over the last five years. Its growth beat the average semiconductor company and shows its offerings resonate with customers. Semiconductors are a cyclical industry, and long-term investors should be prepared for periods of high growth followed by periods of revenue contractions.\n2. Stellar ROIC Showcases Lucrative Growth Opportunities Growth gives us insight into a company’s long-term potential, but how capital-efficient was that growth? A company’s ROIC explains this by showing how much operating profit it makes compared to the money it has raised (debt and equity).\nQualcomm’s five-year average ROIC was 47%, placing it among the best semiconductor companies. This illustrates its management team’s ability to invest in highly profitable ventures and produce tangible results for shareholders.\nOne Reason to be Careful: Projected Revenue Growth Is Slim Forecasted revenues by Wall Street analysts signal a company’s potential. Predictions may not always be accurate, but accelerating growth typically boosts valuation multiples and stock prices while slowing growth does the opposite.\nOver the next 12 months, sell-side analysts expect Qualcomm’s revenue to rise by 3%, a deceleration versus its 15.3% annualized growth for the past five years. This projection is underwhelming and indicates its products and services will see some demand headwinds. At least the company is tracking well in other measures of financial health.\n\nFinal Judgment Qualcomm’s merits more than compensate for its flaws, but at $171.30 per share (or 14.2× forward P/E), is now the time to initiate a position? See for yourself in our comprehensive research report, it’s free for active Edge members .\n\nStory Continues\nHigh-Quality Stocks for All Market Conditions If your portfolio success hinges on just 4 stocks, your wealth is built on fragile ground. You have a small window to secure high-quality assets before the market widens and these prices disappear.\nDon’t wait for the next volatility shock. Check out our Top 5 Growth Stocks for this month . This is a curated list of our High Quality stocks that have generated a market-beating return of 244% over the last five years (as of June 30, 2025).\nStocks that have made our list include now familiar names such as Nvidia (+1,326% between June 2020 and June 2025) as well as under-the-radar businesses like the once-small-cap company Exlservice (+354% five-year return). Find your next big winner with StockStory today .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "KLAC",
      "Date": "2026-01-02",
      "Time": "11:33:59",
      "Source": "StockStory",
      "Title": "Semiconductor Manufacturing Stocks Q3 Teardown: KLA Corporation (NASDAQ:KLAC) Vs The Rest",
      "URL": "https://finance.yahoo.com/news/semiconductor-manufacturing-stocks-q3-teardown-033359286.html",
      "Content": "Semiconductor Manufacturing Stocks Q3 Teardown: KLA Corporation (NASDAQ:KLAC) Vs The Rest\n\nJabin Bastian\nThu, January 1, 2026 at 7:33 PM PST 4 min read\n\nIn this article: KLAC\n\nThe end of an earnings season can be a great time to discover new stocks and assess how companies are handling the current business environment. Let’s take a look at how KLA Corporation (NASDAQ:KLAC) and the rest of the semiconductor manufacturing stocks fared in Q3.\nThe semiconductor industry is driven by demand for advanced electronic products like smartphones, PCs, servers, and data storage. The need for technologies like artificial intelligence, 5G networks, and smart cars is also creating the next wave of growth for the industry. Keeping up with this dynamism requires new tools that can design, fabricate, and test chips at ever smaller sizes and more complex architectures, creating a dire need for semiconductor capital manufacturing equipment.\n\nThe 14 semiconductor manufacturing stocks we track reported a very strong Q3. As a group, revenues beat analysts’ consensus estimates by 3.3% while next quarter’s revenue guidance was 0.6% below.\nLuckily, semiconductor manufacturing stocks have performed well with share prices up 11.2% on average since the latest earnings results.\nKLA Corporation (NASDAQ:KLAC) Formed by the 1997 merger of the two leading semiconductor yield management companies, KLA Corporation (NASDAQ:KLAC) is the leading supplier of equipment used to measure and inspect semiconductor chips.\nKLA Corporation reported revenues of $3.21 billion, up 13% year on year. This print exceeded analysts’ expectations by 1.1%. Overall, it was a strong quarter for the company with a decent beat of analysts’ adjusted operating income estimates and a beat of analysts’ EPS estimates.\n\n\"KLA produced a strong all-around September quarter performance above the guidance midpoints. These results reflect double-digit year-over-year revenue and EPS growth, and KLA is on pace for solid relative revenue growth compared to our industry in calendar 2025,\" said Rick Wallace, president and CEO of KLA Corporation.\nUnsurprisingly, the stock is down 1.5% since reporting and currently trades at $1,217.\nWe think KLA Corporation is a good business, but is it a buy today? Read our full report here, it’s free for active Edge members.\nBest Q3: Teradyne (NASDAQ:TER) Sporting most major chip manufacturers as its customers, Teradyne (NASDAQ:TER) is a US-based supplier of automated test equipment for semiconductors as well as other technologies and devices.\nTeradyne reported revenues of $769.2 million, up 4.3% year on year, outperforming analysts’ expectations by 3.3%. The business had a stunning quarter with a solid beat of analysts’ adjusted operating income estimates and revenue guidance for next quarter exceeding analysts’ expectations.\n\nStory Continues\nThe market seems happy with the results as the stock is up 34% since reporting. It currently trades at $193.49.\nIs now the time to buy Teradyne? Access our full analysis of the earnings results here, it’s free for active Edge members .\nWeakest Q3: Entegris (NASDAQ:ENTG) With fabs representing the company’s largest customer type, Entegris (NASDAQ:ENTG) supplies products that purify, protect, and generally ensure the integrity of raw materials needed for advanced semiconductor manufacturing.\nEntegris reported revenues of $807.1 million, flat year on year, exceeding analysts’ expectations by 0.6%. Still, it was a slower quarter as it posted revenue guidance for next quarter missing analysts’ expectations significantly and EPS in line with analysts’ estimates.\n\nAs expected, the stock is down 10.8% since the results and currently trades at $84.34.\nRead our full analysis of Entegris’s results here.\nPhotronics (NASDAQ:PLAB) Sporting a global footprint of facilities, Photronics (NASDAQ:PLAB) is a manufacturer of photomasks, templates used to transfer patterns onto semiconductor wafers.\nPhotronics reported revenues of $215.8 million, down 3.1% year on year. This number surpassed analysts’ expectations by 5.5%. It was an exceptional quarter as it also recorded a beat of analysts’ EPS estimates and revenue guidance for next quarter exceeding analysts’ expectations.\n\nThe stock is up 24.4% since reporting and currently trades at $31.95.\nRead our full, actionable report on Photronics here, it’s free for active Edge members.\nKulicke and Soffa (NASDAQ:KLIC) Headquartered in Singapore, Kulicke & Soffa (NASDAQ: KLIC) is a provider of production equipment and tools used to assemble semiconductor devices\nKulicke and Soffa reported revenues of $177.6 million, down 2.1% year on year. This print beat analysts’ expectations by 4.4%. Overall, it was an exceptional quarter as it also logged a significant improvement in its inventory levels and a beat of analysts’ EPS estimates.\n\nThe stock is up 27.9% since reporting and currently trades at $45.14.\nRead our full, actionable report on Kulicke and Soffa here, it’s free for active Edge members.\n\nWant to invest in winners with rock-solid fundamentals? Check out our Top 6 Stocks and add them to your watchlist. These companies are poised for growth regardless of the political or macroeconomic climate.\nStockStory’s analyst team — all seasoned professional investors — uses quantitative analysis and automation to deliver market-beating insights faster and with higher quality.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-01-02",
      "Time": "03:38:00",
      "Source": "MarketBeat",
      "Title": "The Last Time This Happened, Qualcomm Fell 10%",
      "URL": "https://finance.yahoo.com/m/2e02f3ec-97f8-3e4a-bb3f-bd387133b0ba/the-last-time-this-happened%2C.html",
      "Content": "The Last Time This Happened, Qualcomm Fell 10%\n\nSam Quirke, MarketBeat\nThu, January 1, 2026 at 11:38 AM PST 5 min read\n\nIn this article: QCOM\n\nKey Points Qualcomm’s MACD just flipped bearish again, and the stock is already slipping after a strong run from April.\nA similar signal in early November was followed by a fast, double-digit drop, making this setup hard to ignore.\nThe near-term “tell” is whether buyers defend the low-$170s, or whether the stock breaks down ahead of February earnings.\nInterested in QUALCOMM Incorporated? Here are five stocks we like better.\n\nAfter showing many promising signs over the past quarter, shares of Qualcomm Inc. (NASDAQ: QCOM) are flashing a sudden warning signal as the new year begins. Just before Christmas, the stock’s Moving Average Convergence Divergence (MACD) chart logged a bearish crossover, confirming a momentum shift that has continued into this week. The mega-cap tech stock closed just below $174 on Dec. 30, still up roughly 40% since April, but also down about 15% from the late-October surge that briefly reignited bullish enthusiasm.\nSince then, however, Qualcomm has been narrowing into a tight range, and while its long-term fundamentals remain supportive, its short-term technicals are flashing caution. What makes it all the more noteworthy is that the last time this exact setup appeared, the outcome was not kind to the bulls. Could history be about to repeat itself? Let’s jump in and take a closer look.\n\n→ Hi Ho Silver Away! Silver Breaks $80 as Poor Man's Gold Explodes\nWhat Qualcomm’s Bearish MACD Crossover Signals Now The MACD is a momentum indicator that tracks the relationship between two moving averages. When the shorter-term average crosses below the longer-term one, it’s regarded as a reliable signal that upside momentum is fading and that sellers are beginning to gain the upper hand. Importantly, this is not just an intraday wobble. The crossover that appeared just before Christmas has now continued and picked up pace into this week.\n\nThat matters because MACD signals tend to be more reliable when they appear after extended rallies. Qualcomm’s run since April has been one of its most sustained in years, and so this sudden divergence could be an early warning that buyers are starting to step back, rather than to continue building positions.\n→ D-Wave vs. IonQ vs. IBM vs. Google: Which Quantum Bets Will Win 2026?\nNow, it doesn’t mean a breakdown from here is inevitable. But it does suggest that the stock is vulnerable if bulls fail to step in soon, especially given how the stock behaved the last time this happened.\nThe Last Time QCOM Flashed This Signal, Shares Dropped 10% The most recent comparison point came less than two months ago in early November. At the time, Qualcomm had also printed a bearish MACD crossover after a strong move to multi-year highs. In a move that surprised us all, what followed was a swift decline of more than 10% over the following two weeks.\n\nStory Continues\n→ MarketBeat Week in Review – 12/29 - 01/02\nThe setup then shares several similarities with today. The stock had been moving higher into the middle of December since bottoming out from November’s correction, but in the face of increased selling pressure over the past fortnight, the bulls have been nowhere to be seen.\n\nHistory might not repeat perfectly when it comes to stocks, but it often rhymes. The point isn’t so much that Qualcomm is definitely going to fall another 10% from here; it’s that, at the very least, the stock is flashing a warning signal that is worth noting.\nWhy This Qualcomm Setup Could Play Out Differently There are also reasons not to be overly negative. Unlike early November, Qualcomm hasn’t just retreated from a multi-year high, and is actually starting to trade within a tightening range. With the longer-term uptrend still intact, it could be said to have been coiling into a pre-breakout setup over the past week, more so than starting to break down.\n\nIts fundamentals also look as strong as they have all year, with expectations building for Qualcomm to once again top the consensus in their first earnings report of 2026, due in early February. As we’ve highlighted in recent weeks, too, investor perception has been improving as the company’s diversification efforts continue to build momentum.\nEspecially when the broader equity market is in risk-on mode, this underlying narrative supports higher prices over time, even if the near-term path is choppy. That longer-term view is supported by TradeSmith’s Health Indicator, a volatility-based metric that has consistently ranked Qualcomm in the green zone for six consecutive months.\n\nWhat Bulls Must Do for Qualcomm to Start 2026 Strong Still, for Qualcomm to start 2026 on the right foot, the bulls need to reassert control soon. If the stock continues to drift lower below $172, it would significantly increase the odds of another leg down similar to November’s move.\nConversely, if buyers step in and momentum begins to turn back up, this crossover could prove to be a false alarm within a broader uptrend. Having worked hard to shake off its reputation for exasperating investors with multiple false promises, Qualcomm has earned some benefit of the doubt after its strong performance since April, but that goodwill is not unlimited.\nThe next week or two will tell a lot. A stock can coil only for so long before it has to choose a direction, one way or the other. With its fundamentals pointing higher and technicals pulling in the opposite direction, Qualcomm is approaching a moment of decision.\nThe article \" The Last Time This Happened, Qualcomm Fell 10% \" was originally published by MarketBeat.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "ARM",
      "Date": "2026-01-01",
      "Time": "19:29:53",
      "Source": "Insider Monkey",
      "Title": "Goldman Sachs Downgrades Arm Holdings (ARM) Amid Limited AI Cycle Exposure and Non-Traditional Market Challenges",
      "URL": "https://finance.yahoo.com/news/goldman-sachs-downgrades-arm-holdings-112953438.html",
      "Content": "Goldman Sachs Downgrades Arm Holdings (ARM) Amid Limited AI Cycle Exposure and Non-Traditional Market Challenges\n\nMaham Fatima\nThu, January 1, 2026 at 3:29 AM PST 2 min read\n\nIn this article: ARM\n\nArm Holdings (NASDAQ:ARM) is one of the best NASDAQ stocks to buy in 2026 . On December 15, Goldman Sachs downgraded Arm Holdings to Sell from Neutral with a price target of $120, which was brought down from $160. This decision was made as the firm updated its 2026 semiconductor sector outlook and predicted that rising AI spending by hyperscalers will support digital, memory, and storage markets, while a recovery in the automotive and industrial sectors should benefit analog chips. However, Goldman Sachs downgraded Arm Holdings due to its limited exposure to the AI cycle, its ongoing business model transition, and the challenges it faces in gaining traction across non-traditional markets.\n\nIn FQ2 2026, Arm Holdings (NASDAQ:ARM) achieved its best FQ2 performance to date, with total revenue reaching $1.14 billion, which was a 34% increase year-on-year. This growth was fueled by record royalty revenue of $620 million (up 21%) and a massive 56% surge in licensing revenue, which totaled $515 million. The licensing spike reflects intense global demand for next-gen AI products and Arm Holdings’ high-efficiency compute architecture. The company also delivered a non-GAAP EPS of $0.39, which was $0.06 above the midpoint of its previous guidance.\nStrategically, Arm Holdings (NASDAQ:ARM) is positioning itself as the primary solution to the power bottlenecks currently hindering data center expansion. The company’s platform is approximately 50% more energy-efficient than its competitors, a factor that has led to widespread adoption by industry giants including Nvidia, Amazon, Google, and Microsoft. This efficiency drove ARM’s Neoverse royalties to more than double year-on-year. Furthermore, the company announced a strategic partnership with Meta to optimize AI efficiency and revealed plans to acquire DreamBig Semiconductor to secure critical intellectual property for data center networking and high-speed communications.\n\nArm Holdings (NASDAQ:ARM) architects, develops, and licenses central processing unit products and related technologies for semiconductor companies and original equipment manufacturers.\nWhile we acknowledge the potential of ARM as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "ADI",
      "Date": "2026-01-01",
      "Time": "07:00:02",
      "Source": "Zacks",
      "Title": "Analog Devices (ADI) Registers a Bigger Fall Than the Market: Important Facts to Note",
      "URL": "https://finance.yahoo.com/news/analog-devices-adi-registers-bigger-230002969.html",
      "Content": "Analog Devices (ADI) Registers a Bigger Fall Than the Market: Important Facts to Note\n\nZacks Equity Research\nWed, December 31, 2025 at 3:00 PM PST 3 min read\n\nIn this article: ADI\n\n^GSPC\n\n^DJI\n\n^IXIC\n\nIn the latest trading session, Analog Devices (ADI) closed at $271.20, marking a -1.32% move from the previous day. The stock's change was less than the S&P 500's daily loss of 0.74%. Meanwhile, the Dow lost 0.63%, and the Nasdaq, a tech-heavy index, lost 0.76%.\nComing into today, shares of the semiconductor maker had gained 0.68% in the past month. In that same time, the Computer and Technology sector gained 0.14%, while the S&P 500 gained 0.79%.\n\nThe investment community will be closely monitoring the performance of Analog Devices in its forthcoming earnings report. The company is forecasted to report an EPS of $2.28, showcasing a 39.88% upward movement from the corresponding quarter of the prior year. Meanwhile, our latest consensus estimate is calling for revenue of $3.11 billion, up 28.21% from the prior-year quarter.\nFor the annual period, the Zacks Consensus Estimates anticipate earnings of $9.79 per share and a revenue of $12.82 billion, signifying shifts of +25.67% and +16.36%, respectively, from the last year.\nIt is also important to note the recent changes to analyst estimates for Analog Devices. Recent revisions tend to reflect the latest near-term business trends. As such, positive estimate revisions reflect analyst optimism about the business and profitability.\n\nEmpirical research indicates that these revisions in estimates have a direct correlation with impending stock price performance. To take advantage of this, we've established the Zacks Rank, an exclusive model that considers these estimated changes and delivers an operational rating system.\nThe Zacks Rank system, spanning from #1 (Strong Buy) to #5 (Strong Sell), boasts an impressive track record of outperformance, audited externally, with #1 ranked stocks yielding an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has moved 0.52% higher. Analog Devices is holding a Zacks Rank of #2 (Buy) right now.\nIn terms of valuation, Analog Devices is currently trading at a Forward P/E ratio of 28.07. This expresses a discount compared to the average Forward P/E of 44.32 of its industry.\n\nMeanwhile, ADI's PEG ratio is currently 1.52. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. As the market closed yesterday, the Semiconductor - Analog and Mixed industry was having an average PEG ratio of 2.47.\nThe Semiconductor - Analog and Mixed industry is part of the Computer and Technology sector. This industry currently has a Zacks Industry Rank of 31, which puts it in the top 13% of all 250+ industries.\n\nStory Continues\nThe Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nRemember to apply Zacks.com to follow these and more stock-moving metrics during the upcoming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAnalog Devices, Inc. (ADI) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-01-01",
      "Time": "06:45:07",
      "Source": "Zacks",
      "Title": "Why Qualcomm (QCOM) Dipped More Than Broader Market Today",
      "URL": "https://finance.yahoo.com/news/why-qualcomm-qcom-dipped-more-224507296.html",
      "Content": "Why Qualcomm (QCOM) Dipped More Than Broader Market Today\n\nZacks Equity Research\nWed, December 31, 2025 at 2:45 PM PST 3 min read\n\nIn this article: QCOM\n\n^GSPC\n\n^DJI\n\n^IXIC\n\nQualcomm (QCOM) closed at $171.05 in the latest trading session, marking a -1.5% move from the prior day. This change lagged the S&P 500's daily loss of 0.74%. At the same time, the Dow lost 0.63%, and the tech-heavy Nasdaq lost 0.76%.\nComing into today, shares of the chipmaker had gained 1.73% in the past month. In that same time, the Computer and Technology sector gained 0.14%, while the S&P 500 gained 0.79%.\n\nInvestors will be eagerly watching for the performance of Qualcomm in its upcoming earnings disclosure. The company is forecasted to report an EPS of $3.38, showcasing a 0.88% downward movement from the corresponding quarter of the prior year. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $12.25 billion, up 4.99% from the year-ago period.\nFor the full year, the Zacks Consensus Estimates are projecting earnings of $12.15 per share and revenue of $45.69 billion, which would represent changes of +1% and +3.52%, respectively, from the prior year.\nIt is also important to note the recent changes to analyst estimates for Qualcomm. These latest adjustments often mirror the shifting dynamics of short-term business patterns. Therefore, positive revisions in estimates convey analysts' confidence in the business performance and profit potential.\n\nBased on our research, we believe these estimate revisions are directly related to near-term stock moves. To utilize this, we have created the Zacks Rank, a proprietary model that integrates these estimate changes and provides a functional rating system.\nThe Zacks Rank system, stretching from #1 (Strong Buy) to #5 (Strong Sell), has a noteworthy track record of outperforming, validated by third-party audits, with stocks rated #1 producing an average annual return of +25% since the year 1988. Over the past month, the Zacks Consensus EPS estimate has shifted 0.02% downward. Qualcomm is holding a Zacks Rank of #3 (Hold) right now.\nIn the context of valuation, Qualcomm is at present trading with a Forward P/E ratio of 14.29. This denotes a discount relative to the industry average Forward P/E of 35.99.\n\nInvestors should also note that QCOM has a PEG ratio of 3.11 right now. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. By the end of yesterday's trading, the Electronics - Semiconductors industry had an average PEG ratio of 2.04.\nThe Electronics - Semiconductors industry is part of the Computer and Technology sector. This group has a Zacks Industry Rank of 96, putting it in the top 39% of all 250+ industries.\n\nStory Continues\nThe Zacks Industry Rank assesses the vigor of our specific industry groups by computing the average Zacks Rank of the individual stocks incorporated in the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nRemember to apply Zacks.com to follow these and more stock-moving metrics during the upcoming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "TSEM",
      "Date": "2026-01-01",
      "Time": "02:55:02",
      "Source": "Motley Fool",
      "Title": "Tower Semiconductor Draws New $109 Million Institutional Stake Amid a 127% Stock Run",
      "URL": "https://finance.yahoo.com/m/1da60ef3-5e88-33a6-ad2c-656cafbf07c5/tower-semiconductor-draws-new.html",
      "Content": "Tower Semiconductor Draws New $109 Million Institutional Stake Amid a 127% Stock Run\n\nJonathan Ponciano, The Motley Fool\nWed, December 31, 2025 at 10:55 AM PST 5 min read\n\nIn this article: TSEM\n\nAPLD\n\nMTZ\n\nKey Points Florida-based Hood River Capital Management initiated a new stake in Tower Semiconductor, buying up 1.51 million shares in the third quarter.\nThe shares were worth about $109.22 million as of September 30.\nThe position places Tower Semiconductor outside the fund's top five holdings.\nThese 10 stocks could mint the next wave of millionaires ›\n\nFlorida-based Hood River Capital Management reported a new position in Tower Semiconductor (NASDAQ:TSEM) valued at approximately $109.22 million, according to a November 14 SEC filing.\nWhat Happened Hood River Capital Management established a new position in Tower Semiconductor (NASDAQ:TSEM) , acquiring 1.51 million shares valued at $109.22 million as of September 30, according to its SEC filing dated November 14. The new stake amounts to 1.29% of the fund’s $8.47 billion in reportable U.S. equity assets, raising its total number of holdings to 152 at quarter-end.\n\nWhat Else to Know Top holdings after the filing:\nNASDAQ:APLD: $482.81 million (5.7% of AUM)\nNYSE:MTZ: $350.38 million (4.13% of AUM)\nNASDAQ:KTOS: $246.07 million (2.91% of AUM)\nNASDAQ:DAVE: $215.46 million (2.54% of AUM)\nNYSE:FIX: $199.03 million (2.35% of AUM)\nAs of Wednesday, shares of Tower Semiconductor were priced at $118.08, up a staggering 127% over the past year and well outperforming the S&P 500's 17% gain in the same period.\n\nCompany Overview Metric\nValue\nRevenue (TTM)\n$1.51 billion\nNet Income (TTM)\n$195.48 million\nPrice (as of Wednesday)\n$118.08\n\nCompany Snapshot Tower Semiconductor offers analog-intensive mixed-signal semiconductor devices, including SiGe, BiCMOS, RF CMOS, CMOS image sensors, integrated power management, and MEMS, as well as wafer fabrication and design enablement services.\nIt operates as an independent foundry, generating revenue through manufacturing and customizing semiconductor wafers for integrated device manufacturers and fabless companies on a contract basis.\nThe company serves a diversified customer base across consumer electronics, communications, automotive, industrial, aerospace, military, and medical device sectors worldwide.\n\nTower Semiconductor is a leading pure-play foundry specializing in analog and mixed-signal semiconductor manufacturing, with a global footprint and a workforce of over 5,600 employees. The company leverages advanced process technologies and a flexible manufacturing model to address specialized customer requirements in high-growth, high-reliability end markets. Its competitive edge is built on technology customization, deep industry expertise, and broad market reach across multiple geographies and applications.\n\nStory Continues\nFoolish Take This move shows conviction during a staggering stock run. Tower Semiconductor exited the third quarter with momentum across revenue, margins, and capital deployment. Revenue reached $396 million in the third quarter, up 6% sequentially, while net income climbed to $54 million, or $0.48 per share, reflecting operating leverage across its core platforms. Meanwhile, management’s guidance for a record $440 million of revenue in the fourth quarter underscores why some investors are still leaning in despite the stock’s sharp run-up.\n\nWhat also stands out is where Tower is spending. The company committed an additional $300 million to expand SiPho and SiGe capacity, targeting optical transceivers and data center demand, segments with structurally higher margins and long-duration growth drivers.\n\nAnd as for the broader context, this fund’s largest holdings skew toward higher-volatility growth names, suggesting Tower is being used as a quality compounder rather than a speculative swing.\n\nGlossary 13F reportable assets: Assets disclosed by institutional investment managers in quarterly SEC filings, covering U.S. equity holdings.\nAssets under management (AUM): The total market value of investments managed by a fund or investment firm.\nTop holdings: The largest individual investments in a fund's portfolio, typically ranked by market value or portfolio weight.\nTrailing twelve months (TTM): The 12-month period ending with the most recent quarterly report.\nPure-play foundry: A semiconductor company that manufactures chips for other companies but does not design its own products.\nAnalog-intensive mixed-signal: Semiconductor devices combining analog and digital circuits, often used for processing real-world signals.\nSiGe: Silicon-germanium, a semiconductor material used to enhance performance in certain electronic devices.\nBiCMOS: A technology combining bipolar and CMOS transistors on a single chip for improved speed and power efficiency.\nRF CMOS: Radio frequency complementary metal-oxide-semiconductor; technology for integrating radio frequency circuits on standard CMOS chips.\nCMOS image sensors: Devices that convert light into electronic signals, widely used in cameras and imaging equipment.\nMEMS: Microelectromechanical systems; tiny mechanical devices built onto semiconductor chips for sensing or actuation.\nFabless companies: Firms that design semiconductor chips but outsource manufacturing to foundries rather than owning fabrication facilities.\n\nDon’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $486,427 !*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $51,943 !*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $505,749 !*\nRight now, we’re issuing “Double Down” alerts for three incredible companies , available when you join Stock Advisor , and there may not be another chance like this anytime soon.\nSee the 3 stocks »\n*Stock Advisor returns as of December 29, 2025\nJonathan Ponciano has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Comfort Systems USA and Kratos Defense & Security Solutions. The Motley Fool recommends MasTec. The Motley Fool has a disclosure policy .\nTower Semiconductor Draws New $109 Million Institutional Stake Amid a 127% Stock Run was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "KLAC",
      "Date": "2026-01-01",
      "Time": "00:42:00",
      "Source": "Insider Monkey",
      "Title": "Is KLA Corporation (KLAC) The Best Performing Quantum Computing Stock of 2025?",
      "URL": "https://finance.yahoo.com/news/kla-corporation-klac-best-performing-164200623.html",
      "Content": "Is KLA Corporation (KLAC) The Best Performing Quantum Computing Stock of 2025?\n\nTalha Qureshi\nWed, December 31, 2025 at 8:42 AM PST 2 min read\n\nIn this article: KLAC\n\nKLA Corporation (NASDAQ: KLAC ) is among the Best Performing Quantum Computing Stocks in 2025 . KLA Corporation (NASDAQ:KLAC) is trading at an all-time high with the share price of $1,279.60 on December 26. This comes after impressive 100.59% year-to-date gains.\nWall Street is bullish ahead of the company’s fiscal Q2 2026 earnings, expected to be released on January 28. Analysts expect the company to post around $3.25 billion in revenue along with a GAAP EPS of $8.49. Recently, on December 19, Deutsche Bank reiterated a Hold rating on the stock without disclosing any price targets. Earlier, on December 16, Vivek Arya from Bank of America Securities reiterated a Buy rating on the stock and raised the price target from $1,400 to $1,450.\nArya of BofA noted that the US semiconductor stocks are attractively positioned for 2026. He sees 2026 as the halfway point of an 8-10 year-long cycle. Arya sees 2026 to be the year of faster IT upgradation, AI utilization, and AI workloads. He cautioned the investors regarding slight choppiness due to increased investor scrutiny on AI return on investment; however, this is expected to be offset by fast AI LLM builders and AI factories.\n\nThat said, on December 15, Blayne Curtis from Jefferies upgraded KLA Corporation (NASDAQ:KLAC) from Market Perform to Outperform with a $1,500 price target. The analyst believes that the company enjoys a significant edge on a stronger leading edge/packaging outlook. The firm also has a constructive outlook on the wafer fab equipment growth in 2026 and 2027.\nKLA Corporation (NASDAQ:KLAC) designs, manufactures, and sells advanced process control equipment and services for the semiconductor and electronics industries, helping chipmakers find tiny defects, improve yields, and enhance quality in making logic chips, memory (like DRAM/NAND), LEDs, and more, essentially providing the high-tech tools to ensure flawless microchip production.\nWhile we acknowledge the potential of KLAC as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "GFS",
      "Date": "2026-01-01",
      "Time": "00:07:47",
      "Source": "GuruFocus.com",
      "Title": "Wedbush Downgrades GlobalFoundries on Timing",
      "URL": "https://finance.yahoo.com/news/wedbush-downgrades-globalfoundries-timing-160747604.html",
      "Content": "Wedbush Downgrades GlobalFoundries on Timing\n\nMoz Farooque ACCA\nWed, December 31, 2025 at 8:07 AM PST 1 min read\n\nIn this article: GFS\n\nThis article first appeared on GuruFocus .\nGlobalFoundries ( NASDAQ:GFS ) got knocked around Wednesday after Wedbush basically said the chip slowdown isn't over yet, and that patience is going to be required.\nWedbush cut the stock to Neutral and lowered its price target to $40, which pushed shares about 2.2% lower in premarket trading. The key issue isn't that the long-term story is broken. It's timing. Analyst Matt Bryson said the recovery GlobalFoundries needs is taking longer than expected, and investors shouldn't expect a quick turnaround.\n\nWarning! GuruFocus has detected 3 Warning Sign with GFS.\nIs GFS fairly valued? Test your thesis with our free DCF calculator.\nDemand is the problem right now. Smartphone makers are cutting build plans as rising memory prices push costs higher and buyers get more cautious. Industrial and auto demand isn't helping either, with no clear rebound in sight. That matters because about half of GlobalFoundries' revenue comes from those areas.\nThere are still positives. Its U.S. and European footprint is a real advantage, and margins are holding up better than expected. But for now, this is a waiting game, not a momentum story.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "TSEM",
      "Date": "2025-12-31",
      "Time": "23:52:02",
      "Source": "MT Newswires",
      "Title": "Tower Semiconductor Rating Shifts to Neutral Despite Positive Fundamentals, Wedbush Says",
      "URL": "https://finance.yahoo.com/news/tower-semiconductor-rating-shifts-neutral-155202737.html",
      "Content": "PREMIUM\nTower Semiconductor Rating Shifts to Neutral Despite Positive Fundamentals, Wedbush Says\n\nMT Newswires\nWed, December 31, 2025 at 7:52 AM PST 1 min read\n\nIn this article: TSEM\n\nTower Semiconductor's (TSEM) \"positive fundamental story remains intact,\" while the stock's outperfo\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "GFS",
      "Date": "2025-12-31",
      "Time": "23:23:39",
      "Source": "MT Newswires",
      "Title": "GlobalFoundries Faces Longer Timeframe for Catalysts Like Improved End Market to Play Out, Wedbush Says",
      "URL": "https://finance.yahoo.com/news/globalfoundries-faces-longer-timeframe-catalysts-152339713.html",
      "Content": "PREMIUM\nGlobalFoundries Faces Longer Timeframe for Catalysts Like Improved End Market to Play Out, Wedbush Says\n\nMT Newswires\nWed, December 31, 2025 at 7:23 AM PST 1 min read\n\nIn this article: GFS\n\nGlobalFoundries (GFS) faces an elongated timeframe around when catalysts like an improved end market\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "GFS",
      "Date": "2025-12-31",
      "Time": "22:36:47",
      "Source": "The Fly",
      "Title": "GlobalFoundries downgraded, TeraWulf upgraded: Wall Street's top analyst calls",
      "URL": "https://finance.yahoo.com/news/globalfoundries-downgraded-terawulf-upgraded-wall-143647653.html",
      "Content": "GlobalFoundries downgraded, TeraWulf upgraded: Wall Street's top analyst calls\n\nThe Fly\nWed, December 31, 2025 at 6:36 AM PST 3 min read\n\nIn this article: WULF\n\nDBRG-PH\n\nDBRG-PI\n\nDBRG-PJ\n\nGFS\n\nThe most talked about and market moving research calls around Wall Street are now in one place. Here are today's research calls that investors need to know, as compiled by The Fly.\n\nTop Upgrades:\n\nKeefe Bruyette upgraded TeraWulf (WULF) to Outperform from Market Perform with a price target of $24, up from $9.50. The firm believes investors are underestimating the magnitude of TeraWulf's bitcoin mining to high performance compute leasing mix shift in 2026 and 2027.\nClear Street upgraded Plug Power (PLUG) to Buy from Hold with a price target of $3, down from $3.50. The firm sees more attractive upside in the shares following the recent selloff. It cites dilution from Plug Power's convertible refinancing in late November for the target drop.\n\nTop Downgrades:\n\nWedbush downgraded GlobalFoundries (GFS) to Neutral from Outperform with a price target of $40, down from $42. While the firm believes that GlobalFoundries has a path to a model with stronger revenues, improved utilization, and better margins on improved end market fundamentals and a shift towards local supply chains, it also believes recent developments have elongated the timeframe around when those catalysts might play out, the firm tells investors.\nWedbush downgraded Tower Semiconductor (TSEM) to Neutral from Outperform with a $125 price target. The firm cites valuation for the downgrade, noting that the stock is approaching the firm's target price and the 25-times multiple it uses to value Tower Semiconductor ostensibly already assumes some upside vs. its current estimates.\nTruist downgraded DigitalBridge (DBRG) to Hold from Buy with an unchanged price target of $16 following the announced all-cash acquisition by SoftBank Group (SFTBY) at $16 per share. The firm sees a low probability of a competing bid emerging.\nRaymond James double downgraded OceanFirst Financial (OCFC) to Market Perform from Strong Buy without a price target following the company's announcement to acquire Flushing Financial (FFIC) . The firm expects \"significant\" dilution and says the deal slows the benefit of OceanFirst's shift to a stronger core deposit franchise.\nRaymond James downgraded Flushing Financial (FFIC) to Market Perform from Outperform without a price target after the company agreed to be acquired by OceanFirst Financial (OCFC) . The deal was done at a fair price given the earnings challenges Flushing has faced due to the challenging rate environment for the past several years, the firm tells investors in a research note.\n\nTop Initiations:\n\nFreedom Capital initiated coverage of Serve Robotics (SERV) with a Buy rating and $16 price target. The firm believes Serve is positioned for \"strong growth and eventual profitability.\"\nFreedom Capital initiated coverage of International Bancshares (IBOC) with a Buy rating and $85 price target. While the bank has elevated commercial real estate concentration, interest-rate sensitivity, and exposure to cross-border activity, the firm sees these factors being balanced by strong profitability supported by \"best-in-class\" efficiency and conservative balance sheet positioning.\nFreedom Capital initiated coverage of Butterfly Network (BFLY) with a Buy rating and $5 price target. The firm sees continued revenue expansion for Butterfly, driven by iQ3 probe and enterprise software adoption.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "ADI",
      "Date": "2025-12-31",
      "Time": "22:30:03",
      "Source": "Zacks",
      "Title": "Brokers Suggest Investing in Analog Devices (ADI): Read This Before Placing a Bet",
      "URL": "https://finance.yahoo.com/news/brokers-suggest-investing-analog-devices-143003563.html",
      "Content": "Brokers Suggest Investing in Analog Devices (ADI): Read This Before Placing a Bet\n\nZacks Equity Research\nWed, December 31, 2025 at 6:30 AM PST 4 min read\n\nIn this article: ADI\n\nInvestors often turn to recommendations made by Wall Street analysts before making a Buy, Sell, or Hold decision about a stock. While media reports about rating changes by these brokerage-firm employed (or sell-side) analysts often affect a stock's price, do they really matter?\nLet's take a look at what these Wall Street heavyweights have to say about Analog Devices (ADI) before we discuss the reliability of brokerage recommendations and how to use them to your advantage.\n\nAnalog Devices currently has an average brokerage recommendation (ABR) of 1.70, on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell, etc.) made by 33 brokerage firms. An ABR of 1.70 approximates between Strong Buy and Buy.\nOf the 33 recommendations that derive the current ABR, 20 are Strong Buy and three are Buy. Strong Buy and Buy respectively account for 60.6% and 9.1% of all recommendations.\nBrokerage Recommendation Trends for ADI Check price target & stock forecast for Analog Devices here>>>\nThe ABR suggests buying Analog Devices, but making an investment decision solely on the basis of this information might not be a good idea. According to several studies, brokerage recommendations have little to no success guiding investors to choose stocks with the most potential for price appreciation.\n\nDo you wonder why? As a result of the vested interest of brokerage firms in a stock they cover, their analysts tend to rate it with a strong positive bias. According to our research, brokerage firms assign five \"Strong Buy\" recommendations for every \"Strong Sell\" recommendation.\nIn other words, their interests aren't always aligned with retail investors, rarely indicating where the price of a stock could actually be heading. Therefore, the best use of this information could be validating your own research or an indicator that has proven to be highly successful in predicting a stock's price movement.\nWith an impressive externally audited track record, our proprietary stock rating tool, the Zacks Rank, which classifies stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), is a reliable indicator of a stock's near-term price performance. So, validating the Zacks Rank with ABR could go a long way in making a profitable investment decision.\n\nZacks Rank Should Not Be Confused With ABR Although both Zacks Rank and ABR are displayed in a range of 1--5, they are different measures altogether.\nThe ABR is calculated solely based on brokerage recommendations and is typically displayed with decimals (example: 1.28). In contrast, the Zacks Rank is a quantitative model allowing investors to harness the power of earnings estimate revisions. It is displayed in whole numbers -- 1 to 5.\n\nStory Continues\nAnalysts employed by brokerage firms have been and continue to be overly optimistic with their recommendations. Since the ratings issued by these analysts are more favorable than their research would support because of the vested interest of their employers, they mislead investors far more often than they guide.\n\nIn contrast, the Zacks Rank is driven by earnings estimate revisions. And near-term stock price movements are strongly correlated with trends in earnings estimate revisions, according to empirical research.\nFurthermore, the different grades of the Zacks Rank are applied proportionately across all stocks for which brokerage analysts provide earnings estimates for the current year. In other words, at all times, this tool maintains a balance among the five ranks it assigns.\nThere is also a key difference between the ABR and Zacks Rank when it comes to freshness. When you look at the ABR, it may not be up-to-date. Nonetheless, since brokerage analysts constantly revise their earnings estimates to reflect changing business trends, and their actions get reflected in the Zacks Rank quickly enough, it is always timely in predicting future stock prices.\n\nIs ADI Worth Investing In? Looking at the earnings estimate revisions for Analog Devices, the Zacks Consensus Estimate for the current year has increased 0.5% over the past month to $9.79.\nAnalysts' growing optimism over the company's earnings prospects, as indicated by strong agreement among them in revising EPS estimates higher, could be a legitimate reason for the stock to soar in the near term.\n\nThe size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #2 (Buy) for Analog Devices. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>>\nTherefore, the Buy-equivalent ABR for Analog Devices may serve as a useful guide for investors.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAnalog Devices, Inc. (ADI) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "GFS",
      "Date": "2025-12-31",
      "Time": "22:04:15",
      "Source": "MT Newswires",
      "Title": "GlobalFoundries Path to Stronger Revenue Likely to Take Time Amid Industry Challenges, Wedbush Says",
      "URL": "https://finance.yahoo.com/news/globalfoundries-path-stronger-revenue-likely-140415954.html",
      "Content": "PREMIUM\nGlobalFoundries Path to Stronger Revenue Likely to Take Time Amid Industry Challenges, Wedbush Says\n\nMT Newswires\nWed, December 31, 2025 at 6:04 AM PST 2 min read\n\nIn this article: GFS\n\nGlobalFoundries' (GFS) catalysts for stronger revenue and improved margins may take some time to mat\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "SIMO",
      "Date": "2025-12-31",
      "Time": "22:00:03",
      "Source": "Zacks",
      "Title": "Investors Heavily Search Silicon Motion Technology Corporation (SIMO): Here is What You Need to Know",
      "URL": "https://finance.yahoo.com/news/investors-heavily-search-silicon-motion-140003184.html",
      "Content": "Investors Heavily Search Silicon Motion Technology Corporation (SIMO): Here is What You Need to Know\n\nZacks Equity Research\nWed, December 31, 2025 at 6:00 AM PST 5 min read\n\nIn this article: SIMO\n\n^GSPC\n\nSilicon Motion (SIMO) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock.\nOver the past month, shares of this chip company have returned +2.1%, compared to the Zacks S&P 500 composite's +0.8% change. During this period, the Zacks Computer - Integrated Systems industry, which Silicon Motion falls in, has gained 5.5%. The key question now is: What could be the stock's future direction?\n\nAlthough media reports or rumors about a significant change in a company's business prospects usually cause its stock to trend and lead to an immediate price change, there are always certain fundamental factors that ultimately drive the buy-and-hold decision.\nEarnings Estimate Revisions Rather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\n\nFor the current quarter, Silicon Motion is expected to post earnings of $1.31 per share, indicating a change of +44% from the year-ago quarter. The Zacks Consensus Estimate remained unchanged over the last 30 days.\nFor the current fiscal year, the consensus earnings estimate of $3.55 points to a change of +3.5% from the prior year. Over the last 30 days, this estimate has remained unchanged.\nFor the next fiscal year, the consensus earnings estimate of $4.88 indicates a change of +37.5% from what Silicon Motion is expected to report a year ago. Over the past month, the estimate has remained unchanged.\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #2 (Buy) for Silicon Motion.\n\nStory continues\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS Revenue Growth Forecast Even though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\n\nFor Silicon Motion, the consensus sales estimate for the current quarter of $260.55 million indicates a year-over-year change of +36.3%. For the current and next fiscal years, $863.29 million and $1.05 billion estimates indicate +7.4% and +21.2% changes, respectively.\nLast Reported Results and Surprise History Silicon Motion reported revenues of $242 million in the last reported quarter, representing a year-over-year change of +13.9%. EPS of $1 for the same period compares with $0.92 a year ago.\nCompared to the Zacks Consensus Estimate of $225.07 million, the reported revenues represent a surprise of +7.52%. The EPS surprise was +23.46%.\n\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates three times over this period.\nValuation No investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\n\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nSilicon Motion is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nConclusion The facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Silicon Motion. However, its Zacks Rank #2 does suggest that it may outperform the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nSilicon Motion Technology Corporation (SIMO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "QCOM",
      "Date": "2025-12-31",
      "Time": "21:23:00",
      "Source": "Zacks",
      "Title": "Can Qualcomm Stock Benefit From a Foray Into Mid-Range AI Chips?",
      "URL": "https://finance.yahoo.com/news/qualcomm-stock-benefit-foray-mid-132300566.html",
      "Content": "Can Qualcomm Stock Benefit From a Foray Into Mid-Range AI Chips?\n\nSupriyo Bose\nWed, December 31, 2025 at 5:23 AM PST 3 min read\n\nIn this article: QCOM\n\nMSFT\n\nARM\n\nQualcomm Incorporated QCOM has forayed into mid-range AI desktops and laptops with its Snapdragon X chip. This SoC is the fourth such product in the Snapdragon X processor line, following the successful launch of the Snapdragon X Plus 8-core, Snapdragon X Plus and Snapdragon X Elite series. Based on a 4-nanometer process, the Snapdragon X chip comprises an 8-core Oryon central processor, a graphics component and a neural processing unit (NPU). The NPU accelerates AI workloads, offering 45 TOPS (trillions of operations per second), making it an ideal platform to power Copilot+PCs – Microsoft’s vision of AI-first, flagship Windows hardware.\n\nAI PCs incorporate an additional processor designed specifically to accelerate AI capabilities. This specialized hardware enhances features like personal assistants and task automation. One of the significant selling points of AI PCs is their enhanced battery life. Qualcomm's chips, which are based on Arm Holdings Plc designs, promise extended use without frequent charging.\n\nLeveraging processors with multi-core CPUs with cutting-edge features, amazing graphics and worldwide network connectivity, Qualcomm Snapdragon mobile platforms are fast and have superb power efficiency. Smartphones and mobile devices built with Snapdragon mobile platforms enable immersive augmented reality and virtual reality experiences, brilliant camera capabilities, superior 4G LTE and 5G connectivity with state-of-the-art security solutions.\n\nTech Firms Focusing on AI NVIDIA Corporation NVDA is rapidly gaining traction in enterprise AI, expanding its market beyond cloud providers. Major companies across industries are integrating NVIDIA’s AI platforms to automate workflows, enhance productivity and improve decision-making. The company’s DGX Cloud AI infrastructure, which allows enterprises to train and deploy AI models at scale, has seen increased adoption. The expansion of CUDA software and AI frameworks strengthens NVIDIA’s ecosystem, making it the preferred choice for enterprises developing AI applications. With AI adoption expected to accelerate in 2025 and beyond, NVIDIA’s software and AI cloud solutions are a significant revenue driver.\n\nIntel Corporation INTC is investing to expand its manufacturing capacity to accelerate its IDM 2.0 (Integrated Device Manufacturing) strategy. The company is taking various decisions to gain a firmer footing in the expansive AI sector. Its Xeon 6 processors with Performance-cores (P-Cores) can support large AI workloads across diverse sectors. With industry-leading capabilities in AI processing, the Xeon 6 family delivers the industry’s best CPU for AI at a lower total cost of ownership. Intel's innovative AI solutions are likely to benefit the broader semiconductor ecosystem by driving down costs, improving performance and fostering an open, scalable AI environment.\n\nStory Continues\nQCOM’s Price Performance, Valuation and Estimates Qualcomm’s shares have gained 13% over the past year compared with the industry’s growth of 41%.\n\nImage Source: Zacks Investment Research\nGoing by the price/earnings ratio, the company's shares currently trade at 14.16 forward earnings, lower than 34.14 for the industry.\n\nImage Source: Zacks Investment Research\nEarnings estimates for fiscal 2026 have increased 2% to $12.15 per share over the past 60 days, while the same for fiscal 2027 are up 3.4% to $12.6.\n\nImage Source: Zacks Investment Research\nQualcomm currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "KLAC",
      "Date": "2025-12-31",
      "Time": "21:00:31",
      "Source": "Barchart",
      "Title": "Earnings Preview: What to Expect From KLA Corporation's Report",
      "URL": "https://finance.yahoo.com/m/75053a84-d046-35c1-9a7c-cfa809d145d8/earnings-preview%3A-what-to.html",
      "Content": "Earnings Preview: What to Expect From KLA Corporation's Report\n\nNeha Panjwani\nWed, December 31, 2025 at 5:00 AM PST 2 min read\n\nIn this article: KLAC\n\nKLA Corporation (KLAC), headquartered in Milpitas, California, designs, manufactures, and markets process control, process-enabling, and yield management solutions for the semiconductor and related electronics industries worldwide. With a market cap of $163.4 billion, the company offers surface profilers, nanomechanical testers, chips, and semiconductor assembly solutions. The leading supplier of process control and yield management solutions is expected to announce its fiscal second-quarter earnings for 2026 in the near future.\n\nAhead of the event, analysts expect KLAC to report a profit of $8.75 per share on a diluted basis, up 6.7% from $8.20 per share in the year-ago quarter. The company beat the consensus estimates in each of the last four quarters.\nMore News from Barchart Dear UiPath Stock Fans, Mark Your Calendars for January 2\nHow to Buy PYPL for a 29% Discount, or Achieve a 7% Annual Return\nApple is an Analyst Favorite, But AAPL Stock Has Been Flat - Shorting Puts Is the Best Play\nStop Missing Market Moves: Get the FREE Barchart Brief – your midday dose of stock movers, trending sectors, and actionable trade ideas, delivered right to your inbox. Sign Up Now!\nFor the full year, analysts expect KLAC to report EPS of $35.44, up 6.5% from $33.28 in fiscal 2025. Its EPS is expected to rise 17.5% year over year to $41.63 in fiscal 2027.\nKLAC stock has outperformed the S&P 500 Index’s ($SPX) 16.8% gains over the past 52 weeks, with shares up 96.3% during this period. Similarly, it outperformed the Technology Select Sector SPDR Fund’s (XLK) 24% returns over the same time frame.\nOn Oct. 29, KLAC shares closed up more than 2% after reporting its Q1 results. Its adjusted EPS of $8.81 surpassed Wall Street expectations of $8.55. The company’s revenue was $3.21 billion, exceeding Wall Street's $3.16 billion forecast. For Q2, KLAC expects adjusted EPS to range from $7.92 to $9.48 and revenue in the range of $3.1 billion to $3.4 billion.\n\nAnalysts’ consensus opinion on KLAC stock is moderately bullish, with a “Moderate Buy” rating overall. Out of 26 analysts covering the stock, 12 advise a “Strong Buy” rating, one suggests a “Moderate Buy,” and 13 give a “Hold.” KLAC’s average analyst price target is $1,297.25, indicating a potential upside of 4.3% from the current levels.\nOn the date of publication, Neha Panjwani did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "KLAC",
      "Date": "2025-12-31",
      "Time": "07:00:03",
      "Source": "Zacks",
      "Title": "KLA (KLAC) Suffers a Larger Drop Than the General Market: Key Insights",
      "URL": "https://finance.yahoo.com/news/kla-klac-suffers-larger-drop-230003693.html",
      "Content": "KLA (KLAC) Suffers a Larger Drop Than the General Market: Key Insights\n\nZacks Equity Research\nTue, December 30, 2025 at 3:00 PM PST 3 min read\n\nIn this article: KLAC\n\n^GSPC\n\n^DJI\n\n^IXIC\n\nKLA (KLAC) ended the recent trading session at $1,243.65, demonstrating a -1.33% change from the preceding day's closing price. The stock trailed the S&P 500, which registered a daily loss of 0.14%. Meanwhile, the Dow lost 0.2%, and the Nasdaq, a tech-heavy index, lost 0.24%.\nThe maker of equipment for manufacturing semiconductors's stock has climbed by 8.92% in the past month, exceeding the Computer and Technology sector's gain of 0.2% and the S&P 500's gain of 0.94%.\n\nInvestors will be eagerly watching for the performance of KLA in its upcoming earnings disclosure. The company is expected to report EPS of $8.75, up 6.71% from the prior-year quarter. In the meantime, our current consensus estimate forecasts the revenue to be $3.24 billion, indicating a 5.39% growth compared to the corresponding quarter of the prior year.\nKLAC's full-year Zacks Consensus Estimates are calling for earnings of $35.44 per share and revenue of $13.04 billion. These results would represent year-over-year changes of +6.49% and +7.31%, respectively.\nIt is also important to note the recent changes to analyst estimates for KLA. These latest adjustments often mirror the shifting dynamics of short-term business patterns. As such, positive estimate revisions reflect analyst optimism about the business and profitability.\n\nOur research suggests that these changes in estimates have a direct relationship with upcoming stock price performance. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.\nThe Zacks Rank system, running from #1 (Strong Buy) to #5 (Strong Sell), holds an admirable track record of superior performance, independently audited, with #1 stocks contributing an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has shifted 0.1% upward. KLA is holding a Zacks Rank of #2 (Buy) right now.\nIn the context of valuation, KLA is at present trading with a Forward P/E ratio of 35.57. Its industry sports an average Forward P/E of 24.48, so one might conclude that KLA is trading at a premium comparatively.\n\nIt is also worth noting that KLAC currently has a PEG ratio of 3.36. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. The Electronics - Miscellaneous Products was holding an average PEG ratio of 1.9 at yesterday's closing price.\nThe Electronics - Miscellaneous Products industry is part of the Computer and Technology sector. With its current Zacks Industry Rank of 79, this industry ranks in the top 32% of all industries, numbering over 250.\n\nStory Continues\nThe Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nDon't forget to use Zacks.com to keep track of all these stock-moving metrics, and others, in the upcoming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nKLA Corporation (KLAC) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "ARM",
      "Date": "2025-12-31",
      "Time": "02:10:00",
      "Source": "Zacks",
      "Title": "PLTR vs. ARM: Which AI-Tech Stock is the Better Buy Now?",
      "URL": "https://finance.yahoo.com/news/pltr-vs-arm-ai-tech-181000942.html",
      "Content": "PLTR vs. ARM: Which AI-Tech Stock is the Better Buy Now?\n\nShuvra Shankar Dey\nTue, December 30, 2025 at 10:10 AM PST 5 min read\n\nIn this article: PLTR\n\nARM\n\nPalantir Technologies PLTR and Arm Holdings ARM are both deeply aligned with the same powerful theme: the accelerating global adoption of artificial intelligence. Each plays a foundational role in enabling AI at scale.\nPalantir supports AI deployment through sophisticated data integration, analytics and decision-making platforms that help organizations operationalize complex data. ARM underpins AI progress at the hardware level by licensing energy-efficient processor architectures that power AI workloads across mobile devices, cloud infrastructure and data centers. While their offerings differ, both companies occupy critical points in the AI value chain, directly benefiting from the rising demand for intelligent, scalable computing solutions from enterprises, governments and consumers.\n\nThe Case for PLTR Palantir has strategically positioned itself to capitalize on the changing dynamics of the AI economy.\nAt the core of Palantir’s strategy is its Artificial Intelligence Platform, which enables businesses to structure and organize their data, whether financial, supply chain, operational or HR-related, so that AI can process and execute tasks more effectively. By leveraging an ontology-driven approach, Palantir creates digital representations of entire enterprises, allowing AI to interact seamlessly with business operations. Unlike companies that contribute to the oversupply of AI models, Palantir is actively shaping the demand side of the AI economy, positioning itself as a key player in the adoption of enterprise AI.\n\nPalantir’s financial health further reinforces its investment appeal. As of Sept. 30, 2025, the company held $6.4 billion in cash and equivalents, with zero debt, providing ample liquidity to invest in growth initiatives.\nMoreover, Palantir’s recent financial performance underscores its strength. In the third quarter of 2025, revenues surged 63% year over year, with U.S. revenues increasing 77% year over year and U.S. commercial business experiencing 121% growth. The company closed 204 deals of at least $1 million, 91 deals of at least $5 million and 53 deals of at least $10 million in the quarter.\nThe company achieved its highest-ever adjusted operating margin of 51%, reflecting the scalability of its software business model and disciplined cost control. GAAP operating income reached $393 million, while GAAP net income came in at $476 million, translating to GAAP EPS of 18 cents and adjusted EPS of 21 cents, which increased 110% year over year.\n\nThe Case for ARM Arm Holdings’ foundational advantage in power-efficient chip architecture continues to anchor its dominance in mobile computing, but its influence extends far beyond smartphones and tablets. Long known for enabling energy-saving designs for Apple (AAPL), Qualcomm (QCOM) and Samsung, Arm is becoming increasingly central as these companies accelerate their focus on artificial intelligence (AI) and the Internet of Things (IoT).\n\nStory Continues\nARM’s unique ability to deliver high performance with minimal power makes its architecture ideal for an era where intelligence is embedded everywhere, from wearables to edge devices and cloud infrastructure. AI models are being deployed across a wide array of consumer and enterprise products, and Arm’s flexible, power-thrifty designs are being adopted to support these new workloads. Apple continues to rely on ARM-based architecture for its M-series chips as it deepens AI integration across its devices. Qualcomm is using ARM designs to drive AI-enhanced smartphones and automotive platforms, while Samsung leverages ARM’s technology across mobile, consumer electronics and its expanding Exynos portfolio targeting AI and IoT applications.\n\nThe reliance of these major tech players on Arm Holdings is not only consistent but also strengthening. As Apple, Qualcomm and Samsung scale their AI ambitions and broaden their IoT ecosystems, they depend even more on ARM’s ability to deliver power-efficient performance at global scale. The company’s ongoing push to optimize its architecture for machine learning and edge computing ensures tight alignment with the emerging needs of its top customers.\nAs a result, Arm Holdings is evolving from a mobile-centric enabler to a critical AI and IoT infrastructure layer for the world’s leading device makers, solidifying its strategic importance across the broader technology landscape.\nHow Do Zacks Estimates Compare for PLTR & ARM? The Zacks Consensus Estimate for PLTR’s 2025 sales and EPS indicates year-over-year growth of 54% and 78%, respectively. EPS estimates have been trending upward over the past 60 days.\nImage Source: Zacks Investment Research\nThe Zacks Consensus Estimate for ARM’s fiscal 2026 sales and EPS indicates year-over-year growth of 21.5% and 5.5%, respectively. EPS estimates have trended upward over the past 60 days.\nImage Source: Zacks Investment Research\nARM’s Valuation More Attractive Than PLTR While ARM appears attractively valued with a forward 12-month P/E of 52.93X versus its median of 121.35X, suggesting that the stock could be undervalued relative to its historical range, PLTR is trading at a forward 12-month P/E of 177.24X, below its 12-month median of 308.7X.\nPLTR Seems a Choice In the current AI-driven market environment, Palantir stands out as the more compelling choice. While both companies benefit from long-term AI adoption, Palantir is more directly tied to real-world AI execution and enterprise decision-making. Its platforms are already embedded in mission-critical operations across commercial and government sectors, creating durable demand and high switching costs. Palantir’s focus on operational AI positions it on the front lines of adoption rather than infrastructure dependency. With stronger momentum, clearer AI monetization and a Buy rating compared with Arm’s Hold stance, Palantir offers greater upside for investors seeking exposure to AI as a transformative business force rather than a supporting technology layer.\n\nWhile PLTR currently carries a Zacks Rank #2 (Buy), ARM has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nARM Holdings PLC Sponsored ADR (ARM) : Free Stock Analysis Report\nPalantir Technologies Inc. (PLTR) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "KLAC",
      "Date": "2025-12-30",
      "Time": "21:30:02",
      "Source": "Zacks",
      "Title": "Here's How Much a $1000 Investment in KLA Made 10 Years Ago Would Be Worth Today",
      "URL": "https://finance.yahoo.com/news/heres-much-1000-investment-kla-133002631.html",
      "Content": "Here's How Much a $1000 Investment in KLA Made 10 Years Ago Would Be Worth Today\n\nZacks Equity Research\nTue, December 30, 2025 at 5:30 AM PST 4 min read\n\nIn this article: KLAC\n\nFor most investors, how much a stock's price changes over time is important. Not only can it impact your investment portfolio, but it can also help you compare investment results across sectors and industries.\nThe fear of missing out, or FOMO, also plays a factor in investing, especially with particular tech giants, as well as popular consumer-facing stocks.\n\nWhat if you'd invested in KLA (KLAC) ten years ago? It may not have been easy to hold on to KLAC for all that time, but if you did, how much would your investment be worth today?\nKLA's Business In-Depth With that in mind, let's take a look at KLA's main business drivers.\nSan Jose, CA-based KLA Corporation is an original equipment manufacturer (OEM) of process diagnostics and control (PDC) equipment and yield management solutions required for the fabrication of semiconductor integrated circuits (ICs) or chips. The company has a comprehensive portfolio of products addressing each major PDC subsegment&mdash;photomask (reticle) inspection, wafer inspection/defect review and metrology.\n\nReticle production is vital to the semiconductor device formation process. Reticles are used to control the precise deposition of materials onto the wafer, which ultimately change its chemical characteristics, imparting specific functionalities to the ICs thus created. Inspection and metrology tools measure the quality of the reticles, helping to improve reticle production yields. As a result of the broader applicability of semiconductors, shrinking form factors and increasing functionalities of individual chips, reticle design and production are growing in importance. Intel and Taiwan Semiconductor were the largest customers in the last three years, accounting for more than 10% of total sales in each year.\n\nKLA reported revenues of $12.16 billion in fiscal 2025. Product revenues accounted for 78% while the rest came from Service segment.\n\nKLA&rsquo;s two main product lines are defect inspection and metrology. The company&rsquo;s defect inspection tools have very broad application in chip, wafer, reticle, storage, compound semiconductor and MEMS manufacturing. Metrology tools are used to gather critical dimension measurements of the wafer and process dimensions such as film thickness, lithography overlay and surface profiling. The company&rsquo;s metrology products are used in chip, wafer, reticle and solar device manufacturing. KLA also offers other products and services.\n\nIn addition to new tools, KLA also offers a comprehensive portfolio of refurbished tools that upgrade and improve yields of existing equipment under the KT-Certified program. Refurbished tools are currently sold to IC, reticle, substrate, MEMS and data storage manufacturers.\n\nAlthough KLA is a major player in each of its served markets, it faces competition from other large equipment suppliers such as Applied Materials and Hitachi High-Technologies Corporation.\n\nStory Continues\nBottom Line While anyone can invest, building a lucrative investment portfolio takes research, patience, and a little bit of risk. If you had invested in KLA ten years ago, you're probably feeling pretty good about your investment today.\nA $1000 investment made in December 2015 would be worth $18,031.33, or a 1,703.13% gain, as of December 30, 2025, according to our calculations. Investors should note that this return excludes dividends but includes price increases.\n\nThe S&P 500 rose 232.27% and the price of gold increased 293.02% over the same time frame in comparison.\nLooking ahead, analysts are expecting more upside for KLAC.\nKLA's fiscal first-quarter revenues and earnings increased year over year. The uptick can be attributed to strong demand in leading-edge logic, high-bandwidth memory (HBM) and advanced packaging, which drove growth in the semiconductor industry. Advanced packaging is expected to exceed $925 million in 2025. The company's robust portfolio and its leadership in process control systems are enabling customers to manage increasing design complexity. The services business also performed well, contributing significantly to revenue growth. KLA is well-positioned to capitalize on AI advancements, with AI driving demand for higher-value wafer processing and more complex designs. However, extended U.S. export controls on China impacted revenues in the reported quarter. Tariff-related uncertainties also impacted the company's performance.\nThe stock is up 8.92% over the past four weeks, and no earnings estimate has gone lower in the past two months, compared to 3 higher, for fiscal 2025. The consensus estimate has moved up as well.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nKLA Corporation (KLAC) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "CSCO",
      "Date": "2025-12-30",
      "Time": "19:20:00",
      "Source": "Zacks",
      "Title": "The Zacks Analyst Blog Highlights Apple, Cisco Systems and IBM",
      "URL": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-apple-112000973.html",
      "Content": "The Zacks Analyst Blog Highlights Apple, Cisco Systems and IBM\n\nZacks Equity Research\nTue, December 30, 2025 at 3:20 AM PST 5 min read\n\nIn this article: AAPL\n\nCSCO\n\nIBM\n\nFor Immediate Release Chicago, IL &ndash; December 30, 2025 &ndash; Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Apple Inc. AAPL, Cisco Systems, Inc. CSCO and IBM Corp. IBM.\n\nHere are highlights from Monday&rsquo;s Analyst Blog:\nTop Research Reports for Apple, Cisco & IBM\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Apple Inc., Cisco Systems, Inc. and IBM Corp. These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\n\nYou can see all of today&rsquo;s research reports here >>>\nAhead of Wall Street\n\nThe daily 'Ahead of Wall Street' article is a must-read for all investors who would like to be ready for that day's trading action. The article comes out before the market opens, attempting to make sense of that morning's economic releases and how they will affect that day's market action. You can read this article for free on our home page and can actually sign up there to get an email notification as this article comes out each morning.\n\nYou can read today's AWS here >>> Pre-Markets Lower on Low Seasonal Volume\n\nToday's Featured Research Reports\n\nApple&rsquo;s shares have outperformed the Zacks Computer - Micro Computers industry over the past six months (+33.5% vs. +32.6%). The company is benefiting from strong growth in its Services revenues. The company now has more than 1 billion paid subscribers across its Services portfolio. The new iPhone 17 series is expected to drive top-line growth. Expanding capabilities of AI Intelligence is noteworthy.\n\nApple expects the December quarter&rsquo;s (first-quarter fiscal 2026) net sales to grow between 10% and 12% on a year-over-year basis. The company expects iPhone sales to grow in double digits year over year. The Mac segment is expected to face a tough year-over-year comparison, and Services are expected to grow at the 2025 rate.\n\nHowever, gross margin is expected to be 47-48% in the first quarter of fiscal 2026, including a tariff impact of $1.4 billion. Increasing regulatory headwinds and tariffs are a concern.\n\n(You can read the full research report on Apple here >>> )\n\nShares of Cisco have outperformed the Zacks Computer - Networking industry over the past six months (+14% vs. +13.6%). The company&rsquo;s business model has evolved with subscription revenues accounting for more than half of its total revenues. An increase in recurring revenue base bodes well for investors. Splunk's acquisition enhances the company&rsquo;s recurring revenue base.\n\nThe buyout significantly expands Cisco&rsquo;s portfolio of software-based solutions, contributing more than $4 billion in ARR and making it one of the largest software companies in the world. The launch of AI-powered Hypershield, which combines security and networking, strengthened Cisco&rsquo;s security portfolio.\n\nNetworking sales benefited from strong demand for AI infrastructure and campus networking solutions. Product orders from service provider and cloud customers were strong driven by high double-digit order growth in hyperscalers. However, stiffening competition is a headwind.\n\n(You can read the full research report on Cisco here >>> )\n\nIBM&rsquo;s shares have gained +4.8% over the past six months against the Zacks Computer - Integrated Systems industry&rsquo;s gain of +47.8%. The company is betting big on the Watsonx platform, which is likely to be its core technology platform for AI capabilities. The company&rsquo;s focus on quantum technology for solutions to complex problems beyond the reach of classical computing is a tailwind.\n\nIBM is benefiting from a surge in demand for heterogeneous, dynamic and complex infrastructure strategies, which have led firms to undertake a cloud-agnostic and interoperable approach to highly secure multi-cloud management. This, in turn, has led to sustainable growth through advanced technology and deep consulting expertise.\n\nHowever, weakness in its traditional business and foreign exchange volatility remain concerns. Macroeconomic headwinds are worrisome. IBM&rsquo;s acquisition spree has also escalated integration risks, while its high debt level is burdensome.\n\n(You can read the full research report on IBM here >>> )\n\nStory Continues\nWhy Haven't You Looked at Zacks' Top Stocks?\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\nToday you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss . This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nApple Inc. (AAPL) : Free Stock Analysis Report\nInternational Business Machines Corporation (IBM) : Free Stock Analysis Report\nCisco Systems, Inc. (CSCO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "ADI",
      "Date": "2025-12-30",
      "Time": "19:14:00",
      "Source": "Zacks",
      "Title": "The Zacks Analyst Blog Highlights International Business Machines, Analog Devices, Johnson & Johnson's, The Gap and Hewlett Packard Enterprise",
      "URL": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-international-111400655.html",
      "Content": "The Zacks Analyst Blog Highlights International Business Machines, Analog Devices, Johnson & Johnson's, The Gap and Hewlett Packard Enterprise\n\nZacks Equity Research\nTue, December 30, 2025 at 3:14 AM PST 9 min read\n\nIn this article: IBM\n\nJNJ\n\nHPE\n\nADI\n\nGAP\n\nFor Immediate Release Chicago, IL &ndash; December 30, 2025 &ndash; Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: International Business Machines Corp. IBM, Analog Devices, Inc. ADI, Johnson & Johnson&rsquo;s JNJ, The Gap, Inc. GAP and Hewlett Packard Enterprise HPE.\n\nHere are highlights from Monday&rsquo;s Analyst Blog:\nTop 5 High-Yield S&P 500 Stock to Buy for 2026\nThe U.S. stock market has experienced significant volatility at the beginning of 2025 owing to a multitude of factors. The trade policy framework undertaken in the new Trump administration has reshaped market sentiment. The aggressive tariff measures imposed by Washington on its major trading partners have left several businesses in a state of uncertainty. The growing Sino-U.S. trade tension was a concerning factor for investors. The U.S. government aims to limit Beijing&rsquo;s access to high-end technologies. It has imposed restrictions on the export of advanced semiconductor tech to China.\nThe tariff-related uncertainties have significantly affected companies with a strong presence in the emerging markets of Asia and Latin America. Moreover, the war in Europe and the Middle East has further aggravated the market uncertainty. These developments have led to rising manufacturing costs and supply chain issues, putting pressure on margins. However, there were some positive macroeconomic developments as well in 2025. The federal reserve rate cuts have lowered borrowing costs and improved corporate profitability.\n\nTrade-related risks and changes in monetary policy led to frequent stock price fluctuations. However, broader market momentum remained positive with tech stocks largely leading the bull run. Growing spending on AI infrastructure and digital transformation is driving growth in the tech sector. Despite a hike in energy prices, the overall annual inflation rate was lower than expected in 2025.\nKey Growth Drivers for 2026\nRapid AI buildouts are expected to be a key driver for businesses in 2026. Businesses in several industries such as manufacturing, healthcare, energy, social ecommerce, telecom and others are rapidly incorporating AI across the portfolio to gain a competitive edge. However, this rapid AI build-out requires substantial computing infrastructure, data centers to support these AI workloads, as well as energy optimization and cooling technologies.\n\nStory Continues\nAI integration has become capex-heavy. There is a gap between investing in AI infrastructure and realizing gains from this investment. The growth in AI capex is expected to put pressure on the balance sheet and can create margin pressure in the short term. The companies with stable earnings and robust cash flow are expected to be the gainers amid such emerging market trends.\n\nChina is a major supplier of rare earth materials that many major tech companies rely on. This can force the United States to avoid imposing high tariffs and maintain a cordial relationship with the Communist nation, at least in the near term. However, the U.S. government&rsquo;s effort to reduce the widening trade deficit with other nations indicates that tariff-related uncertainties will remain a concern for investors in the upcoming quarters. After three rate cuts in 2025, the chances of another rate cut remain low, at least at the beginning of 2026.\nAmid such macroeconomic uncertainties and persistent geopolitical volatility, there is a growing interest in S&P 500 stocks with high dividend yield. So far in 2025, the average dividend yield of S&P 500 stocks stands at 1.07%. Based on above average dividend yields, strong fundamentals and growing AI-related investment, we have shortlisted five stocks that have strong growth potential in 2026.\n\nKey Picks\nInternational Business Machines Corp. : Headquartered in Armonk, NY, IBM is a leading provider of cloud and data platforms. In addition, the company provides advanced information technology solutions, computer systems, quantum computing and supercomputing solutions, enterprise software, storage systems and microelectronics.\nThe company has positioned itself as a major player in the expanding AI landscape worldwide. Its breakthrough innovations, hybrid cloud and AI are utilized by clients across 175 countries to streamline business processes, optimize cost and gain a competitive edge. The company boasts a vast client base across multiple industries, including financial services, telecommunications, healthcare, retail and more. In the third quarter, IBM&rsquo;s free cash flow improved to $2.37 billion, up from $2.06 billion a year ago.\n\nIBM pays out a quarterly dividend of $1.68 per share ($6.72 annualized), with a 2.2% yield at the current stock price. IBM&rsquo;s payout ratio is 61%, with a five-year dividend growth rate of 0.62%. The company currently carries a Zacks Rank #2 (Buy). (Check IBM&rsquo;s dividend history here). You can see the complete list of today&rsquo;s Zacks #1 Rank (Strong Buy) stocks here .\nAnalog Devices, Inc. : Headquartered in Norwood, MA, Analog Devices is an original equipment manufacturer of semiconductor devices, specifically, analog, mixed signal and digital signal processing (DSP) integrated circuits. The company&rsquo;s top line is benefiting from strong growth in its industrial, aerospace and defense businesses, fueled by demand for AI chip infrastructure buildout, automated test equipment, and a rebound in automation and healthcare markets.\n\nAnalog Devices&rsquo; strong operating cash flow has helped it return cash through regular quarterly dividend payments and share repurchases. In fiscal 2025, the company generated operating cash flow of $4.81 billion and free cash flow of $4.28 billion.\nADI pays out a quarterly dividend of 99 cents per share ($3.96 annualized), with a 1.43% yield at the current stock price. ADI&rsquo;s payout ratio is 51%, with a five-year dividend growth rate of 10.31%. The company currently carries a Zacks Rank #2. (Check ADI&rsquo;s dividend history here)\nJohnson & Johnson&rsquo;s : Headquartered in New Brunswick, NJ, Johnson & Johnson is a leading provider of pharmaceuticals and medical devices worldwide. With more than 275 subsidiaries, its business model is extremely well diversified. Its diversification helps it to withstand economic cycles more effectively.\n\nIn 2026, J&J expects accelerated growth in the Innovative Medicine segment to be driven by its key products, such as Darzalex, Tremfya, Spravato and Erleada, as well as new drugs like Carvykti, Tecvayli and Talvey, and recently launched products, including Tremfya in inflammatory bowel disease, Rybrevant plus Lazcluze in non-small cell lung cancer and the newly approved drug, Inlexzo in bladder cancer. The company reported a $17.22 billion in cash from operating activities.\nJNJ pays out a quarterly dividend of $1.3 per share ($5.2 annualized), with a 2.5% yield at the current stock price. JNJ&rsquo;s payout ratio is 50%, with a five-year dividend growth rate of 5.39%. The company currently carries a Zacks Rank #2. (Check JNJ&rsquo;s dividend history here)\n\nThe Gap, Inc. : With roughly 3,500 stores worldwide, The Gap, Inc. is a premier international specialty retailer offering a diverse range of clothing, accessories, and personal care products. Gap continues to benefit from strong brand performance and rising market share across its largest banners, supported by consistent progress on its brand reinvigoration strategy. Management remains focused on its four strategic priorities: driving financial and operational rigor, reinvigorating its brands, reinforcing its operating platform and supply chain, and energizing its internal culture.\nThe company reported net cash from operating activities of $607 million, with free cash flow of $280 million, underscoring its disciplined approach to business management. Gap pays out a quarterly dividend of 16 cents (66 cents annualized), with a 2.52% yield at the current stock price. GAP&rsquo;s payout ratio is 29%, with a five-year dividend growth rate of 1.49%. The company currently carries a Zacks Rank of 2. (Check GAP&rsquo;s dividend history here)\n\nHewlett Packard Enterprise : Headquartered in Spring, TX, Hewlett Packard Enterprise is a leading provider of essential enterprise technology. The company&rsquo;s top line is benefiting from solid traction in the AI networking market. The acquisition of Juniper Networks underlines Hewlett Packard Enterprise&rsquo;s relentless focus on fortifying its networking business, aligning with the burgeoning demand for high-growth solutions in the evolving tech landscape.\nIn the fourth quarter, HPE generated $2.5 billion in cash from operating activities and produced $1.9 billion in free cash flow, both increasing meaningfully from the prior-year period. HPE pays out a quarterly dividend of 14 cents (57 cents annualized), with a 2.33% yield at the current stock price. HPE&rsquo;s payout ratio is 33%, with a five-year dividend growth rate of 2.21%. The company currently carries a Zacks Rank #3 (Hold). (Check HPE&rsquo;s dividend history here).\n\nWhy Haven't You Looked at Zacks' Top Stocks?\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss . This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAnalog Devices, Inc. (ADI) : Free Stock Analysis Report\nInternational Business Machines Corporation (IBM) : Free Stock Analysis Report\nJohnson & Johnson (JNJ) : Free Stock Analysis Report\nThe Gap, Inc. (GAP) : Free Stock Analysis Report\nHewlett Packard Enterprise Company (HPE) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "CSCO",
      "Date": "2025-12-30",
      "Time": "02:53:00",
      "Source": "Zacks",
      "Title": "Top Research Reports for Apple, Cisco & IBM",
      "URL": "https://finance.yahoo.com/news/top-research-reports-apple-cisco-185300680.html",
      "Content": "Top Research Reports for Apple, Cisco & IBM\n\nMark Vickery\nMon, December 29, 2025 at 10:53 AM PST 6 min read\n\nIn this article: AAPL\n\nROL\n\nHSBC\n\nCSCO\n\nIBM\n\nMonday, December 29, 2025\n\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Apple Inc. (AAPL), Cisco Systems, Inc. (CSCO) and IBM Corp. (IBM). These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\n\nYou can see all of today&rsquo;s research reports here >>>\n\nAhead of Wall Street\n\nThe daily 'Ahead of Wall Street' article is a must-read for all investors who would like to be ready for that day's trading action. The article comes out before the market opens, attempting to make sense of that morning's economic releases and how they will affect that day's market action. You can read this article for free on our home page and can actually sign up there to get an email notification as this article comes out each morning.\nYou can read today's AWS here >>> Pre-Markets Lower on Low Seasonal Volume\n\nToday's Featured Research Reports\n\nApple&rsquo;s shares have outperformed the Zacks Computer - Micro Computers industry over the past six months (+33.5% vs. +32.6%). The company is benefiting from strong growth in its Services revenues. The company now has more than 1 billion paid subscribers across its Services portfolio. The new iPhone 17 series is expected to drive top-line growth. Expanding capabilities of AI Intelligence is noteworthy.\n\nApple expects the December quarter&rsquo;s (first-quarter fiscal 2026) net sales to grow between 10% and 12% on a year-over-year basis. The company expects iPhone sales to grow in double digits year over year. The Mac segment is expected to face a tough year-over-year comparison, and Services are expected to grow at the 2025 rate.\n\nHowever, gross margin is expected to be 47-48% in the first quarter of fiscal 2026, including a tariff impact of $1.4 billion. Increasing regulatory headwinds and tariffs are a concern.\n\n(You can read the full research report on Apple here >>> )\n\nShares of Cisco have outperformed the Zacks Computer - Networking industry over the past six months (+14% vs. +13.6%). The company&rsquo;s business model has evolved with subscription revenues accounting for more than half of its total revenues. An increase in recurring revenue base bodes well for investors. Splunk's acquisition enhances the company&rsquo;s recurring revenue base.\n\nThe buyout significantly expands Cisco&rsquo;s portfolio of software-based solutions, contributing more than $4 billion in ARR and making it one of the largest software companies in the world. The launch of AI-powered Hypershield, which combines security and networking, strengthened Cisco&rsquo;s security portfolio.\n\nNetworking sales benefited from strong demand for AI infrastructure and campus networking solutions. Product orders from service provider and cloud customers were strong driven by high double-digit order growth in hyperscalers. However, stiffening competition is a headwind.\n\n(You can read the full research report on Cisco here >>> )\n\nIBM&rsquo;s shares have gained +4.8% over the past six months against the Zacks Computer - Integrated Systems industry&rsquo;s gain of +47.8%. The company is betting big on the Watsonx platform, which is likely to be its core technology platform for AI capabilities. The company&rsquo;s focus on quantum technology for solutions to complex problems beyond the reach of classical computing is a tailwind.\n\nIBM is benefiting from a surge in demand for heterogeneous, dynamic and complex infrastructure strategies, which have led firms to undertake a cloud-agnostic and interoperable approach to highly secure multi-cloud management. This, in turn, has led to sustainable growth through advanced technology and deep consulting expertise.\n\nHowever, weakness in its traditional business and foreign exchange volatility remain concerns. Macroeconomic headwinds are worrisome. IBM&rsquo;s acquisition spree has also escalated integration risks, while its high debt level is burdensome.\n\n(You can read the full research report on IBM here >>> )\n\nOther noteworthy reports we are featuring today include HSBC Holdings plc (HSBC), Rollins, Inc. (ROL) and Summit Therapeutics Inc. (SMMT).\n\nMark Vickery\nSenior Editor\n\nNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\n\nStory Continues\nToday's Must Read\nStrong Services Growth to Aid Apple (AAPL) Amid Tariff Headwinds\n\nCisco (CSCO) Rides on Strong Networking Solution Demand\n\nIBM Rides on Solid Demand for Hybrid Cloud, AI and Quantum Technology\n\nFeatured Reports\nTechnological Prowess Aids Rollins (ROL), Rising Costs Ail\nPer the Zacks analyst, Rollins uses technology to boost operational efficiency and improve customer experience, supporting sustainable growth. Rising expenses remain a concern.\n\nSummit Therapeutics (SMMT) Rides on Upbeat Lung Cancer Study Data\nThe Zacks Analyst is encouraged by Summit's late-stage data which show that treatment with its experimental cancer drug bested Merck's blockbuster drug Keytruda in certain lung cancer patients.\nData Center Demand and Clean Energy Expansion Aid AES Corp. (AES)\nPer the Zacks analyst, AES is benefiting from increasing demand from data centers through PPAs. Its strategic shift toward clean energy and LNG expansion is expected to boost project pipelines.\nOvintiv's (OVV) Strong Position in Top Basins Enhances Growth\nThe Zacks analyst believes that Ovintiv's strong presence in the Montney, Anadarko, and Permian Basins gives it a competitive edge for future growth, but is worried about its debt reduction strategy.\n\nSteady Expansion Supports Planet Fitness Amid Elevated Attrition\nPer the Zacks analyst, Planet Fitness benefits from club growth, equipment sales and digital efforts, but elevated attrition following the rollout of its \"click-to-cancel\" policy remains a headwind.\nGSG Segment to Benefit Tetra Tech (TTEK) Amid Forex Woes\nPer the Zacks analyst, solid traction of Tetra Tech's Government Services Group (GSG) Segment, led by advanced water infrastructure projects should drive its growth. Forex woes are an added concern.\nRobust New Store Growth Aid National Vision (EYE) Amid Rising Expenses\nPer the Zacks analyst, National Vision's notable store count growth for America's Best and Eyeglass World brands, should contribute to top line. Yet, rising costs and expenses continue to dent profit.\n\nNew Upgrades\nAsia Pivot Strategy, Business Simplification, Rates Aid HSBC (HSBC)\nPer the Zacks analyst, focus on expansion in the Asia region, business simplifying initiatives, exiting from less profitable markets, global presence and high rates will support HSBC's financials.\nFive Below (FIVE) Gains on Higher Traffic, Strong Q3 Comps Growth\nPer the Zacks analyst, Five Below's strong Q3 comps were fueled by higher transactions, improved conversion, and increased customer traffic. The company expects fiscal 2025 comps growth of 9.4-10.1%.\nScience Applications (SAIC) Rides on Contract Wins, Acquisitions\nPer the Zacks analyst, Science Applications is benefiting from new contracts supporting IT modernization. Moreover, acquisitions like SilverEdge Government Solutions and Koverse bode well for growth.\n\nNew Downgrades\nPost Holdings (POST) Faces Volume Declines and Margin Pressure\nAs per the Zacks analyst, Post Holdings remains under pressure from weak demand, volume declines, margin erosion and macro headwinds, constraining near-term recovery into fiscal 2026.\nMacro Pressure, Competition Hurts Reddit (RDDT) Prospects\nPer the Zacks analyst, Reddit's growth suffers from macro headwinds, intense competition, and concentrated ad spending, which could weigh on near-term prospects.\nRising Expenses Squeeze Acadia Healthcare's (ACHC) Margins\nPer the Zacks analyst, rising salaries, benefits and supply costs are likely to keep pressuring Acadia Healthcare's margins.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nApple Inc. (AAPL) : Free Stock Analysis Report\nInternational Business Machines Corporation (IBM) : Free Stock Analysis Report\nCisco Systems, Inc. (CSCO) : Free Stock Analysis Report\nRollins, Inc. (ROL) : Free Stock Analysis Report\nHSBC Holdings plc (HSBC) : Free Stock Analysis Report\nSummit Therapeutics PLC (SMMT) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "BTDR",
      "Date": "2025-12-29",
      "Time": "21:47:29",
      "Source": "Insider Monkey",
      "Title": "Here is Why Bitdeer Technologies (BTDR) is Favored by Hedge Funds",
      "URL": "https://finance.yahoo.com/news/why-bitdeer-technologies-btdr-favored-134729880.html",
      "Content": "Here is Why Bitdeer Technologies (BTDR) is Favored by Hedge Funds\n\nMuhammad Ali Khalid\nMon, December 29, 2025 at 5:47 AM PST 2 min read\n\nIn this article: BTDR\n\nBTC-USD\n\nBitdeer Technologies (NASDAQ: BTDR ) is one of the best bitcoin mining stocks to buy according to Hedge Funds .\nAs of December 24, consensus ratings remained strongly in favor of Bitdeer Technologies (NASDAQ:BTDR), despite a 47% drop in share price during 2025. The stock received coverage from 11 analysts, all of whom have assigned Buy ratings. As per estimates, the consensus 1-year average price target stands at $32.55, offering an upside potential of 183.3%.\nImage by Лечение Наркомании from Pixabay\nOn December 15, Brett Knoblauch from Cantor Fitzgerald also reaffirmed his bullish view on Bitdeer Technologies (NASDAQ:BTDR). The analyst assigned a Buy rating with a price target of $34, which implied a huge upside potential of 196%.\nBitdeer Technologies (NASDAQ:BTDR) recently reported its bitcoin production figures for November 2025, showcasing a large jump in self-mining hashrate to 45.7 EH/s. The company produced 526 bitcoins during the month, witnessing a 251% year-on-year growth, driven primarily by an efficient usage of SEALMINER mining rigs.\n\nThe management is currently expanding its AI cloud capabilities through the development of new data center infrastructure. This also includes their development plans in Malaysia. The figures for November reported a $10 million increase in annual recurring revenues for the business due to the company’s expansion into new areas.\nBitdeer Technologies (NASDAQ:BTDR) offers bitcoin mining capabilities covering the entire lifecycle, including self-mining as well as services for external customers. For self-mining, the company has been effectively utilizing SEALMINER rigs to expand its hashrate. Apart from that, the company also designs chips and operates data centers.\nWhile we acknowledge the potential of BTDR as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 15 Most Promising Mid-Cap Healthcare Stocks Under $50 and 11 Most Promising Small-Cap Industrial Stocks Under $50 .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "ADI",
      "Date": "2025-12-29",
      "Time": "20:00:35",
      "Source": "Simply Wall St.",
      "Title": "These 4 Measures Indicate That Analog Devices (NASDAQ:ADI) Is Using Debt Safely",
      "URL": "https://finance.yahoo.com/news/4-measures-indicate-analog-devices-120035386.html",
      "Content": "These 4 Measures Indicate That Analog Devices (NASDAQ:ADI) Is Using Debt Safely\n\nSimply Wall St\nMon, December 29, 2025 at 4:00 AM PST 4 min read\n\nIn this article: ADI\n\nDavid Iben put it well when he said, 'Volatility is not a risk we care about. What we care about is avoiding the permanent loss of capital.' So it seems the smart money knows that debt - which is usually involved in bankruptcies - is a very important factor, when you assess how risky a company is. We can see that Analog Devices, Inc. ( NASDAQ:ADI ) does use debt in its business. But the more important question is: how much risk is that debt creating?\n\nThis technology could replace computers: discover the 20 stocks are working to make quantum computing a reality.\nWhen Is Debt A Problem? Debt and other liabilities become risky for a business when it cannot easily fulfill those obligations, either with free cash flow or by raising capital at an attractive price. Part and parcel of capitalism is the process of 'creative destruction' where failed businesses are mercilessly liquidated by their bankers. However, a more usual (but still expensive) situation is where a company must dilute shareholders at a cheap share price simply to get debt under control. Of course, debt can be an important tool in businesses, particularly capital heavy businesses. When we examine debt levels, we first consider both cash and debt levels, together.\n\nHow Much Debt Does Analog Devices Carry? The image below, which you can click on for greater detail, shows that at November 2025 Analog Devices had debt of US$8.60b, up from US$7.62b in one year. However, it also had US$3.65b in cash, and so its net debt is US$4.95b.\nHow Strong Is Analog Devices' Balance Sheet? According to the last reported balance sheet, Analog Devices had liabilities of US$3.25b due within 12 months, and liabilities of US$10.9b due beyond 12 months. Offsetting this, it had US$3.65b in cash and US$1.44b in receivables that were due within 12 months. So its liabilities outweigh the sum of its cash and (near-term) receivables by US$9.09b.\n\nOf course, Analog Devices has a titanic market capitalization of US$135.6b, so these liabilities are probably manageable. But there are sufficient liabilities that we would certainly recommend shareholders continue to monitor the balance sheet, going forward.\nCheck out our latest analysis for Analog Devices\nWe measure a company's debt load relative to its earnings power by looking at its net debt divided by its earnings before interest, tax, depreciation, and amortization (EBITDA) and by calculating how easily its earnings before interest and tax (EBIT) cover its interest expense (interest cover). The advantage of this approach is that we take into account both the absolute quantum of debt (with net debt to EBITDA) and the actual interest expenses associated with that debt (with its interest cover ratio).\n\nStory Continues\nAnalog Devices's net debt is only 0.99 times its EBITDA. And its EBIT easily covers its interest expense, being 14.1 times the size. So we're pretty relaxed about its super-conservative use of debt. On top of that, Analog Devices grew its EBIT by 45% over the last twelve months, and that growth will make it easier to handle its debt. There's no doubt that we learn most about debt from the balance sheet. But ultimately the future profitability of the business will decide if Analog Devices can strengthen its balance sheet over time. So if you want to see what the professionals think, you might find this free report on analyst profit forecasts to be interesting.\n\nFinally, a business needs free cash flow to pay off debt; accounting profits just don't cut it. So we always check how much of that EBIT is translated into free cash flow. Happily for any shareholders, Analog Devices actually produced more free cash flow than EBIT over the last three years. That sort of strong cash generation warms our hearts like a puppy in a bumblebee suit.\nOur View The good news is that Analog Devices's demonstrated ability to cover its interest expense with its EBIT delights us like a fluffy puppy does a toddler. And that's just the beginning of the good news since its conversion of EBIT to free cash flow is also very heartening. It looks Analog Devices has no trouble standing on its own two feet, and it has no reason to fear its lenders. For investing nerds like us its balance sheet is almost charming. When analysing debt levels, the balance sheet is the obvious place to start. But ultimately, every company can contain risks that exist outside of the balance sheet. These risks can be hard to spot. Every company has them, and we've spotted 1 warning sign for Analog Devices you should know about.\n\nAt the end of the day, it's often better to focus on companies that are free from net debt. You can access our special list of such companies (all with a track record of profit growth). It's free.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "TSEM",
      "Date": "2025-12-29",
      "Time": "19:00:00",
      "Source": "GlobeNewswire",
      "Title": "Tower Semiconductor to Attend the 28th Annual Needham Growth Conference",
      "URL": "https://finance.yahoo.com/news/tower-semiconductor-attend-28th-annual-110000991.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nTower Semiconductor to Attend the 28th Annual Needham Growth Conference\n\nTower Semiconductor\nMon, December 29, 2025 at 3:00 AM PST 2 min read\n\nIn this article: TSEM\n\nMIGDAL HAEMEK, Israel, December 29, 2025 – Tower Semiconductor (NASDAQ/TASE: TSEM), the leading foundry of high value analog semiconductor solutions, today announced that its company representatives will participate in the 28 th Annual Needham Growth Conference on Tuesday, January 13 th and Wednesday, January 14 th .\n\nThe Conference will take place at the Lotte New York Palace Hotel in New York. There will be an opportunity for investors to meet one-on-one with company representatives. Interested investors should contact the conference organizers or email the investor relations team at towersemi@kcsa.com .\nAbout Tower Semiconductor\nTower Semiconductor Ltd. (NASDAQ/TASE: TSEM), the leading foundry of high-value analog semiconductor solutions, provides technology, development, and process platforms for its customers in growing markets such as consumer, industrial, automotive, mobile, infrastructure, medical and aerospace and defense. Tower Semiconductor focuses on creating a positive and sustainable impact on the world through long-term partnerships and its advanced and innovative analog technology offering, comprised of a broad range of customizable process platforms such as SiGe, BiCMOS, mixed-signal/CMOS, RF CMOS, CMOS image sensor, non-imaging sensors, displays, integrated power management (BCD and 700V), photonics, and MEMS. Tower Semiconductor also provides world-class design enablement for a quick and accurate design cycle as well as process transfer services including development, transfer, and optimization, to IDMs and fabless companies. To provide multi-fab sourcing and extended capacity for its customers, Tower Semiconductor owns one operating facility in Israel (200mm), two in the U.S. (200mm), two in Japan (200mm and 300mm) which it owns through its 51% holdings in TPSCo, shares a 300mm facility in Agrate, Italy with STMicroelectronics as well as has access to a 300mm capacity corridor in Intel’s New Mexico factory. For more information, please visit: www.towersemi.com .\nContact Information:\nLiat Avraham\nInvestor Relations\nliatavra@towersemi.com | +972 4 650 6154\nDavid Hanover\nKCSA Strategic Communications\ntowersemi@kcsa.com | 212-682-6300\nAttachment\nTSEM Needham Announcement\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "KLAC",
      "Date": "2025-12-29",
      "Time": "01:46:45",
      "Source": "Insider Monkey",
      "Title": "AI Infrastructure Demand Keeps KLA (KLAC) and Semiconductor Sector on Top for 2026",
      "URL": "https://finance.yahoo.com/news/ai-infrastructure-demand-keeps-kla-174645942.html",
      "Content": "AI Infrastructure Demand Keeps KLA (KLAC) and Semiconductor Sector on Top for 2026\n\nMaham Fatima\nSun, December 28, 2025 at 9:46 AM PST 2 min read\n\nIn this article: KLAC\n\n^GSPC\n\nKLA Corporation (NASDAQ: KLAC ) is one of the best performing S&P 500 stocks in 2025 . On December 16, Bank of America raised the firm’s price target on KLA Corporation to $1,450 from $1,400, while maintaining a Buy rating on the shares. BofA is adjusting its price targets across the US semiconductor sector and suggests that 2026 marks the halfway point of a decade-long transition toward upgrading traditional IT infrastructure for AI-driven workloads. Stock volatility may persist as investors scrutinize AI returns and hyperscaler spending, but the firm believes that this pressure will be balanced by the expansion of AI factories and LLM developers.\n\nOn the same day, Cantor Fitzgerald upgraded KLA Corporation to Overweight from Neutral with a price target of $1,500, up from $1,350. After beating the S&P 500 by 30 points in 2025, the SOX is expected to remain a market leader through 2026. Cantor Fitzgerald believes that the scale of AI infrastructure spending outweighs any short-term cyclical concerns.\nEarlier on December 15, Jefferies upgraded the company to Buy from Hold with a price target of $1,500, up from $1,100. The firm cited KLA Corporation’s dominant position in leading-edge manufacturing as AI scales and believes that the current buildout will catalyze demand for advanced chips, memory, and packaging technologies. With the stock’s valuation recently resetting to more attractive levels, Jefferies sees KLA Corporation as a primary beneficiary of the accelerating investment in AI infrastructure.\n\nKLA Corporation (NASDAQ:KLAC), together with its subsidiaries, designs, manufactures, and markets process control, process-enabling, and yield management solutions for the semiconductor and related electronics industries worldwide.\nWhile we acknowledge the potential of KLAC as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ]
}