{
  "last_updated": "2025-10-12",
  "total_reports": 10,
  "reports": [
    {
      "Source": "TradingView - Reuters Morning Brief",
      "URL": "https://tw.tradingview.com/news/reuters.com,2025:newsml_L6T3VR1UV:0/",
      "Date": "2025-10-11",
      "Time": "05:19:58",
      "Title": "《路透早報》--10月11日",
      "Content": "新聞\n/\nReuters\n/\n《路透早報》--10月11日\n《路透早報》--10月11日\nRefinitiv\nGOLD\n以下為10月10日下午6:00至10月11日早上6:00的重大新聞與市場摘要：\n--特朗普威脅對華加徵關稅並取消與習近平會晤，引發市場劇震\n美國總統特朗普周五對北京發出猛烈抨擊，威脅將對中國輸美商品加徵關稅，並取消與中國國家主席習近平的會晤，市場應聲大跌，全球最大兩個經濟體之間的關係迅速降溫。中國周四大幅擴大稀土出口管制，特朗普在社交媒體上抱怨稱，中國試圖挾持全球經濟。他表示，正考慮對中國製造商品“大幅”加徵關稅。特朗普在帖文中稱，中國已向全球多個國家發出信函，表示計劃對所有與稀土相關的生產環節實施出口管制。他表示，一些未具名的國家與他聯繫，對北京的舉措感到憤怒。他對中方此舉感到意外，因為“中美關係最近一直很好”。“取決於中國對其剛剛發布的敵意‘命令’作何解釋，作為美國總統，我將被迫在經濟上對他們的舉措進行反制，”特朗普在Truth Social上寫道，“對於他們能夠壟斷的每一種元素，我們都有兩種替代。”他補充說：“我原定兩周後在韓國的APEC峰會上與習近平主席會晤，但現在似乎沒有理由再見面。”L6T3VR1JG\n*美國總統特朗普周五表示，美國將從 11 月 1 日起對從中國進口的商品徵收 100%的額外關稅，並對所有美國製造的關鍵軟件實施出口管制。特朗普在 Truth Social 上發文稱：\"從 2025 年 11 月 1 日起（或更早，取決於中國採取的任何進一步行動或變化），美國將對中國徵收 100%的關稅，超過他們目前支付的任何關稅。\"特朗普表示，剛剛獲悉，中國在貿易問題上採取了極其激進的立場。中國發出通知，自2025年11月1日起，將對幾乎所有他們生產的產品實施大規模出口管制，甚至包括一些並非由他們生產的產品。\n--美聯儲穆薩萊姆稱在降息問題上應\"謹慎行事\"\n聖路易斯聯邦儲備銀行總裁穆薩萊姆周五表示，他認為還有可能再降息一次，以支撐勞動力市場，但也敦促保持謹慎，因為當前的通脹水平仍“顯著高於”美聯儲設定的2%目標。穆薩萊姆表示：“我對進一步降息持開放態度，以提供更多保障，防止勞動力市場疲軟。”他指出，自己支持了美聯儲上月的0.25個百分點降息決定。但他補充道：“我認為我們必須謹慎行事，因為進一步寬鬆的空間有限，貨幣政策可能變得過於寬鬆。我認為貨幣政策應繼續對抗持續性的通脹壓力。”。\n--美聯儲理事沃勒稱可通過正常規模降息解決就業市場疲軟問題\n美聯儲理事沃勒周五表示，民間數據顯示就業市場依然疲軟，為進一步降息提供了依據，但他補充說，美聯儲在評估經濟的同時，只需“謹慎”地以25個基點的步幅調整。有關就業市場的其他信息來源 \"並不具有真正的代表性\n但它們都在講述同一個故事。勞動力市場疲軟，\"沃勒在CNBC的\"Squawk Box\"節目中說道。\"我們需要降息。但我們需要謹慎行事\n降息25個基點，繼續下去，看看情況如何。\n*美聯儲理事沃勒周五表示，他與財政部長貝森特就出任下一任美聯儲總裁進行的面試 \"非常順利\"，完全沒有政治因素。\n--美國10月消費者信心持穩，但勞動力市場擔憂猶存\n美國10月消費者信心保持穩定，家庭似乎未受到政府部分停擺的影響，但對勞動力市場和通脹的擔憂依然存在。周五公布的密西根大學消費者調查顯示，10月消費者信心指數為55.0，略低於9月最終值55.1。路透調查的經濟學家此前預計該指數將下滑至54.2。該調查顯示，消費者對未來一年通脹的預期從9月的4.7%降至10月的4.6%，但仍處於高位。消費者對未來五年通脹的預期保持不變，為3.7%。\n--又一家美國企業遭中國監管調查，市監總局稱高通公司涉嫌違反反壟斷法\n中國國家市場監管總局周五表示，因高通公司收購Autotalks公司未依法申報經營者集中，涉嫌違反中國反壟斷法，依法對高通公司開展立案調查。高通美股盤前一度挫逾4%。高通沒有立即回應對中國調查發表評論的請求。\n--瑞士寄望明年初與中國達成更新版自由貿易協定\n瑞士外長卡西斯周五表示，瑞士寄望在2026年初與中國達成更新版自由貿易協定。他是在與中國外長王毅會晤後作出上述表態的。“我們很高興更新（我們的自由貿易協定）的討論正在建設性地推進。我們可能無法如原先所希望的那樣在今年年底前完成，但我們寄望於明年初達成協議，以實現基於國際自由貿易規則的更加開放和公平的貿易。”卡西斯說。\n--美國行政管理和預算辦公室主任沃特周五表示，在美國政府停擺進入第十天之際，特朗普政府已開始裁減聯邦雇員。沃特在社交媒體上寫道：“RIFs行動已經開始”，所指的是所謂的“人員精簡”，但他未提供更多細節。\n--加拿大9月就業崗位意外大幅跳升，失業率保持不變\n周五公布的數據顯示，加拿大經濟在9月份出人意料地凈增加了60,400個工作崗位，幾乎完全扭轉了上個月的損失，但這並不足以降低其多年來居高不下的失業率。加拿大9月失業率為7.1%，與上月持平，為除新冠疫情之外的九年高位。加拿大統計局稱，接受路透訪查的分析師預計就業崗位增加5,000個，失業率將升至7.2%。加拿大今年的就業崗位增幅平均每月約為24,000個，比前兩年少了近10,000個。\n--法國總統馬克龍重新任命勒科爾尼為總理，盼其推動預算案通過\n法國總統馬克龍周五重新任命勒科爾尼為總理，後者在本周早些時候辭職。馬克龍希望這位忠誠盟友能在議會嚴重分裂的情況下爭取足夠支持，使2026年預算案獲得通過。\n--委內瑞拉反對派領導人馬查多榮獲諾貝爾和平獎\n委內瑞拉反對派領袖馬查多因促進民權和反對獨裁而於周五獲得諾貝爾和平獎，儘管美國\n總統特朗普\n一再表示他理應獲獎。現年58歲的工業工程師馬查多目前隱匿行蹤，2024年被委內瑞拉法院阻止競選總統，因此無法挑戰自2013年以來一直執政的總統馬杜羅。挪威諾貝爾獎委員會在頒獎詞中說：\"當專制者緊抓政權時，認可那些奮起反抗、勇敢的捍衛自由者至為重要。”\n[市場摘要]\n股市：\n--美國股市周五大幅下跌，之前美國總統特朗普在中國收緊稀土出口限制後威脅將對中國商品加徵關稅並取消與習近平的會晤，引發市場震盪。道瓊斯工業指數下跌878.82點，或1.90%，報45,479.60點；標普500指數大跌182.60點，或2.71%，報6,552.51點；納斯達克指數重挫820.20點，或3.56%，報22,204.43點。費城半導體指數大跌6.3%，受特朗普言論影響尤為明顯。衡量市場恐慌情緒的CBOE波動率指數收於6月19日以來的最高水平。\n--歐洲股市周五下跌，在最後一刻抹去了一周漲幅，因美國總統特朗普的新威脅引發了新一輪的貿易戰擔憂，刺激了投資者的神經，同時他們的焦點也集中在法國。指標STOXX 600指數收盤下跌1.2%，創下一個多月來最嚴重的日跌幅。除英國和西班牙外，所有主要地區股市均下跌超過1%。法國股指重挫1.53%，本周下跌了2%。德國DAX指數收跌1.5%，英國富時100指數下滑0.86。\n匯市：\n--美元周五大跌，美國總統特朗普威脅對中國大幅加徵關稅，再次引發了人們對貿易戰將如何影響美國經濟的擔憂。美元指數紐約尾盤下跌0.4%，報98.99。在日圓和歐元本周受到其所在地區財政擔憂的影響後，美元指數仍有望實現1.66%的周漲幅，這是自2024年9月以來的最大周線漲幅日圓兌美元紐約尾盤上漲0.86%，至151.73日圓。但本周美元兌日圓的周漲幅將達到2.9%，這是自2024年9月以來的最大漲幅。歐元兌美元日內上漲0.38%，報1.1607美元，但由於法國政局動盪，歐元兌美元創下自7月以來的最大單周跌幅1.15%。比特幣下跌 2.98%，至117,568美元。\n債市：\n--美國公債收益率周五跌至數周低點，原因是特朗普總統威脅要\"大規模\"增加對中國進口商品的關稅，指責中國政府試圖阻礙稀土貿易，投資者紛紛轉投避險資產。美國10年期公債收益率跌至一個多月來的最低點，尾盤下跌9.1個基點，至4.057%。30年期公債收益率最新下跌9.6個基點，至4.637%，此前曾跌至自9月5日以來的最低水平。兩年期美債收益率下滑7.5個基點，至3.512%。兩年期與10年期美債收益率差從周四晚間的正54.30個基點收窄至正52.8個基點。\n--10年期法國公債與避險德債收益率差周五略微擴大，投資者正密切關注法國總統\n馬克龍\n能否找到擺脫法國政治危機的辦法。歐元區指標德國10年期公債收益率下跌4個基點，報2.65%，本周周線料下跌3個基點。法國10年期公債收益率跌幅相近，報3.49%，兩者之間的差距從上周五晚些時候的79個基點微擴至80個基點。10年期意大利和德國公債收益率差從上周五的84個基點收窄至83個基點。德國兩年期公債收益率下跌0.5個基點，報1.99%。\n油市：\n--布蘭特和美國原油期貨周五下跌逾2美元，跌幅超過3%，此前美國總統特朗普威脅對中國商品加徵關稅，給本已供應過剩的市場的需求前景蒙陰。布蘭特原油期貨結算價下跌2.49美元，或3.82%，報每桶62.73美元，盤中創5月初以來的最低水平。美國原油期貨結算價下跌2.61美元，或4.24%，報每桶58.90美元，盤中也創下5月初以來最低。O/NCN]\n金屬：\n--金價周五縮減了部分升幅，此前由於美國總統特朗普警告可能對中國徵收新的關稅，加速資金湧入避險資產，黃金在本周第二次短暫突破每盎司4,000美元大關。1740 GMT，現貨金報每盎司3,989.49美元，上漲0.4%。金價本周上漲了2.7%。12月交割的美國期金\nGOLD\n收高0.7%，報4,000.40美元。\n--銅價下跌，之前美國總統特朗普表示，華盛頓正考慮大幅提高中國輸美商品關稅，引發全球兩大經濟體爆發貿易戰的擔憂。1600 GMT，倫敦金屬交易所三個月期銅急跌3.8%。報每噸10,450美元，該合約周四曾觸及11,000美元，逼近2024年5月創下的歷史高位11,104.50美元。\n注：其他重要財經新聞瀏覽請點選；近日《路透早報》請點選。(完)\nReuters\n亞洲\n© Copyright Thomson Reuters 2025. Click For Restrictions - https://agency.reuters.com/en/copyright.html\n顯示更多\n登入或建立一個永久免費帳戶來閱讀此新聞\n讓我們開始吧\n來自 Reuters 的更多新聞",
      "ContentLength": 4309,
      "HasTables": false,
      "ScrapedAt": "2025-10-12 22:27:40"
    },
    {
      "Source": "TradingView - US Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2025:newsml_L6T3VR1VD:0/",
      "Date": "2025-10-11",
      "Time": "04:07:33",
      "Title": "美國債市：特朗普威脅對華加徵關稅後美債收益率挫至數周低點",
      "Content": "新聞\n/\nReuters\n/\n美國債市：特朗普威脅對華加徵關稅後美債收益率挫至數周低點\n美國債市：特朗普威脅對華加徵關稅後美債收益率挫至數周低點\nRefinitiv\nUS10Y\nZB1!\n關鍵點：\n特朗普的關稅威脅導致股市大跌，債券收益率重挫\n美聯儲官員對可能降息持開放態度\n調查顯示消費者信心略有下降\n美國公債收益率周五跌至數周低點，原因是特朗普總統威脅要\"大規模\"增加對中國進口商品的關稅，指責中國政府試圖阻礙稀土貿易，投資者紛紛轉投避險資產。\n總統在社交媒體\"Truth Social\"的長篇講話引發股市大跌，並推動利率擺脫近期的區間震盪格局，10年期公債收益率創下9月中以來的最低水平。\n美國公債收益率近日走勢停滯，因政府停擺已進入第十天，導致關鍵經濟數據發布被迫中斷。\n“這無異於火上澆油。此前特朗普與習近平的關係看似進展順利，但中國最新出台的稀土出口管制激怒了特朗普，”Annex Wealth Management首席經濟學家Brian Jacobsen表示。\n“從現在到他們原定會面的APEC峰會之間還有很多變數，因此如果雙方情緒在此之前有所緩和，也不足為奇。”\n在周五下午的交易中，美國10年期公債收益率(US10YT=TWEB)跌至一個多月來的最低點，尾盤下跌9.1個基點，至4.057%。\n30年期公債收益率(US30YT=TWEB)最新下跌9.6個基點，至4.637%，此前曾跌至自9月5日以來的最低水平。\n短債方面，與利率預期密切相關的兩年期美債收益率(US2YT=TWEB)下滑7.5個基點，至3.512%。\n聖路易斯聯邦儲備銀行總裁穆薩萊姆(Alberto Musalem)周五表示，他認為還有可能再降息一次，以支撐勞動力市場，但也敦促保持謹慎，因為當前的通脹水平仍“顯著高於”美聯儲設定的2%目標。\n稍早，美聯儲理事沃勒（Christopher Waller）周五表示，民間數據顯示就業市場依然疲軟，為進一步降息提供了依據，但他補充說，美聯儲在評估經濟的同時，只需“謹慎”地以25個基點的步幅調整。\n美國公債收益率曲線中備受關注的兩年期與10年期美債收益率差 (US2US10=TWEB)從周四晚間的正54.30個基點收窄至正52.8個基點。\n此外，周五密西根大學公布的一項消費者信心調查略高於預期，但10月仍出現輕微放緩，已連續第三個月下滑，加劇了市場對民間指標所反映的勞動力市場疲軟的擔憂。\n20:06 GMT\n價格\n收益率%\n收益率變動\n兩年期公債\n(US2YT=RR)\n99.9453125\n3.5285\n-0.0700\n五年期公債\n(US5YT=RR)\n99.8671875\n3.6543\n-0.0870\n10年期公債\nUS10Y\n101.53125\n4.0591\n-0.0890\n30年期公債\n(US30YT=RR)\n101.796875\n4.6378\n-0.0950\n(完)\n****查閱相關新聞或頁面，請點選下列代碼連結****\n美國現貨公債\n美國指標公債報價       (0#USBMK=)\n英國公債市場\n歐元區公債市場\n日本公債市場\n中國債市\n台灣債市\n歐元區指標公債報價     (0#EUBMK=)\n利率或央行相關報導\nReuters\n經濟\n美國股票\n美洲\n© Copyright Thomson Reuters 2025. Click For Restrictions - https://agency.reuters.com/en/copyright.html\n顯示更多\n登入或建立一個永久免費帳戶來閱讀此新聞\n讓我們開始吧\n來自 Reuters 的更多新聞",
      "ContentLength": 1510,
      "HasTables": false,
      "ScrapedAt": "2025-10-12 22:27:40"
    },
    {
      "Source": "TradingView - Global FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2025:newsml_L6T3VR1UY:0/",
      "Date": "2025-10-11",
      "Time": "03:44:30",
      "Title": "《全球匯市》特朗普威脅對華大幅加徵關稅重創美元",
      "Content": "新聞\n/\nReuters\n/\n《全球匯市》特朗普威脅對華大幅加徵關稅重創美元\n《全球匯市》特朗普威脅對華大幅加徵關稅重創美元\nRefinitiv\nDXY\nUSDJPY\nEURUSD\nBTCUSD\n關鍵點：\n特朗普的關稅威脅打壓美元，提振歐元和日圓\n財政擔憂拖累日圓本周大跌\n法國政局動盪壓制歐元，馬克龍物色新總理人選\n美元周五大跌，美國總統特朗普威脅對中國大幅加徵關稅，再次引發了人們對貿易戰將如何影響美國經濟的擔憂。\n特朗普還表示，他可能取消與中國國家主席習近平的會晤計劃，並在社交媒體上抱怨稱，在中國周四大幅擴大稀土出口管制後，中國計劃挾持全球經濟。\n這些言論提升了歐元和日圓對美元的匯率，而與大宗商品和原材料相關的貨幣，包括澳元，則出現下跌。\n\"歸根結底，這確實給美國經濟帶來了很多負面影響。\"華盛頓 Monex USA 交易主管Juan Perez說：\"為了讓美國更好地進行談判，中國真的必須採取報復性行動嗎？因此這產生了很多疑問。\"\n美元指數\nDXY\n紐約尾盤下跌 0.4%，報 98.99。在日圓和歐元本周受到其所在地區財政擔憂的影響後，美元指數仍有望實現1.66%的周漲幅，這是自2024年9月以來的最大周線漲幅。\n交易員們還在關注美國聯邦政府何時重新開放，並公布將影響美聯儲政策的數據。\n美國勞工統計局周五表示，將於10月24日公布9月份的消費者通脹報告，以協助社會保障局確定2026年的年度生活成本調整。\n此前，許多美聯儲官員在上次會議上表達了對通脹風險的擔憂。\n根據芝加哥商品交易所集團的FedWatch工具，交易商認為美聯儲在 10 月份會議上降息 25 個基點的概率為 97%，而在 12 月份再降息一次的概率為 92%。\n**財政擔憂拖累日圓周線大跌**\n由於財政鴿派高市早苗出人意料當選自民黨總裁，人們擔心日本央行今年可能不會再度加息，這激起外界對日本當局需要出手支撐日圓的擔憂。\n日本財務大臣加藤勝信周五表示，在日圓因財政問題持續承壓之際，政府將對外匯市場的過度波動保持警惕。高市周四表示，她不希望引發日圓過度下跌。\n\"今天是財務大臣首次表示口頭干預，對日圓的過度波動提出警告。\"紐約 Bannockburn Global Forex 首席市場策略師Marc Chandler說。\n去年，日本官員曾對一個月內日圓貶值 10 日圓的走勢表示擔憂，Chandler說，如果今天日圓從 9 月 17 日的低點出現類似走勢，則表明人們對 155.5 日圓水平的擔憂。\n日圓兌美元\nUSDJPY\n紐約尾盤上漲 0.86%，至151.73日圓。但本周美元兌日圓的周漲幅將達到 2.9%，這是自 2024 年 9 月以來的最大漲幅。日圓從上周五的 1 美元兌 147.44 日圓走軟。\n高市周四還表示，日本央行負責制定貨幣政策，但其任何決策都必須與政府的目標保持一致。\n在預計於10月15日舉行的國會投票中，她有望成為日本首位女首相。但在自民黨的聯盟夥伴公明黨退出與自民黨的聯盟，從而打破兩黨長達26年的合作關係後，這一日期很可能會被推遲。\n**法國政治亂局削弱歐元**\n歐元兌美元\nEURUSD\n當日上漲 0.38%，報 1.1607 美元，但由於法國政局動盪，歐元兌美元創下自 7 月份以來的最大單周跌幅 1.15%。\n法國總統馬克龍在愛麗舍宮召開關鍵會議，邀請主流政界領導人出席，以期在其設定的周五晚最後期限前任命新總理。與此同時，法國央行行長警告稱，政治混亂正在削弱經濟增長。\n法國的政治癱瘓使得通過一項緊縮預算變得極具挑戰性，而投資者對法國巨額赤字的擔憂與日俱增。此外還有證據表明德國等其他主要經濟引擎的增長勢頭正在放緩。\n\"德國的數據不佳，因此我認為這使得歐元更容易受到法國消息的影響，\"荷蘭合作銀行的首席策略師Jane Foley說。\n周五的數據顯示，加拿大經濟在 9 月份意外凈增 60,400 個就業崗位，此後加元兌美元跳漲。加元兌美元尾盤上漲0.15%，報1.4加元。\n在加密貨幣方面，比特幣\nBTCUSD\n下跌 2.98%，至 117,568 美元。\n今日\n紐約\n當日\n今年以來\n2024年\n收市價\n上收市價\n漲跌%\n漲跌%\n收市價\n歐元/美元\nEURUSD\n1.1618\n1.1563\n+0.48\n+12.22\n1.0353\n美元/日圓\nUSDJPY\n151.15\n153.06\n-1.25\n-3.84\n157.18\n歐元/日圓\nEURJPY\n175.80\n177.01\n-0.68\n+ 8.02\n162.75\n美元/瑞郎\nUSDCHF\n0.7989\n0.8060\n-0.88\n-11.94\n0.9072\n英鎊/美元\nGBPUSD\n1.3358\n1.3301\n+0.43\n+6.77\n1.2511\n美元/加元\nUSDCAD\n1.4004\n1.4018\n-0.10\n-2.61\n1.4380\n美元/離岸人民幣\nUSDCNH\n7.1468\n7.1375\n+0.13\n-2.55\n7.3337\n澳元/美元\nAUDUSD\n0.6469\n0.6554\n-1.30\n+4.56\n0.6187\n歐元/瑞郎\nEURCHF\n0.9292\n0.9320\n-0.30\n-1.08\n0.9393\n歐元/英鎊\nEURGBP\n0.8697\n0.8691\n+0.07\n+5.13\n0.8273\n新西蘭元/美元\nNZDUSD\n0.5721\n0.5745\n-0.42\n+2.29\n0.5593\n美元/挪威克朗\nUSDNOK\n10.0933\n10.0513\n+0.42\n-11.20\n11.3657\n歐元/挪威克朗\nEURNOK\n11.7426\n11.6257\n+1.01\n-0.22\n11.7689\n美元/瑞典克朗\nUSDSEK\n9.4863\n9.5288\n-0.45\n-14.19\n11.0551\n歐元/瑞典克朗\nEURSEK\n11.0445\n11.0223\n+0.20\n-3.63\n11.4601\n(完)\n****查閱相關新聞或頁面，請點選下列代碼連結****\n全球匯市簡訊\n全球匯市報導\n所有外匯新聞\n匯率路透調查\n美加經濟指標預測\n歐洲經濟指標預測\n指標利率一覽\n澳元、新西蘭元報導\n英鎊報導\n台幣報導\n人民幣報導\n韓元報導\n南非蘭特報導\n亞洲盤現匯報價          (AFX=)\n歐洲盤現匯報價          (EFX=)\n紐約盤現匯報價          (NFX=)\n全部現匯報價             (FX=)\n英文匯市簡訊頁面      (FXBUZZ)\nReuters\n© Copyright Thomson Reuters 2025. Click For Restrictions - https://agency.reuters.com/en/copyright.html\n顯示更多\n登入或建立一個永久免費帳戶來閱讀此新聞\n讓我們開始吧\n來自 Reuters 的更多新聞",
      "ContentLength": 2857,
      "HasTables": false,
      "ScrapedAt": "2025-10-12 22:27:40"
    },
    {
      "Source": "TradingView - Global FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2025:newsml_L6T3VR09C:0/",
      "Date": "2025-10-10",
      "Time": "13:43:40",
      "Title": "《全球匯市》日圓料創一年最大單周跌幅，歐元處於兩個月低位",
      "Content": "新聞\n/\nReuters\n/\n《全球匯市》日圓料創一年最大單周跌幅，歐元處於兩個月低位\n《全球匯市》日圓料創一年最大單周跌幅，歐元處於兩個月低位\nRefinitiv\nUSDJPY\nEURUSD\nDXY\nAUDUSD\n關鍵點：\n聚焦高市的財政政策和日本央行觀點\n口頭干預幫助日圓找到一些支撐\n法國政治泥潭打壓歐元跌至兩個月低點\n美元有望創一年來最佳周度表現\n日圓兌美元周五持穩，但料錄得一年來最大單周跌幅，因日本近期加息的可能性迅速降低。歐元則在兩個月低點附近盤整，交易商準備迎接法國不到兩年來的第六任總理。\n日圓兌美元\nUSDJPY\n微升0.2% 至152.7日圓，但仍接近周四觸及的 2 月中旬以來最弱水平。日圓本周或將下跌 3.5%，創去年 10 月以來的最大跌幅。\n日圓大跌的主要原因是，人們擔心日本央行今年可能不會再度加息；此前財政鴿派高市早苗出人意料當選自民黨總裁，激起外界對日本當局介入貨幣政策的擔憂。\n日本財務大臣加藤勝信周五表示，在日圓因財政問題持續承壓之際，政府將對外匯市場的過度波動保持警惕。高市周四表示，她不希望引發日圓過度下跌。\n“市場仍然認為，高市早苗的領導將使日本央行升息面臨政治困難，”澳洲聯邦銀行(CBA)匯市策略師Carol Kong表示。\n即將成為日本首位女首相的高市周四表示，日本央行負責制定貨幣政策，但其任何決策都必須與政府的目標保持一致。\n交易商目前認為日本央行在12月會議上加息的可能性約為45%，認為央行肯定升息25個基點要等到明年3月。\n**法國政治亂局拖累歐元**\n歐元兌美元\nEURUSD\n最新報1.15705美元，徘徊在周四觸及的兩個月低點附近，本周或將下跌1.5%，為11個月來最大跌幅，因法國政局動盪令歐元承壓。\n法國總統馬克龍正在物色他兩年來的第六位總理，希望新任命人選能在分裂的國會中推動預算案通過。\n法國的政治癱瘓使得通過一項緊縮預算變得極具挑戰性，而投資者對法國巨額赤字的擔憂與日俱增。\n\"在法國，總理勒科爾尼辭職後出現的動盪破壞了歐元人氣，\"InTouch Capital Markets亞洲外匯主管Kieran Williams說。\n\"隨著交易商因央行預期和政治風險的變化而重新調整頭寸，整個外匯市場的波動性仍然很高。\"\n這使得美元走勢樂觀，美元指數\nDXY\n報99.33，接近兩個月高點。該指數周線有望上漲 1.7%，創一年來最大漲幅。\n“近期美元漲勢與市場倉位情況背道而馳，促使美元空頭部分回補，” 佩珀斯通(Pepperstone)研究主管Chris Weston表示。\n“人們仍然高度懷疑美元能否大幅突破100，美元指數5月份在這一水平迅速回落，”他在一份報告中表示。\n由於美國政府停擺仍在繼續，而且幾乎沒有經濟數據可供投資者分析美聯儲可能採取的路徑，市場正在密切關注政策制定者的言論。\n紐約聯儲總裁威廉姆斯周四表示，儘管一些政策制定者對通脹上升心存疑慮，暗示他們不會輕易做出降息決定，但他對再次降息持樂觀態度。\n根據芝商所的FedWatch工具，交易員認為美聯儲在10月會議上降息25個基點的可能性為95%，而12月再次降息的可能性在過去一周從90%降至80%。\n其他貨幣方面，澳元兌美元\nAUDUSD\n報0.6565美元，上漲0.14%；英鎊兌美元\nGBPUSD\n報1.331美元，接近周四觸及的兩個月低點。英鎊本周迄今下跌了 1%，將創下兩個多月來表現最差的一周。\n新西蘭元兌美元\nNZDUSD\n報 0.5755 美元，徘徊在六個月低點附近，此前新西蘭央行於周三大幅降息50個基點，因為決策者對經濟的脆弱狀況表示擔憂，並為進一步寬鬆政策敞開大門。\n最新報價\n紐約\n當日\n今年來\n2024年\n上收市價\n漲跌%\n漲跌%\n收市價\n歐元/美元\nEURUSD\n1.1574\n1.1563\n+0.10\n+11.79\n1.0353\n美元/日圓\nUSDJPY\n152.8100\n153.06\n-0.16\n-2.78\n157.18\n歐元/日圓\nEURJPY\n176.88\n177.01\n-0.07\n+8.68\n162.75\n美元/瑞郎\nUSDCHF\n0.8056\n0.8060\n-0.05\n-11.20\n0.9072\n英鎊/美元\nGBPUSD\n1.3308\n1.3301\n+0.05\n+6.37\n1.2511\n美元/加元\nUSDCAD\n1.4015\n1.4018\n-0.02\n-2.54\n1.4380\n美元/離岸人民幣\nUSDCNH\n7.1277\n7.1375\n-0.14\n-2.81\n7.3337\n澳元/美元\nAUDUSD\n0.6564\n0.6554\n+0.15\n+6.09\n0.6187\n新西蘭元/美元\nNZDUSD\n0.5754\n0.5745\n+0.16\n+2.88\n0.5593\n澳元/日圓\nAUDJPY\n100.270\n100.500\n-0.23\n+2.13\n98.18\n新西蘭元/日圓\nNZDJPY\n88.380\n88.380\n0.00\n-0.92\n89.20\n英鎊/日圓\nGBPJPY\n203.33\n203.51\n-0.09\n+3.42\n196.60\n澳元/新西蘭元\nAUDNZD\n1.1402\n1.1404\n-0.02\n+3.13\n1.1056\n美元指數\nDXY\n99.311\n99.538\n-0.23\n-8.46\n108.487\n(完)\n****查閱相關新聞或頁面，請點選下列代碼連結****\n全球匯市簡訊\n全球匯市報導\n所有外匯新聞\n匯率路透調查\n美加經濟指標預測\n歐洲經濟指標預測\n指標利率一覽\n澳元、新西蘭元報導\n英鎊報導\n台幣報導\n人民幣報導\n韓元報導\n南非蘭特報導\n亞洲盤現匯報價          (AFX=)\n歐洲盤現匯報價          (EFX=)\n紐約盤現匯報價          (NFX=)\n全部現匯報價             (FX=)\n英文匯市簡訊頁面      (FXBUZZ)\nReuters\n© Copyright Thomson Reuters 2025. Click For Restrictions - https://agency.reuters.com/en/copyright.html\n顯示更多\n登入或建立一個永久免費帳戶來閱讀此新聞\n讓我們開始吧\n來自 Reuters 的更多新聞",
      "ContentLength": 2610,
      "HasTables": false,
      "ScrapedAt": "2025-10-12 22:27:40"
    },
    {
      "Source": "TradingView - Reuters Morning Brief",
      "URL": "https://tw.tradingview.com/news/reuters.com,2025:newsml_L6T3VQ125:0/",
      "Date": "2025-10-10",
      "Time": "07:32:30",
      "Title": "《路透早報》--10月10日",
      "Content": "新聞\n/\nReuters\n/\n《路透早報》--10月10日\n《路透早報》--10月10日\nRefinitiv\n一周全球重要經濟數據和事件預告PDF：\n簡體： https://tmsnrt.rs/46UpG8V\n繁體： https://tmsnrt.rs/3IRXCLe\n以下為10月9日下午5:00至10月10日早上7:00的重大新聞與市場摘要：\n--以色列批準加沙停火協議，停火將在24小時內生效\n以色列政府周五批準與巴勒斯坦激進組織哈馬斯達成的停火協議，為在24小時內暫停加沙敵對行動、並在72小時內釋放被關押在加沙的以色列人質鋪平了道路。以色列總理內塔尼亞胡在社交平台X上發文稱：“政府剛剛批準了釋放所有人質--包括生者與遇難者--的框架。”哈馬斯加沙領導人哈亞表示，他已從美國和其他調解方得到戰爭結束的保證。如果協議得到全面執行，將使雙方距離結束戰爭更近一步。\n--周四共和黨提出的為美國政府提供資金並結束停擺的議案還是未能在參議院獲得通過所需的票數。美國政府停擺已進入第九天，幾乎沒有任何進展跡象。\n特朗普表示，他的政府將趁目前政府停擺來永久削減他所稱的“民主黨項目”。這表明他將推動縮減聯邦開支，並將政策重點轉向其政治基本盤。\n--據新華社報導，中國總理李強會見朝鮮勞動黨總書記金正恩。李強稱，中國愿同朝鮮加強高層交往和戰略溝通，進一步弘揚傳統友誼；並表示，中國愿與朝鮮密切在國際地區事務中的協調配合，加強多邊協作。\n--美國擬禁止中國航司飛美航班經俄領空，最快11月生效\n特朗普政府提議禁止中國航空公司往返美國的航班飛越俄羅斯領空，稱這種做法使美國航空公司處於不利地位。美國交通部要求中國航司在兩天內回應該命令，並表示最終命令最快可能於11月生效。中國駐華盛頓大使館未立即置評。\n--美國總統特朗普表示，他希望在即將舉行的會晤中與中國國家主席習近平討論大豆問題，同時警告說，如果貿易關係得不到改善，美國可能不得不停止從中國的大部分進口。\n--印度總理莫迪表示，他與美國總統特朗普進行了通話，並補充說他們“回顧了貿易談判取得的良好進展”，雙方同意在未來幾周保持密切溝通。印度商務部官員表示，在華盛頓最新一輪貿易官員會談後，預計兩國將很快展開新一輪貿易談判。\n--王毅：中國愿同意大利加快推進全面戰略夥伴關係，望意方踐行真正多邊主義\n中國外交部長王毅周三在會見意大利總統馬塔雷拉時表示，中國重視意大利在歐洲和世界上的影響，愿同意方一道加快推進中意全面戰略夥伴關係行動計劃，確保兩國關係更加穩健、更具韌性、更富成果。外交部網站新聞稿援引王毅的話並稱，當今世界亂象叢生、信任缺失，需要更多對話溝通，以增進彼此了解，深化相互合作，希望意方能同中方一道踐行真正的多邊主義。\n--高市早苗稱日本央行利率決策必須與政府目標保持一致\n日本新任執政黨黨魁高市早苗表示，日本央行負責制定貨幣政策，但其任何決策都必須與政府的目標保持一致。在被問及日本央行是否可能在近期加息時，高市早苗在一檔電視節目中表示，日本近期的通脹主要是由原材料成本上漲所推動，而非強勁的需求。她表示，一旦被議會推選為下任首相，她將立即下令制定一籃子措施，以緩解生活費用上漲對經濟造成的打擊。\n--美聯儲威廉姆斯支持今年繼續降息，因就業市場或進一步放緩\n紐約聯儲總裁威廉姆斯在接受《紐約時報》採訪時表示，鑒於就業市場可能進一步放緩，他支持美聯儲今年繼續降息。他指出，美聯儲正努力在降低通脹與支持顯露疲態的就業市場之間尋求平衡。當前貨幣政策立場“具有溫和限制性”，他認為這有助於實現通脹持續回落至2%的目標。不過，威廉姆斯也警告稱，如果美聯儲任由通脹升至遠高於2%的水平而不採取措施加以控制，將對經濟和美聯儲信譽造成嚴重損害。\n美聯儲理事巴爾表示，美聯儲在進一步降息方面應保持謹慎，他明顯偏向通脹風險，儘管他也承認“基本平衡”的勞動力市場存在潛在脆弱性。\n--根據數據分析公司OpenBrand發布的數據，美國耐用消費品和個人用品的價格在9月環比上漲了 0.58%，高於8月份0.45%，儘管進口關稅帶來的推動作用似乎正在減弱。該價格指標依托于 OpenBrand 的產品數據庫，涵蓋超過 40 萬種商品的價格、促銷和供應情況。\n--歐洲央行稱政策足以應對衝擊，前景明朗前可按兵不動--會議記錄\n歐洲央行9月10-11日會議記錄顯示，政策制定者上月一致認為，歐洲央行的政策工具足以應對歐元區通脹前景的變化，因此在獲得更多明確信息前可以保持政策不變。央行在9月會議上維持利率不變，並對歐元區經濟作出較為樂觀的評估，暗示進一步放鬆政策的門檻很高，即便美國關稅仍令前景蒙陰。會議記錄顯示：“考慮到通脹風險的雙向性以及各種可能情境，當前的利率水平應該被視為足以應對衝擊。”\n--英國央行曼恩稱通脹預期仍過高，利率政策應繼續施壓\n英國央行貨幣政策委員會(MPC)委員曼恩表示，英國的通脹預期仍過高，利率政策應繼續抑制物價上漲壓力。“為了創造一個有利於經濟增長的環境，貨幣政策必須在更長的時間內保持限制性，這或許有悖常理，”曼恩在為一家智庫組織的活動準備的演講中說。\n--一項對招聘公司的調查顯示，英國的招聘市場依然低迷，薪酬停滯不前，雇主們擔心財政大臣里夫斯將於11月公布的預算案可能會進一步增稅。招聘與就業聯合會(REC)發布的9月數據顯示，儘管新增長期員工人數的降幅是12個月以來最小的，但整體招聘人數繼續大幅下降。\n--法國央行預測，儘管存在政治不確定性且貿易局勢緊張，但法國經濟第三季將保持穩定增長，得益於服務業活動顯現韌性。法國央行在其月度經濟展望中表示，預計法國第三季經濟環比增長0.2%，與第二季增速持平，維持了9月的預測不變。\n--中國國家發改委和市場監管總局聯合發布“關於治理價格無序競爭，維護良好市場價格秩序的公告”，明確指出價格競爭是市場競爭的重要方式之一，無序競爭可能導致劣幣驅逐良幣，影響行業發展、產品創新和質量安全，不利於國民經濟健康發展。\n--美國政府表示，美國對約100名個人、實體及船隻實施制裁，其中包括一家中國獨立煉廠和碼頭營運商，因其協助伊朗進行石油和石化產品貿易。美國財政部制裁了山東金誠石化集團，還對在嵐山港運營碼頭的中國日照實華原油實施了制裁。\n--歐盟執委會發言人表示，歐盟執委會對中國加強稀土出口管制的決定表達關切。中國商務部和海關總署周四連發四份公告，決定對部分中重稀土、部分稀土設備和原輔料、鋰電池和人造石墨負極材料、超硬材料等相關物項實施出口管制。\n--一位知情官員向路透陳述台灣總統賴清德周五雙十演說大綱內容顯示，將增加國防支出、強化社會韌性，以實力守護和平、以具體行動展現守護台灣決心，建構守護自由民主的堅強防線。\n--台灣財政部稱，考量台美對等關稅談判及232條款調查結果尚未定案等不確定因素，國安基金繼續執行安定市場任務，穩定投資信心。\n--匯豐控股集團行政總裁艾橋智向路透表示，該行將考慮在關鍵領域進行更多收購，此前該行宣布將恆生銀行私有化的計劃。\n--美國國家公路交通安全管理局(NHTSA)表示，在發生一系列車禍後，該局正在對288萬輛配備全自動駕駛系統(FSD)的特斯拉汽車的交通安全違規行為展開調查。\n[市場摘要]\n股市：\n--美國股市周四收低，因投資者在缺乏經濟數據和市場人氣催化劑的情況下，借機在第三季財報季開始前進行整理。道瓊斯工業指數下跌243.36點，或0.52%，報46,358.42點；標普500指數下跌18.61點，或0.28%，報6,735.11點；納斯達克指數下跌18.75點，或0.08%，報23,024.63點。\n--歐洲股市下跌，法拉利與匯豐大幅走低拖累STOXX指數脫離紀錄高位，投資者對法國日益加劇的政治動盪保持警惕。泛歐STOXX 600指數收低0.4%，此前一個交易日曾創下紀錄高位。法股CAC-40指數回吐早盤漲幅，收跌0.2%。英股富時指數下跌0.41%，德股DAX指數上漲0.06%。\n匯市：\n--日圓兌美元跌至2月中旬以來最低水平，日本執政黨新當選總裁高市早苗未能令市場對匯率走向產生信心。美元最新上漲0.27%，報153.09日圓，盤中一度觸及153.23日圓，為2月13日以來最高。歐元下跌0.61%，報1.1555美元，盤中一度觸及1.1545美元，為8月5日以來最低。美元指數上漲0.62%，至99.47，為8月1日以來最高。\n債市：\n--美國公債收益率走高，此前的長期債券標售顯示，在聯邦政府持續停擺導致官方經濟指標發布受阻的情況下，市場需求一般。指標美國 10 年期公債收益率上漲1.7個基點，至4.148%。30年期公債收益率上升0.8個基點，至4.732%。\n--法國公債基本持穩，因市場樂觀地認為法國可以避免提前選舉並就預算達成協議，此前看守總理勒科爾尼與其他政黨領導人舉行會談。法國10年期公債收益率上漲0.2%，報3.529%。歐元區指標德國10年期公債收益率上漲3個基點至2.705%，使法德10年期公債收益率差縮窄至82.2個基點，低於周一的近88個基點。\n油市：\n--油價收低，此前以色列和巴勒斯坦激進組織哈馬斯簽署加沙停火協議。布蘭特原油期貨收盤下跌1.03美元，或1.6%，報每桶65.22美元。美國原油收盤下跌1.04美元，跌幅1.7%，報61.51美元。\n金屬：\n--金價下跌2%，跌破上一交易日首次突破的4,000 美元/盎司大關，原因是美元走高，以及黃金投資者在以色列與哈馬斯達成停火協議後獲利了結。白銀也從51.22美元/盎司的歷史高位回落。現貨金收跌1.56%，至每盎司3,975.04美元。12月交割的美國期金下跌2.4%，報收於 3,972.6 美元。\n--倫敦金屬交易所(LME)指標三個月期銅觸及每噸11,000美元，這是16個月來未見的高位，因為在一系列礦山供應中斷導致市場擔心供應短缺之後，投資者紛紛湧入銅市，同時鋁價也創下了三年多來的新高每噸2,807.50美元。1600 GMT，銅價上漲2.1%，報10,886.50美元。\n[今日看點]\n重要經濟數據(GMT時間)：\n--日本9月銀行放款餘額和國內企業物價指數(CGPI)(9日2350)\n--加拿大9月就業崗位變動、失業率(1230)\n--密西根大學10月美國消費者信心指數初值(1400)\n重大經濟事件及官員講話(GMT時間)：\n--中國國務院總理李強、越共中央總書記蘇林訪問朝鮮，出席朝鮮勞動黨建黨80周年慶祝活動(至11日)\n--歐洲央行副總裁德金多斯出席歐盟財長會議\n--舊金山聯儲總裁戴利出席矽谷董事交流會對話活動(0140)\n--芝加哥聯儲總裁古爾斯比在一個社區銀行家研討會上致開幕詞並主持討論(1345)\n--聖路易斯聯儲總裁穆薩萊姆就美國經濟和貨幣政策發表講話(1700)\n注：其他重要財經新聞瀏覽請點選；近日《路透早報》請點選。(完)\n(整理/審校 鄭茵/王燦)\n((miranda.xu@tr.com; 86-10-56692082;))\nReuters\n亞洲\n© Copyright Thomson Reuters 2025. Click For Restrictions - https://agency.reuters.com/en/copyright.html\n顯示更多\n登入或建立一個永久免費帳戶來閱讀此新聞\n讓我們開始吧\n來自 Reuters 的更多新聞",
      "ContentLength": 4682,
      "HasTables": false,
      "ScrapedAt": "2025-10-12 22:27:40"
    },
    {
      "Source": "TradingView - US Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2025:newsml_L6T3VQ0YA:0/",
      "Date": "2025-10-10",
      "Time": "03:40:30",
      "Title": "美國債市：收益率小漲，美國30年期公債標售表現一般",
      "Content": "新聞\n/\nReuters\n/\n美國債市：收益率小漲，美國30年期公債標售表現一般\n美國債市：收益率小漲，美國30年期公債標售表現一般\nRefinitiv\nUS10Y\nZB1!\n關鍵點：\n30年期公債標售結果顯示需求一般\n策略師指在缺乏政府數據的情況下，市場信號的意義不大\n美聯儲理事巴爾警告不要激進改變政策，並指出存在通脹風險\n美國公債收益率周四下午走高，此前的長期債券標售顯示，在聯邦政府持續停擺導致官方經濟指標發布受阻的情況下，市場需求一般。\n自華盛頓的立法者未能在9月30日的最後期限前就支出立法達成一致以來，兩年期和指標10年期公債收益率一直窄幅波動。到目前為止，幾乎沒有跡象表明僵局即將結束。\n在美國財政部發售220億美元債券後，30年期債券收益率略有上升，但DRW Trading的Lou Brien在一份客戶報告中表示，考慮到投標倍數和一級交易商投標得標率，仍有需求跡象。\nFHN Financial的宏觀策略師Will Compernolle表示，只要投資者缺乏能夠推動其採取具體行動的進展，例如來自政府經濟數據的指引，市場信號可能就不那麼有意義。\n他說：“如果就業報告發布並給出明確信號，那麼我們本周看到的任何走勢都將迅速逆轉。”他補充道，在這個“奇怪的一周”里，收益率和公債標售是投資者需求的可靠指標的程度降低。\n“如果本周公債走勢毫無方向，那麼這些標售就是在一個奇怪的時間點上把脈。”\n密歇根大學將於周五發布其月度消費者信心報告，在官方數據缺席的情況下，這一指標預計將受到異常關注。\n與此同時，美聯儲理事巴爾(Michael Barr)周四表示，美聯儲在進一步降息方面應保持謹慎，他明顯偏向通脹風險，儘管他也承認“基本平衡”的勞動力市場存在潛在脆弱性。不過，美聯儲的政策制定委員會仍已釋放出本月晚些時候會議上可能降息的信號。\n指標美國 10 年期公債收益率 (US10YT=TWEB) 上漲 1.7 個基點，至 4.148%。30 年期公債收益率 (US30YT=TWEB) 上升 0.8 個基點，至 4.732%。\n美國公債收益率曲線的一個受到密切關注的部分，即衡量兩年期和十年期公債收益率差 (US2US10=TWEB) 目前為正 54.7 個基點。\n通常與美聯儲利率預期同步變動的兩年期美國公債收益率 (US2YT=TWEB)上升了 1.3 個基點，達到 3.597%。\n五年期美國通脹保值公債（TIPS）損益平衡收益率 (US5YTIP=TWEB)最新報 2.423%，10 月 8 日收盤于 2.428%。\n10 年期 TIPS 損益平衡收益率 (US10YTIP=TWEB) 尾盤報 2.355%，表明市場認為未來十年的年均通脹率約為 2.4%。\n19:35 GMT\n價格\n收益率%\n收益率變動\n兩年期公債\n(US2YT=RR)\n99.82421875\n3.5927\n+0.0090\n五年期公債\n(US5YT=RR)\n99.5078125\n3.7342\n+0.0120\n10年期公債\nUS10Y\n100.875\n4.1403\n+0.0090\n30年期公債\n(US30YT=RR)\n100.421875\n4.7231\n-0.0010\n(完)\n****查閱相關新聞或頁面，請點選下列代碼連結****\n美國現貨公債\n美國指標公債報價       (0#USBMK=)\n英國公債市場\n歐元區公債市場\n日本公債市場\n中國債市\n台灣債市\n歐元區指標公債報價     (0#EUBMK=)\n利率或央行相關報導\nReuters\n美國股票\n美洲\n© Copyright Thomson Reuters 2025. Click For Restrictions - https://agency.reuters.com/en/copyright.html\n顯示更多\n登入或建立一個永久免費帳戶來閱讀此新聞\n讓我們開始吧\n來自 Reuters 的更多新聞",
      "ContentLength": 1633,
      "HasTables": false,
      "ScrapedAt": "2025-10-12 22:27:40"
    },
    {
      "Source": "TradingView - Taiwan Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2025:newsml_L3T3VQ03Q:0/",
      "Date": "2025-10-09",
      "Time": "11:09:30",
      "Title": "台灣債市：指標公債及冷券早盤均無成交，假期前交投意願低落",
      "Content": "新聞\n/\nReuters\n/\n台灣債市：指標公債及冷券早盤均無成交，假期前交投意願低落\n台灣債市：指標公債及冷券早盤均無成交，假期前交投意願低落\nRefinitiv\n台灣指標公債周四早盤暫未成交。交易員指出，美債殖利率雖由跌轉升，但對台債影響不大。由於周五是雙十假期，三天長假前交投意願更清淡，連冷券市場也少有成交。\n債市交易員表示，台債殖利率目前位於偏低水位，但追價買盤猶豫，賣盤也稀缺，都使市場交投量能極低。而儘管上日公布9月通膨率1.25%創下四年半低位，但分析師多半認為今年央行沒有降息的可能。\n一位大型券商交易員則表示，預期台灣央行明年上半年都不會降息，台債第四季行情先以持平看待。\n“只要市場有錢，央行也不會升息，債市利率就不會波動太大。”他說。\n另外一家大型壽險業交易員則認為，下周要標售10年期新券114/10期公債300億台幣，但預期利率可能先以中性看待，主要是各方都認同在短期內央行沒有降息可能之下，殖利率下跌空間無多。\n本地時間11:13，指標五年公債114/8 (A14108=TWO)及10年公債114/10 (A14110=TWO)均無成交；同時間台股\nTWSE:TAIEX\n則升1.05%。\n美國公債收益率周三下午由跌轉升，投資者在10年期公債標售中表現出不溫不火的需求，而上個月的美聯儲會議記錄也鮮有意外。指標美國10年期公債收益率上漲0.6個基點，至4.133%。30年期公債收益率上升0.1 個基點，至4.727%。\n交易員預估，今日114/8期公債殖利率交投區間在1.23-1.25%，114/10期公債發行前交易殖利率交投區間則在1.33-1.35%。（完）\n最新相關報導鏈接：\n--美國債市：10年期公債標售和美聯儲會議記錄公布後收益率扭轉跌勢而轉升\nReuters\n亞洲\n© Copyright Thomson Reuters 2025. Click For Restrictions - https://agency.reuters.com/en/copyright.html\n顯示更多\n登入或建立一個永久免費帳戶來閱讀此新聞\n讓我們開始吧\n來自 Reuters 的更多新聞",
      "ContentLength": 910,
      "HasTables": false,
      "ScrapedAt": "2025-10-12 22:27:40"
    },
    {
      "Source": "TradingView - US Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2025:newsml_L6T3VP10Q:0/",
      "Date": "2025-10-09",
      "Time": "03:37:44",
      "Title": "美國債市：10年期公債標售和美聯儲會議記錄公布後收益率扭轉跌勢",
      "Content": "新聞\n/\nReuters\n/\n美國債市：10年期公債標售和美聯儲會議記錄公布後收益率扭轉跌勢\n美國債市：10年期公債標售和美聯儲會議記錄公布後收益率扭轉跌勢\nRefinitiv\nUS10Y\nZB1!\n美國公債收益率周三下午由跌轉升，投資者在10年期公債標售中表現出不溫不火的需求，而上個月的美聯儲會議記錄也鮮有意外。\n在美國政府停擺導致官方經濟指標暫停發布的背景下，加之市場已普遍預期美聯儲將在今年剩餘時間內連續降息，分析人士認為美國公債收益率難以擺脫近期的區間震盪走勢。\n周三的 390 億美元10年期公債標售中，投標倍數和間接投標得標率均有所下降，表明投資者的胃口並不那麼好。\n與此同時，聯邦公開市場委員會(FOMC) 9 月份的會議記錄顯示，大多數決策者贊成今年再次採取寬鬆政策。\n\"這並不是一場疲軟的標售，只是並不出色，\"DRW Trading 的 Lou Brien 說：\"我認為它略顯糟糕。\"\n他補充說，市場沒有聯邦政府經濟數據的時間越長，投資者就越難下注。\nBrien說，“沒有經濟數據的時間越長，經濟狀況就越成謎。”\n指標美國 10 年期公債收益率 (US10YT=TWEB) 上漲 0.6 個基點，至 4.133%。30 年期公債收益率 (US30YT=TWEB) 上升 0.1 個基點，至 4.727%。\n美國公債收益率曲線的一個受到密切關注的部分，即衡量兩年期和 10 年期公債收益率差距的 (US2US10=TWEB)目前為正 54.5 個基點。\n通常與美聯儲利率預期同步變動的兩年期美國公債 (US2YT=TWEB)收益率上升了 1.4 個基點，達到 3.586%。\n五年期美國通脹保值公債（TIPS）損益平衡收益率 (US5YTIP=TWEB)最新報 2.433%，10 月 7 日收盤于 2.42%。\n10 年期 TIPS 損益平衡收益率 (US10YTIP=TWEB) 最後報 2.364%，表明市場認為未來十年的年均通脹率約為 2.4%。\n19:32 GMT\n價格\n收益率%\n收益率變動\n兩年期公債\n(US2YT=RR)\n99.83203125\n3.5885\n+0.0160\n五年期公債\n(US5YT=RR)\n99.5546875\n3.7237\n+0.0180\n10年期公債\nUS10Y\n100.953125\n4.1307\n+0.0040\n30年期公債\n(US30YT=RR)\n100.421875\n4.7231\n-0.0030\n(完)\n****查閱相關新聞或頁面，請點選下列代碼連結****\n美國現貨公債\n美國指標公債報價       (0#USBMK=)\n英國公債市場\n歐元區公債市場\n日本公債市場\n中國債市\n台灣債市\n歐元區指標公債報價     (0#EUBMK=)\n利率或央行相關報導\nReuters\n經濟\n美國股票\n美洲\n© Copyright Thomson Reuters 2025. Click For Restrictions - https://agency.reuters.com/en/copyright.html\n顯示更多\n登入或建立一個永久免費帳戶來閱讀此新聞\n讓我們開始吧\n來自 Reuters 的更多新聞",
      "ContentLength": 1335,
      "HasTables": false,
      "ScrapedAt": "2025-10-12 22:27:40"
    },
    {
      "Source": "TradingView - Taiwan FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2025:newsml_L3T3VP04D:0/",
      "Date": "2025-10-08",
      "Time": "10:41:54",
      "Title": "台灣匯市：台幣開低回測一個月新低，惟外資保管行偏匯入帶動早盤由貶轉升",
      "Content": "新聞\n/\nReuters\n/\n台灣匯市：台幣開低回測一個月新低，惟外資保管行偏匯入帶動早盤由貶轉升\n台灣匯市：台幣開低回測一個月新低，惟外資保管行偏匯入帶動早盤由貶轉升\nRefinitiv\nUSDTWD\n台幣兌美元\nUSDTWD\n周三早盤由貶轉升；交易員表示，受日圓進一步跌破152所累，台幣開低後一度失守30.580，回測一個月新低，但外資保管行早盤偏向匯入，陸續收斂台幣跌幅進而由貶轉升，緊盯台股回落後外資進一步動向。\n他們指出，目前台幣維持在30.500上下整理，交投由外資進出主導，早上台股回落但外資保管行卻偏賣匯，讓台幣反轉走升收復30.500，但外資最近動向常跌破眼鏡，留意下午外資流向，並關注人民幣長假後開市走勢。\n“台幣開低是因為日圓跌破152，但早上保管行還是匯入比較多。”一大型民營銀行交易員說。\n另一公營銀行交易員則稱，台股早盤回落逾200點，但外資交投偏賣匯，緩和台幣貶勢進而翻紅，現在外資動向實在很難捉摸，尚待觀察外資下午動向，同時市場也轉趨關注人民幣長假後重新開市後表現，將牽動亞幣走勢。\n本地時間10:32，台幣兌美元升值2.5分報30.495，交易區間在30.484-30.585，前波盤中低位為9月8日的30.600；台股\nTWSE:TAIEX\n則跌0.93%，從歷史高位回落。\n海外無本金交割遠期外匯市場(NDF)方面，目前指標一個月期美元/台幣換匯點 (TWDNDF=)折價幅度較上日尾盤略縮減；一個月美元/台幣遠匯 (TWD1MNDFOR=)報30.491/30.517，上日收在30.491。\n交易員預估，今日台幣兌美元匯率主要交易區間在30.450-30.600。（完）\n最新相關報導鏈接：\n--《全球匯市》美元上漲，美國政府停擺風險打擊市場情緒\nReuters\n亞洲\n台灣股票\n© Copyright Thomson Reuters 2025. Click For Restrictions - https://agency.reuters.com/en/copyright.html\n顯示更多\n登入或建立一個永久免費帳戶來閱讀此新聞\n讓我們開始吧\n來自 Reuters 的更多新聞",
      "ContentLength": 914,
      "HasTables": false,
      "ScrapedAt": "2025-10-12 22:27:40"
    },
    {
      "Source": "TradingView - US Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2025:newsml_L6T3VO0XV:0/",
      "Date": "2025-10-08",
      "Time": "04:45:08",
      "Title": "美國債市：收益率下跌，美聯儲降息希望升溫",
      "Content": "新聞\n/\nReuters\n/\n美國債市：收益率下跌，美聯儲降息希望升溫\n美國債市：收益率下跌，美聯儲降息希望升溫\nRefinitiv\nUS10Y\nZB1!\n關鍵點：\n三年期公債標售需求旺盛\n停擺進入第七天，數據尚未恢復\n美聯儲理事米蘭呼籲放鬆政策\n美國指標公債收益率周二下跌，這是需求改善的一個跡象，三年期公債標售需求強勁，其他跡象則強化了人們對美聯儲將在本月會議上再次降息的預期。\n新任美聯儲理事米蘭呼籲進一步放鬆貨幣政策，紐約聯邦儲備銀行報告顯示消費者預期勞動力市場將趨軟。\n紐約聯儲調查公布之際，聯邦政府停擺已進入第七天，關鍵經濟指標編制受到干擾，美聯儲決策者和投資者稱他們在一定程度上處於抹黑狀態。美國勞工部上周五未公布9月就業報告。\n蒙特利爾銀行資本市場美國利率策略師Vail Hartman稱：\"我認為，市場實際上只是在尋找任何新的信息，以填補政府停擺造成的空白。\"\n\"市場一直陷於 10 年期公債收益率在4.10 - 4.20 的相當明確的區間。我預計，在下一次大的宏觀衝擊到來之前，我們將繼續在這一區間震盪，而下一次衝擊很可能不會以數據的形式出現。\"\nHartman補充稱，鑒於美聯儲已經發出了本月降息的信號，缺乏全面的數據可能讓美聯儲無法偏離這一行動路線。\nDRW Holdings 的 Lou Brien 在一份分析報告中稱，580 億美元的三年期公債標售需求強勁，得標利率為3.576%，幾乎比投標截止時二級市場的收益率低了整整一個基點。\n在貨幣市場，隨著短期投資基金從美聯儲撤走現金，轉而投放到借貸利率較高的隔夜回購市場，聯儲逆回購工具周二的交易量降至46億美元的四年多來最低水平。\n銀行和對沖基金等金融機構以公債或其他債務證券為抵押，在回購市場借入短期現金。\n指標美國 10 年期公債收益率 (US10YT=TWEB) 下跌 3.1 個基點，報 4.131%。30 年期公債收益率 (US30YT=TWEB) 下跌 2.9 個基點，報 4.729%。\n兩年/10 年期公債收益率差 (US2US10=TWEB) 報正55.5 個基點。\n兩年期 公債收益率 (US2YT=TWEB) 下降2.3 個基點，至 3.574%。\n五年期美國通脹保值公債（TIPS）損益平衡收益率 (US5YTIP=TWEB) 報 2.419%，周一收報 2.412%。\n10 年期 TIPS 損益平衡收益率 (US10YTIP=TWEB) 報 2.353%，表明市場認為未來十年的平均年通脹率約為 2.4%。\n20:38 GMT\n價格\n收益率%\n收益率變動\n兩年期公債\n(US2YT=RR)\n99.87109375\n3.5677\n-0.0290\n五年期公債\n(US5YT=RR)\n99.6328125\n3.7063\n-0.0390\n10年期公債\nUS10Y\none hundred and one\n4.1249\n-0.0370\n30年期公債\n(US30YT=RR)\n100.359375\n4.7271\n-0.0310\n(完)\n****查閱相關新聞或頁面，請點選下列代碼連結****\n美國現貨公債\n美國指標公債報價       (0#USBMK=)\n英國公債市場\n歐元區公債市場\n日本公債市場\n中國債市\n台灣債市\n歐元區指標公債報價     (0#EUBMK=)\n利率或央行相關報導\nReuters\n經濟\n美國股票\n美洲\n© Copyright Thomson Reuters 2025. Click For Restrictions - https://agency.reuters.com/en/copyright.html\n顯示更多\n登入或建立一個永久免費帳戶來閱讀此新聞\n讓我們開始吧\n來自 Reuters 的更多新聞",
      "ContentLength": 1563,
      "HasTables": false,
      "ScrapedAt": "2025-10-12 22:27:40"
    }
  ]
}