[
  {
    "Source": "TradingView - Reuters",
    "URL": "https://tw.tradingview.com/news/reuters.com,2025:newsml_L3T3VK0TJ:0/",
    "Date": "2025-10-04",
    "Title": "《路透早報》--10月4日",
    "Content": "《路透早報》--10月4日\n\n--美國參議院結束政府停擺努力失敗，特朗普凍結芝加哥交通撥款\n\n美國總統特朗普的政府周五凍結了21億美元的芝加哥交通資金，與此同時，參議院試圖結束政府停擺的努力再次失敗。共和黨提出的恢復政府撥款的計劃在參議院失敗，表決結果為54:44，未達到獲得通過所需的60票。停擺似乎將延續到周末。白宮消息人士稱，特朗普還威脅要解雇更多聯邦雇員，數十個機構已提交了縮減員工的計劃。\n\n--美國服務業活動停滯不前，投入價格指標徘徊在近三年最高\n\n--獨家：參議員稱特朗普考慮大幅減免在美生產汽車的關稅\n\n共和黨參議員Bernie Moreno及汽車行業官員稱，特朗普考慮為美國汽車生產提供重大關稅減免，可能有效消除主要汽車製造商支付的大部分成本。Moreno表示：“向全球車企傳遞的信號是，你在美國進行最終組裝：我們將獎勵你。對於福特、豐田、本田、特斯拉、通用汽車，這些幾乎按順序排列的五大本土化率最高的汽車製造商，它們將免受關稅影響。”\n\n*杰斐遜還表示，即使就業報告和其他聯邦政府報告因持續停擺而推遲，聯儲決策者也能在10月會議前掌握充分的信息。\n\n--美聯儲理事米蘭再度呼籲激進降息，但淡化與其他決策者的分歧\n\n美聯儲理事米蘭再次呼籲採取激進降息路徑，理由是特朗普政府政策推動經濟出現重大變化。他還表示，自己與其他官員之間的政策分歧並不像外界認為的那樣巨大。\n\n*米蘭還稱，他主張的積極降息不會削弱美聯儲應對突發性經濟疲軟的能力。\n\n--芝加哥聯儲總裁古爾斯比表示，在通脹仍高於2%的目標之際，他對進行一系列降息持謹慎態度。\n\n*紐約聯儲總裁威廉姆斯表示，不可預測的變化是不可避免的，各國央行需要意識到這一點，並制定在這種環境下運作的策略。\n\n--英歐央行決策者齊發聲：歐洲必須抵制放鬆銀行監管的誘惑\n\n歐洲央行總裁拉加德表示：\"決策者不應降低對銀行的標準，而應提高針對從事類似銀行活動或與銀行業有重要聯繫的非銀行機構的標準。英國央行總裁貝利警告稱，隨著人們對過去危機的記憶逐漸淡化，放鬆金融監管存在風險，並表示央行需要密切關注新的潛在威脅。歐洲央行執委施納貝爾警告稱，\"競相逐低\"將助長不穩定性，為未來的危機埋下禍根。\n\n--IMF表示，越來越多國家尋求通過對特定企業和行業提供公共支持來重塑經濟，但補貼和其他產業政策可能代價高昂，除非謹慎使用，否則未必有效。IMF指出，產業政策可以幫助國家將生產帶回本土，並在某一目標行業趕上全球競爭對手，但也可能推高消費者價格並導致資源錯配。\n\n--加拿大總理卡尼的辦公室表示，卡尼計劃於周二在華盛頓與特朗普會晤，討論經濟和安全問題。\n\n--歐盟統計局稱，歐元區8月生產者物價指數(PPI)較前月下降0.3%，預估為下降0.1%。PPI較上年同期下降0.6%，預估為下降0.4%。\n\n--意大利經濟與財政部長焦爾杰蒂在政府多年預算計劃中表示，歐洲央行應恢復降息，以重振幾近停滯的歐元區經濟。\n\n--美元回落，兌主要貨幣出現連續數周的跌勢，美國政府停擺的不確定性給經濟前景蒙上陰影，並推遲了對判斷經濟走向至關重要的關鍵數據的發布。歐元兌美元上漲0.2%，至1.1739美元，本周升勢創一個月來最佳。美元指數下跌0.1%，報97.72，本周創7月以來最差單周表現。美元兌瑞郎下跌0.3%，至0.7951瑞郎，創8月中以來最差周度表現。英鎊兌美元上漲0.3% 至1.3479美元，創8月11日以來最大單周漲幅。美元兌日圓上漲0.1%，報147.44日圓，本周仍上漲1.4%，為5月中以來最大漲幅。比特幣上漲1.5%，報122.530.82美元。\n\n--歐元區公債收益率變化不大，由於美國政府關門，美國經濟數據的發布受到影響，關鍵的非農就業報告推遲發布。10年期德債收益率持穩於2.7%。美/德10年期公債收益率差擴大至140個基點。意大利10年期公債收益率持穩於3.54%，意大利/德國10年期公債收益率差擴大至84個基點。\n\n--油價收高，但在OPEC+可能增加供應的消息傳出後，周線跌幅達8.1%。布蘭特原油期貨收漲42美分，漲幅0.7%，結算價報每桶64.53美元；美國原油期貨收漲40美分，漲幅0.7%，結算價報60.88美元。本周，布蘭特原油下跌8.1%，為三個多月來最大單周跌幅。美國原油周線下跌7.4%。\n\n--金價上漲，徘徊在歷史高位附近，並連續第七周上漲，人們對美國政府長期停擺的經濟影響的擔憂日益加劇，以及降息預期。1749 GMT，現貨金上漲0.7%，至每盎司3,884.19美元，本周上漲逾3%。12月美國期金收漲逾1%，結算價報每盎司3,908.9美元。\n\n--銅價創下16個月新高，受助于供應緊張和美元走軟。1600 GMT，LME三個月期銅上漲2.2%，報每噸10,719美元，稍早觸及10,765美元的2024年5月以來最高，本周上漲5.3%，創2024年9月以來最佳周度表現。美國Comex銅價上漲3.1%，至每磅5.05美元，自7月下旬以來首次突破5美元大關。\n\n注：其他重要財經新聞瀏覽請點選；近日《路透早報》請點選。(完)\n\n© Copyright Thomson Reuters 2025. Click For Restrictions - https://agency.reuters.com/en/copyright.html\n\n來自 Reuters 的更多新聞",
    "ContentLength": 2232
  },
  {
    "Source": "TradingView - Reuters",
    "URL": "https://tw.tradingview.com/news/reuters.com,2025:newsml_L6T3VI0R4:0/",
    "Date": "2025-10-02",
    "Title": "《路透早報》--10月2日",
    "Content": "《路透早報》--10月2日\n\n一周全球重要經濟數據和事件預告PDF：\n\n簡體： https://tmsnrt.rs/3VDG3RX\n\n繁體： https://tmsnrt.rs/46muzZc\n\n--美國政府停擺經濟影響料有限，但數據缺口令美聯儲決策複雜化\n\n* 白宮在聯邦政府停擺第一天警告稱，裁員迫在眉睫，但副總統萬斯堅稱尚未做出最終決定。白宮發言人萊維特對記者表示，政府機構已經在為裁員做準備。\n\n* 標普全球：美國政府停擺給美聯儲貨幣政策前景增添不確定性\n\n--白宮凍資民主黨州項目，停擺成政治施壓工具\n\n特朗普政府周三凍結260億美元用於民主黨勢力州的項目資金，兌現了利用政府關門事件針對民主黨優先項目進行打擊的威脅。遭到鎖定的項目包括紐約州交通項目資金180億美元，以及16個民主黨執政州綠色能源項目資金80億美元。與此同時，副總統萬斯警告說，如果政府停擺超過數天，政府可能會擴大對聯邦工作人員的清洗。這些舉動表明，特朗普將履行他的威脅，利用停擺來懲罰他的政治對手，並擴大他對7萬億美元聯邦預算的控制。而根據美國憲法規定，聯邦預算屬於國會的職權範圍。\n\n--特朗普稱將於四周後與習近平會晤，大豆將是主要議題之一\n\n美國總統特朗普表示，大豆將是他四周後與中國國家主席習近平會晤時討論的一個主要議題。特朗普在Truth Social發帖稱：\"我們國家的大豆種植戶正在受到傷害，因為中國僅僅出於'談判'原因而不購買。\"中國進口商尚未購買美國秋季收割的大豆，這使美國農民損失了數十億美元的銷售額。\n\n--美國9月製造業活動小幅回升，但新訂單和就業依然疲弱\n\n--人民幣和澳元在全球儲備中占比增加，美元占比下降--IMF數據\n\n--中國南部戰區表示，9月以來組織海空兵力持續加強黃巖島領海周邊海空域巡邏警戒，進一步強化管控力度，有效應對侵權挑釁，堅決捍衛國家主權安全，堅決維護南海地區和平穩定。\n\n--七國集團(G7)財長表示，將採取聯合措施，通過制裁那些繼續增加購買俄羅斯石油和協助規避制裁的國家，加大對俄羅斯施壓。\n\n--克宮警告歐洲領導人不要竊取俄羅斯資產，否則歐洲投資和存款會遭反噬\n\n克里姆林宮警告歐洲領導人，對於任何盜用該國資金的個人或國家，俄羅斯將予以追究，並警告說俄羅斯資產如被盜用，歐洲的存款和投資將受到嚴重損失。歐盟正在醞釀一項提案，利用凍結在歐洲的俄羅斯資產向烏克蘭提供 1,400 億歐元（1,643.7 億美元）的貸款。\n\n--據塔斯社報導，俄羅斯仍在等待美國總統特朗普對俄總統普京的一項提議作出回應。普京提出，在一項重要軍控條約到期後，俄羅斯自愿維持對已部署戰略核武器的上限。\n\n--據塔斯社報導，俄羅斯副外長里亞布科夫表示，美俄兩國旨在改善關係的下一輪會談將在秋季末之前舉行。\n\n--Semafor援引知情人士的話報導稱，英特爾正在與AMD進行早期談判，讓後者成為其芯片代工客戶。AMD 沒有立即回應置評請求，英特爾也拒絕置評。\n\n--三星電子和SK海力士表示，他們已簽署意向書，為OpenAI的數據中心供應記憶體芯片，韓國芯片製造商將與創造出ChatGPT的業者聯手滿足其Stargate項目不斷增長的需求。\n\n--石油輸出國組織(OPEC)在一份聲明中表示，OPEC+的一個委員會在周三的會議上強調，有必要全面遵守石油產量協議，並要求部分成員國額外減產，以彌補此前超出配額的產量。\n\n--美國主要股指周三收盤走高，醫療保健板塊漲幅最大，投資者忽略弱於預期的民間就業數據以及與美國聯邦政府停擺第一天相關的不確定性。道瓊斯工業指數上漲43.21點，或0.09%，報46,441.10點；標普500指數上漲22.74點，或0.34%，報6,711.20點；納斯達克指數上漲95.15點，或0.42%，報22,755.16點。\n\n--歐洲股市STOXX 600 指數收盤創下紀錄新高，醫療保健股領漲，此前美國與輝瑞達成一項協議，降低了該行業的不確定性，與此同時，投資者消化美國政府開始陷入停擺的影響。泛歐STOXX 600 指數急升 1.2%，創下7月23日以來最大單日百分比漲幅。大多數地區股指也收高，英國富時 100 指數創下紀錄新高。法國CAC 40指數攀升0.9%。德國 DAX 指數收漲0.98%。\n\n--美元兌日圓跌至兩周最低，此前的數據顯示，美國9月民間就業崗位萎縮，強化了美聯儲今年將再降息兩次的預期。就業數據公布後，美元兌歐元和英鎊跌至一周最低。午後交易中，美元兌日圓下跌0.6%，至147.07日圓。美元兌瑞郎持平於0.7967瑞郎。歐元兌美元紐約盤尾上漲0.1%，報1.1738美元。英鎊兌美元報1.3487美元，上漲0.3%。美元指數一度觸及一周最低，盤尾報97.68，跌幅為0.2%。\n\n--銅價上漲超過1%，受助于銅礦供應干擾，而且隨著美國政府開始陷入停擺，美元走軟。1600 GMT，倫敦金屬交易所（LME）三個月期銅報每噸10,374.50美元，上漲1.1%，稍早高見10,399美元，接近9月25日觸及的15個月高位10,485美元。\n\n重要經濟數據(GMT時間)：\n\n--香港8月零售銷售貨值(0830)\n\n--歐元區8月失業率(0900)\n\n--美國9月Challenger企業裁員計劃(1130)、一周初請失業金人數(1230)、8月工廠訂單及8月耐久財訂單修正值(1400)\n\n--日本8月失業率(2330)\n\n重大經濟事件及官員講話(GMT時間)：\n\n--澳洲央行公布金融穩定報告(0130)\n\n--日本央行總裁植田和男講話(0635)\n\n--歐洲央行銀行監管委員會委員蒙塔涅爾發表談話(0730)\n\n--達拉斯聯儲總裁洛根參加對話(1430)\n\n--瑞典央行總裁泰登討論經濟形勢與最新的政策利率決定(1500)\n\n--法國央行總裁維勒魯瓦德加洛發表講話(1630)\n\n--歐洲央行副總裁德金多斯參加對話(1700)\n\n--加拿大央行副總裁Rhys Mendes講話(1740)\n\n注：其他重要財經新聞瀏覽請點選；近日《路透早報》請點選。(完)\n\n(整理 陳宗琦/鄭茵)\n\nmingxia.du@thomsonreuters.com\n\n; 86-10-56692070;))\n\n© Copyright Thomson Reuters 2025. Click For Restrictions - https://agency.reuters.com/en/copyright.html\n\n來自 Reuters 的更多新聞",
    "ContentLength": 2696
  }
]
