{
  "last_updated": "2026-01-31",
  "total_reports": 28,
  "reports": [
    {
      "Source": "TradingView - Reuters Brief",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YV0XI:0/",
      "Date": "2026-01-31",
      "Time": "06:32:47",
      "Title": "《路透早報》--1月31日",
      "Content": "以下為1月30日下午6:00至1月31日早上6:00的重大新聞與市場摘要：\n\n--特朗普提名瓦爾許出任美聯儲主席，或重塑貨幣政策框架\n\n美國總統特朗普周五提名前美聯儲理事瓦爾許在鮑威爾任期於5月結束後出任美聯儲主席。“我認識凱文很久了，我毫不懷疑他將成為最偉大的美聯儲主席之一，也許是最好的。更重要的是，他完全符合‘典型美聯儲主席的形象’，他絕不會讓你失望，”特朗普表示。\n\n*特朗普還表示，向瓦爾許詢問其具體的利率計劃“可能不太合適“，但相信他傾向於降低借貸成本。\n\n*美國國家經濟委員會主任哈西特表示，美聯儲本周未降息實屬失策，同時呼籲迅速批準瓦爾許出任美聯儲主席。\n\n*美聯儲理事米蘭表示，他認為瓦爾許會完成他在美聯儲的剩餘任期。米蘭還表示，特朗普從未要求他在貨幣政策方面採取任何行動。\n\n--特朗普提名瓦爾許領導美聯儲，華爾街聚焦其降息與縮表平衡\n\n特朗普提名瓦爾許領導美聯儲，儘管這一決定消除了華爾街對下任美聯儲主席人選的不確定性，但投資者仍在評估，這位前美聯儲理事過去的鷹派傾向將如何與特朗普總統要求大幅降息的立場相契合。\n\n--共和黨參議員威脅阻止特朗普的美聯儲主席提名人選確認程序\n\n特朗普提名瓦爾許一事在國會遭遇共和黨內部阻力。北卡羅來納州共和黨參議員Thom Tillis稱，在司法部對鮑威爾的調查\"完全且透明地得到解決\"之前，他將繼續\"反對確認任何美聯儲提名人，包括主席人選\"。參議院金融委員會主席斯科特表示，他期待對瓦爾許進行\"審慎而及時的確認程序\"。民主黨參議員沃倫表示，特朗普提名瓦爾許是他為掌控美聯儲所採取的最新行動。\n\n--美聯儲理事沃勒表示，他在本周會議上反對維持利率不變，主張降息25個基點，因為他認為本已疲軟的勞動力市場存在\"重大風險\"，可能出現更嚴重的下滑。\n\n*聖路易斯聯儲總裁穆薩萊姆表示，除非就業市場開始惡化或通脹下降，否則美聯儲無需進一步降息。\n\n--美國生產者物價創五個月來最大環比漲幅，企業轉嫁關稅成本\n\n美國12月生產者物價指數（PPI）創五個月來最大環比漲幅，部分歸因于進口關稅的傳導效應，這意味著未來數月通脹可能加速，讓美聯儲能夠在一段時間內維持利率穩定。勞工統計局數據顯示，12月最終需求PPI環比漲幅加速至0.5%，為7月以來最大漲幅，預測為上漲0.2%。PPI同比漲幅持平於3.0%。2025年PPI漲幅放緩至3.0%。剔除食品和能源後，12月PPI漲幅加速至0.4%。\n\n--特朗普表示，伊朗希望達成協議，但未透露更多細節，稱\"讓我們拭目以待\"。他還表示，他認為已經接近達成結束俄羅斯對烏克蘭戰爭的協議。\n\n---加拿大經濟增長在11月陷入停滯，服務業擴張被商品生產行業的疲軟所抵消。該國統計局稱，11月GDP環比持平，預估為微增0.1%。統計局初步估計12月產出將增長0.1%，預計2025年加拿大經濟將增長1.3%。\n\n--歐洲央行調查顯示，歐元區消費者在12月將長期通脹預期上調至歷史新高。\n\n--歐盟統計局數據顯示，歐元區上季度經濟增速超出預期，消費和投資加速增長，抵消出口疲軟及美國貿易政策引發的高度不確定性。歐元區經濟第四季環比增長0.3%，預估為0.2%，同比增速達1.3%，預估為1.2%。\n\n-- 歐洲兩個行業協會表示，中國對歐盟乳製品的反補貼調查已結束，中方下調對部分歐盟乳製品擬徵關稅。由於在非工作時間，無法聯繫到歐盟執委會和中國商務部置評。\n\n--德國失業人數突破300萬大關，創12年來最高，而通脹率則重新升至歐洲央行2%的目標之上。數據顯示，德國1月通脹率意外小幅回升，同比加速至2.1%，預估為維持在2.0%不變。1月失業人數增加17.7萬人，總人數升至308萬人。\n\n--英相斯塔默稱忽視中國“愚蠢”，反駁特朗普\"危險\"論\n\n英國首相斯塔默表示，英國不與中國接觸是愚蠢的，駁斥特朗普關於與中國開展商業往來\"非常危險\"的說法。“主張英國要無視(中國)的想法是愚蠢的，”斯塔默表示。“如果英國成為唯一拒絕與中國接觸的國家，那將不符合我們的國家利益。”中國外交部未立即回應對特朗普言論的置評請求。\n\n--英國央行數據顯示，12月英國貸款機構批準的抵押貸款數量降至61,013件，創2024年6月以來新低，預估中值為64,800件。\n\n--官方數據顯示，上周日本並未干預外匯市場，證實政府捍衛日圓的努力僅限於口頭警告。\n\n-- 伊朗國家媒體報導，伊朗總統佩澤希齊揚向阿聯酋總統表示，伊朗將對\"任何侵略行為\"作出即刻而果斷的回應。\n\n--路透看到的一封信函顯示，聯合國秘書長古特雷斯對各成員國表示，聯合國正面臨\"迫在眉睫的財政崩潰\"風險，原因包括未繳會費以及一項迫使其退還未用資金的預算規則。聯合國發言人未立即回應置評請求。\n\n--世界衛生組織官員表示，尼帕病毒傳播的風險偏低，並稱在與印度兩名感染者接觸的190多人中，沒有一人檢測呈陽性或出現該疾病的症狀。\n\n--世界貿易組織專家組支持了中國的申訴，建議美國調整對清潔能源的稅收抵免政策。\n\n--五位OPEC+代表向路透透露，OPEC+很可能在周日會議上維持暫停增產的決定。OPEC及沙特、俄羅斯當局未立即回應置評請求。\n\n--台灣央行稱，美國財政部在半年度匯率政策報告指出，長期以來台灣經常帳順差主要反映高儲蓄率，此與人口老化和相對嚴格的財政紀律有關；至於近年來台灣對美國貿易順差大幅成長，主要受美國對台灣科技產品強勁需求影響。\n\n--香港特區政府稱，就巴拿馬最高法院裁定巴拿馬政府與和記港口巴拿馬港口公司續約經營的兩個巴拿馬港口違憲一事，特區政府對此表示強烈不滿。\n\n--香港證監會發出通函指示上市保薦人從速進行內部檢討，以糾正招股文件擬備工作中的嚴重缺失。\n\n--中國財政部公布，2025年全年國有企業實現利潤總額40,380.5億元人民幣，同比下降6.3%。據路透統計，這是三年來首次負增長。\n\n--中國國家外匯管理局數據顯示，2025年12月中國外匯市場總計成交3.99萬億美元，較11月增長16%；1-12月累計成交42.64萬億美元。\n\n*外管局還公布，12月服務貿易逆差137億美元，較上月的117億美元有所擴大；2025年服務貿易逆差1,898億美元。\n\n--中國海關總署表示，從2026年1月29日起，允許符合相關要求的韓國野生水產品進口。\n\n--中國證監會召開資本市場“十五五”規劃上市公司座談會，證監會主席吳清強調，要全力鞏固資本市場穩中向好勢頭，聚焦持續深化資本市場投融資綜合改革、提高制度包容性適應性，抓緊推出深化創業板改革，持續推動科創板改革落實落地。\n\n*證監會還表示，為落實關於推動中長期資金入市的指導意見和實施方案，進一步完善上市公司再融資戰略投資者制度，對《上市公司證券發行註冊管理辦法》部分規定進行修改完善，包括擴大戰略投資者類型，明確最低持股比例要求等。\n\n--萬科公布“巨虧”業績預告，料2025年錄得凈虧820億元人民幣，較上年同期的凈虧494.8億元進一步擴大，預計將創其1991年上市以來最大虧損記錄。萬科並公告稱，六隻境內債券將於2月2日開市起停牌。\n\n[市場摘要]\n\n股市：\n\n--華爾街主要股指周五收低，因投資者認為總統特朗普提名前美聯儲理事瓦爾許接替美聯儲主席鮑威爾屬鷹派選擇，同時也在消化企業財報以及高企的通脹數據。道瓊斯工業指數下跌179.09點，跌幅0.36%，至48,892.47點；標普500指下跌29.98點，跌幅0.43%，至6,939.03點；納斯達克指下跌223.30點，跌幅0.94%，至23,461.82點。對利率敏感、以小盤股為主的羅素2000指數近來跑贏大盤，但周五收跌1.6%。不過，羅素2000指數本月仍上漲逾5%，相比之下，標普500指數上漲1.4%，納斯達克指數上漲0.9%。道指上漲1.7%，連續第九個月上漲，為2018年以來最長連漲紀錄。本周，標普500指數上漲0.3%，道指下跌0.4%，納指下跌0.2%。\n\n--歐洲主要股指收高，創2021年以來最長的月度連漲紀錄。投資者消化了企業財報數據，同時特朗普提名瓦爾許出任美聯儲主席的消息也對市場產生影響。泛歐STOXX 600指數收漲0.6%至611點，1月累計上漲3%，實現連續第七個月上漲。英國富時100指數收高0.51%。德國DAX指數收漲0.94%。法國CAC-40指數收升0.68%。\n\n匯市：\n\n--美元上漲，此前瓦爾許被選定為下一任美聯儲主席，美元從本周早些時候的急劇拋售中回升，分析師稱這輪拋售在短期內屬於過度反應。美元指數上漲0.79%，至96.93。歐元兌美元下跌0.79%，至1.1874美元。日圓兌美元下跌0.89%，報154.49日圓。美元兌日圓本周下跌0.8%。比特幣下跌0.16%，至84,264美元，稍早觸及81,104美元的11月21日以來最低。\n\n債市：\n\n--美國長期公債價格下跌，此前特朗普提名瓦爾許出任美聯儲主席。鑒於瓦爾許傾向於縮減美聯儲資產負債表，這一選擇被視為利空債券。30年期公債收益率一度跳升6個基點至4.914%，尾盤報4.872%，上漲1.7個基點，並創12月底以來最大單周漲幅，本月累計上漲4個基點，為連續第三個月上漲。10年期公債收益率上漲1.2個基點至4.239%，1月累計漲幅達9個基點。兩年/10年期公債利差一度擴大至71.50個基點的逾一周最闊，盤尾報71.3個基點，本月擴大近4個基點。兩年期公債收益率下跌2.5個基點至3.527%，錄得11月中以來最大單周跌幅，但創2025年7月以來最大月度漲幅。\n\n--兩年期德債收益率小漲0.5個基點至2.06%，但本周累計下跌6.5個基點，為去年10月以來最大周線跌幅，1月迄今已下跌6個基點，創去年4月以來最大月度跌幅。投資者押注歐洲央行在制定貨幣政策時會考慮歐元走強帶來的通縮壓力。10年期德債收益率上漲1.5個基點至2.85%。30年期德債收益率上漲1.6個基點至3.5%。法/德公債利差報58個基點。意大利10年期公債收益率上漲2個基點至3.47%，與可比德債利差約為61個基點。\n\n油市：\n\n--油價微跌幾美分，整固近期漲幅，但在美伊持續緊張局勢支撐下，仍維持在近六個月高位附近。布蘭特原油期貨結算價報每桶70.69美元，下跌2美分或0.03%。3月美國原油期貨結算價報每桶65.21美元，下跌21美分或0.32%。\n\n金屬：\n\n--金價重挫，勢將創下1983年以來最大單日跌幅，此前特朗普宣布美聯儲主席提名人選。與此同時，銀價暴跌近30%，勢將創下有記錄以來最大單日跌幅。1857 GMT，現貨金大跌9.5%，至每盎司4,883.62美元。美國2月期金收跌11.4%，報每盎司4,745.10美元。不過，金價本月仍上漲逾13%，為連續第六個月上漲。現貨銀暴跌27.7%，報每盎司83.99美元，盤中一度跌至77.72美元。花旗表示，黃金投資配置受到多種相互交織的地緣政治和經濟風險的影響，但其中約一半的風險可能會在今年晚些時候消退。。\n\n--銅價下跌，受美元走強及獲利了結打壓，部分投資者在銅價昨日創下歷史新高後鎖定獲利。1706 GMT，LME指標三個月期銅大跌3.3%，至每噸13,161美元。本月銅價累計上漲6%。\n\n注：其他重要財經新聞瀏覽請點選；近日《路透早報》請點選。(完)",
      "ContentLength": 4648,
      "HasTables": false,
      "ScrapedAt": "2026-01-31 06:42:40"
    },
    {
      "Source": "TradingView - Reuters Stocks",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YV18E:0/",
      "Date": "2026-01-31",
      "Time": "06:27:11",
      "Title": "美國股市：下跌，投資者擔憂美聯儲主席提名人、企業盈利和通脹問題",
      "Content": "華爾街主要股指周五收低，因投資者認為總統特朗普提名前美聯儲理事瓦爾許接替美聯儲主席鮑威爾屬鷹派選擇，同時也在消化企業財報以及高企的通脹數據。 \n\n除了評估美國與伊朗等國家之間的緊張局勢帶來的風險外，投資者還擔心美國政府可能再次停擺，因為參議院出現了新的障礙，阻礙達成一項能夠確保各機構繼續獲得撥款的協議。\n\n在美聯儲方面，55歲的瓦爾許預計將支持降息，但不會採取其他部分潛在人選所主張的更激進地放寬政策。若獲參議院確認，他將在鮑威爾5月任期結束後接掌美聯儲，而他曾主張美聯儲應縮減其在經濟中的角色，並重新審視貨幣政策框架。\n\n“市場正在根據特朗普提名瓦爾許以及貨幣政策前景進行重新定價，”Citizens Wealth首席投資官Michael Hans說。他還指出，美元周五走強，貴金屬大幅下跌，近期交易模式也出現逆轉。\n\n蘋果 股價收復盤中失地，收高0.4%，該公司周四公布業績。數據顯示，美國12月生產者價格升幅超預期，暗示未來數月通脹可能回升。\n\nEdward Jones高級全球策略師Angelo Kourkafas表示：“投資者擔憂美聯儲主席提名、科技企業喜憂參半的財報、揮之不去的通脹壓力，以及政府可能短暫停擺的不確定性。”\n\n道瓊斯工業指數 下跌179.09點，跌幅0.36%，至48,892.47點；標普500指數 下跌29.98點，跌幅0.43%，至6,939.03點；納斯達克指數 下跌223.30點，跌幅0.94%，至23,461.82點。\n\n對利率敏感、以小盤股為主的羅素2000指數 近來跑贏大盤，但周五收跌1.6%。\n\n不過，羅素2000指數本月仍上漲逾5%，相比之下，標普500指數上漲1.4%，納斯達克指數上漲0.9%。道指上漲1.7%，連續第九個月上漲，為2018年以來最長連漲紀錄。\n\n本周，標普500指數上漲0.3%，道指下跌0.4%，納指下跌0.2%。\n\n在標普500指數的11大板塊中，材料指數 跌幅居前，下跌1.9%，因美國上市的金礦和銀礦股隨金價和銀價大幅拋售而走低。\n\n防禦類必需消費品股 是當日表現最好的板塊，上漲1.4%。\n\n本周，投資者對大型企業的財報反應不一，並發出嚴厲警告：只要經濟增長持續下去，創紀錄的資本支出狂潮就會被容忍。\n\n蘋果表示，3月當季營收預計將同比增長多達16%，好於預期，但也警告內存芯片價格上漲開始侵蝕利潤。\n\n微軟 周五收跌0.7%，周四大跌10%，創2020年3月以來最大單日跌幅，因雲業務營收表現不佳。Meta 股價周五收跌3%。\n\n特斯拉 周五上漲3.3%，為標普500指數提供最大提振。此前有報導稱，SpaceX正在與特斯拉及其它馬斯克旗下企業洽談合作。該股周四在發布財報後下跌。\n\n紐約證交所跌漲股家數比為1.59:1，納斯達克市場為2.02:1。\n\n19只標普500指數成分股創52周新高，10只創新低；72只納斯達克指數成分股創新高，205只創新低。\n\n美國各交易所累計成交238.8億股，高於過去20個交易日的日均成交量194.2億股。(完)\n\n[表格內容]\n****查閱相關新聞或頁面，請點選下列代碼連結**** 美國股市 一周展望 歐洲股市報導 日本股市報導 中港股市報導 中國股市報導 台灣股市報導 股市簡訊 納斯達克最活躍個股 (.AV.O) 紐約證交所最活躍個股 (.AV.N) 納斯達克漲幅居前個股 (.PG.O) 紐約證交所漲幅居前個股 (.PG.N) 納斯達克跌幅居前個股 (.PL.O) 紐約證交所跌幅居前個股 (.PL.N) 標普主要分類指數 (0#.GSPMAJOR) 英股富時指數 CURRENCYCOM:UK100 德股DAX指數 法股CAC-40指數 韓國股市已並入韓國金融市場報導中，相關稿件請點選",
      "ContentLength": 1562,
      "HasTables": false,
      "ScrapedAt": "2026-01-31 06:42:43"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YV16A:0/",
      "Date": "2026-01-31",
      "Time": "04:49:35",
      "Title": "《全球匯市》美元上漲，特朗普提名瓦爾許出任美聯儲下一任主席",
      "Content": "美元周五上漲，此前美聯儲前理事瓦爾許被選定為下一任美聯儲主席，美元從本周早些時候的急劇拋售中回升，分析師稱這輪拋售在短期內屬於過度反應。\n\n特朗普總統周五宣布，在鮑威爾的任期於5月結束時，瓦爾許將接任美聯儲主席一職。市場普遍認為瓦爾許可能支持較低利率，但其放鬆政策的力度將遠不及其他潛在提名人選。\n\nBannockburn全球外匯首席市場策略師Marc Chandle指出，周五美元上漲至少部分歸因于市場在公告前夕調整倉位。\n\n“從短期動能來看，美元處於嚴重超賣狀態，”他稱。同時，瓦爾許“畢竟只是一個人……短期內並沒有達成降息共識。即便到年底會像12月點陣圖所暗示的那樣出現一兩次遲到的降息，也不代表很快就會降息。”\n\n美聯儲12月會議後公布的決策者預測顯示，預期中位數是今年降息一次、幅度為25個基點。\n\n美聯儲周三如市場普遍預期維持利率不變。鮑威爾稱當前經濟穩健，通脹與就業風險均已緩解，這一前景可能意味著要等待較長時間才會進一步降息。\n\n聯邦基金期貨交易員目前預計今年將降息52個基點，首次25個基點的降息可能出現在6月。\n\n凱投宏觀首席市場經濟學家John Higgins在報告中指出：\"市場對特朗普提名瓦爾許擔任美聯儲下任主席的反應，基本符合我們的判斷，即總統將作出相對穩妥的選擇。“\n\n他稱：\"市場普遍認為瓦爾許並非總統的傀儡，他不會助長美聯儲獨立性遭到進一步削弱的趨勢，也不會加劇貨幣貶值的擔憂。\"\n\n美元指數 上漲0.79%，至96.93。歐元兌美元 下跌0.79%，至1.1874美元。\n\n周五數據顯示美國12月生產者物價漲幅超預期，企業似乎正將進口關稅導致的成本上漲轉嫁給消費者，美元應聲進一步上漲。\n\n特朗普周四支持參議院兩黨達成的旨在避免政府停擺的支出協議，但他承認停擺仍有可能發生。國會議員們仍在就限制移民執法人員的措施進行談判。\n\n地緣政治風險持續發酵。特朗普周四表示計劃與伊朗對話，但與此同時美國又向中東派遣一艘軍艦，國防部長赫格塞斯稱軍方隨時準備好執行總統的任何決定。\n\n日圓兌美元 下跌0.89%，報154.49日圓。不過美元兌日圓本周仍可能下跌0.8%。 \n\n隨著日本決策者暗示可能與美國協調干預外匯市場以捍衛此前跌至近18個月最低的日圓，日圓在過去一周大幅上漲。\n\n美國財政部在最新提交國會的匯率報告中，並未再呼籲日本央行繼續加息，刪除了半年前報告中的相關表述。\n\n加密貨幣方面，比特幣 下跌0.16%，至84,264美元，稍早觸及81,104美元的11月21日以來最低。（完）\n\n[表格內容]\n****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1262,
      "HasTables": false,
      "ScrapedAt": "2026-01-31 05:42:40"
    },
    {
      "Source": "TradingView - Reuters Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YV15X:0/",
      "Date": "2026-01-31",
      "Time": "04:35:17",
      "Title": "美國債市：長債下跌，特朗普提名美聯儲主席人選推動收益率曲線趨陡",
      "Content": "美國長期公債價格周五下跌，此前總統特朗普表示將提名前美聯儲理事瓦爾許(Kevin Warsh)出任美聯儲主席。鑒於瓦爾許傾向於縮減美聯儲資產負債表，這一選擇被視為利空債券。\n\n午後交易時段因周末臨近成交量減少，長債收益率漲幅有所收窄。\n\n瓦爾許的提名促使投資者重新評估公債市場政策支持前景，推高長債收益率。他曾呼籲美聯儲進行體制改革，包括減少量化寬鬆力度，這意味著他可能推動縮減美聯儲持有的債券規模。\n\n\"若縮減資產負債表成為首要任務，在其他條件不變的情況下，這將對長期債券收益率形成上行壓力，因為公債市場將面臨額外供應，\"賓夕法尼亞州Bryn Mawr Trust固定收益部主管Jim Barnes表示。\n\n但Barnes認為縮減資產負債表未必是現實目標。\n\n\"如果你設想有人上任後可能會著手縮減資產負債表規模，我只是認為，這不太可能會成為一開始的工作重點。接下來將會評估其他事項，最重要的是通脹方面和雙重使命中的勞動力市場方面，並試圖弄清楚短期利率該如何調整，\"Barnes指出。\n\n一些分析師還表示，瓦爾許過往的鷹派立場在一定程度上緩解了市場對其可能順應特朗普對美聯儲政策期望的擔憂。\n\n美國30年期公債收益率 (US30YT=RR) 早盤一度跳升6個基點至4.914%的盤中高位，尾盤報4.872%，上漲1.7個基點，有望創下自去年12月底以來最大單周漲幅。本月該收益率累計上漲4個基點，實現連續第三個月上漲。\n\n指標10年期公債收益率 上漲1.2個基點至4.239%，1月累計漲幅達9個基點。\n\n隨著瓦爾許獲提名消息傳出，收益率曲線趨陡。兩年期與10年期公債利差 (US2US10=TWEB)一度擴大至71.50個基點，創逾一周最大值。最新數據顯示該利差為71.3個基點，高於周四尾盤的66.8個基點。1月份該收益率曲線已陡峭化近4個基點。\n\n投資者同時指出對美聯儲獨立性的擔憂，強調瓦爾許是特朗普提名的人選，且美國總統曾多次批評美聯儲主席鮑威爾的降息步伐。\n\nNatixis Investment Managers Solutions投資管理首席投資策略師Jack Janasiewicz表示：\"我們提醒投資者，單一票數不足以改變貨幣政策方向。\"\n\n\"考慮到12位成員組成的聯邦公開市場委員會最近的政策利率決議中僅有兩名決策者支持降息，瓦爾許需要極大影響力才能說服其他投票成員，從而在未來推動更多降息時獲得所需多數票。\"\n\n美國兩年期公債收益率 (US2YT=RR) 下跌2.5個基點至3.527%。該收益率錄得11月中以來最大單周跌幅，但創下2025年7月以來最大月度漲幅。\n\n在數據顯示美國12月生產者價格漲幅超預期，表明企業正將進口關稅相關成本轉嫁給消費者後，公債收益率走高。\n\n美國勞工部勞工統計局數據顯示，最終需求生產者物價指數(PPI)上月升0.5%，此前11月未經修正的漲幅為0.2%。路透訪查的經濟學家此前預測該指數將上漲0.2%。\n\n12月PPI同比上漲3.0%，與11月漲幅持平。\n\n周五美國利率期貨顯示，市場預期今年將降息約51個基點，相當於兩次各25個基點的降息。而上周美聯儲維持利率不變後，市場預期降息幅度為44個基點。\n\n[表格內容]\n20:16 GMT 價格 收益率% 收益率變動 兩年期公債 (US2YT=RR) 99.94921875 3.5265 -0.0250 五年期公債 (US5YT=RR) 99.7890625 3.7967 -0.0080 10年期公債 98.078125 4.2414 +0.0140 30年期公債 (US30YT=RR) 96.078125 4.8756 +0.0220 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 美國現貨公債 美國指標公債報價 (0#USBMK=) 英國公債市場 歐元區公債市場 日本公債市場 中國債市 台灣債市 歐元區指標公債報價 (0#EUBMK=) 利率或央行相關報導",
      "ContentLength": 1646,
      "HasTables": false,
      "ScrapedAt": "2026-01-31 04:42:41"
    },
    {
      "Source": "TradingView - Reuters Stocks",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YV1W5:0/",
      "Date": "2026-01-31",
      "Time": "01:25:05",
      "Title": "特朗普任命沃什接替鮑威爾出任美聯儲主席後，美國股市下滑",
      "Content": "Pranav Kashyap/Twesha Dikshit\n\n 美國總統特朗普提名 前美聯儲理事沃什（Kevin Warsh）接替鮑威爾（Jerome Powell）領導美國央行後，美國股市周五下跌，許多投資者認為這一決定偏向鷹派。 \n\n現年55歲的美聯儲批評家沃什預計將傾向於降低利率，同時不會採取與其他一些潛在提名人有關的更激進的貨幣寬鬆政策。 \n\n他的任命需要參議院的確認，而主席鮑威爾的任期將於5月結束。如果得到確認，沃什將執掌一家央行，他認為該央行應縮減其在經濟中的作用，並重新思考其貨幣政策方法。\n\n\"沃什過去一直是鷹派人物，因此很難知道他究竟會朝哪個方向發展。AlphaCore財富咨詢公司的首席投資官格斯特（Eric Gerster）說：\"他歷來以更關注通脹而著稱。 \n\n- \"他對降低利率的想法持更開放的態度\n- 這顯然是本屆政府所尋求的。 \n\n與此同時，12月份生產者價格增幅超過預期 ，這表明未來幾個月通脹可能回升。 \n\n投資者繼續押注到2026年底至少會有兩次25個基點的降息。美國央行本周早些時候維持利率穩定，暫停了支撐美國股市的寬鬆周期。\n\n美東時間上午11:58，道瓊斯工業平均指數 下跌421.27點，或0.86%，至48,650.29點；標普500指數 下跌39.69點，或0.57%，至6,929.41點；納斯達克綜合指數 下跌175.50點，或0.74%，至23,509點。 \n\n對利率更為敏感的小型股羅素2000指數 下跌了1.6%。 \n\n華爾街的 \"恐懼指數\"--CBOE波動率指數從周四創下的一周高點19.31點回落至17.3點。\n\n小型股 1 月份表現優異 \n\n蘋果 結束了本周的科技財報，預計 3 月份季度收入增長將高於預期，最高可達 16%，但警告稱 ，存儲芯片價格上漲已開始對盈利能力構成壓力。 \n\n投資者本周對大型科技公司的財報發出了嚴正警告：只要業績持續增長，創紀錄的資本支出狂潮將被容忍。 \n\n微軟 的雲計算收入未能給人留下深刻印象，創下 2020 年 3 月以來最糟糕的一天，而 Meta 周四大漲 10%。 \n\n當天， 上漲了4.7%，因為有報導稱太空探索技術公司（SpaceX）正在探索與電動汽車製造商和埃隆-馬斯克（Elon Musk）經營的其他公司進行交易。 \n\n過去一年，人工智能交易推動美國股市創下歷史新高，但現在人工智能交易的門檻已經提高，有跡象表明，那些高增長的公司正在受到擠壓，這促使投資者轉向小盤股和其他被忽視的市場角落。\n\n小盤股羅素2000指數（Russell 2000 index） 和標準普爾600指數（S&P 600 index） (.SPCY)月底有望上漲近5%。\n\n相比之下，標普500指數和納斯達克指數的漲幅均略高於1.3%。\n\n\"格斯特補充說：\"我們看到的是，人們開始關注周期性因素，而不再關注圍繞人工智能的一些世俗因素。 \n\n與此同時，道指有望實現連續第九個月上漲，這是自2018年以來最長的連勝紀錄。 \n\n由於人工智能刺激了存儲需求，閃迪 第三季度業績預期好於預期，股價大漲9.7%。KLA Corp 第二季度利潤和收入超出華爾街預期，但股價下跌12.6%。\n\n在美國上市的黃金和白銀礦業公司股價下跌，金銀價格下跌超過5%，白銀價格下跌11%。標準普爾材料指數 下跌了2%，跌幅居前。",
      "ContentLength": 1393,
      "HasTables": false,
      "ScrapedAt": "2026-01-31 01:42:43"
    },
    {
      "Source": "TradingView - Reuters Stocks",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YV07M:0/",
      "Date": "2026-01-30",
      "Time": "19:08:45",
      "Title": "《一周展望》密集發布的企業財報及月度就業數據將考驗美國股市",
      "Content": "在重量級個股微軟 的財報令人感到失望、導致股市承壓之後，包括Alphabet 以及亞馬遜 等新一批大型企業財報出爐將令美國股市面臨考驗。\n\n華爾街也將關注將於2月6日發布的美國月度就業報告。本週，美國聯邦儲備理事會(美聯儲/FED)暫停降息週期，指稱勞動市場出現穩定跡象。\n\n隨著股市進入多頭市場的第四年，投資人對不斷上升的估值保持謹慎，尤其是那些受益於人工智能(AI)帶動獲利的樂觀情緒而股價飆升的公司。\n\n微軟在支援AI應用的基礎設施上投入巨資，但由於其雲端業務表現不佳，週四股價大幅下跌；與此同時，由於業內其他領域也出現令人失望的情況， 軟體股普遍受到打擊。\n\n“對於那些被寄予厚望的公司來說，它們必須拿出成績來，”Plante Moran Financial Advisors首席投資官貝爾德表示。 “即使它們實現了增長，但如果增長幅度未達到市場預期，它們的股價就有可能受到衝擊。”\n\n儘管週四股市下跌，標普500指數 今年以來仍上漲近2%，接近歷史高點。本週早些時候，該指數首次突破7,000點大關，隨後有所回落。\n\n**財報季達到高潮**\n\n標普500指數成分股中約有四分之一的公司將在下周公布季度業績，強勁的獲利成長預期是支撐2026年股市樂觀前景的關鍵因素。\n\n截至週四，標普500指數成分股公司中已有133家公布業績，其中74.4%的公司獲利超出分析師預期，略低於先前四個季度的78%（數據來自LSEG/IBES）。預計第四季獲利將比上年同期成長10.2%。\n\n與微軟不同，另一家市值龐大的公司Meta 公布季度營收強勁，使其股價獲得提振；Meta也是AI領域的主要投資方。\n\n投資者現在將關注谷歌母公司Alphabet和亞馬遜這兩家專注於AI的“超大規模企業”的業績和資本支出計劃。\n\nTD Wealth首席投資策略師Sid Vaidya表示：“儘管投資者對幾家超大規模數據中心運營商的財報反應不一，但這確實證實了用於構建AI基礎設施的資本支出不會減少。”\n\n下週即將發布財報的其他公司包括減肥藥生產商禮來 、芯片製造商AMD 及媒體巨頭士尼 。預計2026年，標普500指數成分股整體獲利將成長15%，這使得它們的財務前景成為人們仔細檢視的對象。\n\n“股市在很大程度上反映了推動股市上漲的正面基本面因素，而獲利成長是其中最重要的部分，”Vaidya指出。\n\n**就業市場穩定嗎？**\n\n下週的就業報告也將為華爾街提供一個審視經濟健康狀況的關鍵機會。路透的一項調查顯示，1月非農業就業報告預計將顯示新增7萬個就業崗位。\n\n去年底長達43天的政府停擺導致關鍵經濟報告延遲發布，資料蒐集目前正逐步恢復正常。備受關注的月度消費者物價指數（CPI）將於下下周公布，該指數是衡量通膨趨勢的重要指標。\n\nGlenmede 投資策略副總裁Michael Reynolds表示：“由於去年政府停擺，我們還沒有真正清楚地了解勞動力市場和通貨膨脹的狀況，因此我們認為這些因素可能比往常更加重要。”\n\n週三美聯儲會議後，市場目前預期美聯儲將在6月的會議之前不會進一步降息，儘管勞動力市場任何意外疲軟都可能動搖這些預期。\n\n“總的來說，經濟正處於良好的成長軌道上，我預計光是這一點就應該有助於為就業人數提供一些支撐，”Baird 說。(完)",
      "ContentLength": 1368,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 19:42:43"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YV0KJ:0/",
      "Date": "2026-01-30",
      "Time": "18:00:31",
      "Title": "《全球匯市》美聯儲新任主席人選提振美元",
      "Content": "美元周五回升，收復了本周部分跌幅。此前美國總統特朗普表示將很快宣布美聯儲主席提名人選，有報導稱 前美聯儲理事瓦爾許(Kevin Warsh)可能是最終人選。\n\n歐元兌美元 最新下跌0.3%至1.1932美元，英鎊兌美元 下跌0.4%至1.3765美元，美元兌日圓 則上漲0.5%至153.88日圓。\n\n美元指數因此上漲0.37%，報96.48。 \n\n特朗普表示，他計劃於周五公布接替美聯儲主席 鮑威爾（Jerome Powell）的人選。\n\n彭博報導稱瓦爾許將獲提名接替鮑威爾，而知情人士向路透透露他周四已在白宮與特朗普會面。\n\n三菱日聯金融集團全球市場歐洲、中東和非洲地區研究主管Derek Halpenny表示，美元上漲是\"可以理解的反應，因為這將確認下一任美聯儲主席不會是哈西特（Kevin Hassett）或 里德爾（Rick Rieder）\"。\n\n\"這兩位候選人曾先後被視為熱門人選，但市場普遍認為他們經驗不足且與特朗普總統關係過於密切，因而更易受其影響。\"\n\n他強調\" 瓦爾許的情況截然不同\"。\n\n在共和黨與民主黨議員敲定協議避免政府關門後，美元也獲得提振。\n\n海外衝突升級和嚴查境內移民引發的不安情緒重創美元，本周早些時候美元指數跌至四年低點。\n\n隨著伊朗局勢持續周四表示計劃與德黑蘭領導人對話與此同時美國又向中東派遣一艘軍艦，國防部長赫格塞思(Pete Hegseth)稱軍隊將隨時準備執行總統的任何決定。\n\n白宮同時宣布特朗普簽署行政令，對向古巴供應石油的國家加徵關稅，同時威脅對加拿大加徵新關稅，並表示美國將取消對加拿大生產的商用飛機的認證。 \n\n澳新銀行駐新加坡亞洲研究主管Khoon Goh表示：\"若瓦爾許獲任屬實，市場將視其為某種程度上能保持獨立性的人選，而非可能屈從于特朗普意願之人。\"\n\n他補充道：\"任何理性的市場參與者都不願帶著大額頭寸過周末。因此部分波動可能只是頭寸調整。若做空美元獲利，現在正是離場良機。\"\n\n儘管日圓日內走軟，但仍有望連續第二周上漲，此前日本政策制定者暗示可能與美國協調干預外匯市場以支撐日圓。\n\n上周，由於日本首相高市早苗及其對手在臨時大選中以減稅為競選綱領，市場對日本財政狀況的擔憂加劇，日圓跌至近18個月低點。\n\n美元兌避險貨幣瑞郎也走高，上漲0.5%至0.768瑞郎 \n\n澳元兌美元 下跌0.6%，報0.7008美元。\n\n加密貨幣方面，比特幣 暴跌2.2%至82,100美元，觸及11月21日以來最低點；以太幣 下跌3%至2,732.04美元。\n\n[表格內容]\n 紐約 當日 今年來 2025年 最新報價 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1918 1.1969 -0.43 +1.47 1.1745 美元/日圓 154.05 153.09 +0.63 -1.66 156.65 歐元/日圓 183.60 183.23 +0.20 -0.21 183.99 美元/瑞郎 0.7688 0.7640 +0.63 -2.97 0.7923 英鎊/美元 1.3748 1.3803 -0.40 +2.04 1.3473 美元/加元 1.3535 1.3489 +0.34 -1.38 1.3724 美元/離岸人民幣 6.9486 6.9443 +0.06 -0.39 6.9756 澳元/美元 0.6990 0.7046 -0.79 +4.77 0.6672 新西蘭元/美元 0.6044 0.6078 -0.56 +5.00 0.5756 歐元/瑞郎 0.9163 0.9146 +0.19 -1.56 0.9308 歐元/英鎊 0.8668 0.8667 +0.01 -0.54 0.8715 歐元/瑞典克朗 10.5405 10.5339 +0.06 -2.46 10.8061 美元/挪威克朗 9.5862 9.5290 +0.60 -4.70 10.0588 美元指數 96.605 96.283 +0.33 -1.75 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1857,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 18:42:44"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YV0QJ:0/",
      "Date": "2026-01-30",
      "Time": "17:13:32",
      "Title": "台灣匯市：台幣放量收貶連兩日下跌，新任美聯儲主席臆測令股匯市豬羊變色",
      "Content": "台幣兌美元 周五放量收貶，連兩日下跌。交易員指出，因美國總統特朗普可望提名前美聯儲理事瓦爾許出任美聯儲主席，此令國際美元反彈，加上外資大舉賣超台股匯出，台幣應聲貶破31.400重回先前整理區。\n\n他們表示，全球金融市場因新任美聯儲主席的臆測掀起波瀾，美元重拾漲勢，亞幣與亞洲股市也因市場認為瓦爾許立場偏鷹而轉為下跌，台幣跟進反映。 \n\n“外資大賣超啊，下午幾乎都在匯出。”一大型銀行交易員說。\n\n他指出，台幣一早先反映美元回穩略開低，隨著股市因新任美聯儲主席的臆測而擴大跌幅，台幣貶幅也逐漸增加，午後外資加大匯出力道，更讓台幣往31.500尋求支撐。\n\n該交易員稱，由於時逢月底，出口商也趁美元反彈而拋匯，但對於台幣幫助有限，終場幾乎以日低作收。下周由於逐漸臨近農曆春節，出口商對台幣的需求應該會高一些，有益于台幣持穩。 \n\n另一大型銀行交易員則稱，今日台股與台幣豬羊變色，外資大舉賣超並匯出使得台幣重回31.400-31.700的整理區間；後續走勢將視特朗普公布新任美聯儲主席後的金融市場表現而定。 \n\n台灣股市周五連兩日收低，回檔守穩10日均線，元月漲幅達10.7%。外資及陸資在台股轉為大幅賣超512.39億台幣，中止先前連三個交易日共買超702.14億台幣。\n\n在海外無本金交割遠期外匯市場(NDF)方面，目前指標一個月期美元/台幣換匯點 (TWDNDF=)折價幅度較上日尾盤略收斂；一個月美元/台幣遠匯 (TWD1MNDFOR=)報31.483/31.494，上日收在31.356。\n\n交易員預估，下周一台幣兌美元主要交易區間在31.400-31.500。\n\n[表格內容]\n16:00 台幣/美元報價 上日收盤 波動區間 開盤價 成交量(億美元) 上日成交量 (億美元) 台北外匯經紀公司 (TAIFX1) 31.468 31.327 31.350-31.478 31.360 18.66 14.01 元太外匯經紀公司 31.470 31.320 31.366-31.477 31.380 9.815 5.235 \n\n[表格內容]\n無本金交割遠期外匯(NDF) (TWDNDF=) 最新報價 上日現貨收盤時水準 美元/台幣一個月期 -0.055/-0.025 -0.060/-0.030 美元/台幣六個月期 -0.150/-0.120 -0.195/-0.165 \n（完）",
      "ContentLength": 991,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 17:42:50"
    },
    {
      "Source": "TradingView - Reuters Brief",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YV0IQ:0/",
      "Date": "2026-01-30",
      "Time": "17:08:16",
      "Title": "《路透晚報》--1月30日新聞摘要（國際版）",
      "Content": "以下為路透中文新聞為您整理的亞洲市場時段(上午7:00-下午5:00)新聞摘要：\n\n[重大數據或新聞]\n\n--特朗普稱周五公布美聯儲主席人選，此前會見前理事瓦爾許\n\n美國總統預計將於周五宣布美聯儲主席鮑威爾的繼任人選，在這前一天，特朗普在白宮會見了前美聯儲理事瓦爾許--這位美聯儲批評者曾表示，美國央行需要“體制改革”才能重獲喪失的公信力。特朗普周四在肯尼迪中心向記者表示，他將於次日早晨宣布人選，並稱新任主席\"本可在幾年前就上任...我認為這將是個非常好的選擇。希望如此。\"知情人士隨後向路透透露，55歲的瓦爾許已在白宮與特朗普會面。\n\n據彭博周四引述知情人士報導，特朗普政府準備提名瓦爾許擔任美聯儲主席。\n\n--中國有條件批準DeepSeek購買Nvidia的H200芯片--消息人士\n\n兩名知情人士告訴路透，中國已批準其頂尖人工智能(AI)初創公司DeepSeek（深度求索）購買Nvidia的H200 AI芯片，監管條件仍在最終敲定。路透周三援引消息人士的話報導稱，字節跳動、阿里巴巴和騰訊已獲準購買總計逾40萬個H200芯片。Nvidia首席執行官黃仁勳周四在台北告訴記者，公司尚未收到此類信息。他還補充說，他認為中國仍在敲定許可事宜。\n\n--美國財政部強化匯率監測標準，但未發現主要貿易夥伴操縱匯率\n\n美國財政部表示，正加強對各國匯率做法的審查，包括任何為阻止本幣兌美元貶值所作的努力，但並未指責任何主要貿易夥伴存在操縱匯率行為。在最新半年度匯率報告中，美國財政部稱，在2024年下半年至2025年上半年期間，沒有任何主要貿易夥伴同時滿足對其匯率做法進行強化分析的三項標準。\n\n美國財政部匯率報告罕見點名韓元匯率，稱近期貶值與經濟基本面不符 \n\n--特朗普警告英國勿與中國開展商業往來，同時敲打加拿大\n\n美國總統特朗普警告英國不要與中國開展商業往來，此前英國首相斯塔默（Keir Starmer）與中國國家主席習近平宣布重啟兩國關係。斯塔默強調英國無需在中美間選邊站隊。特朗普此前曾威脅，如果加拿大推進其領導人卡尼近期訪華期間與中國達成的經濟協議，美國將對加拿大加徵關稅。\n\n英國貿易大臣稱特朗普錯誤地認為加強與中國的關係是危險的 \n\n特朗普威脅對加拿大產飛機徵收50%關稅，直至加國認證灣流飛機 \n\n--數據顯示，日本東京1月核心消費者物價指數(CPI)同比上漲2.0%，較前月增速放緩，但符合央行目標。東京核心CPI剔除了波動較大的生鮮食品價格。該指數漲幅低於市場預期的2.2%，而12月漲幅為2.3%。數據還顯示，東京地區剔除生鮮食品和燃料成本的核心CPI在1月上漲2.4%，12月漲幅為2.6%。該指數被日本央行視為衡量需求拉動型通脹的重要指標。\n\n--彭博新聞援引知情人士消息報導稱，中國正考慮發行數千億元人民幣的專項債，用於向部分大型保險公司注資，以增強在行業整合壓力下的主要保險商實力。報導稱，此次發債將籌集約2,000億元人民幣（288億美元）用於向保險公司注資，所籌資金將注入中國人壽保險集團、中國人民保險集團和中國太平保險集團等國有控股企業。\n\n--蘋果警告內存成本攀升開始侵蝕獲利，因芯片商優先滿足AI需求\n\n--日本財務大臣片山皋月表示，首相高市早苗正在慎重評估暫停徵收消費稅對財政可持續性的影響，並正就此事與財務省商議。\n\n--巴拿馬最高法院周四深夜宣布，香港長和旗下巴拿馬子公司持有的關鍵港口合同因違憲而被撤銷，使巴拿馬運河沿線港口運營的前景變得不確定。\n\n--比特幣跌至兩個月低點，因市場猜測美聯儲下任主席可能收緊金融體系中的現金供應，從而打壓加密貨幣並推高美元。周五比特幣報82,300美元，下跌2.5%，延續前一交易日跌勢，正朝著連續第四個月下跌邁進，這將是八年來最長的連跌周期。\n\n--德國聯邦統計局表示，去年12月德國進口物價同比下降2.3%。路透調查的分析師此前預測降幅為2.6%。\n\n--澳洲央行2月3日料將把指標利率上調25個基點至3.85%，此前12月通脹數據高於預期，促使路透調查的多數經濟學家改變利率將按兵不動的預測。\n\n--路透調查顯示，在銅價飆升至歷史高位後，分析師首次將2026年銅價的共識預測上調至11,000美元以上，但他們對過度投機保持警惕，預計平均價格將遠低於峰值。\n\n--美國總統特朗普周四表示支持由參議院共和黨人與民主黨人談成的一項支出協議，該協議將避免政府停擺，同時議員們繼續就限制移民執法人員的措施進行磋商。\n\n--美國總統特朗普周四以稅務部門向媒體披露其2019年和2020年稅務申報資料為由，向美國國稅局(IRS)和財政部提起訴訟，索賠100億美元。\n\n--歐盟成員國外長同意將伊朗伊斯蘭革命衛隊列入歐盟的恐怖組織名單，將其與“伊斯蘭國”和“基地”組織歸為一類，標誌著歐洲對伊朗領導層態度出現了有象徵意義的轉變。\n\n--瑞士海關公布的數據顯示，該國12月黃金出口量環比增長27%，其中對英國的出口量躍升至2019年8月以來的最高水平。\n\n[市場摘要]\n\n--日本股市：日經指數因科技股拋售而略收低，連續第二個周線下跌\n\n日本日經指數周五收跌，連續第二周錄得周線跌幅，因投資者拋售科技類權重股以了結獲利。日經指數在震盪交投中下跌0.1%，收於53,322.85點。該指數盤中最高上漲0.4%，最低下跌0.85%。該指數本周下跌1.75%，但本月累計上漲4.6%。更廣泛的東證股價指數上漲0.59%，收於3,566.32點，但本周下跌1.7%。\n\n--中港股市：滬綜指收低1%本月仍錄得近4%漲幅，恆指挫2.1%但月線上揚終結連三月跌勢\n\n在有色板塊暴跌的拖累下，中國股市滬綜指周五盤中一度急瀉2.2%，最終收低1%。開年首月則依然錄得近4%漲幅，為去年8月以來最大月度漲幅。滬綜指盤中急挫2.2%，最終收跌1%，至4,117.95點，本月仍然累升3.8%，錄得去年8月以來最大月度漲幅。滬深300指數收低1%，本月累升1.7%。香港恆生指數收跌2.1%，至27387.11點，本月累升6.9%。恆生科技指數收低2.1%，本月累升3.7%。\n\n--匯市：美元上漲受美聯儲潛在新任主席人選影響；比特幣重挫\n\n美元回升，收複本周部分跌幅。此前美國總統特朗普表示將很快宣布美聯儲主席提名人選，同時市場對華盛頓避免政府停擺的樂觀情緒升溫。08:47GMT，美元指數上漲0.32%，報96.47。歐元兌美元下跌0.34%，報1.1932；美元兌日圓上漲0.51%，報153.88；英鎊兌美元下跌0.4%，報1.3765。\n\n--歐元債市：德國兩年期公債收益率料錄得周線跌幅，等待通脹數據公布\n\n德國兩年期公債收益率本周料將錄得自去年10月以來的最大周線跌幅，因投資者押注，歐洲央行在制定政策展望時將把歐元走強帶來的通縮壓力納入考量。投資者還在等待周五稍晚公布的德國各州1月通脹數據。對政策利率預期更為敏感的德國兩年期公債收益率上漲0.5個基點至2.06%，本周累計跌幅達6.5個基點，創10月以來最大周線跌幅。德國10年期國債收益率上漲1.5個基點至2.87%。\n\n--國際油市：油價下跌但月線料大漲，美國可能就伊朗核計劃與其對話\n\n油價下跌，因有跡象表明美國可能就伊朗核計劃與其展開對話，緩解了市場對美國打擊可能導致原油供應中斷的擔憂。不過，由於緊張局勢升級，油價本月預計仍將大幅上漲。08:47GMT，布蘭特原油下跌0.85%，報每桶70.13美元。西德克薩斯中質油(WTI)下跌1.24%，報每桶64.64美元。\n\n--全球金市：金價下跌逾5%，但仍有望實現1980年以來最大月度漲幅\n\n金價下跌逾5%，因有傳言稱美聯儲可能迎來立場較為鷹派的主席；但金價仍有望創下1980年來最強勁的月度漲幅，因地緣政治和經濟緊張局勢依舊，投資者湧向避險資產。截至08:47GMT，現貨金下跌5.3%，報每盎司5,103.89美元。美國期金下跌4.52%，報每盎司5,077.80美元。\n\n--金屬期市：銅價因獲利了結脫離紀錄高位，但月線仍有望上漲\n\n銅價回落，抹去前一交易日投機熱潮中的漲幅，因投資者進行獲利了結，但銅價仍有望實現月度上漲。上海期貨交易所主力期銅合約午盤收跌2.82%，報每噸103,680元（合14,919.70美元），較歷史高點114,160元回落，但1月仍累計上漲近4%。倫敦金屬交易所(LME)三個月期銅下跌2.78%，報每噸13,278.50美元，較歷史高點14,527.50美元回落。但倫銅本周仍有望收漲近7%。\n\n注：其他重要財經新聞瀏覽請點選；近日《路透晚報》請點選。(完)",
      "ContentLength": 3536,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 17:42:46"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YV0DU:0/",
      "Date": "2026-01-30",
      "Time": "15:17:56",
      "Title": "《全球匯市》美元上漲受美聯儲潛在新任主席人選影響；比特幣重挫",
      "Content": "美元周五回升，收複本周部分跌幅。此前美國總統特朗普表示將很快宣布美國聯邦儲備理事會(美聯儲/FED)主席提名人選，同時市場對華盛頓避免政府停擺的樂觀情緒升溫。\n\n特朗普表示，計劃周五公布接替美聯儲主席鮑威爾的人選，此前有消息稱前美聯儲理事瓦爾許(Kevin Warsh)造訪白宮。日圓下跌，加密貨幣價格重挫。\n\n美元因此收複本周部分跌幅；此前特朗普與古巴、伊朗、委內瑞拉、格陵蘭及歐洲的緊張關係，打擊部分投資者對美國資產的信心。\n\n澳新銀行駐新加坡亞洲研究主管Khoon Goh表示：\"若瓦爾許獲任屬實，市場將視其為某種程度上能保持獨立性的人選，而非可能屈從于特朗普意願之人。\"\n\n他補充道：\"任何理性的市場參與者都不願帶著大額頭寸過周末。因此部分波動可能只是頭寸調整。若做空美元獲利，現在正是離場良機。\"\n\n衡量美元兌一籃子貨幣的美元指數 上漲0.4%至96.55，將周線跌幅收窄至0.9%。\n\n歐元 下跌0.4%至1.1922美元，日圓兌美元 貶值0.5%至153.85。英鎊 下滑0.4%至1.3751美元。\n\n彭博新聞報導稱，瓦爾許將獲提名接替鮑威爾擔任美聯儲主席，而知情人士向路透透露他周四已在白宮與特朗普會面。\n\n在共和黨與民主黨議員敲定協議避免政府關門後，美元也獲得提振。\n\n海外衝突升級和嚴查境內移民引發的不安情緒重創美元，本周早些時候美元指數跌至四年低點。\n\n隔夜，白宮宣布特朗普簽署行政命令，對向古巴供應石油的國家加徵關稅，同時威脅對加拿大加徵新關稅，並表示美國將取消對加拿大生產的商用飛機的認證。\n\n隨著伊朗局勢持續周四表示計劃與德黑蘭領導人對話與此同時美國又向中東派遣一艘軍艦，國防部長赫格塞思(Pete Hegseth)稱軍隊將隨時準備執行總統的任何決定。\n\n上周美元收盤創去年四月以來最大跌幅，部分原因是特朗普政府威脅對阻撓其購買格陵蘭計劃的歐洲國家加徵關稅。\n\n西太平洋銀行集團高級經濟學家Mantas Vanagas指出，格陵蘭爭端引發更廣泛的地緣政治擔憂，導致美元全面走低。\n\n他補充道：\"問題在於'拋售美國'的交易模式捲土重來，投資者正質疑美國作為其他經濟體合作夥伴的可靠程度。\"\n\n美聯儲周三維持利率不變後，美元獲得一定支撐。美聯儲主席鮑威爾稱美國經濟穩健，通脹和就業風險均有所緩解。\n\n日圓兌美元匯率重返154關口上方，但仍有望實現連續第二周上漲，因日本政策制定者暗示可能與美國協調干預外匯市場以支撐日圓。\n\n上周，由於日本首相高市早苗及其對手在臨時大選中以減稅為競選綱領，市場對日本財政狀況的擔憂加劇，日圓跌至近18個月低點。\n\n澳元 下跌0.7%至0.6997美元，新西蘭元 下跌0.5%至0.6046美元。\n\n加密貨幣方面，比特幣 重挫2.2%至82,519.22美元，觸及11月21日以來最低點；以太幣 下跌3%至2,732.04美元。\n\n[表格內容]\n 最新報價 紐約 當日 今年來 2025年 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1914 1.1969 -0.46 +1.44 1.1745 美元/日圓 153.9700 153.09 +0.57 -1.71 156.65 歐元/日圓 183.45 183.23 +0.12 -0.29 183.99 美元/瑞郎 0.7685 0.7640 +0.60 -2.99 0.7923 英鎊/美元 1.3740 1.3803 -0.45 +1.99 1.3473 美元/加元 1.3527 1.3489 +0.28 -1.44 1.3724 美元/離岸人民幣 6.9473 6.9443 +0.04 -0.41 6.9756 澳元/美元 0.6982 0.7046 -0.89 +4.66 0.6672 新西蘭元/美元 0.6038 0.6078 -0.66 +4.90 0.5756 澳元/日圓 107.490 108.190 -0.65 +2.82 104.540 新西蘭元/日圓 93.010 93.070 -0.06 +2.56 90.690 英鎊/日圓 211.51 211.39 +0.06 +0.23 211.02 澳元/新西蘭元 1.1562 1.1592 -0.26 -0.20 1.1585 美元指數 96.626 96.283 +0.36 -1.72 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1997,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 15:42:48"
    },
    {
      "Source": "TradingView - Reuters Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YV0JB:0/",
      "Date": "2026-01-30",
      "Time": "15:00:28",
      "Title": "台灣債市：指標10年債殖利率連兩日收平，農曆年關前後新債變數左右行情",
      "Content": "台灣指標10年公債115/3期 (A15103=TWO)周五發行前交易殖利率連兩日持平作收。交易員指出，目前美債暫難提供進一步指引，115/3期連兩日殖利率持穩在1.42%，交投觀望該券下周四標售結果。\n\n他們認為，因應市場補券需求仍在，目前市場普遍預估115/3期下周不致於標高，而因農曆年關前後皆受新債標售變數干擾，除了年關前的115/3期標售外，新春開市首日也要立馬標售五年新券115/1R期 (A15101R=TWO)，預計農曆年關前後的標售結果將左右台債走勢。\n\n“農曆年後那周更忙，然後3月就都沒事。”一位民營銀行交易員說；並點出農曆年新春開市當周將標售兩期公債--五年券115/1R期及20年券115/4期 (A15104=TWO)，農曆年關前後充滿新債標售變數。\n\n他也稱，由於補券需求仍在，預期10年新券應該也標不高，應該差不多在近日的成交利率附近。 \n\n亦有位大型銀行交易員指出，暫時覺得115/3期得標利率就落在1.4-1.42%，“畢竟利率高了，就有人想拿，所以不會標太高。” \n\n台灣央行將於下周四代財政部標售10年券115/3期，金額暫定350億台幣，並預計在2月10日發行。而因應農曆春節，台灣股債市將於2月11日封關，休市到2月23日重新開市。\n\n交易員預估，下周一的五年增額公債115/1R期殖利率交易區間在1.31-1.33%，而10年債115/3期殖利率交易區間則在1.41-1.43%。 \n\n[表格內容]\n 收盤價 漲跌幅 報價 區間 成交值 年期 期別 (基點) (億台幣) 10 115/3 (A15103=TWO) 0.0 1.42% 1.42-1.42% 0.5 \n 今日電子盤各期指標券收盤情形：\n\n[表格內容]\n 30 114/11 (A14111=TWO) 沒有成交 20 115/4 (A15104=TWO) 沒有成交 10 115/3 (A15103=TWO) 1.42% 5 115/1 (A15101=TWO) 沒有成交 2 115/2 (A15102=TWO) 沒有成交 \n（完）",
      "ContentLength": 872,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 15:42:44"
    },
    {
      "Source": "TradingView - Reuters Stocks",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YV0EB:0/",
      "Date": "2026-01-30",
      "Time": "14:17:29",
      "Title": "台灣股市：連兩日收低守穩10日均線，受美聯儲新主席臆測打擊",
      "Content": "台灣股市周五連兩日收低，回檔守穩10日均線，元月漲幅達10.7%。分析師稱，美國總統特朗普可望提名前美聯儲理事瓦爾許出任美聯儲主席，市場臆測其立場“不夠鴿”，此令風險資產承壓，大盤同時面臨春節長假前調節賣壓而下跌。\n\n台灣加權指數 TWSE:TAIEX收低1.45%至32,063.75點，10日均線在32,027.93點；今日成交初值 (.TTOV.TW)為9,071.11億台幣，上日修正後為9,596.52億，創下歷史天量。\n\n“跌下去就是有人在接，32,000點附近的10日均線應該有守。”統一期貨投顧部分析師盧昱衡說。\n\n他表示，特朗普可望提名瓦爾許出任美聯儲主席，外界視其為能保持獨立性的人選，立場可能不夠鴿派，此令全球金融市場波動，美元轉強、台幣走貶，外資可能會轉為賣超，台股又因為有春節封關前的調節賣壓，使得指數兩天已跌掉接近1,000點。\n\n盧昱衡認為，雖然大盤連兩日拉回，但仍視其為短線急漲後的乖離修正。下周台股最好是能夠維持高檔震盪，以盤代跌，否則短線多頭型態一旦破壞，拉回修正的幅度恐加大。\n\n富達投資指出，不論下一任美聯儲主席人選為何，偏寬鬆且容忍較高通膨風險的政策立場，發生機率都相當高，因此仍維持股票加碼的建議。 \n\n分析師預估，下周一台股指數區間在31,500-32,500點。（完） \n\n[表格內容]\n**查閱相關新聞或頁面，請點選下列代碼連結**** 美國股市 一周展望 歐洲股市報導 日本股市報導 中港股市報導 中國股市報導 台灣股市報導 股市簡訊 納斯達克最活躍個股 (.AV.O) 紐約證交所最活躍個股 (.AV.N) 納斯達克漲幅居前個股 (.PG.O) 紐約證交所漲幅居前個股 (.PG.N) 納斯達克跌幅居前個股 (.PL.O) 紐約證交所跌幅居前個股 (.PL.N) 標普主要分類指數 (0#.GSPMAJOR) 英股富時指數 CURRENCYCOM:UK100 德股DAX指數 法股CAC-40指數 韓國股市已並入韓國金融市場報導中，相關稿件請點選",
      "ContentLength": 850,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 14:42:44"
    },
    {
      "Source": "TradingView - Reuters Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YV0C6:0/",
      "Date": "2026-01-30",
      "Time": "10:57:18",
      "Title": "台灣債市：指標10年公債早盤殖利率持平，觀望115/3期下周標售結果",
      "Content": "台灣指標10年公債115/3期 (A15103=TWO)周五早盤發行前交易殖利率持平。交易員指出，115/3期連兩日殖利率持穩在1.42%，交投仍觀望該券下周四標售結果。\n\n“10年券應該也標不高，補券需求還是在。”一位大型民營銀行交易員說。\n\n另位大型銀行交易員也稱，暫時覺得115/3期得標利率就落在1.4-1.42%，“畢竟利率高了，就有人想拿，所以不會太高。” \n\n台灣央行將於下周四代財政部標售10年券115/3期，金額暫定350億台幣，並預計在2月10日發行。而因應農曆春節，台灣股債市將於2月11日封關，休市到2月23日重新開市。\n\n本地時間10:50，10年券115/3期發行前交易殖利率報1.42%，成交0.5億台幣，五年券115/1R期 (A15101R=TWO)電子盤暫無成交；台股 TWSE:TAIEX則跌1.23%。 \n\n交易員預估，今日五年債115/1R期殖利率交易區間在1.30-1.34%；10年債115/3期殖利率區間則在1.40-1.43%。（完）\n\n最新相關報導鏈接：\n\n--美國債市：公債收益率下跌，美聯儲會議後投資者關注非農就業數據",
      "ContentLength": 487,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 11:42:43"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YV095:0/",
      "Date": "2026-01-30",
      "Time": "10:22:07",
      "Title": "台灣匯市：台幣早盤走貶，因美元反彈台股下跌但出口商趁機拋匯",
      "Content": "台幣兌美元 周五早盤走貶。交易員表示，因國際美元自低位反彈，且台股跌幅擴大拖累了台幣表現。\n\n他們稱，美股期貨盤下跌拖累台股走勢，外資料轉為賣超並匯出，此外，黃金等貴金屬回落有利於國際美元止跌反彈。不過在台幣回測31.400時見到出口商的拋匯。 \n\n“股市迅速回落，看來外資也在砍(股票)。”一銀行交易員說。\n\n其指出，美元反彈給了出口商于月末逢高拋匯的機會，此令台幣在31.400獲得支撐。盤中將持續關注台股跌勢能否止住或進一步擴大。 \n\n本地時間10:12，台幣兌美元貶6.1分報31.388，交易區間在31.350-31.409；台股 TWSE:TAIEX則跌1.31%報32,111.52點。\n\n在海外無本金交割遠期外匯市場(NDF)方面，目前指標一個月期美元/台幣換匯點 (TWDNDF=)自折價轉為微幅溢價；一個月美元/台幣遠匯 (TWD1MNDFOR=)報31.440/31.460，上日收在31.356。\n\n交易員預估，今日台幣兌美元匯率主要交易區間在31.350-31.450。（完）\n\n最新相關報導鏈接：\n\n--《全球匯市》美元料錄得周線下跌，全球緊張局勢加劇削弱美國資產需求",
      "ContentLength": 498,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 10:42:42"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YV01X:0/",
      "Date": "2026-01-30",
      "Time": "09:26:04",
      "Title": "《全球匯市》美元料錄得周線下跌，全球緊張局勢加劇削弱美國資產需求",
      "Content": "美元周五可能連續第二周錄得周線下跌，因美國威脅對與古巴有貿易往來的國家徵收關稅，加劇了全球緊張局勢，削弱了市場對美國資產的需求。\n\n白宮表示，特朗普總統簽署行政命令，將對向古巴供應石油的國家加徵關稅，這為近期涉及伊朗、委內瑞拉、格陵蘭和歐洲的地緣政治緊張局勢再添壓力。\n\n有關特朗普考慮對伊朗採取軍事打擊的報導推高油價，並拖累美元指數。\n\n美國國內方面，參議院達成的一項協議將避免政府部分停擺，帶來一絲希望曙光。日本數據顯示東京通脹放緩，但符合央行目標。\n\n西太平洋銀行高級經濟學家Mantas Vanagas在報告中指出：“隨著特朗普揚言對伊朗採取軍事行動，美元指數繼續走低。\"\n\n美元指數 微升0.2%至96.35，本周累計跌幅收窄至1.1%。\n\n歐元 下跌0.2%至1.194美元。日圓 下跌0.17%至1美元兌153.39日圓。英鎊 下跌0.1%至1.3791美元。\n\n多名消息人士稱，特朗普正在權衡針對伊朗的多種選項，包括對安全部隊及領導人實施定點打擊以鼓舞抗議者。特朗普將部署在該地區的艦船稱為駛向伊朗的\"艦隊\"。\n\n受美國對格陵蘭政策引發擔憂影響，美元上周錄得去年4月以來的最大單周跌幅。\n\n在美聯儲周三維持利率不變後，美元獲得一定支撐。美聯儲主席鮑威爾表示，美國經濟穩健，通脹與就業面臨的風險有所減弱。\n\n美元下跌為疲軟的日圓帶來喘息空間。受美國和日本上周疑似進行匯率詢價的傳言影響--這一行為通常被視為干預前兆，日圓本周大部分時間在152至154的區間內波動。\n\n數據顯示，日本東京1月核心消費者物價指數(CPI)同比上漲2.0%，較前月增速放緩，但符合央行目標。\n\n澳元兌美元 下跌0.2%，報0.7033美元；新西蘭元兌美元 下跌0.2%，報0.6066美元。\n\n加密貨幣方面，比特幣 下跌0.1%至84,309.27美元，以太幣 下跌0.3%至2,808.19美元。\n\n[表格內容]\n 最新報價 紐約 當日 今年來 2025年 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1926 1.1969 -0.36 +1.54 1.1745 美元/日圓 153.6700 153.09 +0.38 -1.90 156.65 歐元/日圓 183.31 183.23 +0.04 -0.37 183.99 美元/瑞郎 0.7675 0.7640 +0.46 -3.13 0.7923 英鎊/美元 1.3764 1.3803 -0.28 +2.16 1.3473 美元/加元 1.3520 1.3489 +0.23 -1.49 1.3724 美元/離岸人民幣 6.9494 6.9443 +0.07 -0.38 6.9756 澳元/美元 0.7015 0.7046 -0.44 +5.14 0.6672 新西蘭元/美元 0.6051 0.6078 -0.44 +5.13 0.5756 澳元/日圓 107.750 108.190 -0.41 +3.07 104.540 新西蘭元/日圓 93.070 93.070 0.00 +2.62 90.690 英鎊/日圓 211.58 211.39 +0.09 +0.27 211.02 澳元/新西蘭元 1.1585 1.1592 -0.06 0.00 1.1585 美元指數 96.506 96.283 +0.23 -1.85 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1598,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 09:42:49"
    },
    {
      "Source": "TradingView - Reuters Brief",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YU1DW:0/",
      "Date": "2026-01-30",
      "Time": "07:25:43",
      "Title": "《路透早報》--1月30日",
      "Content": "一周全球重要經濟數據和事件預告：\n\n簡體： https://tmsnrt.rs/4jYZqjJ \n\n繁體： https://tmsnrt.rs/49PWJMv\n\n以下為1月29日下午5:00至1月30日早上7:00的重大新聞與市場摘要：\n\n--美防長稱五角大樓準備執行特朗普對伊朗的任何決定\n\n美國國防部長赫格塞斯周四表示，美國軍方將做好準備，執行特朗普總統對伊朗做出的任何決定，以確保德黑蘭不會尋求發展核武器能力。美國官員表示，特朗普正在評估各種方案，但尚未決定是否對伊朗發動打擊。\n\n* 一位要求匿名的美國官員對路透表示，美國海軍已向中東地區再派遣“布萊克”號驅逐艦。隨著這艘軍艦抵達，中東地區的美國驅逐艦數量增至六艘。\n\n* 沙特和以色列官員前往華盛頓，討論可能對伊朗發動攻擊--Axios \n\n* 歐盟外交及安全政策高級代表卡拉斯周四回應有關特朗普正考慮對伊朗實施定點打擊的報導時表示，該地區不需要新的戰爭。\n\n--中英關係喜迎重啟，止跌回升邁向“更成熟”階段\n\n英國首相斯塔默與中國國家主席習近平周四承諾在貿易、投資和技術領域加強合作，英國和中國對兩國關係重啟表示歡迎。他在訪華期間呼籲建立“更成熟的關係”，包括改善市場準入、降低關稅並推動投資協議。這是北京八年來首次接待英國首相。中方同意為英國公民提供30天免簽入境待遇，並將中國對威士忌的關稅削減一半。與此同時，英國製藥商阿斯利康宣布將在中國投資150億美元。斯塔默與習近平舉行正式峰會並共進午餐，耗時約三個小時，雙方討論了貿易、安全、烏克蘭戰爭，也談到了足球和莎士比亞。 \n\n--中國總理：中英要深化金融、人工智能等新興產業合作，做大雙邊貿易\"新增量\"\n\n中國總理李強周四會見英國首相斯塔默，共同出席中英企業家委員會會議閉幕式。李強表示，愿同英國完善政府間對話合作機制，更加經常性地開展各層級各領域交往。雙方要發揮互補優勢，推動雙邊貿易擴容提質，深化金融、人工智能、先進製造、清潔能源、數字經濟、現代航運服務等新興產業合作，相互賦能更好發展。\n\n--中國商務部部長王文濤會見英國商貿大臣凱爾，王文濤稱，中國愿與英國加強經貿政策對話，深化雙方在服務貿易、雙向投資、金融、數字經濟等領域合作，擴大自英進口優質產品和服務。\n\n--美國財政部強化匯率監測標準，但未發現主要貿易夥伴操縱匯率\n\n美國財政部表示，正加強對各國匯率做法的審查，包括任何為阻止本幣兌美元貶值所作的努力，但並未指責任何主要貿易夥伴存在操縱匯率行為。財政部將泰國加入需密切關注的“觀察名單”，因該國全球經常帳戶盈餘及其對美貿易順差擴大。觀察名單擴大至10個經濟體，中國、日本、韓國、台灣、新加坡、越南、德國、愛爾蘭和瑞士繼續留在名單上。\n\n--特朗普計劃下周宣布下任美聯儲主席人選，重申利率仍過高\n\n特朗普表示，他計劃下周宣布接替美聯儲主席鮑威爾的人選，這將結束數周以來關於誰將在鮑威爾任期於2026年5月結束後領導美聯儲的臆測。特朗普再次批評美聯儲，稱利率應該下調兩、三個百分點。[nL6T3YU161\n\n* 他說美國的利率本應比全球所有國家都低。其他國家之所以只需支付低利率，完全是因為美國。\n\n--移民執法爭端致撥款議案參院受阻，美國停擺風險上升\n\n美國參議院民主黨人阻止了一項為政府大量機構提供資金的立法。該撥款議案需在周五截止日期前通過。民主黨人正與美國總統特朗普談判，試圖限制激進的移民執法策略。若雙方無法達成協議，政府從周六起可能陷入部分停擺。但雙方消息人士稱，他們正取得進展，努力避免這一結果。特朗普在白宮表示，其政府將以兩黨合作方式避免停擺。\n\n--美國上周初請失業金人數下降；貿易逆差擴大幅度創近34年最大\n\n美國上周初請失業金人數較此前一周上修後的水平有所下降，暗示裁員規模依然較低，但疲軟的招聘態勢正在加劇家庭對勞動力市場的擔憂。美國勞工部公布，截至1月24日當周，初請失業金人數經季節性調整後減少1,000人，降至20.9萬人。另外，美國商務部經濟分析局和統計局的報告顯示，11月貿易逆差擴大94.6%至568億美元，增幅為1992年3月以來最大。不過，11月美國對華貿易逆差縮小至139.42億美元，10月逆差為149.37億美元。 \n\n* 美國11月工廠訂單在商用飛機需求飆升的帶動下反彈，不過第四季度企業在設備方面的支出增速可能有所放緩。美國商務部統計局表示，工廠訂單11月增長2.7%，10月數據經上修為下降1.2%，前值為下降1.3%。\n\n--克里姆林宮：俄羅斯已邀請烏克蘭總統澤連斯基前往莫斯科舉行和談\n\n克里姆林宮表示，俄羅斯已重申邀請烏克蘭總統澤連斯基前往莫斯科舉行和平會談。目前，在美國主導下結束這場已持續近四年的烏克蘭戰爭的努力正在加速。國際文傳電訊社（Interfax）周四引述克里姆林宮發言人佩斯科夫的話稱，莫斯科尚未收到澤連斯基對邀請的回應。澤連斯基去年拒絕了類似邀請，他當時建議普京來基輔。\n\n* 特朗普稱，普京同意因嚴寒在一周內不向基輔開火 \n\n* 俄羅斯外長：俄方不知美國與烏克蘭達成的安全保證具體內容 \n\n--加拿大總理卡尼：期望美國政府尊重加拿大主權\n\n英國《金融時報》報導稱，美國國務院官員曾與阿爾伯塔繁榮計劃組織(Alberta Prosperity Project/APP)舉行三次會議。該組織正推動就這個能源大省是否應脫離加拿大舉行全民公投。\n\n加拿大總理卡尼被問及相關報導時表示，他期望美國政府尊重加拿大主權。他補充稱，特朗普從未向他提及阿爾伯塔省獨立的問題。阿爾伯塔省省長Danielle Smith表示，她希望繼續留在加拿大，但指出民調顯示，30%的民眾已對他們眼中的渥太華過度干預感到厭倦。\n\n--加拿大央行總裁麥克勒姆告訴路透，鑒於地緣政治風險上升和美國貿易政策走向，經濟面臨新衝擊的風險異常突出。麥克勒姆表示，阻礙加拿大實現央行經濟預測的因素比往常更多，包括特朗普對格陵蘭島的威脅、抓捕委內瑞拉領導人的行動、以及一再威脅對加拿大加徵關稅等。 \n\n--瑞銀將2026年3月、6月和9月的黃金價格目標上調至每盎司6,200美元，此前的預測為5,000美元，理由是投資增加帶動的需求強於預期。不過該行預計，在2026年美國中期選舉後，金價將小幅回落至每盎司5,900美元。\n\n--國際貨幣基金組織(IMF)警告稱，儘管面臨貿易干擾和地緣政治不確定性，新興市場經濟體仍展現出韌性，但這種支撐可能難以為繼，應利用該窗口期重建緩衝、拓寬增長來源。IMF警告稱，經濟增長正變得日益狹窄，活動集中於少數幾個領域，尤其是科技和人工智能領域，這增加了風險。\n\n--南非央行周四將指標貸款利率維持在6.75%不變，稱希望看到通脹預期進一步回落，並指出包括電價在內的潛在價格壓力。央行並維持今年及明年的經濟增長預測不變，2026年料增長1.4%，2027年將增長1.9%。\n\n--中國央行披露，2025年第四季度全國新發放商業性個人住房貸款加權平均利率為3.06%。央行官網公告顯示，去年三季度該利率為3.07%。據此計算，去年四季度全國新發放商業性個人住房貸款加權平均利率環比下降了1BP（基點）。\n\n--台灣金管會稱，壽險會計匯率新制配套措施已研擬完成，將於明天與業者溝通，預計盡快在農曆年前公布，將與壽險會計匯率新制齊回溯至元月實施。至於市場關注的壽險CS(換匯)避險部位將會采分階段辦理，對匯市影響有限。\n\n--在商品消費趨於飽和之際，努力擴大服務消費成為中國提振消費的重點。中國國務院辦公廳日前印發文件，鼓勵網絡視聽服務、入境消費、演出服務和體育賽事等服務消費發展。\n\n--中國外交部邊海司司長侯艷琪周四同菲律賓外交部副部長艾雷拉-林、部長助理兼亞太司司長阿爾費雷斯，在菲律賓宿務舉行雙邊會見。央視新聞報導稱，雙方就涉海等共同關心的問題坦誠深入交換意見，同意繼續通過外交渠道保持溝通。\n\n--彭博新聞報導稱，美國私人直接投資公司黑石集團即將達成一項協議，使其成為香港新世界發展的最大股東。新世界發展不予置評。 \n\n--彭博新聞周四援引知情人士報導，馬斯克旗下的SpaceX正考慮與特斯拉進行合併的可能性，同時也在探討與人工智能公司xAI進行另一種形式的整合。\n\n[市場摘要]\n\n股市： \n\n--標普500指數和納斯達克指數周四雙雙收跌，因最新企業財報令投資者感到不安，同時他們還擔憂科技巨頭在人工智能領域的巨額投入能否獲得回報。儘管這兩個股指尾盤收復部分失地，但科技板塊疲軟仍拖累整體走勢。微軟成為拖累標普500指數的最大因素。這家軟件巨頭的雲業務營收表現欠佳，引發市場對其在OpenAI的巨額投入恐不會很快帶來回報的擔憂，這導致其股價暴跌10%。道瓊斯工業指數在尾盤勉強收漲，上漲55.96點或0.11%，報49,071.56點。標普500指數收盤雖然遠離盤中低點，但仍下跌9.02點或0.13%，報6,969.01點。納斯達克指數在最後半小時縮窄跌幅，最終下跌172.33點，跌幅0.72%，收於23,685.12點。\n\n--歐洲指標股指收低，回吐早盤漲幅，因德國SAP和微軟的業績未能令投資者滿意，導致科技股遭拋售。泛歐STOXX 600指數下跌0.2%至607.14點，科技板塊下挫2.8%，創2025年4月以來最大單日跌幅。德國DAX指數表現遜於其他地區股指，收跌2%，SAP大跌16%。英國富時100指數收高0.17%；法國CAC-40指數幾近持平。\n\n匯市：\n\n--美元兌日圓和歐元下滑，但仍高於近期觸及的多年低點。儘管美聯儲釋放出略偏鷹派的信號為美元提供了一定支撐，但投資者對美國政策前景仍心存疑慮。美元兌日圓下跌0.2%至153.055日圓，歐元上漲0.5%至1.196美元。加元兌美元上漲0.4%。主要加密貨幣比特幣下跌6%，至83,563美元。\n\n債市：\n\n--美國公債收益率下跌，在下周公布非農就業報告前，投資者保持觀望態度。該報告預計將為勞動力市場動能以及2026年可能的降息節奏提供更清晰的信號。尾盤時，指標10年期美國公債收益率下跌1.2個基點至4.235%，30年期收益率持平於4.856%。兩年期收益率下跌2個基點，至3.561%。\n\n--歐元區公債收益率小跌，因市場持續擔憂歐元走強可能促使歐洲央行較目前預計的更早放寬貨幣政策。德國10年期公債收益率跌2.5個基點，報2.824%；兩年期德債收益率跌至一周低點，下跌2個基點，報2.06%。\n\n油市：\n\n--油價攀升，因市場擔憂若美國襲擊伊朗這個石油輸出國組織(OPEC)最大原油生產國之一，可能影響全球供應。布蘭特原油期貨上漲2.31美元，漲幅3.4%，收於每桶70.71美元，創7月31日以來新高；美國原油期貨上漲2.21美元，漲幅3.5%，收於每桶65.42美元，創9月26日以來新高。\n\n金屬：\n\n--金價微跌，投資者在創下歷史新高後獲利了結，但受經濟和地緣政治不確定性加劇影響，金價仍有望創下1980年代以來最佳月度表現。現貨金收報每盎司5,394.88美元，跌幅不到0.1%，盤中一度觸及5,594.82美元的歷史高位。美國2月期金收報5,318.40美元，跌幅0.3%。\n\n--銅價一度飆升至每噸14,000美元以上的歷史新高，因投機者在強勁需求預期、美元疲軟及地緣政治擔憂的推動下持續買入。倫敦金屬交易所指標三個月期銅一度飆升11%，觸及每噸14,527.50美元的歷史峰值，隨後在1700 GMT回調至13,612.50美元，漲幅收窄至4%。\n\n[今日看點]\n\n重要經濟數據(GMT時間)：\n\n--法國第四季GDP初值(0630)\n\n--德國12月進口物價(0700)、1月失業率(0855)、第四季GDP初值(0900)和1月CPI初值(1300)\n\n--台灣第四季GDP概估值(0800)\n\n--香港12月M3貨幣供應量(0830)\n\n--英國12月消費者信貸(0930)\n\n--歐元區第四季GDP首次估值和12月失業率(1000)\n\n--美國12月最終需求PPI(1330)\n\n--加拿大11月GDP(1330)\n\n重大經濟事件及官員講話(GMT時間)：\n\n--英國首相訪問中國(至1月31日)\n\n--日本防衛大臣小泉進次郎會見韓國國防部長官安圭伯\n\n--歐洲央行銀監會委員馬查多發表主題演講(0800)\n\n--歐洲央行銀監會主席布赫發表講話(1730)\n\n--聖路易斯聯儲總裁穆薩萊姆就美國經濟和貨幣政策發表講話(1830)\n\n--美聯儲金融監管副主席鮑曼就貨幣政策監管問題發表講話(2200)\n\n注：其他重要財經新聞瀏覽請點選；近日《路透早報》請點選。(完)",
      "ContentLength": 5184,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 07:42:47"
    },
    {
      "Source": "TradingView - Reuters Stocks",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YU1FM:0/",
      "Date": "2026-01-30",
      "Time": "07:01:30",
      "Title": "美國股市：標普500指數與納指收跌，科技巨頭AI投入激增引發市場擔憂",
      "Content": "標普500指數和納斯達克指數周四雙雙收跌，因最新企業財報令投資者感到不安，同時他們還擔憂科技巨頭在人工智能領域的巨額投入能否獲得回報。\n\n儘管這兩個股指尾盤收復部分失地，但科技板塊疲軟仍拖累整體走勢。微軟 成為拖累標普500指數的最大因素。這家軟件巨頭的雲業務營收表現欠佳，引發市場對其在OpenAI的巨額投入恐不會很快帶來回報的擔憂，這導致其股價暴跌10%。\n\n其他軟件股同樣受重挫，思愛普(SAP) 美國上市股票因謹慎的雲業務展望而暴跌15%，ServiceNow 股價也因財報加劇市場悲觀情緒而大跌9.9%。\n\n新澤西州普林斯頓市Paleo Leon公司董事總經理John Praveen表示：“微軟令人失望，市場確實存在擔憂，擔心人工智能投資將侵蝕軟件企業的利潤。”\n\nPraveen指出，在當前多重不確定性交織的背景下，投資者正試圖“降低股票敞口求穩\"，這些不確定因素包括美聯儲下任主席人選、未來降息次數、華盛頓在伊朗和格陵蘭問題上的政治不確定性，以及美國政府可能停擺的風險。他形容當前環境“烏雲密布”。\n\n道瓊斯工業指數 在尾盤勉強收漲，上漲55.96點或0.11%，報49,071.56點。標普500指數 收盤雖然遠離盤中低點，但仍下跌9.02點或0.13%，報6,969.01點。納斯達克指數 在最後半小時縮窄跌幅，最終下跌172.33點，跌幅0.72%，收於23,685.12點。\n\n軟件公司遭遇拋售潮，Salesforce 下跌6%，甲骨文(Oracle) 下跌2.2%，Adobe 下跌2.6%，雲安全公司Datadog 暴跌8.8%。\n\n紐約Infrastructure Capital Advisors首席執行官兼首席投資官Jay Hatfield指出，對於ServiceNow和Salesforce等軟件公司而言，人們擔心若人工智能可能取代其部分服務，他們的業務可能會受到一定程度的影響。“現實如何其實並不重要。目前這些公司的股票已經遭受了重創，”他補充道。\n\n蘋果 收盤漲0.72%，該公司在盤後公布財報顯示，季度營收超出預期，得益於中國市場的強勁反彈，公司首席執行官庫克向路透表示，最新款iPhone的需求\"驚人\"。\n\n其他大型股方面，電動汽車製造商特斯拉 股價下跌3.5%，此前該公司宣布計劃將資本支出增加一倍以上至紀錄高位。\n\n在標普500指數的11大主要板塊中，科技板塊 跌幅最大，下跌1.9%。\n\n通信服務板塊 則上漲2.9%，表現最為強勁，其中Facebook母公司Meta 大漲10.4%。這家社交媒體巨頭不僅給出了樂觀的營收預期，還宣布將今年的資本支出預算大幅提高73%。\n\n其他利好消息方面，IBM 股價上漲5%，此前其公布第四季獲利超出預期。\n\n其他值得關注的財報方面，卡特彼勒 股價上漲3.4%，該公司公布利潤增長。國防承包商洛克希德·馬丁公司股價大漲4%，此前該公司預測2026年獲利將超出華爾街預期。西南航空 股價飆升18.7%，成為標普500指數中百分比漲幅最大的個股，此前該公司預測全年利潤將超出預期。\n\n紐約證交所漲跌家數之比為1.19:1。有611只股票創新高，176只創出新低。 納斯達克市場有2,067只股票上漲，2,746只下跌，下跌股與上漲股家數之比達1.33:1。標普500指數有51只成分股創52周新高，有20只創52周新低。 \n\n美國交易所成交量達233.6億股，遠超20日均值188.3億股。\n\n[表格內容]\n****查閱相關新聞或頁面，請點選下列代碼連結**** 美國股市 一周展望 歐洲股市報導 日本股市報導 中港股市報導 中國股市報導 台灣股市報導 股市簡訊 納斯達克最活躍個股 (.AV.O) 紐約證交所最活躍個股 (.AV.N) 納斯達克漲幅居前個股 (.PG.O) 紐約證交所漲幅居前個股 (.PG.N) 納斯達克跌幅居前個股 (.PL.O) 紐約證交所跌幅居前個股 (.PL.N) 標普主要分類指數 (0#.GSPMAJOR) 英股富時指數 CURRENCYCOM:UK100 德股DAX指數 法股CAC-40指數 韓國股市已並入韓國金融市場報導中，相關稿件請點選",
      "ContentLength": 1729,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 07:42:51"
    },
    {
      "Source": "TradingView - Reuters Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YU1DU:0/",
      "Date": "2026-01-30",
      "Time": "06:38:58",
      "Title": "美國債市：公債收益率下跌，美聯儲會議後投資者關注非農就業數據",
      "Content": "美國公債收益率周四下跌，投資者在下周月度就業報告公布前保持觀望態度。該報告預計將為勞動力市場動能以及 2026 年可能的降息節奏提供更清晰的信號。\n\n市場參與者也預計，美國將就對聯邦移民執法人員實施新限制達成一致，從而可能避免本周末政府關門。\n\n下午尾盤時，指標10年期美國公債收益率 (US10YT=TWEB) 下跌1.2個基點至4.235%，30年期公債收益率 (US30YT=TWEB) 持平於4.856%。\n\n儘管美聯儲周三維持利率不變的決定對整體公債市場影響有限，但美聯儲主席鮑威爾對近期經濟形勢持樂觀態度，並表示美聯儲今年仍有進一步降息的可能，這取決於後續經濟數據的表現。\n\n通常與利率預期同步波動的兩年期美國公債收益率 (US2YT=TWEB) 下跌2個基點，至3.561%。\n\n投資者還押注，美國參議院有望達成一項協議，將國土安全部的撥款法案從涵蓋軍費、醫療項目和其他聯邦機構的更廣泛支出法案中剝離出來。這些機構包括勞工部和勞工統計局（BLS）。\n\n此舉意味著勞工統計局將於下周五如期發布1月就業報告，預計勞工統計局還將公布此前就業數據的修訂。\n\n猶他州帕克城Mischler Financial Group的董事總經理Tom di Galoma指出，臨近月底也有望支撐債市表現直至周五。“我預計在最後幾天，股市資金會有部分轉向固定收益市場。”\n\n**收益率曲線趨陡**\n\n收益率曲線早盤趨陡，但收盤時與周三持平。兩年期與10年期美債收益率利差 (US2US10=TWEB)盤中一度觸及 68.4 個基點，隨後回落至 67 個基點，與周三尾盤持平。\n\n分析師表示，美元本周跌至多年低點，加上大宗商品價格大幅上漲，推動收益率曲線在過去幾周趨陡。他們補充稱，這些因素可能在未來數月繼續支撐曲線進一步趨陡。\n\nBMO Capital Markets的美國利率策略師Vail Hartman 表示：“我們預計兩年期與10年期收益率利差在短期內將在60至70個基點之間，但今年晚些時候曲線可能進一步變陡。”\n\n有關美國可能對伊朗發動軍事打擊的猜測推動油價升至六個月高點，銅價則在周四創下歷史新高。\n\n市場同時密切關注美聯儲主席繼任者被提名人的公布。投資者正審視候選人以評估其維護美聯儲獨立性的意願。\n\n 周四美國財政部標售440億美元七年期公債，標售結果表現平淡。該債券中標收益率為4.018%，略高於投標截止時的預期收益率，表明需求疲軟。據BMO數據顯示，該收益率也高於過去六次標售的平均水平3.912%。(完)\n\n[表格內容]\n****查閱相關新聞或頁面，請點選下列代碼連結**** 美國現貨公債 美國指標公債報價 (0#USBMK=) 英國公債市場 歐元區公債市場 日本公債市場 中國債市 台灣債市 歐元區指標公債報價 (0#EUBMK=) 利率或央行相關報導",
      "ContentLength": 1186,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 06:42:53"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YU19T:0/",
      "Date": "2026-01-30",
      "Time": "04:07:39",
      "Title": "《全球匯市》美元承壓，投資者對美國政策仍感到不安",
      "Content": "美元兌日圓和歐元周四下滑，但仍高於近期觸及的多年低點。儘管美聯儲釋放出略偏鷹派的信號為美元提供了一定支撐，但投資者對美國政策前景仍心存疑慮。\n\n美元近期承壓，原因包括市場預期美聯儲將繼續降息、關稅前景不確定以及美國政策波動。美元上周錄得去年4月以來最大單周跌幅，因部分投資者擔憂美國對格陵蘭的政策。\n\n“目前美國出台的貿易與地緣政治政策令投資者感到擔憂，這些因素可能對美元不利，”豐業銀行(Scotiabank)首席外匯策略師Shaun Osborne表示。\n\n美元兌日圓下跌0.2%至153.055日圓，歐元上漲0.5%至1.196美元。\n\n美聯儲周三維持利率不變。美聯儲主席鮑威爾表示，美國經濟穩健，通脹和就業風險有所緩解，這為美元提供了一些支撐。\n\n周四公布的數據顯示，美國上周初請失業金人數小幅下降，但仍與相對較低的裁員水平相符，儘管招聘疲軟加劇了家庭對勞動力市場的焦慮。\n\n美國總統特朗普周四表示，美國目前的利率水平本應“低得多”，應擁有全球最低利率。\n\n不過，一些分析師預計美聯儲不會很快降息。\n\n“儘管前景仍不確定，尤其是未來幾個月將任命新的美聯儲主席，但我們的基線預測是降息周期已經結束，隨著就業改善，下一步可能是升息，最早可能在2026年第四季度，”麥格理集團(Macquarie Group)經濟研究主管David Doyle表示。\n\n本周稍早，美元承壓，此前特朗普周二在被問及美元是否跌得過多時稱，美元價值 \"很好\"，。最新評論令市場更加不安。美國財長貝森特隨後重申美國奉行強勢美元，略微緩和了市場壓力，但投資者仍擔心美元進一步下跌。\n\n“白宮和財政部在美元問題上的信息有些矛盾……這無法增強市場信心，”Osborne表示。\n\n儘管美元周四走勢顯示出在本周早些時候大幅下滑後的企穩跡象，但投資者對其短期前景仍保持謹慎。\n\n“短線動能已大幅轉向對美元不利，而我們原本預期會支撐美元的長期力量並未及時發揮作用，”渣打銀行G10外匯研究主管兼北美宏觀策略負責人Steven Englander在一份報告中表示。\n\n**歐元重新成為歐洲央行關注焦點**\n\n歐元最近升破關鍵的1.20美元關口，引發歐洲央行官員關注，他們警告貨幣快速升值可能產生通縮效應。\n\n“雖然去年歐元/美元遠高於歐洲央行的基本情境且未觸發嚴重通縮風險，但貿易不確定性仍然存在，”紐約梅隆銀行(BNY)EMEA宏觀策略師Geoff Yu稱。\n\n經濟學家指出，歐元走強可能放大中國出口帶來的通縮效應，使歐洲央行從當前的“良好狀態”被迫轉向進一步降息。\n\n歐洲央行執委施納貝爾(Isabel Schnabel)周三重申，當前貨幣政策處於“良好狀態”，利率預計將在較長時間維持不變，而金融市場預計將至少穩至2027年初。\n\n**日本財政政策仍受關注**\n\n美元下滑為疲弱的日圓 帶來一些喘息空間。\n\n日圓兌美元本周多數時間維持在152至154日圓區間內，因市場傳言上周美國和日本可能進行了匯率檢查，這一舉動通常被視為干預前兆。\n\n高盛在一份報告中表示，日本財務省與美國財政部可能採取協同行動，這應能在短期內限制日圓進一步走軟的壓力，但警告稱，只有在日本央行加快收緊貨幣政策或財政緊縮等有利於通脹回落的基本面因素支持下，這種影響才能持續。\n\n加元兌美元周四上漲0.4%，此前一天加拿大央行如預期將政策利率維持在2.25%不變。\n\n在風險資產遭拋售之際，主要加密貨幣比特幣 周四下跌6%，至83,563美元。(完)",
      "ContentLength": 1443,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 04:42:45"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YU0WS:0/",
      "Date": "2026-01-29",
      "Time": "17:15:24",
      "Title": "台灣匯市：台幣微幅收貶中止連五升，因韓元、人民幣走弱但外資仍匯入",
      "Content": "台幣兌美元 周四微幅收貶，中止連五日上揚走勢。交易員指出，美國財政部長貝森特談話讓美元稍獲喘息，且午後韓元與人民幣小幅走弱，牽動台幣跟隨收貶。\n\n他們表示，今日台股雖然震盪收低且成交爆出天量，不過外資還是持續匯入並買超，加上出口商臨近月底有拋匯壓力，均讓台幣在盤中得以微幅走升。 \n\n“出口商有拋匯壓力，畢竟月底近了。”一大型銀行交易員說。\n\n他指出，由於美元仍疲弱，盤中見到包括油款在內的進口商積極承接，此外也有不少民眾發揮螞蟻雄兵精神買進美元。\n\n另一大型銀行交易員則稱，外資連三日買超台股達702.14億台幣，因此今日持續匯入，不過午後人民幣與韓元表現偏弱，使得台幣也跟進收低。\n\n其認為，今日台股爆量收低，整體呈現內資拋、外資接的結構，接下來仍要觀察大盤能否重拾漲勢，若欲振乏力也會令外資轉向賣股匯出。 \n\n台灣股市周四收低，成交量則創下歷史新高，並中止連五日上揚走勢。外資及陸資在台股買超146.59億台幣，連三個交易日共買超702.14億台幣。\n\n在海外無本金交割遠期外匯市場(NDF)方面，目前指標一個月期美元/台幣換匯點 (TWDNDF=)折價幅度較上日尾盤收斂；一個月美元/台幣遠匯 (TWD1MNDFOR=)報31.310/31.340，上日收在31.226。\n\n交易員預估，明日台幣兌美元主要交易區間在31.250-31.350。\n\n[表格內容]\n16:00 台幣/美元報價 上日收盤 波動區間 開盤價 成交量(億美元) 上日成交量 (億美元) 台北外匯經紀公司 (TAIFX1) 31.327 31.320 31.270-31.329 31.300 14.01 15.22 元太外匯經紀公司 31.320 31.318 31.270-31.329 31.270 5.235 7.29 \n\n[表格內容]\n無本金交割遠期外匯(NDF) (TWDNDF=) 最新報價 上日現貨收盤時水準 美元/台幣一個月期 -0.060/-0.030 -0.095/-0.065 美元/台幣六個月期 -0.195/-0.165 -0.225/-0.195 \n（完）",
      "ContentLength": 883,
      "HasTables": false,
      "ScrapedAt": "2026-01-29 18:43:07"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YU0MA:0/",
      "Date": "2026-01-29",
      "Time": "17:09:21",
      "Title": "《全球匯市》美元位於多年低點附近，投資者認為風險不斷累積",
      "Content": "美元周四依然疲弱不穩，白宮和歐洲官員發表的支持性言論，僅部分抵消了圍繞美國經濟政策與地緣政治動向的不確定性。 \n\n在貨幣政策方面，美聯儲隔夜對美國勞動力市場和通脹風險持更樂觀態度，投資者據此認為利率可能會在較長時間內維持不變。 (0#USDIRPR)\n\n美元本周早些時候大幅下挫，並觸及四年低位，此前美國總統特朗普似乎對美元走弱未予理會。不過在美國財長貝森特次日表示華盛頓奉行強勢美元政策後，美元才獲得支撐。\n\n美聯儲主席鮑威爾暗示在進一步降息前將保持較長時間的觀望，部分經濟學家認為美國經濟目前尚無必要實施額外寬鬆政策。\n\n麥格理集團首席經濟學家David Doyle表示：\"儘管前景仍存不確定性--尤其考慮到數月後新的美聯儲主席上任--但我們的基本預期仍是降息周期已結束，因就業市場改善在即。\"\n\n\"我們預計下次政策調整將是加息，可能發生在2026年四季度。\"\n\n歐元兌美元 在美元下跌推動下突破關鍵的1.20關口，但回落至1.1980美元，此前歐洲央行決策者同樣對歐元快速升值表示日益擔憂。 \n\n周四美元拋壓有所緩解，但美元兌主要貨幣仍處於弱勢。\n\n美元兌瑞郎 下跌0.33%至0.766，逼近11年低點；英鎊 接近四年半高位，報1.3844美元。\n\n澳元 創下三年高位0.70495美元，受澳洲最早可能在下周加息的預期推動。澳元最新上漲0.45%至0.7073。 \n\n本周早些時候美元的拋售是自去年4月特朗普關稅行動震動市場以來最劇烈的一次。美元今年迄今已下跌2%。 \n\n澳洲國民銀行的Attrill表示，美元表現將關鍵取決於圍繞美聯儲獨立性的相關問題如何發展，包括美國最高法院對特朗普試圖解雇美聯儲理事庫克的裁決。\n\n\"喪失獨立性無疑是美元霸權持續面臨的最大風險，\"他強調。\n\n美元指數 報96.06，徘徊在周二觸及的四年低點95.566附近。\n\n美元的走弱給疲軟的日圓 帶來喘息空間，周四日圓兌美元上漲0.13%，至153.23日圓。 \n\n新西蘭元 逼近七個月高點0.60925美元。人民幣兌美元 維持在32個月高位附近，持穩在6.9471。\n\n[表格內容]\n 紐約 當日 今年來 2025年 最新報價 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1971 1.1952 +0.16 +1.92 1.1745 美元/日圓 153.28 153.40 -0.08 -2.15 156.65 歐元/日圓 183.50 183.37 +0.07 -0.27 183.99 美元/瑞郎 0.7664 0.7682 -0.23 -3.27 0.7923 英鎊/美元 1.3821 1.3805 +0.12 +2.58 1.3473 美元/加元 1.3527 1.3555 -0.21 -1.44 1.3724 美元/離岸人民幣 6.9412 6.9428 -0.02 -0.49 6.9756 澳元/美元 0.7062 0.7040 +0.31 +5.85 0.6672 新西蘭元/美元 0.6066 0.6059 +0.12 +5.39 0.5756 歐元/瑞郎 0.9175 0.9183 -0.09 -1.43 0.9308 歐元/英鎊 0.8659 0.8655 +0.05 -0.64 0.8715 歐元/瑞典克朗 10.5859 10.5572 +0.27 -2.04 10.8061 美元/挪威克朗 9.5793 9.5896 -0.11 -4.77 10.0588 美元指數 96.213 96.446 -0.24 -2.14 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1681,
      "HasTables": false,
      "ScrapedAt": "2026-01-29 18:43:11"
    },
    {
      "Source": "TradingView - Reuters Brief",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YU0IF:0/",
      "Date": "2026-01-29",
      "Time": "16:58:35",
      "Title": "《路透晚報》--1月29日新聞摘要（國際版）",
      "Content": "以下為路透中文新聞為您整理的亞洲市場時段(上午7:00-下午5:00)新聞摘要：\n\n[重大數據或新聞]\n\n--斯塔默：英中在關稅、免簽及移民問題上取得良好進展\n\n英國首相斯塔默表示，他與中國國家主席習近平在周四的會晤中在關稅、旅行及小船非法移民等問題上取得了良好進展，使兩國關係處於一個\"穩固狀態\"。斯塔默在與習近平舉行80分鐘會晤後于北京對記者表示：“我們在威士忌關稅、赴華免簽，以及在應對非正規移民方面的信息交流合作上都取得了相當不錯的進展。”雙方討論了威士忌關稅的下調幅度及時間表，並在更廣泛的安全與防務戰略框架下，討論了用於非法移民進入英國的小船的相關信息。\n\n--2025年全球黃金需求創歷史新高--世界黃金協會\n\n世界黃金協會(WGC)表示，2025年全球黃金需求增長1%，達到5,002噸，創紀錄新高。在動盪和貿易不穩定引發焦慮情緒、推動投資需求激增之際，儘管金價接連創下歷史新高令金飾買家卻步，全球黃金需求去年仍創下歷史新高。\n\n* 2025年中國黃金需求總量創四年最高水平，今年投資或持續穩健態勢 \n\n* 印度黃金需求將於2026年下滑，珠寶需求萎縮抵消投資需求增長 \n\n--韓國產業通商資源部長官抵達華盛頓，就關稅警告展開磋商--韓聯社\n\n據韓聯社報導，韓國產業通商資源部長官金正官周四抵達華盛頓，表示將與美國商務部長盧特尼克會晤，就韓美貿易協定“延遲”問題闡明首爾立場。金正官表示，他計劃“明確說明韓國政府對美合作與投資的承諾沒有任何改變”。\n\n--德國總理默茨：美國不應質疑與歐盟的貿易協議\n\n德國總理默茨表示，只要華盛頓履行其承諾，歐盟與美國之間貿易協議的批準基礎就已具備。默茨表示，在特朗普撤回對歐盟輸美商品的新關稅威脅，並似乎與北約就格陵蘭問題達成協議後，2025年貿易協議的落實基礎已具備。默茨補充稱，歐盟與美國仍需就鋁和鋼達成最終協議。\n\n默茨對美元急劇貶值表示擔憂。此前美元已跌至四年低點。“一段時間以來，我一直以關切的態度關注美元匯率走勢，”默茨與執政聯盟夥伴在柏林舉行會議前在新聞發布會上表示：“美元走勢給德國出口經濟帶來相當大的額外負擔。”\n\n--新加坡維持貨幣政策不變，強調經濟增長強勁\n\n新加坡金管局維持貨幣政策設置不變，並指出通脹和需求存在上行風險，因經濟前景依然強勁。金管局表示，將維持坡元名義有效匯率(NEER)的現行升值幅度。匯率政策區間的寬度及中點水平均維持不變。“當前經濟增長與通脹前景的風險偏向上行，”金管局表示。“不過，也存在一些下行風險，反映出全球經濟潛在的脆弱性。”\n\n--韓國國民年金公團(NPS)理事長金成柱表示，該機構一直在應對匯率波動，並將繼續採取行動，以幫助穩定韓元匯率。\n\n--特朗普考慮對伊朗發動打擊以增強抗議者信心--消息人士\n\n多位消息人士稱，美國總統特朗普正考慮對伊朗採取包括針對安全部隊和領導人實施定點打擊在內的多種選項，以激勵抗議者。但以色列和阿拉伯官員表示，僅靠空中力量無法推翻伊朗的神職統治者。\n\n--格陵蘭和丹麥領導人與馬克龍會晤，稱需加強格陵蘭的安全保障\n\n格陵蘭總理與丹麥首相弗雷澤里克森在巴黎會晤了法國總統馬克龍，旨在爭取各方支持，以應對美國總統特朗普試圖接管格陵蘭島的行動。\n\n* 歐盟能源執委約根森：格陵蘭危機為歐洲能源安全敲響警鐘\n\n--越南與歐盟宣布提升兩國外交關係級別。雙方致力於在全球動盪時期拓展國際夥伴關係。\n\n--澳新銀行公布調查顯示，新西蘭企業信心在1月出現下滑，不過多數經濟活動指標的強勁勢頭基本得以維持。\n\n--挪威2.2萬億美元的主權財富基金公布的數據顯示，該基金在2025年下半年繼續增持美國公債，延續了長期趨勢。\n\n--印尼金融監管機構表示，將把上市公司自由流通股數比例規定提高一倍至15%，作為回應MSCI(明晟)對該國股市透明度疑慮的舉措之一。此前MSCI的疑慮引發本周印尼股市的大規模拋售。\n\n--印度政府預測，從4月開始的新財年，印度經濟增長率將在6.8%至7.2%之間。\n\n--一名印度官員表示，根據該國與歐盟的新貿易協議，印度將立即將高端歐洲汽車的關稅從高達110%大幅調降至30%，向寶馬(BMW)和奔馳等豪華汽車製造商開放受到高度控制的車市。\n\n--獨家：白宮將與銀行及加密貨幣企業高管會晤，推動立法妥協\n\n據三名行業消息人士透露，白宮將於周一與銀行業和加密貨幣行業的高管舉行會談，討論一項具有里程碑意義的加密貨幣立法的推進路徑。該法案因這兩大強勢行業之間的分歧而陷入停滯。\n\n--歐盟執委會副主席東布洛夫斯基表示，歐盟需要迅速推出數字歐元，以降低對占主導地位的美國支付公司的依賴。\n\n--獨家：美國政府逐漸放棄關鍵礦產保底價格計劃--消息人士\n\n多位消息人士向路透透露，特朗普政府正逐漸放棄為美國關鍵礦產項目設定最低價格保障的計劃，實際上承認此計劃缺乏國會資助及制定市場定價複雜性問題。\n\n--據《紐約時報》援引知情人士說法報導，美國總統特朗普與參議院少數黨領袖舒默周三晚間力圖達成協議，將就對聯邦移民官員實施新限制展開協商，此舉或可避免政府停擺。\n\n--美國總統特朗普推出由政府支持的嬰兒投資賬戶計劃，並敦促美國企業為員工家庭賬戶提供資金。\n\n--美國眾議院中國特別委員會主席穆勒納爾正嚴密檢視福特汽車的計劃，該公司擬將其現有美國電池製造工廠改造為生產磷酸鐵鋰電池及電網級儲能系統的基地，此為其與中國電池巨頭寧德時代合作計劃的一部分。\n\n--獨家：兩位知情消息人士向路透表示，美國煉油商 Citgo Petroleum 自 2019 年與其母公司、委內瑞拉國家石油公司(PDVSA)斷絕關係以來，首次購買了委內瑞拉原油。\n\n--Nvidia(輝達/英偉達)首席執行官黃仁勳表示，希望中國允許Nvidia在當地銷售其強大的H200人工智能芯片，目前相關許可正在最終敲定中。 \n\nThe Information報導稱，Nvidia(輝達/英偉達)、亞馬遜和微軟正在洽談向OpenAI投資至多600億美元。\n\n--特斯拉宣布，將向首席執行官馬斯克（Elon Musk）的人工智能公司xAI投資20億美元，並表示Cybercab無人駕駛出租車的生產計劃正按計劃推進，將於今年投產。\n\n--韓國三星電子預測，受人工智能熱潮推動，今年芯片短缺局面將進一步加劇。強勁的內存需求雖利好其核心芯片業務，卻給智能手機和顯示器等其他業務帶來不利因素。\n\n--IBM公布第四季營收和獲利超出華爾街預期，人工智能(AI)的快速普及推動對該公司軟件服務的需求，從海量數據管理到IT流程自動化等等，涵蓋範圍廣泛。IBM股價在盤後上漲近9%。\n\n[市場摘要]\n\n--日本股市：愛德萬測試領漲下收升，防務類股因選舉民調走高\n\n日本股市周四上漲，權重股芯片測試設備製造商愛德萬測試(Advantest)領漲，而防務類股則受益於媒體民調顯示保守派首相高市早苗所屬政黨可能在下月選舉中贏得多數席位。東證股價指數(Topix)上漲0.3%至3,545.30點，扭轉了早盤0.8%的跌幅。科技股占比較高的日經指數收平盤，報53,375.60點，扳回了早盤0.7%的跌幅。\n\n--中港股市：滬綜指收高地產白酒股暴漲，恆指七連收升續創四年半新高\n\n中國股市滬綜指收高，官媒稱房地產“三道紅線”政策終結引發地產和消費板塊飆升，白酒指數創下單日最大漲幅，半導體板塊則逆市下挫。滬綜指收升0.2%，至4,157.98點，滬深300指數收漲0.8%。香港恆生指數收升0.5%，至27,968.09點，續創2021年7月16日以來新高；恆生科技指數收低1%。\n\n--匯市：美元仍遭冷落，投資者認為風險不斷累積\n\n美元依然疲弱不穩，白宮和歐洲官員發表的支持性言論，僅部分抵消了圍繞美國經濟政策與地緣政治動向的不確定性。在貨幣政策方面，美聯儲隔夜對美國勞動力市場和通脹風險持更樂觀態度，投資者據此認為利率可能會在較長時間內維持不變。截至0819GMT，美元指數上漲0.01%，報96.16。歐元兌美元上漲0.17%，報1.1974；美元兌日圓下跌0.13%，報153.23。\n\n--歐元債市：公債收益率持平，歐洲央行對歐元漲勢表達關切\n\n歐元區公債收益率持平，因強勢歐元疑慮揮之不去，市場擔心這可能促使歐洲央行降息，在此同時美國聯邦儲備理事會(美聯儲/FED)上日維持利率不變。德國10年期公債收益率最新報2.86%，變動不大。歐元區短天期公債收益率回落，其中德國兩年期公債收益率一度創一周新低，最新則是持平於2.07%。\n\n--國際油市：油價上漲逾1%，市場擔憂伊朗可能遭到軍事打擊\n\n周四油價上漲超過1%，連續第三日上漲，因市場日益擔憂美國可能對中東主要產油國伊朗發動軍事打擊，這可能導致該地區石油供應中斷。截至0819GMT，布蘭特原油上漲1.35%，報每桶69.32美元。西德克薩斯中質油(WTI)上漲1.47%，報每桶64.14美元。\n\n--全球金市：黃金因避險需求逼近5,600美元，白銀一度突破120美元\n\n金價持續攀升，位於略低於每盎司5,600美元的水平，地緣政治與經濟憂慮加劇，投資者紛紛湧向避險資產，白銀則一度躍升至120美元上方。截至0819GMT，現貨金上漲2.35%，報每盎司5,526.10美元。美國期金上漲4.06%，報每盎司5,518.80美元。\n\n--金屬期市：銅價勁升逾6%創新高，地緣政治風險與美元疲軟助推\n\n銅價觸及歷史新高。金屬市場整體上漲，得益於地緣政治風險和美元疲軟背景下投資者對實物資產的追捧。上海期貨交易所最活躍銅合約日盤收盤大漲6.71%，報每噸109,110元（合15,708.77美元），盤中一度飆升8.53%觸及每噸110,970元歷史高點。截至0819GMT，倫敦金屬交易所(LME)指標三個月期銅上漲6.49%，報每噸13,936.00美元。盤中曾飆升7.94%觸及14,125美元的歷史峰值。\n\n注：其他重要財經新聞瀏覽請點選；近日《路透晚報》請點選。(完)",
      "ContentLength": 4106,
      "HasTables": false,
      "ScrapedAt": "2026-01-29 18:42:47"
    },
    {
      "Source": "TradingView - Reuters Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YU0PF:0/",
      "Date": "2026-01-29",
      "Time": "14:49:57",
      "Title": "台灣債市：10年指標債殖利率收在平盤，美聯儲利率前景指引未形成漣漪",
      "Content": "台灣指標10年公債115/3期 (A15103=TWO)周四發行前交易殖利率以平盤作收。交易員表示，昨晚美聯儲給出的指引與市場預期大致相同，此令台債交投缺乏明確走向。\n\n他們指出，除115/3在電子盤的交易外，今日冷券市場的交投也清淡，交易商在農曆年封關前的關注焦點，只能投射在下周四的115/3標售。 \n\n“（美聯儲主席）鮑威爾的會後聲明與市場預期差不多，所以連美債也沒什麼方向。”一位民營銀行交易員說。 \n\n美聯儲周三維持利率不變，主席鮑威爾稱經濟增長前景明顯改善，通脹和就業風險均有所降低，這一判斷暗示沒有進一步降低借貸成本的緊迫性。\n\n另位大型銀行交易員則稱，115/3成交在1.42%應該算目前的合理水準，前幾天的九年冷券也差不多成交在1.40%；隨著美聯儲政策變數暫時解除，台灣因經濟前景仍算樂觀，對央行降息預期可能還要往後退，所以利率再低就沒人想接了。 \n\n台灣央行將於下周四代財政部標售10年券115/3期，金額暫定350億台幣，並預計在2月10日發行。而因應農曆春節，台灣股債市將於2月11日封關，休市到2月23日重新開市。\n\n交易員預估，明日五年增額公債115/1R期 (A15101R=TWO)殖利率交易區間在1.31-1.34%，而10年債115/3期殖利率交易區間則在1.41-1.43%。 \n\n[表格內容]\n 收盤價 漲跌幅 報價 區間 成交值 年期 期別 (基點) (億台幣) 10 115/3 (A15103=TWO) 0.0 1.42% 1.42-1.42% 3.0 \n 今日電子盤各期指標券收盤情形：\n\n[表格內容]\n 30 114/11 (A14111=TWO) 沒有成交 20 115/4 (A15104=TWO) 沒有成交 10 115/3 (A15103=TWO) 1.42% 5 115/1 (A15101=TWO) 沒有成交 2 115/2 (A15102=TWO) 沒有成交 \n（完）",
      "ContentLength": 817,
      "HasTables": false,
      "ScrapedAt": "2026-01-29 18:42:57"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YU0DF:0/",
      "Date": "2026-01-29",
      "Time": "14:29:48",
      "Title": "《全球匯市》美元仍遭冷落，投資者認為風險不斷累積",
      "Content": "美元周四依然疲弱不穩，白宮和歐洲官員發表的支持性言論，僅部分抵消了圍繞美國經濟政策與地緣政治動向的不確定性。 \n\n在貨幣政策方面，美聯儲隔夜對美國勞動力市場和通脹風險持更樂觀態度，投資者據此認為利率可能會在較長時間內維持不變。 (0#USDIRPR)\n\n美元本周早些時候大幅下挫，並觸及四年低位，此前美國總統特朗普似乎對美元走弱未予理會。不過在美國財長貝森特次日表示華盛頓奉行強勢美元政策後，美元才獲得支撐。\n\n歐元兌美元 在美元下跌推動下突破關鍵的1.20關口，但亞洲時段回落至1.1988美元，此前歐洲央行決策者同樣對歐元快速升值表示日益擔憂。\n\n澳洲國民銀行外匯策略主管Ray Attrill表示：“貝森特的評論相當及時--如果你願意的話，可以認為這是預先安排的。”\n\n他說：“我認為歐洲央行的評論是獨立的，但有趣的是，歐元/美元在1.20附近似乎確實觸發了一些反應。”\n\n“你可以認為……歐元/美元近期的升勢雖然並不算大，但某種程度上掩蓋了歐元整體走強的趨勢，而這將會影響歐洲央行的通脹預測。”\n\n儘管周四大規模美元拋售有所緩解，但美元仍處於守勢。\n\n美元兌瑞郎 下跌0.43%至0.7654，逼近11年低點；英鎊 接近四年半高位，報1.3844美元。\n\n澳元 創下三年高位0.70495美元，受澳洲最早可能在下周加息的預期推動。澳元最新上漲0.72%至0.7092。 \n\n本周早些時候美元的拋售是自去年4月特朗普關稅行動震動市場以來最劇烈的一次。\n\n美元今年迄今已下跌2%。 \n\n澳洲國民銀行的Attrill表示，美元表現將關鍵取決於圍繞美聯儲獨立性的相關問題如何發展，包括美國最高法院對特朗普試圖解雇美聯儲理事庫克的裁決。\n\n\"喪失獨立性無疑是美元霸權持續面臨的最大風險，\"他強調。\n\n美元指數報 報96.06，徘徊在周二觸及的四年低點95.566附近。\n\n美元的走弱給疲軟的日圓 帶來喘息空間，周四日圓兌美元上漲0.25%，至153.00日圓。\n\n由於上周美國和日本傳出匯率詢價的消息--這種舉動通常被視為干預的前兆，本周大部分時間里，日圓兌美元一直在152-154日圓區間徘徊。\n\n新西蘭元 接近七個月高點0.60695美元。人民幣兌美元 位於32個月高點附近，持穩在6.9471。\n\n[表格內容]\n 最新報價 紐約 當日 今年來 2025年 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1981 1.1952 +0.24 +2.01 1.1745 美元/日圓 153.0400 153.40 -0.23 -2.30 156.65 歐元/日圓 183.39 183.37 +0.01 -0.33 183.99 美元/瑞郎 0.7656 0.7682 -0.34 -3.37 0.7923 英鎊/美元 1.3835 1.3805 +0.22 +2.69 1.3473 美元/加元 1.3523 1.3555 -0.24 -1.46 1.3724 美元/離岸人民幣 6.9436 6.9428 +0.01 -0.46 6.9756 澳元/美元 0.7087 0.7040 +0.67 +6.22 0.6672 新西蘭元/美元 0.6087 0.6059 +0.46 +5.75 0.5756 澳元/日圓 108.410 106.710 +1.59 +3.70 104.540 新西蘭元/日圓 91.900 91.900 0.00 +1.33 90.690 英鎊/日圓 211.72 211.69 +0.02 +0.34 211.02 澳元/新西蘭元 1.1637 1.1615 +0.19 +0.45 1.1585 美元指數 96.112 96.446 -0.35 -2.25 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1753,
      "HasTables": false,
      "ScrapedAt": "2026-01-29 18:43:15"
    },
    {
      "Source": "TradingView - Reuters Stocks",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YU0LE:0/",
      "Date": "2026-01-29",
      "Time": "14:17:53",
      "Title": "台灣股市：收低創下歷史天量，投資人居高思危選擇獲利離場",
      "Content": "台灣股市周四收低，成交量則創下歷史新高，並中止連五日上揚走勢。分析師稱，因美股期貨盤下跌且投資人在接近33,000點整數大關進行獲利了結。\n\n台灣加權指數 TWSE:TAIEX收低0.82%至32,536.27點，盤初一度高見32,996.03點；今日成交初值 (.TTOV.TW)擴增至9,307.94億台幣的歷史天量，上日修正後為8,539.22億。\n\n“投資人居高思危，在接近33,000點獲利了結賣壓不輕。”華南投顧分析師蘇見文說。\n\n他表示，雖然今日大盤量增價跌，不過尚未失控，指數仍沿著五日均線上揚，只是隨著農曆春節長假逐漸接近，投資人追價意願也會降低，台股要再創高點的機率已逐漸降低。 \n\n野村投信基金經理人游景德則指出，記憶體產品傳出漲價利多，帶動族群股價全面走強。市場焦點同時聚焦於本週即將公布財報的多家科技巨頭，在重量級業績登場前，市場情緒料保持樂觀。\n\n分析師預估，明日台股指數區間在32,400-33,000點。（完） \n\n[表格內容]\n**查閱相關新聞或頁面，請點選下列代碼連結**** 美國股市 一周展望 歐洲股市報導 日本股市報導 中港股市報導 中國股市報導 台灣股市報導 股市簡訊 納斯達克最活躍個股 (.AV.O) 紐約證交所最活躍個股 (.AV.N) 納斯達克漲幅居前個股 (.PG.O) 紐約證交所漲幅居前個股 (.PG.N) 納斯達克跌幅居前個股 (.PL.O) 紐約證交所跌幅居前個股 (.PL.N) 標普主要分類指數 (0#.GSPMAJOR) 英股富時指數 CURRENCYCOM:UK100 德股DAX指數 法股CAC-40指數 韓國股市已並入韓國金融市場報導中，相關稿件請點選",
      "ContentLength": 713,
      "HasTables": false,
      "ScrapedAt": "2026-01-29 18:42:51"
    },
    {
      "Source": "TradingView - Reuters Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YT0YN:0/",
      "Date": "2026-01-29",
      "Time": "10:57:50",
      "Title": "台灣債市：指標10年債115/3殖利率開在平盤，該券標售成農曆年封關重頭戲",
      "Content": "台灣指標10年公債115/3期 (A15103=TWO)周四發行前交易殖利率開平于上個成交日。交易員指出，由於115/3期新券將於下周四標售，並在2月10日發行，正好落在農曆年封關日(2月11日)前交割，讓該券標售成農曆年封關重頭戲。\n\n“早上開在這里合理，五年跟10年債利差大約10(基)點。”一位大型證券交易員說。\n\n另位大型銀行交易員則稱，今日115/3殖利率算是以平盤開出，還要再觀察該券利率走勢，將牽動該券標售結果。\n\n台灣央行將於下周四代財政部標售10年券115/3期，金額暫定350億台幣，並預計在2月10日發行。而因應農曆春節，台灣股債市將於2月11日封關，休市到2月23日重新開市。\n\n本地時間10:49，10年券115/3期 (A15103=TWO)發行前交易殖利率報1.42%，成交2億台幣，五年券115/1R期 (A15101R=TWO)電子盤暫無成交；台股 TWSE:TAIEX則跌0.5%。 \n\n交易員預估，今日五年債115/1R期殖利率交易區間在1.30-1.34%；10年債115/3期殖利率區間則在1.40-1.43%。（完）\n\n最新相關報導鏈接：\n\n--美國債市：公債收益率攀升，之前美聯儲維持利率不變",
      "ContentLength": 519,
      "HasTables": false,
      "ScrapedAt": "2026-01-29 18:43:02"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YU03B:0/",
      "Date": "2026-01-29",
      "Time": "10:16:20",
      "Title": "《全球匯市》美元依然不穩，市場擔憂風險不斷累積",
      "Content": "美元周四依然疲弱不穩，白宮和歐洲官員發表的支持性言論，僅部分抵消了圍繞美國經濟政策與地緣政治動向的不確定性。\n\n在貨幣政策方面，美聯儲隔夜對美國勞動力市場和通脹風險持更樂觀態度，投資者據此認為利率可能會在較長時間內維持不變。 (0#USDIRPR)\n\n美元本周早些時候大幅下挫，並觸及四年低位，此前美國總統特朗普似乎對美元走弱未予理會。不過在美國財長貝森特次日表示華盛頓奉行強勢美元政策後，美元才獲得支撐。\n\n歐元兌美元匯率 在美元下跌推動下突破關鍵的1.20關口，但亞洲時段回落至1.1979美元，此前歐洲央行決策者同樣對歐元快速升值表示日益擔憂。\n\n澳洲國民銀行外匯策略主管Ray Attrill表示：“貝森特的評論相當及時--如果你願意的話，可以認為這是預先安排的。”\n\n他說：“我認為歐洲央行的評論是獨立的，但有趣的是，歐元/美元在1.20附近似乎確實觸發了一些反應。”\n\n“你可以認為……歐元/美元近期的升勢雖然並不算大，但某種程度上掩蓋了歐元整體走強的趨勢，而這將會影響歐洲央行的通脹預測。”\n\n儘管周四大規模美元拋售有所緩解，但美元仍處於守勢。\n\n美元兌瑞郎 下跌0.5%至0.7656瑞郎，逼近11年低點；英鎊 接近四年半高位，報1.3826美元。\n\n澳元 創下三年高位0.70495美元，受澳洲最早可能在下周加息的預期推動。\n\n本周早些時候美元的拋售是自去年4月特朗普關稅行動震動市場以來最劇烈的一次。\n\n美元今年迄今已下跌2%。\n\n澳洲國民銀行的Attrill表示，美元表現將關鍵取決於圍繞美聯儲獨立性的相關問題如何發展，包括美國最高法院對特朗普試圖解雇美聯儲理事庫克的裁決。\n\n\"喪失獨立性無疑是美元霸權持續面臨的最大風險，\"他強調。\n\n美元指數報96.24 ，徘徊在周二觸及的四年低點95.566附近。\n\n美元的走弱給疲軟的日圓 帶來喘息空間，周四日圓兌美元上漲0.12%，至1美元兌153.21日圓。\n\n由於上周美國和日本傳出匯率詢價的消息--這種舉動通常被視為干預的前兆，本周大部分時間里，日圓兌美元一直在152-154日圓區間徘徊。\n\n其他方面，新西蘭元 攀升至六個半月高點0.60695美元。離岸人民幣 小幅上漲至1美元兌6.9426元人民幣，本周早些時候曾觸及2023年5月以來的最強水平。\n\n[表格內容]\n 最新報價 紐約 當日 今年來 2025年 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1960 1.1952 +0.07 +1.83 1.1745 美元/日圓 153.2500 153.40 -0.10 -2.17 156.65 歐元/日圓 183.31 183.37 -0.03 -0.37 183.99 美元/瑞郎 0.7670 0.7682 -0.16 -3.19 0.7923 英鎊/美元 1.3801 1.3805 -0.03 +2.43 1.3473 美元/加元 1.3548 1.3555 -0.04 -1.27 1.3724 美元/離岸人民幣 6.9454 6.9428 +0.04 -0.43 6.9756 澳元/美元 0.7027 0.7040 -0.18 +5.32 0.6672 新西蘭元/美元 0.6048 0.6059 -0.18 +5.07 0.5756 澳元/日圓 107.620 106.710 +0.85 +2.95 104.540 新西蘭元/日圓 91.900 91.900 0.00 +1.33 90.690 英鎊/日圓 211.48 211.69 -0.10 +0.22 211.02 澳元/新西蘭元 1.1612 1.1615 -0.03 +0.23 1.1585 美元指數 96.288 96.446 -0.16 -2.07 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1766,
      "HasTables": false,
      "ScrapedAt": "2026-01-29 18:43:23"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YU05S:0/",
      "Date": "2026-01-29",
      "Time": "09:49:20",
      "Title": "台灣匯市：台幣早盤在平盤附近整理，股市震盪加劇可能牽動走向",
      "Content": "台幣兌美元 周四早盤在平盤附近震盪。交易員表示，市場觀望美國財政部長貝森特談話的後續效應，且台股開高後急殺，使得台幣開盤小幅上揚後迅速收斂升幅甚至一度轉為下跌。\n\n他們稱，貝森特強調偏好強勢美元，且否認美國干預外匯市場以支撐日圓，多少為美元提供了些支撐，且日圓也維持整理格局，使得亞幣近日的升值格局無法延續。 \n\n“台股衝高後急殺，加上日圓沒有繼續走升，台幣開高後很快就轉為下跌。”一銀行交易員說。\n\n其指出，由於外資這兩天大買台股555.55億台幣，一早仍有匯入需求令台幣有所支撐，盤中將持續關注台股表現；若出現爆量殺低走勢，台幣可能就會轉而走貶。 \n\n貝森特周三表示，美國奉行強勢美元政策，這意味著要設定正確的基本面。但他同時否認美國正在干預外匯市場以支撐日圓。 \n\n本地時間09:36，台幣兌美元升0.5分報31.315，交易區間在31.270-31.329，此前盤中高位在去年12月15日的31.250；台股 TWSE:TAIEX則跌0.57%報32,615.20點，盤初一度逼近33,000點大關。\n\n在海外無本金交割遠期外匯市場(NDF)方面，目前指標一個月期美元/台幣換匯點 (TWDNDF=)折價幅度較上日尾盤擴大；一個月美元/台幣遠匯 (TWD1MNDFOR=)報31.200/31.263，上日收在31.226。\n\n交易員預估，今日台幣兌美元匯率主要交易區間在31.250-31.350。（完）\n\n最新相關報導鏈接：\n\n--《全球匯市》美元反彈，美聯儲維持利率不變",
      "ContentLength": 642,
      "HasTables": false,
      "ScrapedAt": "2026-01-29 18:43:28"
    }
  ]
}