{
  "last_updated": "2026-02-05",
  "total_reports": 75,
  "reports": [
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3Z102V:0/",
      "Date": "2026-02-05",
      "Time": "09:28:33",
      "Title": "《全球匯市》美元回升，關注稍晚歐洲央行與英國央行決議",
      "Content": "美元在周四亞洲盤初持穩，歐洲央行和英國央行即將公布利率決議，市場普遍預期這兩家央行稍晚都將維持利率不變。\n\n美元指數 小漲0.2%，報96.671，稍早一度逼近兩周高位。\n\n歐元 在歐洲央行決議前維持在1.1800美元水平，市場普遍預期該央行將按兵不動。投資者將密切關注政策決議後的新聞發布會，以判斷未來數月的利率前景。\n\n美銀分析師指出，政策聲明可能僅作微調，\"重點可能在於不確定性升高\"。該行預計歐洲央行今日將維持利率不變，分析師並表示：\"我們對3月降息的判斷並非板上釘釘，但仍堅信當前政策基調偏向寬鬆。\"\n\n英鎊 持平於1.3650美元，英國央行稍晚也將做出政策決議，市場同樣預期央行將按兵不動。\n\n美元兌日圓 報156.92，隨著日本大選進入最後衝刺階段，美元保持穩定。 本周美元小幅走強，因金融市場評估已過半程的美國企業財報季，且股市風險偏好轉弱。\n\n美股納指過去兩日累計下跌2.9%，創10月以來最大跌幅。市場波動源於谷歌母公司Alphabet 周三公布激進的資本支出計劃，以及軟件股因面臨人工智能(AI)新時代的競爭壓力而重挫。\n\n亞洲時段開盤之際，美聯儲理事庫克在演講中表示，對通脹進展停滯的擔憂，超過對勞動力市場疲軟的憂慮，這強烈暗示在關稅引發的價格壓力開始消退前，她不會支持進一步降息。\n\n根據芝商所集團FedWatch工具，聯邦基金期貨預估美聯儲在3月18日結束的會議上維持利率不變的可能性為90.6%，與前日持平。\n\n在特朗普總統與中國國家主席習近平通電話討論貿易、安全問題及美國對台軍售議題後，美元兌離岸人民幣 小幅下跌0.1%，報6.9386元。\n\n澳元 上漲0.1%，報0.70045美元，此前澳洲公布商品貿易數據略高於市場預期。新西蘭元 上漲0.1%，報0.60045美元。\n\n加密貨幣在拋售後趨於穩定，此前跌至2024年11月以來最低點。比特幣 最新上漲0.2%至72,745.23美元，以太幣 微漲1%至2,146.63美元。\n\n[表格內容]\n 最新報價 紐約 當日 今年來 2025年 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1802 1.1806 -0.03 +0.49 1.1745 美元/日圓 156.8200 156.85 -0.02 +0.11 156.65 歐元/日圓 185.09 185.19 -0.05 +0.60 183.99 美元/瑞郎 0.7769 0.7771 -0.03 -1.94 0.7923 英鎊/美元 1.3649 1.3650 -0.01 +1.31 1.3473 美元/加元 1.3664 1.3663 +0.01 -0.44 1.3724 美元/離岸人民幣 6.9387 6.9402 -0.02 -0.53 6.9756 澳元/美元 0.7003 0.6997 +0.09 +4.96 0.6672 新西蘭元/美元 0.6004 0.6003 +0.02 +4.31 0.5756 澳元/日圓 109.760 110.030 -0.25 +4.99 104.540 新西蘭元/日圓 93.700 93.700 0.00 +3.32 90.690 英鎊/日圓 214.05 214.12 -0.03 +1.44 211.02 澳元/新西蘭元 1.1659 1.1654 +0.04 +0.64 1.1585 美元指數 97.653 97.616 +0.04 -0.68 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1635,
      "HasTables": false,
      "ScrapedAt": "2026-02-05 09:42:44"
    },
    {
      "Source": "TradingView - Reuters Brief",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3Z01GP:0/",
      "Date": "2026-02-05",
      "Time": "07:24:26",
      "Title": "《路透早報》--2月5日",
      "Content": "一周全球重要經濟數據和事件預告：\n\n簡體： https://tmsnrt.rs/4rq6zw3\n\n繁體： https://tmsnrt.rs/467jWJa\n\n以下為2月4日下午5:00至2月5日早上7:00的重大新聞與市場摘要：\n\n--習特通話討論台灣與大豆等議題，雙方釋出維穩信號\n\n美國總統特朗普周三與中國國家主席習近平通話。這是去年11月下旬以來兩國領導人的首次通話，雙方在通話後均公開強調了他們在保持良好關係方面的個人投入。特朗普稱習近平將考慮在本年度將美豆採購量從1,200萬噸提高至2,000萬噸以作為善意姿態。大豆期貨價格應聲大漲。特朗普稱通話\"非常積極\"，他與習近平的關係\"非常好\"，\"我們都意識到保持這種關係的重要性\"。新華社報導，習近平在通話中告訴特朗普，他願在新的一年里同特朗普\"多辦一些大事、好事\"。他並提醒特朗普:\"美方務必慎重處理對台軍售問題\"，並強調台灣問題是\"中美關係中最重要的問題\"。\n\n*據國際文傳電訊社（Interfax）援引克里姆林宮發言人佩斯科夫的話稱，克里姆林宮事先獲悉，習近平和特朗普將於周三進行電話交談。\n\n--習近平與普京視頻會晤稱：中俄要密切高層交往，加強各領域務實合作\n\n習近平周三同俄羅斯總統普京舉行視頻會晤。習近平表示，中俄雙方要把握歷史契機，密切高層交往，加強各領域務實合作，以更深層次的戰略協作和更加積極有為的大國擔當，確保中俄關係繼續沿著正確軌道不斷發展。俄羅斯國家電視台稍早報導，普京與習近平視頻會談時，稱讚兩國在能源及其他領域保持著密切合作關係。\n\n*克里姆林宮表示，普京已接受習近平邀請，將於今年上半年訪問中國。\n\n--獨家：Nvidia向字節跳動出售H200芯片的交易卡在特朗普政府設定的條件\n\n據知情人士透露，特朗普政府願意允許中國字節跳動購買Nvidia(輝達/英偉達)的H200芯片，但Nvidia尚未同意其擬議的相關使用條件。該人士稱，美國政府約兩周前表示將批準許可，但Nvidia尚未接受美國政府現行草案中的\"了解你的客戶\"(KYC)要求以及其他若干條件。KYC規定旨在確保中國軍方無法獲取這些芯片。公司發言人表示，無法自行接受或拒絕許可條件。字節跳動暫未回應置評請求。美國商務部也未立即回應置評請求。\n\n--美國、歐盟和日本宣布建立戰略夥伴關係，旨在增強關鍵礦產供應鏈的韌性--該領域目前由中國主導。三方還計劃與理念相近的夥伴達成更廣泛的貿易協議，內容可能包括邊境調整價格下限和價格差補貼。在聯合聲明中表示，美歐雙方承諾在30天緊迫期限內就關鍵礦產達成諒解備忘錄。\n\n--美國周三召集逾50個國家舉行會談，旨在加強各國取得關鍵礦產的渠道，以削弱中國對重要工業投入品的掌控。韓國、印度、泰國、日本、德國、澳洲和剛果民主共和國等都將出席在華盛頓舉行的會議，不過美國未公布完整名單。\n\n--針對歐委會對中國風電企業啟動調查，中國商務部周三晚間回應稱，此舉具有明顯針對性和歧視性，相關調查泛化“外國補貼”，存在立案證據不足、程序不透明等諸多問題，是典型的以“公平競爭”之名行“保護主義”之實。“我們敦促歐方立即糾正錯誤做法，慎用《外國補貼條例》（FSR）單邊調查工具，為中歐合作創造公平、公正、可預期的市場環境，”商務部稱。\n\n--美財長貝森特：對特朗普是否有權因政策分歧而解雇美聯儲官員不持立場\n\n美國財政部長貝森特表示，對於總統是否擁有因貨幣政策分歧而解雇美聯儲主席或理事的憲法權力，他本人不持立場，但他認為美聯儲是一個獨立機構。貝森特在美國眾議院金融服務委員會的聽證會上表示，政府內部存在不同意見。他還強調自己並非法律專家，該問題最終需由美國最高法院裁決。\n\n*貝森特還表示，他在特朗普贏得大選之前的2024年1月曾表示“關稅會帶來通脹”，而這一判斷是錯誤的。貝森特表示，儘管特朗普在上任一年間實施了一系列關稅舉措，美國經濟仍在增長，通脹率則在下降。\n\n*貝森特同時重申，他始終支持強勢美元政策。\n\n--美國總統特朗普表示，他對美聯儲將降息”幾乎沒有“懷疑，並稱之所以提名沃什領導美聯儲，是因為對方理解他希望降低利率。\"我的意思是，如果他說'我想加息'……那他就不會得到這份工作。不可能。\"\n\n--美國勞工統計局表示，因近期結束的為期三天的政府停擺而推遲的1月份就業報告將於下周三發布。該機構同時宣布，原定下周三發布的1月份消費者物價指數(CPI)報告將推遲至下周五公布。而原定本周二發布的12月份職位空缺與勞動力流動調查報告，將改至本周四發布。\n\n--美國與伊朗同意周五在阿曼舉行會談，但議程問題仍存分歧\n\n 美國總統特朗普周三對NBC新聞表示，伊朗最高領袖\"應該非常擔心\"。特朗普發言後，美伊雙方官員表示，雙方已同意於周五在阿曼舉行會談。然而雙方仍存分歧：美國堅持將伊朗的導彈武器庫納入談判範圍，而伊朗則表示只愿討論其核計劃。近幾日，圍繞會談範圍與地點的分歧引發外界質疑談判能否如期舉行，也讓特朗普可能付諸對伊朗動武威脅的可能性仍未排除。\n\n--烏克蘭和俄羅斯官員結束了美國斡旋下于阿布扎比舉行的首日會談，基輔首席談判代表表示，此次會談“富有成效”。與此同時，戰事衝突仍在持續。一位匿名美國官員也稱會談富有成效，並表示會談將於周四上午繼續進行。\n\n--美國1月服務業持穩，AI帶動數據中心建設引發供應擔憂\n\n美國服務業1月整體保持穩定，但企業愈發擔心，人工智能(AI)推動的數據中心建設熱潮將帶來供應瓶頸。供應管理協會(ISM)稱，美國1月非製造業採購經理指數(PMI)維持在53.8，因出口下滑導致新訂單增長放緩。經濟學家此前預計1月服務業PMI降至53.5。調查亦顯示，美國進口關稅及不確定性仍令許多企業憂心，ISM稱這“可能源自年度合同續簽以及地緣政治緊張局勢”。另外ADP公布的全國就業報告顯示，1月民間就業崗位增加22,000個，低於12月的37,000個和經濟學家預計的48,000個。\n\n--歐元區1月消費者物價調和指數(HICP)同比上升1.7%，為2024年9月以來最低升幅，進入多數經濟學家預計將持續至少一年的疲軟期，歐洲央行料將維持利率不變。\n\n--歐元區1月HCOB綜合PMI終值從12月的51.5降至51.3，觸及四個月低點，且低於51.5的初值。歐元區經濟活動連續第二個月放緩，需求幾乎沒有增長，招聘活動陷入停滯，表明2026年開局脆弱。\n\n--德國1月HCOB服務業PMI終值從12月的52.7降至52.4，較初值53.3低近1個點，但仍高於50.0的榮枯分界線，顯示德國服務業活動上升勢頭延續到今年年初，但增速放緩至四個月來最低水平。\n\n--英國1月服務業PMI終值為54.0，創2025年8月以來新高，高於12月的51.4，但略低於初值54.3。企業同時回覆稱價格大幅上漲，這可能成為英國央行本周利率決議的隱憂。\n\n--獨家：中國最早下月將推出人民幣計價液化天然氣期貨合約\n\n知情人士透露，中國最快將於下月推出國內交易所上市的、人民幣計價的液化天然氣（LNG）期貨合約。此舉將降低進口商在對沖價格波動時對西方的依賴。消息人士稱，該衍生品將在上海期貨交易所掛牌。上海期貨交易所和中國證監會均未回應路透的置評請求。\n\n--韓國執政黨與主要反對黨表示，國會已同意在3月9日前完成一項法案，以依據韓美兩國之間的貿易協議在美國進行投資。\n\n--路透調查：全球不確定性加劇，分析師大幅上調金價預測\n\n路透調查顯示，黃金有望在2026年再度迎來創紀錄表現，分析師紛紛上調預測，地緣政治不確定性與央行強勁購金仍是主要推手。30位受訪分析師和交易員對2026年黃金均價預測中位數為每盎司4,746.50美元，為路透2012年開展此類調查以來的最高年度預測，遠高於去年10月預測的4,275美元。\n\n--中國長安汽車表示，正籌劃10-20億元人民幣的A股和B股回購事項，用以減少公司註冊資本；公司同日公布的1月銷量同比腰斬。\n\n--RTX旗下的的雷神公司(Raytheon)稱，已與五角大樓達成一項為期七年的協議，以提高戰斧導彈、空對空導彈和反彈道導彈的產量。\n\n[市場摘要]\n\n股市：\n\n--美國股市標普500指數和納斯達克指數周三收低，AMD和Palantir等科技股下跌，投資者擔憂估值過高，並質疑華爾街的人工智能（AI）熱潮是否已見頂。標普500指數下跌0.51%，收於6,882.72點。納斯達克指數下跌1.51%，收於22,904.58點。道瓊斯工業指數上漲0.53%，收於49,501.30點。\n\n--歐洲股市創下收盤紀錄新高，但漲幅有限。電信板塊大漲和消費類股的強勢，在一定程度上被軟件公司的疲軟以及醫療保健公司諾和諾德令人失望的前景引發的拋售所抵消。泛歐STOXX 600指數收報618.12點，微漲0.03%。英國富時100指數收高0.85%。德國DAX指數收低0.72%。法國CAC-40指數收高1.01%。\n\n匯市：\n\n--美元兌日圓上漲，日圓在日本大選前連續第四日下跌。美元兌歐元、英鎊等多數主要貨幣也小幅上漲。原定周五發布的美國重要就業數據推遲至下周發布，加劇了美聯儲利率路徑的不確定性。日圓兌美元紐約盤尾下跌0.7%，報156.82日圓。美元指數上漲0.24%，至97.63。歐元兌美元下跌0.11%，至1.1806美元，投資者密切關注歐洲央行周四政策決議中關於歐元估值可能影響政策路徑的任何表態。 \n\n債市：\n\n--美國公債收益率漲跌不一，交易員等待推遲發布的美國經濟數據，同時繼續評估即將上任的美聯儲主席沃什可能對貨幣政策產生的影響。通常與美聯儲利率預期同步波動的兩年期公債收益率下跌1.5個基點至3.557%。指標10年期公債收益率則上升0.3個基點至4.276%。\n\n--歐元區公債收益率小跌，此前該地區通脹數據顯示1月份價格壓力有所緩解，但市場預計這不會阻止歐洲央行本周維持利率不變。作為歐元區債券市場指標的德國10年期公債收益率下跌2個基點至2.866%，德國30年期公債收益率下跌1.6個基點至3.531%。\n\n油市：\n\n--油價大漲約3%，此前有媒體報導稱美國與伊朗原定於周五舉行的會談可能告吹，但市場結算後美國官員證實伊朗與美國將於周五在阿曼舉行核談判。布蘭特原油期貨收報每桶69.46美元，上漲2.13美元或3.16%；美國原油(WTI)上漲1.93美元或3.05%，報65.14美元。\n\n金屬：\n\n--金價收高，盤中曾受美元上漲和獲利了結影響回落，投資者等待美國就業數據並評估地緣政治動態以獲取新線索。現貨金收漲約0.5%，報每盎司4,962.39美元。4月交割的美國黃金期貨結算價報每盎司4,950.80美元，上漲0.3%。\n\n--銅價下跌，美元走強及交易所庫存金屬供應增加構成壓力，而交易員淡化了中國擴大戰略儲備的計劃。1700 GMT，倫敦金屬交易所(LME)指標三個月期銅收報每噸13,065.50美元，下跌3%。\n\n[今日看點]\n\n重要經濟數據(GMT時間)：\n\n--澳洲12月貿易收支(0030)\n\n--德國12月工業訂單(0700)\n\n--台灣1月CPI和PPI(0800)\n\n--台灣1月外匯存底(0820)\n\n--英國1月標普全球建築業採購經理人指數(PMI)(0930)\n\n--歐元區12月零售銷售(1000)\n\n--美國1月Challenger企業計劃裁員崗位(1230)\n\n--美國一周初請失業金人數(1330)\n\n--美國12月JOLTS職位空缺(1500)\n\n--韓國12月經常帳收支(2300)\n\n--日本12月所有家庭支出(2330)、1月外匯儲備(2350)\n\n重大經濟事件及官員講話(GMT時間)：\n\n--美國斡旋的烏克蘭與俄羅斯新一輪三方會談(最後一日)\n\n--美聯儲理事庫克將在邁阿密經濟俱樂部就貨幣政策與經濟前景發表演說(上日2330)\n\n--英國央行宣布利率決定、公布貨幣政策報告以及會議記錄(1200)\n\n--歐洲央行公布利率決議(1315)，召開新聞發布會(1345)\n\n--美國亞特蘭大聯邦儲備銀行總裁博斯蒂克在一場活動上參加有關貨幣政策的對話與問答環節(1550)\n\n--加拿大央行總裁麥克勒姆發表演講(1740)\n\n--澳洲央行總裁及相關官員在眾議院經濟事務委員會作證(2230)\n\n注：其他重要財經新聞瀏覽請點選；近日《路透早報》請點選。(完)",
      "ContentLength": 5077,
      "HasTables": false,
      "ScrapedAt": "2026-02-05 07:42:45"
    },
    {
      "Source": "TradingView - Reuters Stocks",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3Z01EU:0/",
      "Date": "2026-02-05",
      "Time": "05:54:47",
      "Title": "美國股市：標普500指數收跌，人工智能擔憂重創科技股",
      "Content": "美國股市標普500指數和納斯達克指數周三收低，AMD和Palantir等科技股下跌，投資者擔憂估值過高，並質疑華爾街的人工智能（AI）熱潮是否已見頂。\n\n谷歌母公司Alphabet 在盤後公布季度財報前下跌近2%。收盤後股價回升2%，該公司表示正大幅增加支出以深化在人工智能領域的投資。\n\n芯片製造商AMD 驟降17%，該公司季度營收預測令投資者失望，且暗示在與人工智能巨頭Nvidia（英偉達/輝達 ) 的競爭中舉步維艱。\n\nNvidia 下跌3.4%，費城半導體指數 下跌4.4%。\n\n人工智能數據公司Palantir 急挫近12%，抹去前日因強勁季度銷售推動的漲幅。\n\nArgent Capital 投資組合經理 Jed Ellerbroek 表示：“這輪基礎設施建設的規模前所未有，而消費者和企業採納AI工具的速度也前所未有。股市很難判斷該如何給相關股票定價、以及未來會是什麼樣子……市場突然變得懷疑並擔憂起來。”\n\n市場擔憂快速發展的AI技術可能衝擊行業成熟企業之際，部分軟件公司延續近期跌勢。Snowflake 下跌4.6%，Datadog 下跌3.3%。\n\n投資者拋售與AI相關的股票，轉而買入價格更便宜、近年未加入科技股漲勢的公司。標普500價值股指數 連續第五個交易日上漲，成長股指數 (.IGX) 則下跌。\n\n標普500指數下跌0.51%，收於6,882.72點。納斯達克指數下跌1.51%，收於22,904.58點。道瓊斯工業指數上漲0.53%，收於49,501.30點。\n\n儘管標普500指數下跌，但11個板塊中有七個上漲，能源板塊 領漲，漲幅2.25%，材料板塊 緊隨其後上漲1.8%。\n\n美國各交易所累計成交246億股，交易量較大，此前20個完整交易日的日均成交量為199億股。\n\nSuper Micro Computer 大漲13.8%，此前該公司上調全年營收預測——隨著企業擴大數據中心容量，對其人工智能優化服務器的需求持續強勁。\n\n製藥巨頭禮來 跳漲約10%，限制了標普500指數跌幅。該公司預測的2026年利潤超出華爾街預期。\n\n受已於周二結束的為期四天的政府部分停擺影響，備受關注的1月就業報告推遲發布，原定於周五公布。\n\n與此同時，周三公布的ADP全國就業報告顯示，專業及商業服務、製造業領域裁員之際，1月美國民間就業增幅低於預期。\n\n標普500指數 (.AD.SPX) 成分股中，跌漲股家數比為2.6:1。\n\n93只標普500指數成分股創52周新高，23只創52周新低。\n\n218只納斯達克指數成分股創52周新高，318只創52周新低。（完）\n\n[表格內容]\n****查閱相關新聞或頁面，請點選下列代碼連結**** 美國股市 一周展望 歐洲股市報導 日本股市報導 中港股市報導 中國股市報導 台灣股市報導 股市簡訊 納斯達克最活躍個股 (.AV.O) 紐約證交所最活躍個股 (.AV.N) 納斯達克漲幅居前個股 (.PG.O) 紐約證交所漲幅居前個股 (.PG.N) 納斯達克跌幅居前個股 (.PL.O) 紐約證交所跌幅居前個股 (.PL.N) 標普主要分類指數 (0#.GSPMAJOR) 英股富時指數 CURRENCYCOM:UK100 德股DAX指數 法股CAC-40指數 韓國股市已並入韓國金融市場報導中，相關稿件請點選",
      "ContentLength": 1385,
      "HasTables": false,
      "ScrapedAt": "2026-02-05 06:42:39"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3Z01DF:0/",
      "Date": "2026-02-05",
      "Time": "05:08:53",
      "Title": "《全球匯市》美元上漲，日本大選前日圓連跌四日",
      "Content": "美元兌日圓周三上漲，日圓連續第四日下跌，日本即將舉行大選，結果料將提振首相高市早苗在財政和國防開支方面的雄心。\n\n美元兌歐元、英鎊等多數主要貨幣也小幅上漲，供應管理協會（ISM）周三報告顯示美國1月服務業保持穩定，但投入成本上升預示著近期放緩的服務業通脹可能反彈。\n\n市場正密切關注該報告，此前由於美國政府部分停擺（已於周二晚結束）推遲了原定周五發布的重要就業數據。數據推遲至下周發布，加劇了市場對美聯儲利率路徑的不確定性。\n\n渣打銀行全球G10外匯研究主管Steve Englander表示：“目前美元仍被困在其近期區間內，因交易員在權衡，這輪由科技板塊領跌的股市下挫，究竟是典型的風險厭惡（通常利多美元），還是意味著美國經濟的皇冠上的明珠——科技行業——正在惡化。”\n\n\"我認為他們正苦於找到答案。\"\n\n日圓兌美元 紐約盤尾下跌 0.7%，報156.82日圓，此前曾觸及 1月23日以來最低。在1月23日，受市場臆測紐約聯儲進行了匯率詢價影響，日圓從 159.23大幅攀升。美國財政部長貝森特上周否認華盛頓出手干預以支撐日圓，並表示美國奉行強勢美元政策。\n\n自1月30日以來，日圓已下跌逾2%。\n\n高市早苗本周早些時候在競選演講中宣揚日圓貶值的益處，引發一波日圓拋售。儘管她隨後收回相關言論，但市場仍擔憂首相釋放的矛盾信號，可能損害支撐疲軟日圓的努力。\n\nLMAX Group市場策略師Joel Kruger指出：\"市場正受日本選舉風險、歐元區通脹降溫以及美國經濟增長與就業動能重新受到關注的三重因素驅動，美元獲得溫和支撐，而日圓則明顯表現疲軟。\"\n\n\"市場焦點完全集中於經濟活動與就業數據對前景的指引意義。美聯儲短期內仍預計將維持政策不變——勞動力市場趨軟將令降息預期提前，韌性增強則會令放鬆政策預期推遲，這使得外匯與利率對宏觀數據保持高度敏感。\"\n\n**關注美國數據**\n\nMesirow Currency Management 高級投資策略師 Uto Shinohara 表示：“最新數據暗示，經濟依然穩定，但未必強勁到足以在外匯市場形成持續的信心。市場對美聯儲政策的預期仍接近兩次降息。”\n\n美元指數 上漲0.24%，至97.63。\n\n澳元兌美元 下跌0.37%，至0.6996美元，上日因澳洲央行加息而急升1%。\n\n人民幣兌美元 穩步上漲。分析師認為當局將阻止人民幣進一步升值，但風險仍傾向於上行，或將考驗中國脆弱的經濟。\n\n**強勢歐元或影響歐洲央行政策路徑**\n\n歐元兌美元 下跌0.11%，至1.1806美元，投資者密切關注歐洲央行周四政策決議中關於歐元估值可能影響政策路徑的任何表態。\n\n上周歐元升至1.2084的四年半最高，政策制定者對歐元快速上漲日益擔憂，警告稱這可能拖累通脹，而當前物價漲幅已低於歐洲央行2%的目標。\n\n分析師指出，近期歐元兌美元交易幾乎完全由美元情緒驅動，而利率差異因素則退居次要地位。（完）\n\n[表格內容]\n****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1422,
      "HasTables": false,
      "ScrapedAt": "2026-02-05 05:42:40"
    },
    {
      "Source": "TradingView - Reuters Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3Z01CP:0/",
      "Date": "2026-02-05",
      "Time": "04:37:59",
      "Title": "美國債市：公債收益率漲跌互現，交易員評估數據和沃什對貨幣政策的影響",
      "Content": "美國公債收益率周三漲跌不一，交易員等待推遲發布的美國經濟數據，同時繼續評估即將上任的美聯儲主席沃什可能對貨幣政策產生的影響。 \n\n備受關注的1月就業報告發布日期已從原定的周五推遲至下周三，因政府部分停擺。為期四天的停擺將於周二結束。\n\n與此同時，周三公布的ADP全國就業報告顯示，1月美國民間就業崗位增幅低於預期。\n\nPGIM固定收益首席投資策略師Robert Tipp表示，ADP數據並未改變市場對美聯儲今年進行兩次25個基點降息的預期。\"公債面臨的風險在於美國經濟增長更強勁，\"他指出。\n\n通常與美聯儲利率預期同步波動的兩年期公債收益率 (US2YT=RR) 下跌1.5個基點至3.557%。指標10年期公債收益率 則上升0.3個基點至4.276%。\n\n兩年期與10年期公債收益率曲線 (US2US10=TWEB) 走陡約2個基點，至71.7個基點。\n\n聯邦基金利率期貨交易員目前預計今年將進行兩次25個基點的降息，這源於對就業市場疲軟的擔憂，以及對沃什將在鮑威爾5月任期結束後領導更鴿派的美聯儲的預期。 \n\n然而，經濟增長強勁和通脹再度攀升可能使這一預期複雜化。沃什還主張美聯儲縮減資產負債表規模，這將收緊金融條件。他表示美聯儲的大規模資產持有扭曲了經濟中的金融條件。\n\nTipp指出：\"傳統邏輯是通過縮表收緊政策，通過降息放鬆政策。但對通脹前景的看法存在分歧...即人工智能將導致通脹率下降。\"\n\n\"這引發了大量不確定性。市場普遍採取觀望態度，不進行大的押注，\"他補充道。\n\n分析師指出，美聯儲資產負債表政策的任何調整都可能取決於銀行監管規則的變動，短期內不太可能發生。\n\n美國財長貝森特周三表示，美聯儲的獨立性建立在美國民眾對美聯儲的信任之上，而美聯儲因放任通脹失控並\"侵蝕\"民眾收入而喪失了這種信任。\n\n周三公布的其他數據顯示，美國服務業1月持穩，但企業投入成本更高，這表明在近幾個月呈放緩趨勢之後，服務業通脹可能會回升。\n\n美國財政部周三宣布，2026年2月至4月1,250億美元的再融資計劃，並表示未來幾個季度內不會增加中長期公債的標售規模，這符合市場預期。\n\n[表格內容]\n 20:29 GMT 價格 收益率% 收益率變動 兩年期公債 (US2YT=RR) 99.8828125 3.5614 -0.0110 五年期公債 (US5YT=RR) 99.6171875 3.8350 -0.0020 10年期公債 97.796875 4.2775 +0.0050 30年期公債 (US30YT=RR) 95.484375 4.9149 +0.0090 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 美國現貨公債 美國指標公債報價 (0#USBMK=) 英國公債市場 歐元區公債市場 日本公債市場 中國債市 台灣債市 歐元區指標公債報價 (0#EUBMK=) 利率或央行相關報導",
      "ContentLength": 1204,
      "HasTables": false,
      "ScrapedAt": "2026-02-05 04:42:40"
    },
    {
      "Source": "TradingView - Reuters Stocks",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3Z01XG:0/",
      "Date": "2026-02-05",
      "Time": "00:02:18",
      "Title": "美國股市漲跌不一，科技股持續疲軟",
      "Content": "美國股市漲跌不一，科技股持續疲軟\n\n美國股市周三早盤漲跌不一，道指 上漲，標普500指數 和納斯達克指數 疲軟，受科技股再度下跌拖累。 \n\n安進 第四季度業績超出預期，該公司股價大漲逾6%，為道指上漲提供了支撐 。 \n\n科技 是 11 個主要板塊中表現最差的板塊之一，芯片製造商尤其表現疲軟。Nvidia 、Advanced Micro Devices 和Broadcom 是拖累基準標普500指數最大的三隻股票，費城半導體指數 下跌超過2%。 \n\nAMD 下跌超過 14%，此前該公司較低的銷售預期 引發了市場對該公司能否與競爭對手Nvidia有效競爭的擔憂。 \n\n軟件類股的疲軟態勢也持續 ，標普500軟件和服務指數 (.SPLRCIS)連續第六個交易日下跌。在此期間，該指數已累計下跌超過 13%，創下 2020 年 3 月以來的最大跌幅。 \n\n在周二的科技股大跌之後，杰富瑞（Jefferies）股票交易櫃檯的杰弗里-法烏扎（Jeffrey Favuzza）在一份說明中表示，目前科技股在14天RSI基礎上顯示為超賣的比例達到了自2025年春季關稅宣布以來的最高水平，但 \"今天與前幾周的不同之處在於，這一次我們已經開始看到這種情況滲入IT服務、互聯網和某些媒體領域\"。\n\n以下是您的市場快照： \n\n查克-米科拉查克（Chuck Mikolajczak）\n\n*****\n\n早些時候的實時市場：\n\n為什麼比特幣最近的潰敗與眾不同 點擊此處 \n\n標普500指數：突破還是假突破？ 點擊此處 (link) \n\n瑞銀認為歐洲可再生能源將有 10-20% 的上升空間 點擊此處 \n\n歐洲汽車製造商面臨 \"可怕的 \"中國出口加速 點擊此處 (link) \n\n電信業大放異彩，軟件業舉步維艱，富時指數創下新紀錄 點擊此處 \n\n鐘聲敲響前的歐洲：軟件受關注，Novo受重創 點擊此處 \n\n歐元區在歐洲央行會議前面臨通脹障礙 點擊此處",
      "ContentLength": 812,
      "HasTables": false,
      "ScrapedAt": "2026-02-05 00:42:42"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3Z00K8:0/",
      "Date": "2026-02-04",
      "Time": "17:15:18",
      "Title": "台灣匯市：台幣量縮收微貶未見明確方向，外資匯入但壽險美元買盤出籠",
      "Content": "台幣兌美元 周三量縮收微貶，未見明確方向。匯銀人士稱，台股 TWSE:TAIEX小升，至於外資全日以匯入居多，不過進口商和壽險則有美元買盤進場，兩股勢力拉鋸之下，台幣收盤微貶。\n\n匯銀人士指出，台股雖僅小漲，但外資則是一路往下拋匯，但美元逢低有進口商的美元買盤出籠。此外午後也有壽險業者的美元買盤進場，整體而買賣美元的力道均衡，全日波動區間窄縮。\n\n“下午二點半過後有壽險出來，...可以感受到他們有在做，”一位大型匯銀人士表示。\n\n該人士也說，壽險業有進場買美元的需求，因此台幣要大升並不容易，未來台幣的方向主要看台美的利差、以及外資的操作動向。\n\n另外一位大型匯銀人士則說，今日的美元買盤主要來自於壽險及軍款。目前台股熱度還在，不排除農曆年後可能還有行情。至於央行在31.700附近“守得很緊”，短期內若國際美元波動不大，此關卡不易貶破。\n\n台灣股市周三收盤小漲，因長假在即短線量縮震盪整理；至於外資及陸資在台股買超120.66億台幣，連兩個交易日共買超193.34億台幣。 \n\n在海外無本金交割遠期外匯市場(NDF)方面，目前指標一個月期美元/台幣換匯點 (TWDNDF=)由微幅折價轉為溢價；一個月美元/台幣遠匯 (TWD1MNDFOR=)報31.570/31.590，上日收在31.573。\n\n交易員預估，明日台幣兌美元主要交易區間在31.500-31.670。\n\n[表格內容]\n16:00 台幣/美元報價 上日收盤 波動區間 開盤價 成交量(億美元) 上日成交量 (億美元) 台北外匯經紀公司 (TAIFX1) 31.577 31.570 31.503-31.639 31.600 14.70 14.28 元太外匯經紀公司 31.575 31.568 31.503-31.636 31.605 4.785 7.015 \n\n[表格內容]\n無本金交割遠期外匯(NDF) (TWDNDF=) 最新報價 上日現貨收盤時水準 美元/台幣一個月期 +0.023/+0.028 -0.006/-0.001 美元/台幣六個月期 -0.082/-0.077 -0.110/-0.105 \n（完）",
      "ContentLength": 894,
      "HasTables": false,
      "ScrapedAt": "2026-02-04 17:42:43"
    },
    {
      "Source": "TradingView - Reuters Brief",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3Z007H:0/",
      "Date": "2026-02-04",
      "Time": "16:58:19",
      "Title": "《路透晚報》--2月4日新聞摘要（國際版）",
      "Content": "以下為路透中文新聞為您整理的亞洲市場時段(上午7:00-下午5:00)新聞摘要：\n\n[重大數據或新聞]\n\n--民主黨參議員尋求暫緩沃什提名，稱先待鮑威爾與庫克調查結束\n\n美國參議院金融委員會的民主黨成員周二致信共和黨籍主席Tim Scott，要求其暫緩對前美聯儲理事沃什的提名程序。沃什是特朗普總統提名的下一任美聯儲主席人選。參議院銀行委員會成員沃倫及其10名民主黨同僚聯名致函稱：“我們要求推遲沃什先生的提名程序，直至針對鮑威爾主席和庫克理事的借口式刑事調查結束。” \n\n--因美國安全審查，Nvidia對中國出口H200 AI芯片受阻--FT\n\n英國《金融時報》援引知情人士報導稱，儘管美國總統特朗普近兩個月前已批準Nvidia向中國出口H200人工智能芯片，但由於美國國家安全審查仍在進行中，相關銷售前景仍懸而未決。報導稱，中國客戶目前暫未向Nvidia下達H200芯片訂單，需待能否獲得出口許可以及可能附帶哪些條件明確後再作決定。路透未能立即核實該報導。Nvidia和美國國務院在非工作時間未立即回應路透的置評請求。\n\n--特朗普呼籲將部分地區的選舉\"國家化\"，遭到民主黨人強烈反對 \n\n特朗普呼籲共和黨人將部分地區的選舉\"國家化\"，周二遭到議員們的反對，其中包括一些共和黨議員。與此同時，民主黨人再度表達擔憂，認為他意圖干預將決定國會控制權的11月中期選舉。\n\n--白宮發言人表示，美聯儲理事米蘭周二辭去了白宮經濟顧問委員會主席的職務。自去年總統特朗普任命他填補美聯儲理事會意外出現的空缺以來，米蘭的經濟顧問委員會主席職務一直處於請無薪假的狀態。\n\n--獨家：日本央行不會出手救援高市引發的公債暴跌--消息\n\n消息人士稱，日本首相高市早苗不應指望日本央行出手抑制公債收益率的急升，因為干預成本高昂，包括可能引發不受歡迎的日圓貶值的重大風險。儘管市場波動引發央行內部警訊，但三名熟悉央行想法的消息人士表示，現階段干預債市的風險大於收益。\n\n--英特爾CEO陳立武宣告布局生產GPU；稱華為\"只落後短短一步\"\n\n英特爾首席執行官陳立武表示，該公司計劃生產圖形處理器（GPU）。陳立武還表示，近期在招聘芯片設計師時，他\"震驚地發現\"中國華為已招攬約100名\"頂尖\"設計師，儘管美國限制了華為取得芯片行業軟件與工具的渠道。陳立武表示，當他詢問這些華為設計師為何選擇加入這家無法使用美國工具的中國企業時，\"他們說：‵即便無法取得諸如Cadence和新思科技(Synopsys)的最頂尖工具，我們仍有窮人方案可以選擇，而且我們辦得到。′\"\n\n--美國零售巨頭沃爾瑪周二市值突破1萬億美元，成為全球首家達到這一規模的零售商，並躋身Nvidia和谷歌母公司Alphabet等科技巨頭的行列。該公司股價在過去一年累計上漲近26%。 \n\n--歐盟專員阿爾布克爾克在布魯塞爾一場金融科技監管會議上表示：\"歐洲必須掌控支撐與驅動我們經濟的關鍵技術。\"荷蘭央行監管委員會主席麥堯爾指出，歐洲金融機構因過度依賴少數雲計算供應商，而更易遭受潛在的網絡攻擊，但他補充說部分機構正在擴大供應商的範圍。\n\n--美國貿易代表格里爾表示，特朗普周二簽署了一項法案，將非洲優惠貿易計劃延長至12月31日，並追溯至2025年9月30日生效。\n\n--韓國保健福祉部第一次官Seuran Lee表示，希望國民年金公團(NPS)能在年底前開始發行外幣債券，此舉將有助於在匯率波動加劇的背景下加強融資多元化。\n\n--一位地區外交官稱，美國與伊朗的核談判預計將於周五在阿曼舉行。隨著美國總統特朗普在中東地區增兵，雙方可能面臨對峙局面。\n\n--彭博新聞引述知情消息人士報導，Nvidia接近達成協議，在OpenAI最新一輪融資中向其投資200億美元。報導補充稱，Nvidia的投資已接近完成，但交易尚未最終敲定，相關條款仍可能發生變化。\n\n--知情人士透露，福特汽車與中國吉利汽車正就潛在合作展開磋商。三名知情人士透露，雙方正商討吉利使用福特在歐洲的工廠生產在該地區出售的車輛。另據兩名知情人士稱，雙方還探討了建立潛在的技術共享框架，包括自動駕駛技術在內。\n\n--據三名中國消息人士和一名印尼官員透露，中國山東南山集團計劃在印尼民丹島建設一座煉油廠。該集團計劃在民丹島卡朗巴唐經濟特區建設日原油加工能力為10萬桶的煉油廠。\n\n--波音民用航空市場營銷副總裁Darren Hulst表示，預計將在今年上半年開始向航空公司交付改進型787-9和787-10夢想客機，這些機型將具備更長的航程或更大的貨運能力。\n\n--新西蘭第四季度失業率升至10年高位，因求職人數增加抵消了就業增長。這份喜憂參半的報告表明，利率在一段時間內仍需維持低位。新西蘭統計局的數據顯示，第四季失業率小幅攀升至5.4%，創2015年第三季度以來新高，且高於市場預期的5.3%。\n\n[市場摘要]\n\n--日本股市：日經指數繼昨日大漲後收低，軟件公司跟隨全球同業下挫\n\n日股日經指數周三下跌，軟件開發商跟隨全球同業下挫。日經指數下跌0.78%，收於54,293.36點。東證股價指數收漲0.27%，報3,655.58點。\n\n--中港股市：滬綜指恆指連兩日收漲，能源和地產股大漲、科技股頹勢不改\n\n中國股市滬綜指連續第二個交易日收漲，金銀價格持續反彈，指數亦有所企穩，但春節將至，觀望情緒濃厚，兩市成交額創下五周新低。香港恆指窄幅震盪後略收升，亦為兩日連漲。能源和房地產板塊助力兩地股市走強，而人工智能等科技板塊繼續走頹。滬綜指收升0.9%，至4,102.2點，滬深300指數收漲0.8%。深圳創業板指數收跌0.4%，上證科創板50成份指數收低1.2%。香港恆生指數略收高0.1%，報26,847.32點。\n\n--匯市：美元持穩因投資者保持謹慎；日圓在周末大選前走弱\n\n美元持穩，美國政府部分停擺迅速落幕後，投資者仍保持謹慎；日圓徘徊於兩周低點附近，日本周末將舉行全國大選，結果難料。0825GMT，歐元兌美元上漲0.09%，報1.1829美元。英鎊兌美元上漲0.18%，報1.3722。美元指數跌0.048%，報97.365。日圓兌美元上漲0.47%，報156.47。\n\n--歐元債市：收益率小幅走低，等待歐元區通脹率初值數據\n\n歐元區政府公債收益率小幅走低，市場正等待稍後公布的歐元區整體通脹率初值。更廣泛市場的緊張情緒限制了價格波動。德國10年期公債收益率下跌約1.5個基點至2.875%。長期債券價格小幅走強，30年期收益率下跌1.5個基點至3.531%。\n\n--國際油市：油價續漲，因擔憂中東局勢升級\n\n油價延續漲勢，此前美國擊落一架伊朗無人機，伊朗武裝快艇在霍爾木茲海峽逼近美籍油輪，重新點燃了美伊緊張局勢升級的疑慮。0730 GMT，布蘭特原油期貨上漲15美分或0.2%，報每桶67.48美元；美國西德克薩斯中質原油上漲28美分或0.4%，報每桶63.49美元。\n\n--全球金市：金價逼近5100美元，因美伊局勢再度緊張\n\n現貨黃金價格在避險需求推動下反彈至接近5,100美元。0813 GMT時，現貨金大漲2.9%至每盎司5,082.94 美元，美國4月交割期金上漲3.4%，至每盎司5,103.50美元。現貨白銀上漲6.1%至每盎司90.34美元。\n\n--金屬期市：滬銅因中國計劃擴大戰略儲備而漲逾3%，但倫銅略跌\n\n上海銅價上漲，投資者對中國計劃擴大戰略儲備作出反應。上海期貨交易所最活躍的銅合約日間交易收盤大漲3.47%，報每噸105,160元（合15,159.29美元）。截至0700GMT，倫敦金屬交易所（LME）指標三個月期銅報每噸13,464.50美元，下跌0.1%。 \n\n注：其他重要財經新聞瀏覽請點選；近日《路透晚報》請點選。(完)",
      "ContentLength": 3190,
      "HasTables": false,
      "ScrapedAt": "2026-02-04 17:42:40"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3Z00L7:0/",
      "Date": "2026-02-04",
      "Time": "16:54:20",
      "Title": "《全球匯市》美元兌歐元小幅走低；日圓在周末選舉前走軟",
      "Content": "周三美元兌歐元小幅走低，因部分政府停擺導致關鍵就業數據延遲發布，加劇了美聯儲政策路徑的不確定性。\n\n 與此同時，在日本國會選舉前夕，日圓兌美元匯率料將連續第四日走低。首相高市早苗正尋求選民支持其增加支出、減稅以及加速國防建設的全新安全戰略。\n\n美元上周五跌漲，因特朗普提名沃什(Kevin Warsh，瓦爾許)擔任美聯儲下任主席，緩解了市場對美聯儲未來政策可能過度鴿派的擔憂。\n\n特朗普周二深夜簽署支出協議法案，結束持續四天的美國政府部分停擺。但受停擺影響，原定周五公布的關鍵就業數據將推遲發布。\n\n德國商業銀行高級外匯分析師Antje Praefcke表示：\"市場已排除美聯儲3月降息的可能性，且僅預期年內可能降息兩次。\"\n\n她補充道：\"因此，唯有勞動力市場數據表現疲軟，才能重新點燃降息預期，並可能再次對美元構成下行壓力--無論沃什是否出任主席。\"\n\n衡量美元兌六種主要貨幣匯率的美元指數 基本持平於97.33。\n\n**強勢歐元成歐洲央行關注焦點**\n\n歐元兌美元 上漲0.13%，報1.1833美元。歐洲央行將於周四召開政策會議，投資者正密切關注任何關於歐元估值可能影響政策路徑的評論。\n\n上周歐元曾觸及1.2084的四年半高點，政策制定者對此表示日益擔憂，警告稱歐元快速升值可能拖低通脹，而當前物價漲幅已低於歐洲央行2%的目標。\n\n 歐洲央行副總裁德金多斯去年夏天曾表示，歐元兌美元匯率在1.20水平尚可接受，但若突破該水平則可能變得複雜。\n\n分析師指出，近期歐元兌美元匯率幾乎完全由美元人氣驅動，而利率差異因素則退居次要地位。\n\n英鎊兌美元匯率 上漲0.2%至1.3727美元，英國央行將於周四召開會議。市場普遍預期兩家央行均將維持利率不變。\n\n**日本大選成焦點**\n\n 周三日圓 兌美元 下跌0.44%，報156.43，創1月23日以來最低水平。此前因市場猜測紐約聯儲在進行匯率詢價，意味著可能干預日圓，日圓一度從159.23大漲。\n\n澳洲聯邦銀行(CBA)貨幣策略師Carol Kong表示：\"自民黨若表現強勁，將使高市早苗更有底氣推進預算刺激計劃，這可能推升政府債務負擔風險，對日本公債和日圓構成壓力。\"\n\n高市早苗本周早些時候在競選演講中宣揚日圓貶值的益處，引發一波日圓拋售。儘管她隨後收回相關言論，但市場仍擔憂首相釋放的矛盾信號，可能損害支撐疲軟日圓的努力。\n\n澳元兌美元匯率 上漲0.2%至0.7039美元，上日因澳洲央行加息而飆升1%。\n\n與此同時，在中國央行更強勁的指引價支撐下，人民幣兌美元匯率一度觸及近33個月高點，儘管央行設定的中間價低於預期、且投資者認為這是當局為抑制人民幣升值所作的努力。\n\n人民幣 在強勁出口推動下持續走強，儘管分析師認為當局將阻止人民幣進一步升值，但風險仍傾向於上行，或將考驗中國脆弱的經濟。\n\n[表格內容]\n 紐約 當日 今年來 2025年 最新報價 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1830 1.1818 +0.10 +0.72 1.1745 美元/日圓 156.46 155.73 +0.47 -0.12 156.65 歐元/日圓 185.11 184.07 +0.57 + 0.61 183.99 美元/瑞郎 0.7757 0.7749 +0.10 -2.10 0.7923 英鎊/美元 1.3727 1.3697 +0.22 +1.89 1.3473 美元/加元 1.3634 1.3640 -0.04 -0.66 1.3724 美元/離岸人民幣 6.9341 6.9337 +0.01 -0.59 6.9756 澳元/美元 0.7033 0.7022 +0.16 +5.41 0.6672 新西蘭元/美元 0.6043 0.6045 -0.03 +4.99 0.5756 歐元/瑞郎 0.9177 0.9159 +0.20 -1.41 0.9308 歐元/英鎊 0.8616 0.8626 -0.12 -1.14 0.8715 歐元/瑞典克朗 10.5382 10.5218 +0.16 -2.48 10.8061 美元/挪威克朗 9.6289 9.6084 +0.21 -4.27 10.0588 美元指數 97.368 97.437 -0.07 -0.97 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1980,
      "HasTables": false,
      "ScrapedAt": "2026-02-04 17:42:46"
    },
    {
      "Source": "TradingView - Reuters Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YZ0RJ:0/",
      "Date": "2026-02-04",
      "Time": "16:00:02",
      "Title": "台灣債市：指標10年債收創同年券殖利率近半年新高，關注明日標債結果",
      "Content": "台灣指標10年公債115/3期 (A15103=TWO)發行前交易殖利率周三微收升；交易員稱，因明天此期券標售在即，加以外部環境不佳，市場適度拉高利率，致殖利率略收高；但全天僅成交0.5億台幣，後續仍須觀察標債結果。 \n\n而五年券115/1期 (A15101=TWO)今日于處所成交殖利率則成交在1.33%，大致持穩於上日水準；他們指出，因台灣去年經濟表現亮眼，近期開始有台灣央行不排除升息的聲音出來，且近期利率交換市場（IRS）利率走高，稍稍影響市場氛圍；但因第一季普遍有補券需求，利率上檔空間有限，不過，往下追價意願亦不強。\n\n“10年券（殖利率）收上來，但只有一支（0.5億台幣），感覺有人的確是想要把（殖利率）變高，想要讓大家（標債時）寫高一點。”一大型商銀交易員說，“五年券115/1期（殖利率）成交在1.33%。”\n\n一大型銀行交易員則表示，因台灣去年經濟表現優異，近期市場開始有人在討論央行可能升息等議題，且最近外部環境氣氛不佳，促殖利率略走升。\n\n“好像開始有人在說台灣會不會升息？但不是很普遍的討論。”她說，“還是有（補券）需求在啦，但目前看起來利率往下機率不大，沒有積極追價的條件。”\n\n他們指出，因10年券明天標售在即，今天市場適度拉高利率，希望標債利率可以稍微標高一點；不過，因第一季整體市場補券力道不弱，且以殖利率水準仍有養空間，短線應不脫區間格局。\n\n今日10年券115/3期殖利率收在1.43%，此前收盤高位在2025年7月10日收在1.44%。\n\n台灣央行周四將代財政部標售10年券115/3期，金額暫定350億台幣，並於10日發行。\n\n交易員預估，明日五年增額公債115/1R期殖利率交易區間在1.32-1.34%，而10年債115/3期殖利率交易區間則在1.42-1.44%。 \n\n[表格內容]\n 收盤價 漲跌幅 報價 區間 成交值 年期 期別 (基點) (億台幣) 10 115/3 (A15103=TWO) +0.85 1.4300% 1.4300-*1.4300% 0.50 \n *創該期券發行前交易以來新高。\n\n 今日電子盤各期指標券收盤情形：\n\n[表格內容]\n 30 114/11 (A14111=TWO) 沒有成交 20 115/4 (A15104=TWO) 沒有成交 10 115/3 (A15103=TWO) 1.4300% 5 115/1 (A15101=TWO) 沒有成交 2 115/2 (A15102=TWO) 沒有成交 \n（完）",
      "ContentLength": 1045,
      "HasTables": false,
      "ScrapedAt": "2026-02-04 16:42:40"
    },
    {
      "Source": "TradingView - Reuters Stocks",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YZ0NM:0/",
      "Date": "2026-02-04",
      "Time": "14:50:19",
      "Title": "台灣股市：開低震盪收小紅且連二日收高，因長假在即短線量縮震盪整理",
      "Content": "台灣股市周三開低震盪收小紅且連二日收高。分析師稱，受美股收跌、台積電ADR 收跌影響，台股開低走低；但非電子股接棒反彈，帶動指數走高，電子股則未續漲壓抑指數表現，且市場追價意願不足，終場上漲94.45點作收，短線將呈震盪整理走勢。\n\n台灣加權指數 TWSE:TAIEX收漲0.29%報32,289.81點；今日成交初值 (.TTOV.TW)為6,853.98億台幣，上日修正後為8,215.74億。\n\n“受美股收低、台積電ADR收跌影響，台積電 跟著開低。”兆豐國際投顧副總經理黃國偉說，“不過，台塑 、南亞 和中鋼 傳產龍頭股上漲，帶動指數收小漲...接下來成交量將進一步縮減，大盤以盤待變。”\n\n他並稱，台股今日雖收漲，惟反彈力道變弱，且上漲者集中在傳統產業，代表最會推升指數的股票都不漲，接下來除非美股衝高，否則隨著長假在即，加上美、伊地緣政治不確定因素，台股漲幅將不會像那麼大，後續關注美股谷歌母公司Alphabet和亞馬遜等財報表現。\n\n華南投顧分析師蘇見文則表示，台股今天似乎沒有受到美股AI軟體服務個股表現影響，上漲家數逾900家、家數近八成，電子股成交比重亦高達82%，顯示市場主流依舊為AI概念股，且上市櫃公司陸續公布營收，南亞科 因營收不錯，促股價收高，惟因指數位階相對較高，短線大盤料呈箱型整理格局。\n\n“台股月線還是偏多、呈上升趨勢，經過這次測試後月線相對有支撐。”他說，“在連續三根黑K後，兩根紅K止穩，台股長多格局，短線則呈區間震盪。”\n\n他們指出，因距離農曆封關日僅剩五個交易日，且國際上潛在美、伊地緣政治不確定因素，長假前追價意願低，台股長線看多，短線料呈量縮整理走勢。\n\n周三亞洲新興市場股市走勢謹慎，投資者紛紛撤離人工智能（AI）股，但韓國股市在汽車和電池製造商股價上漲的推動下創下歷史新高。\n\n美國股市周二大幅收跌，投資者擔憂人工智能將加劇軟件製造商的競爭壓力，在谷歌母公司Alphabet和亞馬遜本周晚些時候發布季度財報前保持警惕。\n\n今日科技類股指數 (.TELI)小幅收漲0.04%，大型權值股--台積電 收低0.83%；而台塑、南亞和中鋼等傳產股龍頭則全面收高，分別收漲4.23%、6.3%及1.45%。\n\n分析師預估，明日台股指數區間在32,100-32,500點。（完） \n\n[表格內容]\n**查閱相關新聞或頁面，請點選下列代碼連結**** 美國股市 一周展望 歐洲股市報導 日本股市報導 中港股市報導 中國股市報導 台灣股市報導 股市簡訊 納斯達克最活躍個股 (.AV.O) 紐約證交所最活躍個股 (.AV.N) 納斯達克漲幅居前個股 (.PG.O) 紐約證交所漲幅居前個股 (.PG.N) 納斯達克跌幅居前個股 (.PL.O) 紐約證交所跌幅居前個股 (.PL.N) 標普主要分類指數 (0#.GSPMAJOR) 英股富時指數 CURRENCYCOM:UK100 德股DAX指數 法股CAC-40指數 韓國股市已並入韓國金融市場報導中，相關稿件請點選",
      "ContentLength": 1252,
      "HasTables": false,
      "ScrapedAt": "2026-02-04 15:42:40"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3Z00DP:0/",
      "Date": "2026-02-04",
      "Time": "14:20:19",
      "Title": "《全球匯市》美元持穩因投資者保持謹慎；日圓在周末大選前走弱",
      "Content": "周三美元持穩，美國政府部分停擺迅速落幕後，投資者仍保持謹慎；日圓徘徊於兩周低點附近，日本周末將舉行全國大選，結果難料。\n\n匯市仍在消化特朗普提名沃什(Kevin Warsh，瓦爾許)擔任美聯儲下任主席的消息，市場預期沃什不太可能推動快速降息，美元全面走強。\n\n沃什的任命緩解市場對美聯儲獨立性的擔憂，讓投資者鬆了一口氣。此前特朗普不斷抨擊美聯儲及現任主席鮑威爾。\n\n歐元 小幅走強至1.1834美元，英鎊 持穩於1.3715美元。市場靜待周四歐洲央行和英國央行政策會議，兩家央行均料維持利率不變。\n\n衡量美元兌六種主要貨幣匯率的美元指數 報97.33，與周一觸及的97.73一周高點相差無幾。美元指數去年下跌9.4%，今年1月再跌1%。\n\n大華銀行（UOB）策略師指出，在沃什就任前的過渡期，市場波動性可能持續居高不下。他們在周三的報告中表示：\"即將展開的國會確認程序或將充滿戲劇性，這一過程恐怕不會一帆風順。\"\n\n特朗普周二深夜簽署支出協議法案，結束持續四天的美國政府部分停擺。但受停擺影響，原定周五公布的關鍵就業數據將推遲發布。\n\n**聚焦日本大選**\n\n 周三日圓兌美元匯率 下跌0.3%，報156.26，創1月23日以來新低。此前因市場猜測紐約聯儲在進行匯率詢價，意味著可能干預日圓，日圓一度從159.23大漲。\n\n 美日聯合干預推高日圓的可能性已使日圓普遍脫離崩盤邊緣，不過日本周末大選前，日圓的命運仍懸而未決。\n\n在此次全國選舉中，首相高市早苗正尋求選民支持其擴大支出、減稅及一項新的安全戰略計劃，該戰略預計將加速國防建設。\n\n澳洲聯邦銀行(CBA)貨幣策略師Carol Kong表示：\"自民黨若表現強勁，將使高市早苗更有底氣推進預算刺激計劃，這可能推升政府債務負擔風險，對日本公債和日圓構成壓力。\"\n\n高市早苗本周早些時候在競選演講中宣揚日圓貶值的益處，引發一波日圓拋售。儘管她隨後收回相關言論，但市場仍擔憂首相釋放的矛盾信號，可能損害支撐疲軟日圓的努力。\n\n澳元 報0.7028美元，此前澳洲央行加息令市場預估年內將有必要進一步加息，澳元上一交易日曾飆升1%。新西蘭元 小幅下跌至0.604美元。\n\n與此同時，在中國央行更強勁的指引價支撐下，人民幣兌美元匯率一度觸及近33個月高點，儘管央行設定的中間價低於預期、且投資者認為這是當局為抑制人民幣升值所作的努力。 \n\n人民幣/美元 在出口強勁推動下持續走升。儘管分析師認為當局將抑制人民幣進一步升值，但風險仍傾向於上行，或將考驗中國脆弱的經濟。\n\n[表格內容]\n 最新報價 紐約 當日 今年來 2025年 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1833 1.1818 +0.13 +0.75 1.1745 美元/日圓 156.2800 155.73 +0.35 -0.24 156.65 歐元/日圓 184.95 184.07 +0.48 +0.52 183.99 美元/瑞郎 0.7748 0.7749 -0.01 -2.21 0.7923 英鎊/美元 1.3717 1.3697 +0.15 +1.81 1.3473 美元/加元 1.3633 1.3640 -0.05 -0.66 1.3724 美元/離岸人民幣 6.9328 6.9337 -0.01 -0.61 6.9756 澳元/美元 0.7029 0.7022 +0.10 +5.35 0.6672 新西蘭元/美元 0.6041 0.6045 -0.07 +4.95 0.5756 澳元/日圓 109.840 109.310 +0.48 +5.07 104.540 新西蘭元/日圓 93.700 93.700 0.00 +3.32 90.690 英鎊/日圓 214.35 213.25 +0.52 +1.58 211.02 澳元/新西蘭元 1.1632 1.1615 +0.15 +0.41 1.1585 美元指數 97.327 97.437 -0.11 -1.01 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1858,
      "HasTables": false,
      "ScrapedAt": "2026-02-04 14:42:43"
    },
    {
      "Source": "TradingView - Reuters Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YZ0E8:0/",
      "Date": "2026-02-04",
      "Time": "10:54:03",
      "Title": "台灣債市：指標10年債早盤暫無成交，標債前買盤應會進駐惟波幅不大",
      "Content": "台灣指標10年公債115/3期 (A15103=TWO)發行前交易周三早盤暫無成交。惟交易員稱，隨著美債殖利率略收低，且依過往經驗來看，標債前投資盤會稍微建立一些部位，短線仍有機會成交，但波動幅度不大。\n\n他們指出，因近期亞洲債市氣氛不佳，且市場對於第二季發債量有所顧忌，心態上較偏保守，往下追價意願低，致交投續偏冷，短線關注外部環境變化及10年券標債結果。\n\n“今天還是有機會成交，明天要標債了，標債前有投資盤會先收，但量不大，因為大家還是喜歡從初級拿進來。”一大型證券商交易員說，“現在買賣盤對利率都比較堅持，買盤不想追低，賣盤也不急著賣。”\n\n一大型商銀交易員表示，近日盤面上都有小量成交，但利率變動不大，交易盤也沒有特別熱絡，主要是市場對於第二季發債量有些顧忌，致殖利率沒有明顯往下。\n\n他們認為，亞洲債市氣氛雖不佳，但以目前的殖利率水準來看，仍有養券空間，賣盤因而不急著出脫，加以美債殖利率未脫區間盤整格局，台債又沒有特別的題材，短線殖利率波動幅度不大，觀察重點在明日的10年券標售結果。\n\n指標10年期美國公債收益率 周二收跌1個基點，至4.268%。\n\n台灣央行將於周四代財政部標售10年券115/3期，金額暫定350億台幣，並於10日發行。\n\n本地時間10:48，五年期增額公債115/1R期 (A15101R=TWO)及10年券115/3期發行前交易電子盤均未成交，台股 TWSE:TAIEX則上漲0.23%。 \n\n交易員預估，今日五年債115/1R期殖利率交易區間在1.32-1.35%；10年債115/3期殖利率區間則在1.42-1.43%。（完）\n\n最新相關報導鏈接：\n\n--美國債市：收益率下跌，交易員評估沃什領導下美聯儲潛在政策轉變",
      "ContentLength": 730,
      "HasTables": false,
      "ScrapedAt": "2026-02-04 11:42:42"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3Z006T:0/",
      "Date": "2026-02-04",
      "Time": "10:28:23",
      "Title": "台灣匯市：台幣早盤遊走平盤附近，國際美元走弱外資略偏匯入",
      "Content": "台幣兌美元 周三早盤遊走平盤附近，未見明確方向。匯銀人士表示，國際美元下挫，但台股 TWSE:TAIEX小升，外資略為偏向匯入。台幣早盤主要在平盤附近窄幅波動，成交不興。\n\n匯銀人士指出，早盤見到部分外資拋匯，出口商則亦有拋售美元，但量能都不大，成交偏向清淡。而央行短期似有守住31.7的價位的企圖。\n\n“外資這兩天一天買，一天賣，...氣氛很亂啊！”一位中大型商銀交易人士說。\n\n他也表示，近期台幣貶至31.700附近，央行就積極表態，“好像驚醒一樣，所以現在可以維持動態平衡。”\n\n另外一位大型匯銀人士則說，早盤除外資略匯入之外，出口商亦有進場拋匯推升台幣。不過上午交易區間仍偏窄，交投不算熱絡。\n\n本地時間10:15，台幣兌美元維持平盤、仍報31.570，交易區間在31.555-31.639；台股 TWSE:TAIEX則漲0.28%。 \n\n在海外無本金交割遠期外匯市場(NDF)方面，目前指標一個月期美元/台幣換匯點 (TWDNDF=)由小幅折價再轉為溢價；一個月美元/台幣遠匯 (TWD1MNDFOR=)報31.579/31.615，上日收在31.573。 \n\n交易員預估，今日台幣兌美元匯率主要交易區間在31.550-31.620。（完）\n\n最新相關報導鏈接：\n\n--《全球匯市》美元指數下跌，近期漲勢失去動能",
      "ContentLength": 561,
      "HasTables": false,
      "ScrapedAt": "2026-02-04 10:42:39"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3Z004V:0/",
      "Date": "2026-02-04",
      "Time": "10:27:02",
      "Title": "《全球匯市》美元持穩，日圓在周末大選前走弱",
      "Content": "周三美元持穩，美國政府部分停擺迅速落幕後，投資者仍保持謹慎；日圓徘徊於兩周低點附近，日本周末將舉行全國大選，結果難料。\n\n匯市仍在消化特朗普提名沃什(Kevin Warsh，瓦爾許)擔任美聯儲下任主席的消息，市場預期沃什不太可能推動快速降息，美元全面走強。\n\n沃什的任命緩解市場對美聯儲獨立性的擔憂，讓投資者鬆了一口氣。此前特朗普不斷抨擊美聯儲及現任主席鮑威爾。\n\n歐元 早盤報1.1814美元，英鎊 報1.3693美元，在周四歐洲央行和英國央行政策會議前保持平穩。市場普遍預期兩家央行將維持利率不變。\n\n美元指數 報97.43，與周一觸及的97.73一周高點相差無幾。美元指數去年下跌9.4%，今年1月再跌1%。\n\nMFS投資管理公司策略師認為，沃什在利率制定方面屬於務實派的決策者。\n\n他們在周三的報告中指出：\"如果沃什未來推進縮表計劃，最終可能推高長期利率。但與此同時，其任命或將導致通脹風險溢價下降。\"\n\n特朗普周二深夜簽署支出協議法案，結束持續四天的美國政府部分停擺。但受停擺影響，原定周五公布的關鍵就業數據將推遲發布。\n\n**聚焦日本大選**\n\n周三日圓兌美元 小幅走軟至156.06，逼近1月23日來低點。此前因市場猜測紐約聯儲在進行匯率詢價，意味著可能干預日圓，日圓一度從159.23大漲。\n\n美日聯合干預推高日圓的可能性已使日圓普遍脫離崩盤邊緣，不過日本周末大選前，日圓的命運仍懸而未決。\n\n在此次全國選舉中，首相高市早苗正尋求選民支持其擴大支出、減稅及一項新的安全戰略計劃，該戰略預計將加速國防建設。\n\n澳洲聯邦銀行(CBA)貨幣策略師Carol Kong表示：\"自民黨若表現強勁，將使高市早苗更有底氣推進預算刺激計劃，這可能推升政府債務負擔風險，對日本公債和日圓構成壓力。\"\n\n高市早苗本周早些時候在競選演講中宣揚日圓貶值的益處，引發一波日圓拋售。儘管她隨後收回相關言論，但市場仍擔憂首相釋放的矛盾信號，可能損害支撐疲軟日圓的努力。\n\n澳元 報0.7028美元，此前澳洲央行加息令市場預估年內將有必要進一步加息，澳元上一交易日曾飆升1%。新西蘭元 小跌至0.604美元。\n\n[表格內容]\n 最新報價 紐約 當日 今年來 2025年 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1826 1.1818 +0.07 +0.69 1.1745 美元/日圓 156.1100 155.73 +0.24 -0.34 156.65 歐元/日圓 184.65 184.07 +0.32 +0.36 183.99 美元/瑞郎 0.7756 0.7749 +0.09 -2.11 0.7923 英鎊/美元 1.3705 1.3697 +0.06 +1.72 1.3473 美元/加元 1.3634 1.3640 -0.04 -0.66 1.3724 美元/離岸人民幣 6.9311 6.9337 -0.04 -0.64 6.9756 澳元/美元 0.7028 0.7022 +0.10 +5.35 0.6672 新西蘭元/美元 0.6041 0.6045 -0.07 +4.95 0.5756 澳元/日圓 109.660 109.310 +0.32 +4.90 104.540 新西蘭元/日圓 93.700 93.700 0.00 +3.32 90.690 英鎊/日圓 214.00 213.25 +0.32 +1.38 211.02 澳元/新西蘭元 1.1628 1.1615 +0.11 +0.37 1.1585 美元指數 97.364 97.437 -0.07 -0.97 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1700,
      "HasTables": false,
      "ScrapedAt": "2026-02-04 10:42:43"
    },
    {
      "Source": "TradingView - Reuters Brief",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YZ1GZ:0/",
      "Date": "2026-02-04",
      "Time": "07:09:14",
      "Title": "《路透早報》--2月4日",
      "Content": "一周全球重要經濟數據和事件預告：\n\n簡體： https://tmsnrt.rs/4rq6zw3\n\n繁體： https://tmsnrt.rs/467jWJa\n\n以下為2月3日下午5:00至2月4日早上7:00的重大新聞與市場摘要：\n\n--特朗普簽署支出法案，結束政府四天停擺\n\n美國總統特朗普周二簽署了一項支出協議，結束了美國政府部分停擺，並為議員們爭取時間，就可能對其移民嚴打政策設限進行談判。該法案恢復了國防、醫療、勞工、教育、住房等機構已中斷的撥款，並將對國土安全部的撥款臨時延長至2月13日。這些機構的撥款於上周六到期，目前政府服務尚未出現重大中斷。\n\n--美內政部長：約30國希望加入關鍵礦產俱樂部，以降低對華依賴\n\n美國內政部長柏根在一次會議上表示，約30個國家希望加入一個由盟友與夥伴組成、以關鍵礦產貿易為目標的俱樂部，以降低對中國的依賴。同時擔任美國國家能源主導委員會負責人的柏根表示，日本、澳洲和韓國等國已加入該俱樂部，\"我們計劃本周再宣布多達11項此類協議。\"柏根稱，另有近20個國家對加入該俱樂部表現出\"強烈興趣\"。他稱，該俱樂部將實行免關稅的貿易與交流，並為礦產品設定價格下限。\n\n--美聯儲巴爾金：難以預測生產率提升的趨勢能持續多久\n\n里奇蒙聯邦儲備銀行總裁巴爾金表示，生產率提升正在幫助企業緩解成本壓力，從而助力美聯儲抗擊通脹，但難以預測這種趨勢能否持續，因而難以判斷貨幣政策應如何應對。此番發言凸顯出，這一問題很可能成為未來政策辯論的一個核心議題。巴爾金表示，他認同生產率提升結合持續的放鬆管制和減稅政策，即使在通脹改善的情況下也能提振經濟。他還預計2026年經濟將保持韌性，來自放鬆管制和減稅的\"顯著刺激\"將提供支持，企業也表示對持續的需求抱有信心。\n\n*美聯儲理事米蘭接受福克斯商業頻道採訪時，繼續為今年實施激進降息的必要性辯護，並預計今年降息幅度可能超過一個百分點。\n\n--中國今年中央一號文件發布，聚焦農業科技、耕地保護和農民增收機制\n\n中國新華社周二受權發布2026年中央一號文件。文件提出，2026年要錨定農業農村現代化，以推進鄉村全面振興為總抓手，提高強農惠農富農政策效能，守牢國家糧食安全底線，持續鞏固拓展脫貧攻堅成果。\n\n--中國和烏拉圭發布聯合聲明稱，雙方一致同意深化中烏全面戰略夥伴關係，不斷密切往來，拓展合作新領域，提升雙邊關係水平。烏方重申其技術中立原則，認可中國企業參與烏拉圭5G網絡建設。雙方強調希早日開啟中國同南方共同市場自貿協定談判。\n\n--歐盟執委會表示，已收到中國商務部針對歐盟乳製品擬徵收反補貼關稅的最終計算結果，並稱徵收此類關稅的最後期限為2月21日。歐洲兩個行業協會上周表示，中國對歐盟乳製品的反補貼調查已經結束，中方下調對部分歐盟乳製品擬徵關稅。歐盟執委會拒絕就乳製品擬議稅率置評，並強調關稅尚未最終確定。中國商務部未回應就反補貼調查進展置評的請求。\n\n--美國貿易代表格里爾表示，特朗普政府正著手將周一宣布的美印貿易協議細節落實到書面文件中。該協議將把印度針對美國工業品的關稅從13.5%降至零，同時取消部分關稅，但允許印度保留一些農產品進口保護措施。格里爾確認，鑒於印度對美貿易順差的規模及增速，協議將把美國對大多數印度商品的關稅從50%降至18%。\n\n--法國財長萊斯庫爾表示，若必要，法國將把外匯市場波動納入七國集團（G7）財長會議議程。作為本屆G7主席國，法國正推動採取行動應對其所謂的日益惡化的全球經濟失衡問題。\n\n--Nvidia首席執行官黃仁勳受訪時表示，公司將考慮參與OpenAI的下一輪融資，並支持該初創企業未來的首次公開發行(IPO)。針對近期有關該交易陷入停滯的報導，黃仁勳表示，Nvidia投資OpenAI的計劃仍在推進。這家芯片製造商去年9月曾宣布計劃向OpenAI投資高達1,000億美元。\n\n--針對巴拿馬法院撤銷長和的港口運營合同判決，中國港澳辦周二晚間表示，有關裁決屈從霸權、為虎作倀，“可恥可悲”。該裁決罔顧事實、背信棄義，嚴重損害企業合法權益，中國政府堅定維護中國企業正當合法權益，對霸權霸凌行徑絕不會坐視不理。\n\n--中國商務部稱，副部長李成鋼日前在會見羅技公司首席執行官（CEO）法貝爾時表示，中國將進一步擴大高水平對外開放， 持續釋放消費潛力，為外資企業帶來更多發展機遇。\n\n--中國央行發布的中央銀行各項工具流動性投放情況表格顯示，1月抵押補充貸款（PSL）淨投放1,744億元人民幣；當月其他結構性貨幣政策工具淨投放641億元；當月央行國債買賣操作淨投放1,000億元，環比去年12月倍增。\n\n--獨家：政府官員向路透展示的文件顯示，美國財政部周二頒布新許可證，授權向委內瑞拉供應美國稀釋劑。這是委內瑞拉用於生產可出口原油等級的關鍵燃料。\n\n--伊朗要求更改與美國會談的地點並將議題限定為核問題\n\n一位消息人士表示，伊朗要求將本周與美國會談的地點改為阿曼而非土耳其，並將議題範圍縮小至僅限於核問題的雙邊會談，這引發了對會談能否按計劃推進的質疑。“他們想改變形式，也想改變範圍，“一位了解伊朗要求的地區外交官表示。\"他們只想與美國人討論核問題，而美國則希望將其他議題納入談判，例如（彈道）導彈及伊朗在該地區代理人的活動。\"白宮新聞秘書萊維特表示，與伊朗的會談仍定於本周晚些時候舉行。\n\n*美國軍方擊落一架伊朗無人機，稱這架\"沙赫德-139\"無人機\"在阿拉伯海意圖不明\"地飛向林肯號航母。伊朗常駐聯合國代表團拒絕置評。該消息傳出後，油價上漲逾1美元。\n\n*據海事消息來源和一家安全咨詢公司透露，一隊伊朗武裝快艇在霍爾木茲海峽試圖逼停美籍油輪未遂。\n\n*橋水基金創辦人達利歐表示，若伊朗出現政權更迭將使得中東地區更有利於投資。\n\n--烏克蘭總統澤連斯基表示，在俄羅斯隔夜對烏克蘭能源設施發動襲擊、並動用了創紀錄數量的彈道導彈後，烏方談判團隊的工作將作出調整。\n\n--俄羅斯總統普京與沙特王儲穆罕默德通電話，克里姆林宮表示雙方同意在政治、經濟、貿易和人道主義領域深化合作。克宮聲明稱，兩國領導人還討論了在OPEC+框架內共同工作的進展，以及維護全球能源市場穩定的努力。\n\n*克里姆林宮另表示，尚未聽到印度方面關於停止購買俄羅斯石油的聲明，莫斯科方面計劃繼續發展與新德里的戰略夥伴關係。\n\n--市場消息人士援引美國石油協會(API)公布的數據顯示，上周美國原油庫存減少1,108萬桶，汽油庫存增加474萬桶，而餾分油庫存減少481萬桶。\n\n--超微半導體公司（AMD）預計其第一季營收將小幅下降，儘管其面向中國的人工智能芯片銷售意外帶來提振。這引發了外界質疑：該公司是否具備足夠的供應鏈實力，在快速成長的人工智能市場中挑戰Nvidia。AMD股價在盤後交易中下跌逾5%。\n\n[市場摘要]\n\n股市：\n\n--美國股市周二大幅收跌，投資者擔憂人工智能將加劇軟件製造商的競爭壓力，在谷歌母公司Alphabet和亞馬遜本周晚些時候發布季度財報前保持警惕。標普500指數下跌0.84%，收報6,917.81點。納斯達克指數下跌1.43%，收報23,255.19點；道瓊斯工業指數下跌0.34%，收報49,240.99點。\n\n--歐洲股市小幅攀升，再創收盤紀錄新高，軟件和廣告類企業遭急劇拋售，抵消了大宗商品相關股上漲的影響。泛歐STOXX 600指數收報617.93點，微漲0.1%。英國富時100指數收低0.26%。德國DAX指數微跌0.07%。法國CAC-40指數微降0.02%。\n\n匯市：\n\n--美元兌除日圓外的多數主要貨幣下跌，交易員整固此前在美國向好數據及預期美聯儲鴿派立場弱化推動下的漲幅，同時對美國政府再次停擺的擔憂打擊情緒。美元指數下跌0.12%，報97.42，此前兩日上漲1.5%。歐元兌美元上漲0.21%，報1.1815美元。澳元兌美元上漲0.89%，至0.7009美元。美元兌日圓紐約盤尾報155.77日圓，上漲0.11%。 \n\n債市：\n\n--美國公債收益率下跌，交易員們評估在沃什領導下美聯儲政策可能出現的轉變，以及政府部分停擺導致美國經濟數據延遲發布的情況。兩年期公債收益率下跌0.2個基點，至3.568%。指標10年期美國公債收益率下跌1個基點，至4.268%。\n\n--歐元區公債收益率上升，追隨美國公債走勢，市場評估被提名為下一任美聯儲主席的沃什可能如何影響美聯儲的政策路徑。歐元區指標德國10年期公債收益率上漲2.6個基點至2.89%。德國兩年期公債收益率上漲1個基點至2.1%。\n\n油市：\n\n--油價上漲約2%，此前美國擊落了一架逼近其航空母艦的伊朗無人機，同時武裝快艇在霍爾木茲海峽逼近一艘懸掛美國國旗的船隻，這加劇了市場對旨在緩和美伊緊張局勢的談判可能受擾的擔憂。布蘭特原油期貨上漲1.03美元，漲幅1.6%，結算價報每桶67.33美元；美國原油期貨上漲1.07美元，漲幅1.7%，結算價報每桶63.21美元。\n\n金屬：\n\n--金價強勁反彈，創2008年11月以來最大單日漲幅，基本面堅挺之際，低吸買盤者紛紛入場。現貨金收漲6%，至每盎司4,938.5美元。4月交割的美國黃金期貨收漲6.1%，結算價報每盎司4,935美元。\n\n--銅價反彈，此前有消息稱中國計劃增加銅儲備，與此同時，全球投資者風險偏好回升。1715GMT，倫敦金屬交易所（LME）指標三個月期銅上漲4.1%，報每噸13,418美元。上海期貨交易所最活躍的銅合約上漲2.6%，收報每噸104,500元（15,066美元）。\n\n[今日看點]\n\n重要經濟數據(GMT時間)：\n\n--日本1月標普全球綜合及服務業PMI終值(0030)\n\n--中國1月RatingDog服務業PMI(0145)\n\n--法國(0850)、德國(0855)、歐元區(0900)1月HCOB服務業和綜合PMI終值\n\n--英國1月標普全球服務業和綜合PMI終值(0930)\n\n--歐元區1月消費者物價調和指數(HICP)初值、12月生產者物價指數(PPI)(1000)\n\n--美國1月ADP民間就業崗位(1315)\n\n--美國1月標普全球服務業和綜合PMI終值(1445)\n\n--美國1月ISM非製造業指數(1500)\n\n--韓國1月外匯儲備(2100)\n\n重大經濟事件及官員講話(GMT時間)：\n\n--中國十四屆全國人大常委會第二十次會議\n\n--美國斡旋的烏克蘭與俄羅斯新一輪三方會談(至2月5日)\n\n--澳洲央行助理總裁瓊斯參加爐邊談話(0500)\n\n--瑞典央行執行委員會會議(0800)；公布2026年1月28日貨幣政策會議記錄(0830)\n\n--歐洲央行管理委員會召開貨幣政策會議（至2月5日）\n\n--美國里奇蒙聯邦儲備銀行總裁巴爾金在艾肯扶輪社經濟研討會發表演說(1700)\n\n--美聯儲理事庫克將在邁阿密經濟俱樂部就貨幣政策與經濟前景發表演說(2330)\n\n注：其他重要財經新聞瀏覽請點選；近日《路透早報》請點選。(完)",
      "ContentLength": 4505,
      "HasTables": false,
      "ScrapedAt": "2026-02-04 07:42:40"
    },
    {
      "Source": "TradingView - Reuters Stocks",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YZ1FT:0/",
      "Date": "2026-02-04",
      "Time": "06:00:09",
      "Title": "美國股市：大幅收跌，AI擔憂打壓軟件板塊",
      "Content": "美國股市周二大幅收跌，投資者擔憂人工智能將加劇軟件製造商的競爭壓力，在谷歌母公司Alphabet和亞馬遜本周晚些時候發布季度財報前保持警惕。\n\n人工智能巨頭Nvidia 和微軟 股價均下跌近3%。Alphabet (GOOGL) 在周三財報發布前下跌1.2%，亞馬遜 在周四財報發布前下跌1.8%。\n\n近幾個月來，投資者對人工智能相關股票變得更加挑剔，他們希望看到企業能從對新技術的大規模投資中獲得可衡量的回報。\n\n周二華爾街的關注焦點轉向可能因人工智能面臨更激烈競爭和利潤率下降的科技公司。Anthropic為其Claude人工智能聊天機器人推出法律工具成為引發擔憂的催化劑之一。\n\nB. Riley Wealth首席市場策略師Art Hogan表示：\"我們正密切關注眾多軟件公司，這些企業可能在人工智能發展浪潮中遭受衝擊。目前各領域軟件公司普遍面臨壓力。\"\n\nSalesforce (CRM.O)、Datadog 和Adobe 股價下跌約7%，新思科技 和Atlassian 跌幅達8%，Intuit 暴跌11%。\n\n人工智能數據公司Palantir 逆勢上揚，在周一晚間公布強勁季度業績後上漲近7%。\n\n標普500軟件與服務指數 (.SPLRCIS) 下跌3.8%，連續第五個交易日走低。\n\nAllspring Global Investments高級投資組合經理John Campbell表示：\"當前市場估值偏高，預期值過高。許多領域，特別是人工智能領域，其估值已將完美預期納入考量。這使得市場環境變得異常敏感。\"\n\n醫療股承壓，因減肥藥Wegovy製造商諾和諾德警告年度銷售額將大幅下滑。該公司美國上市股票 暴跌近15%。\n\n競爭對手禮來 下跌3.9%，肥胖症藥物製造商Structure Therapeutics 則下跌6.75%。\n\n 沃爾瑪 股價上漲約3%，成為首家市值突破萬億美元的實體零售商。\n\nAMD 在盤後公布季度報告前下跌1.7%。\n\n標普500指數下跌0.84%，收報6,917.81點。納斯達克指數下跌1.43%，收報23,255.19點；道瓊斯工業指數下跌0.34%，收報49,240.99點。\n\n周二下跌使標普500指數2026年累計漲幅收窄至約1%，納指基本持平。\n\n美國股市成交量激增，各交易所累計成交235億股，遠超此前20個交易日的日均成交量196億股。\n\n標普500指數11個板塊中有六個下跌，其中信息技術板塊 領跌，下跌2.17%，其次是通信服務板塊 下跌1.28%。\n\n**財報洪流**\n\n標普500指數成分股企業四分之一將於本周公布季度業績，倫敦證券交易所集團(LSEG)數據顯示，分析師預計企業12月當季盈利將增長近11%，高於1月初預測的約9%。\n\n輝瑞 股價下跌3.3%，儘管其第四季度利潤超預期；默克 在公布季度業績後上漲2.2%。\n\n 百事公司 宣布對樂事和多力多滋等核心品牌降價後，股價上漲4.9%。\n\n政府部分停擺導致原定周二的JOLTS報告及周五的關鍵就業數據推遲公布。\n\n標普500指數成分股中，有81只創52周新高，28只創新低；納斯達克指數中，有202只創52周新高，311只創新低。(完)\n\n[表格內容]\n****查閱相關新聞或頁面，請點選下列代碼連結**** 美國股市 一周展望 歐洲股市報導 日本股市報導 中港股市報導 中國股市報導 台灣股市報導 股市簡訊 納斯達克最活躍個股 (.AV.O) 紐約證交所最活躍個股 (.AV.N) 納斯達克漲幅居前個股 (.PG.O) 紐約證交所漲幅居前個股 (.PG.N) 納斯達克跌幅居前個股 (.PL.O) 紐約證交所跌幅居前個股 (.PL.N) 標普主要分類指數 (0#.GSPMAJOR) 英股富時指數 CURRENCYCOM:UK100 德股DAX指數 法股CAC-40指數 韓國股市已並入韓國金融市場報導中，相關稿件請點選",
      "ContentLength": 1624,
      "HasTables": false,
      "ScrapedAt": "2026-02-04 06:42:42"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YZ1F9:0/",
      "Date": "2026-02-04",
      "Time": "05:49:29",
      "Title": "《全球匯市》美元指數下跌，近期漲勢失去動能",
      "Content": "美元周二兌除日圓外的多數主要貨幣下跌，交易員整固此前在美國向好數據及對美聯儲立場趨於不那麼鴿派的預期推動下的漲幅，同時，對美國政府再次停擺的擔憂打擊情緒。\n\n美國眾議院周二批準了一項旨在結束政府部分停擺的兩黨協議。\n\n隨著沃什(Kevin Warsh，瓦爾許)獲提名為下一任美聯儲主席，美元近幾日持續趨強，市場普遍預期他相較其他候選人更可能不會急於推動快速降息。\n\n投資者此前期待周二的職位空缺數據及本周稍晚的1月就業報告能為美國經濟前景及降息可能性提供更明確信號，但因政府部分停擺，這些數據發布均被推遲。\n\n 道富高級全球市場策略師Marvin Loh表示：“市場確實存在某種反美元、反美國公債的主題，我認為當前交易正圍繞這一主題展開。\"他隨後指出，市場略趨避險，美元未能吸引到避險買盤。\n\n美元指數 下跌0.12%，報97.42，此前兩日上漲1.5%。歐元兌美元 上漲0.21%，報1.1815美元。\n\n**仍預計美聯儲將降息**\n\n里奇蒙聯儲總裁巴爾金周二表示，美聯儲迄今為止的降息舉措有助於確保就業市場的健康，同時美聯儲正努力完成讓通脹回歸2%目標的“最後一英里”。\n\n巴爾金還表示，生產率提升正在幫助企業緩解成本壓力，從而助力美聯儲抗擊通脹，但難以預測這種趨勢能否持續，因而難以判斷貨幣政策應如何應對。\n\n美國製造業數據重現增長態勢。美國供應管理協會(ISM)周一公布，上月製造業PMI回升至52.6，創2022年8月來新高。\n\n其他方面，隨著美國與印度達成貿易協議並宣布將重啟與伊朗的核談判，地緣政治緊張局勢有所緩和。\n\n**澳元急升**\n\n澳洲央行兩年來首次加息，將指標利率上調25個基點至3.85%，澳元應聲大漲。央行同時對通脹發出警告，引發市場押注今年至少還將再加息一次。\n\n澳元兌美元 上漲0.89%，至0.7009美元。澳元兌日圓 一度升至1990年以來最高，紐約盤尾報109.31日圓，漲幅逾1.5% 。\n\n歐洲央行與英國央行本周四會議均料維持政策利率不變。市場將密切關注歐洲央行是否會暗示近期歐元走強可能影響未來政策路徑。\n\n本周稍晚，日本眾議院選舉將成關注焦點。\n\n在2月8日大選之前，投資者拋售日圓和日本政府債券，因預期若首相高市早苗贏得強有力的授權，自民黨將給予她擴大刺激政策的空間。\n\n上周日本政策制定者暗示將與美國採取協調行動捍衛日圓後，日圓獲得喘息機會。\n\n美元兌日圓 紐約盤尾報155.77日圓，上漲0.11% ，但仍低於1月中旬觸及的159.45的一年半最高。\n\n日本財務大臣片山皋月周二為高市早苗強調日圓貶值益處的發言辯護，稱首相所提到的是“教科書上的基本概念”。\n\n加密貨幣市場，比特幣 一度跌至2024年11月以來最低，紐約盤尾報74,880.91美元，跌幅4.55%；以太幣 下跌6.01%，報2,199.90美元。（完）\n\n[表格內容]\n****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1389,
      "HasTables": false,
      "ScrapedAt": "2026-02-04 06:42:45"
    },
    {
      "Source": "TradingView - Reuters Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YZ1DR:0/",
      "Date": "2026-02-04",
      "Time": "05:10:17",
      "Title": "美國債市：收益率下跌，交易員評估沃什領導下美聯儲潛在政策轉變",
      "Content": "美國公債收益率周二下跌，交易員們評估在沃什（Kevin Warsh，瓦爾許）領導下美聯儲政策可能出現的轉變，以及政府部分停擺導致美國經濟數據延遲發布的情況。\n\n特朗普總統上周五提名沃什在鮑威爾任期於5月結束後接替他出任美聯儲主席。沃什早年在美聯儲任職時以通脹鷹派著稱，但如今主張降息。\n\nGlenmede投資策略與研究主管Jason Pride預計，美聯儲今年可能兩次降息、每次25個基點，這一預期已基本被市場消化。與此同時，由於市場認為沃什可能尋求縮減美聯儲資產負債表規模，收益率曲線可能趨陡。\n\n沃什曾指出美聯儲龐大的資產持有量扭曲了經濟中的金融體系。他去年11月在《華爾街日報》一篇評論文章中寫道：\"美聯儲為在過往危機時期支持大型企業而設計的膨脹的資產負債表，完全可以大幅縮減。\"\n\nPride指出，沃什\"一直強烈反對過度使用美聯儲資產負債表\"。同時\"他對短債的看法與美聯儲迄今政策高度一致，甚至可能略顯鴿派\"。\n\n兩年期公債收益率 (US2YT=RR) 下跌0.2個基點，至3.568%。指標10年期美國公債收益率 下跌1個基點，至4.268%。\n\n兩年/10年期公債收益率差 (US2US10=TWEB) 收窄約0.5個基點至69.5個基點，周一觸及72.7個基點的4月以來最闊。\n\n周二股市出現大幅拋售被認為可能提振了對美國公債的避險需求。\n\n不過，富瑞首席美國經濟學家Thomas Simons指出，近月部分市場關聯性已然瓦解，使得特定資產類別受影響因素更難精準定位，同時貴金屬等市場亦呈現極端波動。\n\n他表示：\"由於各種因素相互交織，市場似乎難以判斷當前是否存在廣泛的避險情緒或避險基調。\"\n\n經濟數據改善已推動市場將對美聯儲下次降息的預期推遲至6月，但若勞動力市場急劇放緩，降息押注可能再度提前。\n\n因政府部分停擺，原定於周五公布的備受關注的1月就業報告將推遲發布。\n\n美國眾議院周二以微弱多數通過了一項兩黨協議，該協議將結束美國政府部分停擺狀態，並已提交給特朗普簽署生效。\n\n里奇蒙聯邦儲備銀行總裁巴爾金周二表示，生產率提升正在幫助企業緩解成本壓力，從而助力美聯儲抗擊通脹，但難以預測這種趨勢能否持續，因而難以判斷貨幣政策應如何應對。\n\n與此同時，美聯儲理事米蘭周二在福克斯商業頻道的採訪中，繼續為今年激進降息辯護。\n\n[表格內容]\n21:03 GMT 價格 收益率% 收益率變動 兩年期公債 (US2YT=RR) 99.8671875 3.5696 0 五年期公債 (US5YT=RR) 99.625 3.8332 -0.0020 10年期公債 97.875 4.2675 -0.0100 30年期公債 (US30YT=RR) 95.75 4.8973 -0.0120 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 美國現貨公債 美國指標公債報價 (0#USBMK=) 英國公債市場 歐元區公債市場 日本公債市場 中國債市 台灣債市 歐元區指標公債報價 (0#EUBMK=) 利率或央行相關報導",
      "ContentLength": 1267,
      "HasTables": false,
      "ScrapedAt": "2026-02-04 05:42:44"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YZ0NO:0/",
      "Date": "2026-02-03",
      "Time": "18:23:07",
      "Title": "《全球匯市》美元守住近期漲幅整體持穩；澳洲央行加息推高澳元",
      "Content": "美元周二整體持穩，樂觀的經濟數據和市場對美聯儲政策預期的轉變，蓋過對美國政府再次停擺的擔憂。\n\n衡量美元兌一籃子貨幣的美元指數 基本持平於97.53，此前兩日上漲1.5%。歐元 上漲0.12%，報1.1804美元。\n\n隨著沃什(Kevin Warsh，瓦爾許)獲提名為下一任美聯儲主席，美元近幾日持續走強，因市場普遍預期他相較其他候選人更可能不會急於推動快速降息。\n\n**美聯儲降息預期猶存**\n\n三菱日聯金融集團(MUFG)高級外匯分析師Lee Hardman表示，沃什的提名也表明，美國總統特朗普無意干預美聯儲的政策制定權。但他同時也指出，沃什“至少在初期仍可能支持降息”。\n\n“我們認為，塵埃落定之後，美元將再度走軟。隨著美聯儲降息、而歐洲央行維持利率不變，我們預計歐元/美元今年晚些時候將重新升破 1.20。”\n\n與此同時，美國公布製造業數據重現增長態勢。美國供應管理協會(ISM)周一公布，上月製造業PMI回升至52.6，創2022年8月來新高。\n\n但受聯邦政府部分停擺影響，備受關注的1月就業報告本周將無法發布。\n\n其他方面，隨著美國與印度達成貿易協議，並宣布將重啟與伊朗核談判，地緣政治緊張局勢降溫。\n\n**澳元大幅上漲**\n\n澳洲央行兩年來首次加息，將指標利率上調25個基點至3.85%，澳元應聲大漲。央行同時對通脹發出警告，引發市場押注今年至少還將再加息一次。\n\n澳元兌美元 最新上漲0.96%至0.7014美元。澳元兌日圓 升至1990年以來最高水平，上漲逾1.5%至109.48日圓 。\n\n歐洲央行與英國央行本周四會議均料維持政策利率不變。市場將密切關注歐洲央行是否會暗示近期歐元走強可能影響未來政策路徑。\n\n本周稍晚，日本眾議院選舉將成關注焦點。\n\n在2月8日大選之前，投資者拋售日圓和日本政府債券，因預期若首相高市早苗贏得強有力的授權，自民黨將給予她擴大刺激政策的空間。上周日本政策制定者暗示將與美國採取協調行動捍衛本幣後，日圓獲得喘息機會。\n\n美元兌日圓 最新報155.67日圓，較1月中旬觸及的一年半高點159.45日圓回落。\n\n“本周末選舉結果將成為關鍵，若高市早苗表現強勁，日圓可能再度逼近160關口，”Ebury市場策略主管Matthew Ryan表示。\n\n日本財務大臣片山皋月周二為首相高市早苗強調日圓貶值益處的言論辯護，稱首相所提到的是“教科書上的基本概念”。\n\n加密貨幣方面，比特幣 下跌0.3%至78,211.25美元，以太幣 下跌2.5%至2,281.98美元。\n\n[表格內容]\n 紐約 當日 今年來 2025年 最新報價 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1802 1.1789 +0.11 +0.49 1.1745 美元/日圓 155.72 155.60 +0.08 -0.59 156.65 歐元/日圓 183.78 183.43 +0.19 -0.11 183.99 美元/瑞郎 0.7779 0.7795 -0.21 -1.82 0.7923 英鎊/美元 1.3680 1.3662 +0.13 +1.54 1.3473 美元/加元 1.3678 1.3680 -0.01 -0.34 1.3724 美元/離岸人民幣 6.9345 6.9412 -0.10 -0.59 6.9756 澳元/美元 0.7012 0.6947 +0.94 +5.10 0.6672 新西蘭元/美元 0.6037 0.5998 +0.65 +4.88 0.5756 歐元/瑞郎 0.9181 0.9189 -0.09 -1.36 0.9308 歐元/英鎊 0.8626 0.8626 0.00 -1.02 0.8715 歐元/瑞典克朗 10.5497 10.5712 -0.20 -2.37 10.8061 美元/挪威克朗 9.6807 9.6896 -0.09 -3.76 10.0588 美元指數 97.536 97.632 -0.10 -0.80 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1857,
      "HasTables": false,
      "ScrapedAt": "2026-02-03 18:42:40"
    },
    {
      "Source": "TradingView - Reuters Brief",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YZ07E:0/",
      "Date": "2026-02-03",
      "Time": "17:00:43",
      "Title": "《路透晚報》--2月3日新聞摘要（國際版）",
      "Content": "以下為路透中文新聞為您整理的亞洲市場時段(上午7:00-下午5:00)新聞摘要：\n\n[重大數據或新聞]\n\n--澳洲改變政策方向加息，市場押注5月再次升息\n\n在供給受限的經濟環境下，通脹回落遇阻，澳洲央行周二被迫調整政策方向並上調利率，市場預期年內仍可能需要繼續收緊政策。澳洲央行全票通過將利率上調25個基點至3.85%，這是該央行兩年來的首次加息，距離去年8月降息僅過去六個月。\"我不確定是否已進入（緊縮）周期。這無疑是政策調整，委員會將密切監測（經濟數據），\"澳洲央行總裁布洛克在公布決議後的簡報會上表示。\n\n澳洲央行2月政策會議聲明\n\n--日本財務大臣為首相高市關於日圓貶值益處的言論辯護\n\n日本財務大臣片山皋月為首相高市早苗強調日圓貶值益處的言論辯護，稱首相所提到的是“教科書上的基本概念”。片山在例行記者會上表示：“首相是在泛泛而談日圓貶值對經濟的影響。”她解釋稱，高市“指出日圓貶值雖有負面影響，但也具有積極作用，包括國內投資增加推動企業銷售額增長，以及日本製造產品更易出口海外”。\n\n--特朗普稱墨西哥將停止向古巴出口石油\n\n美國總統特朗普表示，墨西哥將停止向古巴出口石油，凸顯他對古巴的施壓行動升級。\"墨西哥將停止向他們輸送石油，\"特朗普在白宮橢圓形辦公室對記者表示，但未詳細說明其依據。墨西哥方面未立即回應置評請求。\n\n--特朗普表示，共和黨人應該把至少15個未指明地區的投票事務\"全國化\"並且加以\"接管\"，重提對於美國選舉普遍存在舞弊的虛假指控。在與前聯邦調查局副局長Dan Bongino的播客訪談中，特朗普並未透露具體實施細節。特朗普持續錯誤地聲稱2020年敗選是因舞弊所致。\n\n--美國總統特朗普表示，其政府正向哈佛大學求償10億美元。他在Truth Social平台發文稱，\"我們現正求償10億美元，並且未來不想再與哈佛大學有任何牽連。\"但未說明該校造成了何種具體損害。\n\n--法國2026年預算案延宕多時終獲議會通過，投資者迎來政局穩定期\n\n法國終於通過了2026年預算案，因兩項不信任動議均告失敗，使得法案得以通過，也為總理勒科爾尼領導的少數政府帶來一段相對穩定期。由極左與極右陣營提出的兩項不信任動議在社會黨表示不予支持後，最終皆未能取得多數票，從而使已延宕逾一個月的2026年預算案正式獲得通過。\n\n--印度同意從美國購買石油、國防產品和飛機等商品--官員\n\n印度政府官員對路透表示，印度已同意根據一項貿易協議從美國購買石油、國防產品、電子產品、醫藥和電信產品以及飛機。這位不願具名的印度政府官員表示，印度同意購買美國商品以縮小美國對印貿易逆差。印度貿易部未立即回復尋求置評的郵件。 \n\n--烏克蘭總統澤連斯基表示，俄羅斯基本遵守了對烏克蘭能源基礎設施的停火協議。基輔方面正為結束戰爭的下一輪三方會談做準備。澤連斯基表示，過去24小時內俄羅斯未對烏克蘭能源基礎設施實施任何定點導彈或無人機打擊，但俄軍持續炮擊前線附近的能源設施。\n\n據英國金融時報(FT)援引知情人士報導，烏克蘭已與西方夥伴達成共識：若俄羅斯持續違反未來停火協議，歐美將採取協調軍事行動予以回應。路透無法立即核實該報導。\n\n--德國總理默茨表示，歐洲必須在科技領域更加獨立于美國，因為歐洲與這個世界最大經濟體的關係發生變化。\n\n--據數據提供商CoinGlass統計，隨著股票和貴金屬等風險資產遭到拋售，加密貨幣價格暴跌，比特幣投資者近日爆倉25.6億美元。\n\n--美聯儲公布的調查顯示，銀行預計今年各類企業貸款需求將增強，此前上季度需求已有所改善。多數銀行表示，預計利率下降以及支出或投資需求上升將推動這一趨勢。美聯儲季度高級貸款官意見調查顯示，第四季度大中型企業貸款需求達到2022年第二季度以來的最高水平。小型企業貸款需求持平，此前連續三個季度下降。\n\n--韓國央行公布的會議記錄顯示，多數委員繼續對韓元貶值加劇金融市場不穩定性表示擔憂，這預示著該行的寬鬆周期將持續暫停。\n\n--韓國副財長李亨一表示，政府有\"足夠的政策能力\"應對任何外部不確定性。李亨一同時表示，鑒於匯市波動性似乎正在加劇，政府將密切留意金融市場動向。\n\n--據六名現任及前任官員透露，伊朗領導層日益擔憂，美國若發動軍事打擊，可能引發民眾再度上街抗議，從而動搖其對政權的掌控力。四名知情的現任官員透露，在高層會議上，官員們向伊朗最高領導人哈梅內伊匯報稱，民眾對上月鎮壓行動的憤怒已經達到“恐懼不再具有威懾力”的程度。\n\n--2025年日本農林水產品出口額增長12.8%，創歷史新高。儘管美國加徵關稅，但對美出口仍保持強勁增長，同時對華出口從前一年的低迷中反彈。日本農林水產省公布，去年出口總額達1.701萬億日圓（約109億美元），較2024年的1.507萬億日圓顯著增長，實現連續第13年增長並創歷史新高。\n\n--美國財政部未向非洲開發銀行面向低收入國家的基金出資，理由是該基金過於強調氣候變化等議題。美國財政部發言人表示，特朗普政府將繼續要求國際金融機構履行其職責，推動他們關注經濟增長、創造民間就業及減貧。\n\n--知情人士表示，作為衛星公司SpaceX收購人工智能（AI）公司xAI交易的一部分，xAI的投資者將按每持有1股xAI股份，獲得0.1433股SpaceX股份。馬斯克同時擔任SpaceX與xAI的首席執行官。該消息人士補充稱，部分xAI高管也可選擇現金替代SpaceX股票，每股xAI股票可換取75.46美元現金。 \n\n[市場摘要]\n\n--日本股市：日經指數飆升近4%收於歷史高位，貴金屬拋售暫歇\n\n日股日經指數周二攀升近4%，收於歷史新高，扭轉了前一交易日的跌勢。此前貴金屬拋售潮暫歇。日經指數上漲3.92%，收於54,720.66點，創下自10月25日以來的最大單日漲幅。 東證股價指數跳漲3.1%，收於3,645.84點。\n\n--中港股市：滬綜指收漲1.3%創四周最大單日升幅，恆指小幅收高終結兩日大跌\n\n中國股市滬綜指反彈收漲，創四周最大單日升幅，光伏板塊領漲，但兩市成交額縮水至近五周新低。原材料板塊大幅反彈，助力香港恆生指數小幅收高，終結了此前的兩日大跌。滬綜指收升1.3%，至4,067.74點，創1月6日以來最大單日升幅，滬深300指數收漲1.2%。深圳創業板指數收升1.9%，上證科創板50成份指數收漲1.4%。香港恆生指數收高0.2%，報26,834.77點。\n\n--匯市：美元守住漲幅因經濟數據亮麗，澳元在澳洲央行升息後跳漲\n\n美元維持漲勢，樂觀的經濟數據和市場對美聯儲政策預期的轉變，蓋過對美國政府再次停擺的擔憂。0822GMT，美元指數微跌0.1%，報97.46。歐元上漲0.18%至1.1811美元，日圓/美元跌0.05%至155.52。澳元/美元跳漲1.37%至0.7042美元。\n\n--歐元債市：收益率攀升，市場關注沃什領導下的美聯儲政策走向\n\n歐元區政府公債收益率上漲，跟隨美國公債走勢，市場正評估被提名為下一任美聯儲主席的沃什可能如何塑造美聯儲的政策軌跡。德國10年期公債收益率上漲1個基點至2.88%。德國兩年期公債收益率持平於2.09%。\n\n--國際油市：油價下跌，因美伊局勢可能緩和且美元走強\n\n油價下跌，連續第二日回落，因市場參與者權衡美伊緊張局勢緩和的可能，而美元走強則對油價構成更大下行壓力。0623 GMT，布蘭特原油期貨下跌34美分，跌幅0.5%，報每桶65.96美元；美國西德克薩斯中質油報每桶61.81美元，下跌32美分，跌幅0.5%。\n\n--全球金市：金價在兩日暴跌後反彈，將創2008年以來最大單日漲幅\n\n金價勁升逾 5%，向2008年11月以來最大單日漲幅邁進；白銀也同步跳升，顯示貴金屬在經歷數十年最劇烈的兩日跌勢後強勢反彈。0818 GMT時，現貨金上漲 5.8%，報每盎司 4,935.56 美元。美國4月交割的期金上漲 6.6%，報每盎司 4,958.50 美元。白銀價格上漲10%至每盎司87.40美元。\n\n--金屬期市：銅價在大幅回調後企穩，因供應擔憂持續存在\n\n銅價止跌回升，此前兩個交易日下挫。供應擔憂與需求前景為其提供了支撐。上海期貨交易所最活躍的銅合約日盤收漲2.60%，報每噸104,500元（合15,066.54美元）。0715GMT，倫敦金屬交易所（LME）指標三個月期銅上漲4.08%，報每噸13,417美元。 \n\n注：其他重要財經新聞瀏覽請點選；近日《路透晚報》請點選。(完)",
      "ContentLength": 3480,
      "HasTables": false,
      "ScrapedAt": "2026-02-03 17:42:40"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YZ0JM:0/",
      "Date": "2026-02-03",
      "Time": "16:58:57",
      "Title": "台灣匯市：台幣量縮收小升終止連三貶，台股強彈帶動外資回頭匯入",
      "Content": "台幣兌美元 周二由早盤的走貶轉收小升，終止連三貶，成交量縮。匯銀人士稱，台股 TWSE:TAIEX隨美股反彈，外資回頭買超台股，且在午後有積極的匯入，至於出口商也有拋匯，令台幣收升。 \n\n匯銀人士表示，原本上午外商銀以雙向操作為主，但早上美元買盤後繼無力，且午後外資轉為匯入，出口商也有拋匯意願，台幣因此由貶轉收升，終止先前連三日收貶。\n\n“主要還是需求面引導匯市的波動，而且出口商也願意在31.500以上拋匯，”一位大型匯銀人士表示。\n\n他也說，若是台幣價位維持目前水位附近，農曆年前出口商的拋匯力道應會持續，令台幣在窄幅區間盤整。至於美元若逢低，料也有來自壽險的（美元）買盤，限制美元跌勢。\n\n另外一位中型金控旗下匯銀人士則表示，午後以外商銀拋匯為主，至於出口商則因目前價格不錯，且時間愈來愈接近農曆年節，因此有更大的拋匯意願。\n\n“至於央行下午在31.560這附近在承接美元，”該交易員說。\n\n台灣股市周二量縮收漲1.81%，終止連三日收黑。外資及陸資在台股轉為買超72.68億台幣，三大法人買超110.10億台幣。\n\n國際美元周二維持漲勢，樂觀的經濟數據和市場對美聯儲政策預期的轉變，蓋過對美國政府再次停擺的擔憂。\n\n在海外無本金交割遠期外匯市場(NDF)方面，目前指標一個月期美元/台幣換匯點 (TWDNDF=)由溢價轉為小幅折價；一個月美元/台幣遠匯 (TWD1MNDFOR=)報31.532/31.552，上日收在31.619。\n\n交易員預估，明日台幣兌美元主要交易區間在31.520-31.620。\n\n[表格內容]\n16:00 台幣/美元報價 上日收盤 波動區間 開盤價 成交量(億美元) 上日成交量 (億美元) 台北外匯經紀公司 (TAIFX1) 31.570 31.590 31.552-31.626 31.610 14.28 21.03 元太外匯經紀公司 31.568 31.600 31.558-31.627 31.610 7.015 11.495 \n\n[表格內容]\n無本金交割遠期外匯(NDF) (TWDNDF=) 最新報價 上日現貨收盤時水準 美元/台幣一個月期 -0.006/-0.001 0.037/0.042 美元/台幣六個月期 -0.110/-0.105 -0.049/-0.044 \n（完）",
      "ContentLength": 964,
      "HasTables": false,
      "ScrapedAt": "2026-02-03 17:42:44"
    },
    {
      "Source": "TradingView - Reuters Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YY0LL:0/",
      "Date": "2026-02-03",
      "Time": "16:17:57",
      "Title": "台灣債市：指標10年債殖利率微幅收低，投資盤補券需求並關注美債表現",
      "Content": "台灣指標10年公債115/3期 (A15103=TWO)發行前交易殖利率周二略收低；交易員表示，儘管美債殖利率收升，惟台債標債前有固定買盤進駐，促殖利率微幅下滑，但交投續偏冷，後續關注美債表現。\n\n他們指出，時值進入年初，投資盤普遍有補券需求，且這期10年券標售在即，近日大型公股銀行于1.42%附近陸續進場建立部位，且力道較預期強勁。\n\n“標債前有些人想拿一些籌碼、有固定的買賣需求，補券力道比想像中大一些，而且不是小咖（小型銀行），很難忽略它的存在。”一大型證券商交易員說，“年初有些部位到期，（補券需求者）不想全部在標債時拿，就在最近的位子稍微去拿一些。”\n\n他表示，因近年台債市場均偏空，部分大型公股銀行過去一、兩年比較少碰台債，惟其在沉寂一段時間後，最近一、兩個月開始進場，動作雖不大但是有規律的買進，帶動殖利率略下滑，不過，短線下檔空間應有限。\n\n他認為，近來國際債市及利率交換市場（IRS）利率均走高，對台債雖然會有影響，惟排序上不是很重要，“IRS每天都瘋瘋癲癲，但牽引的力道都很薄弱，整體來看，還是要等標債結果出來。”\n\n一大型商銀交易員亦稱，今日10年券殖利率略收低，主要是來自投資盤的補券需求，但未出現積極的買盤，由於“大部隊”沒有出來，利率不太會有大幅往下的機會，後續觀察重點在10年券標債結果及第二季發債 量是否加大。\n\n“第二季發債量應該會加大，（10年券殖利率）目前就在1.42%，短線不會再上去。”他說。\n\n冷券市場方面，交易員表示，今日五年券114/4期 (A14104=TWO)殖利率尾盤成交在1.33%，較上日的1.321% 及早盤的1.325%均為高；而存續期間約九年的10年券 (A13110=TWO)殖利率成交在1.39%；另長端的20年券114/9期 (A14109=TWO)殖利率則成交在1.52%，大致持穩於近期水準。\n\n“長券端大部分人買進就不會賣出來，因為是投資盤。”一大型銀行交易員說，“但外在環境太偏空了，澳洲央行升息利率有被帶上來。”\n\n他們指出，因距離農曆年封關只剩下六個交易日，封關前很難擺脫交投冷清格局；後續須關注美債表現，因近日美債波動幅度加大，應留意是否突破4.2-4.3%區間，倘若突破4.3%大關，技術面即較偏空。\n\n台灣央行周四將代財政部標售10年券115/3期，金額暫定350億台幣，並於10日發行。\n\n交易員預估，明日五年增額公債115/1R期殖利率交易區間在1.31-1.33%，而10年債115/3期殖利率交易區間則在1.42-1.43%。 \n\n[表格內容]\n 收盤價 漲跌幅 報價 區間 成交值 年期 期別 (基點) (億台幣) 10 115/3 (A15103=TWO) -0.15 1.4215% 1.4215-1.4215% 1.50 \n 今日電子盤各期指標券收盤情形：\n\n[表格內容]\n 30 114/11 (A14111=TWO) 沒有成交 20 115/4 (A15104=TWO) 沒有成交 10 115/3 (A15103=TWO) 1.4215% 5 115/1 (A15101=TWO) 沒有成交 2 115/2 (A15102=TWO) 沒有成交 \n（完）",
      "ContentLength": 1332,
      "HasTables": false,
      "ScrapedAt": "2026-02-03 16:42:41"
    },
    {
      "Source": "TradingView - Reuters Stocks",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YY0JP:0/",
      "Date": "2026-02-03",
      "Time": "14:44:21",
      "Title": "台灣股市：量縮收漲1.81%終止連三日收黑，多頭架構仍在短線料呈高檔震盪",
      "Content": "台灣股市周二量縮收漲1.81%，終止連三日收黑。分析師表示，隨美股止跌反彈、台積電ADR 收高，台股跟著開高震盪收高且突破10日線（32,056點），短線料呈高檔震盪走勢並關注美股表現。\n\n台灣加權指數 TWSE:TAIEX收漲1.81%至點32,195.36點；今日成交初值 (.TTOV.TW)為7,949.9億台幣，上日修正後為7,714.19億。\n\n“今天主要還是美股（收漲），加上台積電ADR收高，帶動指數開高走漲，整體來看，台股系統性風險不大。”元富投顧分析師姜光宇說，“昨天大跌來到月線（31,470點）後止即跌反彈，代表大盤在月線有支撐，而且，國際股市普遍沒有跌破月線，例如日本和韓國股市，台股不太可能自己跌。”\n\n他解釋，先前導致致股市下跌的因素已經和緩，例如：美、伊已在建立談判框架、輝達與OpenAI合作的雜音消除及美聯儲主席新任人選沃什（Kevin Warsh，瓦爾許）立場偏鷹的議題此時還言之過早，加上台股上日下跌碰到月線時即反彈，台股多頭架構還沒有被破壞，亦無明顯的系統性風險。\n\n國泰證期顧問處分析師蔡明翰表示，在美股收漲、台積電ADR收高帶動下，台股今日由台積電領軍止跌反彈，惟隨著農曆年關將近，再過六個交易日即封關，且依過往經驗，封關前量能將縮減，短線將呈量縮高檔震盪走勢。\n\n“最近波動比較大，短線維持高檔震盪，昨天指數在回測月線後反彈，目前看起來下檔在月線有撐。”他說，“其實，一年回測月線的次數不多，除了去年11月有跌破並稍微回測季線外，因為AI獲利還是有成長。”\n\n他們指出，就長線來看，台股多頭架構尚未被破壞，且以上日回測月線隨即反彈，加上今日突破10日線觀察，台股整體架構還算強勁；惟隨封關漸近大盤震盪難免，短線指數料32,000點附近高檔震盪。\n\n今日科技類股指數 (.TELI)收漲2.14%，大型權值股--台積電 收高1.98%；聯發科 和鴻海 分別收漲5.28%及0.93%；金融保險類股指數 (.TFNI)收升0.74%。\n\n分析師預估，明日台股指數區間在32,000-32,400點。（完） \n\n[表格內容]\n**查閱相關新聞或頁面，請點選下列代碼連結**** 美國股市 一周展望 歐洲股市報導 日本股市報導 中港股市報導 中國股市報導 台灣股市報導 股市簡訊 納斯達克最活躍個股 (.AV.O) 紐約證交所最活躍個股 (.AV.N) 納斯達克漲幅居前個股 (.PG.O) 紐約證交所漲幅居前個股 (.PG.N) 納斯達克跌幅居前個股 (.PL.O) 紐約證交所跌幅居前個股 (.PL.N) 標普主要分類指數 (0#.GSPMAJOR) 英股富時指數 CURRENCYCOM:UK100 德股DAX指數 法股CAC-40指數 韓國股市已並入韓國金融市場報導中，相關稿件請點選",
      "ContentLength": 1166,
      "HasTables": false,
      "ScrapedAt": "2026-02-03 15:42:41"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YZ0EP:0/",
      "Date": "2026-02-03",
      "Time": "14:40:11",
      "Title": "《全球匯市》美元守住漲幅因經濟數據亮麗，澳元在澳洲央行升息後跳漲",
      "Content": "美元周二維持漲勢，樂觀的經濟數據和市場對美聯儲政策預期的轉變，蓋過對美國政府再次停擺的擔憂。\n\n衡量美元兌一籃子貨幣的美元指數 微跌0.1%，報97.46，此前兩日上漲1.5%。歐元 上漲0.2%至1.1808美元，日圓/美元 小幅攀升0.1%至155.43。\n\n澳元在澳洲央行兩年內首次加息後大幅上漲。日圓在連續兩日下跌後保持穩定，此前日本財務大臣片山皋月試圖淡化首相高市早苗對日圓貶值益處的言論。\n\n沃什(Kevin Warsh，瓦爾許)獲提名為下一任美聯儲主席，加上美國公布製造業數據重現增長態勢，帶動隔夜美元續漲。華府僵局將導致周五關鍵就業報告推遲發布，但隨著美國與印度達成貿易協議，並宣布將重啟與伊朗核談判，地緣政治緊張局勢降溫。\n\nCapital.com高級市場分析師Kyle Rodda在關於美國製造業數據的報告中寫道：\"此一動態提振市場對美國經濟增長題材正在擴展的希望。該數據也提振美元，延續特朗普提名沃什後周五展開的反彈。\"\n\n自特朗普提名沃什為下一任美聯儲主席之後，美元持續走強。分析師認為，相較於此前其他候選人，沃什比較不可能推動全面快速降息。\n\n特朗普周一宣布與印度達成貿易協議，將大幅削減印度商品關稅，作為交換條件，印度需停止購買俄羅斯石油並降低貿易壁壘。地緣政治方面，伊朗與美國將於周五在土耳其重啟核談判，特朗普警告稱若未能達成協議，可能引發不好的後果。\n\n澳洲國民銀行外匯策略師Rodrigo Catril在播客節目中表示，\"印度的消息很有意思，但真正的關鍵在於美伊緊張局勢似乎正在緩和，特朗普總統施加的所有壓力和威脅，已經促使伊朗回到談判桌前，\"\n\n美國供應管理協會(ISM)周一公布，上月製造業PMI回升至52.6，創2022年8月來新高。但因聯邦政府部分停擺，備受關注的1月就業報告本周將無法發布。\n\n澳洲央行將指標利率上調25個基點至3.85%，在去年三次降息後重啟加息周期。央行對通脹的警告引發市場押注今年至少還會再加息一次，澳元匯率因此大幅走高。\n\n歐洲央行和英國央行周四將公布最新利率決議，預計都將按兵不動。\n\n澳元/美元 跳漲0.9%至0.7007美元， 澳元兌日圓 上漲1.1%至108.85日圓，逼近歷史高位。新西蘭元 升值0.6%至0.6033美元，英鎊 上漲0.2%至1.3693美元。\n\n在2月8日大選之前，投資者拋售日圓和日本政府債券，因預期若首相高市早苗贏得強有力的授權，自民黨將給予她擴大刺激政策的空間。上周日本政策制定者暗示將與美國採取協調行動捍衛本幣後，日圓獲得喘息機會。\n\nEbury市場策略主管Matthew Ryan表示：\"本周末選舉結果將成為關鍵，若高市早苗表現強勁，日圓可能重返160關口。值得關注的是，這是否足以觸發日本實質外匯儲備的拋售，畢竟口頭干預往往僅具短期效果。\"\n\n日本財務大臣片山皋月周二為首相高市早苗強調日圓貶值益處的言論辯護，稱首相所提到的是“教科書上的基本概念”。\n\n加密貨幣方面，比特幣 下跌0.6%至77,955.57美元，以太幣 下跌1.8%至2,300.74美元。\n\n[表格內容]\n 最新報價 紐約 當日 今年來 2025年 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1814 1.1789 +0.21 +0.59 1.1745 美元/日圓 155.4100 155.60 -0.12 -0.79 156.65 歐元/日圓 183.62 183.43 +0.10 -0.20 183.99 美元/瑞郎 0.7777 0.7795 -0.23 -1.84 0.7923 英鎊/美元 1.3697 1.3662 +0.26 +1.66 1.3473 美元/加元 1.3655 1.3680 -0.18 -0.50 1.3724 美元/離岸人民幣 6.9351 6.9412 -0.09 -0.58 6.9756 澳元/美元 0.7018 0.6947 +1.02 +5.19 0.6672 新西蘭元/美元 0.6041 0.5998 +0.72 +4.95 0.5756 澳元/日圓 109.010 107.630 +1.28 +4.28 104.540 新西蘭元/日圓 93.700 92.930 +0.83 +3.32 90.690 英鎊/日圓 212.83 212.55 +0.14 +0.86 211.02 澳元/新西蘭元 1.1610 1.1576 +0.29 +0.22 1.1585 美元指數 97.409 97.632 -0.23 -0.93 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 2089,
      "HasTables": false,
      "ScrapedAt": "2026-02-03 14:42:45"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YZ08P:0/",
      "Date": "2026-02-03",
      "Time": "12:11:30",
      "Title": "《全球匯市》美元守住漲幅因經濟數據亮麗，澳元在澳洲央行升息後上揚",
      "Content": "美元周二維持漲勢，樂觀的經濟數據和市場對美聯儲政策預期的轉變，蓋過對美國政府再次停擺的擔憂。\n\n澳元在澳洲央行一如預期升息後走高，本周有三家主要央行公布決議，由澳洲央行打頭陣。日圓在日本關鍵選舉前數日持續走低，此前日本財務大臣片山皋月試圖淡化首相高市早苗對日圓貶值益處的言論。\n\n沃什(Kevin Warsh，瓦爾許)獲提名為下一任美聯儲主席，加上美國公布製造業數據重現增長態勢，帶動隔夜美元續漲。華府僵局將導致周五關鍵就業報告推遲發布，但隨著美國與印度達成貿易協議，並宣布將重啟與伊朗核談判，地緣政治緊張局勢降溫。\n\nCapital.com高級市場分析師Kyle Rodda在關於美國製造業數據的報告中寫道：\"此一動態提振市場對美國經濟增長題材正在擴展的希望。該數據也提振美元，延續特朗普提名沃什後周五展開的反彈。\"\n\n美元指數 在連續兩日上漲後基本持平於97.51。歐元 上漲0.1%至1.1802美元，日圓 上漲0.1%至155.47。\n\n自特朗普提名沃什為下一任美聯儲主席之後，美元持續走強。分析師認為，相較於此前其他候選人，沃什比較不可能推動全面快速降息。\n\n特朗普周一宣布與印度達成貿易協議，將大幅削減印度商品關稅，作為交換條件，印度需停止購買俄羅斯石油並降低貿易壁壘。地緣政治方面，伊朗與美國將於周五在土耳其重啟核談判，特朗普警告稱若未能達成協議，可能引發不好的後果。\n\n澳洲國民銀行貨幣策略師Rodrigo Catril在播客節目中表示，\"印度的消息很有意思，但真正的關鍵在於美伊緊張局勢似乎正在緩和，特朗普總統施加的所有壓力和威脅，已經促使伊朗回到談判桌前，\"\n\n美國供應管理協會(ISM)周一公布，上月製造業PMI回升至52.6，創2022年8月來新高。但因聯邦政府部分停擺，備受關注的1月就業報告本周將無法發布。\n\n澳洲央行周二上調指標利率，在去年三次降息後重啟加息周期。歐洲央行和英國央行周四將公布最新利率決議，預計都將按兵不動。\n\n澳元 上漲0.7%至0.6992美元。新西蘭元 升值0.3%至0.6017美元，英鎊 上漲0.1%至1.3678美元。\n\n在2月8日大選之前，投資者拋售日圓和日本政府債券，因預期若首相高市早苗贏得強有力的授權，自民黨將給予她擴大刺激政策的空間。上周日本政策制定者暗示將與美國採取協調行動捍衛本幣後，日圓獲得喘息機會。\n\nEbury市場策略主管Matthew Ryan表示：\"本周末選舉結果將成為關鍵，若高市早苗表現強勁，日圓可能重返160關口。值得關注的是，這是否足以觸發日本實質外匯儲備的拋售，畢竟口頭干預往往僅具短期效果。\"\n\n日本財務大臣片山皋月周二為首相高市早苗強調日圓貶值益處的言論辯護，稱首相所提到的是“教科書上的基本概念”。\n\n加密貨幣方面，比特幣 下跌0.3%至78,222.76美元，以太幣 下跌1.2%至2,313.24美元。\n\n[表格內容]\n 最新報價 紐約 當日 今年來 2025年 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1812 1.1789 +0.20 +0.57 1.1745 美元/日圓 155.4600 155.60 -0.09 -0.76 156.65 歐元/日圓 183.66 183.43 +0.13 -0.18 183.99 美元/瑞郎 0.7781 0.7795 -0.18 -1.79 0.7923 英鎊/美元 1.3683 1.3662 +0.18 +1.58 1.3473 美元/加元 1.3655 1.3680 -0.18 -0.50 1.3724 美元/離岸人民幣 6.9351 6.9412 -0.09 -0.58 6.9756 澳元/美元 0.7025 0.6947 +1.14 +5.31 0.6672 新西蘭元/美元 0.6037 0.5998 +0.67 +4.90 0.5756 澳元/日圓 109.200 107.630 +1.46 +4.46 104.540 新西蘭元/日圓 92.930 92.930 0.00 +2.47 90.690 英鎊/日圓 212.76 212.55 +0.10 +0.82 211.02 澳元/新西蘭元 1.1634 1.1576 +0.50 +0.42 1.1585 美元指數 97.440 97.632 -0.20 -0.90 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 2006,
      "HasTables": false,
      "ScrapedAt": "2026-02-03 12:42:40"
    },
    {
      "Source": "TradingView - Reuters Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YY0K8:0/",
      "Date": "2026-02-03",
      "Time": "11:03:23",
      "Title": "台灣債市：指標10年債殖利率早盤略下滑，因投資盤有補券需求少量建立部位",
      "Content": "台灣指標10年公債115/3期 (A15103=TWO)發行前交易周二早盤殖利率微幅下滑。交易員表示，美債殖利率雖收升，惟台債因投資盤有補券需求，少量建立部位，促殖利率略走低；不過，五年期債冷券 (A14104=TWO)殖利率則往上成交。\n\n他們指出，由於美債殖利率走高，且包括日、韓等亞洲債市氣氛均不佳，台債難以獨善其身，早盤10年券殖利率雖略下滑，但尾盤不排除有機會小幅收升。\n\n“10年券（殖利率）往下成交了，但還沒收盤，尾盤才能見真章。”一大型商銀交易員說，“台債就是淺碟啦，有補券需求的人多少還是會拿一點。”\n\n其並稱，因第二季發債量目前仍存不確定性，惟年初投資盤大多有補券需求，且以目前10年券殖利率在1.42%來看，收益率“還可以”，吸引投資盤小量建立部位；但在冷門券方面，隨著美債殖利率收高，五年券114/4期早盤殖利率往上成交在1.325%，略高於上日的1.321%。\n\n一大型證券商交易員表示，因近期外部環境不好，加以ISM稱美國製造業採購經理人指數（PMI）1月反彈至52.6，顯示美國經濟狀況良好，美聯儲短期內不太可能進一步降息，而且，即使將來新任主席沃什（Kevin Warsh，瓦爾許）上任也不太可能獨排眾議力主降息，屆時市場恐怕更為紊亂。\n\n他們指出，近來國際債市氣氛不佳，台債不太可能走自己的路，加上台灣央行短期內降息機率低，台債殖利率有望將跟隨國際債市殖利率略為走升，後續則關注周四的10年券標債結果。\n\n美國指標10年期公債收益率 周一收漲3.2個基點至4.273%。\n\n台灣央行將於周四代財政部標售10年券115/3期，金額暫定350億台幣，並於10日發行。\n\n本地時間10:53，10年券115/3期發行前交易電子盤殖利率下跌0.15基點報1.4215%，成交1億台幣；台股 TWSE:TAIEX則上漲1.1%。 \n\n交易員預估，今日五年債115/1R期殖利率交易區間在1.31-1.34%；10年債115/3期殖利率區間則在1.42-1.43%。（完）\n\n最新相關報導鏈接：\n\n--美國債市：公債收益率攀升，市場評估美聯儲主席提名人沃什的政策立場\n\n--《綜述》美國製造業一年來首次擴張，但仍擔心貿易政策不確定性",
      "ContentLength": 927,
      "HasTables": false,
      "ScrapedAt": "2026-02-03 11:42:40"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YZ02H:0/",
      "Date": "2026-02-03",
      "Time": "10:45:25",
      "Title": "台灣匯市：台幣早盤小幅走貶遊走窄幅區間，外資雙向操作略偏匯入",
      "Content": "台幣兌美元 周二早盤小幅走貶。交易員表示，台股 TWSE:TAIEX大漲，外資雖是雙向操作，但略有偏向匯入。早盤的台幣交易區間相對窄縮，台幣雖一度由貶轉升，但隨後又再偏貶，顯示買賣勢力膠著。\n\n匯銀人士表示，早盤台幣在平盤附近遊走，交易區間偏窄縮。至於上日外資在股市大賣台股逾四百億台幣，早盤亦還有一些隔日的美元買單需要處理。\n\n“外資兩個方向都有，交易區間相當窄縮，”一位大型民營匯銀人士說。 \n\n但另外一位大型匯銀人士則表示，台股大漲，今早外資以偏向匯入為主，至於政府基金則有美元買盤出籠。\n\n本地時間10:34，台幣兌美元貶2.8分報31.618，交易區間在31.575-31.618；台股 TWSE:TAIEX則漲1.08%。 \n\n在海外無本金交割遠期外匯市場(NDF)方面，目前指標一個月期美元/台幣換匯點 (TWDNDF=)自溢價再轉為折價；一個月美元/台幣遠匯 (TWD1MNDFOR=)報31.660/31.673，上日收在31.619。 \n\n美元兌主要貨幣周一全線上漲，貴金屬拋售引發避險情緒，與此同時，投資者權衡沃什(Kevin Warsh，瓦爾許) 領導下的美聯儲可能呈現的政策面貌。\n\n交易員預估，今日台幣兌美元匯率主要交易區間在31.530-31.660。（完）\n\n最新相關報導鏈接：\n\n--《全球匯市》美元攀升，受助于避險資金流和強勁的美國數據",
      "ContentLength": 586,
      "HasTables": false,
      "ScrapedAt": "2026-02-03 11:42:43"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YZ02U:0/",
      "Date": "2026-02-03",
      "Time": "09:22:34",
      "Title": "《全球匯市》美元維持漲勢，受助於樂觀經濟數據與美聯儲政策預期",
      "Content": "美元周二維持漲勢，樂觀的經濟數據和市場對美聯儲政策預期的轉變，蓋過對美國政府再次停擺的擔憂。\n\n澳元上漲，各界預期澳洲央行料將升息，本周將有三家主要央行公布決議，由澳洲央行打頭陣。日圓走低，此前日本財務大臣片山皋月試圖淡化首相高市早苗對日圓貶值益處的言論。\n\n美國供應管理協會(ISM)製造業數據表明經濟重回增長軌道，推動隔夜美元走強，但政府停擺可能導致關鍵就業報告推遲發布。隨著美國與印度達成貿易協議，並宣布將重啟與伊朗的核談判，地緣政治緊張局勢緩解。\n\n\"美國國內經濟情勢也為美元提供支撐，尤其是ISM數據遠超預期的好表現，\"澳洲國民銀行貨幣策略師Rodrigo Catril在播客節目中表示。\n\n\"印度的消息很有意思，但真正的關鍵在於美伊緊張局勢似乎正在緩和，特朗普總統施加的所有壓力和威脅，已經促使伊朗回到談判桌前，\"他補充道。\n\n美元指數 在連續兩日上漲後基本持平於97.50。歐元 上漲0.1%至1.1804美元，日圓/美元 下跌0.1%至155.53。\n\n自美國總統特朗普提名沃什(Kevin Warsh，瓦爾許)為下一任美聯儲主席之後，美元持續走強。分析師認為，相較於此前其他候選人，沃什比較不可能推動全面快速降息。\n\n特朗普周一宣布與印度達成貿易協議，將大幅削減印度商品關稅，作為交換條件，印度需停止購買俄羅斯石油並降低貿易壁壘。地緣政治方面，伊朗與美國將於周五在土耳其重啟核談判，特朗普警告稱若未能達成協議，可能引發不好的後果。\n\n澳洲央行在去年三次降息後，預計將重啟升息周期。歐洲央行和英國央行周四將公布最新利率決議，預計都將按兵不動。\n\n澳元 上漲0.3%至0.6965美元。新西蘭元 升值0.3%至0.6017美元，英鎊 上漲0.1%至1.3676美元。\n\n在2月8日大選之前，投資者拋售日圓和日本政府債券，因預期若首相高市早苗贏得強有力的授權，將實施更具擴張性的財政政策。\n\n日本財務大臣片山皋月周二為首相高市早苗強調日圓貶值益處的言論辯護，稱首相所提到的是“教科書上的基本概念”。\n\n加密貨幣方面，比特幣 上漲0.5%至78,840.02美元，以太幣 上漲0.1%至2,343.94美元。\n\n[表格內容]\n 最新報價 紐約 當日 今年來 2025年 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1809 1.1789 +0.17 +0.54 1.1745 美元/日圓 155.5600 155.60 -0.03 -0.70 156.65 歐元/日圓 183.71 183.43 +0.15 -0.15 183.99 美元/瑞郎 0.7782 0.7795 -0.17 -1.78 0.7923 英鎊/美元 1.3679 1.3662 +0.12 +1.53 1.3473 美元/加元 1.3662 1.3680 -0.13 -0.45 1.3724 美元/離岸人民幣 6.9378 6.9412 -0.05 -0.54 6.9756 澳元/美元 0.6970 0.6947 +0.33 +4.47 0.6672 新西蘭元/美元 0.6019 0.5998 +0.35 +4.57 0.5756 澳元/日圓 108.380 107.630 +0.70 +3.67 104.540 新西蘭元/日圓 92.930 92.930 0.00 +2.47 90.690 英鎊/日圓 212.77 212.55 +0.10 +0.83 211.02 澳元/新西蘭元 1.1574 1.1576 -0.02 -0.09 1.1585 美元指數 97.476 97.632 -0.16 -0.86 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1713,
      "HasTables": false,
      "ScrapedAt": "2026-02-03 09:42:47"
    },
    {
      "Source": "TradingView - Reuters Stocks",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_P8T3V505N:0/",
      "Date": "2026-02-03",
      "Time": "09:11:10",
      "Title": "台灣股市：盤初大漲逾2%，受美國芯片股強彈的樂觀情緒帶動",
      "Content": "台灣股市 TWSE:TAIEX周二早盤攀升逾2%，受惠上日美國股市芯片股強彈的樂觀情緒帶動。\n\n最大權值股--台積電 勁揚1.98%報1,800台幣。\n\n美國股市標普500指數 周一收高，受助于芯片製造商及其他人工智能（AI）相關股上漲。標普500指數收高0.54%，納斯達克指數收升0.56%，道瓊斯工業指數收漲1.05%。（完）",
      "ContentLength": 166,
      "HasTables": false,
      "ScrapedAt": "2026-02-03 09:42:43"
    },
    {
      "Source": "TradingView - Reuters Brief",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YY196:0/",
      "Date": "2026-02-03",
      "Time": "07:25:58",
      "Title": "《路透早報》--2月3日",
      "Content": "一周全球重要經濟數據和事件預告：\n\n簡體： https://tmsnrt.rs/4rq6zw3\n\n繁體： https://tmsnrt.rs/467jWJa\n\n以下為2月2日下午5:00至2月3日早上7:00的重大新聞與市場摘要：\n\n--美國將對印度關稅降至18%，印度同意停止購買俄羅斯石油\n\n美國總統特朗普周一表示，他已與印度達成貿易協議，將美國對印度商品的關稅從50%削減至18%，作為交換，印度將降低貿易壁壘，停止購買俄羅斯石油，並轉而從美國、以及可能從委內瑞拉購買石油。特朗普在與印度總理莫迪通話後于社交媒體發文稱：\"出於對莫迪總理的友誼與尊重，並根據他的請求，即刻起，我們就一項美印貿易協議達成共識，美國將降低對等關稅，從25%降至18%。\"白宮官員對路透表示，美國還將撤銷因印度購買俄羅斯石油而加徵的25%懲罰性關稅。特朗普補充稱，莫迪還承諾將購買價值超過5,000億美元的美國能源、科技、農產品及其他產品。該消息提振在美上市的印度企業股價普遍上漲。\n\n--特朗普啟動120億美元礦產儲備計劃，以提振美國製造業並對抗中國\n\n一位了解相關計劃的特朗普政府官員表示，美國總統特朗普即將啟動一項戰略性關鍵礦產儲備計劃，啟動資金為120億美元。這是華盛頓採取的最新舉措，旨在應對政策制定者所認為的中國操縱鋰、鎳、稀土及其他關鍵礦物價格的行為。這項名為\"金庫計劃\"(Project Vault)的項目將整合20億美元的民間資金與美國進出口銀行提供的100億美元貸款，為汽車製造商、科技公司及其他生產商收購併儲備礦產。白宮暫未回應置評請求。\n\n*航運數據顯示，委內瑞拉1月石油出口量在美國管控下從12月的49.8萬桶/日回升至約80萬桶/日。\n\n--中國獨立煉廠購買伊朗石油替代委內瑞拉供應\n\n知情人士透露，中國獨立煉油廠正在購買折扣伊朗重質原油，以替代委內瑞拉原油供應。美國上月宣稱控制該國後導致供應中斷。消息人士稱，中國獨立煉油商(曾是委內瑞拉原油最大買家)正搶購儲存在中國保稅儲罐及船上的伊朗重質原油。交易員稱，這些煉油商優先採購受制裁原油，因其折扣幅度較大，而非購買維多或托克公司銷售的委內瑞拉原油，或加拿大重質原油。\n\n--亞特蘭大聯儲總裁博斯蒂克表示，特朗普總統提名的下任美聯儲主席人選沃什將面臨領導美聯儲的\"艱巨任務\"，尤其是在說服政策制定委員會成員配合其貨幣政策決策方面。本月即將卸任的博斯蒂克認為美聯儲今年不應降息，稱鑒於當前經濟強勁且勞動力市場趨穩，降息\"將使通脹回落至目標的可能性非常低，甚至難以使其步入降溫軌道\"，\"因此我認為現在需要保持耐心\"。\n\n--美國總統特朗普表示，對美聯儲主席鮑威爾的調查應進行到底。\n\n--美國製造業一年來首次擴張，但仍擔心貿易政策不確定性\n\n美國1月製造業活動實現一年來首次擴張，企業在新年假期後接獲新訂單，但這種改善可能只是暫時的，製造商仍在抱怨反復無常的貿易政策帶來的不確定性。供應管理協會(ISM)公布1月採購經理人指數(PMI)反彈至52.6，為12個月以來首次突破50關口，也是自2022年8月以來的最高水平。ISM調查的前瞻性新訂單分項指數從12月的47.4躍升至1月的57.1，創2022年2月以來新高。\n\n--美國1月就業報告將因政府部分停擺而推遲發布\n\n美國勞工統計局表示，由於聯邦政府部分停擺，備受關注的1月就業報告將不會在周五發布，並將在政府恢復撥款後重新安排發布時間。美國政府於周六陷入部分停擺，此前國會未能批準一項維持包括勞工部在內大量政府部門運作的撥款協議。儘管參議院上周五通過了支出方案，但眾議院當時處於休會狀態。眾議院定於周一審議相關議案，預計周二進行最終表決。眾院議長約翰遜樂觀認為政府停擺將在數日內結束。\n\n*特朗普表示，國會共和黨領袖接近達成一項旨在結束政府部分停擺的決議。\n\n--伊朗與美國將於周五舉行核談判；特朗普先聲奪人警告德黑蘭\n\n伊朗與美方官員告訴路透，伊朗與美國將於周五在土耳其重啟核談判。同時，美國總統特朗普警告，隨著大型美國軍艦正開往伊朗，若無法達成協議，恐將發生不好的事情。美國特使威特科夫與伊朗外長阿拉格齊將在伊斯坦布爾會晤，旨在重啟圍繞伊朗核計劃長期爭端的外交解決途徑，以消除人們對新一輪地區戰爭的擔憂。該地區一名外交官表示，沙特、埃及等國代表也將參與。當被問及協議前景時，特朗普周一在白宮對記者表示談判正在進行。\n\n--獨家：OpenAI對部分Nvidia芯片表現不滿意，正尋找替代方案\n\n知情人士透露，OpenAI對Nvidia(英偉達)部分最新人工智能芯片表現不滿，自去年起便尋求替代方案，這可能在人工智能浪潮中使兩大巨頭之間的關係複雜化。OpenAI發言人在聲明中表示，該公司絕大多數推理集群依賴Nvidia提供算力，且Nvidia在推理性能與成本比方面表現最佳。七位消息人士透露，OpenAI對Nvidia硬件處理特定類型問題（如軟件開發和人工智能與其他軟件的交互）的速度感到不滿。其中一位消息人士告訴路透，OpenAI需要新型硬件滿足其約10%的推理計算需求。\n\n--馬斯克旗下SpaceX收購xAI，整合人工智能與太空領域雄心\n\n馬斯克宣布，旗下SpaceX已收購其人工智能初創公司xAI，此舉旨在整合馬斯克在人工智能與太空領域的雄心。馬斯克表示：\"這不僅是SpaceX與xAI使命的全新篇章，更是下一部巨作：我們將拓展規模，打造具有感知能力的太陽，以理解宇宙奧秘，並將意識之光延伸至群星！\"一名匿名知情人士表示，根據合併協議，xAI將成為SpaceX的全資子公司。兩家公司及馬斯克均未立即回應置評請求。\n\n--中國國務院總理李強在山東調研。他指出，要堅持遠近結合，抓好開局起步，靠前發力，實施各項政策，更加紮實有效地促發展、惠民生、增後勁。央視新聞聯播援引他的講話並稱，去年中國經濟在應對衝擊中實現新的發展，今年要繼續堅定信心，克難奮進。要發揮各地特色優勢，努力培育新的增長點，推動各項工作盡快落地見效。\n\n--中國十四屆全國人大常委會第五十九次委員長會議決定，十四屆全國人大常委會第二十次會議2月4日在北京舉行。\n\n--歐元區1月製造業PMI終值從12月的九個月低點48.8升至49.5，略高於49.4的初值。儘管產出恢復增長，但由於新訂單持續疲軟，1月製造業活動連續第三個月處於萎縮區間。\n\n*德國1月製造業PMI終值從12月的47.0升至49.1，較初值48.7小幅上升。德國製造業以積極態勢開啟2026年，製造業產出在經歷去年12月短暫萎縮後，於今年1月重回增長軌道。\n\n*英國製造業PMI從12月的50.6升至1月的51.8，達到2024年8月以來最高水平，因1月新訂單流入量創近四年最大增幅，平添2025年末疲軟收官後經濟升溫的跡象。\n\n--韓國1月消費者物價指數(CPI)同比上漲2.0%，這是自8月以來最慢的同比漲幅，基本符合市場預期。\n\n--加拿大1月製造業PMI從12月的48.6升至1月的50.4，一年來行業首次擴張。隨著市場預期今年經濟將增長，行業信心升至三個月高位。標普全球在隨數據發布的報告中指出，增長源於積壓訂單的消化與新產品投放的雙重效應。\n\n--瑞士央行總裁施萊格爾表示，瑞士低通脹與零利率的組合給貨幣政策構成挑戰，但他拒絕透露這種局面是否會增加實施負利率的可能性。他表示，瑞士央行將持續密切關注局勢及瑞郎匯率，必要時將在外匯市場採取干預措施。\n\n--俄外交部：駐烏克蘭外國武裝力量將成為\"合法打擊目標\"\n\n俄羅斯外交部援引外長拉夫羅夫的話稱，俄方將把任何外國軍事力量或基礎設施在烏克蘭境內的部署視為外國干涉，並將這些力量視為合法打擊目標。該部在其官網發布聲明稱：\"西方國家在烏克蘭部署軍事單位、設施、倉庫及其他基礎設施的行為，我們無法接受，並將被視為對俄羅斯安全構成直接威脅的外國干涉。\"\n\n*克里姆林宮表示，由美國斡旋的烏克蘭與俄羅斯新一輪三方會談將於2月4日至5日在阿布扎比舉行。\n\n--格陵蘭總理尼爾森(Jens-Frederik Nielsen) 警告稱，儘管美國總統特朗普已排除動用武力，但華盛頓仍從根本上企圖控制這座北極島嶼。\"美國對格陵蘭及其居民的立場未變：即格陵蘭應與美國建立聯繫，並由美國治理，\"他在向格陵蘭議會做出的發言中通過翻譯表示。尼爾森同時稱讚丹麥在危機期間始終是親密夥伴。\n\n--兩名以色列高級官員表示，美國總統特朗普的高級特使威特科夫(Steve Witkoff)預計周二將訪問以色列，會見以色列總理內塔尼亞胡以及以色列軍方首腦。\n\n--歐洲審計院表示，歐盟為實現關鍵金屬和礦產進口多元化所做的努力\"尚未產生切實成果\"。歐盟2024年制定了提升34種戰略材料本土化生產的計劃，旨在減少對從幾個國家（主要是中國、土耳其和智利）進口的過度依賴。但歐洲審計院報告指出，\"前景不容樂觀：目前能源轉型所需的26種材料中，有七種回收率僅在1%至5%之間，另有10種完全無法回收\"，報告將這歸咎於缺乏針對性激勵措施。\n\n--推行更加面向終端消費者的渠道改革滿一個月，中國白酒龍頭--貴州茅台公布，旗下直銷平台--i茅台在1月的月度活躍用戶已超過1,531萬，並獲得628萬新註冊用戶，“普茅”單品GMV（成交金額）超20億元人民幣。\n\n[市場摘要]\n\n股市：\n\n--美國股市標普500指數周一收高，受助于芯片製造商及其他人工智能（AI）相關股上漲，小型股也大幅攀升。標普500指數收漲0.54%，報6,976.44點，略低於上周二創下的6,978.60點的紀錄收盤高位。納斯達克指數上漲0.56%，至23,592.11點。道瓊斯工業指數上漲1.05%，至49,407.66點。\n\n--歐洲股市泛歐STOXX 600指數收漲1%，創下紀錄新高，受助于金融股和醫療保健股強勁上漲，在企業財報密集發布的一周伊始，投資者擺脫大宗商品市場震盪的影響。英國富時100指數收高1.15%。德國DAX指數收升1.05%。法國CAC-40指數收漲0.67%。\n\n匯市：\n\n--美元兌主要貨幣全線上漲，貴金屬拋售引發避險情緒，與此同時，投資者權衡沃什領導下的美聯儲可能呈現的政策面貌。在央行會議密集、重要經濟數據發布及日本大選交織的一周伊始，大宗商品相關貨幣首當其沖承受著拋售壓力，市場情緒明顯緊張。美元指數上漲0.44%，報97.64。歐元兌美元跌0.53%，報1.1788美元。英鎊兌美元下跌0.19%，至1.3661美元。美元兌日圓上漲0.57%，至155.64日圓。\n\n債市：\n\n--美債收益率上升，交易員正在評估前理事沃什是否會為美聯儲帶來比以往更鴿派的政策立場。通常與美聯儲利率預期同步波動的兩年期公債收益率上漲3.8個基點至3.565%。指標10年期公債收益率上漲3.2個基點至4.273%。\n\n--歐元區公債收益率上漲，貴金屬震盪影響市場，投資者關注歐洲央行本周會議。歐元區指標德國10年期公債收益率盤尾報2.86%，上漲2個基點 ；對利率預期更敏感的兩年期公債收益率上漲3個基點，至2.09%。\n\n油市：\n\n--油價下跌逾3美元，此前美國總統特朗普表示伊朗正與華盛頓進行\"嚴肅對話\"，暗示與該OPEC成員國的緊張局勢有所緩和。與此同時，美元走強及預報顯示氣溫將更加溫和也令油價承壓。布蘭特原油期貨下跌3.02美元，跌幅4.4%，結算價報每桶66.30美元；美國原油期貨下跌3.07美元，跌幅4.7%，結算價報每桶62.14美元。\n\n金屬：\n\n--金銀價格續跌，芝加哥商品交易所集團 (CME)提高保證金要求，加劇了上周沃什被提名為美聯儲下任主席後引發的急劇拋售。現貨金收跌4.1%，報每盎司4,665.27美元，盤中一度暴跌近10%。美國4月交割黃金期貨收報每盎司4,652.60美元，下跌1.9%。現貨銀收跌6.1%，報每盎司79.42美元，盤中跌幅一度達15%。\n\n--銅價延續跌勢，觸及三周低點，因投機者撤離上周飆升至紀錄高位的銅市，但中國工廠數據向好緩解了跌幅。倫敦金屬交易所(LME)指標三個月期銅在亞洲交易時段一度暴跌5.6%，觸及1月9日以來最低點，1715 GMT，跌幅收窄至1.4%，報每噸12,972美元。\n\n[今日看點]\n\n重要經濟數據(GMT時間)：\n\n--香港12月零售銷售\n\n--新西蘭第四季失業率(2145)\n\n重大經濟事件及官員講話(GMT時間)：\n\n--澳洲央行發布貨幣政策決定聲明(0330)，央行總裁布洛克向媒體發表講話(0430)\n\n--歐洲央行銀行監管委員會委員蒙塔涅爾發表主題演講(1145)\n\n--美國里奇蒙聯邦儲備銀行總裁巴爾金發表講話(1300)\n\n注：其他重要財經新聞瀏覽請點選；近日《路透早報》請點選。(完)",
      "ContentLength": 5222,
      "HasTables": false,
      "ScrapedAt": "2026-02-03 07:42:43"
    },
    {
      "Source": "TradingView - Reuters Stocks",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YY16V:0/",
      "Date": "2026-02-03",
      "Time": "05:55:23",
      "Title": "美國股市：標普500指數逼近紀錄高位，芯片股和小盤股跳漲",
      "Content": "美國股市標普500指數 周一收高，受助于芯片製造商及其他人工智能（AI）相關股上漲，小型股也大幅攀升。\n\n羅素2000指數 跳漲約1%，該小型股指數在2026年迄今的表現顯著跑贏標普500指數和納斯達克指數 。\n\n谷歌母公司Alphabet 上漲1.9%，創紀錄新高，亞馬遜 上漲1.5%。兩家公司本周將公布季度財報，投資者可借此進一步窺見二者在人工智能技術主導權之爭中的動向。\n\n人工智能相關數據公司Palantir 在盤後公布季度報告前上漲0.8%。\n\n受益於人工智能相關需求的芯片製造商也紛紛上漲。SanDisk 大漲15.4%，Advanced Micro Devices 上漲4%，美光 急升5.5%。\n\n標普500指數三日來首次收漲，此前近期對科技公司估值偏高的擔憂造成壓力——這些公司的股價近年受對人工智能的樂觀預期推動而大幅上漲。\n\n2026年迄今，標普500指數上漲約2%，羅素2000指數急升逾6%。投資者通常將小盤股上漲視為經濟信心的體現。\n\nIngalls & Snyder 高級投資組合策略師Tim Ghriskey表示：\"基本面良好，盈利強勁。從營收到盈利，我們幾乎在所有領域都看到了積極的意外驚喜。\"\n\n倫敦證交所集團（LSEG）數據顯示，分析師預計標普500指數成分股企業去年12月季度盈利將增長近11%，1月初的預期增幅為約9%。科技相關企業是推動上述增長預期的主力軍。\n\n儘管季度盈利超出華爾街預期，但迪士尼 仍急挫7.4%，該公司警告美國主題公園國際遊客量將下滑，且影視部門盈利大幅萎縮。\n\n標普500指數收漲0.54%，報6,976.44點，略低於上周二創下的6,978.60點的紀錄收盤高位。納斯達克指數上漲0.56%，至23,592.11點。道瓊斯工業指數上漲1.05%，至49,407.66點。\n\n美國各交易所累計成交201億股，交易量較大，此前20個完整交易日的日均成交量為194億股。\n\n採購經理人指數（PMI）數據顯示，1月美國工廠活動一年來首次增長。\n\n被稱為華爾街\"恐慌指數“的CBOE市場波動率指數 下跌1點，至16.5點。盤中該指數曾觸及近兩周最高。\n\n受油價下跌拖累，標普500能源板塊 下跌2%。美國總統特朗普表示伊朗正與華盛頓進行\"嚴肅對話\"，這暗示局勢趨緩，緩解了市場對供應干擾的擔憂。\n\n能源價格下跌提振航空股。美聯航 、JetBlue 、達美航空 及西南航空 均上漲4%至8%。\n\n眾議院已著手審議旨在結束上周六開始的政府部分停擺的議案，預計將於周二進行最終表決。\n\n勞工統計局表示，由於政府部分停擺，備受關注的1月就業報告不會在周五發布。\n\n標普500指數 (.AD.SPX) 漲跌股家數比為1.4:1。\n\n30只標普500指數成分股創下新高，九隻創新低。160只納斯達克指數成分股創新高，217只創新低。（完）\n\n[表格內容]\n****查閱相關新聞或頁面，請點選下列代碼連結**** 美國股市 一周展望 歐洲股市報導 日本股市報導 中港股市報導 中國股市報導 台灣股市報導 股市簡訊 納斯達克最活躍個股 (.AV.O) 紐約證交所最活躍個股 (.AV.N) 納斯達克漲幅居前個股 (.PG.O) 紐約證交所漲幅居前個股 (.PG.N) 納斯達克跌幅居前個股 (.PL.O) 紐約證交所跌幅居前個股 (.PL.N) 標普主要分類指數 (0#.GSPMAJOR) 英股富時指數 CURRENCYCOM:UK100 德股DAX指數 法股CAC-40指數 韓國股市已並入韓國金融市場報導中，相關稿件請點選",
      "ContentLength": 1486,
      "HasTables": false,
      "ScrapedAt": "2026-02-03 06:42:42"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YY167:0/",
      "Date": "2026-02-03",
      "Time": "05:36:04",
      "Title": "《全球匯市》美元攀升，受助于避險資金流和強勁的美國數據",
      "Content": "美元兌主要貨幣周一全線上漲，貴金屬拋售引發避險情緒，與此同時，投資者權衡沃什(Kevin Warsh，瓦爾許) 領導下的美聯儲可能呈現的政策面貌。\n\n儘管關稅推高原材料價格並加劇供應鏈壓力，但數據顯示美國製造業1月已重回增長軌道，美元此後延續漲勢。\n\n美國勞工統計局周一發布聲明稱，政府部分停擺將推遲備受關注的1月就業報告發布時間（原定本周五發布），但美元似乎未受影響。\n\nCorpay首席市場策略師Karl Schamotta表示：\"市場正重回在缺乏美國勞動力市場基本面清晰視角的狀態下運行。\"\n\n\"此次停擺應會很快結束，對貨幣政策預期及整體交易活動的影響有限。隨著投資者逐漸適應美國政府運作失靈的常態，美元的避險屬性正在削弱。\"\n\n在央行會議密集、重要經濟數據發布及日本大選交織的一周伊始，大宗商品相關貨幣首當其沖承受著拋售壓力，市場情緒明顯緊張。\n\n日本首相高市早苗周末在競選演講中大談日圓貶值的益處，其表態口徑與財務省形成反差，使日圓 再度成為交易員關注焦點。\n\n**美聯儲主席提名推動上周五美元漲勢**\n\n上周五美元上漲，此前美國總統特朗普提名沃什為下一任美聯儲主席。分析人士認為，儘管沃什的立場比現任主席鮑威爾更為鴿派，但他不太可能像其他候選人那樣全力推動快速降息。\n\n美元指數 上漲0.44%，報97.64。\n\n市場仍預期美聯儲今年將兩次降息，但預計最早要到6月才會行動——屆時若沃什獲得參議院確認，他將成為美聯儲主席。 \n\n歐元兌美元 進一步跌離1.20美元關口，下跌0.53%，報1.1788美元。英鎊兌美元 下跌0.19%，至1.3661美元。市場預期歐洲央行與英國央行周四公布最新決議時將維持政策利率不變。\n\n**大宗商品貨幣趨軟**\n\n受大宗商品價格和風險情緒影響較大的經濟體的貨幣周一仍疲軟。\n\n澳元兌美元 下跌0.22%，至0.6944美元，澳洲央行周二將公布利率決定，甚至有人預期可能加息。\n\n新西蘭元兌美元 下跌0.35%，至0.5997美元，加元兌美元 下跌0.5%，至1.369加元。\n\n**關注日圓**\n\n美元兌日圓 周一上漲0.57%，至155.64日圓，市場預期高市早苗領導的自民黨將在即將舉行的眾議院選舉中取得壓倒性勝利。\n\n根據朝日新聞周日發布的民調，在眾議院465個席位中，自民黨可能拿下遠超過233席的多數席位。\n\n隨著選舉臨近，投資者拋售日圓和日本公債，預期若高市早苗贏得強有力的授權，將實施更擴張性的財政政策，而其政黨鼓吹的減稅措施將進一步加劇本已吃緊的政府財政壓力。\n\n不過疲軟的日圓近期已經觸底，交易員持續警惕美日協調干預匯率的可能性--上月底雙方進行匯率詢價後，日圓曾大幅攀升。（完）\n\n[表格內容]\n****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1325,
      "HasTables": false,
      "ScrapedAt": "2026-02-03 05:42:47"
    },
    {
      "Source": "TradingView - Reuters Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YY151:0/",
      "Date": "2026-02-03",
      "Time": "04:59:20",
      "Title": "美國債市：公債收益率攀升，市場評估美聯儲主席提名人沃什的政策立場",
      "Content": "美國公債收益率周一走高，交易員正在評估前理事沃什是否會為美聯儲帶來比以往更鴿派的政策立場。 \n\n上周五，美國總統特朗普提名沃什接替鮑威爾擔任美聯儲主席，鮑威爾的任期將於5月結束。沃什早年在美聯儲任職時以通脹鷹派著稱，但如今主張降息。\n\n多倫多道明證券紐約分行美國利率策略主管Gennadiy Goldberg表示：\"沃什的真實立場尚不明朗。他究竟是...鷹派...還是...作為特朗普提名要求的鴿派？\"\n\n\"我認為當前市場正按兵不動，密切關注基本面動向，\"Goldberg補充道。\n\n通常與美聯儲利率預期同步波動的兩年期公債收益率 (US2YT=RR) 上漲3.8個基點至3.565%。指標10年期公債收益率 上漲3.2個基點至4.273%。\n\n兩年期與10年期公債收益率曲線 (US2US10=TWEB) 趨平約1個基點至70個基點，周一早盤曾觸及72.7個基點，為4月以來最陡峭水平。\n\n交易員還關注沃什關於縮減美聯儲資產負債表規模的言論，此舉可能收緊市場流動性。\n\nBCA Research首席策略師Felix Vezina-Poirier在報告中指出：\"儘管提名期間他採取鴿派立場，但我們預計他將回歸原有傾向。即便在主張降息時，沃什也試圖通過縮減資產負債表來收緊金融條件以作補償。\"\n\nGoldberg指出，任何資產負債表調整都將是長期舉措，不太可能產生即時影響。\n\n\"就連米蘭理事上周也提到，縮減資產負債表的途徑在於放寬部分監管要求——正是這些要求迫使美聯儲維持龐大資產負債表，\"Goldberg解釋道。\n\n\"所有這些都需要漫長的過程，因此我不認為美聯儲資產負債表政策會突然轉向。\"\n\n美聯儲理事米蘭作為最主張大幅降息的鴿派政策制定者，上周表示監管規定是影響美聯儲資產負債表規模的重要因素。\n\n亞特蘭大聯儲總裁博斯蒂克周一表示，沃什領導美聯儲面臨 \"艱巨任務\"，尤其當他試圖說服政策制定委員會成員配合其貨幣政策決策時。\n\n周一數據顯示，美國1月製造業活動一年來首次擴張，新訂單大幅反彈。\n\n與此同時，美國勞工統計局周一宣布，由於聯邦政府部分停擺，備受關注的1月非農就業報告將不會在周五發布。\n\n美國眾議院周一將審議一項旨在解除周末開始的部分政府停擺的議案，預計周二進行最終表決。\n\n美國財政部周一表示，預計第一季度將借款5,740億美元，比去年11月預期減少30億美元。該部將於周三上午公布其再融資計劃的詳細信息。\n\n[表格內容]\n 20:51 GMT 價格 收益率% 收益率變動 兩年期公債 (US2YT=RR) 99.86328125 3.5716 +0.0450 五年期公債 (US5YT=RR) 99.6015625 3.8384 +0.0410 10年期公債 97.765625 4.2814 +0.0400 30年期公債 (US30YT=RR) 95.515625 4.9128 +0.0410 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 美國現貨公債 美國指標公債報價 (0#USBMK=) 英國公債市場 歐元區公債市場 日本公債市場 中國債市 台灣債市 歐元區指標公債報價 (0#EUBMK=) 利率或央行相關報導",
      "ContentLength": 1330,
      "HasTables": false,
      "ScrapedAt": "2026-02-03 05:42:44"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YY0KC:0/",
      "Date": "2026-02-02",
      "Time": "17:46:54",
      "Title": "《全球匯市》美元維持漲幅，貴金屬和油價暴跌拖累大宗商品相關貨幣",
      "Content": "美元周一維持漲勢，因投資者權衡沃什(Kevin Warsh，瓦爾許) 領導下的美聯儲可能呈現的政策面貌，而貴金屬和油價暴跌則拖累了大宗商品相關貨幣。\n\n 大宗商品的下跌蔓延至亞洲和歐洲股市，本周開局充滿緊張情緒。本周將有多家央行召開會議、重要經濟數據，日本還將舉行選舉。\n\n 日本首相高市早苗周末在競選演講中大談日圓貶值的益處，其表態口徑與財務省形成反差，使日圓 再度成為交易員關注焦點。\n\n美元在歐洲時段持平，此前因提名沃什為美聯儲下任主席，美元上周五曾大幅上漲。分析師認為，與其他候選人相比，沃什不太可能推動全面快速降息，儘管他比現任主席鮑威爾更顯鴿派。\n\n美元指數 最新報97.21，繼周五上漲1%後幾無變動。\n\nDanske Bank外匯及固定收益分析師Mohamad Al-Saraf表示：\"從表面看，凱文·沃什是特朗普能選出的最利好美元的人選。\"\n\n\"美元中的政治風險溢價雖未完全消失，但至少部分短期風險已得到緩解。\"\n\n市場仍預期美聯儲今年將兩次降息，但預計最早要到6月才會行動--屆時若沃什獲得參議院確認，他將成為美聯儲主席。 (0#USDIRPR)\n\n歐元兌美元匯率 遠離1.20關口，最新報1.1852美元；英鎊兌美元匯率 基本持平於1.3690美元。市場預期歐洲央行與英國央行周四將維持政策利率不變。\n\n**大宗商品貨幣走軟**\n\n周一，受大宗商品價格和風險情緒影響較大的經濟體貨幣普遍走軟。\n\n澳元 一度下跌0.7%至0.6908美元，儘管市場預期澳洲央行周二將加息，但該貨幣仍承壓。 澳元最新報0.6944美元，跌幅0.3%。新西蘭元 一度跌至0.5991美元，加元 下跌0.2%。\n\n美元兌挪威克朗 一度上漲0.7%。布蘭特原油 和美國原油期貨 雙雙下挫約5%，市場對美伊緊張局勢緩和的跡象作出反應。\n\n **日圓走弱**\n\n 周一，日圓 小幅走弱，兌美元匯率報154.90，部分原因是高市早苗周末的言論似乎默許日圓貶值，以及市場預期其所在政黨將在即將舉行的眾議院選舉中取得壓倒性勝利。\n\n根據朝日新聞周日發布的民調，在眾議院465個席位中，自民黨可能拿下遠超過233席的多數席位。\n\n法國興業銀行分析師指出，儘管該預測聽起來\"過於\"樂觀，但若實現，對高市早苗而言意義重大。\n\n 他們表示：\"這將使高市早苗能夠自由推行其擴張性政策\"，並補充稱，市場初期反應將是提高長期日本公債和日圓的風險溢價。\n\n隨著選舉臨近，投資者拋售日圓和日本公債，預期若高市早苗贏得強有力的授權，將實施更擴張性的財政政策，而其政黨鼓吹的減稅措施將進一步加劇本已吃緊的政府財政壓力。\n\n 不過疲軟的日圓近期已經觸底，因交易員持續警惕美日協調干預匯率的可能性--上月底雙方進行匯率詢價後，日圓曾大幅升值。\n\n[表格內容]\n 紐約 當日 今年來 2025年 最新報價 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1856 1.1848 +0.07 +0.95 1.1745 美元/日圓 154.84 154.76 +0.05 -1.16 156.65 歐元/日圓 183.59 183.37 +0.12 -0.22 183.99 美元/瑞郎 0.7746 0.7729 +0.22 -2.23 0.7923 英鎊/美元 1.3700 1.3688 +0.09 +1.68 1.3473 美元/加元 1.3641 1.3613 +0.21 -0.60 1.3724 美元/離岸人民幣 6.9471 6.9577 -0.15 -0.41 6.9756 澳元/美元 0.6953 0.6959 -0.09 +4.21 0.6672 新西蘭元/美元 0.6015 0.6018 -0.05 +4.50 0.5756 歐元/瑞郎 0.9183 0.9160 +0.25 -1.34 0.9308 歐元/英鎊 0.8651 0.8660 -0.10 -0.73 0.8715 歐元/瑞典克朗 10.5755 10.5592 +0.15 -2.13 10.8061 美元/挪威克朗 9.6784 9.6123 +0.69 -3.78 10.0588 美元指數 97.134 96.991 +0.15 -1.21 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1955,
      "HasTables": false,
      "ScrapedAt": "2026-02-02 18:42:46"
    },
    {
      "Source": "TradingView - Reuters Brief",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YY0A3:0/",
      "Date": "2026-02-02",
      "Time": "17:10:24",
      "Title": "《路透晚報》--2月2日新聞摘要（國際版）",
      "Content": "以下為路透中文新聞為您整理的亞洲市場時段(上午7:00-下午5:00)新聞摘要：\n\n[重大數據或新聞]\n\n--日本央行周一公布的1月會議意見摘要顯示，央行政策制定者討論了日圓疲軟引發的通脹壓力，部分委員警告稱，在應對通脹過高時存在“落後于形勢”的風險。討論凸顯出日本央行九名審議委員的鷹派觀點日益增強，這可能令市場對日本央行短期內加息的預期持續升溫。\n\n--日本政府發言人表示，首相高市早苗在周末的競選演講中並非強調日圓疲軟的益處。內閣副官房長官尾崎正直在例行記者會上表示：\"首相所表達的看法是我們希望建立一個能夠承受匯率波動的經濟結構。\"\n\n他強調：\"絕非如某些報導所言，她是在強調所謂日圓疲軟的益處。\"\n\n--德國外交部長瓦德富爾周一在新加坡表示，德國與美國和中國\"並非等距相處\"，儘管近期存在緊張關係，但德國始終更更靠近華盛頓。在國際戰略研究所（IISS）舉辦的一場講座上，瓦德富爾表示，儘管當前存在導致華盛頓與歐洲地區關係\"疏遠\"的問題，美國仍是歐洲和德國最重要的夥伴，歐洲的安全仍依賴于美國。\n\n--美國眾議院議長約翰遜表示，他相信共和黨人有足夠票數，可在數日內結束政府部分停擺，隨後眾議院將針對移民與海關執法局(ICE)的改革展開為期兩周的辯論。由於國會未能批準一項維持政府廣泛運作的撥款協議，美國周六進入一段料將短暫持續的停擺。參議院周五輕鬆通過了支出方案，但眾議院議員仍在休會中。\n\n--俄羅斯聯邦安全會議副主席梅德韋杰夫在周一刊發的講話中表示，世界正變得極其危險，但俄羅斯不希望發生全球性衝突。梅德韋杰夫讚揚了特朗普，並表示與華盛頓恢復接觸令人鼓舞。但這位曾多次對基輔和西方國家進行譴責、同時警告戰爭升級可能引發核\"末日\"風險的政治人物表示，西方國家一再無視俄羅斯的利益。\n\n--朝日新聞的一項民調顯示，日本首相高市早苗所屬的自民黨很可能在下周的眾議院選舉中取得壓倒性勝利。根據朝日新聞周日發布的民調，在眾議院465個席位中，自民黨可能拿下遠超過233席的多數席位，較現有的198席大幅增加。民調顯示，加上結盟夥伴維新會的席次，執政聯盟席位可望達到300席。\n\n--IMF總裁格奧爾基耶娃表示，受需求疲軟和能源價格走低推動，全球通脹率預計今年將降至3.8%，2027年進一步降至3.4%。在迪拜舉行的阿拉伯財政年度論壇上，格奧爾基耶娃在演講中指出，儘管地緣政治、貿易政策、科技和人口結構發生深刻變化，全球經濟增長仍保持\"相當強勁\"。\n\n--一項民間部門調查顯示，日本製造業活動在1月以約三年半以來的最快速度增長，強勁的客戶需求推動了產出和新訂單增加。標普全球1月日本製造業採購經理人指數（PMI）終值從12月的50.0上升至51.5，創2022年8月以來最高水平。\n\n--摩根大通表示，預計在央行和投資者需求推動下，黃金價格到年底前將升至每盎司6,300美元。“我們對黃金的中期走勢仍保持堅定的看多信念，理由是黃金正處於結構性、持續性的資產配置多元化趨勢中，而在真實資產相對紙面資產持續跑贏的格局下，這一趨勢還有相當的空間，”摩根大通在一份報告中稱。\n\n--全英房屋抵押貸款協會(Nationwide Building Society)公布的數據顯示，截至今年1月的12個月里，英國房價上漲1.0%，漲幅超出預期。 Nationwide稱，1月房價較一年前上漲1.0%，創下自2025年11月以來的最大漲幅。\n\n--數據顯示，德國12月零售銷售較前月增加0.1%，增幅略低於預期。\n\n--一項私營部門調查顯示，韓國1月份製造業活動擴張速度創近一年半以來新高，出口需求增長飆升至近五年來的最高水平。標普全球發布的數據顯示，韓國1月製造業採購經理人指數（PMI）從去年12月的50.1升至51.2，創下2024年8月以來的最高水平。 \n\n--英國金融時報援引知情人士消息報導稱，英國財政部正向官員提供最高10萬英鎊（13.679萬美元）的自愿離職補償金，作為該部裁減數百個職位計劃的一部分。報導引述多名知情人士稱，英國財政大臣里夫斯計劃在 2030 年前裁減其部門約 2,100 名員工中的 300 人，這項裁員屬於政府更廣泛的計劃之一，即在整個白廳（Whitehall）削減 16% 的行政成本。\n\n--歐盟執委會副主席塞茹爾內在周日發表的報紙文章中指出，歐洲需要以“歐洲製造”戰略來保護自身產業。\n\n--美國國家公路交通安全管理局(NHTSA)表示，自2023年以來，一款中國制的汽車安全氣囊充氣裝置已經導致九名駕駛者喪生。NHTSA提醒駕駛者和維修店警惕相關風險。NHTSA稱，自2023年5月以來，美國境內已發生11起因吉林德天諾安全科技有限公司（簡稱DTN）生產的氣體發生器破裂導致死亡或重傷的事故，這些產品很可能是被非法進口至美國。\n\n--美國密西根州總檢察長內塞爾要求中國電池企業國軒高科退還從該州獲得的2,370萬美元資金。該公司去年放棄在密西根州建設一座24億美元工廠、生產電動汽車電池關鍵材料的計劃。該計劃最初於2022年10月宣布，預計可創造2,350個工廠崗位，但由於公司具有中國背景，受到部分州議員批評。國軒高科未立即回應置評請求。\n\n--據兩位知情人士透露，馬斯克的航天公司SpaceX去年實現利潤約80億美元，營收150億至160億美元，提供了有關該公司財務狀況的最新洞察。預計SpaceX將於今年晚些時候上市。知情人士透露，SpaceX最新財務數據此前未公開披露，部分銀行據此估算其融資規模或超500億美元，估值可能突破1.5萬億美元。\n\n[市場摘要]\n\n--日本股市：日經收低並創一周最大跌幅，科技股和資源股跌勢抵消日圓走軟\n\n日本日經指數周一創一周最大跌幅，科技股和資源股的下跌抹掉了日圓走軟帶來的早盤漲幅。日經指數下跌1.2%，收於52,655.18點；東證股價指數下滑0.85%，報3,536.13點。\n\n--中港股市：滬綜指重挫2.5%創近10個月最大單日跌幅，恆指收低2.2%\n\n貴金屬價格重挫連帶打擊股市情緒，中港股市2月首個交易日首秀上演“黑色星期一”。A股滬綜指創近10個月最大單日跌幅，收盤價創逾一個月新低，堪堪守在4,000點上方；香港恆生指數收跌2.2%，錄得2025年11月21日以來最大單日跌幅。滬綜指收盤狂瀉2.5%至4,015.75點，創2025年4月7日以來最大單日跌幅，前次收盤低位為2025年12月31日的3,968.84點；滬深300指數收低2.1%。深圳創業板指數收跌2.5%，上證科創板50成份指數收低3.9%。香港恆生指數收跌2.2%，報26,775.57點，錄得2025年11月21日以來最大單日跌幅。\n\n--匯市：美元持穩，投資者權衡沃什領導下的美聯儲前景\n\n美元維持漲勢，投資者評估沃什領導下的美聯儲可能呈現的政策面貌--他傾向於縮減資產負債表規模。日圓也重新進入交易員視野。日本首相高市早苗周末在競選演講中大談日圓貶值的益處，其表態口徑與財務省形成反差。0823GMT，美元兌日圓上漲0.13%，報154.93日圓。美元兌歐元上漲0.11%，報1.1859美元。美元指數下跌0.113%，報97.117。\n\n--歐元債市：收益率持穩，基本未受金屬暴跌影響\n\n歐元區政府債券收益率持穩，貴金屬暴跌令一些市場陷入恐慌。令一些市場陷入恐慌。本周歐洲央行將公布利率決議。歐元區指標德國10年期公債收益率持穩於2.8428%，而對利率預期更敏感的兩年期公債收益率則穩定在2.068%。\n\n--國際油市：油價下挫5%，因美伊緊張局勢緩和\n\n油價下跌5%，料創逾六個月來最大單日跌幅。此前美國總統特朗普表示伊朗正與華盛頓進行\"嚴肅對話\"，暗示與該OPEC成員國的緊張局勢有所緩和。截至09:09GMT，布蘭特原油下跌5.08%，報每桶65.79美元。西德克薩斯中質油(WTI)下跌5.41%，報每桶61.68美元。\n\n--全球金市：黃金和白銀拋售加劇，之前芝商所提高保證金要求\n\n金銀價格延續跌勢。此前，由於美國總統特朗普提名沃什擔任下一任美聯儲主席，貴金屬上周遭遇拋售，芝商所集團隨即提高了保證金要求。0726 GMT時，現貨金下跌 6.1%，至每盎司 4,565.79 美元。美國4月黃金期貨下跌3.3%，報每盎司4,586.20美元。現貨銀重挫12%，至每盎司74.48美元。\n\n--金屬期市：銅價從歷史高位大跌，因投資者轉向避險立場\n\n銅價大幅下挫，因沃什被提名為下一任美聯儲主席後，投資者轉入避險模式，同時在中國春節假期臨近之際，銅需求亦趨疲弱。上海期貨交易所最活躍的銅合約觸及跌停，盤中大跌9%，收於每噸98,580元（14,183.56美元），創1月9日以來新低。截至0700 GMT，倫敦金屬交易所(LME)指標三個月期銅大跌4.86%，報每噸12,518美元。 \n\n注：其他重要財經新聞瀏覽請點選；近日《路透晚報》請點選。(完)",
      "ContentLength": 3666,
      "HasTables": false,
      "ScrapedAt": "2026-02-02 17:42:49"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YY0KA:0/",
      "Date": "2026-02-02",
      "Time": "17:08:43",
      "Title": "台灣匯市：台幣收貶逾1角創逾一周新低，國際美元反彈外資大舉匯出",
      "Content": "台幣兌美元 周一收貶逾1角，外資匯出力道兇猛。匯銀人士稱，美聯儲理事沃什(Kevin Warsh，瓦爾許)可能出任主席，國際美元持續反彈，風險資產下跌，台股下挫而外資也匯出，令台幣收在逾一周新低。\n\n匯銀人士指出，外資今日在股市賣超逾四百多億台幣，在匯市也大舉匯出。只不過美元逢高檔也見到不少出口商進場拋匯，終場台幣貶幅明顯縮小。\n\n“外資匯出，但31.600以上有很多出口商。”一位大型匯銀人士表示。\n\n他也認為，今年上半年壽險公司對美元的買盤可能偏重，不排除上半年台幣可能緩步走貶至32，“就看籌碼如何消化。”\n\n另外一位大型匯銀人士則說，今日台幣貶至31.660-31.670即見到央行的阻貶力道，可見央行也不願意台幣貶幅太快。亞幣的走勢則是央行重要的參考指標。\n\n“我覺得台幣會區間偏貶，往32走，”該交易員也說，由於今日外資賣超台股毫不手軟，不排除明日上午還有匯出的需求，台幣短線仍偏貶。\n\n台灣股市周一連三日收黑，創逾一周新低。外資及陸資在台股大幅賣超481.18億台幣，三大法人則是賣超535.36億台幣。 \n\n在海外無本金交割遠期外匯市場(NDF)方面，目前指標一個月期美元/台幣換匯點 (TWDNDF=)由折價轉為溢價；一個月美元/台幣遠匯 (TWD1MNDFOR=)報31.630/31.650，上日收在31.627。\n\n美元周一維持漲幅，投資者評估沃什領導下的美聯儲可能呈現的政策面貌--他傾向於縮減資產負債表規模。\n\n交易員預估，明日台幣兌美元主要交易區間在31.550-31.700。\n\n[表格內容]\n16:00 台幣/美元報價 上日收盤 波動區間 開盤價 成交量(億美元) 上日成交量 (億美元) 台北外匯經紀公司 (TAIFX1) 31.590 31.468 31.520-31.673 31.520 21.03 18.66 元太外匯經紀公司 31.600 31.470 31.552-31.673 31.560 11.495 9.815 \n\n[表格內容]\n無本金交割遠期外匯(NDF) (TWDNDF=) 最新報價 上日現貨收盤時水準 美元/台幣一個月期 0.037/0.042 -0.055/-0.025 美元/台幣六個月期 -0.049/-0.044 -0.150/-0.120 \n（完）",
      "ContentLength": 962,
      "HasTables": false,
      "ScrapedAt": "2026-02-02 17:42:53"
    },
    {
      "Source": "TradingView - Reuters Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YY088:0/",
      "Date": "2026-02-02",
      "Time": "16:07:57",
      "Title": "台灣債市：指標10年債殖利率收創同年券逾五個月新高，外部環境不佳偏保守",
      "Content": "台灣指標10年公債115/3期 (A15103=TWO)發行前交易殖利率周一收升並創逾五個月新高；交易員稱，在美債殖利率收升，及日債和韓債殖利率大多走高之下，10年券殖利率亦跟著微幅收升；惟觀望氣氛濃，全天僅成交0.5億台幣並關注周四標債結果。\n\n他們指出，時值漸漸接近農曆春節且10年券標售在即，加上預估第二季發債量可能增加等不確定因素，讓市場偏保守且略顯“不知所措”，整體氛圍趨觀望，致交投偏冷。\n\n“台債就像晚上開車開著大燈，照到路上的兔子，兔子豎起耳朵不知道要往哪里跑，最後就被撞倒、被輾過了。”一大型證券商交易員說，“現在大家都不知所措，看法保守啦，但也不知道自己要往哪邊走，因為台債交易員都被輾趴了。”\n\n他表示，近期台債幾乎沒有什麼交易，除農曆年關將近外，主要是第二季發債量隨時可能增加並進入供應量比較密集的期間，再加上國際債券殖利率下行空間“被卡住”，讓市場看法明顯趨保守。\n\n他進一步指出，近期日圓和韓元利率交換市場（IRS）均往上沖，因而拉動台幣ISR跟著往上，但目前市場上沒有人預期台灣央行會降息，也沒有降息的預期，市場缺乏方向。\n\n另一大型證券商交易員稱，雖然近期外部環境不佳，但台債猶如石頭般，不動如山，料在標債後繼續呈平淡狀態。\n\n“台債又進入無我的境界，外面腥風血雨，黃金、白銀飆翻天后又跌到爆炸，我們就跟石頭一樣，完全不動。”他說，“反正要過年了，標完就過年，應該繼續平淡下去。”\n\n他們指出，因第一季為公司債發行空窗期，因而呈現發債量較低的情況，但進入第二季發債量隨時可能會增加，且國際債券氣氛不佳，短線偏保守。\n\n今日10年期公債115/3期殖利率收升0.3基點，報1.423%，此前收盤高位在2025年7月10日的1.44%。\n\n台灣央行周四將代財政部標售10年券115/3期，金額暫定350億台幣，並於10日發行。\n\n交易員預估，明日五年增額公債115/1R期殖利率交易區間在1.31-1.34%，而10年債115/3期殖利率交易區間則在1.41-1.44%。 \n\n[表格內容]\n 收盤價 漲跌幅 報價 區間 成交值 年期 期別 (基點) (億台幣) 10 115/3 (A15103=TWO) +0.3 1.423% *1.423-1.423% 0.50 \n*創該期券發行前交易以來新高。\n\n 今日電子盤各期指標券收盤情形：\n\n[表格內容]\n 30 114/11 (A14111=TWO) 沒有成交 20 115/4 (A15104=TWO) 沒有成交 10 115/3 (A15103=TWO) 1.423% 5 115/1 (A15101=TWO) 沒有成交 2 115/2 (A15102=TWO) 沒有成交 \n（完）",
      "ContentLength": 1133,
      "HasTables": false,
      "ScrapedAt": "2026-02-02 16:42:45"
    },
    {
      "Source": "TradingView - Reuters Stocks",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YY089:0/",
      "Date": "2026-02-02",
      "Time": "15:07:27",
      "Title": "台灣股市：收跌1.37%創逾一周新低，反映美聯儲新任人選利空短線醞釀反彈",
      "Content": "台灣股市周一連三日收黑，創逾一周新低。分析師稱，受美股上周五收低、亞股今日大多下跌等影響，大盤在台積電 盤中下跌逾1%拖累下，指數一度重挫逾2%；惟尾盤隨台積電、富邦金 及國泰金 跌勢收斂，終場跌幅縮窄。\n\n台灣加權指數 TWSE:TAIEX收跌1.37%至31,624.03點，此前收盤低位在1月21日的31,246.37點；今日成交初值 (.TTOV.TW)為7,404億台幣，上日修正後為9,413.2億。\n\n“今天低點有碰到月線，但尾盤跌幅有收斂，代表雖然下跌，但沒有很恐慌。”兆豐國際投顧副總經理黃國偉說，“美股下跌主要反映美聯儲新任人選利空，但有點瞎，應該是找一個藉口打低再來買。”\n\n他表示，以台股今日盤中跌至月線附近即止跌來看，短線有機會醞釀反彈，月線亦暫時有守，主要是目前看起來沒有什麼實質的大利空，且以台積電尾盤跌幅收斂觀察，顯示跌深技術面有撐。\n\n華南投顧分析師蘇見文稱，受美國總統川普（特朗普）提名沃什（瓦爾許，Kevin Warsh）出任美聯儲主席利空衝擊，美股收低，台股亦連吞三根黑K，今日指數剛好回測至月線附近（31,359.95點），短線大盤料呈中繼整理型態，下檔空間有限並關注台積電表現。\n\n“今天台幣大幅貶值，但台積電日K是紅K，大盤第三日拉回後跌幅收斂，短線能否有撐要看台積電表現。”他說，“台積電法說（投資人說明會）彈高後通常會盤整，未來兩個月大盤呈箱型整理格局。”\n\n他們指出，台股長多格局不變，且以今日盤中跌至月線附近即反彈來看，大盤在連續三個交易日收低後，短線有機會醞釀反彈，往下空間應有限。\n\n印尼和韓國股市周一重挫5%，亞洲新興市場貨幣兌美元匯率走低，投資者正評估特朗普總統提名沃什擔任美聯儲主席的潛在影響。\n\n今日科技類股指數 (.TELI)收低1.31%，台積電收跌0.56%；另金融保險類股指數 (.TFNI)收低0.77%；國泰金和富邦金分別收跌1.46%及0.44%。\n\n分析師預估，明日台股指數區間在31,200-32,000點。（完） \n\n[表格內容]\n**查閱相關新聞或頁面，請點選下列代碼連結**** 美國股市 一周展望 歐洲股市報導 日本股市報導 中港股市報導 中國股市報導 台灣股市報導 股市簡訊 納斯達克最活躍個股 (.AV.O) 紐約證交所最活躍個股 (.AV.N) 納斯達克漲幅居前個股 (.PG.O) 紐約證交所漲幅居前個股 (.PG.N) 納斯達克跌幅居前個股 (.PL.O) 紐約證交所跌幅居前個股 (.PL.N) 標普主要分類指數 (0#.GSPMAJOR) 英股富時指數 CURRENCYCOM:UK100 德股DAX指數 法股CAC-40指數 韓國股市已並入韓國金融市場報導中，相關稿件請點選",
      "ContentLength": 1141,
      "HasTables": false,
      "ScrapedAt": "2026-02-02 15:42:44"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YY0CA:0/",
      "Date": "2026-02-02",
      "Time": "14:08:46",
      "Title": "《全球匯市》美元持穩，投資者權衡沃什領導下的美聯儲前景",
      "Content": "美元周一維持漲幅，投資者評估凱文·沃什(瓦爾許，Kevin Warsh)領導下的美聯儲可能呈現的政策面貌--他傾向於縮減資產負債表規模。\n\n 日圓 也重新進入交易員視野。日本首相高市早苗周末在競選演講中大談日圓貶值的益處，其表態口徑與財務省形成反差。\n\n特朗普提名瓦爾許接任美聯儲主席的消息，上周五引發風險資產拋售潮，貴金屬價格暴跌，美元則收復了上周早些時候的跌幅。\n\n儘管投資者認為瓦爾許傾向於降息，但預計他將收緊美聯儲資產負債表--此舉通常利好美元，因為將減少市場貨幣供應量。\n\n周一亞洲交易時段美元保持強勢，歐元 最新報1.1852美元，遠離1.20美元水平。\n\n英鎊 下跌0.13%至1.3668美元。美元指數 在周五跳漲1%後穩定在97.19。\n\nPIMCO全球經濟顧問、美聯儲前副主席克拉里達(Richard Clarida)表示，儘管瓦爾許將接管一個在進一步寬鬆政策步伐與規模上仍存在分歧的聯邦公開市場委員會(FOMC)，但他認為瓦爾許今年有望實現兩次降息，甚至可能有第三次。\n\n克拉里達指出：\"在未來兩到三次降息之後，我們認為瓦爾許可能會更加謹慎，具體取決於通脹前景。\"\n\n\"根據瓦爾許離開美聯儲後的論述，他很可能不會太依賴有關未來利率路徑的前瞻性指引。\"\n\n市場定價仍維持美聯儲今年降息兩次的預期，且預計最早要到6月才會行動--屆時若瓦爾許獲得參議院確認，他將成為美聯儲主席。 (0#USDIRPR)\n\n **日圓走弱**\n\n 周一日圓/美元 報 154.82，部分受美元走強及高市早苗周末言論影響--她的表態似乎默許日圓貶值。\n\n朝日新聞民調顯示，高市的自民黨可望在即將舉行的眾議院選舉中取得壓倒性勝利。\n\nIG市場分析師Tony Sycamore 表示：\"2月8日的提前大選，很可能成為日圓下一個重要的本土催化劑。\"\n\n\"若自民黨贏得多數席位，可能推動美元兌日圓升向160；而若出現聯合執政局面，匯率或維持在155.00附近，具體取決於聯合執政夥伴。\"\n\n隨著選舉臨近，投資者紛紛拋售日圓和日本公債，預期若高市早苗贏得強有力的授權，日本將推行更具擴張性的財政政策，而自民黨鼓吹的減稅措施，將進一步加劇本已緊張的政府財政壓力。\n\n不過疲軟的日圓近期已經觸底，因交易員持續警惕美日協調干預匯率的可能性--上月底雙方進行匯率詢價後，日圓曾大幅升值。\n\n其他貨幣方面，澳元 下跌0.6%至0.6922美元。澳洲央行將於周二公布利率決議，市場普遍預期將加息。\n\n新西蘭元 下跌0.25%，報0.6004美元。\n\n[表格內容]\n 最新報價 紐約 當日 今年來 2025年 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1848 1.1848 0.00 +0.88 1.1745 美元/日圓 154.9200 154.76 +0.10 -1.10 156.65 歐元/日圓 183.55 183.37 +0.10 -0.24 183.99 美元/瑞郎 0.7731 0.7729 +0.03 -2.42 0.7923 英鎊/美元 1.3670 1.3688 -0.13 +1.46 1.3473 美元/加元 1.3660 1.3613 +0.35 -0.47 1.3724 美元/離岸人民幣 6.9531 6.9577 -0.07 -0.32 6.9756 澳元/美元 0.6922 0.6959 -0.53 +3.75 0.6672 新西蘭元/美元 0.6000 0.6018 -0.30 +4.24 0.5756 澳元/日圓 107.160 107.830 -0.62 +2.51 104.540 新西蘭元/日圓 93.010 93.010 0.00 +2.56 90.690 英鎊/日圓 211.76 211.71 +0.02 +0.35 211.02 澳元/新西蘭元 1.1525 1.1559 -0.29 -0.52 1.1585 美元指數 97.217 96.991 +0.23 -1.12 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1863,
      "HasTables": false,
      "ScrapedAt": "2026-02-02 14:42:45"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YY0EJ:0/",
      "Date": "2026-02-02",
      "Time": "14:08:31",
      "Title": "台灣匯市：台幣貶逾2角創逾一周低位，台股大跌且外資匯出",
      "Content": "台幣兌美元 周一午後擴大貶值幅度至逾2角，最低報31.670，創下逾一周盤中低位，因台股大跌 TWSE:TAIEX且外資匯出。\n\n台股周一終場收跌1.37%報31,624,03點。台幣盤中前低在1月21日的31.692。\n\n美元周一維持漲幅，投資者評估沃什(瓦爾許，Kevin Warsh)領導下的美聯儲可能呈現的政策面貌--他傾向於縮減資產負債表規模。(完)",
      "ContentLength": 180,
      "HasTables": false,
      "ScrapedAt": "2026-02-02 14:42:48"
    },
    {
      "Source": "TradingView - Reuters Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YY054:0/",
      "Date": "2026-02-02",
      "Time": "11:00:43",
      "Title": "台灣債市：五年及10年公債早盤均暫未成交，因缺乏指引且將標債偏觀望",
      "Content": "台灣指標10年公債115/3期 (A15103=TWO)周一早盤暫無成交。交易員稱，因目前市場缺乏指引，且本周四將標債，市場偏觀望，惟以目前買賣報價不算太大觀察，短線仍有機會少量成交。\n\n同時，五年券115/1R期 (A15101R=TWO)發行前交易亦未成交。他們表示，近期短端的五年債壓力較大，殖利率有機會略往上成交，後續關注周四的10年券標債結果。\n\n“最近沒有什麼指引，反正這個禮拜（四）要標10年券了。”一大型證券商交易員說，“現在大家都習慣從初級去拿，要等到（標債）當天或是標債前後才會交易。”\n\n她解釋，因大部分人已經習慣從初級市場建立部位，致次級市場交易相對冷清；惟近期短端的五年券壓力較大，研判應是投資盤想拉高收益率，因而調節短券並將資金移往長端所致。\n\n另一大型證券商交易員指出，這期10年利率不會標太高，預估會落在1.43%附近，主要是相較於日、韓及澳債等亞債，台債沒有來自外資賣壓的風險，且以目前的債券RP利率水準來看，仍有養券空間，利率因而不會標太高。\n\n“最近亞幣債（殖利率）都彈高，只有台債穩如泰山。”他說，“當然，這個利率不合理，但以交易盤的成本來看，實際上還是可以去拿。”\n\n他們表示，因目前整體外部環境不佳，比較不利多方、也沒有偏多的理由，因而預估這期10年券應該不會標得太積極。\n\n美國指標10年期公債收益率 上周五收漲1.2個基點至4.239%，1月累計漲幅達9個基點。\n\n台灣央行將於周四代財政部標售10年券115/3期，金額暫定350億台幣，並於10日發行。\n\n本地時間10:56，五年券115/1R期和10年券115/3期發行前交易電子盤均無成交；台股 TWSE:TAIEX則跌1.70%。 \n\n交易員預估，今日五年債115/1R期殖利率交易區間在1.32-1.35%；10年債115/3期殖利率區間則在1.41-1.43%。（完）\n\n最新相關報導鏈接：\n\n--美國債市：長債下跌，特朗普提名美聯儲主席人選推動收益率曲線趨陡\n\n--日本債市：公債價格下跌，市場押注高市早苗將帶領執政黨取得壓倒性勝選",
      "ContentLength": 872,
      "HasTables": false,
      "ScrapedAt": "2026-02-02 11:42:42"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YY04A:0/",
      "Date": "2026-02-02",
      "Time": "10:48:23",
      "Title": "台灣匯市：台幣早盤貶逾1角因股市跌外資匯出，國際美元強勢",
      "Content": "台幣兌美元 周一早盤走貶逾1角，股市下跌且外資匯出。交易員表示，市場評估下任美聯儲主席可能做出的政策方向，此令貴金屬、股市等風險資產下跌，但國際美元上漲。\n\n匯銀人士也指出，早盤台股 TWSE:TAIEX一度大跌逾2%，而台幣雖走貶逾1角，但成交量並不算大，主要以外資匯出為主；惟美元走強之後，出口商亦有進場拋匯。\n\n針對美聯儲新主席提名人瓦爾許，匯銀人士認為市場可能還在評估、消化此事影響，但針對台幣匯率，“我覺得還是取決於實質需求的影響比較大。”一位大型民營匯銀人士表示。\n\n該人士認為，匯市的實需可能要評估股市的表現、外資在股市操作方向，以及壽險的美元買盤是否被放行等等。短期至農曆年前，台幣料將先落于區間盤整，大區間料在31.30-31.70。\n\n本地時間10:34，台幣兌美元貶1.35角報31.603，交易區間在31.520-31.604；台股 TWSE:TAIEX則跌1.73%報31,508點。\n\n在海外無本金交割遠期外匯市場(NDF)方面，目前指標一個月期美元/台幣換匯點 (TWDNDF=)自折價轉為溢價；一個月美元/台幣遠匯 (TWD1MNDFOR=)報31.623/31.693，上日收在31.627。\n\n交易員預估，今日台幣兌美元匯率主要交易區間在31.500-31.700。（完）\n\n最新相關報導鏈接：\n\n--《全球匯市》美元堅挺日圓重獲注目，投資者權衡瓦爾許領導下的美聯儲",
      "ContentLength": 601,
      "HasTables": false,
      "ScrapedAt": "2026-02-02 11:42:46"
    },
    {
      "Source": "TradingView - Reuters Stocks",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_P8T3R802Z:0/",
      "Date": "2026-02-02",
      "Time": "10:17:09",
      "Title": "台灣股市：早盤下跌逾2%受美股回檔修正拖累，短線將回測月線支撐",
      "Content": "台灣股市周一早盤下跌逾2%，且一舉跌破32,000點整數大關；分析師稱，因市場憂美國總統川普(特朗普)提名的美聯儲新任主席人選偏鷹，上周五美國股市回檔修正，拖累台股跟著走跌。\n\n“因為市場擔心美聯儲新的人選。”兆豐國際投顧副總經理黃國偉說，“大家把他（瓦爾許）過往講過的話和政策做解讀，覺得他會做一個史無前例的壯舉，即要降息，但又要收回市場流動性。”\n\n他並稱，因上周五美國股市回檔修正，加上美元指數 走高，拖累今天台股下跌、台幣亦跟著走貶，短線台股料將續回檔並回測月線（31,000點）支撐。\n\n華爾街主要股指上周五收低，因投資者認為總統特朗普提名前美聯儲理事瓦爾許接替美聯儲主席鮑威爾屬鷹派選擇，同時也在消化企業財報以及高企的通脹數據。\n\n本地時間10:11，台灣加權指數 TWSE:TAIEX下跌2%至31,423.76點，大型權值股台積電 則跌1.41%。（完）",
      "ContentLength": 385,
      "HasTables": false,
      "ScrapedAt": "2026-02-02 10:42:42"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YX0CD:0/",
      "Date": "2026-02-02",
      "Time": "08:19:48",
      "Title": "《全球匯市》美元堅挺日圓重獲注目，投資者權衡瓦爾許領導下的美聯儲",
      "Content": "美元周一守住漲勢，因投資者權衡瓦爾許 (Kevin Warsh) 領導下的美聯儲可能呈現的政策面貌--他傾向於縮減資產負債表規模。\n\n日圓 也重新進入交易員視野。日本首相高市早苗周末在競選演講中大談日圓貶值的益處，其表態口徑與財務省形成反差。\n\n特朗普提名瓦爾許接任美聯儲主席的消息，上周五引發風險資產拋售潮，貴金屬價格暴跌，美元則收復了上周早些時候的跌幅。\n\n儘管投資者認為瓦爾許傾向於降息，但預計他將收緊美聯儲資產負債表--此舉通常利好美元，因為將減少市場貨幣供應量。\n\n周一亞洲早盤時段美元持續強勢，歐元 最新報1.1848美元 ，遠離1.20美元水平。\n\n英鎊 下跌0.05%至1.3680美元，美元指數 在周五跳漲1%後持穩於97.22。\n\nPIMCO全球經濟顧問、美聯儲前副主席克拉里達(Richard Clarida)表示，儘管瓦爾許將接管一個在進一步寬鬆政策步伐與規模上仍存在分歧的聯邦公開市場委員會(FOMC)，但他認為瓦爾許今年有望實現兩次降息，甚至可能有第三次。\n\n克拉里達指出：\"在未來兩到三次降息之後，我們認為瓦爾許可能會更加謹慎，具體取決於通脹前景。\"\n\n\"根據瓦爾許離開美聯儲後的論述，他很可能不會太依賴有關未來利率路徑的前瞻性指引。\"\n\n其他貨幣方面，澳元 下跌0.54%至0.69255美元，新西蘭元 下滑0.3%至0.6001美元。\n\n**日圓走弱**\n\n周一日圓兌美元 下跌0.4%至155.39，部分受美元走強及高市早苗周末言論影響--她的表態似乎默許日圓貶值。\n\n朝日新聞民調顯示，高市的自民黨可望在即將舉行的眾議院選舉中取得壓倒性勝利。\n\nIG市場分析師Tony Sycamore 表示：\"2月8日的提前大選，很可能成為日圓下一個重要的本土催化劑。\"\n\n\"若自民黨贏得多數席位，可能推動美元兌日圓升向160；而若出現聯合執政局面，匯率或維持在155.00附近，具體取決於聯合執政夥伴。\"\n\n隨著選舉臨近，投資者紛紛拋售日圓和日本公債，預期若高市早苗贏得強有力的授權，日本將推行更具擴張性的財政政策，而自民黨鼓吹的減稅措施，將進一步加劇本已緊張的政府財政壓力。\n\n不過疲軟的日圓近期已經觸底，因交易員持續警惕美日協調干預匯率的可能性--上月底雙方進行匯率詢價後，日圓曾大幅升值。\n\n[表格內容]\n 最新報價 紐約 當日 今年來 2025年 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1874 1.1848 +0.22 +1.10 1.1745 美元/日圓 154.9000 154.76 +0.09 -1.12 156.65 歐元/日圓 183.92 183.37 +0.30 -0.04 183.99 美元/瑞郎 0.7716 0.7729 -0.17 -2.61 0.7923 英鎊/美元 1.3701 1.3688 +0.09 +1.69 1.3473 美元/加元 1.3615 1.3613 +0.01 -0.79 1.3724 美元/離岸人民幣 6.9556 6.9577 -0.03 -0.29 6.9756 澳元/美元 0.6969 0.6959 +0.14 +4.45 0.6672 新西蘭元/美元 0.6032 0.6018 +0.23 +4.79 0.5756 澳元/日圓 107.880 107.830 +0.05 +3.19 104.540 新西蘭元/日圓 93.010 93.010 0.00 +2.56 90.690 英鎊/日圓 212.22 211.71 +0.24 +0.57 211.02 澳元/新西蘭元 1.1556 1.1559 -0.03 -0.25 1.1585 美元指數 97.010 96.991 +0.02 -1.33 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1764,
      "HasTables": false,
      "ScrapedAt": "2026-02-02 08:42:42"
    },
    {
      "Source": "TradingView - Reuters Brief",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YX0AU:0/",
      "Date": "2026-02-02",
      "Time": "07:27:09",
      "Title": "《路透早報》--2月2日",
      "Content": "一周全球重要經濟數據和事件預告：\n\n簡體： https://tmsnrt.rs/4rq6zw3\n\n繁體： https://tmsnrt.rs/467jWJa\n\n以下為1月30日下午5:00至2月2日早上7:00的重大新聞與市場摘要：\n\n--特朗普提名瓦爾許出任美聯儲主席，或重塑貨幣政策框架\n\n美國總統特朗普周五提名前美聯儲理事瓦爾許(沃什)在鮑威爾任期於5月結束後出任美聯儲主席，使這位經常批評美聯儲的經濟學者有機會在白宮希望加強對利率決策掌控之際，將其貨幣政策“框架變革”理念付諸實踐。市場認為瓦爾許傾向支持降息，但不會像部分其他後選人選那樣主張更激進地放鬆政策。特朗普通過社交媒體宣布了該提名，提名仍需獲得美國參議院確認。\n\n--共和黨參議員威脅阻止特朗普的美聯儲主席提名人選確認程序\n\n特朗普提名瓦爾許一事在國會遭遇共和黨內部阻力。北卡羅來納州共和黨參議員Thom Tillis稱，在司法部對鮑威爾的調查\"完全且透明地得到解決\"之前，他將繼續\"反對確認任何美聯儲提名人，包括主席人選\"。參議院金融委員會主席斯科特表示，他期待對瓦爾許進行\"審慎而及時的確認程序\"。民主黨參議員沃倫表示，特朗普提名瓦爾許是他為掌控美聯儲所採取的最新行動。\n\n--美聯儲理事沃勒表示，他在1月會議上反對維持利率不變，主張降息25個基點，因為他認為本已疲軟的勞動力市場存在\"重大風險\"，可能出現更嚴重的下滑。\n\n*聖路易斯聯儲總裁穆薩萊姆表示，除非就業市場開始惡化或通脹下降，否則美聯儲無需進一步降息。\n\n--中國1月官方製造業PMI再度跌破50\n\n中國1月官方製造業PMI降至49.3，重陷萎縮區間，主因市場有效需求不足導致新訂單和新出口訂單指數均大幅下滑，且部分製造業行業進入傳統淡季。當月非製造業PMI創逾三年低點，其中建築業景氣度明顯下降，服務業低位徘徊。1月官方非製造業商務活動指數報49.4，為2022年12月以來最低水平。\n\n*中國1月RatingDog製造業PMI將於周一公布，路透調查預估中值顯示，該數據料小幅升至50.3。\n\n--習近平：要推動未來產業發展不斷取得新突破，大力培育科技領軍企業\n\n中國中共中央政治局周五下午就前瞻布局和發展未來產業進行集體學習。習近平主持學習時強調，要立足客觀條件，發揮比較優勢，堅持穩中求進、梯度培育，推動中國未來產業發展不斷取得新突破。他並稱，很多未來產業的興起是靠企業一步步突破帶動的，要大力培育核心技術領先、創新能力強的科技領軍企業和高新技術企業。\n\n*中國官媒--求是雜誌刊登國家主席習近平署名文章指出，實體經濟是金融的根基，服務實體經濟是金融的天職，“決不能脫實向虛”；還要堅持穩中求進，金融政策的收和放不能太急，防止大起大落。\n\n--美國生產者物價創五個月來最大環比漲幅，企業轉嫁關稅成本\n\n美國12月生產者物價指數（PPI）創五個月來最大環比漲幅，部分歸因于進口關稅的傳導效應，這意味著未來數月通脹可能加速，讓美聯儲能夠在一段時間內維持利率穩定。勞工統計局數據顯示，12月最終需求PPI環比漲幅加速至0.5%，為7月以來最大漲幅，預測為上漲0.2%。PPI同比漲幅持平於3.0%。2025年PPI漲幅放緩至3.0%。剔除食品和能源後，12月PPI漲幅加速至0.4%。\n\n--OPEC+同意維持3月產量不變，儘管伊朗局勢緊張推高油價\n\nOPEC+周日結束會議後表示，同意3月維持產量不變，儘管外界擔憂美國可能對伊朗發動軍事打擊，推動油價升至六個月高位。聲明未提及3月之後的政策選項。前OPEC官員Jorge Leon稱，聲明缺乏前瞻性指引。OPEC+下屬的聯合部長級監督委員會(JMMC)周日亦開會，並強調全面遵守產量協議的重要性。\n\n*伊朗國家媒體周日報導，伊朗最高領導人哈梅內伊表示，若美國襲擊伊朗，將引發地區衝突。\n\n*伊朗南部阿巴斯港發生爆炸，革命衛隊否認海軍指揮官遭暗殺\n\n*美國總統特朗普周六表示，印度將購買委內瑞拉石油，而非從伊朗購油。\n\n--烏克蘭官員周日表示，俄羅斯無人機襲擊一輛載有礦工的巴士，造成至少12人死亡。此前數小時，總統澤連斯基宣布啟動新一輪和平談判，而俄羅斯是否暫停對能源基礎設施的襲擊仍存在不確定性。澤連斯基表示，新一輪會談將於2月4日至5日舉行。\n\n--日本首相高市早苗周六在一次競選演講中大談日圓貶值的益處，其表態口徑與財務省形成反差。財務省此前表示，並未排除採取任何措施來應對外匯市場的過度波動。高市早苗周日軟化立場，表示對日圓走勢沒有偏好。\n\n---加拿大經濟增長在11月陷入停滯，服務業擴張被商品生產行業的疲軟所抵消。該國統計局稱，11月GDP環比持平，預估為微增0.1%。統計局初步估計12月產出將增長0.1%，預計2025年加拿大經濟將增長1.3%。\n\n--歐盟統計局數據顯示，歐元區上季度經濟增速超出預期，消費和投資加速增長，抵消出口疲軟及美國貿易政策引發的高度不確定性。歐元區經濟第四季環比增長0.3%，預估為0.2%，同比增速達1.3%，預估為1.2%。\n\n-- 歐洲兩個行業協會表示，中國對歐盟乳製品的反補貼調查已結束，中方下調對部分歐盟乳製品擬徵關稅。由於在非工作時間，無法聯繫到歐盟執委會和中國商務部置評。\n\n--德國失業人數突破300萬大關，創12年來最高，而通脹率則重新升至歐洲央行2%的目標之上。數據顯示，德國1月通脹率意外小幅回升，同比加速至2.1%，預估為維持在2.0%不變。1月失業人數增加17.7萬人，總人數升至308萬人。\n\n--韓國政府周日公布的數據顯示，在人工智能(AI)服務器需求持續推動芯片銷售的帶動下，韓國1月出口同比增長33.9%，為連續第八個月增長，並創下四年半以來的最快增速。\n\n--英相斯塔默稱忽視中國“是愚蠢的”，反駁特朗普\"危險\"論\n\n英國首相斯塔默表示，英國不與中國接觸是愚蠢的，駁斥特朗普關於與中國開展商業往來\"非常危險\"的說法。“主張英國要無視(中國)的想法是愚蠢的，”斯塔默表示，“如果英國成為唯一拒絕與中國接觸的國家，那將不符合我們的國家利益。”中國外交部未立即回應對特朗普言論的置評請求。\n\n--美國總統特朗普周六表示，如果加拿大推進其與中國談判達成的貿易協議，美國將作出重大回應。他說“如果他們達成他所尋求的協議，中國就會接管加拿大。”\n\n--世界貿易組織專家組支持了中國的申訴，建議美國調整對清潔能源的稅收抵免政策。\n\n--巴拿馬最高法院在周四的裁決中表示，香港長和旗下巴拿馬子公司持有的巴拿馬運河港口營運合同未能“符合公共利益和社會福祉”，因而撤銷相關合同。\n\n*香港特區政府此前稱，就該裁決一事，特區政府對此表示強烈不滿。\n\n--台灣央行稱，美國財政部在半年度匯率政策報告指出，長期以來台灣經常帳順差主要反映高儲蓄率，此與人口老化和相對嚴格的財政紀律有關；至於近年來台灣對美國貿易順差大幅成長，主要受美國對台灣科技產品強勁需求影響。\n\n--中國房地產研究機構--中指研究院最新報告稱，根據調查數據，中國1月百城二手住宅均價為12,905元/平方米，環比下跌0.85%，跌幅較上月收窄；整體來看，房地產政策已進入以“穩定預期、縮短調整時間”為目標的新階段。\n\n--中國財政部公布，2025年全年國有企業實現利潤總額40,380.5億元人民幣，同比下降6.3%。據路透統計，這是三年來首次負增長。\n\n--中國國家外匯管理局數據顯示，2025年12月中國外匯市場總計成交3.99萬億美元，較11月增長16%；1-12月累計成交42.64萬億美元。\n\n*外管局還公布，12月服務貿易逆差137億美元，較上月的117億美元有所擴大；2025年服務貿易逆差1,898億美元。\n\n--中國海關總署表示，從2026年1月29日起，允許符合相關要求的韓國野生水產品進口。\n\n--Nvidia(輝達/英偉達)首席執行官黃仁勳周六表示，Nvidia計劃對OpenAI進行一筆“巨額”投資，可能是該公司有史以來最大規模的投資，並否認他對這家ChatGPT開發商感到不滿。\n\n--萬科公布“巨虧”業績預告，料2025年錄得凈虧820億元人民幣，較上年同期的凈虧494.8億元進一步擴大，預計將創其1991年上市以來最大虧損記錄。萬科並公告稱，六隻境內債券將於2月2日開市起停牌。\n\n--中國六家主要的新興電動汽車企業周日公布1月交付量數據，小米汽車首次摘得銷量冠軍，打破了零跑汽車維持了10個月的冠軍紀錄。\n\n--英國《金融時報》周六援引知情人士報導稱，福特汽車已與中國電動汽車製造商小米就成立合資企業、在美國生產電動汽車一事進行過磋商。福特與小米均稱該報導不實。\n\n--中國潮玩品牌泡泡瑪特將把倫敦作為其新的區域總部，並計劃在英國再開設七家門店。這項\"丑萌\"投資案是英國首相斯塔默在訪華期間所促成。\n\n--澳門博彩監察協調局周日發布數據顯示，今年首月博彩收入為226.33億澳門元，較去年同期大升24%。\n\n[市場摘要]\n\n股市：\n\n--美國股市主要股指周五收低，因投資者認為特朗普提名瓦爾許接替美聯儲主席鮑威爾屬鷹派選擇，同時也在消化企業財報以及高企的通脹數據。道瓊斯工業指數下跌179.09點，跌幅0.36%，至48,892.47點；標普500指下跌29.98點，跌幅0.43%，至6,939.03點；納斯達克指下跌223.30點，跌幅0.94%，至23,461.82點。周線標普500指數上漲0.3%，道指下跌0.4%，納指下跌0.2%。月線標普500指數上漲1.4%；納斯達克指數上漲0.9%；道指上漲1.7%，連續第九個月上漲，為2018年以來最長連漲紀錄。\n\n--歐洲主要股指收高，創2021年以來最長的月度連漲紀錄。投資者消化了企業財報數據，同時特朗普提名瓦爾許出任美聯儲主席的消息也對市場產生影響。泛歐STOXX 600指數收漲0.6%至611點，1月累計上漲3%，實現連續第七個月上漲。英國富時100指數收高0.51%。德國DAX指數收漲0.94%。法國CAC-40指數收升0.68%。\n\n匯市：\n\n--美元上漲，此前瓦爾許被選定為下一任美聯儲主席，美元從當周早些時候的急劇拋售中回升，分析師稱這輪拋售在短期內屬於過度反應。美元指數上漲0.79%，至96.93。歐元兌美元下跌0.79%，至1.1874美元。日圓兌美元下跌0.89%，報154.49日圓。\n\n債市：\n\n--美國長期公債價格下跌，此前特朗普提名瓦爾許出任美聯儲主席。鑒於瓦爾許傾向於縮減美聯儲資產負債表，這一選擇被視為利空債券。30年期公債收益率一度跳升6個基點至4.914%，尾盤報4.872%，上漲1.7個基點，並創12月底以來最大單周漲幅，月線累計上漲4個基點，為連續第三個月上漲。10年期公債收益率上漲1.2個基點至4.239%，1月累計漲幅達9個基點。\n\n--兩年期德債收益率小漲0.5個基點至2.06%，但周線累計下跌6.5個基點，為去年10月以來最大周線跌幅。投資者押注歐洲央行在制定貨幣政策時會考慮歐元走強帶來的通縮壓力。10年期德債收益率上漲1.5個基點至2.85%。30年期德債收益率上漲1.6個基點至3.5%。\n\n油市：\n\n--油價微跌，整固近期漲幅，但在美伊持續緊張局勢支撐下，仍維持在近六個月高位附近。布蘭特原油期貨結算價報每桶70.69美元，下跌2美分或0.03%。3月美國原油期貨結算價報每桶65.21美元，下跌21美分或0.32%。\n\n金屬：\n\n--金價重挫，創下1983年以來最大單日跌幅，此前特朗普宣布美聯儲主席提名人選。與此同時，銀價暴跌近30%，勢將創下有記錄以來最大單日跌幅。現貨金收盤大跌逾9.8%，至每盎司4,864.35美元。美國2月期金收跌11.4%，報每盎司4,745.10美元。不過，金價月線仍漲12.8%，為連續第六個月上漲。現貨銀收跌27.1%，報每盎司84.62美元。花旗表示，黃金投資配置受到多種相互交織的地緣政治和經濟風險的影響，但其中約一半的風險可能會在今年晚些時候消退。\n\n--銅價下跌，受美元走強及獲利了結打壓，部分投資者在銅價昨日創下歷史新高後鎖定獲利。1706 GMT，LME指標三個月期銅大跌3.3%，至每噸13,161美元。本月銅價累計上漲6%。\n\n[今日看點]\n\n重要經濟數據(GMT時間)：\n\n--日本、韓國、台灣1月標普全球製造業PMI終值（0030）\n\n--中國1月RatingDog製造業PMI（0145）\n\n--德國12月實質零售銷售（0700）\n\n--英國1月Nationwide房價（0700）\n\n--法國(0850)、德國(0855)、歐元區(0900)、英國(0930)1月製造業PMI終值\n\n--美國1月標普全球製造業PMI終值（1445）\n\n--美國1月ISM製造業指數（1500）\n\n--韓國1月消費者物價指數(CPI)（2300）\n\n重大經濟事件及官員講話(GMT時間)：\n\n--日本央行將公布1月22-23日政策會議意見摘要(上日2350)\n\n--澳洲央行召開貨幣政策委員會會議(至2月3日)\n\n--格陵蘭外交部長莫茨費爾特將在北極前沿會議發表講話。挪威外交大臣艾德也將出席會議（至2月4日）\n\n--英國央行負責金融穩定的副總裁布里登發表主題演講“下一代英國零售支付”(1145)\n\n--英國央行官員Rebecca Jackson發表講話(1330)\n\n--美國亞特蘭大聯邦儲備銀行總裁博斯蒂克在一場座談活動中參加討論(1725)\n\n注：其他重要財經新聞瀏覽請點選；近日《路透早報》請點選。(完)",
      "ContentLength": 5565,
      "HasTables": false,
      "ScrapedAt": "2026-02-02 07:42:41"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YX09L:0/",
      "Date": "2026-02-02",
      "Time": "06:08:52",
      "Title": "全球匯市：最近一周主要貨幣的凈倉位情況--CFTC",
      "Content": "[表格內容]\n以下為美國商品期貨交易委員會(CFTC)周五公布的最近一周投機客持有主要貨幣的凈倉位情況 (單位：口；數值為正代表凈多倉，為負代表凈空倉) 2026年1月27日當周 上一周 日圓 -33,933 -44,829 歐元 132,134 111,695 英鎊 -16,162 -21,980 瑞郎 -42,893 -43,207 比特幣 690 298 欲參考英文原文，請點擊。(完)",
      "ContentLength": 197,
      "HasTables": false,
      "ScrapedAt": "2026-02-02 06:42:43"
    },
    {
      "Source": "TradingView - Reuters Brief",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YV0XI:0/",
      "Date": "2026-01-31",
      "Time": "06:32:47",
      "Title": "《路透早報》--1月31日",
      "Content": "以下為1月30日下午6:00至1月31日早上6:00的重大新聞與市場摘要：\n\n--特朗普提名瓦爾許出任美聯儲主席，或重塑貨幣政策框架\n\n美國總統特朗普周五提名前美聯儲理事瓦爾許在鮑威爾任期於5月結束後出任美聯儲主席。“我認識凱文很久了，我毫不懷疑他將成為最偉大的美聯儲主席之一，也許是最好的。更重要的是，他完全符合‘典型美聯儲主席的形象’，他絕不會讓你失望，”特朗普表示。\n\n*特朗普還表示，向瓦爾許詢問其具體的利率計劃“可能不太合適“，但相信他傾向於降低借貸成本。\n\n*美國國家經濟委員會主任哈西特表示，美聯儲本周未降息實屬失策，同時呼籲迅速批準瓦爾許出任美聯儲主席。\n\n*美聯儲理事米蘭表示，他認為瓦爾許會完成他在美聯儲的剩餘任期。米蘭還表示，特朗普從未要求他在貨幣政策方面採取任何行動。\n\n--特朗普提名瓦爾許領導美聯儲，華爾街聚焦其降息與縮表平衡\n\n特朗普提名瓦爾許領導美聯儲，儘管這一決定消除了華爾街對下任美聯儲主席人選的不確定性，但投資者仍在評估，這位前美聯儲理事過去的鷹派傾向將如何與特朗普總統要求大幅降息的立場相契合。\n\n--共和黨參議員威脅阻止特朗普的美聯儲主席提名人選確認程序\n\n特朗普提名瓦爾許一事在國會遭遇共和黨內部阻力。北卡羅來納州共和黨參議員Thom Tillis稱，在司法部對鮑威爾的調查\"完全且透明地得到解決\"之前，他將繼續\"反對確認任何美聯儲提名人，包括主席人選\"。參議院金融委員會主席斯科特表示，他期待對瓦爾許進行\"審慎而及時的確認程序\"。民主黨參議員沃倫表示，特朗普提名瓦爾許是他為掌控美聯儲所採取的最新行動。\n\n--美聯儲理事沃勒表示，他在本周會議上反對維持利率不變，主張降息25個基點，因為他認為本已疲軟的勞動力市場存在\"重大風險\"，可能出現更嚴重的下滑。\n\n*聖路易斯聯儲總裁穆薩萊姆表示，除非就業市場開始惡化或通脹下降，否則美聯儲無需進一步降息。\n\n--美國生產者物價創五個月來最大環比漲幅，企業轉嫁關稅成本\n\n美國12月生產者物價指數（PPI）創五個月來最大環比漲幅，部分歸因于進口關稅的傳導效應，這意味著未來數月通脹可能加速，讓美聯儲能夠在一段時間內維持利率穩定。勞工統計局數據顯示，12月最終需求PPI環比漲幅加速至0.5%，為7月以來最大漲幅，預測為上漲0.2%。PPI同比漲幅持平於3.0%。2025年PPI漲幅放緩至3.0%。剔除食品和能源後，12月PPI漲幅加速至0.4%。\n\n--特朗普表示，伊朗希望達成協議，但未透露更多細節，稱\"讓我們拭目以待\"。他還表示，他認為已經接近達成結束俄羅斯對烏克蘭戰爭的協議。\n\n---加拿大經濟增長在11月陷入停滯，服務業擴張被商品生產行業的疲軟所抵消。該國統計局稱，11月GDP環比持平，預估為微增0.1%。統計局初步估計12月產出將增長0.1%，預計2025年加拿大經濟將增長1.3%。\n\n--歐洲央行調查顯示，歐元區消費者在12月將長期通脹預期上調至歷史新高。\n\n--歐盟統計局數據顯示，歐元區上季度經濟增速超出預期，消費和投資加速增長，抵消出口疲軟及美國貿易政策引發的高度不確定性。歐元區經濟第四季環比增長0.3%，預估為0.2%，同比增速達1.3%，預估為1.2%。\n\n-- 歐洲兩個行業協會表示，中國對歐盟乳製品的反補貼調查已結束，中方下調對部分歐盟乳製品擬徵關稅。由於在非工作時間，無法聯繫到歐盟執委會和中國商務部置評。\n\n--德國失業人數突破300萬大關，創12年來最高，而通脹率則重新升至歐洲央行2%的目標之上。數據顯示，德國1月通脹率意外小幅回升，同比加速至2.1%，預估為維持在2.0%不變。1月失業人數增加17.7萬人，總人數升至308萬人。\n\n--英相斯塔默稱忽視中國“愚蠢”，反駁特朗普\"危險\"論\n\n英國首相斯塔默表示，英國不與中國接觸是愚蠢的，駁斥特朗普關於與中國開展商業往來\"非常危險\"的說法。“主張英國要無視(中國)的想法是愚蠢的，”斯塔默表示。“如果英國成為唯一拒絕與中國接觸的國家，那將不符合我們的國家利益。”中國外交部未立即回應對特朗普言論的置評請求。\n\n--英國央行數據顯示，12月英國貸款機構批準的抵押貸款數量降至61,013件，創2024年6月以來新低，預估中值為64,800件。\n\n--官方數據顯示，上周日本並未干預外匯市場，證實政府捍衛日圓的努力僅限於口頭警告。\n\n-- 伊朗國家媒體報導，伊朗總統佩澤希齊揚向阿聯酋總統表示，伊朗將對\"任何侵略行為\"作出即刻而果斷的回應。\n\n--路透看到的一封信函顯示，聯合國秘書長古特雷斯對各成員國表示，聯合國正面臨\"迫在眉睫的財政崩潰\"風險，原因包括未繳會費以及一項迫使其退還未用資金的預算規則。聯合國發言人未立即回應置評請求。\n\n--世界衛生組織官員表示，尼帕病毒傳播的風險偏低，並稱在與印度兩名感染者接觸的190多人中，沒有一人檢測呈陽性或出現該疾病的症狀。\n\n--世界貿易組織專家組支持了中國的申訴，建議美國調整對清潔能源的稅收抵免政策。\n\n--五位OPEC+代表向路透透露，OPEC+很可能在周日會議上維持暫停增產的決定。OPEC及沙特、俄羅斯當局未立即回應置評請求。\n\n--台灣央行稱，美國財政部在半年度匯率政策報告指出，長期以來台灣經常帳順差主要反映高儲蓄率，此與人口老化和相對嚴格的財政紀律有關；至於近年來台灣對美國貿易順差大幅成長，主要受美國對台灣科技產品強勁需求影響。\n\n--香港特區政府稱，就巴拿馬最高法院裁定巴拿馬政府與和記港口巴拿馬港口公司續約經營的兩個巴拿馬港口違憲一事，特區政府對此表示強烈不滿。\n\n--香港證監會發出通函指示上市保薦人從速進行內部檢討，以糾正招股文件擬備工作中的嚴重缺失。\n\n--中國財政部公布，2025年全年國有企業實現利潤總額40,380.5億元人民幣，同比下降6.3%。據路透統計，這是三年來首次負增長。\n\n--中國國家外匯管理局數據顯示，2025年12月中國外匯市場總計成交3.99萬億美元，較11月增長16%；1-12月累計成交42.64萬億美元。\n\n*外管局還公布，12月服務貿易逆差137億美元，較上月的117億美元有所擴大；2025年服務貿易逆差1,898億美元。\n\n--中國海關總署表示，從2026年1月29日起，允許符合相關要求的韓國野生水產品進口。\n\n--中國證監會召開資本市場“十五五”規劃上市公司座談會，證監會主席吳清強調，要全力鞏固資本市場穩中向好勢頭，聚焦持續深化資本市場投融資綜合改革、提高制度包容性適應性，抓緊推出深化創業板改革，持續推動科創板改革落實落地。\n\n*證監會還表示，為落實關於推動中長期資金入市的指導意見和實施方案，進一步完善上市公司再融資戰略投資者制度，對《上市公司證券發行註冊管理辦法》部分規定進行修改完善，包括擴大戰略投資者類型，明確最低持股比例要求等。\n\n--萬科公布“巨虧”業績預告，料2025年錄得凈虧820億元人民幣，較上年同期的凈虧494.8億元進一步擴大，預計將創其1991年上市以來最大虧損記錄。萬科並公告稱，六隻境內債券將於2月2日開市起停牌。\n\n[市場摘要]\n\n股市：\n\n--華爾街主要股指周五收低，因投資者認為總統特朗普提名前美聯儲理事瓦爾許接替美聯儲主席鮑威爾屬鷹派選擇，同時也在消化企業財報以及高企的通脹數據。道瓊斯工業指數下跌179.09點，跌幅0.36%，至48,892.47點；標普500指下跌29.98點，跌幅0.43%，至6,939.03點；納斯達克指下跌223.30點，跌幅0.94%，至23,461.82點。對利率敏感、以小盤股為主的羅素2000指數近來跑贏大盤，但周五收跌1.6%。不過，羅素2000指數本月仍上漲逾5%，相比之下，標普500指數上漲1.4%，納斯達克指數上漲0.9%。道指上漲1.7%，連續第九個月上漲，為2018年以來最長連漲紀錄。本周，標普500指數上漲0.3%，道指下跌0.4%，納指下跌0.2%。\n\n--歐洲主要股指收高，創2021年以來最長的月度連漲紀錄。投資者消化了企業財報數據，同時特朗普提名瓦爾許出任美聯儲主席的消息也對市場產生影響。泛歐STOXX 600指數收漲0.6%至611點，1月累計上漲3%，實現連續第七個月上漲。英國富時100指數收高0.51%。德國DAX指數收漲0.94%。法國CAC-40指數收升0.68%。\n\n匯市：\n\n--美元上漲，此前瓦爾許被選定為下一任美聯儲主席，美元從本周早些時候的急劇拋售中回升，分析師稱這輪拋售在短期內屬於過度反應。美元指數上漲0.79%，至96.93。歐元兌美元下跌0.79%，至1.1874美元。日圓兌美元下跌0.89%，報154.49日圓。美元兌日圓本周下跌0.8%。比特幣下跌0.16%，至84,264美元，稍早觸及81,104美元的11月21日以來最低。\n\n債市：\n\n--美國長期公債價格下跌，此前特朗普提名瓦爾許出任美聯儲主席。鑒於瓦爾許傾向於縮減美聯儲資產負債表，這一選擇被視為利空債券。30年期公債收益率一度跳升6個基點至4.914%，尾盤報4.872%，上漲1.7個基點，並創12月底以來最大單周漲幅，本月累計上漲4個基點，為連續第三個月上漲。10年期公債收益率上漲1.2個基點至4.239%，1月累計漲幅達9個基點。兩年/10年期公債利差一度擴大至71.50個基點的逾一周最闊，盤尾報71.3個基點，本月擴大近4個基點。兩年期公債收益率下跌2.5個基點至3.527%，錄得11月中以來最大單周跌幅，但創2025年7月以來最大月度漲幅。\n\n--兩年期德債收益率小漲0.5個基點至2.06%，但本周累計下跌6.5個基點，為去年10月以來最大周線跌幅，1月迄今已下跌6個基點，創去年4月以來最大月度跌幅。投資者押注歐洲央行在制定貨幣政策時會考慮歐元走強帶來的通縮壓力。10年期德債收益率上漲1.5個基點至2.85%。30年期德債收益率上漲1.6個基點至3.5%。法/德公債利差報58個基點。意大利10年期公債收益率上漲2個基點至3.47%，與可比德債利差約為61個基點。\n\n油市：\n\n--油價微跌幾美分，整固近期漲幅，但在美伊持續緊張局勢支撐下，仍維持在近六個月高位附近。布蘭特原油期貨結算價報每桶70.69美元，下跌2美分或0.03%。3月美國原油期貨結算價報每桶65.21美元，下跌21美分或0.32%。\n\n金屬：\n\n--金價重挫，勢將創下1983年以來最大單日跌幅，此前特朗普宣布美聯儲主席提名人選。與此同時，銀價暴跌近30%，勢將創下有記錄以來最大單日跌幅。1857 GMT，現貨金大跌9.5%，至每盎司4,883.62美元。美國2月期金收跌11.4%，報每盎司4,745.10美元。不過，金價本月仍上漲逾13%，為連續第六個月上漲。現貨銀暴跌27.7%，報每盎司83.99美元，盤中一度跌至77.72美元。花旗表示，黃金投資配置受到多種相互交織的地緣政治和經濟風險的影響，但其中約一半的風險可能會在今年晚些時候消退。。\n\n--銅價下跌，受美元走強及獲利了結打壓，部分投資者在銅價昨日創下歷史新高後鎖定獲利。1706 GMT，LME指標三個月期銅大跌3.3%，至每噸13,161美元。本月銅價累計上漲6%。\n\n注：其他重要財經新聞瀏覽請點選；近日《路透早報》請點選。(完)",
      "ContentLength": 4648,
      "HasTables": false,
      "ScrapedAt": "2026-01-31 06:42:40"
    },
    {
      "Source": "TradingView - Reuters Stocks",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YV18E:0/",
      "Date": "2026-01-31",
      "Time": "06:27:11",
      "Title": "美國股市：下跌，投資者擔憂美聯儲主席提名人、企業盈利和通脹問題",
      "Content": "華爾街主要股指周五收低，因投資者認為總統特朗普提名前美聯儲理事瓦爾許接替美聯儲主席鮑威爾屬鷹派選擇，同時也在消化企業財報以及高企的通脹數據。 \n\n除了評估美國與伊朗等國家之間的緊張局勢帶來的風險外，投資者還擔心美國政府可能再次停擺，因為參議院出現了新的障礙，阻礙達成一項能夠確保各機構繼續獲得撥款的協議。\n\n在美聯儲方面，55歲的瓦爾許預計將支持降息，但不會採取其他部分潛在人選所主張的更激進地放寬政策。若獲參議院確認，他將在鮑威爾5月任期結束後接掌美聯儲，而他曾主張美聯儲應縮減其在經濟中的角色，並重新審視貨幣政策框架。\n\n“市場正在根據特朗普提名瓦爾許以及貨幣政策前景進行重新定價，”Citizens Wealth首席投資官Michael Hans說。他還指出，美元周五走強，貴金屬大幅下跌，近期交易模式也出現逆轉。\n\n蘋果 股價收復盤中失地，收高0.4%，該公司周四公布業績。數據顯示，美國12月生產者價格升幅超預期，暗示未來數月通脹可能回升。\n\nEdward Jones高級全球策略師Angelo Kourkafas表示：“投資者擔憂美聯儲主席提名、科技企業喜憂參半的財報、揮之不去的通脹壓力，以及政府可能短暫停擺的不確定性。”\n\n道瓊斯工業指數 下跌179.09點，跌幅0.36%，至48,892.47點；標普500指數 下跌29.98點，跌幅0.43%，至6,939.03點；納斯達克指數 下跌223.30點，跌幅0.94%，至23,461.82點。\n\n對利率敏感、以小盤股為主的羅素2000指數 近來跑贏大盤，但周五收跌1.6%。\n\n不過，羅素2000指數本月仍上漲逾5%，相比之下，標普500指數上漲1.4%，納斯達克指數上漲0.9%。道指上漲1.7%，連續第九個月上漲，為2018年以來最長連漲紀錄。\n\n本周，標普500指數上漲0.3%，道指下跌0.4%，納指下跌0.2%。\n\n在標普500指數的11大板塊中，材料指數 跌幅居前，下跌1.9%，因美國上市的金礦和銀礦股隨金價和銀價大幅拋售而走低。\n\n防禦類必需消費品股 是當日表現最好的板塊，上漲1.4%。\n\n本周，投資者對大型企業的財報反應不一，並發出嚴厲警告：只要經濟增長持續下去，創紀錄的資本支出狂潮就會被容忍。\n\n蘋果表示，3月當季營收預計將同比增長多達16%，好於預期，但也警告內存芯片價格上漲開始侵蝕利潤。\n\n微軟 周五收跌0.7%，周四大跌10%，創2020年3月以來最大單日跌幅，因雲業務營收表現不佳。Meta 股價周五收跌3%。\n\n特斯拉 周五上漲3.3%，為標普500指數提供最大提振。此前有報導稱，SpaceX正在與特斯拉及其它馬斯克旗下企業洽談合作。該股周四在發布財報後下跌。\n\n紐約證交所跌漲股家數比為1.59:1，納斯達克市場為2.02:1。\n\n19只標普500指數成分股創52周新高，10只創新低；72只納斯達克指數成分股創新高，205只創新低。\n\n美國各交易所累計成交238.8億股，高於過去20個交易日的日均成交量194.2億股。(完)\n\n[表格內容]\n****查閱相關新聞或頁面，請點選下列代碼連結**** 美國股市 一周展望 歐洲股市報導 日本股市報導 中港股市報導 中國股市報導 台灣股市報導 股市簡訊 納斯達克最活躍個股 (.AV.O) 紐約證交所最活躍個股 (.AV.N) 納斯達克漲幅居前個股 (.PG.O) 紐約證交所漲幅居前個股 (.PG.N) 納斯達克跌幅居前個股 (.PL.O) 紐約證交所跌幅居前個股 (.PL.N) 標普主要分類指數 (0#.GSPMAJOR) 英股富時指數 CURRENCYCOM:UK100 德股DAX指數 法股CAC-40指數 韓國股市已並入韓國金融市場報導中，相關稿件請點選",
      "ContentLength": 1562,
      "HasTables": false,
      "ScrapedAt": "2026-01-31 06:42:43"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YV16A:0/",
      "Date": "2026-01-31",
      "Time": "04:49:35",
      "Title": "《全球匯市》美元上漲，特朗普提名瓦爾許出任美聯儲下一任主席",
      "Content": "美元周五上漲，此前美聯儲前理事瓦爾許被選定為下一任美聯儲主席，美元從本周早些時候的急劇拋售中回升，分析師稱這輪拋售在短期內屬於過度反應。\n\n特朗普總統周五宣布，在鮑威爾的任期於5月結束時，瓦爾許將接任美聯儲主席一職。市場普遍認為瓦爾許可能支持較低利率，但其放鬆政策的力度將遠不及其他潛在提名人選。\n\nBannockburn全球外匯首席市場策略師Marc Chandle指出，周五美元上漲至少部分歸因于市場在公告前夕調整倉位。\n\n“從短期動能來看，美元處於嚴重超賣狀態，”他稱。同時，瓦爾許“畢竟只是一個人……短期內並沒有達成降息共識。即便到年底會像12月點陣圖所暗示的那樣出現一兩次遲到的降息，也不代表很快就會降息。”\n\n美聯儲12月會議後公布的決策者預測顯示，預期中位數是今年降息一次、幅度為25個基點。\n\n美聯儲周三如市場普遍預期維持利率不變。鮑威爾稱當前經濟穩健，通脹與就業風險均已緩解，這一前景可能意味著要等待較長時間才會進一步降息。\n\n聯邦基金期貨交易員目前預計今年將降息52個基點，首次25個基點的降息可能出現在6月。\n\n凱投宏觀首席市場經濟學家John Higgins在報告中指出：\"市場對特朗普提名瓦爾許擔任美聯儲下任主席的反應，基本符合我們的判斷，即總統將作出相對穩妥的選擇。“\n\n他稱：\"市場普遍認為瓦爾許並非總統的傀儡，他不會助長美聯儲獨立性遭到進一步削弱的趨勢，也不會加劇貨幣貶值的擔憂。\"\n\n美元指數 上漲0.79%，至96.93。歐元兌美元 下跌0.79%，至1.1874美元。\n\n周五數據顯示美國12月生產者物價漲幅超預期，企業似乎正將進口關稅導致的成本上漲轉嫁給消費者，美元應聲進一步上漲。\n\n特朗普周四支持參議院兩黨達成的旨在避免政府停擺的支出協議，但他承認停擺仍有可能發生。國會議員們仍在就限制移民執法人員的措施進行談判。\n\n地緣政治風險持續發酵。特朗普周四表示計劃與伊朗對話，但與此同時美國又向中東派遣一艘軍艦，國防部長赫格塞斯稱軍方隨時準備好執行總統的任何決定。\n\n日圓兌美元 下跌0.89%，報154.49日圓。不過美元兌日圓本周仍可能下跌0.8%。 \n\n隨著日本決策者暗示可能與美國協調干預外匯市場以捍衛此前跌至近18個月最低的日圓，日圓在過去一周大幅上漲。\n\n美國財政部在最新提交國會的匯率報告中，並未再呼籲日本央行繼續加息，刪除了半年前報告中的相關表述。\n\n加密貨幣方面，比特幣 下跌0.16%，至84,264美元，稍早觸及81,104美元的11月21日以來最低。（完）\n\n[表格內容]\n****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1262,
      "HasTables": false,
      "ScrapedAt": "2026-01-31 05:42:40"
    },
    {
      "Source": "TradingView - Reuters Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YV15X:0/",
      "Date": "2026-01-31",
      "Time": "04:35:17",
      "Title": "美國債市：長債下跌，特朗普提名美聯儲主席人選推動收益率曲線趨陡",
      "Content": "美國長期公債價格周五下跌，此前總統特朗普表示將提名前美聯儲理事瓦爾許(Kevin Warsh)出任美聯儲主席。鑒於瓦爾許傾向於縮減美聯儲資產負債表，這一選擇被視為利空債券。\n\n午後交易時段因周末臨近成交量減少，長債收益率漲幅有所收窄。\n\n瓦爾許的提名促使投資者重新評估公債市場政策支持前景，推高長債收益率。他曾呼籲美聯儲進行體制改革，包括減少量化寬鬆力度，這意味著他可能推動縮減美聯儲持有的債券規模。\n\n\"若縮減資產負債表成為首要任務，在其他條件不變的情況下，這將對長期債券收益率形成上行壓力，因為公債市場將面臨額外供應，\"賓夕法尼亞州Bryn Mawr Trust固定收益部主管Jim Barnes表示。\n\n但Barnes認為縮減資產負債表未必是現實目標。\n\n\"如果你設想有人上任後可能會著手縮減資產負債表規模，我只是認為，這不太可能會成為一開始的工作重點。接下來將會評估其他事項，最重要的是通脹方面和雙重使命中的勞動力市場方面，並試圖弄清楚短期利率該如何調整，\"Barnes指出。\n\n一些分析師還表示，瓦爾許過往的鷹派立場在一定程度上緩解了市場對其可能順應特朗普對美聯儲政策期望的擔憂。\n\n美國30年期公債收益率 (US30YT=RR) 早盤一度跳升6個基點至4.914%的盤中高位，尾盤報4.872%，上漲1.7個基點，有望創下自去年12月底以來最大單周漲幅。本月該收益率累計上漲4個基點，實現連續第三個月上漲。\n\n指標10年期公債收益率 上漲1.2個基點至4.239%，1月累計漲幅達9個基點。\n\n隨著瓦爾許獲提名消息傳出，收益率曲線趨陡。兩年期與10年期公債利差 (US2US10=TWEB)一度擴大至71.50個基點，創逾一周最大值。最新數據顯示該利差為71.3個基點，高於周四尾盤的66.8個基點。1月份該收益率曲線已陡峭化近4個基點。\n\n投資者同時指出對美聯儲獨立性的擔憂，強調瓦爾許是特朗普提名的人選，且美國總統曾多次批評美聯儲主席鮑威爾的降息步伐。\n\nNatixis Investment Managers Solutions投資管理首席投資策略師Jack Janasiewicz表示：\"我們提醒投資者，單一票數不足以改變貨幣政策方向。\"\n\n\"考慮到12位成員組成的聯邦公開市場委員會最近的政策利率決議中僅有兩名決策者支持降息，瓦爾許需要極大影響力才能說服其他投票成員，從而在未來推動更多降息時獲得所需多數票。\"\n\n美國兩年期公債收益率 (US2YT=RR) 下跌2.5個基點至3.527%。該收益率錄得11月中以來最大單周跌幅，但創下2025年7月以來最大月度漲幅。\n\n在數據顯示美國12月生產者價格漲幅超預期，表明企業正將進口關稅相關成本轉嫁給消費者後，公債收益率走高。\n\n美國勞工部勞工統計局數據顯示，最終需求生產者物價指數(PPI)上月升0.5%，此前11月未經修正的漲幅為0.2%。路透訪查的經濟學家此前預測該指數將上漲0.2%。\n\n12月PPI同比上漲3.0%，與11月漲幅持平。\n\n周五美國利率期貨顯示，市場預期今年將降息約51個基點，相當於兩次各25個基點的降息。而上周美聯儲維持利率不變後，市場預期降息幅度為44個基點。\n\n[表格內容]\n20:16 GMT 價格 收益率% 收益率變動 兩年期公債 (US2YT=RR) 99.94921875 3.5265 -0.0250 五年期公債 (US5YT=RR) 99.7890625 3.7967 -0.0080 10年期公債 98.078125 4.2414 +0.0140 30年期公債 (US30YT=RR) 96.078125 4.8756 +0.0220 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 美國現貨公債 美國指標公債報價 (0#USBMK=) 英國公債市場 歐元區公債市場 日本公債市場 中國債市 台灣債市 歐元區指標公債報價 (0#EUBMK=) 利率或央行相關報導",
      "ContentLength": 1646,
      "HasTables": false,
      "ScrapedAt": "2026-01-31 04:42:41"
    },
    {
      "Source": "TradingView - Reuters Stocks",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YV1W5:0/",
      "Date": "2026-01-31",
      "Time": "01:25:05",
      "Title": "特朗普任命沃什接替鮑威爾出任美聯儲主席後，美國股市下滑",
      "Content": "Pranav Kashyap/Twesha Dikshit\n\n 美國總統特朗普提名 前美聯儲理事沃什（Kevin Warsh）接替鮑威爾（Jerome Powell）領導美國央行後，美國股市周五下跌，許多投資者認為這一決定偏向鷹派。 \n\n現年55歲的美聯儲批評家沃什預計將傾向於降低利率，同時不會採取與其他一些潛在提名人有關的更激進的貨幣寬鬆政策。 \n\n他的任命需要參議院的確認，而主席鮑威爾的任期將於5月結束。如果得到確認，沃什將執掌一家央行，他認為該央行應縮減其在經濟中的作用，並重新思考其貨幣政策方法。\n\n\"沃什過去一直是鷹派人物，因此很難知道他究竟會朝哪個方向發展。AlphaCore財富咨詢公司的首席投資官格斯特（Eric Gerster）說：\"他歷來以更關注通脹而著稱。 \n\n- \"他對降低利率的想法持更開放的態度\n- 這顯然是本屆政府所尋求的。 \n\n與此同時，12月份生產者價格增幅超過預期 ，這表明未來幾個月通脹可能回升。 \n\n投資者繼續押注到2026年底至少會有兩次25個基點的降息。美國央行本周早些時候維持利率穩定，暫停了支撐美國股市的寬鬆周期。\n\n美東時間上午11:58，道瓊斯工業平均指數 下跌421.27點，或0.86%，至48,650.29點；標普500指數 下跌39.69點，或0.57%，至6,929.41點；納斯達克綜合指數 下跌175.50點，或0.74%，至23,509點。 \n\n對利率更為敏感的小型股羅素2000指數 下跌了1.6%。 \n\n華爾街的 \"恐懼指數\"--CBOE波動率指數從周四創下的一周高點19.31點回落至17.3點。\n\n小型股 1 月份表現優異 \n\n蘋果 結束了本周的科技財報，預計 3 月份季度收入增長將高於預期，最高可達 16%，但警告稱 ，存儲芯片價格上漲已開始對盈利能力構成壓力。 \n\n投資者本周對大型科技公司的財報發出了嚴正警告：只要業績持續增長，創紀錄的資本支出狂潮將被容忍。 \n\n微軟 的雲計算收入未能給人留下深刻印象，創下 2020 年 3 月以來最糟糕的一天，而 Meta 周四大漲 10%。 \n\n當天， 上漲了4.7%，因為有報導稱太空探索技術公司（SpaceX）正在探索與電動汽車製造商和埃隆-馬斯克（Elon Musk）經營的其他公司進行交易。 \n\n過去一年，人工智能交易推動美國股市創下歷史新高，但現在人工智能交易的門檻已經提高，有跡象表明，那些高增長的公司正在受到擠壓，這促使投資者轉向小盤股和其他被忽視的市場角落。\n\n小盤股羅素2000指數（Russell 2000 index） 和標準普爾600指數（S&P 600 index） (.SPCY)月底有望上漲近5%。\n\n相比之下，標普500指數和納斯達克指數的漲幅均略高於1.3%。\n\n\"格斯特補充說：\"我們看到的是，人們開始關注周期性因素，而不再關注圍繞人工智能的一些世俗因素。 \n\n與此同時，道指有望實現連續第九個月上漲，這是自2018年以來最長的連勝紀錄。 \n\n由於人工智能刺激了存儲需求，閃迪 第三季度業績預期好於預期，股價大漲9.7%。KLA Corp 第二季度利潤和收入超出華爾街預期，但股價下跌12.6%。\n\n在美國上市的黃金和白銀礦業公司股價下跌，金銀價格下跌超過5%，白銀價格下跌11%。標準普爾材料指數 下跌了2%，跌幅居前。",
      "ContentLength": 1393,
      "HasTables": false,
      "ScrapedAt": "2026-01-31 01:42:43"
    },
    {
      "Source": "TradingView - Reuters Stocks",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YV07M:0/",
      "Date": "2026-01-30",
      "Time": "19:08:45",
      "Title": "《一周展望》密集發布的企業財報及月度就業數據將考驗美國股市",
      "Content": "在重量級個股微軟 的財報令人感到失望、導致股市承壓之後，包括Alphabet 以及亞馬遜 等新一批大型企業財報出爐將令美國股市面臨考驗。\n\n華爾街也將關注將於2月6日發布的美國月度就業報告。本週，美國聯邦儲備理事會(美聯儲/FED)暫停降息週期，指稱勞動市場出現穩定跡象。\n\n隨著股市進入多頭市場的第四年，投資人對不斷上升的估值保持謹慎，尤其是那些受益於人工智能(AI)帶動獲利的樂觀情緒而股價飆升的公司。\n\n微軟在支援AI應用的基礎設施上投入巨資，但由於其雲端業務表現不佳，週四股價大幅下跌；與此同時，由於業內其他領域也出現令人失望的情況， 軟體股普遍受到打擊。\n\n“對於那些被寄予厚望的公司來說，它們必須拿出成績來，”Plante Moran Financial Advisors首席投資官貝爾德表示。 “即使它們實現了增長，但如果增長幅度未達到市場預期，它們的股價就有可能受到衝擊。”\n\n儘管週四股市下跌，標普500指數 今年以來仍上漲近2%，接近歷史高點。本週早些時候，該指數首次突破7,000點大關，隨後有所回落。\n\n**財報季達到高潮**\n\n標普500指數成分股中約有四分之一的公司將在下周公布季度業績，強勁的獲利成長預期是支撐2026年股市樂觀前景的關鍵因素。\n\n截至週四，標普500指數成分股公司中已有133家公布業績，其中74.4%的公司獲利超出分析師預期，略低於先前四個季度的78%（數據來自LSEG/IBES）。預計第四季獲利將比上年同期成長10.2%。\n\n與微軟不同，另一家市值龐大的公司Meta 公布季度營收強勁，使其股價獲得提振；Meta也是AI領域的主要投資方。\n\n投資者現在將關注谷歌母公司Alphabet和亞馬遜這兩家專注於AI的“超大規模企業”的業績和資本支出計劃。\n\nTD Wealth首席投資策略師Sid Vaidya表示：“儘管投資者對幾家超大規模數據中心運營商的財報反應不一，但這確實證實了用於構建AI基礎設施的資本支出不會減少。”\n\n下週即將發布財報的其他公司包括減肥藥生產商禮來 、芯片製造商AMD 及媒體巨頭士尼 。預計2026年，標普500指數成分股整體獲利將成長15%，這使得它們的財務前景成為人們仔細檢視的對象。\n\n“股市在很大程度上反映了推動股市上漲的正面基本面因素，而獲利成長是其中最重要的部分，”Vaidya指出。\n\n**就業市場穩定嗎？**\n\n下週的就業報告也將為華爾街提供一個審視經濟健康狀況的關鍵機會。路透的一項調查顯示，1月非農業就業報告預計將顯示新增7萬個就業崗位。\n\n去年底長達43天的政府停擺導致關鍵經濟報告延遲發布，資料蒐集目前正逐步恢復正常。備受關注的月度消費者物價指數（CPI）將於下下周公布，該指數是衡量通膨趨勢的重要指標。\n\nGlenmede 投資策略副總裁Michael Reynolds表示：“由於去年政府停擺，我們還沒有真正清楚地了解勞動力市場和通貨膨脹的狀況，因此我們認為這些因素可能比往常更加重要。”\n\n週三美聯儲會議後，市場目前預期美聯儲將在6月的會議之前不會進一步降息，儘管勞動力市場任何意外疲軟都可能動搖這些預期。\n\n“總的來說，經濟正處於良好的成長軌道上，我預計光是這一點就應該有助於為就業人數提供一些支撐，”Baird 說。(完)",
      "ContentLength": 1368,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 19:42:43"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YV0KJ:0/",
      "Date": "2026-01-30",
      "Time": "18:00:31",
      "Title": "《全球匯市》美聯儲新任主席人選提振美元",
      "Content": "美元周五回升，收復了本周部分跌幅。此前美國總統特朗普表示將很快宣布美聯儲主席提名人選，有報導稱 前美聯儲理事瓦爾許(Kevin Warsh)可能是最終人選。\n\n歐元兌美元 最新下跌0.3%至1.1932美元，英鎊兌美元 下跌0.4%至1.3765美元，美元兌日圓 則上漲0.5%至153.88日圓。\n\n美元指數因此上漲0.37%，報96.48。 \n\n特朗普表示，他計劃於周五公布接替美聯儲主席 鮑威爾（Jerome Powell）的人選。\n\n彭博報導稱瓦爾許將獲提名接替鮑威爾，而知情人士向路透透露他周四已在白宮與特朗普會面。\n\n三菱日聯金融集團全球市場歐洲、中東和非洲地區研究主管Derek Halpenny表示，美元上漲是\"可以理解的反應，因為這將確認下一任美聯儲主席不會是哈西特（Kevin Hassett）或 里德爾（Rick Rieder）\"。\n\n\"這兩位候選人曾先後被視為熱門人選，但市場普遍認為他們經驗不足且與特朗普總統關係過於密切，因而更易受其影響。\"\n\n他強調\" 瓦爾許的情況截然不同\"。\n\n在共和黨與民主黨議員敲定協議避免政府關門後，美元也獲得提振。\n\n海外衝突升級和嚴查境內移民引發的不安情緒重創美元，本周早些時候美元指數跌至四年低點。\n\n隨著伊朗局勢持續周四表示計劃與德黑蘭領導人對話與此同時美國又向中東派遣一艘軍艦，國防部長赫格塞思(Pete Hegseth)稱軍隊將隨時準備執行總統的任何決定。\n\n白宮同時宣布特朗普簽署行政令，對向古巴供應石油的國家加徵關稅，同時威脅對加拿大加徵新關稅，並表示美國將取消對加拿大生產的商用飛機的認證。 \n\n澳新銀行駐新加坡亞洲研究主管Khoon Goh表示：\"若瓦爾許獲任屬實，市場將視其為某種程度上能保持獨立性的人選，而非可能屈從于特朗普意願之人。\"\n\n他補充道：\"任何理性的市場參與者都不願帶著大額頭寸過周末。因此部分波動可能只是頭寸調整。若做空美元獲利，現在正是離場良機。\"\n\n儘管日圓日內走軟，但仍有望連續第二周上漲，此前日本政策制定者暗示可能與美國協調干預外匯市場以支撐日圓。\n\n上周，由於日本首相高市早苗及其對手在臨時大選中以減稅為競選綱領，市場對日本財政狀況的擔憂加劇，日圓跌至近18個月低點。\n\n美元兌避險貨幣瑞郎也走高，上漲0.5%至0.768瑞郎 \n\n澳元兌美元 下跌0.6%，報0.7008美元。\n\n加密貨幣方面，比特幣 暴跌2.2%至82,100美元，觸及11月21日以來最低點；以太幣 下跌3%至2,732.04美元。\n\n[表格內容]\n 紐約 當日 今年來 2025年 最新報價 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1918 1.1969 -0.43 +1.47 1.1745 美元/日圓 154.05 153.09 +0.63 -1.66 156.65 歐元/日圓 183.60 183.23 +0.20 -0.21 183.99 美元/瑞郎 0.7688 0.7640 +0.63 -2.97 0.7923 英鎊/美元 1.3748 1.3803 -0.40 +2.04 1.3473 美元/加元 1.3535 1.3489 +0.34 -1.38 1.3724 美元/離岸人民幣 6.9486 6.9443 +0.06 -0.39 6.9756 澳元/美元 0.6990 0.7046 -0.79 +4.77 0.6672 新西蘭元/美元 0.6044 0.6078 -0.56 +5.00 0.5756 歐元/瑞郎 0.9163 0.9146 +0.19 -1.56 0.9308 歐元/英鎊 0.8668 0.8667 +0.01 -0.54 0.8715 歐元/瑞典克朗 10.5405 10.5339 +0.06 -2.46 10.8061 美元/挪威克朗 9.5862 9.5290 +0.60 -4.70 10.0588 美元指數 96.605 96.283 +0.33 -1.75 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1857,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 18:42:44"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YV0QJ:0/",
      "Date": "2026-01-30",
      "Time": "17:13:32",
      "Title": "台灣匯市：台幣放量收貶連兩日下跌，新任美聯儲主席臆測令股匯市豬羊變色",
      "Content": "台幣兌美元 周五放量收貶，連兩日下跌。交易員指出，因美國總統特朗普可望提名前美聯儲理事瓦爾許出任美聯儲主席，此令國際美元反彈，加上外資大舉賣超台股匯出，台幣應聲貶破31.400重回先前整理區。\n\n他們表示，全球金融市場因新任美聯儲主席的臆測掀起波瀾，美元重拾漲勢，亞幣與亞洲股市也因市場認為瓦爾許立場偏鷹而轉為下跌，台幣跟進反映。 \n\n“外資大賣超啊，下午幾乎都在匯出。”一大型銀行交易員說。\n\n他指出，台幣一早先反映美元回穩略開低，隨著股市因新任美聯儲主席的臆測而擴大跌幅，台幣貶幅也逐漸增加，午後外資加大匯出力道，更讓台幣往31.500尋求支撐。\n\n該交易員稱，由於時逢月底，出口商也趁美元反彈而拋匯，但對於台幣幫助有限，終場幾乎以日低作收。下周由於逐漸臨近農曆春節，出口商對台幣的需求應該會高一些，有益于台幣持穩。 \n\n另一大型銀行交易員則稱，今日台股與台幣豬羊變色，外資大舉賣超並匯出使得台幣重回31.400-31.700的整理區間；後續走勢將視特朗普公布新任美聯儲主席後的金融市場表現而定。 \n\n台灣股市周五連兩日收低，回檔守穩10日均線，元月漲幅達10.7%。外資及陸資在台股轉為大幅賣超512.39億台幣，中止先前連三個交易日共買超702.14億台幣。\n\n在海外無本金交割遠期外匯市場(NDF)方面，目前指標一個月期美元/台幣換匯點 (TWDNDF=)折價幅度較上日尾盤略收斂；一個月美元/台幣遠匯 (TWD1MNDFOR=)報31.483/31.494，上日收在31.356。\n\n交易員預估，下周一台幣兌美元主要交易區間在31.400-31.500。\n\n[表格內容]\n16:00 台幣/美元報價 上日收盤 波動區間 開盤價 成交量(億美元) 上日成交量 (億美元) 台北外匯經紀公司 (TAIFX1) 31.468 31.327 31.350-31.478 31.360 18.66 14.01 元太外匯經紀公司 31.470 31.320 31.366-31.477 31.380 9.815 5.235 \n\n[表格內容]\n無本金交割遠期外匯(NDF) (TWDNDF=) 最新報價 上日現貨收盤時水準 美元/台幣一個月期 -0.055/-0.025 -0.060/-0.030 美元/台幣六個月期 -0.150/-0.120 -0.195/-0.165 \n（完）",
      "ContentLength": 991,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 17:42:50"
    },
    {
      "Source": "TradingView - Reuters Brief",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YV0IQ:0/",
      "Date": "2026-01-30",
      "Time": "17:08:16",
      "Title": "《路透晚報》--1月30日新聞摘要（國際版）",
      "Content": "以下為路透中文新聞為您整理的亞洲市場時段(上午7:00-下午5:00)新聞摘要：\n\n[重大數據或新聞]\n\n--特朗普稱周五公布美聯儲主席人選，此前會見前理事瓦爾許\n\n美國總統預計將於周五宣布美聯儲主席鮑威爾的繼任人選，在這前一天，特朗普在白宮會見了前美聯儲理事瓦爾許--這位美聯儲批評者曾表示，美國央行需要“體制改革”才能重獲喪失的公信力。特朗普周四在肯尼迪中心向記者表示，他將於次日早晨宣布人選，並稱新任主席\"本可在幾年前就上任...我認為這將是個非常好的選擇。希望如此。\"知情人士隨後向路透透露，55歲的瓦爾許已在白宮與特朗普會面。\n\n據彭博周四引述知情人士報導，特朗普政府準備提名瓦爾許擔任美聯儲主席。\n\n--中國有條件批準DeepSeek購買Nvidia的H200芯片--消息人士\n\n兩名知情人士告訴路透，中國已批準其頂尖人工智能(AI)初創公司DeepSeek（深度求索）購買Nvidia的H200 AI芯片，監管條件仍在最終敲定。路透周三援引消息人士的話報導稱，字節跳動、阿里巴巴和騰訊已獲準購買總計逾40萬個H200芯片。Nvidia首席執行官黃仁勳周四在台北告訴記者，公司尚未收到此類信息。他還補充說，他認為中國仍在敲定許可事宜。\n\n--美國財政部強化匯率監測標準，但未發現主要貿易夥伴操縱匯率\n\n美國財政部表示，正加強對各國匯率做法的審查，包括任何為阻止本幣兌美元貶值所作的努力，但並未指責任何主要貿易夥伴存在操縱匯率行為。在最新半年度匯率報告中，美國財政部稱，在2024年下半年至2025年上半年期間，沒有任何主要貿易夥伴同時滿足對其匯率做法進行強化分析的三項標準。\n\n美國財政部匯率報告罕見點名韓元匯率，稱近期貶值與經濟基本面不符 \n\n--特朗普警告英國勿與中國開展商業往來，同時敲打加拿大\n\n美國總統特朗普警告英國不要與中國開展商業往來，此前英國首相斯塔默（Keir Starmer）與中國國家主席習近平宣布重啟兩國關係。斯塔默強調英國無需在中美間選邊站隊。特朗普此前曾威脅，如果加拿大推進其領導人卡尼近期訪華期間與中國達成的經濟協議，美國將對加拿大加徵關稅。\n\n英國貿易大臣稱特朗普錯誤地認為加強與中國的關係是危險的 \n\n特朗普威脅對加拿大產飛機徵收50%關稅，直至加國認證灣流飛機 \n\n--數據顯示，日本東京1月核心消費者物價指數(CPI)同比上漲2.0%，較前月增速放緩，但符合央行目標。東京核心CPI剔除了波動較大的生鮮食品價格。該指數漲幅低於市場預期的2.2%，而12月漲幅為2.3%。數據還顯示，東京地區剔除生鮮食品和燃料成本的核心CPI在1月上漲2.4%，12月漲幅為2.6%。該指數被日本央行視為衡量需求拉動型通脹的重要指標。\n\n--彭博新聞援引知情人士消息報導稱，中國正考慮發行數千億元人民幣的專項債，用於向部分大型保險公司注資，以增強在行業整合壓力下的主要保險商實力。報導稱，此次發債將籌集約2,000億元人民幣（288億美元）用於向保險公司注資，所籌資金將注入中國人壽保險集團、中國人民保險集團和中國太平保險集團等國有控股企業。\n\n--蘋果警告內存成本攀升開始侵蝕獲利，因芯片商優先滿足AI需求\n\n--日本財務大臣片山皋月表示，首相高市早苗正在慎重評估暫停徵收消費稅對財政可持續性的影響，並正就此事與財務省商議。\n\n--巴拿馬最高法院周四深夜宣布，香港長和旗下巴拿馬子公司持有的關鍵港口合同因違憲而被撤銷，使巴拿馬運河沿線港口運營的前景變得不確定。\n\n--比特幣跌至兩個月低點，因市場猜測美聯儲下任主席可能收緊金融體系中的現金供應，從而打壓加密貨幣並推高美元。周五比特幣報82,300美元，下跌2.5%，延續前一交易日跌勢，正朝著連續第四個月下跌邁進，這將是八年來最長的連跌周期。\n\n--德國聯邦統計局表示，去年12月德國進口物價同比下降2.3%。路透調查的分析師此前預測降幅為2.6%。\n\n--澳洲央行2月3日料將把指標利率上調25個基點至3.85%，此前12月通脹數據高於預期，促使路透調查的多數經濟學家改變利率將按兵不動的預測。\n\n--路透調查顯示，在銅價飆升至歷史高位後，分析師首次將2026年銅價的共識預測上調至11,000美元以上，但他們對過度投機保持警惕，預計平均價格將遠低於峰值。\n\n--美國總統特朗普周四表示支持由參議院共和黨人與民主黨人談成的一項支出協議，該協議將避免政府停擺，同時議員們繼續就限制移民執法人員的措施進行磋商。\n\n--美國總統特朗普周四以稅務部門向媒體披露其2019年和2020年稅務申報資料為由，向美國國稅局(IRS)和財政部提起訴訟，索賠100億美元。\n\n--歐盟成員國外長同意將伊朗伊斯蘭革命衛隊列入歐盟的恐怖組織名單，將其與“伊斯蘭國”和“基地”組織歸為一類，標誌著歐洲對伊朗領導層態度出現了有象徵意義的轉變。\n\n--瑞士海關公布的數據顯示，該國12月黃金出口量環比增長27%，其中對英國的出口量躍升至2019年8月以來的最高水平。\n\n[市場摘要]\n\n--日本股市：日經指數因科技股拋售而略收低，連續第二個周線下跌\n\n日本日經指數周五收跌，連續第二周錄得周線跌幅，因投資者拋售科技類權重股以了結獲利。日經指數在震盪交投中下跌0.1%，收於53,322.85點。該指數盤中最高上漲0.4%，最低下跌0.85%。該指數本周下跌1.75%，但本月累計上漲4.6%。更廣泛的東證股價指數上漲0.59%，收於3,566.32點，但本周下跌1.7%。\n\n--中港股市：滬綜指收低1%本月仍錄得近4%漲幅，恆指挫2.1%但月線上揚終結連三月跌勢\n\n在有色板塊暴跌的拖累下，中國股市滬綜指周五盤中一度急瀉2.2%，最終收低1%。開年首月則依然錄得近4%漲幅，為去年8月以來最大月度漲幅。滬綜指盤中急挫2.2%，最終收跌1%，至4,117.95點，本月仍然累升3.8%，錄得去年8月以來最大月度漲幅。滬深300指數收低1%，本月累升1.7%。香港恆生指數收跌2.1%，至27387.11點，本月累升6.9%。恆生科技指數收低2.1%，本月累升3.7%。\n\n--匯市：美元上漲受美聯儲潛在新任主席人選影響；比特幣重挫\n\n美元回升，收複本周部分跌幅。此前美國總統特朗普表示將很快宣布美聯儲主席提名人選，同時市場對華盛頓避免政府停擺的樂觀情緒升溫。08:47GMT，美元指數上漲0.32%，報96.47。歐元兌美元下跌0.34%，報1.1932；美元兌日圓上漲0.51%，報153.88；英鎊兌美元下跌0.4%，報1.3765。\n\n--歐元債市：德國兩年期公債收益率料錄得周線跌幅，等待通脹數據公布\n\n德國兩年期公債收益率本周料將錄得自去年10月以來的最大周線跌幅，因投資者押注，歐洲央行在制定政策展望時將把歐元走強帶來的通縮壓力納入考量。投資者還在等待周五稍晚公布的德國各州1月通脹數據。對政策利率預期更為敏感的德國兩年期公債收益率上漲0.5個基點至2.06%，本周累計跌幅達6.5個基點，創10月以來最大周線跌幅。德國10年期國債收益率上漲1.5個基點至2.87%。\n\n--國際油市：油價下跌但月線料大漲，美國可能就伊朗核計劃與其對話\n\n油價下跌，因有跡象表明美國可能就伊朗核計劃與其展開對話，緩解了市場對美國打擊可能導致原油供應中斷的擔憂。不過，由於緊張局勢升級，油價本月預計仍將大幅上漲。08:47GMT，布蘭特原油下跌0.85%，報每桶70.13美元。西德克薩斯中質油(WTI)下跌1.24%，報每桶64.64美元。\n\n--全球金市：金價下跌逾5%，但仍有望實現1980年以來最大月度漲幅\n\n金價下跌逾5%，因有傳言稱美聯儲可能迎來立場較為鷹派的主席；但金價仍有望創下1980年來最強勁的月度漲幅，因地緣政治和經濟緊張局勢依舊，投資者湧向避險資產。截至08:47GMT，現貨金下跌5.3%，報每盎司5,103.89美元。美國期金下跌4.52%，報每盎司5,077.80美元。\n\n--金屬期市：銅價因獲利了結脫離紀錄高位，但月線仍有望上漲\n\n銅價回落，抹去前一交易日投機熱潮中的漲幅，因投資者進行獲利了結，但銅價仍有望實現月度上漲。上海期貨交易所主力期銅合約午盤收跌2.82%，報每噸103,680元（合14,919.70美元），較歷史高點114,160元回落，但1月仍累計上漲近4%。倫敦金屬交易所(LME)三個月期銅下跌2.78%，報每噸13,278.50美元，較歷史高點14,527.50美元回落。但倫銅本周仍有望收漲近7%。\n\n注：其他重要財經新聞瀏覽請點選；近日《路透晚報》請點選。(完)",
      "ContentLength": 3536,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 17:42:46"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YV0DU:0/",
      "Date": "2026-01-30",
      "Time": "15:17:56",
      "Title": "《全球匯市》美元上漲受美聯儲潛在新任主席人選影響；比特幣重挫",
      "Content": "美元周五回升，收複本周部分跌幅。此前美國總統特朗普表示將很快宣布美國聯邦儲備理事會(美聯儲/FED)主席提名人選，同時市場對華盛頓避免政府停擺的樂觀情緒升溫。\n\n特朗普表示，計劃周五公布接替美聯儲主席鮑威爾的人選，此前有消息稱前美聯儲理事瓦爾許(Kevin Warsh)造訪白宮。日圓下跌，加密貨幣價格重挫。\n\n美元因此收複本周部分跌幅；此前特朗普與古巴、伊朗、委內瑞拉、格陵蘭及歐洲的緊張關係，打擊部分投資者對美國資產的信心。\n\n澳新銀行駐新加坡亞洲研究主管Khoon Goh表示：\"若瓦爾許獲任屬實，市場將視其為某種程度上能保持獨立性的人選，而非可能屈從于特朗普意願之人。\"\n\n他補充道：\"任何理性的市場參與者都不願帶著大額頭寸過周末。因此部分波動可能只是頭寸調整。若做空美元獲利，現在正是離場良機。\"\n\n衡量美元兌一籃子貨幣的美元指數 上漲0.4%至96.55，將周線跌幅收窄至0.9%。\n\n歐元 下跌0.4%至1.1922美元，日圓兌美元 貶值0.5%至153.85。英鎊 下滑0.4%至1.3751美元。\n\n彭博新聞報導稱，瓦爾許將獲提名接替鮑威爾擔任美聯儲主席，而知情人士向路透透露他周四已在白宮與特朗普會面。\n\n在共和黨與民主黨議員敲定協議避免政府關門後，美元也獲得提振。\n\n海外衝突升級和嚴查境內移民引發的不安情緒重創美元，本周早些時候美元指數跌至四年低點。\n\n隔夜，白宮宣布特朗普簽署行政命令，對向古巴供應石油的國家加徵關稅，同時威脅對加拿大加徵新關稅，並表示美國將取消對加拿大生產的商用飛機的認證。\n\n隨著伊朗局勢持續周四表示計劃與德黑蘭領導人對話與此同時美國又向中東派遣一艘軍艦，國防部長赫格塞思(Pete Hegseth)稱軍隊將隨時準備執行總統的任何決定。\n\n上周美元收盤創去年四月以來最大跌幅，部分原因是特朗普政府威脅對阻撓其購買格陵蘭計劃的歐洲國家加徵關稅。\n\n西太平洋銀行集團高級經濟學家Mantas Vanagas指出，格陵蘭爭端引發更廣泛的地緣政治擔憂，導致美元全面走低。\n\n他補充道：\"問題在於'拋售美國'的交易模式捲土重來，投資者正質疑美國作為其他經濟體合作夥伴的可靠程度。\"\n\n美聯儲周三維持利率不變後，美元獲得一定支撐。美聯儲主席鮑威爾稱美國經濟穩健，通脹和就業風險均有所緩解。\n\n日圓兌美元匯率重返154關口上方，但仍有望實現連續第二周上漲，因日本政策制定者暗示可能與美國協調干預外匯市場以支撐日圓。\n\n上周，由於日本首相高市早苗及其對手在臨時大選中以減稅為競選綱領，市場對日本財政狀況的擔憂加劇，日圓跌至近18個月低點。\n\n澳元 下跌0.7%至0.6997美元，新西蘭元 下跌0.5%至0.6046美元。\n\n加密貨幣方面，比特幣 重挫2.2%至82,519.22美元，觸及11月21日以來最低點；以太幣 下跌3%至2,732.04美元。\n\n[表格內容]\n 最新報價 紐約 當日 今年來 2025年 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1914 1.1969 -0.46 +1.44 1.1745 美元/日圓 153.9700 153.09 +0.57 -1.71 156.65 歐元/日圓 183.45 183.23 +0.12 -0.29 183.99 美元/瑞郎 0.7685 0.7640 +0.60 -2.99 0.7923 英鎊/美元 1.3740 1.3803 -0.45 +1.99 1.3473 美元/加元 1.3527 1.3489 +0.28 -1.44 1.3724 美元/離岸人民幣 6.9473 6.9443 +0.04 -0.41 6.9756 澳元/美元 0.6982 0.7046 -0.89 +4.66 0.6672 新西蘭元/美元 0.6038 0.6078 -0.66 +4.90 0.5756 澳元/日圓 107.490 108.190 -0.65 +2.82 104.540 新西蘭元/日圓 93.010 93.070 -0.06 +2.56 90.690 英鎊/日圓 211.51 211.39 +0.06 +0.23 211.02 澳元/新西蘭元 1.1562 1.1592 -0.26 -0.20 1.1585 美元指數 96.626 96.283 +0.36 -1.72 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1997,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 15:42:48"
    },
    {
      "Source": "TradingView - Reuters Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YV0JB:0/",
      "Date": "2026-01-30",
      "Time": "15:00:28",
      "Title": "台灣債市：指標10年債殖利率連兩日收平，農曆年關前後新債變數左右行情",
      "Content": "台灣指標10年公債115/3期 (A15103=TWO)周五發行前交易殖利率連兩日持平作收。交易員指出，目前美債暫難提供進一步指引，115/3期連兩日殖利率持穩在1.42%，交投觀望該券下周四標售結果。\n\n他們認為，因應市場補券需求仍在，目前市場普遍預估115/3期下周不致於標高，而因農曆年關前後皆受新債標售變數干擾，除了年關前的115/3期標售外，新春開市首日也要立馬標售五年新券115/1R期 (A15101R=TWO)，預計農曆年關前後的標售結果將左右台債走勢。\n\n“農曆年後那周更忙，然後3月就都沒事。”一位民營銀行交易員說；並點出農曆年新春開市當周將標售兩期公債--五年券115/1R期及20年券115/4期 (A15104=TWO)，農曆年關前後充滿新債標售變數。\n\n他也稱，由於補券需求仍在，預期10年新券應該也標不高，應該差不多在近日的成交利率附近。 \n\n亦有位大型銀行交易員指出，暫時覺得115/3期得標利率就落在1.4-1.42%，“畢竟利率高了，就有人想拿，所以不會標太高。” \n\n台灣央行將於下周四代財政部標售10年券115/3期，金額暫定350億台幣，並預計在2月10日發行。而因應農曆春節，台灣股債市將於2月11日封關，休市到2月23日重新開市。\n\n交易員預估，下周一的五年增額公債115/1R期殖利率交易區間在1.31-1.33%，而10年債115/3期殖利率交易區間則在1.41-1.43%。 \n\n[表格內容]\n 收盤價 漲跌幅 報價 區間 成交值 年期 期別 (基點) (億台幣) 10 115/3 (A15103=TWO) 0.0 1.42% 1.42-1.42% 0.5 \n 今日電子盤各期指標券收盤情形：\n\n[表格內容]\n 30 114/11 (A14111=TWO) 沒有成交 20 115/4 (A15104=TWO) 沒有成交 10 115/3 (A15103=TWO) 1.42% 5 115/1 (A15101=TWO) 沒有成交 2 115/2 (A15102=TWO) 沒有成交 \n（完）",
      "ContentLength": 872,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 15:42:44"
    },
    {
      "Source": "TradingView - Reuters Stocks",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YV0EB:0/",
      "Date": "2026-01-30",
      "Time": "14:17:29",
      "Title": "台灣股市：連兩日收低守穩10日均線，受美聯儲新主席臆測打擊",
      "Content": "台灣股市周五連兩日收低，回檔守穩10日均線，元月漲幅達10.7%。分析師稱，美國總統特朗普可望提名前美聯儲理事瓦爾許出任美聯儲主席，市場臆測其立場“不夠鴿”，此令風險資產承壓，大盤同時面臨春節長假前調節賣壓而下跌。\n\n台灣加權指數 TWSE:TAIEX收低1.45%至32,063.75點，10日均線在32,027.93點；今日成交初值 (.TTOV.TW)為9,071.11億台幣，上日修正後為9,596.52億，創下歷史天量。\n\n“跌下去就是有人在接，32,000點附近的10日均線應該有守。”統一期貨投顧部分析師盧昱衡說。\n\n他表示，特朗普可望提名瓦爾許出任美聯儲主席，外界視其為能保持獨立性的人選，立場可能不夠鴿派，此令全球金融市場波動，美元轉強、台幣走貶，外資可能會轉為賣超，台股又因為有春節封關前的調節賣壓，使得指數兩天已跌掉接近1,000點。\n\n盧昱衡認為，雖然大盤連兩日拉回，但仍視其為短線急漲後的乖離修正。下周台股最好是能夠維持高檔震盪，以盤代跌，否則短線多頭型態一旦破壞，拉回修正的幅度恐加大。\n\n富達投資指出，不論下一任美聯儲主席人選為何，偏寬鬆且容忍較高通膨風險的政策立場，發生機率都相當高，因此仍維持股票加碼的建議。 \n\n分析師預估，下周一台股指數區間在31,500-32,500點。（完） \n\n[表格內容]\n**查閱相關新聞或頁面，請點選下列代碼連結**** 美國股市 一周展望 歐洲股市報導 日本股市報導 中港股市報導 中國股市報導 台灣股市報導 股市簡訊 納斯達克最活躍個股 (.AV.O) 紐約證交所最活躍個股 (.AV.N) 納斯達克漲幅居前個股 (.PG.O) 紐約證交所漲幅居前個股 (.PG.N) 納斯達克跌幅居前個股 (.PL.O) 紐約證交所跌幅居前個股 (.PL.N) 標普主要分類指數 (0#.GSPMAJOR) 英股富時指數 CURRENCYCOM:UK100 德股DAX指數 法股CAC-40指數 韓國股市已並入韓國金融市場報導中，相關稿件請點選",
      "ContentLength": 850,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 14:42:44"
    },
    {
      "Source": "TradingView - Reuters Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YV0C6:0/",
      "Date": "2026-01-30",
      "Time": "10:57:18",
      "Title": "台灣債市：指標10年公債早盤殖利率持平，觀望115/3期下周標售結果",
      "Content": "台灣指標10年公債115/3期 (A15103=TWO)周五早盤發行前交易殖利率持平。交易員指出，115/3期連兩日殖利率持穩在1.42%，交投仍觀望該券下周四標售結果。\n\n“10年券應該也標不高，補券需求還是在。”一位大型民營銀行交易員說。\n\n另位大型銀行交易員也稱，暫時覺得115/3期得標利率就落在1.4-1.42%，“畢竟利率高了，就有人想拿，所以不會太高。” \n\n台灣央行將於下周四代財政部標售10年券115/3期，金額暫定350億台幣，並預計在2月10日發行。而因應農曆春節，台灣股債市將於2月11日封關，休市到2月23日重新開市。\n\n本地時間10:50，10年券115/3期發行前交易殖利率報1.42%，成交0.5億台幣，五年券115/1R期 (A15101R=TWO)電子盤暫無成交；台股 TWSE:TAIEX則跌1.23%。 \n\n交易員預估，今日五年債115/1R期殖利率交易區間在1.30-1.34%；10年債115/3期殖利率區間則在1.40-1.43%。（完）\n\n最新相關報導鏈接：\n\n--美國債市：公債收益率下跌，美聯儲會議後投資者關注非農就業數據",
      "ContentLength": 487,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 11:42:43"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YV095:0/",
      "Date": "2026-01-30",
      "Time": "10:22:07",
      "Title": "台灣匯市：台幣早盤走貶，因美元反彈台股下跌但出口商趁機拋匯",
      "Content": "台幣兌美元 周五早盤走貶。交易員表示，因國際美元自低位反彈，且台股跌幅擴大拖累了台幣表現。\n\n他們稱，美股期貨盤下跌拖累台股走勢，外資料轉為賣超並匯出，此外，黃金等貴金屬回落有利於國際美元止跌反彈。不過在台幣回測31.400時見到出口商的拋匯。 \n\n“股市迅速回落，看來外資也在砍(股票)。”一銀行交易員說。\n\n其指出，美元反彈給了出口商于月末逢高拋匯的機會，此令台幣在31.400獲得支撐。盤中將持續關注台股跌勢能否止住或進一步擴大。 \n\n本地時間10:12，台幣兌美元貶6.1分報31.388，交易區間在31.350-31.409；台股 TWSE:TAIEX則跌1.31%報32,111.52點。\n\n在海外無本金交割遠期外匯市場(NDF)方面，目前指標一個月期美元/台幣換匯點 (TWDNDF=)自折價轉為微幅溢價；一個月美元/台幣遠匯 (TWD1MNDFOR=)報31.440/31.460，上日收在31.356。\n\n交易員預估，今日台幣兌美元匯率主要交易區間在31.350-31.450。（完）\n\n最新相關報導鏈接：\n\n--《全球匯市》美元料錄得周線下跌，全球緊張局勢加劇削弱美國資產需求",
      "ContentLength": 498,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 10:42:42"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YV01X:0/",
      "Date": "2026-01-30",
      "Time": "09:26:04",
      "Title": "《全球匯市》美元料錄得周線下跌，全球緊張局勢加劇削弱美國資產需求",
      "Content": "美元周五可能連續第二周錄得周線下跌，因美國威脅對與古巴有貿易往來的國家徵收關稅，加劇了全球緊張局勢，削弱了市場對美國資產的需求。\n\n白宮表示，特朗普總統簽署行政命令，將對向古巴供應石油的國家加徵關稅，這為近期涉及伊朗、委內瑞拉、格陵蘭和歐洲的地緣政治緊張局勢再添壓力。\n\n有關特朗普考慮對伊朗採取軍事打擊的報導推高油價，並拖累美元指數。\n\n美國國內方面，參議院達成的一項協議將避免政府部分停擺，帶來一絲希望曙光。日本數據顯示東京通脹放緩，但符合央行目標。\n\n西太平洋銀行高級經濟學家Mantas Vanagas在報告中指出：“隨著特朗普揚言對伊朗採取軍事行動，美元指數繼續走低。\"\n\n美元指數 微升0.2%至96.35，本周累計跌幅收窄至1.1%。\n\n歐元 下跌0.2%至1.194美元。日圓 下跌0.17%至1美元兌153.39日圓。英鎊 下跌0.1%至1.3791美元。\n\n多名消息人士稱，特朗普正在權衡針對伊朗的多種選項，包括對安全部隊及領導人實施定點打擊以鼓舞抗議者。特朗普將部署在該地區的艦船稱為駛向伊朗的\"艦隊\"。\n\n受美國對格陵蘭政策引發擔憂影響，美元上周錄得去年4月以來的最大單周跌幅。\n\n在美聯儲周三維持利率不變後，美元獲得一定支撐。美聯儲主席鮑威爾表示，美國經濟穩健，通脹與就業面臨的風險有所減弱。\n\n美元下跌為疲軟的日圓帶來喘息空間。受美國和日本上周疑似進行匯率詢價的傳言影響--這一行為通常被視為干預前兆，日圓本周大部分時間在152至154的區間內波動。\n\n數據顯示，日本東京1月核心消費者物價指數(CPI)同比上漲2.0%，較前月增速放緩，但符合央行目標。\n\n澳元兌美元 下跌0.2%，報0.7033美元；新西蘭元兌美元 下跌0.2%，報0.6066美元。\n\n加密貨幣方面，比特幣 下跌0.1%至84,309.27美元，以太幣 下跌0.3%至2,808.19美元。\n\n[表格內容]\n 最新報價 紐約 當日 今年來 2025年 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1926 1.1969 -0.36 +1.54 1.1745 美元/日圓 153.6700 153.09 +0.38 -1.90 156.65 歐元/日圓 183.31 183.23 +0.04 -0.37 183.99 美元/瑞郎 0.7675 0.7640 +0.46 -3.13 0.7923 英鎊/美元 1.3764 1.3803 -0.28 +2.16 1.3473 美元/加元 1.3520 1.3489 +0.23 -1.49 1.3724 美元/離岸人民幣 6.9494 6.9443 +0.07 -0.38 6.9756 澳元/美元 0.7015 0.7046 -0.44 +5.14 0.6672 新西蘭元/美元 0.6051 0.6078 -0.44 +5.13 0.5756 澳元/日圓 107.750 108.190 -0.41 +3.07 104.540 新西蘭元/日圓 93.070 93.070 0.00 +2.62 90.690 英鎊/日圓 211.58 211.39 +0.09 +0.27 211.02 澳元/新西蘭元 1.1585 1.1592 -0.06 0.00 1.1585 美元指數 96.506 96.283 +0.23 -1.85 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1598,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 09:42:49"
    },
    {
      "Source": "TradingView - Reuters Brief",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YU1DW:0/",
      "Date": "2026-01-30",
      "Time": "07:25:43",
      "Title": "《路透早報》--1月30日",
      "Content": "一周全球重要經濟數據和事件預告：\n\n簡體： https://tmsnrt.rs/4jYZqjJ \n\n繁體： https://tmsnrt.rs/49PWJMv\n\n以下為1月29日下午5:00至1月30日早上7:00的重大新聞與市場摘要：\n\n--美防長稱五角大樓準備執行特朗普對伊朗的任何決定\n\n美國國防部長赫格塞斯周四表示，美國軍方將做好準備，執行特朗普總統對伊朗做出的任何決定，以確保德黑蘭不會尋求發展核武器能力。美國官員表示，特朗普正在評估各種方案，但尚未決定是否對伊朗發動打擊。\n\n* 一位要求匿名的美國官員對路透表示，美國海軍已向中東地區再派遣“布萊克”號驅逐艦。隨著這艘軍艦抵達，中東地區的美國驅逐艦數量增至六艘。\n\n* 沙特和以色列官員前往華盛頓，討論可能對伊朗發動攻擊--Axios \n\n* 歐盟外交及安全政策高級代表卡拉斯周四回應有關特朗普正考慮對伊朗實施定點打擊的報導時表示，該地區不需要新的戰爭。\n\n--中英關係喜迎重啟，止跌回升邁向“更成熟”階段\n\n英國首相斯塔默與中國國家主席習近平周四承諾在貿易、投資和技術領域加強合作，英國和中國對兩國關係重啟表示歡迎。他在訪華期間呼籲建立“更成熟的關係”，包括改善市場準入、降低關稅並推動投資協議。這是北京八年來首次接待英國首相。中方同意為英國公民提供30天免簽入境待遇，並將中國對威士忌的關稅削減一半。與此同時，英國製藥商阿斯利康宣布將在中國投資150億美元。斯塔默與習近平舉行正式峰會並共進午餐，耗時約三個小時，雙方討論了貿易、安全、烏克蘭戰爭，也談到了足球和莎士比亞。 \n\n--中國總理：中英要深化金融、人工智能等新興產業合作，做大雙邊貿易\"新增量\"\n\n中國總理李強周四會見英國首相斯塔默，共同出席中英企業家委員會會議閉幕式。李強表示，愿同英國完善政府間對話合作機制，更加經常性地開展各層級各領域交往。雙方要發揮互補優勢，推動雙邊貿易擴容提質，深化金融、人工智能、先進製造、清潔能源、數字經濟、現代航運服務等新興產業合作，相互賦能更好發展。\n\n--中國商務部部長王文濤會見英國商貿大臣凱爾，王文濤稱，中國愿與英國加強經貿政策對話，深化雙方在服務貿易、雙向投資、金融、數字經濟等領域合作，擴大自英進口優質產品和服務。\n\n--美國財政部強化匯率監測標準，但未發現主要貿易夥伴操縱匯率\n\n美國財政部表示，正加強對各國匯率做法的審查，包括任何為阻止本幣兌美元貶值所作的努力，但並未指責任何主要貿易夥伴存在操縱匯率行為。財政部將泰國加入需密切關注的“觀察名單”，因該國全球經常帳戶盈餘及其對美貿易順差擴大。觀察名單擴大至10個經濟體，中國、日本、韓國、台灣、新加坡、越南、德國、愛爾蘭和瑞士繼續留在名單上。\n\n--特朗普計劃下周宣布下任美聯儲主席人選，重申利率仍過高\n\n特朗普表示，他計劃下周宣布接替美聯儲主席鮑威爾的人選，這將結束數周以來關於誰將在鮑威爾任期於2026年5月結束後領導美聯儲的臆測。特朗普再次批評美聯儲，稱利率應該下調兩、三個百分點。[nL6T3YU161\n\n* 他說美國的利率本應比全球所有國家都低。其他國家之所以只需支付低利率，完全是因為美國。\n\n--移民執法爭端致撥款議案參院受阻，美國停擺風險上升\n\n美國參議院民主黨人阻止了一項為政府大量機構提供資金的立法。該撥款議案需在周五截止日期前通過。民主黨人正與美國總統特朗普談判，試圖限制激進的移民執法策略。若雙方無法達成協議，政府從周六起可能陷入部分停擺。但雙方消息人士稱，他們正取得進展，努力避免這一結果。特朗普在白宮表示，其政府將以兩黨合作方式避免停擺。\n\n--美國上周初請失業金人數下降；貿易逆差擴大幅度創近34年最大\n\n美國上周初請失業金人數較此前一周上修後的水平有所下降，暗示裁員規模依然較低，但疲軟的招聘態勢正在加劇家庭對勞動力市場的擔憂。美國勞工部公布，截至1月24日當周，初請失業金人數經季節性調整後減少1,000人，降至20.9萬人。另外，美國商務部經濟分析局和統計局的報告顯示，11月貿易逆差擴大94.6%至568億美元，增幅為1992年3月以來最大。不過，11月美國對華貿易逆差縮小至139.42億美元，10月逆差為149.37億美元。 \n\n* 美國11月工廠訂單在商用飛機需求飆升的帶動下反彈，不過第四季度企業在設備方面的支出增速可能有所放緩。美國商務部統計局表示，工廠訂單11月增長2.7%，10月數據經上修為下降1.2%，前值為下降1.3%。\n\n--克里姆林宮：俄羅斯已邀請烏克蘭總統澤連斯基前往莫斯科舉行和談\n\n克里姆林宮表示，俄羅斯已重申邀請烏克蘭總統澤連斯基前往莫斯科舉行和平會談。目前，在美國主導下結束這場已持續近四年的烏克蘭戰爭的努力正在加速。國際文傳電訊社（Interfax）周四引述克里姆林宮發言人佩斯科夫的話稱，莫斯科尚未收到澤連斯基對邀請的回應。澤連斯基去年拒絕了類似邀請，他當時建議普京來基輔。\n\n* 特朗普稱，普京同意因嚴寒在一周內不向基輔開火 \n\n* 俄羅斯外長：俄方不知美國與烏克蘭達成的安全保證具體內容 \n\n--加拿大總理卡尼：期望美國政府尊重加拿大主權\n\n英國《金融時報》報導稱，美國國務院官員曾與阿爾伯塔繁榮計劃組織(Alberta Prosperity Project/APP)舉行三次會議。該組織正推動就這個能源大省是否應脫離加拿大舉行全民公投。\n\n加拿大總理卡尼被問及相關報導時表示，他期望美國政府尊重加拿大主權。他補充稱，特朗普從未向他提及阿爾伯塔省獨立的問題。阿爾伯塔省省長Danielle Smith表示，她希望繼續留在加拿大，但指出民調顯示，30%的民眾已對他們眼中的渥太華過度干預感到厭倦。\n\n--加拿大央行總裁麥克勒姆告訴路透，鑒於地緣政治風險上升和美國貿易政策走向，經濟面臨新衝擊的風險異常突出。麥克勒姆表示，阻礙加拿大實現央行經濟預測的因素比往常更多，包括特朗普對格陵蘭島的威脅、抓捕委內瑞拉領導人的行動、以及一再威脅對加拿大加徵關稅等。 \n\n--瑞銀將2026年3月、6月和9月的黃金價格目標上調至每盎司6,200美元，此前的預測為5,000美元，理由是投資增加帶動的需求強於預期。不過該行預計，在2026年美國中期選舉後，金價將小幅回落至每盎司5,900美元。\n\n--國際貨幣基金組織(IMF)警告稱，儘管面臨貿易干擾和地緣政治不確定性，新興市場經濟體仍展現出韌性，但這種支撐可能難以為繼，應利用該窗口期重建緩衝、拓寬增長來源。IMF警告稱，經濟增長正變得日益狹窄，活動集中於少數幾個領域，尤其是科技和人工智能領域，這增加了風險。\n\n--南非央行周四將指標貸款利率維持在6.75%不變，稱希望看到通脹預期進一步回落，並指出包括電價在內的潛在價格壓力。央行並維持今年及明年的經濟增長預測不變，2026年料增長1.4%，2027年將增長1.9%。\n\n--中國央行披露，2025年第四季度全國新發放商業性個人住房貸款加權平均利率為3.06%。央行官網公告顯示，去年三季度該利率為3.07%。據此計算，去年四季度全國新發放商業性個人住房貸款加權平均利率環比下降了1BP（基點）。\n\n--台灣金管會稱，壽險會計匯率新制配套措施已研擬完成，將於明天與業者溝通，預計盡快在農曆年前公布，將與壽險會計匯率新制齊回溯至元月實施。至於市場關注的壽險CS(換匯)避險部位將會采分階段辦理，對匯市影響有限。\n\n--在商品消費趨於飽和之際，努力擴大服務消費成為中國提振消費的重點。中國國務院辦公廳日前印發文件，鼓勵網絡視聽服務、入境消費、演出服務和體育賽事等服務消費發展。\n\n--中國外交部邊海司司長侯艷琪周四同菲律賓外交部副部長艾雷拉-林、部長助理兼亞太司司長阿爾費雷斯，在菲律賓宿務舉行雙邊會見。央視新聞報導稱，雙方就涉海等共同關心的問題坦誠深入交換意見，同意繼續通過外交渠道保持溝通。\n\n--彭博新聞報導稱，美國私人直接投資公司黑石集團即將達成一項協議，使其成為香港新世界發展的最大股東。新世界發展不予置評。 \n\n--彭博新聞周四援引知情人士報導，馬斯克旗下的SpaceX正考慮與特斯拉進行合併的可能性，同時也在探討與人工智能公司xAI進行另一種形式的整合。\n\n[市場摘要]\n\n股市： \n\n--標普500指數和納斯達克指數周四雙雙收跌，因最新企業財報令投資者感到不安，同時他們還擔憂科技巨頭在人工智能領域的巨額投入能否獲得回報。儘管這兩個股指尾盤收復部分失地，但科技板塊疲軟仍拖累整體走勢。微軟成為拖累標普500指數的最大因素。這家軟件巨頭的雲業務營收表現欠佳，引發市場對其在OpenAI的巨額投入恐不會很快帶來回報的擔憂，這導致其股價暴跌10%。道瓊斯工業指數在尾盤勉強收漲，上漲55.96點或0.11%，報49,071.56點。標普500指數收盤雖然遠離盤中低點，但仍下跌9.02點或0.13%，報6,969.01點。納斯達克指數在最後半小時縮窄跌幅，最終下跌172.33點，跌幅0.72%，收於23,685.12點。\n\n--歐洲指標股指收低，回吐早盤漲幅，因德國SAP和微軟的業績未能令投資者滿意，導致科技股遭拋售。泛歐STOXX 600指數下跌0.2%至607.14點，科技板塊下挫2.8%，創2025年4月以來最大單日跌幅。德國DAX指數表現遜於其他地區股指，收跌2%，SAP大跌16%。英國富時100指數收高0.17%；法國CAC-40指數幾近持平。\n\n匯市：\n\n--美元兌日圓和歐元下滑，但仍高於近期觸及的多年低點。儘管美聯儲釋放出略偏鷹派的信號為美元提供了一定支撐，但投資者對美國政策前景仍心存疑慮。美元兌日圓下跌0.2%至153.055日圓，歐元上漲0.5%至1.196美元。加元兌美元上漲0.4%。主要加密貨幣比特幣下跌6%，至83,563美元。\n\n債市：\n\n--美國公債收益率下跌，在下周公布非農就業報告前，投資者保持觀望態度。該報告預計將為勞動力市場動能以及2026年可能的降息節奏提供更清晰的信號。尾盤時，指標10年期美國公債收益率下跌1.2個基點至4.235%，30年期收益率持平於4.856%。兩年期收益率下跌2個基點，至3.561%。\n\n--歐元區公債收益率小跌，因市場持續擔憂歐元走強可能促使歐洲央行較目前預計的更早放寬貨幣政策。德國10年期公債收益率跌2.5個基點，報2.824%；兩年期德債收益率跌至一周低點，下跌2個基點，報2.06%。\n\n油市：\n\n--油價攀升，因市場擔憂若美國襲擊伊朗這個石油輸出國組織(OPEC)最大原油生產國之一，可能影響全球供應。布蘭特原油期貨上漲2.31美元，漲幅3.4%，收於每桶70.71美元，創7月31日以來新高；美國原油期貨上漲2.21美元，漲幅3.5%，收於每桶65.42美元，創9月26日以來新高。\n\n金屬：\n\n--金價微跌，投資者在創下歷史新高後獲利了結，但受經濟和地緣政治不確定性加劇影響，金價仍有望創下1980年代以來最佳月度表現。現貨金收報每盎司5,394.88美元，跌幅不到0.1%，盤中一度觸及5,594.82美元的歷史高位。美國2月期金收報5,318.40美元，跌幅0.3%。\n\n--銅價一度飆升至每噸14,000美元以上的歷史新高，因投機者在強勁需求預期、美元疲軟及地緣政治擔憂的推動下持續買入。倫敦金屬交易所指標三個月期銅一度飆升11%，觸及每噸14,527.50美元的歷史峰值，隨後在1700 GMT回調至13,612.50美元，漲幅收窄至4%。\n\n[今日看點]\n\n重要經濟數據(GMT時間)：\n\n--法國第四季GDP初值(0630)\n\n--德國12月進口物價(0700)、1月失業率(0855)、第四季GDP初值(0900)和1月CPI初值(1300)\n\n--台灣第四季GDP概估值(0800)\n\n--香港12月M3貨幣供應量(0830)\n\n--英國12月消費者信貸(0930)\n\n--歐元區第四季GDP首次估值和12月失業率(1000)\n\n--美國12月最終需求PPI(1330)\n\n--加拿大11月GDP(1330)\n\n重大經濟事件及官員講話(GMT時間)：\n\n--英國首相訪問中國(至1月31日)\n\n--日本防衛大臣小泉進次郎會見韓國國防部長官安圭伯\n\n--歐洲央行銀監會委員馬查多發表主題演講(0800)\n\n--歐洲央行銀監會主席布赫發表講話(1730)\n\n--聖路易斯聯儲總裁穆薩萊姆就美國經濟和貨幣政策發表講話(1830)\n\n--美聯儲金融監管副主席鮑曼就貨幣政策監管問題發表講話(2200)\n\n注：其他重要財經新聞瀏覽請點選；近日《路透早報》請點選。(完)",
      "ContentLength": 5184,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 07:42:47"
    },
    {
      "Source": "TradingView - Reuters Stocks",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YU1FM:0/",
      "Date": "2026-01-30",
      "Time": "07:01:30",
      "Title": "美國股市：標普500指數與納指收跌，科技巨頭AI投入激增引發市場擔憂",
      "Content": "標普500指數和納斯達克指數周四雙雙收跌，因最新企業財報令投資者感到不安，同時他們還擔憂科技巨頭在人工智能領域的巨額投入能否獲得回報。\n\n儘管這兩個股指尾盤收復部分失地，但科技板塊疲軟仍拖累整體走勢。微軟 成為拖累標普500指數的最大因素。這家軟件巨頭的雲業務營收表現欠佳，引發市場對其在OpenAI的巨額投入恐不會很快帶來回報的擔憂，這導致其股價暴跌10%。\n\n其他軟件股同樣受重挫，思愛普(SAP) 美國上市股票因謹慎的雲業務展望而暴跌15%，ServiceNow 股價也因財報加劇市場悲觀情緒而大跌9.9%。\n\n新澤西州普林斯頓市Paleo Leon公司董事總經理John Praveen表示：“微軟令人失望，市場確實存在擔憂，擔心人工智能投資將侵蝕軟件企業的利潤。”\n\nPraveen指出，在當前多重不確定性交織的背景下，投資者正試圖“降低股票敞口求穩\"，這些不確定因素包括美聯儲下任主席人選、未來降息次數、華盛頓在伊朗和格陵蘭問題上的政治不確定性，以及美國政府可能停擺的風險。他形容當前環境“烏雲密布”。\n\n道瓊斯工業指數 在尾盤勉強收漲，上漲55.96點或0.11%，報49,071.56點。標普500指數 收盤雖然遠離盤中低點，但仍下跌9.02點或0.13%，報6,969.01點。納斯達克指數 在最後半小時縮窄跌幅，最終下跌172.33點，跌幅0.72%，收於23,685.12點。\n\n軟件公司遭遇拋售潮，Salesforce 下跌6%，甲骨文(Oracle) 下跌2.2%，Adobe 下跌2.6%，雲安全公司Datadog 暴跌8.8%。\n\n紐約Infrastructure Capital Advisors首席執行官兼首席投資官Jay Hatfield指出，對於ServiceNow和Salesforce等軟件公司而言，人們擔心若人工智能可能取代其部分服務，他們的業務可能會受到一定程度的影響。“現實如何其實並不重要。目前這些公司的股票已經遭受了重創，”他補充道。\n\n蘋果 收盤漲0.72%，該公司在盤後公布財報顯示，季度營收超出預期，得益於中國市場的強勁反彈，公司首席執行官庫克向路透表示，最新款iPhone的需求\"驚人\"。\n\n其他大型股方面，電動汽車製造商特斯拉 股價下跌3.5%，此前該公司宣布計劃將資本支出增加一倍以上至紀錄高位。\n\n在標普500指數的11大主要板塊中，科技板塊 跌幅最大，下跌1.9%。\n\n通信服務板塊 則上漲2.9%，表現最為強勁，其中Facebook母公司Meta 大漲10.4%。這家社交媒體巨頭不僅給出了樂觀的營收預期，還宣布將今年的資本支出預算大幅提高73%。\n\n其他利好消息方面，IBM 股價上漲5%，此前其公布第四季獲利超出預期。\n\n其他值得關注的財報方面，卡特彼勒 股價上漲3.4%，該公司公布利潤增長。國防承包商洛克希德·馬丁公司股價大漲4%，此前該公司預測2026年獲利將超出華爾街預期。西南航空 股價飆升18.7%，成為標普500指數中百分比漲幅最大的個股，此前該公司預測全年利潤將超出預期。\n\n紐約證交所漲跌家數之比為1.19:1。有611只股票創新高，176只創出新低。 納斯達克市場有2,067只股票上漲，2,746只下跌，下跌股與上漲股家數之比達1.33:1。標普500指數有51只成分股創52周新高，有20只創52周新低。 \n\n美國交易所成交量達233.6億股，遠超20日均值188.3億股。\n\n[表格內容]\n****查閱相關新聞或頁面，請點選下列代碼連結**** 美國股市 一周展望 歐洲股市報導 日本股市報導 中港股市報導 中國股市報導 台灣股市報導 股市簡訊 納斯達克最活躍個股 (.AV.O) 紐約證交所最活躍個股 (.AV.N) 納斯達克漲幅居前個股 (.PG.O) 紐約證交所漲幅居前個股 (.PG.N) 納斯達克跌幅居前個股 (.PL.O) 紐約證交所跌幅居前個股 (.PL.N) 標普主要分類指數 (0#.GSPMAJOR) 英股富時指數 CURRENCYCOM:UK100 德股DAX指數 法股CAC-40指數 韓國股市已並入韓國金融市場報導中，相關稿件請點選",
      "ContentLength": 1729,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 07:42:51"
    },
    {
      "Source": "TradingView - Reuters Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YU1DU:0/",
      "Date": "2026-01-30",
      "Time": "06:38:58",
      "Title": "美國債市：公債收益率下跌，美聯儲會議後投資者關注非農就業數據",
      "Content": "美國公債收益率周四下跌，投資者在下周月度就業報告公布前保持觀望態度。該報告預計將為勞動力市場動能以及 2026 年可能的降息節奏提供更清晰的信號。\n\n市場參與者也預計，美國將就對聯邦移民執法人員實施新限制達成一致，從而可能避免本周末政府關門。\n\n下午尾盤時，指標10年期美國公債收益率 (US10YT=TWEB) 下跌1.2個基點至4.235%，30年期公債收益率 (US30YT=TWEB) 持平於4.856%。\n\n儘管美聯儲周三維持利率不變的決定對整體公債市場影響有限，但美聯儲主席鮑威爾對近期經濟形勢持樂觀態度，並表示美聯儲今年仍有進一步降息的可能，這取決於後續經濟數據的表現。\n\n通常與利率預期同步波動的兩年期美國公債收益率 (US2YT=TWEB) 下跌2個基點，至3.561%。\n\n投資者還押注，美國參議院有望達成一項協議，將國土安全部的撥款法案從涵蓋軍費、醫療項目和其他聯邦機構的更廣泛支出法案中剝離出來。這些機構包括勞工部和勞工統計局（BLS）。\n\n此舉意味著勞工統計局將於下周五如期發布1月就業報告，預計勞工統計局還將公布此前就業數據的修訂。\n\n猶他州帕克城Mischler Financial Group的董事總經理Tom di Galoma指出，臨近月底也有望支撐債市表現直至周五。“我預計在最後幾天，股市資金會有部分轉向固定收益市場。”\n\n**收益率曲線趨陡**\n\n收益率曲線早盤趨陡，但收盤時與周三持平。兩年期與10年期美債收益率利差 (US2US10=TWEB)盤中一度觸及 68.4 個基點，隨後回落至 67 個基點，與周三尾盤持平。\n\n分析師表示，美元本周跌至多年低點，加上大宗商品價格大幅上漲，推動收益率曲線在過去幾周趨陡。他們補充稱，這些因素可能在未來數月繼續支撐曲線進一步趨陡。\n\nBMO Capital Markets的美國利率策略師Vail Hartman 表示：“我們預計兩年期與10年期收益率利差在短期內將在60至70個基點之間，但今年晚些時候曲線可能進一步變陡。”\n\n有關美國可能對伊朗發動軍事打擊的猜測推動油價升至六個月高點，銅價則在周四創下歷史新高。\n\n市場同時密切關注美聯儲主席繼任者被提名人的公布。投資者正審視候選人以評估其維護美聯儲獨立性的意願。\n\n 周四美國財政部標售440億美元七年期公債，標售結果表現平淡。該債券中標收益率為4.018%，略高於投標截止時的預期收益率，表明需求疲軟。據BMO數據顯示，該收益率也高於過去六次標售的平均水平3.912%。(完)\n\n[表格內容]\n****查閱相關新聞或頁面，請點選下列代碼連結**** 美國現貨公債 美國指標公債報價 (0#USBMK=) 英國公債市場 歐元區公債市場 日本公債市場 中國債市 台灣債市 歐元區指標公債報價 (0#EUBMK=) 利率或央行相關報導",
      "ContentLength": 1186,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 06:42:53"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YU19T:0/",
      "Date": "2026-01-30",
      "Time": "04:07:39",
      "Title": "《全球匯市》美元承壓，投資者對美國政策仍感到不安",
      "Content": "美元兌日圓和歐元周四下滑，但仍高於近期觸及的多年低點。儘管美聯儲釋放出略偏鷹派的信號為美元提供了一定支撐，但投資者對美國政策前景仍心存疑慮。\n\n美元近期承壓，原因包括市場預期美聯儲將繼續降息、關稅前景不確定以及美國政策波動。美元上周錄得去年4月以來最大單周跌幅，因部分投資者擔憂美國對格陵蘭的政策。\n\n“目前美國出台的貿易與地緣政治政策令投資者感到擔憂，這些因素可能對美元不利，”豐業銀行(Scotiabank)首席外匯策略師Shaun Osborne表示。\n\n美元兌日圓下跌0.2%至153.055日圓，歐元上漲0.5%至1.196美元。\n\n美聯儲周三維持利率不變。美聯儲主席鮑威爾表示，美國經濟穩健，通脹和就業風險有所緩解，這為美元提供了一些支撐。\n\n周四公布的數據顯示，美國上周初請失業金人數小幅下降，但仍與相對較低的裁員水平相符，儘管招聘疲軟加劇了家庭對勞動力市場的焦慮。\n\n美國總統特朗普周四表示，美國目前的利率水平本應“低得多”，應擁有全球最低利率。\n\n不過，一些分析師預計美聯儲不會很快降息。\n\n“儘管前景仍不確定，尤其是未來幾個月將任命新的美聯儲主席，但我們的基線預測是降息周期已經結束，隨著就業改善，下一步可能是升息，最早可能在2026年第四季度，”麥格理集團(Macquarie Group)經濟研究主管David Doyle表示。\n\n本周稍早，美元承壓，此前特朗普周二在被問及美元是否跌得過多時稱，美元價值 \"很好\"，。最新評論令市場更加不安。美國財長貝森特隨後重申美國奉行強勢美元，略微緩和了市場壓力，但投資者仍擔心美元進一步下跌。\n\n“白宮和財政部在美元問題上的信息有些矛盾……這無法增強市場信心，”Osborne表示。\n\n儘管美元周四走勢顯示出在本周早些時候大幅下滑後的企穩跡象，但投資者對其短期前景仍保持謹慎。\n\n“短線動能已大幅轉向對美元不利，而我們原本預期會支撐美元的長期力量並未及時發揮作用，”渣打銀行G10外匯研究主管兼北美宏觀策略負責人Steven Englander在一份報告中表示。\n\n**歐元重新成為歐洲央行關注焦點**\n\n歐元最近升破關鍵的1.20美元關口，引發歐洲央行官員關注，他們警告貨幣快速升值可能產生通縮效應。\n\n“雖然去年歐元/美元遠高於歐洲央行的基本情境且未觸發嚴重通縮風險，但貿易不確定性仍然存在，”紐約梅隆銀行(BNY)EMEA宏觀策略師Geoff Yu稱。\n\n經濟學家指出，歐元走強可能放大中國出口帶來的通縮效應，使歐洲央行從當前的“良好狀態”被迫轉向進一步降息。\n\n歐洲央行執委施納貝爾(Isabel Schnabel)周三重申，當前貨幣政策處於“良好狀態”，利率預計將在較長時間維持不變，而金融市場預計將至少穩至2027年初。\n\n**日本財政政策仍受關注**\n\n美元下滑為疲弱的日圓 帶來一些喘息空間。\n\n日圓兌美元本周多數時間維持在152至154日圓區間內，因市場傳言上周美國和日本可能進行了匯率檢查，這一舉動通常被視為干預前兆。\n\n高盛在一份報告中表示，日本財務省與美國財政部可能採取協同行動，這應能在短期內限制日圓進一步走軟的壓力，但警告稱，只有在日本央行加快收緊貨幣政策或財政緊縮等有利於通脹回落的基本面因素支持下，這種影響才能持續。\n\n加元兌美元周四上漲0.4%，此前一天加拿大央行如預期將政策利率維持在2.25%不變。\n\n在風險資產遭拋售之際，主要加密貨幣比特幣 周四下跌6%，至83,563美元。(完)",
      "ContentLength": 1443,
      "HasTables": false,
      "ScrapedAt": "2026-01-30 04:42:45"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YU0WS:0/",
      "Date": "2026-01-29",
      "Time": "17:15:24",
      "Title": "台灣匯市：台幣微幅收貶中止連五升，因韓元、人民幣走弱但外資仍匯入",
      "Content": "台幣兌美元 周四微幅收貶，中止連五日上揚走勢。交易員指出，美國財政部長貝森特談話讓美元稍獲喘息，且午後韓元與人民幣小幅走弱，牽動台幣跟隨收貶。\n\n他們表示，今日台股雖然震盪收低且成交爆出天量，不過外資還是持續匯入並買超，加上出口商臨近月底有拋匯壓力，均讓台幣在盤中得以微幅走升。 \n\n“出口商有拋匯壓力，畢竟月底近了。”一大型銀行交易員說。\n\n他指出，由於美元仍疲弱，盤中見到包括油款在內的進口商積極承接，此外也有不少民眾發揮螞蟻雄兵精神買進美元。\n\n另一大型銀行交易員則稱，外資連三日買超台股達702.14億台幣，因此今日持續匯入，不過午後人民幣與韓元表現偏弱，使得台幣也跟進收低。\n\n其認為，今日台股爆量收低，整體呈現內資拋、外資接的結構，接下來仍要觀察大盤能否重拾漲勢，若欲振乏力也會令外資轉向賣股匯出。 \n\n台灣股市周四收低，成交量則創下歷史新高，並中止連五日上揚走勢。外資及陸資在台股買超146.59億台幣，連三個交易日共買超702.14億台幣。\n\n在海外無本金交割遠期外匯市場(NDF)方面，目前指標一個月期美元/台幣換匯點 (TWDNDF=)折價幅度較上日尾盤收斂；一個月美元/台幣遠匯 (TWD1MNDFOR=)報31.310/31.340，上日收在31.226。\n\n交易員預估，明日台幣兌美元主要交易區間在31.250-31.350。\n\n[表格內容]\n16:00 台幣/美元報價 上日收盤 波動區間 開盤價 成交量(億美元) 上日成交量 (億美元) 台北外匯經紀公司 (TAIFX1) 31.327 31.320 31.270-31.329 31.300 14.01 15.22 元太外匯經紀公司 31.320 31.318 31.270-31.329 31.270 5.235 7.29 \n\n[表格內容]\n無本金交割遠期外匯(NDF) (TWDNDF=) 最新報價 上日現貨收盤時水準 美元/台幣一個月期 -0.060/-0.030 -0.095/-0.065 美元/台幣六個月期 -0.195/-0.165 -0.225/-0.195 \n（完）",
      "ContentLength": 883,
      "HasTables": false,
      "ScrapedAt": "2026-01-29 18:43:07"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YU0MA:0/",
      "Date": "2026-01-29",
      "Time": "17:09:21",
      "Title": "《全球匯市》美元位於多年低點附近，投資者認為風險不斷累積",
      "Content": "美元周四依然疲弱不穩，白宮和歐洲官員發表的支持性言論，僅部分抵消了圍繞美國經濟政策與地緣政治動向的不確定性。 \n\n在貨幣政策方面，美聯儲隔夜對美國勞動力市場和通脹風險持更樂觀態度，投資者據此認為利率可能會在較長時間內維持不變。 (0#USDIRPR)\n\n美元本周早些時候大幅下挫，並觸及四年低位，此前美國總統特朗普似乎對美元走弱未予理會。不過在美國財長貝森特次日表示華盛頓奉行強勢美元政策後，美元才獲得支撐。\n\n美聯儲主席鮑威爾暗示在進一步降息前將保持較長時間的觀望，部分經濟學家認為美國經濟目前尚無必要實施額外寬鬆政策。\n\n麥格理集團首席經濟學家David Doyle表示：\"儘管前景仍存不確定性--尤其考慮到數月後新的美聯儲主席上任--但我們的基本預期仍是降息周期已結束，因就業市場改善在即。\"\n\n\"我們預計下次政策調整將是加息，可能發生在2026年四季度。\"\n\n歐元兌美元 在美元下跌推動下突破關鍵的1.20關口，但回落至1.1980美元，此前歐洲央行決策者同樣對歐元快速升值表示日益擔憂。 \n\n周四美元拋壓有所緩解，但美元兌主要貨幣仍處於弱勢。\n\n美元兌瑞郎 下跌0.33%至0.766，逼近11年低點；英鎊 接近四年半高位，報1.3844美元。\n\n澳元 創下三年高位0.70495美元，受澳洲最早可能在下周加息的預期推動。澳元最新上漲0.45%至0.7073。 \n\n本周早些時候美元的拋售是自去年4月特朗普關稅行動震動市場以來最劇烈的一次。美元今年迄今已下跌2%。 \n\n澳洲國民銀行的Attrill表示，美元表現將關鍵取決於圍繞美聯儲獨立性的相關問題如何發展，包括美國最高法院對特朗普試圖解雇美聯儲理事庫克的裁決。\n\n\"喪失獨立性無疑是美元霸權持續面臨的最大風險，\"他強調。\n\n美元指數 報96.06，徘徊在周二觸及的四年低點95.566附近。\n\n美元的走弱給疲軟的日圓 帶來喘息空間，周四日圓兌美元上漲0.13%，至153.23日圓。 \n\n新西蘭元 逼近七個月高點0.60925美元。人民幣兌美元 維持在32個月高位附近，持穩在6.9471。\n\n[表格內容]\n 紐約 當日 今年來 2025年 最新報價 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1971 1.1952 +0.16 +1.92 1.1745 美元/日圓 153.28 153.40 -0.08 -2.15 156.65 歐元/日圓 183.50 183.37 +0.07 -0.27 183.99 美元/瑞郎 0.7664 0.7682 -0.23 -3.27 0.7923 英鎊/美元 1.3821 1.3805 +0.12 +2.58 1.3473 美元/加元 1.3527 1.3555 -0.21 -1.44 1.3724 美元/離岸人民幣 6.9412 6.9428 -0.02 -0.49 6.9756 澳元/美元 0.7062 0.7040 +0.31 +5.85 0.6672 新西蘭元/美元 0.6066 0.6059 +0.12 +5.39 0.5756 歐元/瑞郎 0.9175 0.9183 -0.09 -1.43 0.9308 歐元/英鎊 0.8659 0.8655 +0.05 -0.64 0.8715 歐元/瑞典克朗 10.5859 10.5572 +0.27 -2.04 10.8061 美元/挪威克朗 9.5793 9.5896 -0.11 -4.77 10.0588 美元指數 96.213 96.446 -0.24 -2.14 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1681,
      "HasTables": false,
      "ScrapedAt": "2026-01-29 18:43:11"
    },
    {
      "Source": "TradingView - Reuters Brief",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YU0IF:0/",
      "Date": "2026-01-29",
      "Time": "16:58:35",
      "Title": "《路透晚報》--1月29日新聞摘要（國際版）",
      "Content": "以下為路透中文新聞為您整理的亞洲市場時段(上午7:00-下午5:00)新聞摘要：\n\n[重大數據或新聞]\n\n--斯塔默：英中在關稅、免簽及移民問題上取得良好進展\n\n英國首相斯塔默表示，他與中國國家主席習近平在周四的會晤中在關稅、旅行及小船非法移民等問題上取得了良好進展，使兩國關係處於一個\"穩固狀態\"。斯塔默在與習近平舉行80分鐘會晤後于北京對記者表示：“我們在威士忌關稅、赴華免簽，以及在應對非正規移民方面的信息交流合作上都取得了相當不錯的進展。”雙方討論了威士忌關稅的下調幅度及時間表，並在更廣泛的安全與防務戰略框架下，討論了用於非法移民進入英國的小船的相關信息。\n\n--2025年全球黃金需求創歷史新高--世界黃金協會\n\n世界黃金協會(WGC)表示，2025年全球黃金需求增長1%，達到5,002噸，創紀錄新高。在動盪和貿易不穩定引發焦慮情緒、推動投資需求激增之際，儘管金價接連創下歷史新高令金飾買家卻步，全球黃金需求去年仍創下歷史新高。\n\n* 2025年中國黃金需求總量創四年最高水平，今年投資或持續穩健態勢 \n\n* 印度黃金需求將於2026年下滑，珠寶需求萎縮抵消投資需求增長 \n\n--韓國產業通商資源部長官抵達華盛頓，就關稅警告展開磋商--韓聯社\n\n據韓聯社報導，韓國產業通商資源部長官金正官周四抵達華盛頓，表示將與美國商務部長盧特尼克會晤，就韓美貿易協定“延遲”問題闡明首爾立場。金正官表示，他計劃“明確說明韓國政府對美合作與投資的承諾沒有任何改變”。\n\n--德國總理默茨：美國不應質疑與歐盟的貿易協議\n\n德國總理默茨表示，只要華盛頓履行其承諾，歐盟與美國之間貿易協議的批準基礎就已具備。默茨表示，在特朗普撤回對歐盟輸美商品的新關稅威脅，並似乎與北約就格陵蘭問題達成協議後，2025年貿易協議的落實基礎已具備。默茨補充稱，歐盟與美國仍需就鋁和鋼達成最終協議。\n\n默茨對美元急劇貶值表示擔憂。此前美元已跌至四年低點。“一段時間以來，我一直以關切的態度關注美元匯率走勢，”默茨與執政聯盟夥伴在柏林舉行會議前在新聞發布會上表示：“美元走勢給德國出口經濟帶來相當大的額外負擔。”\n\n--新加坡維持貨幣政策不變，強調經濟增長強勁\n\n新加坡金管局維持貨幣政策設置不變，並指出通脹和需求存在上行風險，因經濟前景依然強勁。金管局表示，將維持坡元名義有效匯率(NEER)的現行升值幅度。匯率政策區間的寬度及中點水平均維持不變。“當前經濟增長與通脹前景的風險偏向上行，”金管局表示。“不過，也存在一些下行風險，反映出全球經濟潛在的脆弱性。”\n\n--韓國國民年金公團(NPS)理事長金成柱表示，該機構一直在應對匯率波動，並將繼續採取行動，以幫助穩定韓元匯率。\n\n--特朗普考慮對伊朗發動打擊以增強抗議者信心--消息人士\n\n多位消息人士稱，美國總統特朗普正考慮對伊朗採取包括針對安全部隊和領導人實施定點打擊在內的多種選項，以激勵抗議者。但以色列和阿拉伯官員表示，僅靠空中力量無法推翻伊朗的神職統治者。\n\n--格陵蘭和丹麥領導人與馬克龍會晤，稱需加強格陵蘭的安全保障\n\n格陵蘭總理與丹麥首相弗雷澤里克森在巴黎會晤了法國總統馬克龍，旨在爭取各方支持，以應對美國總統特朗普試圖接管格陵蘭島的行動。\n\n* 歐盟能源執委約根森：格陵蘭危機為歐洲能源安全敲響警鐘\n\n--越南與歐盟宣布提升兩國外交關係級別。雙方致力於在全球動盪時期拓展國際夥伴關係。\n\n--澳新銀行公布調查顯示，新西蘭企業信心在1月出現下滑，不過多數經濟活動指標的強勁勢頭基本得以維持。\n\n--挪威2.2萬億美元的主權財富基金公布的數據顯示，該基金在2025年下半年繼續增持美國公債，延續了長期趨勢。\n\n--印尼金融監管機構表示，將把上市公司自由流通股數比例規定提高一倍至15%，作為回應MSCI(明晟)對該國股市透明度疑慮的舉措之一。此前MSCI的疑慮引發本周印尼股市的大規模拋售。\n\n--印度政府預測，從4月開始的新財年，印度經濟增長率將在6.8%至7.2%之間。\n\n--一名印度官員表示，根據該國與歐盟的新貿易協議，印度將立即將高端歐洲汽車的關稅從高達110%大幅調降至30%，向寶馬(BMW)和奔馳等豪華汽車製造商開放受到高度控制的車市。\n\n--獨家：白宮將與銀行及加密貨幣企業高管會晤，推動立法妥協\n\n據三名行業消息人士透露，白宮將於周一與銀行業和加密貨幣行業的高管舉行會談，討論一項具有里程碑意義的加密貨幣立法的推進路徑。該法案因這兩大強勢行業之間的分歧而陷入停滯。\n\n--歐盟執委會副主席東布洛夫斯基表示，歐盟需要迅速推出數字歐元，以降低對占主導地位的美國支付公司的依賴。\n\n--獨家：美國政府逐漸放棄關鍵礦產保底價格計劃--消息人士\n\n多位消息人士向路透透露，特朗普政府正逐漸放棄為美國關鍵礦產項目設定最低價格保障的計劃，實際上承認此計劃缺乏國會資助及制定市場定價複雜性問題。\n\n--據《紐約時報》援引知情人士說法報導，美國總統特朗普與參議院少數黨領袖舒默周三晚間力圖達成協議，將就對聯邦移民官員實施新限制展開協商，此舉或可避免政府停擺。\n\n--美國總統特朗普推出由政府支持的嬰兒投資賬戶計劃，並敦促美國企業為員工家庭賬戶提供資金。\n\n--美國眾議院中國特別委員會主席穆勒納爾正嚴密檢視福特汽車的計劃，該公司擬將其現有美國電池製造工廠改造為生產磷酸鐵鋰電池及電網級儲能系統的基地，此為其與中國電池巨頭寧德時代合作計劃的一部分。\n\n--獨家：兩位知情消息人士向路透表示，美國煉油商 Citgo Petroleum 自 2019 年與其母公司、委內瑞拉國家石油公司(PDVSA)斷絕關係以來，首次購買了委內瑞拉原油。\n\n--Nvidia(輝達/英偉達)首席執行官黃仁勳表示，希望中國允許Nvidia在當地銷售其強大的H200人工智能芯片，目前相關許可正在最終敲定中。 \n\nThe Information報導稱，Nvidia(輝達/英偉達)、亞馬遜和微軟正在洽談向OpenAI投資至多600億美元。\n\n--特斯拉宣布，將向首席執行官馬斯克（Elon Musk）的人工智能公司xAI投資20億美元，並表示Cybercab無人駕駛出租車的生產計劃正按計劃推進，將於今年投產。\n\n--韓國三星電子預測，受人工智能熱潮推動，今年芯片短缺局面將進一步加劇。強勁的內存需求雖利好其核心芯片業務，卻給智能手機和顯示器等其他業務帶來不利因素。\n\n--IBM公布第四季營收和獲利超出華爾街預期，人工智能(AI)的快速普及推動對該公司軟件服務的需求，從海量數據管理到IT流程自動化等等，涵蓋範圍廣泛。IBM股價在盤後上漲近9%。\n\n[市場摘要]\n\n--日本股市：愛德萬測試領漲下收升，防務類股因選舉民調走高\n\n日本股市周四上漲，權重股芯片測試設備製造商愛德萬測試(Advantest)領漲，而防務類股則受益於媒體民調顯示保守派首相高市早苗所屬政黨可能在下月選舉中贏得多數席位。東證股價指數(Topix)上漲0.3%至3,545.30點，扭轉了早盤0.8%的跌幅。科技股占比較高的日經指數收平盤，報53,375.60點，扳回了早盤0.7%的跌幅。\n\n--中港股市：滬綜指收高地產白酒股暴漲，恆指七連收升續創四年半新高\n\n中國股市滬綜指收高，官媒稱房地產“三道紅線”政策終結引發地產和消費板塊飆升，白酒指數創下單日最大漲幅，半導體板塊則逆市下挫。滬綜指收升0.2%，至4,157.98點，滬深300指數收漲0.8%。香港恆生指數收升0.5%，至27,968.09點，續創2021年7月16日以來新高；恆生科技指數收低1%。\n\n--匯市：美元仍遭冷落，投資者認為風險不斷累積\n\n美元依然疲弱不穩，白宮和歐洲官員發表的支持性言論，僅部分抵消了圍繞美國經濟政策與地緣政治動向的不確定性。在貨幣政策方面，美聯儲隔夜對美國勞動力市場和通脹風險持更樂觀態度，投資者據此認為利率可能會在較長時間內維持不變。截至0819GMT，美元指數上漲0.01%，報96.16。歐元兌美元上漲0.17%，報1.1974；美元兌日圓下跌0.13%，報153.23。\n\n--歐元債市：公債收益率持平，歐洲央行對歐元漲勢表達關切\n\n歐元區公債收益率持平，因強勢歐元疑慮揮之不去，市場擔心這可能促使歐洲央行降息，在此同時美國聯邦儲備理事會(美聯儲/FED)上日維持利率不變。德國10年期公債收益率最新報2.86%，變動不大。歐元區短天期公債收益率回落，其中德國兩年期公債收益率一度創一周新低，最新則是持平於2.07%。\n\n--國際油市：油價上漲逾1%，市場擔憂伊朗可能遭到軍事打擊\n\n周四油價上漲超過1%，連續第三日上漲，因市場日益擔憂美國可能對中東主要產油國伊朗發動軍事打擊，這可能導致該地區石油供應中斷。截至0819GMT，布蘭特原油上漲1.35%，報每桶69.32美元。西德克薩斯中質油(WTI)上漲1.47%，報每桶64.14美元。\n\n--全球金市：黃金因避險需求逼近5,600美元，白銀一度突破120美元\n\n金價持續攀升，位於略低於每盎司5,600美元的水平，地緣政治與經濟憂慮加劇，投資者紛紛湧向避險資產，白銀則一度躍升至120美元上方。截至0819GMT，現貨金上漲2.35%，報每盎司5,526.10美元。美國期金上漲4.06%，報每盎司5,518.80美元。\n\n--金屬期市：銅價勁升逾6%創新高，地緣政治風險與美元疲軟助推\n\n銅價觸及歷史新高。金屬市場整體上漲，得益於地緣政治風險和美元疲軟背景下投資者對實物資產的追捧。上海期貨交易所最活躍銅合約日盤收盤大漲6.71%，報每噸109,110元（合15,708.77美元），盤中一度飆升8.53%觸及每噸110,970元歷史高點。截至0819GMT，倫敦金屬交易所(LME)指標三個月期銅上漲6.49%，報每噸13,936.00美元。盤中曾飆升7.94%觸及14,125美元的歷史峰值。\n\n注：其他重要財經新聞瀏覽請點選；近日《路透晚報》請點選。(完)",
      "ContentLength": 4106,
      "HasTables": false,
      "ScrapedAt": "2026-01-29 18:42:47"
    },
    {
      "Source": "TradingView - Reuters Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YU0PF:0/",
      "Date": "2026-01-29",
      "Time": "14:49:57",
      "Title": "台灣債市：10年指標債殖利率收在平盤，美聯儲利率前景指引未形成漣漪",
      "Content": "台灣指標10年公債115/3期 (A15103=TWO)周四發行前交易殖利率以平盤作收。交易員表示，昨晚美聯儲給出的指引與市場預期大致相同，此令台債交投缺乏明確走向。\n\n他們指出，除115/3在電子盤的交易外，今日冷券市場的交投也清淡，交易商在農曆年封關前的關注焦點，只能投射在下周四的115/3標售。 \n\n“（美聯儲主席）鮑威爾的會後聲明與市場預期差不多，所以連美債也沒什麼方向。”一位民營銀行交易員說。 \n\n美聯儲周三維持利率不變，主席鮑威爾稱經濟增長前景明顯改善，通脹和就業風險均有所降低，這一判斷暗示沒有進一步降低借貸成本的緊迫性。\n\n另位大型銀行交易員則稱，115/3成交在1.42%應該算目前的合理水準，前幾天的九年冷券也差不多成交在1.40%；隨著美聯儲政策變數暫時解除，台灣因經濟前景仍算樂觀，對央行降息預期可能還要往後退，所以利率再低就沒人想接了。 \n\n台灣央行將於下周四代財政部標售10年券115/3期，金額暫定350億台幣，並預計在2月10日發行。而因應農曆春節，台灣股債市將於2月11日封關，休市到2月23日重新開市。\n\n交易員預估，明日五年增額公債115/1R期 (A15101R=TWO)殖利率交易區間在1.31-1.34%，而10年債115/3期殖利率交易區間則在1.41-1.43%。 \n\n[表格內容]\n 收盤價 漲跌幅 報價 區間 成交值 年期 期別 (基點) (億台幣) 10 115/3 (A15103=TWO) 0.0 1.42% 1.42-1.42% 3.0 \n 今日電子盤各期指標券收盤情形：\n\n[表格內容]\n 30 114/11 (A14111=TWO) 沒有成交 20 115/4 (A15104=TWO) 沒有成交 10 115/3 (A15103=TWO) 1.42% 5 115/1 (A15101=TWO) 沒有成交 2 115/2 (A15102=TWO) 沒有成交 \n（完）",
      "ContentLength": 817,
      "HasTables": false,
      "ScrapedAt": "2026-01-29 18:42:57"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YU0DF:0/",
      "Date": "2026-01-29",
      "Time": "14:29:48",
      "Title": "《全球匯市》美元仍遭冷落，投資者認為風險不斷累積",
      "Content": "美元周四依然疲弱不穩，白宮和歐洲官員發表的支持性言論，僅部分抵消了圍繞美國經濟政策與地緣政治動向的不確定性。 \n\n在貨幣政策方面，美聯儲隔夜對美國勞動力市場和通脹風險持更樂觀態度，投資者據此認為利率可能會在較長時間內維持不變。 (0#USDIRPR)\n\n美元本周早些時候大幅下挫，並觸及四年低位，此前美國總統特朗普似乎對美元走弱未予理會。不過在美國財長貝森特次日表示華盛頓奉行強勢美元政策後，美元才獲得支撐。\n\n歐元兌美元 在美元下跌推動下突破關鍵的1.20關口，但亞洲時段回落至1.1988美元，此前歐洲央行決策者同樣對歐元快速升值表示日益擔憂。\n\n澳洲國民銀行外匯策略主管Ray Attrill表示：“貝森特的評論相當及時--如果你願意的話，可以認為這是預先安排的。”\n\n他說：“我認為歐洲央行的評論是獨立的，但有趣的是，歐元/美元在1.20附近似乎確實觸發了一些反應。”\n\n“你可以認為……歐元/美元近期的升勢雖然並不算大，但某種程度上掩蓋了歐元整體走強的趨勢，而這將會影響歐洲央行的通脹預測。”\n\n儘管周四大規模美元拋售有所緩解，但美元仍處於守勢。\n\n美元兌瑞郎 下跌0.43%至0.7654，逼近11年低點；英鎊 接近四年半高位，報1.3844美元。\n\n澳元 創下三年高位0.70495美元，受澳洲最早可能在下周加息的預期推動。澳元最新上漲0.72%至0.7092。 \n\n本周早些時候美元的拋售是自去年4月特朗普關稅行動震動市場以來最劇烈的一次。\n\n美元今年迄今已下跌2%。 \n\n澳洲國民銀行的Attrill表示，美元表現將關鍵取決於圍繞美聯儲獨立性的相關問題如何發展，包括美國最高法院對特朗普試圖解雇美聯儲理事庫克的裁決。\n\n\"喪失獨立性無疑是美元霸權持續面臨的最大風險，\"他強調。\n\n美元指數報 報96.06，徘徊在周二觸及的四年低點95.566附近。\n\n美元的走弱給疲軟的日圓 帶來喘息空間，周四日圓兌美元上漲0.25%，至153.00日圓。\n\n由於上周美國和日本傳出匯率詢價的消息--這種舉動通常被視為干預的前兆，本周大部分時間里，日圓兌美元一直在152-154日圓區間徘徊。\n\n新西蘭元 接近七個月高點0.60695美元。人民幣兌美元 位於32個月高點附近，持穩在6.9471。\n\n[表格內容]\n 最新報價 紐約 當日 今年來 2025年 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1981 1.1952 +0.24 +2.01 1.1745 美元/日圓 153.0400 153.40 -0.23 -2.30 156.65 歐元/日圓 183.39 183.37 +0.01 -0.33 183.99 美元/瑞郎 0.7656 0.7682 -0.34 -3.37 0.7923 英鎊/美元 1.3835 1.3805 +0.22 +2.69 1.3473 美元/加元 1.3523 1.3555 -0.24 -1.46 1.3724 美元/離岸人民幣 6.9436 6.9428 +0.01 -0.46 6.9756 澳元/美元 0.7087 0.7040 +0.67 +6.22 0.6672 新西蘭元/美元 0.6087 0.6059 +0.46 +5.75 0.5756 澳元/日圓 108.410 106.710 +1.59 +3.70 104.540 新西蘭元/日圓 91.900 91.900 0.00 +1.33 90.690 英鎊/日圓 211.72 211.69 +0.02 +0.34 211.02 澳元/新西蘭元 1.1637 1.1615 +0.19 +0.45 1.1585 美元指數 96.112 96.446 -0.35 -2.25 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1753,
      "HasTables": false,
      "ScrapedAt": "2026-01-29 18:43:15"
    },
    {
      "Source": "TradingView - Reuters Stocks",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YU0LE:0/",
      "Date": "2026-01-29",
      "Time": "14:17:53",
      "Title": "台灣股市：收低創下歷史天量，投資人居高思危選擇獲利離場",
      "Content": "台灣股市周四收低，成交量則創下歷史新高，並中止連五日上揚走勢。分析師稱，因美股期貨盤下跌且投資人在接近33,000點整數大關進行獲利了結。\n\n台灣加權指數 TWSE:TAIEX收低0.82%至32,536.27點，盤初一度高見32,996.03點；今日成交初值 (.TTOV.TW)擴增至9,307.94億台幣的歷史天量，上日修正後為8,539.22億。\n\n“投資人居高思危，在接近33,000點獲利了結賣壓不輕。”華南投顧分析師蘇見文說。\n\n他表示，雖然今日大盤量增價跌，不過尚未失控，指數仍沿著五日均線上揚，只是隨著農曆春節長假逐漸接近，投資人追價意願也會降低，台股要再創高點的機率已逐漸降低。 \n\n野村投信基金經理人游景德則指出，記憶體產品傳出漲價利多，帶動族群股價全面走強。市場焦點同時聚焦於本週即將公布財報的多家科技巨頭，在重量級業績登場前，市場情緒料保持樂觀。\n\n分析師預估，明日台股指數區間在32,400-33,000點。（完） \n\n[表格內容]\n**查閱相關新聞或頁面，請點選下列代碼連結**** 美國股市 一周展望 歐洲股市報導 日本股市報導 中港股市報導 中國股市報導 台灣股市報導 股市簡訊 納斯達克最活躍個股 (.AV.O) 紐約證交所最活躍個股 (.AV.N) 納斯達克漲幅居前個股 (.PG.O) 紐約證交所漲幅居前個股 (.PG.N) 納斯達克跌幅居前個股 (.PL.O) 紐約證交所跌幅居前個股 (.PL.N) 標普主要分類指數 (0#.GSPMAJOR) 英股富時指數 CURRENCYCOM:UK100 德股DAX指數 法股CAC-40指數 韓國股市已並入韓國金融市場報導中，相關稿件請點選",
      "ContentLength": 713,
      "HasTables": false,
      "ScrapedAt": "2026-01-29 18:42:51"
    },
    {
      "Source": "TradingView - Reuters Bonds",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YT0YN:0/",
      "Date": "2026-01-29",
      "Time": "10:57:50",
      "Title": "台灣債市：指標10年債115/3殖利率開在平盤，該券標售成農曆年封關重頭戲",
      "Content": "台灣指標10年公債115/3期 (A15103=TWO)周四發行前交易殖利率開平于上個成交日。交易員指出，由於115/3期新券將於下周四標售，並在2月10日發行，正好落在農曆年封關日(2月11日)前交割，讓該券標售成農曆年封關重頭戲。\n\n“早上開在這里合理，五年跟10年債利差大約10(基)點。”一位大型證券交易員說。\n\n另位大型銀行交易員則稱，今日115/3殖利率算是以平盤開出，還要再觀察該券利率走勢，將牽動該券標售結果。\n\n台灣央行將於下周四代財政部標售10年券115/3期，金額暫定350億台幣，並預計在2月10日發行。而因應農曆春節，台灣股債市將於2月11日封關，休市到2月23日重新開市。\n\n本地時間10:49，10年券115/3期 (A15103=TWO)發行前交易殖利率報1.42%，成交2億台幣，五年券115/1R期 (A15101R=TWO)電子盤暫無成交；台股 TWSE:TAIEX則跌0.5%。 \n\n交易員預估，今日五年債115/1R期殖利率交易區間在1.30-1.34%；10年債115/3期殖利率區間則在1.40-1.43%。（完）\n\n最新相關報導鏈接：\n\n--美國債市：公債收益率攀升，之前美聯儲維持利率不變",
      "ContentLength": 519,
      "HasTables": false,
      "ScrapedAt": "2026-01-29 18:43:02"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L6T3YU03B:0/",
      "Date": "2026-01-29",
      "Time": "10:16:20",
      "Title": "《全球匯市》美元依然不穩，市場擔憂風險不斷累積",
      "Content": "美元周四依然疲弱不穩，白宮和歐洲官員發表的支持性言論，僅部分抵消了圍繞美國經濟政策與地緣政治動向的不確定性。\n\n在貨幣政策方面，美聯儲隔夜對美國勞動力市場和通脹風險持更樂觀態度，投資者據此認為利率可能會在較長時間內維持不變。 (0#USDIRPR)\n\n美元本周早些時候大幅下挫，並觸及四年低位，此前美國總統特朗普似乎對美元走弱未予理會。不過在美國財長貝森特次日表示華盛頓奉行強勢美元政策後，美元才獲得支撐。\n\n歐元兌美元匯率 在美元下跌推動下突破關鍵的1.20關口，但亞洲時段回落至1.1979美元，此前歐洲央行決策者同樣對歐元快速升值表示日益擔憂。\n\n澳洲國民銀行外匯策略主管Ray Attrill表示：“貝森特的評論相當及時--如果你願意的話，可以認為這是預先安排的。”\n\n他說：“我認為歐洲央行的評論是獨立的，但有趣的是，歐元/美元在1.20附近似乎確實觸發了一些反應。”\n\n“你可以認為……歐元/美元近期的升勢雖然並不算大，但某種程度上掩蓋了歐元整體走強的趨勢，而這將會影響歐洲央行的通脹預測。”\n\n儘管周四大規模美元拋售有所緩解，但美元仍處於守勢。\n\n美元兌瑞郎 下跌0.5%至0.7656瑞郎，逼近11年低點；英鎊 接近四年半高位，報1.3826美元。\n\n澳元 創下三年高位0.70495美元，受澳洲最早可能在下周加息的預期推動。\n\n本周早些時候美元的拋售是自去年4月特朗普關稅行動震動市場以來最劇烈的一次。\n\n美元今年迄今已下跌2%。\n\n澳洲國民銀行的Attrill表示，美元表現將關鍵取決於圍繞美聯儲獨立性的相關問題如何發展，包括美國最高法院對特朗普試圖解雇美聯儲理事庫克的裁決。\n\n\"喪失獨立性無疑是美元霸權持續面臨的最大風險，\"他強調。\n\n美元指數報96.24 ，徘徊在周二觸及的四年低點95.566附近。\n\n美元的走弱給疲軟的日圓 帶來喘息空間，周四日圓兌美元上漲0.12%，至1美元兌153.21日圓。\n\n由於上周美國和日本傳出匯率詢價的消息--這種舉動通常被視為干預的前兆，本周大部分時間里，日圓兌美元一直在152-154日圓區間徘徊。\n\n其他方面，新西蘭元 攀升至六個半月高點0.60695美元。離岸人民幣 小幅上漲至1美元兌6.9426元人民幣，本周早些時候曾觸及2023年5月以來的最強水平。\n\n[表格內容]\n 最新報價 紐約 當日 今年來 2025年 上收市價 漲跌% 漲跌% 收市價 歐元/美元 1.1960 1.1952 +0.07 +1.83 1.1745 美元/日圓 153.2500 153.40 -0.10 -2.17 156.65 歐元/日圓 183.31 183.37 -0.03 -0.37 183.99 美元/瑞郎 0.7670 0.7682 -0.16 -3.19 0.7923 英鎊/美元 1.3801 1.3805 -0.03 +2.43 1.3473 美元/加元 1.3548 1.3555 -0.04 -1.27 1.3724 美元/離岸人民幣 6.9454 6.9428 +0.04 -0.43 6.9756 澳元/美元 0.7027 0.7040 -0.18 +5.32 0.6672 新西蘭元/美元 0.6048 0.6059 -0.18 +5.07 0.5756 澳元/日圓 107.620 106.710 +0.85 +2.95 104.540 新西蘭元/日圓 91.900 91.900 0.00 +1.33 90.690 英鎊/日圓 211.48 211.69 -0.10 +0.22 211.02 澳元/新西蘭元 1.1612 1.1615 -0.03 +0.23 1.1585 美元指數 96.288 96.446 -0.16 -2.07 98.322 (完) ****查閱相關新聞或頁面，請點選下列代碼連結**** 全球匯市簡訊 全球匯市報導 所有外匯新聞 匯率路透調查 美加經濟指標預測 歐洲經濟指標預測 指標利率一覽 澳元、新西蘭元報導 英鎊報導 台幣報導 人民幣報導 韓元報導 南非蘭特報導 亞洲盤現匯報價 (AFX=) 歐洲盤現匯報價 (EFX=) 紐約盤現匯報價 (NFX=) 全部現匯報價 (FX=) 英文匯市簡訊頁面 (FXBUZZ)",
      "ContentLength": 1766,
      "HasTables": false,
      "ScrapedAt": "2026-01-29 18:43:23"
    },
    {
      "Source": "TradingView - Reuters FX",
      "URL": "https://tw.tradingview.com/news/reuters.com,2026:newsml_L4T3YU05S:0/",
      "Date": "2026-01-29",
      "Time": "09:49:20",
      "Title": "台灣匯市：台幣早盤在平盤附近整理，股市震盪加劇可能牽動走向",
      "Content": "台幣兌美元 周四早盤在平盤附近震盪。交易員表示，市場觀望美國財政部長貝森特談話的後續效應，且台股開高後急殺，使得台幣開盤小幅上揚後迅速收斂升幅甚至一度轉為下跌。\n\n他們稱，貝森特強調偏好強勢美元，且否認美國干預外匯市場以支撐日圓，多少為美元提供了些支撐，且日圓也維持整理格局，使得亞幣近日的升值格局無法延續。 \n\n“台股衝高後急殺，加上日圓沒有繼續走升，台幣開高後很快就轉為下跌。”一銀行交易員說。\n\n其指出，由於外資這兩天大買台股555.55億台幣，一早仍有匯入需求令台幣有所支撐，盤中將持續關注台股表現；若出現爆量殺低走勢，台幣可能就會轉而走貶。 \n\n貝森特周三表示，美國奉行強勢美元政策，這意味著要設定正確的基本面。但他同時否認美國正在干預外匯市場以支撐日圓。 \n\n本地時間09:36，台幣兌美元升0.5分報31.315，交易區間在31.270-31.329，此前盤中高位在去年12月15日的31.250；台股 TWSE:TAIEX則跌0.57%報32,615.20點，盤初一度逼近33,000點大關。\n\n在海外無本金交割遠期外匯市場(NDF)方面，目前指標一個月期美元/台幣換匯點 (TWDNDF=)折價幅度較上日尾盤擴大；一個月美元/台幣遠匯 (TWD1MNDFOR=)報31.200/31.263，上日收在31.226。\n\n交易員預估，今日台幣兌美元匯率主要交易區間在31.250-31.350。（完）\n\n最新相關報導鏈接：\n\n--《全球匯市》美元反彈，美聯儲維持利率不變",
      "ContentLength": 642,
      "HasTables": false,
      "ScrapedAt": "2026-01-29 18:43:28"
    }
  ]
}