{
  "last_updated": "2026-02-14T06:32:16.806Z",
  "total_news_count": 11,
  "news": [
    {
      "Ticker": "MU",
      "Date": "2026-02-14",
      "Time": "09:02:00",
      "Source": "Zacks",
      "Title": "The Surge in Micron Technology Stock Looks Poised to Continue",
      "URL": "https://finance.yahoo.com/news/surge-micron-technology-stock-looks-010200212.html",
      "Content": "Being a leading provider of semiconductor memory solutions, Micron Technology MU is the most searched for stock on Zacks.com outside of Nvidia NVDA .\nThis comes as the storied memory chip shortage has made Micron a central beneficiary of the AI hardware boom.\nThe rapid expansion of AI hardware — data centers, GPUs, and accelerators — is consuming most of the memory chip supply and bandwidth, driving a sharp increase in demand for Micron’s offerings.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AMAT",
      "Date": "2026-02-14",
      "Time": "07:07:00",
      "Source": "TheStreet",
      "Title": "BofA revamps Applied Materials stock price target after CEO message",
      "URL": "https://finance.yahoo.com/m/2c08fc88-27e9-329a-b57c-2eae160b3b28/bofa-revamps-applied.html",
      "Content": "Applied Materials ( AMAT ) reported its Q1 earnings on February 12. The earnings beat consensus estimates for adjusted EPS and revenue, and the stock is trading 10% higher at the time of writing, Friday morning, Feb. 13, according to Yahoo Finance .\nThe supplier of semiconductor and semiconductor-related fabrication equipment reported revenue of $7 billion, a 2% year-over-year decline, yet the earnings report got investors excited and prompted Bank of America analyst Vivek Arya to raise his price target for Applied Materials.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MU",
      "Date": "2026-02-14",
      "Time": "06:00:00",
      "Source": "Zacks",
      "Title": "Top Stock Reports for Micron Technology, Goldman Sachs & Verizon",
      "URL": "https://finance.yahoo.com/news/top-stock-reports-micron-technology-220000475.html",
      "Content": "Friday, February 13, 2026\n\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Micron Technology, Inc. (MU), The Goldman Sachs Group, Inc. (GS) and Verizon Communications Inc. (VZ), as well as two micro-cap stocks Natural Grocers by Vitamin Cottage, Inc. (NGVC) and Team, Inc. (TISI). The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\n\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\n\nYou can see all of today&rsquo;s research reports here >>>\n\nAhead of Wall Street\n\nThe daily 'Ahead of Wall Street' article is a must-read for all investors who would like to be ready for that day's trading action. The article comes out before the market opens, attempting to make sense of that morning's economic releases and how they will affect that day's market action. You can read this article for free on our home page and can actually sign up there to get an email notification as this article comes out each morning.\n\nYou can read today's AWS here >>> Near-Perfect CPI Report Brings Pre-Markets Near Breakeven",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MU",
      "Date": "2026-02-14",
      "Time": "04:02:28",
      "Source": "Barchart",
      "Title": "Competition Is Heating Up for Micron. Should You Buy, Sell, or Hold MU Stock Now?",
      "URL": "https://finance.yahoo.com/m/0a217c71-2823-3481-b3b8-a8566d088e5b/competition-is-heating-up-for.html",
      "Content": "Artificial intelligence (AI) is reshaping the tech landscape at breakneck speed, and investors are scrambling to lock in the biggest winners. Yet even in a crowded AI trade, few names have delivered like Micron Technology (MU). The memory-chip giant has ridden the AI wave to record highs, with MU stock delivering massive returns over the past year. Surging demand for memory chips from AI hyperscalers racing to build out massive data center capacity has been the primary engine behind Micron’s remarkable ascent.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AMD",
      "Date": "2026-02-14",
      "Time": "01:44:45",
      "Source": "GuruFocus.com",
      "Title": "AMD Rated Neutral on AI Competition Concerns",
      "URL": "https://finance.yahoo.com/news/amd-rated-neutral-ai-competition-174445344.html",
      "Content": "This article first appeared on GuruFocus .\nAdvanced Micro Devices ( AMD , Financials ) was initiated with a Neutral rating by DA Davidson , with a $220 price target implying limited upside from current levels.\nWarning! GuruFocus has detected 5 Warning Signs with AMD.\nIs AMD fairly valued? Test your thesis with our free DCF calculator.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ADI",
      "Date": "2026-02-13",
      "Time": "07:00:01",
      "Source": "Zacks",
      "Title": "Here's Why Analog Devices (ADI) Fell More Than Broader Market",
      "URL": "https://finance.yahoo.com/news/heres-why-analog-devices-adi-230001477.html",
      "Content": "Analog Devices (ADI) closed the most recent trading day at $331.36, moving -1.67% from the previous trading session. This move lagged the S&P 500's daily loss of 1.57%. Meanwhile, the Dow lost 1.34%, and the Nasdaq, a tech-heavy index, lost 2.04%.\nPrior to today's trading, shares of the semiconductor maker had gained 13.09% outpaced the Computer and Technology sector's loss of 1.83% and the S&P 500's loss of 0.29%.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "LRCX",
      "Date": "2026-02-12",
      "Time": "21:48:08",
      "Source": "Insider Monkey",
      "Title": "Analysts Cite Secular Trends For Lam Research Corporation (LRCX)’s Development",
      "URL": "https://finance.yahoo.com/news/analysts-cite-secular-trends-lam-134808663.html",
      "Content": "We recently compiled a list of the 15 Best Strong Buy Tech Stocks to Invest In . Lam Research Corporation tops our list for being one of the best Strong Buy stocks.\nTheFly reported on February 3 that Argus Research raised the price target for LRCX to $280 from $175 and maintained a Buy rating. The adjustment followed Q2 results that topped estimates and built on strong growth in 2025. The firm pointed out that LRCX is well-positioned for long-term development due to secular trends like generative AI, cloud data centers, vehicle electrification, IoT, robotics, and AI-enabled edge devices.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "TSEM",
      "Date": "2026-02-12",
      "Time": "00:18:00",
      "Source": "Zacks Small Cap Research",
      "Title": "TSEM: Tower Revises Its Model to Higher Investment and High Margins",
      "URL": "https://finance.yahoo.com/news/tsem-tower-revises-model-higher-161800468.html",
      "Content": "By Lisa Thompson\nNASDAQ:TSEM\nREAD THE FULL TSEM RESEARCH REPORT\nAs demand exceeds capacity, Tower Semiconductor (NASDAQ:TSEM) has decided to accelerate its investment as it sees margins continue to expand from the sale of new products. It is adding another $270 in capex to the next two years of spending to expand capacity for RF infrastructure products as demand outstrips supply. While the company is limited as to how high it can raise prices, it is deemphasizing lower margin products as it ramps new high margin ones. High margin SiPh contributed $228 million in 2025, up from $106 million in revenues in 2024, and with this additional investment, the company plans to grow capacity to greater than 5x of the actual Q4 monthly silicon photonics wafer shipments, compared to the 3x target given during the Q3 call. Over 70% of the total SiPho capacity is either presently reserved or in the process of being reserved through 2028, backed with customer prepayment.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "SWKS",
      "Date": "2026-02-11",
      "Time": "17:07:00",
      "Source": "Zacks",
      "Title": "Zacks Industry Outlook Highlights Skyworks and RF Industries",
      "URL": "https://finance.yahoo.com/news/zacks-industry-outlook-highlights-skyworks-090700667.html",
      "Content": "For Immediate Release Chicago, IL &ndash; February 11, 2026 &ndash; Today, Zacks Equity Research discusses Skyworks SWKS and RF Industries RFIL.\nIndustry: Electronics - Radio Frequency\nLink: https://www.zacks.com/commentary/2847030/2-radio-frequency-stocks-to-watch-from-a-prospering-industry\nThe Zacks Semiconductors - Radio Frequency industry participants like Skyworks and RF Industries are benefiting from the continued adoption of WiFi 7, as well as the rapid proliferation of the edge IoT, AI data centers and automotive electrification. The growing need for faster connections, low latency, and efficient battery life in wirelessly connected devices has been driving the demand for WiFi-enabled hotspots.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ARM",
      "Date": "2026-02-10",
      "Time": "23:35:00",
      "Source": "Motley Fool",
      "Title": "Arm Stock Rises on Accelerating AI Revenue, But a Big Risk Remains",
      "URL": "https://finance.yahoo.com/m/49655d69-2744-33aa-9539-04ffa52443d4/arm-stock-rises-on.html",
      "Content": "Arm Holdings (NASDAQ: ARM) shares rose after the company -- which sells critical design architecture for making semiconductors -- saw artificial intelligence (AI) demand boost its revenue. The stock, however, has still lost about a third of its value over the past year and it faces a big potential risk next fiscal year. Let's see what that is -- and what investors should do.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "NXPI",
      "Date": "2026-02-09",
      "Time": "16:08:49",
      "Source": "Barchart",
      "Title": "What Are Wall Street Analysts' Target Price for NXP Semiconductors Stock?",
      "URL": "https://finance.yahoo.com/m/320ec59d-94c1-31d2-a184-ff4391129b33/what-are-wall-street.html",
      "Content": "Headquartered in Eindhoven, the Netherlands, NXP Semiconductors N.V. (NXPI) designs and delivers advanced chips across processors, connectivity, analog, security, and sensor technologies. With a market cap of roughly $56.5 billion, the company forms the invisible backbone of vehicles, factories, Internet of Things (IoT) ecosystems, mobile devices, and modern communications infrastructure.",
      "Language": "en",
      "IsSummarized": false
    }
  ]
}