{
  "last_updated": "2026-02-14T07:15:05.409Z",
  "total_news_count": 13,
  "news": [
    {
      "Ticker": "TSM",
      "Date": "2026-02-14",
      "Time": "13:20:00",
      "Source": "Motley Fool",
      "Title": "3 Stocks That Will Be Worth $3 Trillion or More in 3 Years",
      "URL": "https://finance.yahoo.com/m/f0f05ce2-ad5e-3bff-873f-fd4b5883db84/3-stocks-that-will-be-worth.html",
      "Content": "There have only been four companies to reach a $3 trillion market cap or greater. But as the stock market rises, the $3 trillion level will eventually be breached by many more companies. In fact, I think three of them will each reach that level over the next three years.\n\nThe three that I've got my eye on are Amazon (NASDAQ: AMZN) , Taiwan Semiconductor (NYSE: TSM) , and Broadcom (NASDAQ: AVGO) . All of these companies are within striking distance, and each looks like a worthy investment option now.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\n\nSome of these companies have further to go than others. Amazon is already a $2.4 trillion company, so projecting that it will rise to a market cap of $3 trillion in three years isn't really that bold a call. It only needs to manage a growth rate of 8% over the next three years to get there. If that's all, the faster it grows, the more likely it will be a disappointment for most investors. I think Amazon has a much better growth case than that, but we'll get to that in a bit.\n\nTaiwan Semiconductor and Broadcom have much further to go. Taiwan Semiconductor is a $1.72 trillion company, while Broadcom tops the sales at $1.47 trillion. It will take a compounded annual growth rate (CAGR) of 20% and 27%, respectively, for each to rise to a $3 trillion cap three years from now.\n\nThat's no easy task, but if each can deliver that rate of return, they will make for no-brainer buys right now. But are these growth rates feasible?\n\nAmazon is probably the easiest company to make a case for. Although it only needs to deliver an 8% growth rate to reach this level, it has managed to grow its revenue above double digits for the past four years.\n\nAMZN Revenue (Quarterly YoY Growth) data by YCharts.\n\nI have no doubt that it will continue that trend over the next few years, and it could grow at an even faster rate thanks to the acceleration of artificial intelligence (AI) spending. Amazon Web Services (AWS), its cloud computing service that powers traditional and AI workloads, posted revenue growth of 24% in the fourth quarter (Q4) -- the best in 13 quarters. This is a clear sign that Amazon's business is thriving, and with AWS having a much better operating margin than the rest of the business, its outsized growth will have an even greater effect on profits. Amazon is a lock to reach a $3 trillion market cap in three years and should beat the market along the way.\n\nTaiwan Semiconductor is a key part of the AI build-out, as its chip foundries manufacture a large chunk of the logic chips utilized in AI devices. Management expects huge growth from AI over the next few years, with AI chip revenue rising at nearly a 60% CAGR. However, that's not a companywide growth rate, as other companies utilize its foundry services outside of AI. From 2024 to 2029, management expects a CAGR of nearly 25% companywide, easily surpassing the 20% return threshold needed to rise to a $3 trillion company three years from now.\n\nLast is Broadcom. It has the longest way to go but will likely grow at the fastest rate. Although it does several other things, its biggest growth driver is its custom AI chips, which it designs in a partnership with AI hyperscalers. By designing a chip around a specific workload, Broadcom can achieve better results at a lower price point but at the cost of flexibility. These are massively growing in popularity, and Broadcom expects to double its AI segment revenue year over year during Q1 2026. As more hyperscalers launch their custom chip design with Broadcom, their growth rate will continue to be strong. This will drive Broadcom to become a $3 trillion company quickly, and investors shouldn't miss out on this stock .",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "TSM",
      "Date": "2026-02-14",
      "Time": "01:04:31",
      "Source": "GuruFocus.com",
      "Title": "Frank Sands Reduces Stake in Taiwan Semiconductor Manufacturing Co Ltd by 26.22%",
      "URL": "https://finance.yahoo.com/news/frank-sands-reduces-stake-taiwan-170431333.html",
      "Content": "This article first appeared on GuruFocus .\n\nWarning! GuruFocus has detected 5 Warning Signs with NVDA.\n\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\n\nFrank Sands ( Trades , Portfolio ) recently submitted the 13F filing for the fourth quarter of 2025, providing insights into his investment moves during this period. Frank M. Sands, Jr., CFA is the Chief Executive Officer and Chief Investment Officer of Sands Capital Management, an investment management firm focused on investing in quality growth businesses throughout the world. He spends most of his time on investment research and decision making, as well as business strategy.Sands Capital Management was founded by his father, Frank M. Sands, Sr. in 1992. Frank Sands ( Trades , Portfolio ), Jr. joined the firm in 2000 after working for six years as a research analyst and portfolio manager for Fayez Sarofim & Co., an institutional investment management firm based in Houston, Texas. Since joining Sands Capital Management, working alongside his father, the firm has continued to produce strong investment results for its clients. Sands Jr. earned a BA from Washington & Lee University, an MS from Johns Hopkins University and an MBA from the Darden School at the University of Virginia. Sands Capital believes that over time, stock prices reflect the earnings growth of their underlying businesses. Their team is dedicated to identifying the relatively small number of truly exceptional growth businesses that they expect to own for many years. The firm has two primary concentrated growth strategies: Select Growth, emphasizing rapidly growing innovative businesses, and Global Growth, emphasizing rapidly growing business all over the world.\n\nFrank Sands ( Trades , Portfolio ) added a total of 6 stocks, among them:\n\nThe most significant addition was Quanta Services Inc ( NYSE:PWR ), with 576,896 shares, accounting for 0.74% of the portfolio and a total value of $243.48 million.\n\nThe second largest addition to the portfolio was Carpenter Technology Corp ( NYSE:CRS ), consisting of 621,684 shares, representing approximately 0.6% of the portfolio, with a total value of $195.73 million.\n\nThe third largest addition was Boston Scientific Corp ( NYSE:BSX ), with 805,164 shares, accounting for 0.23% of the portfolio and a total value of $76.77 million.\n\nFrank Sands ( Trades , Portfolio ) also increased stakes in a total of 20 stocks, among them:\n\nThe most notable increase was Shopify Inc ( NASDAQ:SHOP ), with an additional 2,568,765 shares, bringing the total to 9,506,036 shares. This adjustment represents a significant 37.03% increase in share count, a 1.26% impact on the current portfolio, with a total value of $1,530,186,620.\n\nThe second largest increase was Carvana Co ( NYSE:CVNA ), with an additional 751,019 shares, bringing the total to 2,442,534. This adjustment represents a significant 44.4% increase in share count, with a total value of $1,030,798,200.\n\nFrank Sands ( Trades , Portfolio ) completely exited 4 of the holdings in the fourth quarter of 2025, as detailed below:\n\nDexCom Inc ( NASDAQ:DXCM ): Frank Sands ( Trades , Portfolio ) sold all 4,934,189 shares, resulting in a -0.92% impact on the portfolio.\n\nOracle Corp ( NYSE:ORCL ): Frank Sands ( Trades , Portfolio ) liquidated all 936,043 shares, causing a -0.73% impact on the portfolio.\n\nFrank Sands ( Trades , Portfolio ) also reduced positions in 38 stocks. The most significant changes include:\n\nReduced Taiwan Semiconductor Manufacturing Co Ltd ( NYSE:TSM ) by 2,425,714 shares, resulting in a -26.22% decrease in shares and a -1.87% impact on the portfolio. The stock traded at an average price of $293.5 during the quarter and has returned 30.78% over the past 3 months and 21.13% year-to-date.\n\nReduced ServiceNow Inc ( NYSE:NOW ) by 2,388,471 shares, resulting in a -38.33% reduction in shares and a -1.21% impact on the portfolio. The stock traded at an average price of $171.37 during the quarter and has returned -36.96% over the past 3 months and -30.07% year-to-date.\n\nAt the fourth quarter of 2025, Frank Sands ( Trades , Portfolio )'s portfolio included 66 stocks, with top holdings including 11.37% in NVIDIA Corp ( NASDAQ:NVDA ), 6.31% in Taiwan Semiconductor Manufacturing Co Ltd ( NYSE:TSM ), 5.22% in Amazon.com Inc ( NASDAQ:AMZN ), 4.7% in Alphabet Inc ( NASDAQ:GOOGL ), and 4.65% in Shopify Inc ( NASDAQ:SHOP ).\n\nThe holdings are mainly concentrated in 7 of all the 11 industries: Technology, Consumer Cyclical, Communication Services, Financial Services, Industrials, Healthcare, and Basic Materials.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "TSM",
      "Date": "2026-02-13",
      "Time": "23:09:34",
      "Source": "Insider Monkey",
      "Title": "TSMC Reports Strong January Revenue Growth",
      "URL": "https://finance.yahoo.com/news/tsmc-reports-strong-january-revenue-150934439.html",
      "Content": "Taiwan Semiconductor Manufacturing Company Limited (NYSE: TSM ) is among the most profitable mega cap stocks to buy . On February 9, Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) reported consolidated net revenue of NT$401.26 billion for January 2026, up 19.8% from December 2025 and 36.8% from January 2025. Additionally, the board of directors approved a cash dividend of NT$6.0 per share for Q4 2025.\n\nEarlier on February 5, Reuters reported that Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) is planning mass production of advanced 3-nanometre chips in Kumamoto, southern Japan. This announcement places Japan at the forefront of the production of top-notch 3-nanometre chips, which are utilized in both HPC and AI servers. These chips are set to be manufactured at the company’s second fab in Arizona next year. This acceleration in AI will help the company outperform its peers.\n\nAs stated by CEO C.C. Wei in Tokyo at a meeting with Japan’s Prime Minister Sanae Takaichi,\n\nTaiwan Semiconductor Manufacturing Company Limited (NYSE:TSM), founded in 1987, is a global foundry for integrated circuits and other semiconductor devices. The core offerings of this Taiwanese company include wafer fabrication processes, mask manufacturing, and engineering support services, among others.\n\nWhile we acknowledge the potential of TSM as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MPWR",
      "Date": "2026-02-13",
      "Time": "22:54:58",
      "Source": "Insider Monkey",
      "Title": "KeyBanc Raises Monolithic Power Systems (MPWR) Price Target on Record Quarterly Revenue",
      "URL": "https://finance.yahoo.com/news/keybanc-raises-monolithic-power-systems-145458481.html",
      "Content": "Monolithic Power Systems, Inc. (NASDAQ: MPWR ) ranks among the best high growth high margin stocks to buy now . On February 6, KeyBanc boosted its price target for Monolithic Power Systems, Inc. (NASDAQ:MPWR) to $1,500 from $1,300, retaining an Overweight rating on the company’s shares. The boost comes after the company’s fourth-quarter results and first-quarter forecasts, which KeyBanc defined as “strong”. Notably, Monolithic Power Systems, Inc. (NASDAQ:MPWR) raked in a record quarterly revenue of $751.2 million, exceeding expectations of $740.23 million.\n\nKeyBanc stated that the company’s fourth-quarter momentum was prominent in the Data Center division, which produced substantial year-over-year growth spanning Enterprise Data, Computing & Storage, and Communications.\n\nGiven the strong market demand and share gains, the firm noted that Monolithic Power Systems, Inc. (NASDAQ:MPWR) has raised its 2026 Enterprise Data growth expectation from an earlier projection of 35% to more than 50%, though it considers this goal to be conservative.\n\nMonolithic Power Systems, Inc. (NASDAQ:MPWR) produces and markets small, ultra-efficient, user-friendly power management systems for various industries, including computers, automotive, data centers, and communications.\n\nWhile we acknowledge the potential of MPWR as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MPWR",
      "Date": "2026-02-13",
      "Time": "01:00:04",
      "Source": "Zacks",
      "Title": "What Makes Monolithic Power (MPWR) a Strong Momentum Stock: Buy Now?",
      "URL": "https://finance.yahoo.com/news/makes-monolithic-power-mpwr-strong-170004817.html",
      "Content": "Momentum investing revolves around the idea of following a stock's recent trend in either direction. In \"long context,\" investors will be essentially be \"buying high, but hoping to sell even higher.\" With this methodology, taking advantage of trends in a stock's price is key; once a stock establishes a course, it is more than likely to continue moving that way. The goal is that once a stock heads down a fixed path, it will lead to timely and profitable trades.\n\nWhile many investors like to look for momentum in stocks, this can be very tough to define. There is a lot of debate surrounding which metrics are the best to focus on and which are poor quality indicators of future performance. The Zacks Momentum Style Score, part of the Zacks Style Scores, helps address this issue for us.\n\nBelow, we take a look at Monolithic Power (MPWR) , which currently has a Momentum Style Score of A. We also discuss some of the main drivers of the Momentum Style Score, like price change and earnings estimate revisions.\n\nIt's also important to note that Style Scores work as a complement to the Zacks Rank, our stock rating system that has an impressive track record of outperformance. Monolithic Power currently has a Zacks Rank of #2 (Buy). Our research shows that stocks rated Zacks Rank #1 (Strong Buy) and #2 (Buy) and Style Scores of \"A or B\" outperform the market over the following one-month period.\n\nYou can see the current list of Zacks #1 Rank Stocks here >>>\n\nLet's discuss some of the components of the Momentum Style Score for MPWR that show why this chipmaker shows promise as a solid momentum pick.\n\nA good momentum benchmark for a stock is to look at its short-term price activity, as this can reflect both current interest and if buyers or sellers currently have the upper hand. It's also helpful to compare a security to its industry; this can show investors the best companies in a particular area.\n\nFor MPWR, shares are up 9.4% over the past week while the Zacks Semiconductor - Analog and Mixed industry is up 7.78% over the same time period. Shares are looking quite well from a longer time frame too, as the monthly price change of 21.67% compares favorably with the industry's 11.65% performance as well.\n\nWhile any stock can see its price increase, it takes a real winner to consistently beat the market. That is why looking at longer term price metrics -- such as performance over the past three months or year -- can be useful as well. Shares of Monolithic Power have increased 35.28% over the past quarter, and have gained 71.09% in the last year. On the other hand, the S&P 500 has only moved 1.65% and 15.6%, respectively.\n\nInvestors should also take note of MPWR's average 20-day trading volume. Volume is a useful item in many ways, and the 20-day average establishes a good price-to-volume baseline; a rising stock with above average volume is generally a bullish sign, whereas a declining stock on above average volume is typically bearish. Right now MPWR is averaging 710,006 shares for the last 20 days..\n\nThe Zacks Momentum Style Score also takes into account trends in estimate revisions, in addition to price changes. Please note that estimate revision trends remain at the core of Zacks Rank as well. A nice path here can help show promise, and we have recently been seeing that with MPWR.\n\nOver the past two months, 7 earnings estimates moved higher compared to none lower for the full year. These revisions helped boost MPWR's consensus estimate, increasing from $20.91 to $21.63 in the past 60 days. Looking at the next fiscal year, 3 estimates have moved upwards while there have been no downward revisions in the same time period.\n\nTaking into account all of these elements, it should come as no surprise that MPWR is a #2 (Buy) stock with a Momentum Score of A. If you've been searching for a fresh pick that's set to rise in the near-term, make sure to keep Monolithic Power on your short list.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MPWR",
      "Date": "2026-02-12",
      "Time": "21:30:02",
      "Source": "Zacks",
      "Title": "Here's How Much a $1000 Investment in Monolithic Power Made 10 Years Ago Would Be Worth Today",
      "URL": "https://finance.yahoo.com/news/heres-much-1000-investment-monolithic-133002935.html",
      "Content": "For most investors, how much a stock's price changes over time is important. This factor can impact your investment portfolio as well as help you compare investment results across sectors and industries.\n\nThe fear of missing out, or FOMO, also plays a factor in investing, especially with particular tech giants, as well as popular consumer-facing stocks.\n\nWhat if you'd invested in Monolithic Power (MPWR) ten years ago? It may not have been easy to hold on to MPWR for all that time, but if you did, how much would your investment be worth today?\n\nWith that in mind, let's take a look at Monolithic Power's main business drivers.\n\nMonolithic Power Systems, based in Kirkland, WA, designs, develops and markets high-performance power solutions. The company focuses on the market for high-performance analog and mixed-signal integrated circuits (ICs).\n\nMonolithic&rsquo;s products are widely used in industrial applications, telecommunications infrastructure, cloud computing, and automotive and consumer applications.\n\nBeing a fabless company, Monolithic works with third-party contractors and chip assemblers for the manufacturing, assembling and testing of wafers and ICs. This approach permits the company to focus more on the designing and development of process technology at a lower fixed cost.\n\nUnlike other fabless semiconductor companies, Monolithic installs its own proprietary process technologies in third-party contractors&rsquo; equipment and facilities.\n\nMonolithic reported total revenues of $751.15 million in the fourth quarter of 2025.\n\nThe company&rsquo;s key product families are direct current to direct current (DC to DC) products and Lighting Control products.\n\nDC to DC ICs are used to convert and control voltages within a broad range of electronic systems, such as portable electronic devices, wireless LAN access points, computers and monitors, automobiles and medical equipment.\n\nLighting control ICs are used in backlighting and general illumination products.\n\nBy end market, 21.5% of total revenues came from Storage and Computing in the fourth quarter of 2025.\n\nEnterprise Data, Consumer, Industrial, Automotive and Communications end-markets contributed 31%, 8.8%, 7.2%, 20.1% and 11.14%, respectively, to the fourth quarter of 2025 revenues.\n\nMonolithic&rsquo;s primary competitors are Skyworks Solutions, Microchip Technology, Lattice Semiconductor, IPG Photonics, Power Integrations, Cree, Semtech, Micron Technology, Analog Devices, and GLOBALFOUNDRIES.\n\nPutting together a successful investment portfolio takes a combination of research, patience, and a little bit of risk. For Monolithic Power, if you bought shares a decade ago, you're likely feeling really good about your investment today.\n\nA $1000 investment made in February 2016 would be worth $21,271.42, or a 2,027.14% gain, as of February 12, 2026, according to our calculations. Investors should note that this return excludes dividends but includes price increases.\n\nThe S&P 500 rose 279.51% and the price of gold increased 292.77% over the same time frame in comparison.\n\nGoing forward, analysts are expecting more upside for MPWR.\n\nMonolithic reported strong fourth-quarter 2025 results, with both adjusted earnings and revenues surpassing the respective Zacks Consensus Estimate. It has a strong growth opportunity due to its robust product portfolio that targets In-Car connectivity and infotainment, advanced driver assistance system and rapid adoption of LED lightings in cars and vehicles. Being a fabless company, MPWR works with third-party contractors and chip assemblers for the manufacturing, assembling and testing of wafers and ICs. This approach permits the company to focus more on the design and development of process technology at a lower fixed cost. However, MPWR faces challenges due to the cyclical nature of the semiconductor industry. Rapid product obsolescence and price erosion, evolving standards and short product life-cycles are other challenges.\n\nThe stock is up 21.67% over the past four weeks, and no earnings estimate has gone lower in the past two months, compared to 7 higher, for fiscal 2026. The consensus estimate has moved up as well.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "GFS",
      "Date": "2026-02-12",
      "Time": "19:49:06",
      "Source": "Insider Monkey",
      "Title": "Globalfoundries (GFS) Hits New High on Swing to Profits",
      "URL": "https://finance.yahoo.com/news/globalfoundries-gfs-hits-high-swing-114906247.html",
      "Content": "We recently published 10 Stocks Turning Heads With Double-Digit Returns . Globalfoundries Inc. (NASDAQ:GFS) was one of the best performers on Wednesday.\n\nGlobalfoundries jumped to an over one-year high on Wednesday, as investors gobbled up shares after the company swung to profitability last year, marking a 439 percent improvement year-on-year.\n\nIn an earnings call, Globalfoundries Inc. (NASDAQ:GFS) said that it swung to a net income of $888 million in 2025 from a $262 million net loss in 2024. This came despite a mere 1 percent uptick in net revenues at $6.79 billion from $6.75 billion year-on-year.\n\nIn the fourth quarter alone, net income stood at $200 million, reversing a $729 million net loss in the same quarter a year earlier. Revenues, however, were flat at $1.83 billion.\n\nFollowing the results, Globalfoundries Inc. (NASDAQ:GFS) saw its intra-day share price on Wednesday jump to as much as $48.88 before trimming a few cents to finish the session just up by 16.32 percent at $48.74 apiece.\n\nIn other news, Globalfoundries Inc. (NASDAQ:GFS) announced plans to buy back $500 million worth of its common shares in a bid to boost shareholder value.\n\nThe buyback may be implemented from time to time, through open market purchases and privately negotiated transactions, among others.\n\nThe initiative will run for a period of 12 months and may be modified, suspended, or terminated at anytime.\n\nWhile we acknowledge the potential of GFS as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on the best short-term AI stock .",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MPWR",
      "Date": "2026-02-11",
      "Time": "23:00:00",
      "Source": "Zacks",
      "Title": "Best Momentum Stock to Buy for February 11th",
      "URL": "https://finance.yahoo.com/news/best-momentum-stock-buy-february-150000309.html",
      "Content": "Here are three stocks with buy rank and strong momentum characteristics for investors to consider today, February 11th:\n\nENGIE - Sponsored ADR ENGIY: This company, which engages in the power, natural gas, and energy services businesses. It operates through Renewables, Networks, Energy Solutions, FlexGen, Retail, Nuclear and Others segments, has a Zacks Rank #1(Strong Buy), and witnessed the Zacks Consensus Estimate for its current year earnings increasing 5.1% over the last 60 days.\n\nENGIE - Sponsored ADR price-consensus-chart | ENGIE - Sponsored ADR Quote\n\nENGIE - Sponsored ADR's shares gained 25.5% over the last three month compared with the S&P 500’s gain of 1.3%. The company possesses a Momentum Score of A.\n\nENGIE - Sponsored ADR price | ENGIE - Sponsored ADR Quote\n\nMonolithic Power Systems MPWR: This company, which designs, develops and markets high-performance power solutions, has a Zacks Rank #1, and witnessed the Zacks Consensus Estimate for its current year earnings increasing 3.2% over the last 60 days.\n\nMonolithic Power Systems, Inc. price-consensus-chart | Monolithic Power Systems, Inc. Quote\n\nMonolithic Power Systems’ shares gained 19.9% over the last three month compared with the S&P 500’s gain of 1.3%. The company possesses a Momentum Score of A.\n\nMonolithic Power Systems, Inc. price | Monolithic Power Systems, Inc. Quote\n\nSeanergy Maritime Holdings SHIP: This company, which is a prominent pure-play Capesize ship-owner which provides marine dry bulk transportation services through a modern fleet of Capesize vessels, has a Zacks Rank #1, and witnessed the Zacks Consensus Estimate for its current year earnings increasing 8.6% over the last 60 days.\n\nSeanergy Maritime Holdings Corp price-consensus-chart | Seanergy Maritime Holdings Corp Quote\n\nSeanergy Maritime Holdings’ shares gained 27.4% over the last three month compared with the S&P 500’s gain of 1.3%. The company possesses a Momentum Score of A.\n\nSeanergy Maritime Holdings Corp price | Seanergy Maritime Holdings Corp Quote\n\nSee the full list of top ranked stocks here\n\nLearn more about the Momentum score and how it is calculated here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "TXN",
      "Date": "2026-02-11",
      "Time": "21:18:57",
      "Source": "Insider Monkey",
      "Title": "Should You Be Optimistic on Texas Instruments’ (TXN) Growth Potential?",
      "URL": "https://finance.yahoo.com/news/optimistic-texas-instruments-txn-growth-131857066.html",
      "Content": "Matrix Asset Advisors , an asset management company, released its Q4 2025 investor letter. A copy of the letter can be downloaded here . The stock market hit a new all-time high in the fourth quarter of 2025, rising +2.66%. Three-quarter-point interest rate cuts from the Federal Reserve, strong corporate results, and ongoing AI momentum drove investor optimism. The S&P 500 Index recorded its third consecutive year of double-digit gains, returning +17.88% in 2025. Matrix’s equity portfolios returned double-digit gains in 2025 and positive results in the fourth quarter. Matrix’s Large Cap Value portfolio (LCV) returned 20% in 2025, outperforming the S&P 500 Index. Matrix’s fixed income returns, except long-term bonds, were slightly positive in the fourth quarter, and for the year, the returns were up in the mid to high single-digit range, depending on maturity. Entering 2026, the firm maintains a cautious, optimistic view on the economy and the market. Please review the Firm’s top five holdings to gain insights into their key selections for 2025.\n\nIn its fourth-quarter 2025 investor letter, Matrix Asset Advisors highlighted Texas Instruments Incorporated (NASDAQ: TXN ). Headquartered in Dallas, Texas, Texas Instruments Incorporated (NASDAQ:TXN) is a global semiconductor company. On February 10, 2026, Texas Instruments Incorporated (NASDAQ:TXN) stock closed at $220.92 per share. One-month return of Texas Instruments Incorporated (NASDAQ:TXN) was 14.20%, and its shares are up 22.74% over the past twelve months. Texas Instruments Incorporated (NASDAQ:TXN) has a market capitalization of $200.733 billion.\n\nMatrix Asset Advisors stated the following regarding Texas Instruments Incorporated (NASDAQ:TXN) in its fourth quarter 2025 investor letter:\n\nTexas Instruments Incorporated (NASDAQ:TXN) is not on our list of 30 Most Popular Stocks Among Hedge Funds . According to our database, 72 hedge fund portfolios held Texas Instruments Incorporated (NASDAQ:TXN) at the end of the third quarter, up from 68 in the previous quarter. Texas Instruments Incorporated (NASDAQ:TXN) announced Q4 2025 revenue of $4.4 billion, reflecting a 10% year-over-year growth. While we acknowledge the potential of Texas Instruments Incorporated (NASDAQ:TXN) as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\n\nIn another article , we covered Texas Instruments Incorporated (NASDAQ:TXN) and shared a list of stocks Jim Cramer discussed. In addition, please check out our hedge fund investor letters Q4 2025 page for more investor letters from hedge funds and other leading investors.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ON",
      "Date": "2026-02-11",
      "Time": "01:19:00",
      "Source": "Zacks",
      "Title": "onsemi's Q4 Earnings Beat Estimates, Revenues Down Y/Y, Shares Drop",
      "URL": "https://finance.yahoo.com/news/onsemis-q4-earnings-beat-estimates-171900670.html",
      "Content": "onsemi ON reported fourth-quarter 2025 non-GAAP earnings of 64 cents per share, which beat the Zacks Consensus Estimate by 3.23% but plunged 32.6% year over year.\n\nRevenues of $1.53 billion missed the Zacks Consensus Estimate by 0.19% and decreased 11.2% on a year-over-year basis.\n\nON shares were down 4.92% at the time of writing this article.\n\nPower Solutions Group's revenues of $724.2 million (contributed 47.3% to revenues) decreased 10.5% year over year. Analog & Mixed Group revenues of $556.3 million (36.4% of revenues) decreased 8.9% on a year-over-year basis. Intelligent Sensing Group revenues of $249.6 million (16.3% of revenues) decreased 17.5% year over year.\n\nON Semiconductor Corporation price-consensus-eps-surprise-chart | ON Semiconductor Corporation Quote\n\nNon-GAAP gross margin was 38.2% compared with 45.3% reported in the year-ago quarter.\n\nNon-GAAP operating expenses decreased 12.2% year over year to $282 million. As a percentage of revenues, operating expenses decreased 20 bps year over year.\n\nNon-GAAP operating margin was 19.8% compared with 26.7% reported in the year-ago quarter.\n\nAs of Dec. 31, 2025, ON had cash and cash equivalents of $2.55 billion compared with $2.87 billion as of Oct. 3, 2025. Long-term debt, as of Dec. 31, 2025, was $2.98 billion, down 11.1% sequentially.\n\nFourth-quarter 2025 cash flow from operations amounted to $554.5 million compared with the previous quarter’s reported figure of $418.7 million.\n\nFree cash flow amounted to $485.4 million compared with free cash flow of $372.4 million in the previous quarter.\n\nFor the first quarter of 2026, onsemi expects revenues between $1.44 billion and $1.54 billion.\n\nNon-GAAP gross margin is projected to be in the range of 37.5-39.5%.\n\nNon-GAAP operating expenses are expected to be in the range of $285-$300 million.\n\nNon-GAAP earnings are expected to be between 56 cents and 66 cents per share.\n\nON currently carries a Zacks Rank #3 (Hold).\n\nAnalog Devices ADI, Applied Materials AMAT, and MKS MKSI are some better-ranked stocks that investors can consider in the broader Zacks Computer and Technology sector.\n\nMKS shares have gained 125.9% in the past 12-month period. MKSI is set to report its fourth-quarter 2025 results on Feb. 17, 2026. The company currently sports a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nAnalog Devices' shares have gained 58.5% in the past 12-month period. ADI currently carries a Zacks Rank #2 (Buy). The company is scheduled to release first-quarter 2026 results on Feb. 18, 2026.\n\nApplied Materials shares have gained 80.4% in the past 12-month period. AMAT is scheduled to release its first-quarter 2026 results on Feb. 12, 2026. Applied Materials currently carries a Zacks Rank of 2.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "TXN",
      "Date": "2026-02-10",
      "Time": "22:15:02",
      "Source": "Zacks",
      "Title": "Texas Instruments (TXN) Reliance on International Sales: What Investors Need to Know",
      "URL": "https://finance.yahoo.com/news/texas-instruments-txn-reliance-international-141502723.html",
      "Content": "Have you evaluated the performance of Texas Instruments' (TXN) international operations for the quarter ending December 2025? Given the extensive global presence of this chipmaker, analyzing the patterns in international revenues is crucial for understanding its financial strength and potential for growth.\n\nIn the current global economy, which is more interconnected than ever, a company's success in penetrating international markets is crucial for its financial health and growth journey. Investors must understand a company's dependence on overseas markets, as this offers a window into the company's earnings stability, its ability to benefit from varied economic cycles and its potential for long-term growth.\n\nInternational market involvement serves as insurance against economic downturns at home and enables engagement with economies that are growing more quickly. Still, this move toward diversification is not without its challenges, as it involves navigating through the fluctuations of currencies, geopolitical threats, and the distinctive nature of various markets.\n\nWhile analyzing TXN's performance for the last quarter, we found some intriguing trends in revenues from its overseas segments that Wall Street analysts commonly model and monitor.\n\nThe company's total revenue for the quarter amounted to $4.42 billion, showing rise of 10.4%. We will now explore the breakdown of TXN's overseas revenue to assess the impact of its international operations.\n\nDuring the quarter, Japan contributed $290 million in revenue, making up 6.6% of the total revenue. When compared to the consensus estimate of $297.43 million, this meant a surprise of -2.5%. Looking back, Japan contributed $313 million, or 6.6%, in the previous quarter, and $277 million, or 6.9%, in the same quarter of the previous year.\n\nRest of World generated $98 million in revenues for the company in the last quarter, constituting 2.2% of the total. This represented a surprise of +26.34% compared to the $77.57 million projected by Wall Street analysts. Comparatively, in the previous quarter, Rest of World accounted for $74 million (1.6%), and in the year-ago quarter, it contributed $69 million (1.7%) to the total revenue.\n\nOf the total revenue, $948 million came from Europe, Middle East and Africa during the last fiscal quarter, accounting for 21.4%. This represented a surprise of +3.13% as analysts had expected the region to contribute $919.21 million to the total revenue. In comparison, the region contributed $972 million, or 20.5%, and $786 million, or 19.6%, to total revenue in the previous and year-ago quarters, respectively.\n\nRest of Asia accounted for 10.3% of the company's total revenue during the quarter, translating to $457 million. Revenues from this region represented a surprise of -4.19%, with Wall Street analysts collectively expecting $476.96 million. When compared to the preceding quarter and the same quarter in the previous year, Rest of Asia contributed $505 million (10.7%) and $432 million (10.8%) to the total revenue, respectively.\n\nChina generated $951 million in revenues for the company in the last quarter, constituting 21.5% of the total. This represented a surprise of +1.9% compared to the $933.3 million projected by Wall Street analysts. Comparatively, in the previous quarter, China accounted for $1.02 billion (21.5%), and in the year-ago quarter, it contributed $821 million (20.5%) to the total revenue.\n\nWall Street analysts expect Texas Instruments to report $4.51 billion in total revenue for the current fiscal quarter, indicating an increase of 11% from the year-ago quarter. Japan, Rest of World, Europe, Middle East and Africa, Rest of Asia and China are expected to contribute 6.5% (translating to $293.26 million), 1.7% ($77.37 million), 20.5% ($925.54 million), 10.5% ($473.62 million), and 20.7% ($933.44 million) to the total revenue, respectively.\n\nFor the full year, a total revenue of $19.36 billion is expected for the company, reflecting an increase of 9.5% from the year before. The revenues from Japan, Rest of World, Europe, Middle East and Africa, Rest of Asia and China are expected to make up 6.4%, 1.7%, 20%, 10.3%, and 20.5% of this total, corresponding to $1.24 billion, $322.14 million, $3.86 billion, $2 billion, and $3.97 billion, respectively.\n\nTexas Instruments' reliance on international markets for revenues offers both opportunities and risks. Hence, keeping an eye on its international revenue trends could significantly help forecast the company's prospects.\n\nIn an environment where global interconnections and geopolitical skirmishes are intensifying, Wall Street analysts keep a keen eye on these trends, particularly for firms with overseas operations, to adjust their earnings predictions. Moreover, a range of other aspects, including how a company fares in its home country, significantly affects these projections.\n\nHere at Zacks, we put a great deal of emphasis on a company's changing earnings outlook, as empirical research has shown that's a powerful force driving a stock's near-term price performance. Quite naturally, the correlation is positive here -- an upward revision in earnings estimates drives the stock price higher.\n\nBoasting a remarkable track record that's been externally verified, the Zacks Rank, our unique stock rating system, leverages changes in earnings projections to function as a reliable gauge for predicting short-term stock price movements.\n\nTexas Instruments, bearing a Zacks Rank #3 (Hold), is expected to mirror the broader market's movements in the near term. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>> .\n\nOver the past month, the stock has gained 15.7% versus the Zacks S&P 500 composite's no change. The Zacks Computer and Technology sector, of which Texas Instruments is a part, has declined 1.1% over the same period. The company's shares have increased 41.2% over the past three months compared to the S&P 500's 3.7% increase. Over the same period, the sector has risen 2.3%\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "TXN",
      "Date": "2026-02-10",
      "Time": "18:20:00",
      "Source": "Motley Fool",
      "Title": "2 Dividend Stocks That Are Off to Hot Starts to 2026",
      "URL": "https://finance.yahoo.com/m/3add3e16-b666-3ad6-a2b7-121aa95277b1/2-dividend-stocks-that-are.html",
      "Content": "The S&P 500 is off to a fairly underwhelming start. As of Monday's close, it was up less than 2% since January. Many growth stocks have been struggling, while dividend stocks are suddenly becoming hot buys.\n\nTwo dividend stocks that are off to hot starts since the beginning of the year are Lockheed Martin (NYSE: LMT) and Texas Instruments (NASDAQ: TXN) . They have soared past the broad index, and here's why it might not be too late to invest in them.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\n\nEntering trading on Tuesday, Lockheed Martin's stock was up 32% year to date. It's a fantastic performance after an unexciting year in 2025, when its share price was flat.\n\nThe company posted some strong earnings numbers at the end of January, reporting that its backlog was a record $194 billion. Its numbers came in better than its own expectations, and the business said it experienced \"unprecedented demand\" in the previous year. With strong government relationships and more growth expected for 2026, it's little wonder the defense stock has been a good buy early on.\n\nIts yield of 2.2% is also about twice what you'd get with the average S&P 500 stock right now. And at 21 times its expected future earnings (based on analyst projections), it's not an expensive stock to own, either. For long-term investors, Lockheed Martin can be a great stock to buy and hold.\n\nAnother stock that's been red hot to start 2026 is semiconductor company Texas Instruments. It's up just over 26% and it also recently released its earnings numbers. For the last three months of 2025, its revenue of $4.4 billion rose by 10% year over year, as demand from data centers has been strong and driving a lot of growth for the business.\n\nIts diversified semiconductor business features more than 80,000 parts that help companies in various industries, making it an attractive option for growth-oriented investors. Its forward price-to-earnings multiple of 33 is a bit high, but with some encouraging long-term growth prospects and its data center segment potentially being a catalyst for the foreseeable future, the stock can still be a suitable option for investors who are looking to buy and hold for years.\n\nTexas Instruments pays an above-average dividend that yields 2.6%, and it has been increasing its payout for 22 consecutive years. This is not only a promising growth investment, but also a terrific dividend stock to hang on to for the long haul.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "TXN",
      "Date": "2026-02-09",
      "Time": "18:39:00",
      "Source": "Motley Fool",
      "Title": "Prediction: This Chip Stock Could Be a Top Performer by 2027",
      "URL": "https://finance.yahoo.com/m/4506dcb6-826d-3c7c-a937-5e482df4a4c9/prediction%3A-this-chip-stock.html",
      "Content": "When investors look at investing in computer chips to take advantage of the artificial intelligence (AI) revolution, they are likely to start with a company like Nvidia (NASDAQ: NVDA) . That makes sense, given that it makes the most popular chips for handling AI workloads. However, there's another chip stock that could also turn out to be a huge AI winner: Texas Instruments (NASDAQ: TXN) .\n\nNvidia makes high-powered parallel processing chips that act as the primary brains that undergird AI software. Texas Instruments makes analog chips, the boring ones that convert physical events into digital signals. When you push a button on a digital device, it is likely being controlled by an analog chip. Texas Instruments' chips are simple, relatively low cost, and can be found in tech products virtually everywhere.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\n\nIn the artificial intelligence hardware world, Texas Instruments' chips provide power management. That's a vital function within the data centers that house AI. Given the expectation that the AI infrastructure buildout is only just beginning, Texas Instruments could have years of growth ahead of it in this end market.\n\nOver the last few years, the analog chip sector has been in a rut. However, Texas Instruments has been investing in new chip production capacity. Just recently, it agreed to buy competitor Silicon Labs (NASDAQ: SLAB) . In other words, Texas Instruments is preparing for growth.\n\nIt is also shifting the way it reports its sales. In the fourth quarter of 2025, the company broke out its data center business as a separate end market. The segment accounted for around 9% of the top line. However, it grew 64% year over year in the fourth quarter.\n\nThat's probably not a number to bake into your growth expectations, given that the AI opportunity is brand new. Still, revenue rose by a mid-single-digit percentage from the third quarter. If this is just the beginning of the AI buildout, this segment could help supercharge an upturn in the typically cyclical analog chip sector and support growth for years to come.\n\nThere are other analog chipmakers , and there are chipmakers that make more exciting chips than Texas Instruments. However, for most investors, opening a position in this industry-leading company will probably set you up for long-term success. And given the strength of the business and the company's growth efforts, the AI buildout could easily turn Texas Instruments into a top-performing chipmaker by 2027, if not sooner.",
      "Language": "en",
      "IsSummarized": false
    }
  ]
}