{
  "last_updated": "2026-02-14T06:40:11.157Z",
  "total_news_count": 17,
  "news": [
    {
      "Ticker": "META",
      "Date": "2026-02-14",
      "Time": "09:25:00",
      "Source": "Motley Fool",
      "Title": "Alphabet vs. Meta Platforms: Which One Will Dominate the Next Decade?",
      "URL": "https://finance.yahoo.com/m/acf98749-8068-3538-a308-7bcfde314811/alphabet-vs.-meta-platforms%3A.html",
      "Content": "Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) and Meta Platforms (NASDAQ: META) have been clear leaders in the internet age. The former's Google Search and YouTube, for instance, and the latter's various social media apps are incredibly popular and drive robust financial performance.\nBetween these two \" Magnificent Seven \" stocks, which one will dominate the next decade?\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "GOOGL",
      "Date": "2026-02-14",
      "Time": "09:25:00",
      "Source": "Motley Fool",
      "Title": "Alphabet vs. Meta Platforms: Which One Will Dominate the Next Decade?",
      "URL": "https://finance.yahoo.com/m/acf98749-8068-3538-a308-7bcfde314811/alphabet-vs.-meta-platforms%3A.html",
      "Content": "Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) and Meta Platforms (NASDAQ: META) have been clear leaders in the internet age. The former's Google Search and YouTube, for instance, and the latter's various social media apps are incredibly popular and drive robust financial performance.\nBetween these two \" Magnificent Seven \" stocks, which one will dominate the next decade?\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MU",
      "Date": "2026-02-14",
      "Time": "09:02:00",
      "Source": "Zacks",
      "Title": "The Surge in Micron Technology Stock Looks Poised to Continue",
      "URL": "https://finance.yahoo.com/news/surge-micron-technology-stock-looks-010200212.html",
      "Content": "Being a leading provider of semiconductor memory solutions, Micron Technology MU is the most searched for stock on Zacks.com outside of Nvidia NVDA .\nThis comes as the storied memory chip shortage has made Micron a central beneficiary of the AI hardware boom.\nThe rapid expansion of AI hardware — data centers, GPUs, and accelerators — is consuming most of the memory chip supply and bandwidth, driving a sharp increase in demand for Micron’s offerings.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AMAT",
      "Date": "2026-02-14",
      "Time": "07:07:00",
      "Source": "TheStreet",
      "Title": "BofA revamps Applied Materials stock price target after CEO message",
      "URL": "https://finance.yahoo.com/m/2c08fc88-27e9-329a-b57c-2eae160b3b28/bofa-revamps-applied.html",
      "Content": "Applied Materials ( AMAT ) reported its Q1 earnings on February 12. The earnings beat consensus estimates for adjusted EPS and revenue, and the stock is trading 10% higher at the time of writing, Friday morning, Feb. 13, according to Yahoo Finance .\nThe supplier of semiconductor and semiconductor-related fabrication equipment reported revenue of $7 billion, a 2% year-over-year decline, yet the earnings report got investors excited and prompted Bank of America analyst Vivek Arya to raise his price target for Applied Materials.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MU",
      "Date": "2026-02-14",
      "Time": "06:00:00",
      "Source": "Zacks",
      "Title": "Top Stock Reports for Micron Technology, Goldman Sachs & Verizon",
      "URL": "https://finance.yahoo.com/news/top-stock-reports-micron-technology-220000475.html",
      "Content": "Friday, February 13, 2026\n\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Micron Technology, Inc. (MU), The Goldman Sachs Group, Inc. (GS) and Verizon Communications Inc. (VZ), as well as two micro-cap stocks Natural Grocers by Vitamin Cottage, Inc. (NGVC) and Team, Inc. (TISI). The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\n\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\n\nYou can see all of today&rsquo;s research reports here >>>\n\nAhead of Wall Street\n\nThe daily 'Ahead of Wall Street' article is a must-read for all investors who would like to be ready for that day's trading action. The article comes out before the market opens, attempting to make sense of that morning's economic releases and how they will affect that day's market action. You can read this article for free on our home page and can actually sign up there to get an email notification as this article comes out each morning.\n\nYou can read today's AWS here >>> Near-Perfect CPI Report Brings Pre-Markets Near Breakeven",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MU",
      "Date": "2026-02-14",
      "Time": "04:02:28",
      "Source": "Barchart",
      "Title": "Competition Is Heating Up for Micron. Should You Buy, Sell, or Hold MU Stock Now?",
      "URL": "https://finance.yahoo.com/m/0a217c71-2823-3481-b3b8-a8566d088e5b/competition-is-heating-up-for.html",
      "Content": "Artificial intelligence (AI) is reshaping the tech landscape at breakneck speed, and investors are scrambling to lock in the biggest winners. Yet even in a crowded AI trade, few names have delivered like Micron Technology (MU). The memory-chip giant has ridden the AI wave to record highs, with MU stock delivering massive returns over the past year. Surging demand for memory chips from AI hyperscalers racing to build out massive data center capacity has been the primary engine behind Micron’s remarkable ascent.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AMD",
      "Date": "2026-02-14",
      "Time": "01:44:45",
      "Source": "GuruFocus.com",
      "Title": "AMD Rated Neutral on AI Competition Concerns",
      "URL": "https://finance.yahoo.com/news/amd-rated-neutral-ai-competition-174445344.html",
      "Content": "This article first appeared on GuruFocus .\nAdvanced Micro Devices ( AMD , Financials ) was initiated with a Neutral rating by DA Davidson , with a $220 price target implying limited upside from current levels.\nWarning! GuruFocus has detected 5 Warning Signs with AMD.\nIs AMD fairly valued? Test your thesis with our free DCF calculator.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ADI",
      "Date": "2026-02-13",
      "Time": "07:00:01",
      "Source": "Zacks",
      "Title": "Here's Why Analog Devices (ADI) Fell More Than Broader Market",
      "URL": "https://finance.yahoo.com/news/heres-why-analog-devices-adi-230001477.html",
      "Content": "Analog Devices (ADI) closed the most recent trading day at $331.36, moving -1.67% from the previous trading session. This move lagged the S&P 500's daily loss of 1.57%. Meanwhile, the Dow lost 1.34%, and the Nasdaq, a tech-heavy index, lost 2.04%.\nPrior to today's trading, shares of the semiconductor maker had gained 13.09% outpaced the Computer and Technology sector's loss of 1.83% and the S&P 500's loss of 0.29%.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MRVL",
      "Date": "2026-02-12",
      "Time": "22:00:05",
      "Source": "Zacks",
      "Title": "Marvell Technology, Inc. (MRVL) Is a Trending Stock: Facts to Know Before Betting on It",
      "URL": "https://finance.yahoo.com/news/marvell-technology-inc-mrvl-trending-140005205.html",
      "Content": "Marvell Technology (MRVL) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock.\nShares of this chipmaker have returned +0.2% over the past month versus the Zacks S&P 500 composite's -0.3% change. The Zacks Electronics - Semiconductors industry, to which Marvell belongs, has gained 2.1% over this period. Now the key question is: Where could the stock be headed in the near term?",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "LRCX",
      "Date": "2026-02-12",
      "Time": "21:48:08",
      "Source": "Insider Monkey",
      "Title": "Analysts Cite Secular Trends For Lam Research Corporation (LRCX)’s Development",
      "URL": "https://finance.yahoo.com/news/analysts-cite-secular-trends-lam-134808663.html",
      "Content": "We recently compiled a list of the 15 Best Strong Buy Tech Stocks to Invest In . Lam Research Corporation tops our list for being one of the best Strong Buy stocks.\nTheFly reported on February 3 that Argus Research raised the price target for LRCX to $280 from $175 and maintained a Buy rating. The adjustment followed Q2 results that topped estimates and built on strong growth in 2025. The firm pointed out that LRCX is well-positioned for long-term development due to secular trends like generative AI, cloud data centers, vehicle electrification, IoT, robotics, and AI-enabled edge devices.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "LITE",
      "Date": "2026-02-12",
      "Time": "18:20:00",
      "Source": "Zacks",
      "Title": "Bull of the Day: Lumentum (LITE)",
      "URL": "https://finance.yahoo.com/news/bull-day-lumentum-lite-102000546.html",
      "Content": "Lumentum ( LITE ) delivered a stellar beat-and-raise December quarter last week that has estimates soaring.\n\nNon-GAAP earnings of $1.67 per share beat the Zacks Consensus Estimate by 18.68%, and were up nearly 300% from the year-ago quarter.\n\nNon-GAAP revenues of $665.5 million, which beat the consensus mark by 1.85%, increased 24.7% on a sequential basis and 65.5% on a year-over-year basis.\n\nThe growth showcases the strength of the company&rsquo;s plans for both optical components and systems in a world where NVIDIA ( NVDA ) is building next-gen GPU rack-scale datacenter architectures based on silicon photonics connectivity, switching, and networking.\n\nProduct-wise, revenues from the Components segment contributed 66.7% to total revenues in the fiscal second quarter. The figure increased 68.3% year over year to $443.7 million. System revenues contributed 33.3% to total revenues. The figure increased 60.1% year over year to $221.8 million.\n\nLITE Q3 2026 Guidance Ignites Estimates\n\nFor Q3 fiscal 2026 (ends March), LITE expects non-GAAP revenues between $780 and $830 million vs a prior consensus closer to $700 million. The company expects non-GAAP operating margin in the range of 30% to 31%, vs expectations of 22%, and non-GAAP diluted earnings between $2.15 and $2.35 per share, vs a prior consensus under $1.60.\n\nAnd if any investor or analyst was wondering if this blistering pace was going to slow down any time soon, management said this during the conference call...\n\n&ldquo;Our forward guidance calls for over 85% year-over-year revenue growth, yet we are only at the starting line for two substantial opportunities: optical circuit switches (OCS) and co-packaged optics (CPO).\"\n\nAnd analysts are already reflecting this optimism in Q4 FY'26 (ends June) with projected growth of 87.5% to $900 million.\n\nThe full-year 2026 sales consensus moved to $2.9 billion, representing over 76% annual growth. And FY'27 is already projected to come in near $4.7 billion, for a 61.5% advance.\n\nAs you would expect, these sales ramps, combined with improving margins, are driving the bottom line estimates higher for both this year and next.\n\nA month ago, the FY26 EPS consensus was at $5.67 and FY27 at $8.29. Today they stand at $7.63 and $14.11, representing growth of 270% and 85%, respectively.\n\nHow NVIDIA Ignited Demand for Optical Interconnect\n\nI'll admit: I was late to the optical party. And I should not have been since I follow NVIDIA so closely. Lessons learned. In December, I profiled Lumentum optical peer Coherent ( COHR ). Here's what I wrote...\n\nWe know NVIDIA is a big customer of Credo Technology ( CRDO ) AECs because CEO Jensen Huang is a big fan of copper for connecting GPUs within rack-scale architectures and Credo has repeatedly showcased its AECs in live demonstrations at the NVIDIA GPU Tech Conference (GTC). These demos feature Credo's AECs connecting servers and switches directly to NVIDIA H100 GPUs to create disaggregated, rack-scale GPU clusters.\n\nBut at GTC in March [2025], Jensen announced a collaboration with a purely optical player, Coherent.\n\nOne big driver of investor enthusiasm that helped drive COHR shares from below $70 to over $190 this year was their collaboration with NVIDIA announced at GTC in March.\n\nCoherent and NVIDIA will develop silicon photonics networking switches using co-packaged optics (CPO). This ecosystem will allow AI factories to connect millions of GPUs.\n\nNVIDIA still uses copper wiring within Blackwell NVL72 rack-scale systems to connect GPUs to each other, but to \"scale out\" across the datacenter Jensen Huang recognized the power and speed of optical solutions to connect many racks together for the lowest latency.\n\nThus NVIDIA has several connectivity and networking systems that use optical and photonics solutions and they can be categorized into two main areas: Interconnect Products, including Infiniband and Ethernet protocols, and the upcoming Co-Packaged Optics, like Spectrum-X Photonics Switches.\n\nLITE and TSMC: Co-Design for the Win\n\nLumentum and Taiwan Semiconductor ( TSM ), aka TSMC, aka THE advanced chip foundry, are two of the most critical \"ingredient\" partners in NVIDIA's move toward Co-Packaged Optics (CPO).\n\nTheir collaboration solves a massive physics problem: as AI clusters grow to millions of GPUs, traditional copper wiring and pluggable transceivers consume too much power and generate too much heat.\n\nBy moving optics into the chip package, they reduce power consumption by roughly 3.5x and increase signal integrity significantly. Here is how they work together to build this for NVIDIA's next-gen platforms like Quantum-X and Spectrum-X.\n\nBut TSMC has to provide the \"packaging\" that allows electricity and light to live on the same chip. A major challenge with CPO is that lasers are heat-sensitive. If you put a laser directly next to a hot GPU or Switch ASIC, it will fail.\n\nTSMC&rsquo;s Compact Universal Photonic Engine (COUPE) is a 3D packaging process. It allows NVIDIA to stack the Electrical IC (the brain) directly on top of the Photonic IC (the eyes).\n\nMe and the Analysts: Won't Get Fooled Again\n\nAfter I understood this integrated circuit of interdependency, I finally bought Lumentum shares in January at $350 on the pullback from $400. Most analysts were still too timid with estimates and the high price targets were only calling for $450. Heck, Morgan Stanley thought $350 was fair!\n\nAfter earnings, LITE could only manage to kiss $500 and retreat. So I sold some of my position at $485, thinking it may have gone too far, too fast.\n\nIn retrospect, I was foolish to ever doubt the risk appetite for Lumentum (LITE) based solely on the weak reception for its stellar report that day.\n\nAnd it should have been obvious as soon as the next day when everything was falling out of bed on Feb 5 because LITE tested the silly post-earnings low at $426 and reversed higher with a big fat engulfing candle to close above $500!\n\nThen Friday, as the upgrades and delayed reactions poured in, she gaps up to $540 and closes above $550.\n\nThey almost got me again with two kisses of $600 on Monday and Wednesday this week, and then another about-face. But I'm not falling for it this time.\n\nI'm holding my shares for the full realization of what NVIDIA (NVDA) is building for the next five years, where optical components are required at multiple stages and optical providers like LITE and Coherent (COHR) can be involved at different stages of design and fabrication with CPO.\n\nMeanwhile, here's the Street herd gathering around $550 with their PTs...\n\nRosenblatt $580\nJP Morgan $565\nCiti $560\nNeedam $550\nSusquehanna $550\nB. Riley $526\nMizuho $525\nBofA $520\nStifel $480\nBarclays $475 (Equal-Weight)\nUBS $455 (from $215! and stays at Neutral)\n\nSee ya next quarter when Lumentum surprises again and they raise their PTs to $650.\n\nDisclosure: I own NVDA, TSM, CRDO, and LITE shares for the Zacks TAZR Trader portfolio.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MRVL",
      "Date": "2026-02-12",
      "Time": "00:50:07",
      "Source": "Insider Monkey",
      "Title": "Jim Cramer Discusses Marvell (MRVL) & Amazon",
      "URL": "https://finance.yahoo.com/news/jim-cramer-discusses-marvell-mrvl-165007597.html",
      "Content": "We recently published 9 Stocks Jim Cramer Talked About . Marvell Technology, Inc. (NASDAQ:MRVL) is one of the stocks that Jim Cramer talked about.\nMarvell Technology, Inc. (NASDAQ:MRVL) is a chip company that provides products such as signal processors, network adapters, and SoCs. Its shares are down by 27% over the past year and by 8.3% year-to-date. Several analysts have discussed the stock in February. For instance, Benchmark reiterated a Hold rating after Marvell Technology, Inc. (NASDAQ:MRVL) completed its acquisition of Celestial AI. RBC Capital reiterated an Outperform rating and a $105 share price target in January as well. RBC’s discussion of Marvell Technology, Inc. (NASDAQ:MRVL) surrounded cloud computing giant Amazon’s AWS cloud business. The investment bank pointed out that Celestial’s products could be used by Amazon and help Marvell Technology, Inc. (NASDAQ:MRVL) secure a share of the cloud company’s Trainium chip business. These AI chips were also on Cramer’s mind as he wondered why the stock was performing poorly:",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ENTG",
      "Date": "2026-02-12",
      "Time": "00:48:40",
      "Source": "Insider Monkey",
      "Title": "Entegris (ENTG) Hits 52-Week High on Upbeat Q1 Outlook",
      "URL": "https://finance.yahoo.com/news/entegris-entg-hits-52-week-164840336.html",
      "Content": "We recently published 10 Stocks Delivering Massive Returns . Entegris Inc. (NASDAQ:ENTG) was one of the best performers on Tuesday.\nEntegris jumped to a new 52-week high on Tuesday, as investors cheered its upbeat outlook for the first quarter of the year, despite reporting a dismal earnings performance last quarter.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "TSEM",
      "Date": "2026-02-12",
      "Time": "00:18:00",
      "Source": "Zacks Small Cap Research",
      "Title": "TSEM: Tower Revises Its Model to Higher Investment and High Margins",
      "URL": "https://finance.yahoo.com/news/tsem-tower-revises-model-higher-161800468.html",
      "Content": "By Lisa Thompson\nNASDAQ:TSEM\nREAD THE FULL TSEM RESEARCH REPORT\nAs demand exceeds capacity, Tower Semiconductor (NASDAQ:TSEM) has decided to accelerate its investment as it sees margins continue to expand from the sale of new products. It is adding another $270 in capex to the next two years of spending to expand capacity for RF infrastructure products as demand outstrips supply. While the company is limited as to how high it can raise prices, it is deemphasizing lower margin products as it ramps new high margin ones. High margin SiPh contributed $228 million in 2025, up from $106 million in revenues in 2024, and with this additional investment, the company plans to grow capacity to greater than 5x of the actual Q4 monthly silicon photonics wafer shipments, compared to the 3x target given during the Q3 call. Over 70% of the total SiPho capacity is either presently reserved or in the process of being reserved through 2028, backed with customer prepayment.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "SWKS",
      "Date": "2026-02-11",
      "Time": "17:07:00",
      "Source": "Zacks",
      "Title": "Zacks Industry Outlook Highlights Skyworks and RF Industries",
      "URL": "https://finance.yahoo.com/news/zacks-industry-outlook-highlights-skyworks-090700667.html",
      "Content": "For Immediate Release Chicago, IL &ndash; February 11, 2026 &ndash; Today, Zacks Equity Research discusses Skyworks SWKS and RF Industries RFIL.\nIndustry: Electronics - Radio Frequency\nLink: https://www.zacks.com/commentary/2847030/2-radio-frequency-stocks-to-watch-from-a-prospering-industry\nThe Zacks Semiconductors - Radio Frequency industry participants like Skyworks and RF Industries are benefiting from the continued adoption of WiFi 7, as well as the rapid proliferation of the edge IoT, AI data centers and automotive electrification. The growing need for faster connections, low latency, and efficient battery life in wirelessly connected devices has been driving the demand for WiFi-enabled hotspots.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ARM",
      "Date": "2026-02-10",
      "Time": "23:35:00",
      "Source": "Motley Fool",
      "Title": "Arm Stock Rises on Accelerating AI Revenue, But a Big Risk Remains",
      "URL": "https://finance.yahoo.com/m/49655d69-2744-33aa-9539-04ffa52443d4/arm-stock-rises-on.html",
      "Content": "Arm Holdings (NASDAQ: ARM) shares rose after the company -- which sells critical design architecture for making semiconductors -- saw artificial intelligence (AI) demand boost its revenue. The stock, however, has still lost about a third of its value over the past year and it faces a big potential risk next fiscal year. Let's see what that is -- and what investors should do.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "NXPI",
      "Date": "2026-02-09",
      "Time": "16:08:49",
      "Source": "Barchart",
      "Title": "What Are Wall Street Analysts' Target Price for NXP Semiconductors Stock?",
      "URL": "https://finance.yahoo.com/m/320ec59d-94c1-31d2-a184-ff4391129b33/what-are-wall-street.html",
      "Content": "Headquartered in Eindhoven, the Netherlands, NXP Semiconductors N.V. (NXPI) designs and delivers advanced chips across processors, connectivity, analog, security, and sensor technologies. With a market cap of roughly $56.5 billion, the company forms the invisible backbone of vehicles, factories, Internet of Things (IoT) ecosystems, mobile devices, and modern communications infrastructure.",
      "Language": "en",
      "IsSummarized": false
    }
  ]
}