{
  "last_updated": "2026-02-14T02:00:17.858Z",
  "total_news_count": 97,
  "news": [
    {
      "Ticker": "NVDA",
      "Date": "2026-02-14",
      "Time": "09:53:00",
      "Source": "Motley Fool",
      "Title": "Should You Buy Alibaba Stock Before Feb. 19?",
      "URL": "https://finance.yahoo.com/m/d5c6e025-5cc7-3cb5-96cb-f5867381b3bc/should-you-buy-alibaba-stock.html",
      "Content": "Alibaba Group (NYSE: BABA) stock has experienced a dramatic recovery over the last year. The geopolitical concerns that weighed on the stock earlier in the decade have eased somewhat, and the return of Jack Ma to the company has bolstered investor confidence.\nNow, Alibaba will announce its earnings for the December quarter of 2025 on or around Feb. 19, and the business update presents investors with a difficult question. Should they add shares before the report, or could the news from the report endanger the rally?\nWill AI create the world's first trillionaire? Our team just released a report on the one little-known company, called an \"Indispensable Monopoly\" providing the critical technology Nvidia and Intel both need. Continue »",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-14",
      "Time": "09:31:12",
      "Source": "Benzinga",
      "Title": "Coinbase Only 22% To Beat Its Earnings As Bitcoin, Ethereum, XRP Drag Down COIN",
      "URL": "https://finance.yahoo.com/news/coinbase-only-22-beat-earnings-013112399.html",
      "Content": "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\nPolymarket traders are giving Coinbase Global, Inc. (NASDAQ: COIN ) just a 22% chance of beating Wall Street estimates ahead of its fourth-quarter earnings report today.\nThe Polymarket contract tracking whether COIN will exceed the Street consensus of $0.61 in GAAP EPS has attracted over $50,000 in volume.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-14",
      "Time": "09:30:23",
      "Source": "USA TODAY",
      "Title": "Puerto Rico Lottery results: See winning numbers for Pega 2, Pega 3 on Feb. 13, 2026",
      "URL": "https://finance.yahoo.com/m/0994cc77-f058-3c77-9703-3bceac8fce19/puerto-rico-lottery-results%3A.html",
      "Content": "The results are in for the Puerto Rico Lottery’s draw games on Friday, Feb. 13, 2026.\nHere’s a look at winning numbers for each game on Feb. 13.\nWinning Pega 2 numbers from Feb. 13 drawing Day: 9-1, Wild: 0\nCheck Pega 2 payouts and previous drawings here.\nWinning Pega 3 numbers from Feb. 13 drawing Day: 4-7-9, Wild: 0\nCheck Pega 3 payouts and previous drawings here.\nWinning Pega 4 numbers from Feb. 13 drawing Day: 6-2-8-7, Wild: 0\nCheck Pega 4 payouts and previous drawings here.\nFeeling lucky? Explore the latest lottery news & results\nWhen are the Puerto Rico Lottery drawings held? Powerball: 11:59 p.m. Monday, Wednesday and Saturday.\nPega 2, 3, 4: 2 p.m. (Day) and 9 p.m. (Night) daily.\nRevancha X2: 9 p.m. Monday, Wednesday and Friday.\nLoto Cash: 9 p.m. Monday, Wednesday and Friday.\nWinning lottery numbers are sponsored by Jackpocket, the official digital lottery courier of the USA TODAY Network .\nWhere can you buy lottery tickets? Tickets can be purchased in person at gas stations, convenience stores and grocery stores. Some airport terminals may also sell lottery tickets.\nYou can also order tickets online through Jackpocket, the official digital lottery courier of the USA TODAY Network , in these U.S. states and territories: Arizona, Arkansas, Colorado, Idaho, Maine, Massachusetts, Minnesota, Montana, Nebraska, New Hampshire, New Jersey, New York, Ohio, Oregon, Puerto Rico, Washington D.C., and West Virginia. The Jackpocket app allows you to pick your lottery game and numbers, place your order, see your ticket and collect your winnings all using your phone or home computer.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-14",
      "Time": "09:30:00",
      "Source": "TheStreet",
      "Title": "Presidents Day sales for DIY enthusiasts start at just $8 from Amazon, Walmart, and Lowe's",
      "URL": "https://finance.yahoo.com/m/01bf1bb1-fbaa-3ab7-81ca-640b8bc04ab8/presidents-day-sales-for-diy.html",
      "Content": "TheStreet aims to feature only the best products and services. If you buy something via one of our links, we may earn a commission.\nPresidents Day DIY deals There's nothing people love more than a three-day weekend, and if it includes grilling, a beverage, and maybe some online shopping, it's ideal. Presidents Day falls on Feb. 16 this year, granting us one of those glorious 72-hour breaks, and you're likely already thinking about what you want to do with your free time.\nIf you're interested in DIY projects and daydream about spending time off building your own furniture or expanding that too-small bathroom, there's no better time to get started. Presidents Day DIY sales are plentiful, and it's a great time to save on everything from tools to storage. That's why we've gathered a list of some of the best DIY deals available now and through this weekend under $50. The best part is that prices start as low as $8, and everything on our list is from trusted retailers like Amazon, Walmart , and Lowe's.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-14",
      "Time": "09:30:00",
      "Source": "PR Newswire",
      "Title": "ICFAI Business School (IBS) Selection Process for MBA/PGPM Admissions Starts on 14th February and Ends on 22nd February 2026",
      "URL": "https://finance.yahoo.com/news/icfai-business-school-ibs-selection-013000848.html",
      "Content": "HYDERABAD, India , Feb. 14, 2026 /PRNewswire/ -- ICFAI Business School (IBS) officially commences its annual selection process today at the IBS Hyderabad campus. Running through February 22, this is the entry point for students aspiring to join any of the nine IBS campuses across India.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-14",
      "Time": "09:29:00",
      "Source": "PR Newswire",
      "Title": "/C O R R E C T I O N -- Maruchan/",
      "URL": "https://finance.yahoo.com/news/c-o-r-r-e-012900379.html",
      "Content": "In the news release, Maruchan Unveils Saucy Noods: Creamy, Spicy, and Seriously Saucy Stir-Fry Style Noodles, issued 15-Jan-2026 by Maruchan over PR Newswire, we are advised by the company that changes have been made. The complete, corrected release follows, with additional details at the end:\nMaruchan Unveils Saucy Noods: Creamy, Spicy, and Seriously Saucy Stir-Fry Style Noodles The brand's new product line debuts with Valentine's activations, availability on Amazon and TikTok Shop\nIRVINE, Calif. , Jan. 15, 2026 /PRNewswire/ -- Maruchan , America's trusted leader in convenient and delicious meal solutions, announced the launch of Saucy Noods Stir-Fry Style Noodles, a bold, new product line designed for noodle lovers who crave rich, sauce-forward flavor.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-14",
      "Time": "09:27:00",
      "Source": "The Decatur Daily, Ala.",
      "Title": "Kayak rental and launch proposed for Point Mallard",
      "URL": "https://finance.yahoo.com/m/e688193c-db73-306e-8013-503fb41a07ad/kayak-rental-and-launch.html",
      "Content": "Feb. 13—People may soon be able to rent a kayak or paddleboard at Point Mallard Park and then spend a day floating down the Tennessee River and Flint Creek, if the City Council accepts a proposal at Monday morning's meeting.\nParks and Recreation Director Hunter Allen presented a proposal at this week's City Council work session to allocate up to $170,000 to purchase two self-service kayak stations and equipment and a concrete sloped kayak launch and floating dock for Point Mallard Park.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-14",
      "Time": "09:25:00",
      "Source": "GlobeNewswire",
      "Title": "Free Welcome Bonus No Deposit Required Real Money USA: Cafe Casino Launched Free Spins No Deposit Bonus",
      "URL": "https://finance.yahoo.com/news/free-welcome-bonus-no-deposit-012500908.html",
      "Content": "Discover the growth of free welcome bonus no deposit required real money promotions, which are emerging as a defining driver of player acquisition.\nCafeCasino",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-14",
      "Time": "09:25:00",
      "Source": "Motley Fool",
      "Title": "Alphabet vs. Meta Platforms: Which One Will Dominate the Next Decade?",
      "URL": "https://finance.yahoo.com/m/acf98749-8068-3538-a308-7bcfde314811/alphabet-vs.-meta-platforms%3A.html",
      "Content": "Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) and Meta Platforms (NASDAQ: META) have been clear leaders in the internet age. The former's Google Search and YouTube, for instance, and the latter's various social media apps are incredibly popular and drive robust financial performance.\nBetween these two \" Magnificent Seven \" stocks, which one will dominate the next decade?\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "NVDA",
      "Date": "2026-02-14",
      "Time": "09:07:20",
      "Source": "Motley Fool",
      "Title": "Why DraftKings Stock Dropped Today",
      "URL": "https://finance.yahoo.com/m/0aab2c27-b33e-3207-91cd-6e4dae4ef837/why-draftkings-stock-dropped.html",
      "Content": "Shares of DraftKings (NASDAQ: DKNG) tumbled on Friday after the digital sports entertainment and gaming leader issued a tepid growth forecast.\nBy the close of trading, DraftKings' stock price was down more than 13%.\nWill AI create the world's first trillionaire? Our team just released a report on the one little-known company, called an \"Indispensable Monopoly\" providing the critical technology Nvidia and Intel both need. Continue »",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-14",
      "Time": "08:55:00",
      "Source": "Barrons.com",
      "Title": "Review & Preview: Inflation Yawner?",
      "URL": "https://finance.yahoo.com/m/fe984341-b166-341d-b17b-7a56997b8ff2/review-%26-preview%3A-inflation.html",
      "Content": "A cooler-than-expected inflation report left stocks flat on the day, but pushed Treasury yields lower as investors priced in the possibility of more rate cuts in the months to come. The 2-year and 10-year Treasury bonds were each down roughly five basis points on the day, or 0.05 percentage points. Over the last two days the two- and 10-year yields have dropped 10 and 12 basis points, respectively.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "NVDA",
      "Date": "2026-02-14",
      "Time": "08:50:00",
      "Source": "Motley Fool",
      "Title": "Should You Invest $500 in Costco Right Now?",
      "URL": "https://finance.yahoo.com/m/f3ec79a6-95ae-3003-afb2-7fd0026cef3e/should-you-invest-%24500-in.html",
      "Content": "With net sales of $66 billion in the fiscal 2026 first quarter (ended Nov. 23), Costco Wholesale (NASDAQ: COST) is among the leaders in the global retail sector. And its shares, which have generated a total return of 193% in the past five years (as of Feb. 10), have boosted investor portfolios.\nShould you invest $500 in this top retail stock right now?\nWill AI create the world's first trillionaire? Our team just released a report on the one little-known company, called an \"Indispensable Monopoly\" providing the critical technology Nvidia and Intel both need. Continue »",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-14",
      "Time": "08:49:00",
      "Source": "Barrons.com",
      "Title": "Universities Feel a Fiscal Squeeze Despite Solid Performance",
      "URL": "https://finance.yahoo.com/m/eb320f86-a473-3ab2-906f-23f7747ce19b/universities-feel-a-fiscal.html",
      "Content": "Rising costs and Trump pressure on higher education boosted endowment spending. Fortunately, returns on stocks provided a cushion.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-02-14",
      "Time": "08:16:45",
      "Source": "Reuters Videos",
      "Title": "S&P 500 ends up slightly as tech dips, inflation cools",
      "URL": "https://finance.yahoo.com/video/p-500-ends-slightly-tech-001645134.html",
      "Content": "STORY: U.S. stocks were little changed on Friday, with the Dow and S&P 500 ticking up fractionally, and the Nasdaq making the biggest move with a less than quarter percentage-point drop. All three indexes declined for the week, with tech stocks on a roller-coaster ride due to uncertainty over AI disruption of the sector, as well as massive AI-related spending. Nancy Tengler is CEO and chief investment officer at Laffer Tengler Investments. “I think you're seeing a market that's tug-of-warring between fear and greed. And that's typical in these periods. Just going back to DeepSeek, you know, Broadcom was down 15% and ended up 102. Google was down 18, ended up 100. In these periods, it's very difficult to step in. And so the Nasdaq is getting punished. But we don't think the technology trade's over. And frankly, without technology, it's going to be very hard for the market to go up in any sustainable fashion.” Shares of Nvidia and Apple, both down more than 2%, were the biggest drags on the S&P 500. Shares of Applied Materials provided the strongest boost, jumping more than 8% after the chipmaking-equipment firm forecast second-quarter revenue and profit above Wall Street expectations. And shares of networking equipment provider Arista Networks gained nearly 5% after forecasting annual revenue above expectations. Meanwhile, the latest inflation data showed U.S. consumer prices increased less than expected in January. Traders now put the chances of an interest-rate cut from the Federal Reserve in June at more than 50%, according to the CME Group's FedWatch tool.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-14",
      "Time": "07:49:00",
      "Source": "Zacks",
      "Title": "Previewing Retail Sector Earnings: A Closer Look",
      "URL": "https://finance.yahoo.com/news/previewing-retail-sector-earnings-closer-234900719.html",
      "Content": "Walmart WMT shares have been standout performers this year, handily outperforming not just the broader market indexes and brick-and-mortar retail peers but also Amazon AMZN and many members of the Magnificent 7 group.\nWith the company set to report quarterly results on Thursday, February 19th, it will be interesting to see whether the stock can maintain its momentum after the results.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "NVDA",
      "Date": "2026-02-14",
      "Time": "07:35:00",
      "Source": "Motley Fool",
      "Title": "Is Amazon Stock a Good Buy?",
      "URL": "https://finance.yahoo.com/m/ad9cf698-6c1d-3635-ab95-7c066cd5cc70/is-amazon-stock-a-good-buy%3F.html",
      "Content": "After beginning the year on a strong note, shares of e-commerce and cloud computing giant Amazon (NASDAQ: AMZN) have recently fallen off a cliff.\nLet's dig into why Amazon investors are running for the hills. Is now a good opportunity to buy the dip in Amazon, or is the stock turning into a falling knife ?\nWill AI create the world's first trillionaire? Our team just released a report on the one little-known company, called an \"Indispensable Monopoly\" providing the critical technology Nvidia and Intel both need. Continue »",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-14",
      "Time": "07:31:13",
      "Source": "Benzinga",
      "Title": "Bitcoin Recovery Likely To Be 'Slow And Painful,' Analysts Warn: Watch This Key Level",
      "URL": "https://finance.yahoo.com/news/bitcoin-recovery-likely-slow-painful-233113604.html",
      "Content": "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\nInfluential crypto traders Trader Mayne and DonAlt maintain a cautious, bearish-to-neutral stance on Bitcoin (CRYPTO: BTC ), warning that a sharp V-shaped recovery is unlikely.\n‘Slow, Grinding' Correction Ahead In their latest podcast, both analysts said they expect a prolonged, choppy correction rather than an immediate rebound.\nBroader macro risks, particularly potential weakness in equities, could add further downside pressure.\nTrader Mayne says the S&P 500 may be forming a topping structure similar to prior market peaks.\nDon't Miss:\nFast Company Calls It a ‘Groundbreaking Step for the Creator Economy' — Investors Can Still Get In at $0.85/Share\nSecurity and regulation matter in crypto — explore Kraken Pro's compliance-first trading platform.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-14",
      "Time": "07:15:02",
      "Source": "Zacks",
      "Title": "FedEx (FDX) Outpaces Stock Market Gains: What You Should Know",
      "URL": "https://finance.yahoo.com/news/fedex-fdx-outpaces-stock-market-231502982.html",
      "Content": "FedEx (FDX) ended the recent trading session at $374.72, demonstrating a +1.42% change from the preceding day's closing price. The stock outpaced the S&P 500's daily gain of 0.05%. On the other hand, the Dow registered a gain of 0.1%, and the technology-centric Nasdaq decreased by 0.22%.\nThe package delivery company's stock has climbed by 17.98% in the past month, exceeding the Transportation sector's gain of 8.02% and the S&P 500's loss of 1.99%.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-14",
      "Time": "07:15:02",
      "Source": "Zacks",
      "Title": "Diamondback Energy (FANG) Outpaces Stock Market Gains: What You Should Know",
      "URL": "https://finance.yahoo.com/news/diamondback-energy-fang-outpaces-stock-231502863.html",
      "Content": "Diamondback Energy (FANG) closed the most recent trading day at $169.14, moving +1.03% from the previous trading session. The stock outperformed the S&P 500, which registered a daily gain of 0.05%. Meanwhile, the Dow experienced a rise of 0.1%, and the technology-dominated Nasdaq saw a decrease of 0.22%.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-14",
      "Time": "07:15:02",
      "Source": "Zacks",
      "Title": "Lennar (LEN) Exceeds Market Returns: Some Facts to Consider",
      "URL": "https://finance.yahoo.com/news/lennar-len-exceeds-market-returns-231502083.html",
      "Content": "In the latest close session, Lennar (LEN) was up +1.2% at $122.28. This change outpaced the S&P 500's 0.05% gain on the day. Elsewhere, the Dow gained 0.1%, while the tech-heavy Nasdaq lost 0.22%.\nThe stock of homebuilder has fallen by 1.16% in the past month, lagging the Construction sector's gain of 6.88% and overreaching the S&P 500's loss of 1.99%.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "NVDA",
      "Date": "2026-02-14",
      "Time": "07:08:01",
      "Source": "Investor's Business Daily",
      "Title": "Nvidia Partner Surges After Earnings Beat; Expects 'Momentum' To Continue In 2026",
      "URL": "https://finance.yahoo.com/m/6098552c-c896-3f83-b275-3bc4ee5351fd/nvidia-partner-surges-after.html",
      "Content": "Vertiv stock soared early on better-than-expected fourth-quarter earnings and a strong 2026 outlook.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AMAT",
      "Date": "2026-02-14",
      "Time": "07:07:00",
      "Source": "TheStreet",
      "Title": "BofA revamps Applied Materials stock price target after CEO message",
      "URL": "https://finance.yahoo.com/m/2c08fc88-27e9-329a-b57c-2eae160b3b28/bofa-revamps-applied.html",
      "Content": "Applied Materials ( AMAT ) reported its Q1 earnings on February 12. The earnings beat consensus estimates for adjusted EPS and revenue, and the stock is trading 10% higher at the time of writing, Friday morning, Feb. 13, according to Yahoo Finance .\nThe supplier of semiconductor and semiconductor-related fabrication equipment reported revenue of $7 billion, a 2% year-over-year decline, yet the earnings report got investors excited and prompted Bank of America analyst Vivek Arya to raise his price target for Applied Materials.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "NVDA",
      "Date": "2026-02-14",
      "Time": "07:06:06",
      "Source": "Motley Fool",
      "Title": "Why Instacart Stock Jumped Today",
      "URL": "https://finance.yahoo.com/m/856001a3-e602-349b-8e50-89e57e43c5d7/why-instacart-stock-jumped.html",
      "Content": "Shares of Instacart (NASDAQ: CART) rallied on Friday after the food delivery platform issue an upbeat growth forecast.\nBy the close of trading, Instacart's stock price was up more than 9%.\nWill AI create the world's first trillionaire? Our team just released a report on the one little-known company, called an \"Indispensable Monopoly\" providing the critical technology Nvidia and Intel both need. Continue »",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "NVDA",
      "Date": "2026-02-14",
      "Time": "07:05:00",
      "Source": "Motley Fool",
      "Title": "Where Will Sandisk Stock Be in 3 Years?",
      "URL": "https://finance.yahoo.com/m/fadf73f4-53e0-3f9c-9664-ce29416507f1/where-will-sandisk-stock-be.html",
      "Content": "It has been just under a year since digital storage giant Western Digital spun off flash storage specialist Sandisk (NASDAQ: SNDK) , and the latter has turned into one of the hottest stocks on the market since its separation.\nShares of the company -- which specializes in NAND flash storage solutions for smartphones, personal computers (PCs), tablets, automotive applications, wearable devices, and data centers -- have shot up a stunning 1,400% since the spin-off. Investors may now be wondering whether it is worth holding this semiconductor stock after its red-hot rally.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-14",
      "Time": "07:00:02",
      "Source": "Zacks",
      "Title": "Gladstone Commercial (GOOD) Exceeds Market Returns: Some Facts to Consider",
      "URL": "https://finance.yahoo.com/news/gladstone-commercial-good-exceeds-market-230002998.html",
      "Content": "Gladstone Commercial (GOOD) closed the most recent trading day at $11.67, moving +1.21% from the previous trading session. The stock outperformed the S&P 500, which registered a daily gain of 0.05%. At the same time, the Dow added 0.1%, and the tech-heavy Nasdaq lost 0.22%.\nThe stock of real estate investment trust has fallen by 0.52% in the past month, leading the Finance sector's loss of 1.79% and the S&P 500's loss of 1.99%.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-14",
      "Time": "07:00:02",
      "Source": "Zacks",
      "Title": "Vital Farms (VITL) Outpaces Stock Market Gains: What You Should Know",
      "URL": "https://finance.yahoo.com/news/vital-farms-vitl-outpaces-stock-230002886.html",
      "Content": "Vital Farms (VITL) closed at $28.41 in the latest trading session, marking a +2.53% move from the prior day. This change outpaced the S&P 500's 0.05% gain on the day. On the other hand, the Dow registered a gain of 0.1%, and the technology-centric Nasdaq decreased by 0.22%.\nShares of the company witnessed a loss of 6.04% over the previous month, trailing the performance of the Consumer Staples sector with its gain of 12.24%, and the S&P 500's loss of 1.99%.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "NVDA",
      "Date": "2026-02-14",
      "Time": "06:50:00",
      "Source": "Motley Fool",
      "Title": "Should You Buy Berkshire Hathaway Stock Before Earnings?",
      "URL": "https://finance.yahoo.com/m/921dbb9f-f64d-364e-bed3-0be4345a5559/should-you-buy-berkshire.html",
      "Content": "Where does the time go? Berkshire Hathaway 's (NYSE: BRKA) (NYSE: BRKB) first earnings report in the post- Warren Buffett era is almost upon us. Buffett, of course, is still on the scene as chairman, but as of Jan. 1, he's no longer CEO.\nRegardless, Berkshire -- which hasn't formally set a date for disseminating its fourth-quarter and full-year 2025 results -- will likely unveil them toward the end of February. Here's my take on whether it's wise to load up on the popular stock in the run-up to the event, or sit on the sidelines.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-14",
      "Time": "06:48:34",
      "Source": "Motley Fool",
      "Title": "Infini Capital Dumps 33,000 BIDU Shares for $4.4 Million",
      "URL": "https://finance.yahoo.com/m/7b31558e-a43f-3a4e-b730-1fd3d239fd7f/infini-capital-dumps-33%2C000.html",
      "Content": "On February 13, 2026, Infini Capital Management Ltd reported selling out its entire Baidu (NASDAQ:BIDU) position.\nWhat happened According to an SEC filing dated February 13, 2026, Infini Capital Management Ltd fully exited its Baidu position, selling 33,399 shares. The estimated transaction value was $4.40 million, calculated using the average price over the quarter. The quarter-end value of the Baidu stake decreased by $4.40 million, reflecting the full liquidation of the position.\nWhat else to know Infini Capital Management Ltd sold out its Baidu holdings, which now represent 0% of its reportable AUM.\nTop holdings after the filing:\nNASDAQ:VNET: $12.09 million (97.7% of AUM)\nNYSE: CHA: $279,000 (2.3% of AUM)\nAs of February 12, 2026, Baidu shares were priced at $138.38, up 48.3% over one year, outperforming the S&P 500 by 35.35 percentage points.\nCompany overview Metric\nValue\nPrice (as of market close 2/12/26)\n$138.38\nMarket Capitalization\n$46.93 billion\nRevenue (TTM)\n$18.15 billion\nNet Income (TTM)\n$1.23 billion",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AMAT",
      "Date": "2026-02-14",
      "Time": "06:47:59",
      "Source": "Motley Fool",
      "Title": "Stock Market Today, Feb. 13: Inflation Data Steadies Market and Slows AI Disruption Losses",
      "URL": "https://finance.yahoo.com/m/ec81e188-28a1-38ea-b7b5-a649ed921707/stock-market-today%2C-feb.-13%3A.html",
      "Content": "The S&P 500 (SNPINDEX:^GSPC) inched up 0.05% to 6,836.17 as cooler inflation data steadied sentiment. The Nasdaq Composite (NASDAQINDEX:^IXIC) slipped 0.22% to 22,546.67, and the Dow Jones Industrial Average (DJINDICES:^DJI) added 0.10% to 49,500.93.\nAll three finished the week in the red, with the Nasdaq shedding 2.10% in the past five days. As we head into a long weekend with U.S. markets closed for Presidents’ Day on Monday, investors are trimming risks.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-14",
      "Time": "06:41:18",
      "Source": "Yahoo奇摩股市",
      "Title": "美股「AI恐慌」交易！那指跌50點、台積電ADR跌0.51％",
      "URL": "https://tw.stock.yahoo.com/news/%E7%BE%8E%E8%82%A1-ai%E6%81%90%E6%85%8C-%E4%BA%A4%E6%98%93-%E9%82%A3%E6%8C%87%E8%B7%8C50%E9%BB%9E-%E5%8F%B0%E7%A9%8D%E9%9B%BBadr%E8%B7%8C0-224118028.html",
      "Content": "受「AI恐慌交易」影響，美股13日四大指數大多持平，台積電ADR（TSM）跌1.88美元或-0.51％、收366.22美元；輝達（NVDA）跌4.16美元或-2.23％，收182.78美元。\n美股道瓊指數上漲 48.95 點，或 0.10%，收 49,500.93 點。\n那斯達克指數下跌 50.477 點，或 0.22%，收 22,546.671 點。\nS&P 500 指數上漲 3.41 點，或 0.05%，收 6,836.17 點。\n\n費城半導體指數上漲 53.16 點，或 0.66%，收 8,137.859 點。\n\n更多中時新聞網報導\nAI恐慌蔓延！道瓊重挫近700點 台積電ADR跌1.60％\nPCB從地表紅到太空！華通、金像電、台光電、欣興、台燿等12檔誰「最有錢景」一表看\n台股衝破3萬3 抱股過年穩了？他年終、紅包都押這檔ETF 只因「不管漲跌都能賺錢」\n\n檢視留言\n\n相關內容\nAI恐慌蔓延！美股道瓊重挫669點　台積電ADR下跌1.6% [FTNN新聞網]記者陳宣穎／綜合報導受到市場關注「AI帶動成長」轉向「AI顛覆產業就業」的負面衝擊，避險情緒急速升溫，影響美股主要四大指數週四（12日）全數...\nFTNN新聞網 ・ 1 天前 ・ 1 則留言\n\n台積電ADR13日下跌1.74美元跌幅0.47%折台股2309.39元 (中央社台北2026年 2月14日電)台積電在NYSE掛牌 ADR以366.36美元作收，下跌1.74美元，跌幅 0.47%。由於每單位台積電 ADR相當於台股 5股台積電普通股，以 2月13日新台幣匯市收盤價31.518元計算，相當台股台積電每股為 2309.39元。最近10個交易日行情如下：台積電 ADR 近十個交易日行情交易日收盤價漲跌漲跌幅%匯率折台股2/13366.36-1.74-0.4731.5182309.32/12368.10-5.99-1.6031.4602316.02/11374.0912.183.3731.4782355.12/10361.916.501.8331.5502283.62/ 9355.416.561.8831.5602243.32/ 6348.8518.125.4831.6782210.12/ 5330.734.991.5331.6482093.32/ 4325.74-10.01-2.9831.5772057.12/ 3335.75-5.61-1.6431.5702119.92/ 2341.3610.803.2731.5902156.7\n中央社財經 ・ 1 小時前 ・ 發表留言\n\n台積電ADR12日下跌5.99美元跌幅1.60%折台股2316.09元 (中央社台北2026年 2月13日電)台積電在NYSE掛牌 ADR以368.10美元作收，下跌 5.99美元，跌幅 1.60%。由於每單位台積電 ADR相當於台股 5股台積電普通股，以 2月12日新台幣匯市收盤價31.460元計算，相當台股台積電每股為 2316.09元。最近10個交易日行情如下：台積電 ADR 近十個交易日行情交易日收盤價漲跌漲跌幅%匯率折台股2/12368.10-5.99-1.6031.4602316.02/11374.0912.183.3731.4782355.12/10361.916.501.8331.5502283.62/ 9355.416.561.8831.5602243.32/ 6348.8518.125.4831.6782210.12/ 5330.734.991.5331.6482093.32/ 4325.74-10.01-2.9831.5772057.12/ 3335.75-5.61-1.6431.5702119.92/ 2341.3610.803.2731.5902156.71/30330.56-8.99-2.6531.4682080.4\n中央社財經 ・ 1 天前 ・ 發表留言\n\n〈美股盤後〉財富管理股遭AI衝擊 道瓊連三日刷新高 台積電ADR漲超1.8% 美股主指週二 (10 日) 震盪偏弱，但道瓊指數連續第三個交易日創新高，在零售銷售數據意外疲弱之際仍守住漲幅，坐穩 50,000 點之上。\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n《晨間解盤》壓力拆彈 台股樂看高檔封關 【時報-台北電】科技股延續漲勢加上軟體服務股持續反彈帶動，美股早盤震盪後走高，四大指數同步收漲，道瓊再度改寫新高。輝達上漲2.5%、台積電ADR收漲1.88%。 周一受到美股強彈帶動，台積電開盤挑戰天價，領軍電子權值反攻，台股衝高884點後持續高檔震盪。大盤開高走高，上漲1.96%作收，量縮至6500餘億元。記憶體、封測、機器人、低軌、矽光子、探針卡成為封關前的主流類股。 群益投顧指出，農曆春節長假在即，影響買盤追價積極度，惟指數收復短期均線，大幅化解技術面弱化壓力，預期可望維持高檔封關。 操作上，個股確實依據短期均線多空，汰弱留強擇優適度持倉。指數區間看31800~33000點。（編輯：張嘉倚）\n時報資訊 ・ 4 天前 ・ 發表留言\n\n《台北股市》台積電1900元天價領軍 金蛇年封關再創新高 【時報-台北電】美股漲跌互現，台積電ADR上漲1.83%再創新高。台積電(2330)今開平盤隨後再創1900元歷史新天價，率台股再刷指數新高紀錄。今日為蛇年封關，今早最高33,304點，整年度大漲9779點。 台積電今開平走高，加上台達電等電子權值股開高，以及台積電盤中漲20元再創新高價，領軍台股再創新高。今日由電子股帶動指數開高走高，相較龍年封關的23,525點，大漲近萬點，金蛇年不但在今日將亮麗封關且再隨著台積電再創歷史新高。目前為止，早盤最高漲232點至33,304點，台積電最高1900元皆為歷史新高紀錄。 零售消費數據疲軟加深市場對經濟放緩的擔憂，加上非農就業數據即將公布，瀰漫觀望氛圍，美四大指數漲跌互見。 周二(2月10日)道指微升且連3日改寫收盤歷史高點。標普500收黑。輝達、微軟、Alphabet等科技巨頭普遍下跌，但台積電1月營收月增19.8%、年增36.8%，並再創歷史新高，其ADR逆勢收漲1.83%至361.91美元，再創新高。 國票投顧表示，大盤在上周用長下影線回測月線，短線震幅高達1800點，這讓不少投資人在權衡波動後選擇節前賣股，賣壓提前宣洩讓本周在上攻時反而\n時報資訊 ・ 3 天前 ・ 1 則留言\n\n台積電ADR市值逼近2兆美元大關 挑戰美股史上第8家 不愧是護國神山！台股農曆年昨封關，開始長達11天休市，但台積電（2330）在美國存託憑證ADR繼續交易，昨大漲3.37%，市值已來到1.94兆美元，距離2兆美元大關只差臨門一腳，只要再漲逾3.1%，就可締造新里程碑，也是第一家達到如此高峰境界的台灣企業，挑戰美股史上第8家曾經叩關2兆美元的企業，為台灣在國際舞台上揚眉吐氣。\nYahoo股市 ・ 2 天前 ・ 3 則留言\n\n誰偷買台積電？神祕買家1分鐘「狂撒123億」封關掃貨 ADR盤前又飆了 台積電元月營收繳出亮眼成績，單月合併營收達4012.55億元，首度突破4,000億元大關，巧合的是，在營收公布前，台積電今（10）日股價在最後一盤湧入6541張大單，終場大漲65元、漲幅3.58%，收在1880元歷史新高，該筆大單成交金額高達122.9億元；同時，美國掛牌的台積電ADR盤前股價也一度勁揚逾3%。\n中時財經即時 ・ 3 天前 ・ 發表留言\n\nAI獲利疑慮再起！美股漲跌互見　台指期盤後跌41點 即時中心／林耿郁報導AI獲利疑慮再起，美股四大指數跌多漲少；終場道瓊上漲52點、漲幅0.10%，收50,188點；標普五百跌23點、跌幅0.33%，收6941點；納指跌136點、跌幅0.59%，收23102點；費半跌55點、跌幅0.68%，收8107點。\n民視財經網 ・ 3 天前 ・ 發表留言\n\n台積電ADR11日上漲12.18美元漲幅3.37%折台股2355.12元 (中央社台北2026年 2月12日電)台積電在NYSE掛牌 ADR以374.09美元作收，上漲12.18美元，漲幅 3.37%。由於每單位台積電 ADR相當於台股 5股台積電普通股，以 2月11日新台幣匯市收盤價31.478元計算，相當台股台積電每股為 2355.12元。最近10個交易日行情如下：台積電 ADR 近十個交易日行情交易日收盤價漲跌漲跌幅%匯率折台股2/11374.0912.183.3731.4782355.12/10361.916.501.8331.5502283.62/ 9355.416.561.8831.5602243.32/ 6348.8518.125.4831.6782210.12/ 5330.734.991.5331.6482093.32/ 4325.74-10.01-2.9831.5772057.12/ 3335.75-5.61-1.6431.5702119.92/ 2341.3610.803.2731.5902156.71/30330.56-8.99-2.6531.4682080.41/29339.55-2.75-0.8031.3272127.4\n中央社財經 ・ 2 天前 ・ 發表留言\n\n台積電ADR9日上漲6.56美元漲幅1.88%折台股2243.35元 (中央社台北2026年 2月10日電)台積電在NYSE掛牌 ADR以355.41美元作收，上漲 6.56美元，漲幅 1.88%。由於每單位台積電 ADR相當於台股 5股台積電普通股，以 2月 9日新台幣匯市收盤價31.560元計算，相當台股台積電每股為 2243.35元。最近10個交易日行情如下：台積電 ADR 近十個交易日行情交易日收盤價漲跌漲跌幅%匯率折台股2/ 9355.416.561.8831.5602243.32/ 6348.8518.125.4831.6782210.12/ 5330.734.991.5331.6482093.32/ 4325.74-10.01-2.9831.5772057.12/ 3335.75-5.61-1.6431.5702119.92/ 2341.3610.803.2731.5902156.71/30330.56-8.99-2.6531.4682080.41/29339.55-2.75-0.8031.3272127.41/28342.303.961.1731.3202144.11/27338.345.631.6931.4702129.5\n中央社財經 ・ 4 天前 ・ 發表留言\n\n台積電ADR10日上漲6.50美元漲幅1.83%折台股2283.65元 (中央社台北2026年 2月11日電)台積電在NYSE掛牌 ADR以361.91美元作收，上漲6.50美元，漲幅 1.83%。由於每單位台積電 ADR相當於台股 5股台積電普通股，以 2月10日新台幣匯市收盤價31.550元計算，相當台股台積電每股為 2283.65元。最近10個交易日行情如下：台積電 ADR 近十個交易日行情交易日收盤價漲跌漲跌幅%匯率折台股2/10361.916.501.8331.5502283.62/ 9355.416.561.8831.5602243.32/ 6348.8518.125.4831.6782210.12/ 5330.734.991.5331.6482093.32/ 4325.74-10.01-2.9831.5772057.12/ 3335.75-5.61-1.6431.5702119.92/ 2341.3610.803.2731.5902156.71/30330.56-8.99-2.6531.4682080.41/29339.55-2.75-0.8031.3272127.41/28342.303.961.1731.3202144.1\n中央社財經 ・ 3 天前 ・ 發表留言\n\n《半導體》台積電續衝1905元新天價 市值飛越49兆關 【時報記者林資傑台北報導】美股四大指數周二跌多漲少，晶圓代工龍頭台積電(2330)ADR逆勢收漲1.83％，股價今（11）日持平開出後一度微跌0.27％，隨後再度翻紅，最高上漲1.33％至1905元，再創新天價，市值自48.75兆元升至49.4兆元，一舉飛越49兆關。三大法人本周迄今買超1萬5636張。 台積電2025年合併營收3兆8090.54億元、年增31.61％，歸屬母公司稅後淨利1兆7178.82億元、年增達46.42％，每股盈餘66.25元，全數續創歷史新高。毛利率59.89％、營益率50.83％，亦雙創歷史新高，表現業內外皆美。公司將於6月4日召開股東常會。 展望2026年首季，台積電預期合併營收將介於346～358億美元，季增2.58～6.13％、年增35.55～40.25％。在假設新台幣兌美元平均匯率31.6元狀況下，毛利率預期介於63～65％、營益率介於54～56％。 以此推算，台積電首季合併營收估落於1.09～1.13兆元，季增4.52～8.14％、年增30.28～34.8％，中位數1.11兆元，季增6.33％、年增32.54％，連4季改寫新高。毛利率及營益率預估中\n時報資訊 ・ 2 天前 ・ 發表留言\n\n台積電去年大賺6.6個股本，ADR追高1.83%連三天破頂，市值逼近韓國GDP 【財訊快報／陳孟朔】全球晶圓代工龍頭台積電(2330)(美股代碼TSM)於週二(10日)在日本熊本召開董事會，會中核准2025年營業報告書與財務報表。受惠於AI晶片需求爆發，台積電去年全年合併營收達3兆8090億5427萬元(新台幣，下同)，稅後淨利高達1兆7178億8300萬元，換算每股盈餘(EPS)為66.25元，相當於一年賺進超過6.6個股本，獲利表現刷新歷史巔峰。在營運績效強勁支撐下，台積電美股表現勢如破竹。美股ADR在連續兩天抽高24.68美元或7.46%後，週二一度追高2.63%至364.76美元的日高暨史上新高，終場漲幅小縮但仍漲了6.50美元或1.83%，收在361.91美元，連續三天破頂。開春以來，台積電ADR已大漲19.09%，市值攀升至1兆8770億美元，規模已足以與韓國(預計2026年GDP為1.937兆美元)和澳洲(1.948兆美元)全年經濟產值平起平坐。為鞏固技術領先優勢，董事會同時核准高達449.62億美元(約新台幣1.41兆元)的資本預算，將用於建置及升級先進製程、先進封裝及成熟特殊製程產能。台積電先前於法說會預告，2026年全年資本支出將進一步上修至5\n財訊快報 ・ 3 天前 ・ 發表留言\n\n台積電雙喜 1月營收衝破4000億元創新高、市值飆上48.75兆元 台積電 (2330-TW)(TSM-US) 今 (10) 日公布 1 月營收達 4012.55 億元，月增 19.78%，年增 36.81%，一舉刷新歷史紀錄，顯見 AI 需求強勁，今日股價也改寫歷史天價，以 1880 元作收，大漲 65 元，市值達 4\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n市場憂心Fed放慢降息步調！美股道瓊跌66點　台積電ADR上漲3.37%、美光飆近1成 [FTNN新聞網]記者陳宣穎／綜合報導美國1月份非農業就業數據高於預期，雖然緩解了市場對經濟前景的擔憂，但同時也憂心聯準會（Fed）恐將放慢降息步調。美股週...\nFTNN新聞網 ・ 2 天前 ・ 發表留言\n\n神山股利有望再創新高？台積電漲55元至1835元追平天價 專家：拉回再買 台積電（2330）封關倒數，今（9）日上漲55元或3.09%至1835元，專家表示，投資人應秉直不追高，有拉回再分批布局。\nYahoo股市 ・ 4 天前 ・ 5 則留言\n\n台積電蛇年勁揚780元漲幅68.7%　市值增逾20兆元 （中央社記者張建中新竹2026年2月11日電）台股蛇年今天封關，台積電(2330)股價收在1915元，創封關新高價。台積電蛇年累計上漲780元，漲幅68.7%，市值增逾新台幣20兆元，達到49.66兆元，貢獻大盤約6262點。台積電蛇年股價呈現先蹲後跳走勢，受美國對等關稅衝擊，以及中國DeepSeek推出低成本人工智慧（AI）模型，重創科技股，台積電於2025年4月9日創下波段低點780元。隨後在國安基金進場護盤，重振市場信心，加上美國對等關稅措施不斷調整，市場對於關稅利空鈍化，以及AI市場蓬勃發展，雲端服務供應商（CSP）積極投資AI基礎建設，AI晶片廠輝達（NVIDIA）產品熱賣，台積電營運受惠業績不斷創高，股價也觸底翻揚，並屢創歷史新高。台積電2025年總營收3兆8090億元，歸屬母公司淨利1兆7178億元，營收與獲利同創新高。台積電預期，2026年美元營收可望成長近30%。台積電今天股價延續強勁走勢，盤中一度達1925元創新天價；終場漲勢收斂，收在1915元，依然創下封關新高價。台積電蛇年累計上漲780元，市值增加20.22兆元，並貢獻大盤6262點。（編輯：張良知）\n中央社財經 ・ 2 天前 ・ 發表留言\n\n《台北股市》封關倒數2天 台積電創1875元天價、台股首破33K 【時報-台北電】美股續強，台積電ADR上漲1.88%再創高。台積電(2330)今開盤漲30元至1845元，隨即創下史上新高1875元，台股開高走高，大漲逾600點，突破33000點新高。 台積電、台達電、日月光投控等電子權值股開高領軍，台股距離農曆年封關僅剩兩個交易日，指數隨著台積電發威向上攻堅，目前最高漲634點至33038點，突破1月19日創下的32996點史上最高。台積電盤中大漲60元為1875元史上新高，漲幅3.3%成為今早台股創新高的最大功臣。 美光收低2.84%盤中回探月線，略壓抑台系記憶體族群今早上攻氣勢。 在科技股上漲帶動下，周一(2月9日)四大指數再度收高，標普500距收盤歷史高點僅差臨門一腳。道指再創收盤與盤中新高。 AI晶片熱門股輝達漲2.5%、台積電ADR漲1.88%、博通和超微漲超過3%帶動，費半表現相對亮眼。AI概念股甲骨文大漲9.6%，投資人將關注本周陸續公布的非農就業等重大經濟數據和新一批財報。 國票投顧表示，黃仁勳上周五受訪表示，看好這波AI建設至少還能跑7到8年，算力需求只會越來越高，因此龐大資本支出既合理也必要，此言論有效淡化市場對AI泡沫的擔憂，\n時報資訊 ・ 4 天前 ・ 發表留言\n\n台積電ADR週一追高1.88%，連兩天破頂，開春以來表現優於費半 【財訊快報／陳孟朔】全球晶圓代工龍頭台積電(2330)(美股代碼TSM)ADR漲勢凌厲，繼連續兩天大漲23.11美元或7.1%後，週一(9日)再度追高6.56美元或1.88%，終場收在355.41美元，連三紅且連續兩天破頂。台積電ADR自2026年開春以來已累計大漲16.95%，不僅展現強勁的上攻力道，更成功超越同期費城半導體指數(SOX)15.24%的漲幅。受惠於AI晶片需求持續爆發以及先進製程產能滿載，台積電股價頻頻破頂，帶動市值持續膨脹。截至週一收盤，台積電總市值已攀升至1兆8433億美元，穩居全球第七大科企。以週一收盤價355.41美元及新台幣匯率31.56元計算，台積電ADR折合台股每股價格約為2243.35元，較台股週一收盤價1815新台幣存在高度溢價。分析人士指出，台積電近期調升2026年資本支出預期至520億至560億美元，顯示公司對未來兩年由AI驅動的成長前景極具信心。隨著3奈米產能擴張與2奈米量產進度順利，法人預期台積電2026年營收有望挑戰30%的高速成長。相較於其他半導體同業，台積電在技術領先與獲利能力上的優勢，使其成為資金在半導體族群中的首選目標。\n財訊快報 ・ 4 天前 ・ 1 則留言\n\n熱門新聞\n1\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 2\n\n13.5億威力彩「2得主」買法一模一樣！ 只花100元就翻身 3\n\n郭台銘大紅包發威！央行新台幣發行額首破4.2兆  年增率飆3年最高 4\n\n「新版新台幣」可能有石虎！票選結果曝光 台積電僅排第七 5\n\n【房地產週報】輝達簽約落腳北士科！29年最大交屋潮來襲！新竹預售屋慘崩82.3%！七大都會區交易量年減7成\n\n你可能會喜歡\n你上車了嗎？記憶體登蛇年狂飆主力　前10猛將全曝光 FTNN新聞網\n\n九大工業公會聯合肯定台美貿易協定 強調為產業注入強心針 民視財經網\n\n春節搭車風險升溫！行車保護傘保障出行　花1元即可享百萬保障 三立新聞網 setn.com\n\n「台灣價值」竟沒台灣之光！大盤飆新高00940卻回不到10元　股民哀號：成敗皆這1檔 鏡週刊Mirror Media\n\n緝捕馬杜洛震驚全球 美軍傳動用AI工具Anthropic Claude 鉅亨網\n\n信義房屋：年前家電、家具換新需求高 今日新聞NOWNEWS\n\n台股拉警報！專家警告美股7巨頭集體翻車：最慘開年行情 中時財經即時\n\n鄭麗君團隊立大功！謝金河曝「台美ART簽署」意義：台灣獲1席珍貴位子 三立新聞網 setn.com\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 工商時報\n\n租屋族省很大！租金補貼減輕4成負擔 女性與25歲以下青年成主力 太報\n\n法人兩樣情！華邦電發說利多連發...目標價上看200元 　保守派「4理由」只喊88元 FTNN新聞網\n\n美股掀AI恐慌交易　台積電ADR挫0.47％ CTWANT\n\n陸客不去日本！外媒爆25萬大軍「改衝這國」 刷爆103億不手軟 中時財經即時\n\n外食族吃不消! 海南雞飯漲20元 手搖飲過年期間漲5元 民視財經網影音\n\n金蛇年「大漲萬點」封關！0050領銜市值型ETF悍漲　近十年含息報酬率高達509% FTNN新聞網\n\n台灣賓士對「台美貿易協議」成功達成表達祝賀 並承諾回饋消費者 民視財經網\n\n砸5億擴產最快Q2釋產能！PCB股華通衝連3漲　當沖爆量破5萬張登當沖王 FTNN新聞網\n\n輝達下跌、AMD上漲 背後關鍵或在Arista 鉅亨網\n\n台美ART簽署》台經院張建一妙喻：台灣付的午餐費 比別人還低 工商時報\n\n美通膨降溫難掩「AI恐慌」! 美股漲跌互見、台積電ADR下跌0.51％ 新頭殼\n\n大研生醫* 公告本公司股票面額由「新台幣10元」變更為「新台幣1元」，公告期間：114年12月22日至115年3月21日。 Moneydj理財網\n\n外資降評唱衰！大咖投顧逆風喊買面板指標大廠「這檔」　最新目標價曝光 FTNN新聞網\n\n春節放假也能追美股！內部數據曝光　過年反而更敢買 三立新聞網 setn.com\n\n記憶體嚴重短缺！美國軍工企業黑名單 移除中國長鑫、長江存儲 自由時報\n\n運載指標／港務公司貨櫃量上看1,390萬TEU 今日新聞NOWNEWS\n\n關稅干擾消失加AI助攻　經濟成長率上修至7.71％ 卡優新聞網\n\n台積電ADR13日下跌1.74美元跌幅0.47%折台股2309.39元 中央社財經\n\n到全台最夯紫南宮借發財金　主委莊秋安：心存善念有來有保庇 鏡報\n\n新北房市 新莊幸福路商圈 成家首選 工商時報\n\n台美ART 守住重要農產品防線 工商時報\n\n〈能源盤後〉油價因美通膨趨緩回升 周線仍收黑 鉅亨網\n\n主動式ETF規模破1739億！這檔年化配息率10％　豪配0.377元「年後這天」最後上車日 FTNN新聞網\n\n蘇威元：台積電概念股飆漲密碼 這四指標抓飆股一次賺58% 民視財經網影音\n\n13家金控1月獲利全公布！國泰金元月大賺146億元　EPS達0.99元登獲利王 FTNN新聞網\n\n美通膨降溫難掩AI隱憂　美股漲跌互見 太報\n\n〈貴金屬盤後〉黃金、白銀回神 CPI重燃降息預期 鉅亨網\n\n傳統軟體股崩跌回五年前！卡爾先生：掌握這兩點才能存活 民視財經網影音\n\n台股資料來源 臺灣證券交易所 、 臺灣期貨交易所 及 財團法人中華民國證券櫃檯買賣中心 ，國際股市資料來源請參考 Yahoo Finance 。台股行情、個股基本資料及財務資訊為精誠資訊提供。使用Yahoo股市服務前，請您詳閱相關 使用規範與聲明 。\n\n服務條款 隱私權 您的隱私權選擇 加州隱私權通知 © 2026 Yahoo. All rights reserved.\n\n1",
      "Language": "zh",
      "IsSummarized": false
    },
    {
      "Ticker": "NVDA",
      "Date": "2026-02-14",
      "Time": "06:13:27",
      "Source": "Motley Fool",
      "Title": "3 Reasons Why Ethereum Is Surging Today",
      "URL": "https://finance.yahoo.com/m/de055c4e-1a0f-32f0-aa22-54dabc56a9f1/3-reasons-why-ethereum-is.html",
      "Content": "Ethereum's (CRYPTO: ETH) 7.3% move over the past 24 hours, as of 4:00 p.m. ET, is one I think investors are right to cheer today. After all, we haven't had many days in which Ethereum has trended higher over the past four months or so. Thus, a move of more than 7% higher in such a short time frame is worth celebrating.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AMAT",
      "Date": "2026-02-14",
      "Time": "06:12:33",
      "Source": "The Wall Street Journal",
      "Title": "Stocks to Watch Friday Recap: Applied Materials, Coinbase, DraftKings",
      "URL": "https://finance.yahoo.com/m/0231f38b-d500-3202-8830-6da25e9fcec7/stocks-to-watch-friday-recap%3A.html",
      "Content": "↗️ Coinbase (COIN): The largest U.S. cryptocurrency exchange swung to a loss in a quarter marked by a selloff in digital currencies. Coinbase stock, which has fallen sharply this year, rose 16% on Friday.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MU",
      "Date": "2026-02-14",
      "Time": "06:00:00",
      "Source": "Zacks",
      "Title": "Top Stock Reports for Micron Technology, Goldman Sachs & Verizon",
      "URL": "https://finance.yahoo.com/news/top-stock-reports-micron-technology-220000475.html",
      "Content": "Friday, February 13, 2026\n\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Micron Technology, Inc. (MU), The Goldman Sachs Group, Inc. (GS) and Verizon Communications Inc. (VZ), as well as two micro-cap stocks Natural Grocers by Vitamin Cottage, Inc. (NGVC) and Team, Inc. (TISI). The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\n\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\n\nYou can see all of today&rsquo;s research reports here >>>\n\nAhead of Wall Street\n\nThe daily 'Ahead of Wall Street' article is a must-read for all investors who would like to be ready for that day's trading action. The article comes out before the market opens, attempting to make sense of that morning's economic releases and how they will affect that day's market action. You can read this article for free on our home page and can actually sign up there to get an email notification as this article comes out each morning.\n\nYou can read today's AWS here >>> Near-Perfect CPI Report Brings Pre-Markets Near Breakeven",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AMAT",
      "Date": "2026-02-14",
      "Time": "05:58:08",
      "Source": "Investor's Business Daily",
      "Title": "Stock Market Today: Dow Ends Choppy Session Higher, Nasdaq Slips; Travel Name Falls Again (Live Coverage)",
      "URL": "https://finance.yahoo.com/m/b8c56085-66da-3c0e-b403-2b57226b99c8/stock-market-today%3A-dow-ends.html",
      "Content": "Stock Market Today: The Dow Jones remained positive after wavering early, but the Nasdaq closed down. A vaccine stock bolts higher.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AMAT",
      "Date": "2026-02-14",
      "Time": "05:20:00",
      "Source": "Barrons.com",
      "Title": "Applied Materials, Rivian, Moderna, Arista, Fastly, Coinbase, Robinhood, DraftKings, and More Stock Market Movers",
      "URL": "https://finance.yahoo.com/m/6fbc1376-7f97-3995-8b79-f14962d751bd/applied-materials%2C-rivian%2C.html",
      "Content": "Applied Materials shares surged after the semiconductor-equipment maker beat analysts’ quarterly earnings estimates.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AMD",
      "Date": "2026-02-14",
      "Time": "05:05:53",
      "Source": "Investor's Business Daily",
      "Title": "AMD Taking PC, Server Market Share From Intel",
      "URL": "https://finance.yahoo.com/m/8cef3c77-7e98-311e-ab7d-af14d974d99a/amd-taking-pc%2C-server-market.html",
      "Content": "AMD continues to grab market share from Intel in PC and server processors, a Wall Street analyst says. AMD stock rose Friday.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ADI",
      "Date": "2026-02-14",
      "Time": "04:30:44",
      "Source": "The Wall Street Journal",
      "Title": "Walmart Earnings, GDP, Inflation Figures: What to Watch Next Week",
      "URL": "https://finance.yahoo.com/m/ea62d291-2823-3d5f-a347-ccf013fc6147/walmart-earnings%2C-gdp%2C.html",
      "Content": "Investors face a holiday-shortened week featuring Federal Reserve speakers and economic data. Walmart earnings will provide insight into the health of the U.S. consumer. The market will parse a significant batch of data at the end of next week—including an advance look at fourth-quarter GDP and the personal-consumption expenditures price index—to gauge the economy's momentum and inflation.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MU",
      "Date": "2026-02-14",
      "Time": "04:02:28",
      "Source": "Barchart",
      "Title": "Competition Is Heating Up for Micron. Should You Buy, Sell, or Hold MU Stock Now?",
      "URL": "https://finance.yahoo.com/m/0a217c71-2823-3481-b3b8-a8566d088e5b/competition-is-heating-up-for.html",
      "Content": "Artificial intelligence (AI) is reshaping the tech landscape at breakneck speed, and investors are scrambling to lock in the biggest winners. Yet even in a crowded AI trade, few names have delivered like Micron Technology (MU). The memory-chip giant has ridden the AI wave to record highs, with MU stock delivering massive returns over the past year. Surging demand for memory chips from AI hyperscalers racing to build out massive data center capacity has been the primary engine behind Micron’s remarkable ascent.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AMD",
      "Date": "2026-02-14",
      "Time": "04:00:00",
      "Source": "Zacks",
      "Title": "NVIDIA vs. SMCI: Which AI Hardware Stock Is the Better Buy Now?",
      "URL": "https://finance.yahoo.com/news/nvidia-vs-smci-ai-hardware-200000479.html",
      "Content": "NVIDIA Corporation NVDA and Super Micro Computer, Inc. SMCI are both currently riding the artificial intelligence (AI) infrastructure boom. But with Supermicro facing margin pressure and NVIDIA offering far stronger profitability metrics, could NVDA now be the better investment? Let’s take a closer look –",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-02-14",
      "Time": "03:10:00",
      "Source": "Motley Fool",
      "Title": "2 AI Stocks That Could Go Parabolic",
      "URL": "https://finance.yahoo.com/m/6f238a68-97f3-3e7a-9319-183bda38ddfc/2-ai-stocks-that-could-go.html",
      "Content": "Wall Street may argue all about the artificial intelligence (AI) bubble, but big tech's spending plans in global AI infrastructure are too large to ignore, right now. Amazon , Alphabet , Microsoft , and Meta Platforms expect to collectively spend roughly $650 billion on AI infrastructure in 2026, up about 60% year over year.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MU",
      "Date": "2026-02-14",
      "Time": "02:11:06",
      "Source": "24/7 Wall St.",
      "Title": "Micron Is Suddenly at the Center of AI Spending As Shares Keep Soaring",
      "URL": "https://finance.yahoo.com/m/ddf2a52d-5987-31b2-8cb6-6d83ea22792a/micron-is-suddenly-at-the.html",
      "Content": "Quick Read Micron (MU) posted 57% year-over-year revenue growth and 28.1% profit margins as AI demand and supply shortages pushed prices sharply higher.\nMicron is shipping HBM4 chips with nearly $2B in Q4 revenue. Big tech plans over $700B in AI infrastructure spending for 2026.\nWestern Digital (WDC) surged 466% over the past year while Seagate (STX) jumped 2.5% on memory chip shortages driving industry momentum.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality. Read more here .",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MU",
      "Date": "2026-02-14",
      "Time": "01:47:00",
      "Source": "Zacks",
      "Title": "IPG Photonics Q4 Earnings Beat Estimates, Revenues Rise Y/Y, Shares Up",
      "URL": "https://finance.yahoo.com/news/ipg-photonics-q4-earnings-beat-174700001.html",
      "Content": "IPG Photonics IPGP reported fourth-quarter 2025 adjusted earnings of 46 cents per share, which beat the Zacks Consensus Estimate by 21 cents and climbed 53% year over year.\n\nRevenues of $274.4 million increased 17% on a year-over-year basis and 9% sequentially, while beating the consensus mark by 11.4%. Favorable forex contributed 2% to revenue growth. The book-to-bill ratio was firmly above one in the reported quarter.\n\nThe year-over-year revenue growth was driven by further stabilization in industrial demand, new opportunities and a disciplined focus on growth initiatives. Emerging growth product sales accounted for 54% of revenues, which increased from 52% reported in the previous quarter.\n\nIPG Photonics shares were up 35.48% at the time of writing this article. The company’s shares have surged 138.9% in the trailing 12 months, outperforming the Zacks Computer & Technology sector’s appreciation of 21.6%.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AMD",
      "Date": "2026-02-14",
      "Time": "01:44:45",
      "Source": "GuruFocus.com",
      "Title": "AMD Rated Neutral on AI Competition Concerns",
      "URL": "https://finance.yahoo.com/news/amd-rated-neutral-ai-competition-174445344.html",
      "Content": "This article first appeared on GuruFocus .\nAdvanced Micro Devices ( AMD , Financials ) was initiated with a Neutral rating by DA Davidson , with a $220 price target implying limited upside from current levels.\nWarning! GuruFocus has detected 5 Warning Signs with AMD.\nIs AMD fairly valued? Test your thesis with our free DCF calculator.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AMD",
      "Date": "2026-02-14",
      "Time": "01:39:23",
      "Source": "Quartz",
      "Title": "Nvidia stock is stuck in a rut despite AI spending blitz",
      "URL": "https://finance.yahoo.com/m/160a3e47-65e3-3820-ba51-87bd86b6802f/nvidia-stock-is-stuck-in-a.html",
      "Content": "Shares of Nvidia have lingered in a narrow trading range for months, even as global capital expenditures on artificial intelligence infrastructure continue to climb to record levels.\nAfter hitting record highs in late 2025, the chipmaker's stock fell nearly 2% on Friday morning, rounding off a muted six months. Nvidia's gained just under 2% since August, barely outpacing broader market indexes. By contrast, chipmakers TSMC and AMD are trading around 52% and 12% higher over the same period, respectively.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-02-14",
      "Time": "01:31:00",
      "Source": "Motley Fool",
      "Title": "I Predicted That Oracle and Netflix Would Join Nvidia, Alphabet, Apple, Microsoft, Amazon, Broadcom, Meta Platforms, and Tesla in the $1 Trillion Club by 2030. Here's Why That Forecast Is Being Tested in 2026.",
      "URL": "https://finance.yahoo.com/m/5ca6a2aa-3699-351b-8244-130f43534e62/i-predicted-that-oracle-and.html",
      "Content": "In August, I predicted that Netflix (NASDAQ: NFLX) and Oracle (NYSE: ORCL) would reach at least $1 trillion in market capitalization by 2030. But Netflix is down 38.6% from its 52-week high at the time of this writing, while Oracle has fallen a staggering 56.5%.\nNetflix's market cap is now just $346.9 billion as I write this, and Oracle is at $410.4 billion -- a far cry from joining Nvidia , Alphabet , Apple , Microsoft , Amazon , Broadcom , Meta Platforms , Tesla , Berkshire Hathaway , and Walmart on the list of U.S. companies with at least $1 trillion in market cap.\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\nHere's why both growth stocks are under pressure, and if they are still buys now.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-02-14",
      "Time": "01:21:36",
      "Source": "Barchart",
      "Title": "How Much Further Will Qualcomm Fall After 18% Slide This Year?",
      "URL": "https://finance.yahoo.com/m/7b73c7c7-d4fe-3ec1-993e-d95ebb97af00/how-much-further-will.html",
      "Content": "Shares of Qualcomm (QCOM) have struggled so far this year, with the stock down more than 18% year-to-date (YTD) and nearly 32% below its 52-week high. Despite the significant pullback, unfavorable industry dynamics around memory supply could weigh on QCOM’s earnings. With sentiment already negative, the possibility of the stock revisiting its two-year low of $120.80 cannot be ruled out.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-02-14",
      "Time": "01:15:04",
      "Source": "24/7 Wall St.",
      "Title": "Meta, Amazon, and Goolge Lead a $700 Billion Capex Wave: What Stocks Win Beyond NVIDIA?",
      "URL": "https://finance.yahoo.com/m/05d49f95-1441-3863-ba89-f71620fcf677/meta%2C-amazon%2C-and-goolge-lead.html",
      "Content": "Quick Read Nvidia (NVDA) is up only 0.24% year-to-date despite hyperscalers deploying $700B in AI infrastructure spending.\nLumentum (LITE) surged 637% and Bloom Energy (BE) jumped 492% as AI supply chain plays vastly outperformed Nvidia.\nBroadcom (AVGO) gained 41% on custom AI chip demand while Micron rose 353% on AI memory demand.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality. Read more here .\nThe AI infrastructure arms race has reached a staggering scale. Hyperscalers are collectively pouring approximately $700 billion into AI CapEx in 2026. Amazon ( Nasdaq: AMZN) just announced $200 billion in planned spend, Alphabet ( Nasdaq: GOOGL ) is projected $185, Meta Platforms ( Nasdaq: META ) up to $135 billion, and Microsoft will reveal an updated capex target closer to summer.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MU",
      "Date": "2026-02-14",
      "Time": "01:15:04",
      "Source": "24/7 Wall St.",
      "Title": "Meta, Amazon, and Goolge Lead a $700 Billion Capex Wave: What Stocks Win Beyond NVIDIA?",
      "URL": "https://finance.yahoo.com/m/05d49f95-1441-3863-ba89-f71620fcf677/meta%2C-amazon%2C-and-goolge-lead.html",
      "Content": "Quick Read Nvidia (NVDA) is up only 0.24% year-to-date despite hyperscalers deploying $700B in AI infrastructure spending.\nLumentum (LITE) surged 637% and Bloom Energy (BE) jumped 492% as AI supply chain plays vastly outperformed Nvidia.\nBroadcom (AVGO) gained 41% on custom AI chip demand while Micron rose 353% on AI memory demand.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality. Read more here .\nThe AI infrastructure arms race has reached a staggering scale. Hyperscalers are collectively pouring approximately $700 billion into AI CapEx in 2026. Amazon ( Nasdaq: AMZN) just announced $200 billion in planned spend, Alphabet ( Nasdaq: GOOGL ) is projected $185, Meta Platforms ( Nasdaq: META ) up to $135 billion, and Microsoft will reveal an updated capex target closer to summer.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ADI",
      "Date": "2026-02-14",
      "Time": "01:11:00",
      "Source": "Zacks",
      "Title": "Airbnb Q4 Earnings Miss Estimates, Revenues Rise Y/Y, Shares Up",
      "URL": "https://finance.yahoo.com/news/airbnb-q4-earnings-miss-estimates-171100231.html",
      "Content": "Airbnb ABNB reported fourth-quarter 2025 adjusted earnings of 56 cents per share, which lagged the Zacks Consensus Estimate by 14.89%. The company reported adjusted earnings of 73 cents per share in the year-ago quarter.\n\nRevenues of $2.78 billion increased 12% year over year on a reported basis and 11% on a forex-neutral basis, driven by solid growth in nights stayed and a slight increase in Average Daily Rate (ADR). The top line beat the Zacks Consensus Estimate by 2.01%.\n\nFollowing the results, ABNB shares were up roughly 3.98% at the time of writing this article.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-02-14",
      "Time": "00:51:00",
      "Source": "Zacks",
      "Title": "ALAB Stock Dips 31% Post Q4 Earnings: Should You Buy, Hold, or Sell?",
      "URL": "https://finance.yahoo.com/news/alab-stock-dips-31-post-165100520.html",
      "Content": "Astera Labs ALAB shares have plunged 30.8% since it reported fourth-quarter 2025 results on Tuesday. The decline was due to a slight decrease in non-GAAP gross margin in the fourth quarter of 2025, which dropped 70 basis points sequentially to 75.7% compared to the previous quarter. This decrease was primarily attributed to a higher mix of hardware sales.\n\nNon-GAAP operating margins also fell 150 basis points sequentially to 40.2%, driven by a $16 million increase in operating expenses due to the expansion of the R&D organization, including the aiXscale acquisition.\n\nALAB’s shares have also plunged 33.6% in the trailing six-month period, underperforming the broader Zacks Computer & Technology sector’s rise of 10.3% and the Zacks Internet - Software industry’s decline of 20.3% over the same time frame. The underperformance can be attributed to challenging macroeconomic uncertainties and stiff competition in the PCIe retimers market.\n\nHowever, the company is benefiting from its robust and diversified product portfolio to address the growing demands of AI infrastructure and connectivity solutions, as well as its expanding partner base. It benefits from strong demand for its PCIe solutions, which have also been a major growth driver.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AMD",
      "Date": "2026-02-14",
      "Time": "00:11:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Wobbles. The Focus Is Turning to Earnings.",
      "URL": "https://finance.yahoo.com/m/3c298d2f-8220-3d02-b2bc-89fb3f06f78e/nvidia-stock-wobbles.-the.html",
      "Content": "Nvidia shares are stuttering ahead of the chip maker’s earnings report later this month. Nvidia shares were down 2.0% in morning trading Friday. Investors will be watching to see whether the company’s earnings report, due Feb. 25, can help prompt another rally.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-02-14",
      "Time": "00:11:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Wobbles. The Focus Is Turning to Earnings.",
      "URL": "https://finance.yahoo.com/m/3c298d2f-8220-3d02-b2bc-89fb3f06f78e/nvidia-stock-wobbles.-the.html",
      "Content": "Nvidia shares are stuttering ahead of the chip maker’s earnings report later this month. Nvidia shares were down 2.0% in morning trading Friday. Investors will be watching to see whether the company’s earnings report, due Feb. 25, can help prompt another rally.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-02-14",
      "Time": "00:10:51",
      "Source": "Simply Wall St.",
      "Title": "Broadcom Wi Fi 8 Launch Highlights AI Network Demand And Valuation Questions",
      "URL": "https://finance.yahoo.com/news/broadcom-wi-fi-8-launch-161051207.html",
      "Content": "Find your next quality investment with Simply Wall St's easy and powerful screener, trusted by over 7 million individual investors worldwide.\nBroadcom (NasdaqGS:AVGO) has launched what it describes as the industry's first Wi-Fi 8 access point and switch solution for AI ready enterprise networks.\nThe new offering combines a unified architecture with built in security, analytics, and AI acceleration for low latency, high bandwidth environments.\nThis product is targeted at enterprises looking to support more data intensive workloads and AI applications across their network infrastructure.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-02-13",
      "Time": "23:09:39",
      "Source": "Insider Monkey",
      "Title": "Broadcom Inc. (AVGO) Draws ARK Investment Amid Positive AI Growth Outlook",
      "URL": "https://finance.yahoo.com/news/broadcom-inc-avgo-draws-ark-150939444.html",
      "Content": "Broadcom Inc. (NASDAQ: AVGO ) is among the most profitable mega cap stocks to buy . On February 6, Cathie Wood’s ARK ETF posted the daily trades for the day, outlining a significant purchase of Broadcom Inc. (NASDAQ:AVGO) shares. Through the acquisition of 87,148 shares, ARK invested around $27 million in the company.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ADI",
      "Date": "2026-02-13",
      "Time": "22:56:00",
      "Source": "Zacks",
      "Title": "Applied Materials Q1 Earnings Beat Estimates, Revenues Fall Y/Y",
      "URL": "https://finance.yahoo.com/news/applied-materials-q1-earnings-beat-145600580.html",
      "Content": "Applied Materials AMAT reported first-quarter fiscal 2026 non-GAAP earnings of $2.38 per share, which beat the Zacks Consensus Estimate by 8.7%. AMAT’s first-quarter fiscal 2026 non-GAAP earnings remained flat from the year-ago quarter’s reported figure.\nAMAT beat the Zacks Consensus Estimate in each of the trailing four quarters, with an average surprise of 5.2%.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AMD",
      "Date": "2026-02-13",
      "Time": "22:49:42",
      "Source": "The Fly",
      "Title": "Pinterest downgraded, Airbnb upgraded: Wall Street's top analyst calls",
      "URL": "https://finance.yahoo.com/news/pinterest-downgraded-airbnb-upgraded-wall-144942245.html",
      "Content": "The most talked about and market moving research calls around Wall Street are now in one place. Here are today's research calls that investors need to know, as compiled by The Fly.\n\nTop 5 Upgrades:\n\nDeutsche Bank upgraded Airbnb (ABNB) to Buy from Hold with a $154 price target. Deutsche expects Airbnb's hotel business to grow while its AI native search drives up conversions. While the company is \"not immune from AI disintermediation,\" it is \"more shielded than others,\" contends Deutsche Bank, which sees a \"compelling\" risk/reward at Airbnb's current share levels. Evercore ISI also upgraded Airbnb to Outperform from In Line with a $145 price target.\nArgus upgraded McDonald's (MCD) to Buy from Hold with a $380 price target. The company is well positioned to attract budget-conscious consumers thanks to its value menus and sales promotions, the firm tells investors in a research note.\nDeutsche Bank upgraded Rivian (RIVN) to Buy from Hold with a price target of $23, up from $16, following the Q4 report. The firm sees early signs the company's \"prospects are inflecting.\" UBS upgraded Rivian to Neutral from Sell with a price target of $16, up from $15, following the Q4 report.\nHSBC upgraded CrowdStrike (CRWD) to Buy from Hold with an unchanged price target of $446. The firm cites the stock's \"attractive\" valuation and the company's AI growth for the upgrade.\nRosenblatt upgraded Roku (ROKU) to Buy from Neutral with a price target of $118, up from $106. Roku \"handily beat\" Q4 estimates and guided above expectations for Q1 and 2026, says the firm, which adds that the outlook \"looks beatable again.\"",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-02-13",
      "Time": "22:49:42",
      "Source": "The Fly",
      "Title": "Pinterest downgraded, Airbnb upgraded: Wall Street's top analyst calls",
      "URL": "https://finance.yahoo.com/news/pinterest-downgraded-airbnb-upgraded-wall-144942245.html",
      "Content": "The most talked about and market moving research calls around Wall Street are now in one place. Here are today's research calls that investors need to know, as compiled by The Fly.\n\nTop 5 Upgrades:\n\nDeutsche Bank upgraded Airbnb (ABNB) to Buy from Hold with a $154 price target. Deutsche expects Airbnb's hotel business to grow while its AI native search drives up conversions. While the company is \"not immune from AI disintermediation,\" it is \"more shielded than others,\" contends Deutsche Bank, which sees a \"compelling\" risk/reward at Airbnb's current share levels. Evercore ISI also upgraded Airbnb to Outperform from In Line with a $145 price target.\nArgus upgraded McDonald's (MCD) to Buy from Hold with a $380 price target. The company is well positioned to attract budget-conscious consumers thanks to its value menus and sales promotions, the firm tells investors in a research note.\nDeutsche Bank upgraded Rivian (RIVN) to Buy from Hold with a price target of $23, up from $16, following the Q4 report. The firm sees early signs the company's \"prospects are inflecting.\" UBS upgraded Rivian to Neutral from Sell with a price target of $16, up from $15, following the Q4 report.\nHSBC upgraded CrowdStrike (CRWD) to Buy from Hold with an unchanged price target of $446. The firm cites the stock's \"attractive\" valuation and the company's AI growth for the upgrade.\nRosenblatt upgraded Roku (ROKU) to Buy from Neutral with a price target of $118, up from $106. Roku \"handily beat\" Q4 estimates and guided above expectations for Q1 and 2026, says the firm, which adds that the outlook \"looks beatable again.\"",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ADI",
      "Date": "2026-02-13",
      "Time": "22:30:04",
      "Source": "Zacks",
      "Title": "Is It Worth Investing in Analog Devices (ADI) Based on Wall Street's Bullish Views?",
      "URL": "https://finance.yahoo.com/news/worth-investing-analog-devices-adi-143004519.html",
      "Content": "Investors often turn to recommendations made by Wall Street analysts before making a Buy, Sell, or Hold decision about a stock. While media reports about rating changes by these brokerage-firm employed (or sell-side) analysts often affect a stock's price, do they really matter?\nLet's take a look at what these Wall Street heavyweights have to say about Analog Devices (ADI) before we discuss the reliability of brokerage recommendations and how to use them to your advantage.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AMD",
      "Date": "2026-02-13",
      "Time": "22:29:03",
      "Source": "Investing.com",
      "Title": "D.A. Davidson starts coverage of AMD, INTC, AVGO and TSMC. Only 1 is Buy rated",
      "URL": "https://finance.yahoo.com/news/d-davidson-starts-coverage-amd-142903265.html",
      "Content": "Investing.com -- D.A. Davidson initiated coverage of four major semiconductor names, AMD, Intel, Broadcom and Taiwan Semiconductor Manufacturing Co. in notes to clients on Thursday, with only one receiving a Buy rating.\nAnalyst Gil Luria initiated coverage of the group, pointing to diverging competitive positions.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MU",
      "Date": "2026-02-13",
      "Time": "22:00:43",
      "Source": "Investor's Business Daily",
      "Title": "Distribution Days Provide Clues To Stock Market Health: How To Use Them",
      "URL": "https://finance.yahoo.com/m/5ceabb12-9627-3c81-9937-d747601ecac3/distribution-days-provide.html",
      "Content": "One way to gauge stock market health is to monitor distribution days in the Nasdaq composite and S&P 500. They're prominent in the Nasdaq.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AMD",
      "Date": "2026-02-13",
      "Time": "21:08:00",
      "Source": "Zacks",
      "Title": "Will Data Center Unit Help NVIDIA Reach Its $65B Q4 Revenue Goal?",
      "URL": "https://finance.yahoo.com/news/data-center-unit-help-nvidia-130800874.html",
      "Content": "NVIDIA Corporation NVDA is set to report its fourth-quarter fiscal 2026 results on Feb. 25, and it would be no surprise if the company reaches another sales milestone and surpasses the $65 billion target. NVDA has been setting new sales records for the past few quarters. In the last reported financial results for the third quarter of fiscal 2026, its revenues reached a new record of $57.01 billion, reflecting a 62% year-over-year increase.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MU",
      "Date": "2026-02-13",
      "Time": "21:01:05",
      "Source": "Benzinga",
      "Title": "Micron Stock Surges, Morgan Stanley Says There's More Room To Run",
      "URL": "https://finance.yahoo.com/news/micron-stock-surges-morgan-stanley-130105334.html",
      "Content": "Micron Technology Inc (NASDAQ: MU ) stock is trading higher Wednesday after Morgan Stanley reiterated its Overweight rating and boosted its price target from $350 to $450. Here’s what you should know .\nWhy Micron Is Moving Higher Analyst Joseph Moore pointed to continued DRAM price strength and persistent supply shortages as the main reasons behind the improved outlook, Investing.com reported.\nDon't Miss:\nThe AI Marketing Platform Backed by Insiders from Google, Meta, and Amazon — Invest at $0.85/Share\nBefore the IPO: How One Company Quietly Locked Up 500+ Iconic Character Rights\nMorgan Stanley noted that mainstream DRAM prices could double again and still remain more than 10% below current spot levels, which continue to trend upward. Contract pricing has already climbed 86% since December, and the firm says buyers who waited too long to secure inventory are now paying close to high teens ASP per GB.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MU",
      "Date": "2026-02-13",
      "Time": "19:38:04",
      "Source": "Simply Wall St.",
      "Title": "AI Chips Today - Arteris Achieves Major Milestone With Network-On-Chip Technology",
      "URL": "https://finance.yahoo.com/news/ai-chips-today-arteris-achieves-113804839.html",
      "Content": "Arteris, Inc., a prominent semiconductor technology provider, has reached a significant milestone with its network-on-chip technology now deployed in over 4 billion chips and chiplets. This expansion reflects the growing adoption of Arteris' technology across a variety of sectors including AI-driven automotive, enterprise computing, and consumer electronics. The company's interconnect IP is increasingly crucial for modern AI-era chip designs, which demand high performance, energy efficiency, and complex system integration. As complex, multi-die architectures become more prevalent, Arteris' solutions are pivotal in facilitating the necessary data movement to meet rising performance and security standards in advanced systems.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-13",
      "Time": "14:56:33",
      "Source": "Yahoo奇摩股市",
      "Title": "鉅亨投資雷達》勞退自提6%值得嗎？還是自己投資比較好？",
      "URL": "https://tw.stock.yahoo.com/news/%E9%89%85%E4%BA%A8%E6%8A%95%E8%B3%87%E9%9B%B7%E9%81%94-%E5%8B%9E%E9%80%80%E8%87%AA%E6%8F%906-%E5%80%BC%E5%BE%97%E5%97%8E-%E9%82%84%E6%98%AF%E8%87%AA%E5%B7%B1%E6%8A%95%E8%B3%87%E6%AF%94%E8%BC%83%E5%A5%BD-065633362.html",
      "Content": "「我自己投資台股、美股，長期報酬不是更高嗎？」「而且勞退要等到退休才能領，資金完全被鎖住。」這是多數上班族面對勞退自提 6% 時的第一個疑問。勞退自提 6% 到底是不是一個「一定要做」的選擇？還是其實只適合某些人？\n1. 勞退基金是什麼？自提 6% 是什麼意思？\n依《勞工退休金條例》規定，雇主每月必須為勞工提繳薪資 6%，存入個人退休專戶，由勞動部勞動基金運用局統一管理，屬於個人帳戶制，就算公司倒閉也不影響這筆資金，離職後也仍會持續累積。 在雇主提繳之外，勞工可再自願提繳 1%～6% 的薪資，這就是所謂的「勞退自提」。自提金額不計入當年度薪資所得課稅，即稅前扣除，並設有最低收益保障機制，保證比定存好， 但資金須等符合法定退休條件後才能動用，且投資標的由政府統一運作。因此，自提 6% 的本質，是一種結合稅務優惠與強制儲蓄機制的退休準備工具。\n\n2. 什麼時候可以領？怎麼領？\n\n請領退休金課稅方式\n年滿 60 歲即可請領。年資不同，能選的領法不同：提繳年資滿 15 年以上：可選月領或一次領；未滿 15 年：原則一次領。\n「一次領」與「分期領（月領）」的差別在課稅方式不同。簡單說， 一次領是用「年資」去算免稅門檻，領越多、超過門檻的部分才會被計入所得；分期領則是每年先扣一個固定免稅額，超過的部分才算所得。\n舉例來說，假設工作 30 年退休，並選擇一次領取。免稅額度 = 19.8 萬 x 30 年 = 594 萬元。只要領取的退休金總額沒超過 594 萬元，就不須繳稅；若超過則按照級距有半額課稅或全額課稅的差別。如果選擇每月請領，免稅額度是看全年的請領總額，若不超過 85.9 萬元，則免課稅，一般來說這是不容易達到的課稅門檻。若好奇以目前薪資做自提，在退休後可以領到多少金額可以到 勞動部 網站做試算。\n3. 自提 6% vs 自己投資差在哪？\n我們直接用 2004 年至 2024 年的歷史實際資料來回測。假設每月投資 6,000 元，持續 20 年，分成兩種情境比較：第一種是每月把 6,000 元全額自提進勞退帳戶；第二種是不自提，而是把每月 6,000 元扣除當年度所得稅後的實際可投資金額，定期定額分別投資於台股、美股與美國科技股。\n從結果來看，成長型市場在這 20 年間確實累積出明顯優勢。即使在 40% 高稅率下，美國科技股約 833 萬元，仍高於勞退的 361 萬元，顯示報酬率對最終成果的影響相當關鍵。不過，隨著稅率提高，差距會逐步縮小。以台股為例，5% 稅率下最終約 738 萬元，但 40% 稅率時降至 466 萬元，與勞退 361 萬元的距離明顯拉近。 原因在於稅率越高，稅後可投入的本金越少，自提「完整投入」的優勢便開始浮現。因此，成長型資產決定長期累積速度，而稅率高低則影響起跑點。當稅率達 20% 以上時，自提的節稅優勢逐漸明顯化。\n不過，必須注意股票有崩盤並賠掉本金的風險，而勞退基金依法有「保證收益機制」 ，政府承諾就算勞退基金操盤賠得亂七八糟，最後結算給你的收益，絕對不會低於銀行定存利率。換句話說，這是一筆保證不賠本的投資。\n勞退自提與扣除稅率後投入股市的累積金額相比\n4. 我適合自提 6% 嗎？\n在討論自提之前，更重要的其實是檢視自己的理財習慣。如果單純追求長期報酬最大化，不自提、將扣稅後的資金持續投入高成長股市，理論上確實可能累積出更高的金額。但這個前提包含幾個條件：你能選到合適的標的、未來市場能延續過去的成長趨勢，以及你能在市場波動甚至大幅下跌時，仍然堅持定期定額、不恐慌贖回。此外，還有一個更現實的問題：每個月薪水發下來後，這筆原本打算投資的錢，是否真的會被確實投入，而不是被日常開銷慢慢侵蝕？\n如果你是一位具備良好投資紀律 、能長期執行計畫且能承受波動的投資人， 自行投資確實更具潛在成長空間 。但 如果對自己的執行力沒有那麼有把握 ，或擔心情緒影響決策，那麼 勞退自提的價值就在於把紀律制度化 。薪資尚未入帳即完成提撥，既節稅又強制儲蓄，讓退休準備成為一個穩定、持續的過程。\n再進一步來看， 如果你的適用稅率達 20% 以上 時，自提屬於稅前扣除，節稅效果會隨稅率提高而放大，對高稅率族群而言， 自提的優勢更加明顯 ；若 稅率較低，則節稅效益有限，建議優先建立緊急預備金與基本投資配置 ，再評估是否提高自提比例。\n鉅亨投資策略\n該不該自提 6%？依稅率與紀律做出適合的選擇\n若單純追求長期報酬最大化，自行投資高成長市場通常更具優勢；但若考量稅務效率、強制儲蓄與資產穩定性，自提 6% 仍有其制度價值。第一，先檢視自己的稅率與現金流狀況。第二，評估自身是否具備長期投資紀律與風險承受能力。第三，將自提視為退休配置的一部分，而非全部。成熟的退休規劃，不是二選一，而是在成長與穩定之間取得平衡。\n鉅亨精選基金\nA36004\n安聯台灣科技基金\n申購\nB32001\n東方匯理美國鋒裕股票\n申購\nA20106\n富邦 NASDAQ-100 指數基金 (本基金之配息來源可能為本金及收益平準金)\n申購\n「鉅亨買基金」獨立經營管理\n本資料僅供參考，「鉅亨買基金」已盡力就可靠之資料來源提供正確之意見與消息，但無法保證該等資料之完整性。\n依金融消費者保護法最新相關規定，為提供投資人更好的投資服務，本公司施行「投資屬性評估」程序，您於鉅亨買基金網站完成「投資風險適合度」評估，本公司將依客戶屬性做商品適合度規範並至少每年請您更新一次，若未能完成屬性評估屆時將會影響您的交易。\n基金交易係以長期投資為目的，不宜期待於短期內獲取高收益。任何基金單位之價格及其收益均可能漲或跌，故不一定能取回全部之投資金額。投資人申購前應自行了解判斷。\n外幣計價之基金，投資人須承擔取得收益分配或買回價金時轉換回新臺幣可能產生之匯率風險。若轉換當時之新臺幣兌換外幣匯率相較於原始投資日之匯率升值時，投資人將承受匯兌損失。\n各基金所採用之「公平價格調整」（或「反稀釋」）、短線交易及「價格調整機制（或「擺動定價」）」等機制，相關說明請詳各基金公開說明書。投資人應遵守基金公開說明書所列相關交易規定與限制。\n各基金經金管會核准或同意生效，惟不表示絕無風險。基金經理公司以往之經理績效不保證基金之最低投資收益；基金經理公司除盡善良管理人之注意義務外，不負責本基金之盈虧，亦不保證最低之收益，投資人申購前應詳閱投資人須知／基金公開說明書。投資人申購前應自行了解判斷。\n有關基金應負擔之費用（含分銷費用）已揭露於基金公開說明書及投資人須知，投資人可至 公開資訊觀測站 或 基金資訊觀測站 中查詢。\n由於非投資等級債券基金之信用評等未達投資等級或未經信用評等，且對利率變動的敏感度甚高，故非投資等級債券基金可能會因利率上升、市場流動性下降，或債券發行機構違約不支付本金、利息或破產而蒙受虧損。非投資等級債券基金不適合無法承擔相關風險之投資人，投資人投資以非投資等級債券基金為訴求之基金不宜占其投資組合過高之比重。部份基金或所投資之債券子基金，可能投資美國 Rule 144A 債券，該等債券屬私募性質，較可能發生流動性不足，財務訊息揭露不完整或因價格不透明導致波動性較大之風險，投資人須留意相關風險。\n基金投資於金融機構發行具損失吸收能力之債券（包括應急可轉換債券及具總損失吸收能力債券，下稱 CoCo Bond 及 TLAC 債券），當金融機構出現資本適足率低於一定水平、重大營運或破產危機時，得以契約形式或透過法定機制將債券減記面額或轉換股權，可能導致客戶部分或全部債權減記、利息取消、債權轉換股權、修改債券條件如到期日、票息、付息日、或暫停配息等變動。\n基金配息不代表基金實際報酬，且過去配息不代表未來配息；基金淨值可能因市場因素而上下波動。\n基金配息之配息率計算公式為「每單位配息金額 ÷ 除息日前一日之淨值 x100%」，含息報酬率計算為:[(除息日當月月底淨值 + 每單位配息金額) ÷ 前一月／三月／六月／一年底淨值 - 1]*100%。\n股票入息基金所稱之「入息」係指基金會使用符合其投資目標之衍生性工具，以產生額外之收入。為獲取較一致性之配息收入，除股票投資之資本利得及股息收益外，賣出短期選擇權之已實現權利金收入亦屬於基金之配息來源之一。基金之衍生性金融商品投資策略，包括賣出短期選擇權買權操作，與其他股票型基金特性不同，在市場短線大幅上漲時，可能導致基金績效落後於市場之情形。為尋求一致地於該期間每月向股東分配股息，基金之配息可能由本金支出；惟上述配息政策並不表示配息固定不變。基金投資全球股票市場，亦即基金投資人亦將承擔股票基金一般所應承擔之風險，不會因為衍生性金融商品的操作而有所降低。此外，投資人應留意衍生性工具操作與本策略所可能產生之投資風險 (詳見公開說明書或投資人須知)。\n部分基金配息前未先扣除應負擔之相關費用。基金的配息可能由基金的收益或本金中支付。任何涉及由本金支出的部份，可能導致原始投資金額減損。各基金由本金支付配息之相關資料，投資人可至各投信基金公司及總代理人網站查詢。\n基金涉及投資新興市場部份，因其波動性與風險程度可能較高，且其政治與經濟情勢穩定度可能低於已開發國家，也可能使資產價值受不同程度之影響。依金管會規定：\n投信基金直接投資大陸地區有價證券僅限掛牌上市有價證券，投資人須留意中國市場特定政治、經濟與市場等投資風險。\n境外基金直接投資大陸地區證券市場之有價證券以掛牌上市有價證券及銀行間債券市場為限，且投資總金額不得超過本基金淨資產價值之百分之二十。但若該年度獲得境外基金深耕計畫認可者不在此限，比例得放寬至百分之四十。另投資人亦須留意中國市場特定政治、外匯、經濟與市場等投資風險。\n本文提及之經濟走勢預測不必然代表基金之績效，基金投資風險請詳閱基金公開說明書。\n投資人因不同時間進場，將有不同之投資績效，過去之績效亦不代表未來績效之保證。\n投資人應注意貨幣基金投資之風險包括利率風險、債券交易市場流動性不足之風險及投資無擔保公司債之風險；本基金或有因利率變動、債券交易市場流動性不足及定期存單提前解約而影響基金淨值下跌之風險，同時或有受益人大量贖回時，至延遲給付贖回價款之可能。\n風險報酬等級係依基金類型、投資區域或主要投資標的／產業，由低至高，區分為 RR1~RR5 五個風險報酬等級。RR 係計算過去五年基金淨值波動度標準差，以標準差區間予以分類等級，基金成立未滿五年，將以較短區間或適當參考標的作為評估標準。此等級分類係基於一般市場狀況反映市場價格波動風險，無法涵蓋所有風險 (如：基金計價幣別匯率風險、投資標的產業風險、信用風險、利率風險、流動性風險等)，亦不宜作為投資唯一依據，投資人應充分評估基金之投資風險。基金主要相關投資風險（如信用風險、流動性風險… 等）已揭露於基金公開說明書或投資人須知。其他相關資料(如年化標準差、Alpha、Beta 及 Sharp 值等) 可至中華民國投信投顧公會網站「 基金績效及評估指標查詢專區 」查詢。\n上述資料來源僅供投資人參考，惟相關資訊仍應以各基金公司公告為準。如有任何疏漏錯誤，本公司或關係企業與其任何董事或任何受僱人恕不負任何法律責任。\n有關基金之 ESG 資訊，投資人應於申購前詳閱基金公開說明書或投資人須知所載之基金所有特色或目標等資訊，基金 ESG 資訊可查詢 基金資訊觀測站 。\n投資人申購基金係持有基金受益憑證，而非本文提及之投資資產或標的; 投資人應留意衍生性工具 / 證券相關商品等槓桿投資策略所可能產生之投資風險 (詳見公開說明書或投資人須知)。\n鉅亨證券投資顧問股份有限公司 │ 客服信箱：cs@anuefund.com.tw\n公司地址：台北市信義區松仁路 89 號 18 樓 B 室 │ 服務專線：(02)2720-8126 │ 服務時間：09:00-17:00\n更多鉅亨報導\n\n檢視留言\n\n相關內容\n只有一天也要！春節打工兼職多 勞動部：雇主需替員工加保3種險 隨著農曆春節到來，各賣場、年貨大街人聲鼎沸，許多商家都會僱用短期、臨時工作人員協助銷售，產生許多兼職、打工機會。勞動部提醒，即使是短期或臨時性僱用的勞工，無論工作時間長短，雇主都應該在勞工到職當日依規定申報參加勞保、就保、災保、勞退，至離職當日申報退保及停繳退休金，以保障勞工權益並避免受罰。\nYahoo股市 ・ 17 小時前 ・ 發表留言\n\n《社會》小年夜首列國定假日 勞動部：雇主應依法給薪、假 【時報-台北電】春節將至，今年勞工可連休九天，勞動部12日指出，小年夜、除夕及春節的大年初一至初三均為法定休假日，雇主應依法給假並支付工資。依《勞動基準法》第37條規定，內政部公告之紀念日、節日、勞動節及其他中央主管機關指定放假日，均屬應放假日，且工資照給。 勞動部勞動條件及就業平等司指出，國定假日如果是勞工的工作日，雇主需給假，勞工若同意在休假日出勤，工資則須依法加倍發給。若放假日碰上例假或休息日，雇主應於其他工作日補假，補假當日性質視同國定假日，工資同樣照給，若補假日仍出勤，工資也應加倍計算。 勞動部指出，民間企業多比照政府機關出勤模式，周一至周五為工作日、周六休息、周日例假。今年小年夜在15日為例假，若勞雇雙方協商，補假可安排在2月20日，形成春節九天連假。 若雇主需勞工於連假期間加班，2月14日、2月21日為休息日，需依《勞基法》第24條第2項規定給薪；2月16日至2月20日（含補假）為國定假日，則依《勞基法》第39條規定，加班工資須加倍支付。另外，2月15日及2月22日為例假，除天災或突發事件，雇主不得要求勞工出勤。 勞動部表示，企業營運模式及排班多元，例假或休息日不一定落在\n時報資訊 ・ 1 天前 ・ 發表留言\n\n衝擊30萬車業勞工！勞長籲業者「穩定人事、安心工作」明將與6大汽車工會座談 攸關 2500 廠、30 萬就業人口的汽車關稅，經濟部長龔明鑫與勞動部長洪申翰今 (10) 日共同出席汽車業座談會，針對調降汽車關稅議題與業者達成初步共識。龔明鑫指出，根據智庫模型推估，降稅對產業產值的影響約為 1.1% 至 1.9% 之\n鉅亨網 ・ 3 天前 ・ 1 則留言\n\n台美ART簽署　禁強迫勞動產品輸入、降組工會門檻 （中央社記者吳欣紜台北2026年02月13日電）台美簽署台美對等貿易協定，勞權保障也有合作共識，勞動部今天表示，將禁止強迫勞動產品輸入，3年內禁止對製造業及漁業移工收取招募費，並降低中小企業勞工籌組工會門檻。行政院副院長鄭麗君率領談判團隊與美方就「台美對等貿易協定（Agreement on Reciprocal Trade，簡稱ART）」達成共識，後續並共同見證駐美國台北經濟文化代表處代表俞大(水雷)、美國在台協會（AIT）華盛頓總部執行理事藍鶯完成簽署「台美對等貿易協定」。除了外界關注的美製車是否降為零關稅、農產品市場如何開放外，台美就台灣勞動權益保障方面也達成合作共識，將透過接軌國際要求，進一步強化勞工權益。勞動部發布新聞稿指出，為了協助產業降低強迫勞動與經營風險，將循國內審議程序採認美國關稅法第307條認定的強迫勞動產品禁止輸入台灣，也將修法禁止留置勞工身分證件、3年內落實禁止對製造業及漁撈業移工收取招募費等，以及5年內逐步精進勞工結社權等。勞動部說明，將循國內程序進行認定，禁止強迫勞動產品輸入，保障台灣產業成為國際認可的優質供應鏈，也將於3年內落實禁止對製造業及漁撈業移工額外收\n中央社財經 ・ 1 天前 ・ 發表留言\n\n現身經部汽車關稅座談 洪申翰：將加大協助汽車業勞工 經濟部10日召開「臺美關稅談判車輛產業影響說明及後續措施座談會」。勞動部長洪申翰受邀參與座談，並於會後受訪指出，稍早在現場已和車廠經營方表達勞工希望能穩定就業，也有感受到資方正面回饋；明日將在勞動部與汽車產業的工會進行座談，聽取勞方意見。\n中時財經即時 ・ 3 天前 ・ 發表留言\n\n台美關稅拍板》關稅協定納勞權條款！勞動部啟動四大改革接軌國際 台美對等貿易協定（ART）已於台灣時間2月13日完成簽署，內容明確要求台灣勞動標準需與國際接軌。勞動部長洪申翰13日指出，未來將以防制強迫勞動、改革移工招募制度、精進勞工結社權，及強化產業與勞工支持配套，四大面向推動法制調適，在確保供應鏈符合國際人權標準的同時，協助產業穩定轉型。\n中時財經即時 ・ 21 小時前 ・ 發表留言\n\n美製車零關稅衝擊國內汽車業? 勞動部.經濟部:輔導轉型 財經中心／楊思敏、李奇 台北報導台美對等貿易協定即將簽署，美製車進口關稅是否調降為0，引發關注。日前車輛公會擔憂，會影響國內2700家零組件廠商和30萬勞工家庭。週三，政府再度與產業代表座談，經濟部準備30億，補助業者研發轉型，勞動部也會動用特別預算，給勞工最大協助。\n民視財經網 ・ 2 天前 ・ 發表留言\n\n《經濟》美車叩關 經部備30億金援 【時報-台北電】行政院副院長鄭麗君率隊赴美，台美關稅談判協議進入最後關鍵之際，經濟部與勞動部10日連手邀集汽車產業代表商議。經濟部長龔明鑫指出，經濟部高度重視汽車產業所受影響，特別委請智庫評估，研判對美汽車進口關稅最極端狀況，將影響國內汽車產業產值逾1％。為此，經濟部擬匡列30億元專款，後續產業有需求時可提供協助。 另據了解，同樣針對汽車產業的衝擊，勞動部今（11）日將與六大汽車產業工會進行座談。 此一跨部會舉行的閉門會議，龔明鑫說，主要是預估對美汽車進口關稅最極端的模型下，對國內汽車產業整體產值影響程度，他認影響可控，但也指出此為短期評估結果。由於目前美國進口多屬於高單價車款，國產車相對平價，市場本就有區隔，預估短期衝擊相對小，至於中長期的影響，要視國際車廠產能調配後再持續觀察，而提供給美國汽車進口的低關稅，其他國家不會比照辦理。 龔明鑫強調，雖然看起來台灣像是要對美國汽車進口有所開放，不過，實際上許多國內廠商亦提出外銷計畫，意即不僅只是固守台灣市場而已，經濟部對這些構想會提供協助，並告訴業者，已預備匡列30億元款項，準備專款支持汽車與相關零組件發展。 經濟部表示，汽車產業做為我國工\n時報資訊 ・ 3 天前 ・ 發表留言\n\n美車叩關 經部備30億金援 行政院副院長鄭麗君率隊赴美，台美關稅談判協議進入最後關鍵之際，經濟部與勞動部10日連手邀集汽車產業代表商議。經濟部長龔明鑫指出，經濟部高度重視汽車產業所受影響，特別委請智庫評估，研判對美汽車進口關稅最極端狀況，將影響國內汽車產業產值逾1％。為此，經濟部擬匡列30億元專款，後續產業有需求時可提供協助。\n工商時報 ・ 3 天前 ・ 發表留言\n\n勞、經部會挺車業！爭取150億保勞工「續留原職場」經部補助與就業權益「掛鉤」 針對美製車零關稅進口談判引發的產業衝擊，勞動部長洪申翰今 (11) 日與六大車業工會代表座談，強調政府將以跨部會協作模式作為產業與勞工的後盾。除經濟部已規劃 30 億研發轉型補助計畫，並承諾將補助款與「勞工就業權益」掛鉤；勞\n鉅亨網 ・ 2 天前 ・ 發表留言\n\n貿易協定納勞權條款 勞動部4大改革接軌國際 台美對等貿易協定（ART）明確要求台灣勞動標準需與國際接軌。勞動部長洪申翰13日指出，勞動部將以防制強迫勞動、改革移工招募制度、精進勞工結社權，及強化產業與勞工支持配套，四大面向推動法制調適，在確保供應鏈符合國際人權標準的同時，協助產業穩定轉型。\n工商時報 ・ 5 小時前 ・ 發表留言\n\n《產業》美車零關稅 本土車廠勞工憂失業 【時報-台北電】台美將簽署貿易協定，面對美製車關稅降為零，本土車廠工會最擔心勞工工作權受影響，勞動部承諾將與經濟部研議，對給予本土車廠轉型、研發的30億，除落實監督、管考，並與勞工權益連結。勞動部也將爭取特別預算，協助汽車業勞工提升專業技能、優先續留原產業，並規畫於年後展開勞資政社會對話，盼產業調適過程不要遺落勞工權益。 勞動部昨與台灣本田、裕隆、中華、三陽、國瑞、福特六和等6大車廠工會召開內部座談會，經歷2小時討論，部長洪申翰會後表示，6大車廠工會多關注經濟部編列30億補助，如何能與勞工就業權益做連結，避免業者一面拿補助，另一方面卻忽視勞工權益，希望產業調適過程中，不遺落勞工權益。 經濟部次長江文若則表示，汽車產業是我國工業火車頭，政府會挺企業、員工，而工會希望30億補助能有監督、管考，絕對會做到，以及補助與勞工就業權益連結，也將盡速研議。 台灣本田公司企業工會理事長孫傳泰表示，最擔心勞工工作權受影響，政府會中承諾不會放棄汽車產業，「這是我們最想要聽到」，不過汽車產業多為國際工廠、品牌商，可能將部分車種移到美國生產，對台灣產業造成影響，政府能否支持汽車產業在台灣落地，他們相當關心，不\n時報資訊 ・ 2 天前 ・ 1 則留言\n\n經濟部助汽車業轉型 勞動部將助勞工技能提升 （中央社記者吳欣紜台北2026年2月11日電）台美對等貿易協定即將簽署，經濟部匡列新台幣30億元支持產業轉型，勞動部長洪申翰今天說，將用特別預算支持勞工專業技能提升，並有讓汽車業勞工續留職場的支持方案。台美對等貿易協定即將簽署，美製車進口是否零關稅外界高度關注，經濟部初步匡列新台幣30億元支持國內汽車及零組件產業轉型。考量勞工權益可能受影響，勞動部今天邀集6大車廠工會針對關稅可能造成汽車產業勞工衝擊進行座談，會議歷時約2小時，除洪申翰外，經濟部次長江文若、經濟部產發署副署長鄒宇新及交通部均代表出席。洪申翰會後接受媒體聯訪時指出，6大工會代表於會中皆有提出，給予產業支持的30億經費應有明確監督機制，盼給產業支持同時，也關注勞工就業權益，因此勞動部後續會跟經濟部共同研議30億特別預算如何跟勞工就業權益連結，不希望有業者一面拿補助又對勞工不利。洪申翰也說，台美談判最後階段仍在進行中，美方確實有要求比照其他國家開放市場，因此必須預先設想各種情境，經濟部有給予產業的協助方案，包含產業研發轉型提高競爭力，勞動部後續也會用特別預算支持勞工在專業技能的提升，「會全力來協助」。洪申翰也說，特別預算將有針\n中央社財經 ・ 2 天前 ・ 發表留言\n\n〈對等關稅拍板〉勞權是打國際賽「標配」！勞部推車業3大支持措施 3年內禁移工招募費 行政院副院長鄭麗君與經貿辦總談判代表楊珍妮率團完成簽署，除取得半導體及資通訊產品的最優惠待遇外，勞動部長洪申翰今 (13) 日強調，勞權接軌國際是打國際賽的標配。政府將於三年內禁止對移工收取招募費，五年內精進勞工結社權並調適\n鉅亨網 ・ 21 小時前 ・ 發表留言\n\n經部邀各大車廠座談 勞長洪申翰出席曝：勞動部明日召開 經濟部今（10）日召開「台美關稅談判車輛產業影響說明及後續措施座談會」，由經濟部長龔明鑫親自主持，除廣邀9大車廠、汽車協會外，勞動部長洪申翰也出席，表示明天勞動部也將與各大車廠工會理事長召開座談會。\nYahoo股市 ・ 3 天前 ・ 2 則留言\n\n美製進口車「零關稅」倒數？經濟部產發署提1計畫：背水一戰 即時中心／黃于庭報導台美關稅談判日前正式拍板，稅率調降為15%且不疊加，我國也將以「台灣模式」與美方合作，2,500億美元由台灣企業直接自主投資，另由政府銀行融資信保支持2,500億美元。外界關注美製車關稅細節，更有傳聞指出可朝向「零關稅」邁進。對此，經濟部產發署長邱求慧坦言，這確實成為台美協議中的一項隱憂，對於台灣汽車產業來說是背水一戰。\n民視財經網 ・ 1 天前 ・ 發表留言\n\n國旅太貴? 出國萬元搞定吸遊客 人力銀行公開合理預算 財經中心／陳孟暄 葉晏昇 台北報導9天春節連假倒數計時！國人瘋出國，根據觀光署統計，去年出國旅遊超過1800萬人次，創歷史新高。最新一份調查還顯示，春節只有4成3民眾打算安排國旅。有人分享，3天2夜行程，單純爬玉山一人就花超過5千元，跟飛一趟泰國清邁差不多。人力銀行則說，兩天一夜1人3千元，民眾會認為比較合理。\n民視財經網 ・ 1 天前 ・ 發表留言\n\n〈美股早盤〉市場靜待CPI報告出爐 主要指數小幅走高 美股主要指數周四 (12 日) 開盤小幅走高，在前一日強勁的就業數據與失業率下滑緩解市場對經濟放緩的疑慮後，投資人轉而聚焦即將公布的消費者物價指數 (CPI) 與企業財報表現。隨著債市走勢趨於穩定，交易員觀望通膨壓力是否持續降溫，\n鉅亨網 ・ 1 天前 ・ 發表留言\n\n「500元運動幣」今抽籤！1招秒查中籤結果 領取、使用方法一次看 運動幣抽籤時間就在今（12）天！為落實全民運動政策目標，運動部預計發放60萬份面額500元的「運動幣」。至於運動幣中籤結果該如何查詢、使用，《東森財經新聞》記者為大家整理好「運動幣懶人包」，讓大家一看就懂！\nEBC東森財經新聞 ・ 1 天前 ・ 3 則留言\n\n避險資產不避險？市場重新評估美元、日元與瑞郎地位 經過動盪的一年，傳統上被視為「避險天堂」的貨幣正遭遇前所未有的挑戰，三大避險貨幣——美元、日元與瑞士法郎——的穩定性，正出現分歧。 美元跌勢不止：關稅政策與債務憂慮 美國總統川普在 2025 年以關稅政策重塑全球貿易，卻也引發「拋售美國」(Sell Amer\n鉅亨網 ・ 5 小時前 ・ 發表留言\n\n熱門新聞\n1\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 2\n\n13.5億威力彩「2得主」買法一模一樣！ 只花100元就翻身 3\n\n郭台銘大紅包發威！央行新台幣發行額首破4.2兆  年增率飆3年最高 4\n\n「新版新台幣」可能有石虎！票選結果曝光 台積電僅排第七 5\n\n【房地產週報】輝達簽約落腳北士科！29年最大交屋潮來襲！新竹預售屋慘崩82.3%！七大都會區交易量年減7成\n\n你可能會喜歡\n你上車了嗎？記憶體登蛇年狂飆主力　前10猛將全曝光 FTNN新聞網\n\n九大工業公會聯合肯定台美貿易協定 強調為產業注入強心針 民視財經網\n\n春節搭車風險升溫！行車保護傘保障出行　花1元即可享百萬保障 三立新聞網 setn.com\n\n「台灣價值」竟沒台灣之光！大盤飆新高00940卻回不到10元　股民哀號：成敗皆這1檔 鏡週刊Mirror Media\n\n緝捕馬杜洛震驚全球 美軍傳動用AI工具Anthropic Claude 鉅亨網\n\n信義房屋：年前家電、家具換新需求高 今日新聞NOWNEWS\n\n台股拉警報！專家警告美股7巨頭集體翻車：最慘開年行情 中時財經即時\n\n鄭麗君團隊立大功！謝金河曝「台美ART簽署」意義：台灣獲1席珍貴位子 三立新聞網 setn.com\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 工商時報\n\n租屋族省很大！租金補貼減輕4成負擔 女性與25歲以下青年成主力 太報\n\n法人兩樣情！華邦電發說利多連發...目標價上看200元 　保守派「4理由」只喊88元 FTNN新聞網\n\n美股掀AI恐慌交易　台積電ADR挫0.47％ CTWANT\n\n陸客不去日本！外媒爆25萬大軍「改衝這國」 刷爆103億不手軟 中時財經即時\n\n外食族吃不消! 海南雞飯漲20元 手搖飲過年期間漲5元 民視財經網影音\n\n金蛇年「大漲萬點」封關！0050領銜市值型ETF悍漲　近十年含息報酬率高達509% FTNN新聞網\n\n台灣賓士對「台美貿易協議」成功達成表達祝賀 並承諾回饋消費者 民視財經網\n\n聯電ADR13日上漲0.13美元漲幅1.26%折台股65.68元 中央社財經\n\n砸5億擴產最快Q2釋產能！PCB股華通衝連3漲　當沖爆量破5萬張登當沖王 FTNN新聞網\n\n輝達下跌、AMD上漲 背後關鍵或在Arista 鉅亨網\n\n美通膨降溫難掩「AI恐慌」! 美股漲跌互見、台積電ADR下跌0.51％ 新頭殼\n\n台美ART簽署》台經院張建一妙喻：台灣付的午餐費 比別人還低 工商時報\n\n大研生醫* 公告本公司股票面額由「新台幣10元」變更為「新台幣1元」，公告期間：114年12月22日至115年3月21日。 Moneydj理財網\n\n外資降評唱衰！大咖投顧逆風喊買面板指標大廠「這檔」　最新目標價曝光 FTNN新聞網\n\n春節放假也能追美股！內部數據曝光　過年反而更敢買 三立新聞網 setn.com\n\n記憶體嚴重短缺！美國軍工企業黑名單 移除中國長鑫、長江存儲 自由時報\n\n運載指標／港務公司貨櫃量上看1,390萬TEU 今日新聞NOWNEWS\n\n關稅干擾消失加AI助攻　經濟成長率上修至7.71％ 卡優新聞網\n\n蘇威元：台積電概念股飆漲密碼 這四指標抓飆股一次賺58% 民視財經網影音\n\n主動式ETF規模破1739億！這檔年化配息率10％　豪配0.377元「年後這天」最後上車日 FTNN新聞網\n\n到全台最夯紫南宮借發財金　主委莊秋安：心存善念有來有保庇 鏡報\n\n新北房市 新莊幸福路商圈 成家首選 工商時報\n\n台美ART 守住重要農產品防線 工商時報\n\n〈能源盤後〉油價因美通膨趨緩回升 周線仍收黑 鉅亨網\n\n13家金控1月獲利全公布！國泰金元月大賺146億元　EPS達0.99元登獲利王 FTNN新聞網\n\n美通膨降溫難掩AI隱憂　美股漲跌互見 太報\n\n〈貴金屬盤後〉黃金、白銀回神 CPI重燃降息預期 鉅亨網\n\n傳統軟體股崩跌回五年前！卡爾先生：掌握這兩點才能存活 民視財經網影音\n\n台股資料來源 臺灣證券交易所 、 臺灣期貨交易所 及 財團法人中華民國證券櫃檯買賣中心 ，國際股市資料來源請參考 Yahoo Finance 。台股行情、個股基本資料及財務資訊為精誠資訊提供。使用Yahoo股市服務前，請您詳閱相關 使用規範與聲明 。\n\n服務條款 隱私權 您的隱私權選擇 加州隱私權通知 © 2026 Yahoo. All rights reserved.\n\n1",
      "Language": "zh",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-13",
      "Time": "14:55:18",
      "Source": "Yahoo奇摩股市",
      "Title": "鉅亨雙週報》AI股震盪、利率預期翻轉與日英政治巨浪",
      "URL": "https://tw.stock.yahoo.com/news/%E9%89%85%E4%BA%A8%E9%9B%99%E9%80%B1%E5%A0%B1-ai%E8%82%A1%E9%9C%87%E7%9B%AA-%E5%88%A9%E7%8E%87%E9%A0%90%E6%9C%9F%E7%BF%BB%E8%BD%89%E8%88%87%E6%97%A5%E8%8B%B1%E6%94%BF%E6%B2%BB%E5%B7%A8%E6%B5%AA-065518136.html",
      "Content": "這兩週市場同時遭受 AI 海嘯、利率轉向與政治黑天鵝接連衝擊。美國聯準會立場轉鷹，川普提名前理事華許接掌聯準會主席，加上英國工黨面臨執政危機，以及日本高市早苗政府在大選勝出後，形同獲得一張擴張財政與強硬外交的空白支票。同時，從比特幣到白銀都在上演高台跳水，投資人忽然想起本益比三個字。當股匯債與原物料同步劇烈波動，這波震盪到底是短期情緒，還是新一輪景氣與政策循環的序曲？\n1. 利率與聯準會市場從等降息變成別作夢\n\n鮑爾在一月會議後明確表示經濟明顯改善且就業穩健，等於把上半年降息空間先行封鎖，聯邦基金期貨也乖乖把降息預期往後延。川普拋出凱文華許作為新任聯準會主席提名人選，市場開始重新計算未來利率路徑與美元走勢。降息不再是何時開始，而是會不會比想像中更少。在這種情況下，高估值科技股首當其衝，標普五百與那斯達克連日回檔。避險情緒升高卻無處躲避，連黃金都被追繳保證金的賣壓波及，提醒投資人利率週期尚未轉向。\n\n2. AI 熱潮與科技股從萬能解答變成估值殺手\nAI 依舊是故事主角，但這回是以反派姿態上場。Anthropic 推出新工具後，市場開始認真計算如果 AI 能寫程式、審合約與處理資料，那些靠人力與訂閱服務生存的軟體公司，未來利潤如何支撐股價？結果美國軟體股單日蒸發 2,850 億美元市值。另一邊 SpaceX 收購 xAI，Meta 與甲骨文大舉投入重金建置 AI 基礎設施，說明資本支出仍在加碼，但股價卻因利率與估值承壓。簡單說 AI 長期前景亮眼，短期卻淪為回檔藉口，尤其是漲多的美股科技龍頭。\n3. 地緣政治與政策英日劇烈轉向、川習再度交鋒\n政治局勢完全沒有平息跡象。英國工黨幕僚長請辭，首相史塔默的人事與外交任命陷入風暴，執政穩定性遭質疑，英鎊與英國資產面臨折價風險。相反地日本眾議院選舉讓高市早苗大勝，市場解讀為日本將大開財政大門。擴張財政、國防支出與更鷹派的外交路線，對日股與日債殖利率都是強烈訊號。川普與習近平通話再度把焦點拉回貿易與台海，從大豆、石油到軍事溝通，全都牽動資金對台灣與中國資產的風險溢酬定價。中東方面，美伊在阿曼預備重啟核談，若有進展，能源供給風險可望緩和，但在那之前，油價仍對任何飛彈或談判破局高度敏感。\n4. 資產波動加密貨幣、高貴金屬與飆過頭的銅\n在利率高檔震盪與 AI 泡沫疑慮雙重壓力下，風險資產首先重挫。比特幣單日重挫約一成，白銀一度暴跌兩成，黃金也被拖下水，說明這一輪不是避險買盤，而是去槓桿化。同時前一波在中國投機資金推升下大漲的銅價，也被重新檢驗基本面。中國製造業 PMI 再度掉回預警區間，地方財政與信用風險消息不斷，讓中國需求復甦這個論點顯得底氣不足。相較之下，台灣因 AI 供應鏈帶動，上調成長預測。美日股也在震盪中維持中長期成長趨勢。市場開始用更苛刻但理性的眼光，選擇繼續追求成長或先保留現金。\n鉅亨投資策略\n在震盪中聚焦核心資產，避免盲目進場\n在利率延長賽與 AI 估值修正下，美股、日股與台股因經濟與產業結構具備成長動能，中長期持續看好，但短期需接受劇烈波動，特別是高本益比科技股的修正過程。大宗商品方面，貴金屬與工業金屬近期價格大起大落，既反映槓桿去化，也暴露出市場對全球需求的疑慮，配置上建議相對保守，以避險與分散投資為主，而非短線追價。\n鉅亨精選基金\nA36004\n安聯台灣科技基金\n申購\nB32001\n東方匯理美國鋒裕股票\n申購\nB15112\n富蘭克林坦伯頓 - 日本\n申購\n「鉅亨買基金」獨立經營管理\n本資料僅供參考，「鉅亨買基金」已盡力就可靠之資料來源提供正確之意見與消息，但無法保證該等資料之完整性。\n依金融消費者保護法最新相關規定，為提供投資人更好的投資服務，本公司施行「投資屬性評估」程序，您於鉅亨買基金網站完成「投資風險適合度」評估，本公司將依客戶屬性做商品適合度規範並至少每年請您更新一次，若未能完成屬性評估屆時將會影響您的交易。\n基金交易係以長期投資為目的，不宜期待於短期內獲取高收益。任何基金單位之價格及其收益均可能漲或跌，故不一定能取回全部之投資金額。投資人申購前應自行了解判斷。\n外幣計價之基金，投資人須承擔取得收益分配或買回價金時轉換回新臺幣可能產生之匯率風險。若轉換當時之新臺幣兌換外幣匯率相較於原始投資日之匯率升值時，投資人將承受匯兌損失。\n各基金所採用之「公平價格調整」（或「反稀釋」）、短線交易及「價格調整機制（或「擺動定價」）」等機制，相關說明請詳各基金公開說明書。投資人應遵守基金公開說明書所列相關交易規定與限制。\n各基金經金管會核准或同意生效，惟不表示絕無風險。基金經理公司以往之經理績效不保證基金之最低投資收益；基金經理公司除盡善良管理人之注意義務外，不負責本基金之盈虧，亦不保證最低之收益，投資人申購前應詳閱投資人須知／基金公開說明書。投資人申購前應自行了解判斷。\n有關基金應負擔之費用（含分銷費用）已揭露於基金公開說明書及投資人須知，投資人可至 公開資訊觀測站 或 基金資訊觀測站 中查詢。\n由於非投資等級債券基金之信用評等未達投資等級或未經信用評等，且對利率變動的敏感度甚高，故非投資等級債券基金可能會因利率上升、市場流動性下降，或債券發行機構違約不支付本金、利息或破產而蒙受虧損。非投資等級債券基金不適合無法承擔相關風險之投資人，投資人投資以非投資等級債券基金為訴求之基金不宜占其投資組合過高之比重。部份基金或所投資之債券子基金，可能投資美國 Rule 144A 債券，該等債券屬私募性質，較可能發生流動性不足，財務訊息揭露不完整或因價格不透明導致波動性較大之風險，投資人須留意相關風險。\n基金投資於金融機構發行具損失吸收能力之債券（包括應急可轉換債券及具總損失吸收能力債券，下稱 CoCo Bond 及 TLAC 債券），當金融機構出現資本適足率低於一定水平、重大營運或破產危機時，得以契約形式或透過法定機制將債券減記面額或轉換股權，可能導致客戶部分或全部債權減記、利息取消、債權轉換股權、修改債券條件如到期日、票息、付息日、或暫停配息等變動。\n基金配息不代表基金實際報酬，且過去配息不代表未來配息；基金淨值可能因市場因素而上下波動。\n基金配息之配息率計算公式為「每單位配息金額 ÷ 除息日前一日之淨值 x100%」，含息報酬率計算為:[(除息日當月月底淨值 + 每單位配息金額) ÷ 前一月／三月／六月／一年底淨值 - 1]*100%。\n股票入息基金所稱之「入息」係指基金會使用符合其投資目標之衍生性工具，以產生額外之收入。為獲取較一致性之配息收入，除股票投資之資本利得及股息收益外，賣出短期選擇權之已實現權利金收入亦屬於基金之配息來源之一。基金之衍生性金融商品投資策略，包括賣出短期選擇權買權操作，與其他股票型基金特性不同，在市場短線大幅上漲時，可能導致基金績效落後於市場之情形。為尋求一致地於該期間每月向股東分配股息，基金之配息可能由本金支出；惟上述配息政策並不表示配息固定不變。基金投資全球股票市場，亦即基金投資人亦將承擔股票基金一般所應承擔之風險，不會因為衍生性金融商品的操作而有所降低。此外，投資人應留意衍生性工具操作與本策略所可能產生之投資風險 (詳見公開說明書或投資人須知)。\n部分基金配息前未先扣除應負擔之相關費用。基金的配息可能由基金的收益或本金中支付。任何涉及由本金支出的部份，可能導致原始投資金額減損。各基金由本金支付配息之相關資料，投資人可至各投信基金公司及總代理人網站查詢。\n基金涉及投資新興市場部份，因其波動性與風險程度可能較高，且其政治與經濟情勢穩定度可能低於已開發國家，也可能使資產價值受不同程度之影響。依金管會規定：\n投信基金直接投資大陸地區有價證券僅限掛牌上市有價證券，投資人須留意中國市場特定政治、經濟與市場等投資風險。\n境外基金直接投資大陸地區證券市場之有價證券以掛牌上市有價證券及銀行間債券市場為限，且投資總金額不得超過本基金淨資產價值之百分之二十。但若該年度獲得境外基金深耕計畫認可者不在此限，比例得放寬至百分之四十。另投資人亦須留意中國市場特定政治、外匯、經濟與市場等投資風險。\n本文提及之經濟走勢預測不必然代表基金之績效，基金投資風險請詳閱基金公開說明書。\n投資人因不同時間進場，將有不同之投資績效，過去之績效亦不代表未來績效之保證。\n投資人應注意貨幣基金投資之風險包括利率風險、債券交易市場流動性不足之風險及投資無擔保公司債之風險；本基金或有因利率變動、債券交易市場流動性不足及定期存單提前解約而影響基金淨值下跌之風險，同時或有受益人大量贖回時，至延遲給付贖回價款之可能。\n風險報酬等級係依基金類型、投資區域或主要投資標的／產業，由低至高，區分為 RR1~RR5 五個風險報酬等級。RR 係計算過去五年基金淨值波動度標準差，以標準差區間予以分類等級，基金成立未滿五年，將以較短區間或適當參考標的作為評估標準。此等級分類係基於一般市場狀況反映市場價格波動風險，無法涵蓋所有風險 (如：基金計價幣別匯率風險、投資標的產業風險、信用風險、利率風險、流動性風險等)，亦不宜作為投資唯一依據，投資人應充分評估基金之投資風險。基金主要相關投資風險（如信用風險、流動性風險… 等）已揭露於基金公開說明書或投資人須知。其他相關資料(如年化標準差、Alpha、Beta 及 Sharp 值等) 可至中華民國投信投顧公會網站「 基金績效及評估指標查詢專區 」查詢。\n上述資料來源僅供投資人參考，惟相關資訊仍應以各基金公司公告為準。如有任何疏漏錯誤，本公司或關係企業與其任何董事或任何受僱人恕不負任何法律責任。\n有關基金之 ESG 資訊，投資人應於申購前詳閱基金公開說明書或投資人須知所載之基金所有特色或目標等資訊，基金 ESG 資訊可查詢 基金資訊觀測站 。\n投資人申購基金係持有基金受益憑證，而非本文提及之投資資產或標的; 投資人應留意衍生性工具 / 證券相關商品等槓桿投資策略所可能產生之投資風險 (詳見公開說明書或投資人須知)。\n鉅亨證券投資顧問股份有限公司 │ 客服信箱：cs@anuefund.com.tw\n公司地址：台北市信義區松仁路 89 號 18 樓 B 室 │ 服務專線：(02)2720-8126 │ 服務時間：09:00-17:00\n更多鉅亨報導\n\n檢視留言\n\n相關內容\n避險情緒增 債券配置更顯重要 首選推全球複合債基金 川普宣布新任聯準會主席人選華許 (Kevin Warsh) 後，華許過往偏向鷹派的態度導致市場降息預期大減，股市與貴金屬、加密貨幣等均出現震盪回檔，債市表現相對溫和，其中新興與邊境債市仍持續走高。野村投信表示，無論由誰擔任聯準會主席，在美國經濟表現強韌、通膨受控有望緩降的環境下，美國利率走低是\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n《基金》AI長趨勢不變 多重資產基金穩中求勝 【時報-台北電】川普宣布提名華許，市場對未來貨幣政策可能轉趨強硬的討論升溫，金融市場波動風險隨之提高。回顧歷史，聯準會主席更替往往伴隨政策風向調整，利率政策仍具不確定性，透過同時布局股票、債券及多元主題資產的多重資產型基金，作為投資組合核心配置之一，有助分散單一資產波動，提升整體投資穩定度。 富邦AI智能新趨勢多重資產型基金經理人高皓欣表示，從總體經濟觀察，全球經濟動能仍具韌性，美國2026年GDP預估成長率維持2％以上，加上貨幣政策仍處於降息循環，市場預期今年仍有降息空間，對風險性資產形成支撐。產業面來看，AI市場仍處於供不應求階段，科技巨頭持續加大資本支出，對產業與經濟具正向拉動效果。 富邦台美雙星多重資產基金經理人薛博升指出，因應市場波動上行，持股持續聚焦具有基本面支撐的科技股，產業集中在AI相關類股，記憶體、新雲端、GPU、高速傳輸、網通、AI零組件等類股。 富蘭克林華美投信認為，近期美國聯準會高層人事調查及政治干擾，使市場關注決策團隊布局與政策穩定性，預期聯準會利率將維持現狀或逐步回歸中性；美國企業基本面展現韌性，2026年獲利預估上修，資金流向也由估值調整轉向基本面驅動。\n時報資訊 ・ 4 天前 ・ 發表留言\n\nAI長趨勢不變 多重資產基金穩中求勝 川普宣布提名華許，市場對未來貨幣政策可能轉趨強硬的討論升溫，金融市場波動風險隨之提高。回顧歷史，聯準會主席更替往往伴隨政策風向調整，利率政策仍具不確定性，透過同時布局股票、債券及多元主題資產的多重資產型基金，作為投資組合核心配置之一，有助分散單一資產波動，提升整體投資穩定度。\n工商時報 ・ 4 天前 ・ 發表留言\n\n白宮重申維持「強勢美元」立場 投資人不信 紛紛背離美元 在 2025 年，美元遭遇了 8 年來最大的年度跌幅，儘管川普政府持續重申維持「強勢美元」的立場，但市場顯然對此持懷疑態度。儘管美元近日有小幅回升，但美元指數較年初仍下跌約 1%，延續了 2025 年高達 9% 的跌勢。\n鉅亨網 ・ 4 天前 ・ 1 則留言\n\n《台北股市》AI多頭榮景 三大族群迎成長 【時報-台北電】回顧2025年，市場歷經對等關稅衝擊大幅震盪，所幸在美國聯準會啟動降息，AI需求暢旺，帶動台灣上市公司企業獲利表現亮眼，AI題材成為貫穿全年的市場投資熱區，投資氣氛由冷轉熱，2025年台股加權指數以創歷史新高之姿風光封關，為2026年的多頭續航奠定了堅實基礎。 展望2026年，現任聯準會主席鮑爾謹慎降息，與川普想法抵觸，但其任期至2026年5月結束，自2026年6月起，新任主席勢將貫徹川普大幅降息之理念，確保經濟動能維持正成長。若聯準會啟動降息循環，台美利差也將因美國降息逐漸收斂，則新台幣轉強機率高，有利於外資回流台股。而原先受緊縮政策抑制的終端需求，也有機會在2026年下半年緩步回升，帶動原先弱勢的PC、NB、手機等消費性產品需求脫底復甦，相關供應鏈獲利成長力道有機會逐季回溫。 至於以台積電為首的AI供應鏈，受惠5G、HPC、電動車、AI、衛星通訊及資料中心需求不墜，可望持續繳出超越市場預期的獲利成績，並且帶動相關半導體設備、特用化材、矽光子及先進封裝的營運表現。電子下游受惠AI產品升級，高階PCB、散熱、光通、電源供應等關鍵零組件，在價、量同步成長的環境下，業績、股\n時報資訊 ・ 1 天前 ・ 發表留言\n\nAI多頭榮景 三大族群迎成長 回顧2025年，市場歷經對等關稅衝擊大幅震盪，所幸在美國聯準會啟動降息，AI需求暢旺，帶動台灣上市公司企業獲利表現亮眼，AI題材成為貫穿全年的市場投資熱區，投資氣氛由冷轉熱，2025年台股加權指數以創歷史新高之姿風光封關，為2026年的多頭續航奠定了堅實基礎。\n工商時報 ・ 1 天前 ・ 發表留言\n\nPimco顧問Clarida稱，華許領導下聯準會將推動三大領域改革 【財訊快報／劉敏夫】外電報導指出，知名固定收益投資管理公司品浩(Pimco)全球經濟顧問Rich Clarida表示，在川普提名的聯準會主席人選華許(Kevin Warsh)領導下，聯準會將成為「華許聯準會」(Warsh FED)。Clarida認為，今年美國經濟存在上升空間。科技資本支出熱潮真實存在，並提到減稅政策及外資企業投資廠房設備等其他利多因素。Clarida指出，華許對美國經濟的看法與聯準會去年12月的立場一致。聯準會與財政部就政策目標平衡展開討論是合理的。預計聯準會將根據華許對其批評調整政策。Clarida列舉了可能調整的三大領域，分別是前瞻指引、資產負債表、信貸配置與抵押貸款相關領域。Clarida認為，貨幣政策在無前瞻指引的情況下運作是有可能的。Clarida指出，華許需與聯準會的委員會協力合作，以推動改革。\n財訊快報 ・ 4 天前 ・ 發表留言\n\n《國際經濟》貝森特：Fed不會激進縮表 【時報-台北電】為了安撫市場對於聯準會主席提名人華許（Kevin Warsh）上台後，可能將採取「鷹派縮表」的憂慮不安，美國財長貝森特8日接受媒體採訪時強調，即使華許入主後，聯準會也不會採取激進的縮減資產負債表行動，整個決策過程可能至少要花一年時間才會做出決定。 貝森特在接受福斯新聞頻道（Fox News Channel）節目採訪，談到外界最關注的資產負債表議題時，他認為聯準會將對此保持謹慎。他指稱，「我不預期他們會迅速轉變。他們已轉向充足準備金制度政策，這確實需要較大的資產負債表，所以我認為他們可能會靜觀其變，至少花一年的時間來決定他們想做什麼。」 聯準會去年12月開始透過技術性購買美國公債的方式增加持有的債券，以確保金融體系擁有足夠的流動性，藉此有效控制利率目標區間。 不過獲得美國總統川普提名為聯準會主席人選的華許，曾批評聯準會的資產負債表膨脹，是造成今日通膨居高不下的禍首，因此主張大幅削減目前的債券持有量，令外界推測他上任後可會縮減資產負債表。專家認為，川普總統曾表示希望大幅降低抵押貸款利率，這將與華許的縮表政策背道而馳。 貝森特在訪談中還強調，華許會是一位非常獨立的聯準會主席。\n時報資訊 ・ 4 天前 ・ 發表留言\n\n貝森特：Fed不會激進縮表 為了安撫市場對於聯準會主席提名人華許（Kevin Warsh）上台後，可能將採取「鷹派縮表」的憂慮不安，美國財長貝森特8日接受媒體採訪時強調，即使華許入主後，聯準會也不會採取激進的縮減資產負債表行動，整個決策過程可能至少要花一年時間才會做出決定。\n工商時報 ・ 4 天前 ・ 1 則留言\n\n川普力挺新掌門人華許 放話經濟增速上看15% 稱當年選鮑爾是「大錯」 川普在公布新任聯準會主席人選後，罕見公開承認首任期提名鮑爾是重大錯誤。隨著司法調查與政策衝突升溫，美國貨幣政策與政治角力正進入新一輪敏感階段。\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n〈美股早盤〉主要指數漲跌互現 市場靜待就業與通膨數據 美股主要指數周一 (9 日) 漲跌互現，延續近期震盪走勢。市場一方面消化上週在人工智慧 (AI) 題材劇烈波動後出現、規模約 1 兆美元的反彈行情，另一方面靜待本週密集出爐的就業與通膨數據，以研判聯準會後續利率政策方向。\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n債券ETF規模 今年以來增逾400億 今年來股市高檔震盪，債券有成為市場穩健資金的避風港態勢，統計今年來至2月10日，整體債券ETF規模已增加404.59億元，總規模也來到3.12兆元，相較去年規模僅增加167.3億元，突顯今年債券ETF交易似乎持續增溫。\n工商時報 ・ 2 天前 ・ 發表留言\n\n市場快訊》聯準會新舵手？凱文華許上任對你的投資有何影響？ 如果你擔心接下來美股會因為聯準會的人事異動而大震盪，那你一定要認識凱文華許這位重量級人物。他不像一般躲在研究室裡的學者，而是一位從華爾街前線打殺出來，又進過白宮決策圈的實戰派。這位官員不喜歡空談理論，他更在乎市場的真實運作。當市場都在猜測未來要升息還是降息時，他已經準備好一套全新的玩法，那他的\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n《基金》債券ETF規模 今年以來增逾400億 【時報-台北電】今年來股市高檔震盪，債券有成為市場穩健資金的避風港態勢，統計今年來至2月10日，整體債券ETF規模已增加404.59億元，總規模也來到3.12兆元，相較去年規模僅增加167.3億元，突顯今年債券ETF交易似乎持續增溫。 據CMoney統計顯示，在110檔債券ETF中，有64檔債券ETF今年來規模呈現增加，進一步觀察今年來規模增加前十的債券ETF績效也全數繳出正報酬，其中群益ESG投等債20+（00937B）今年來上漲1.2％漲幅居冠最亮眼。 群益ESG投等債20+ETF（00937B）經理人曾盈甄表示，隨著地緣政治風險升溫，不確定性使避險需求增加，不過在聯準會降息時點仍存在不確定性下，資金在避險資產間來回調整，其中又以投資等級債吸金動能最強勁，今年來美國投等債淨流入38億美元。 台新美A公司債20+（00942B）研究團隊指出，美國金融市場再度進入「政策不確定性密集期」，聯準會1月會議在連續三次降息後首度維持利率不變，同時美國總統川普提名先前立場偏鷹派的Kevin Warsh出任下一任聯準會主席，引發市場關注未來貨幣政策路線，加上美國政府預算協商膠著，政府部門局部停擺，\n時報資訊 ・ 2 天前 ・ 發表留言\n\n貝森特：聯準會應該不會迅速調整資產負債表 美國財政部長貝森特8日表示，他預期聯準會不會迅速縮減資產負債表，即便是在聯準會主席提名人華許（Kevin Warsh）的領導下也是如此。\n中時財經即時 ・ 4 天前 ・ 發表留言\n\n《盤後解析》台積電、台股雙創歷史高 封關前樂觀以待 【時報記者郭鴻慧台北報導】台股今(10)日開高後，護國神山台積電(2330)一路狂飆，尾盤衝上1880元新天價，半導體及電子權值股活蹦亂跳，矽光子多頭攻勢凌厲，光聖(6442)、聯鈞(3450)、訊芯-KY(6451)、波若威(3163)等紛紛升，先進封裝的日月光(3711)、欣銓(3274)等聯袂揚升，PCB中的華通(2313)、金像電(2368)、欣興(3037)也見買單點火，金融股中的國泰金(2882)、元大金(2885)表現穩健，激勵集中市場指數終場上漲668.35點、收33072.97點，再創歷史新高，成交值略減為6565.05億元，櫃買市場收296.52點，跌0.10點，總成交值1504.5億元。 這次MSCI季度調整於台北時間2月11日凌晨公布結果，並在2月26日尾盤生效。法人指出，統計2026年1月新興新場各國指數表現，台灣加權指數上漲10.7%、MSCI台灣指數上漲11.3%，亦優於MSCI新興市場指數。考量台灣加權指數及MSCI台灣指數表現居前段，預估於此次季度調整，台股權重小幅調升。 資深證券分析師簡伯儀指出，上週融資大減、配合美股大漲，以及AI個股續強，今(10\n時報資訊 ・ 3 天前 ・ 發表留言\n\n〈美股盤後〉美1月非農報告大超預期 道瓊結束連三揚 道瓊工業指數在 1 月就業報告優於預期後一度大漲逾 300 點，但隨著市場下修聯準會 (Fed) 降息機率，道瓊也結束連三日漲勢。\n鉅亨網 ・ 2 天前 ・ 2 則留言\n\n白宮下修就業成長預期卻稱非警訊？點出Fed政策罕見難題 白宮經濟顧問哈塞特 (Kevin Hassett) 周一 (9 日) 表示，由於勞動人口成長放緩以及生產力提升，美國未來幾個月的就業增幅可能會降低，加入聯準會 (Fed) 內部正在進行的相關辯論，且勢必將形塑央行接下來的政策決策方向。\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n降息還太早？Fed蘿根點出關鍵條件 美國聯準會達拉斯聯邦準備銀行總裁蘿根 (Lorie Logan) 周二 (10 日) 表示，雖然她對通膨持續降溫「審慎樂觀」，但在就業市場未出現「實質性走弱」之前，她不認為有必要再度降息。她強調，若通膨回落同時就業市場明顯降溫，才\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n凱基雙核收息債股平衡ETF每單位擬配0.056元，預計2月26日除息 【財訊快報／記者劉居全報導】凱基雙核收息債股平衡ETF基金(00981T)，迎來掛牌上市以來第2次配息期前公告出爐，每受益權單位擬配發0.056元，預計2月26日除息，3月25日發放，有意參與除息的投資人，2月25日為最後買進日。平衡凱基雙核收息(00981T)ETF研究團隊表示，美國聯準會主席換人在即，川普點名聯準會前理事華許為下任聯準會主席，川普干預引發市場對聯準會獨立性與利率政策不確定性的憂慮，導致資本市場震盪，美國股市修正。預期下一次降息較有可能的時間會落在5月聯準會主席換屆之後，且預估今年降息空間大約介於1-2碼，緩步降息趨勢不變，債券殖利率仍具吸引力，但上半年降息預期低，債券資產大幅產生資本利得之機會有限，今年債券應仍以息收為主要報酬來源。至於股市方面，全球AI產業蓬勃發展，儘管短線偶有波動，但預計美、台股市將維持向上走勢，而美國聯準會對於經濟由保守轉為偏向樂觀的看法，亦支撐股市溫和走升。根據最新數據，S&P 500指數2026年全年獲利成長率預計為14.7%，美股今年上漲空間將由獲利成長所推動，在經濟展望樂觀、貨幣政策保持溫和偏鴿情境下，今年牛市續航仍可期。全台首檔結合7\n財訊快報 ・ 4 天前 ・ 發表留言\n\n熱門新聞\n1\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 2\n\n13.5億威力彩「2得主」買法一模一樣！ 只花100元就翻身 3\n\n郭台銘大紅包發威！央行新台幣發行額首破4.2兆  年增率飆3年最高 4\n\n「新版新台幣」可能有石虎！票選結果曝光 台積電僅排第七 5\n\n【房地產週報】輝達簽約落腳北士科！29年最大交屋潮來襲！新竹預售屋慘崩82.3%！七大都會區交易量年減7成\n\n你可能會喜歡\n你上車了嗎？記憶體登蛇年狂飆主力　前10猛將全曝光 FTNN新聞網\n\n九大工業公會聯合肯定台美貿易協定 強調為產業注入強心針 民視財經網\n\n春節搭車風險升溫！行車保護傘保障出行　花1元即可享百萬保障 三立新聞網 setn.com\n\n「台灣價值」竟沒台灣之光！大盤飆新高00940卻回不到10元　股民哀號：成敗皆這1檔 鏡週刊Mirror Media\n\n緝捕馬杜洛震驚全球 美軍傳動用AI工具Anthropic Claude 鉅亨網\n\n信義房屋：年前家電、家具換新需求高 今日新聞NOWNEWS\n\n台股拉警報！專家警告美股7巨頭集體翻車：最慘開年行情 中時財經即時\n\n鄭麗君團隊立大功！謝金河曝「台美ART簽署」意義：台灣獲1席珍貴位子 三立新聞網 setn.com\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 工商時報\n\n租屋族省很大！租金補貼減輕4成負擔 女性與25歲以下青年成主力 太報\n\n法人兩樣情！華邦電發說利多連發...目標價上看200元 　保守派「4理由」只喊88元 FTNN新聞網\n\n美股掀AI恐慌交易　台積電ADR挫0.47％ CTWANT\n\n外食族吃不消! 海南雞飯漲20元 手搖飲過年期間漲5元 民視財經網影音\n\n陸客不去日本！外媒爆25萬大軍「改衝這國」 刷爆103億不手軟 中時財經即時\n\n金蛇年「大漲萬點」封關！0050領銜市值型ETF悍漲　近十年含息報酬率高達509% FTNN新聞網\n\n台灣賓士對「台美貿易協議」成功達成表達祝賀 並承諾回饋消費者 民視財經網\n\n聯電ADR13日上漲0.13美元漲幅1.26%折台股65.68元 中央社財經\n\n砸5億擴產最快Q2釋產能！PCB股華通衝連3漲　當沖爆量破5萬張登當沖王 FTNN新聞網\n\n輝達下跌、AMD上漲 背後關鍵或在Arista 鉅亨網\n\n美通膨降溫難掩「AI恐慌」! 美股漲跌互見、台積電ADR下跌0.51％ 新頭殼\n\n台美ART簽署》台經院張建一妙喻：台灣付的午餐費 比別人還低 工商時報\n\n大研生醫* 公告本公司股票面額由「新台幣10元」變更為「新台幣1元」，公告期間：114年12月22日至115年3月21日。 Moneydj理財網\n\n外資降評唱衰！大咖投顧逆風喊買面板指標大廠「這檔」　最新目標價曝光 FTNN新聞網\n\n春節放假也能追美股！內部數據曝光　過年反而更敢買 三立新聞網 setn.com\n\n記憶體嚴重短缺！美國軍工企業黑名單 移除中國長鑫、長江存儲 自由時報\n\n蘇威元：台積電概念股飆漲密碼 這四指標抓飆股一次賺58% 民視財經網影音\n\n運載指標／港務公司貨櫃量上看1,390萬TEU 今日新聞NOWNEWS\n\n關稅干擾消失加AI助攻　經濟成長率上修至7.71％ 卡優新聞網\n\n主動式ETF規模破1739億！這檔年化配息率10％　豪配0.377元「年後這天」最後上車日 FTNN新聞網\n\n到全台最夯紫南宮借發財金　主委莊秋安：心存善念有來有保庇 鏡報\n\n新北房市 新莊幸福路商圈 成家首選 工商時報\n\n台美ART 守住重要農產品防線 工商時報\n\n〈能源盤後〉油價因美通膨趨緩回升 周線仍收黑 鉅亨網\n\n13家金控1月獲利全公布！國泰金元月大賺146億元　EPS達0.99元登獲利王 FTNN新聞網\n\n美通膨降溫難掩AI隱憂　美股漲跌互見 太報\n\n〈貴金屬盤後〉黃金、白銀回神 CPI重燃降息預期 鉅亨網\n\n傳統軟體股崩跌回五年前！卡爾先生：掌握這兩點才能存活 民視財經網影音\n\n台股資料來源 臺灣證券交易所 、 臺灣期貨交易所 及 財團法人中華民國證券櫃檯買賣中心 ，國際股市資料來源請參考 Yahoo Finance 。台股行情、個股基本資料及財務資訊為精誠資訊提供。使用Yahoo股市服務前，請您詳閱相關 使用規範與聲明 。\n\n服務條款 隱私權 您的隱私權選擇 加州隱私權通知 © 2026 Yahoo. All rights reserved.\n\n1",
      "Language": "zh",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-13",
      "Time": "11:51:56",
      "Source": "Yahoo奇摩股市",
      "Title": "《美股》分析：米蘭鼓吹降息優點；花旗示警通膨再起",
      "URL": "https://tw.stock.yahoo.com/news/%E7%BE%8E%E8%82%A1-%E5%88%86%E6%9E%90-%E7%B1%B3%E8%98%AD%E9%BC%93%E5%90%B9%E9%99%8D%E6%81%AF%E5%84%AA%E9%BB%9E-%E8%8A%B1%E6%97%97%E7%A4%BA%E8%AD%A6%E9%80%9A%E8%86%A8%E5%86%8D%E8%B5%B7-035156247.html",
      "Content": "【時報編譯柳繼剛綜合外電報導】美股分析：\n●聯準會理事米蘭表示，聯準會目前的貨幣政策，已經威脅到美國的經濟成長，同時，米蘭也再次說明進一步降息的必要性。米蘭不認為通膨是一個問題，因為住房通膨非常低，可以跟指數內其它項目更高的通膨相互平衡。因此，嘗試使用更寬鬆的貨幣政策，來支撐勞動市場是有意義的。不過，達拉斯聯邦準備銀行行長Logan卻反對進一步降息，Logan指出，自己更擔心的是頑固的高通膨，而不是勞動市場。\n\n●花旗表示，市場對美國通膨未來發展過於自滿，也就是說市場似乎相信通膨還會下降，但卻沒想到現在的環境，通膨的結構性反而更強，因去年實施的美國新關稅政策，可能會產生更高的通膨風險。\n●美國就業數據良好，聯準會可以在相當長的一段時間內都對利率按兵不動，BAIRD認為，如果CPI真的又開始上揚，聯準會在做出決定之前，還有幾個月的時間來觀察物價趨勢。除非新的CPI報告非常強勁，否則不會對股市和期貨市場產生真正的影響。\n\n檢視留言\n\n相關內容\n降息還太早？Fed蘿根點出關鍵條件 美國聯準會達拉斯聯邦準備銀行總裁蘿根 (Lorie Logan) 周二 (10 日) 表示，雖然她對通膨持續降溫「審慎樂觀」，但在就業市場未出現「實質性走弱」之前，她不認為有必要再度降息。她強調，若通膨回落同時就業市場明顯降溫，才\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n達拉斯聯儲行長Logan指稱，僅通膨回落不足以支持降息 【財訊快報／劉敏夫】外電報導指出，美國聯準會達拉斯分行行長Lorie Logan表示，她對通膨繼續下降持樂觀態度，但只有在勞動力市場出現「實質性」疲軟的情況下，才會支持進一步降息。Logan週二在奧斯汀(Austin)的一場活動致辭中表示，接下來的幾個月，我們將了解到通膨是否正在向目標水準回落，以及勞動力市場是否保持穩定。Logan指出，一旦情況確實如此，表明目前的政策立場是合適的，無需進一步降息即可實現我們的雙重使命目標，相反的，如果看到通膨下降的同時勞動力市場進一步實質性降溫，那麼再次降息可能是合適的。Logan今年在聯邦公開市場委員會(FOMC)擁有投票權。在2025年底連續三次降息後，她支持FOMC在1月份會議上維持利率不變的決定。去年10月和12月Logan曾公開反對降息，理由是通膨依然過高且勞動力市場處於平衡狀態。週二Logan重申了上述觀點，她表示，過去六個月左右的招聘情況接近聯準會研究人員估計的「平衡率」，也就是創造就業的速度與人口成長相匹配。不過，她尚不能完全確信通膨正一路向2%回落。在接掌聯準會達拉斯分行之前，Logan曾在聯準會紐約分行管理央行的資產組合。週二她還\n財訊快報 ・ 3 天前 ・ 發表留言\n\n聯準會理事米蘭稱，支持逐步縮表降低市場干預，危機時可擴表 【財訊快報／劉敏夫】外電報導指出，美國聯準會理事米蘭(Stephen Miran)表示，聯準會的資產負債表需要縮小規模，但這並不意味著在經濟危機期間，政策制定者不能選擇進行大規模資產購買。米蘭表示，縮減聯準會的資產負債表將降低其在金融市場中的存在感，並在未來發生危機時為政策制定者保留更多選擇。米蘭週一在一段播客(podcast)錄音中表示，當觸及零利率下限、且正處於金融危機時，擴大資產負債表是正確之舉，但要在採取這種行動之前保留實力。在美國總統川普表示他將提名華許(Kevin Warsh)接替5月份任期屆滿的聯準會主席鮑威爾之後，投資者和分析師對聯準會關於資產負債表作用的講話字斟句酌。華許一直呼籲聯準會進行重大改革，包括大幅縮減資產負債表規模。米蘭表示他支持逐步縮減資產負債表的計畫，但這不可能立即實現。在到達那一步之前，監管流程中還有許多障礙要克服。這需要很長時間。我們不可能明天就開始縮減。\n財訊快報 ・ 3 天前 ・ 發表留言\n\n《國際經濟》關稅讓美國人苦哈哈？川普愛將用神邏輯反駁 【時報編譯柯婉琇綜合外電報導】聯準會理事米蘭（Stephen Miran）周一表示，數據顯示美國人並沒有受到關稅衝擊。川普政府的貿易關稅政策已經證明比許多人所擔心的要溫和。外國人和他們的公司才是主要為關稅上漲買單的人，而不是美國人。 不過，米蘭的言論似乎與數據相互矛盾。數據顯示支付關稅的負擔落在美國人身上。 周一，在波士頓大學Questrom商學院發表演說時，米蘭表示，我認為在一些議題上，世界已經逐漸認同我的方向。他特別提到了關稅及其對經濟的影響，並表示一年前，當川普的第二任期剛開始時，大家都擔心大幅提高進口稅會打擊美國經濟。我認為許多專家隨著時間逐漸認同了我的觀點，並認為關稅對經濟的影響「相當有限」。 米蘭也反駁經濟學界普遍存在的觀點：關稅推升物價，進而由美國民眾承擔，而非由出口國犧牲利潤來承擔。 去年底，美國總統川普曾經承認，由於他提高關稅，美國人正面臨物價上漲，雖然這項政策總體而言對美國經濟是有利的，但我認為「美國人可能得付出一些代價」。 聯準會曾表示，2026年通膨率將超過2%目標，大多是因為關稅壓力。 耶魯預算實驗室（Yale Budget Lab）上個月底出具報告指出，每戶\n時報資訊 ・ 3 天前 ・ 發表留言\n\n美國債市突亮起經濟警訊：經濟過熱的擔憂其實是誤判？ 據《MarketWatch》報導，周二 (10 日) 公布的美國 12 月零售銷售數據打擊了市場對經濟成長的預期，推動美國公債漲勢進一步擴大。\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n《基金》AI長趨勢不變 多重資產基金穩中求勝 【時報-台北電】川普宣布提名華許，市場對未來貨幣政策可能轉趨強硬的討論升溫，金融市場波動風險隨之提高。回顧歷史，聯準會主席更替往往伴隨政策風向調整，利率政策仍具不確定性，透過同時布局股票、債券及多元主題資產的多重資產型基金，作為投資組合核心配置之一，有助分散單一資產波動，提升整體投資穩定度。 富邦AI智能新趨勢多重資產型基金經理人高皓欣表示，從總體經濟觀察，全球經濟動能仍具韌性，美國2026年GDP預估成長率維持2％以上，加上貨幣政策仍處於降息循環，市場預期今年仍有降息空間，對風險性資產形成支撐。產業面來看，AI市場仍處於供不應求階段，科技巨頭持續加大資本支出，對產業與經濟具正向拉動效果。 富邦台美雙星多重資產基金經理人薛博升指出，因應市場波動上行，持股持續聚焦具有基本面支撐的科技股，產業集中在AI相關類股，記憶體、新雲端、GPU、高速傳輸、網通、AI零組件等類股。 富蘭克林華美投信認為，近期美國聯準會高層人事調查及政治干擾，使市場關注決策團隊布局與政策穩定性，預期聯準會利率將維持現狀或逐步回歸中性；美國企業基本面展現韌性，2026年獲利預估上修，資金流向也由估值調整轉向基本面驅動。\n時報資訊 ・ 4 天前 ・ 發表留言\n\n法巴稱台灣經濟強勁消除央行降息條件，通膨變數或造成升息風險 【財訊快報／劉敏夫】外電報導指出，法國巴黎銀行表示，在台灣經濟成長維持強勁的情況下，不再認為央行將於今年第三季降息12.5基點，改為基本預期直到2027年底都將維持利率不變。然而通膨的不確定性可能造成升息的風險。法國巴黎銀行策略分析師Franco Hsu與經濟專家Jeeho Yoon在報告中寫道，儘管台灣央行於12月會議下調通膨預測，淡化升息的可能性，但是估計政策利率在今年下半年可能面臨調升的風險。這份報告指出，一旦通膨表現比預期來得高，加上經濟成長動能外溢至民間消費，就有可能觸發升息的條件。不過，考慮到目前房市趨於穩定，就算央行重啟升息循環，規模也會比過去較小。這份報告將台灣今年經濟成長率預測從2.8%上調至5.9%，通膨年增率則上調為1.7%。估計科技產業會持續給予出口成長動能，非科技產業則憂喜參半。同時，民間消費可望在股票上漲的情況下回升。這份報告將2027年經濟成長預估下調0.5個百分點至2.1%，通膨預估則調高至1.8%。在匯率方面，這份報告預期台幣今年將在31-32元新台幣的區間內交易，且具貶值的傾向，年終預測為31.8元新台幣。且鑒於經常帳盈餘持續被良好回收，加上台灣低殖\n財訊快報 ・ 4 天前 ・ 發表留言\n\n美國1月CPI年增2.4％、低預期 市場押注3月Fed仍將按兵不動 美國1月通膨明顯降溫，由去年12月的年增2.7％陡降至2.4％，大幅優於市場預期，創下2025年4月以來最低紀錄。\n中時財經即時 ・ 11 小時前 ・ 發表留言\n\n鉅亨雙週報》AI股震盪、利率預期翻轉與日英政治巨浪 這兩週市場同時遭受 AI 海嘯、利率轉向與政治黑天鵝接連衝擊。美國聯準會立場轉鷹，川普提名前理事華許接掌聯準會主席，加上英國工黨面臨執政危機，以及日本高市早苗政府在大選勝出後，形同獲得一張擴張財政與強硬外交的空白支票。同時，從比特幣到白銀都在上演高台跳水，投資人忽然想起本益比三個字。當股匯債與\n鉅亨網 ・ 18 小時前 ・ 發表留言\n\n《台北股市》AI多頭榮景 三大族群迎成長 【時報-台北電】回顧2025年，市場歷經對等關稅衝擊大幅震盪，所幸在美國聯準會啟動降息，AI需求暢旺，帶動台灣上市公司企業獲利表現亮眼，AI題材成為貫穿全年的市場投資熱區，投資氣氛由冷轉熱，2025年台股加權指數以創歷史新高之姿風光封關，為2026年的多頭續航奠定了堅實基礎。 展望2026年，現任聯準會主席鮑爾謹慎降息，與川普想法抵觸，但其任期至2026年5月結束，自2026年6月起，新任主席勢將貫徹川普大幅降息之理念，確保經濟動能維持正成長。若聯準會啟動降息循環，台美利差也將因美國降息逐漸收斂，則新台幣轉強機率高，有利於外資回流台股。而原先受緊縮政策抑制的終端需求，也有機會在2026年下半年緩步回升，帶動原先弱勢的PC、NB、手機等消費性產品需求脫底復甦，相關供應鏈獲利成長力道有機會逐季回溫。 至於以台積電為首的AI供應鏈，受惠5G、HPC、電動車、AI、衛星通訊及資料中心需求不墜，可望持續繳出超越市場預期的獲利成績，並且帶動相關半導體設備、特用化材、矽光子及先進封裝的營運表現。電子下游受惠AI產品升級，高階PCB、散熱、光通、電源供應等關鍵零組件，在價、量同步成長的環境下，業績、股\n時報資訊 ・ 1 天前 ・ 發表留言\n\n通膨風險仍存！美1月CPI月增0.2%　FED可能暫緩降息 即時中心／林耿郁報導美國勞工部最新數據顯示，1月消費者物價指數（CPI）月增0.2%，低於市場預期的0.3%，主因汽油價格下滑與房租漲勢放緩。不過核心通膨出現升溫趨勢、服務類價格也走高，顯示物價壓力尚未完全消退，因此聯準會FED似乎不急於繼續降息。\n民視財經網 ・ 50 分鐘前 ・ 發表留言\n\n避險情緒增 債券配置更顯重要 首選推全球複合債基金 川普宣布新任聯準會主席人選華許 (Kevin Warsh) 後，華許過往偏向鷹派的態度導致市場降息預期大減，股市與貴金屬、加密貨幣等均出現震盪回檔，債市表現相對溫和，其中新興與邊境債市仍持續走高。野村投信表示，無論由誰擔任聯準會主席，在美國經濟表現強韌、通膨受控有望緩降的環境下，美國利率走低是\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n川普力挺新掌門人華許 放話經濟增速上看15% 稱當年選鮑爾是「大錯」 川普在公布新任聯準會主席人選後，罕見公開承認首任期提名鮑爾是重大錯誤。隨著司法調查與政策衝突升溫，美國貨幣政策與政治角力正進入新一輪敏感階段。\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n〈美股早盤〉美1月就業報告超預期 主要指數開高 美股主要指數周三 (11 日) 開盤走高，延續近期走勢，主因美國 1 月就業數據優於市場預期，顯示經濟仍具韌性。標普 500 指數期貨上揚，指數走勢有望再度逼近歷史高點；道瓊工業指數盤初亦同步走強。資金動向方面，投資人降低對聯準會(F\n鉅亨網 ・ 2 天前 ・ 發表留言\n\n白宮重申維持「強勢美元」立場 投資人不信 紛紛背離美元 在 2025 年，美元遭遇了 8 年來最大的年度跌幅，儘管川普政府持續重申維持「強勢美元」的立場，但市場顯然對此持懷疑態度。儘管美元近日有小幅回升，但美元指數較年初仍下跌約 1%，延續了 2025 年高達 9% 的跌勢。\n鉅亨網 ・ 4 天前 ・ 1 則留言\n\n美國1月核心通膨創近4年低點 市場轉向押注Fed今年降息3次 美國 1 月消費者物價指數（CPI）顯示，通膨壓力整體低於市場預期，儘管年初服務價格上揚、核心通膨月增幅回升，但年增率持續放緩，顯示物價動能正逐步降溫。數據公布後，美債殖利率下滑、美股期貨走高，交易員提高對聯準會 (Fed) 今\n鉅亨網 ・ 12 小時前 ・ 發表留言\n\n〈美股早盤〉主要指數漲跌互現 市場靜待就業與通膨數據 美股主要指數周一 (9 日) 漲跌互現，延續近期震盪走勢。市場一方面消化上週在人工智慧 (AI) 題材劇烈波動後出現、規模約 1 兆美元的反彈行情，另一方面靜待本週密集出爐的就業與通膨數據，以研判聯準會後續利率政策方向。\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n米蘭：關稅成本主要由外國承擔 而非美國人民 聯準會理事米蘭9日表示，川普政府的貿易關稅政策比許多人擔憂的要溫和得多，他並強調，支付這些增加關稅負擔的主要是外國人及外國企業，而非美國人。\n中時財經即時 ・ 3 天前 ・ 發表留言\n\n美1月通膨率降溫 年增2.4％ 美國1月通膨明顯降溫，由去年12月的年增2.7％陡降至2.4％，大幅優於市場預期，創下2025年4月以來最低紀錄。美國財長貝森特接受訪問時指出，通膨預計今年中回落至2％，並暗示川普政府可能縮減金屬關稅範圍，以緩解輸入性通膨。\n工商時報 ・ 5 小時前 ・ 發表留言\n\nAI多頭榮景 三大族群迎成長 回顧2025年，市場歷經對等關稅衝擊大幅震盪，所幸在美國聯準會啟動降息，AI需求暢旺，帶動台灣上市公司企業獲利表現亮眼，AI題材成為貫穿全年的市場投資熱區，投資氣氛由冷轉熱，2025年台股加權指數以創歷史新高之姿風光封關，為2026年的多頭續航奠定了堅實基礎。\n工商時報 ・ 1 天前 ・ 發表留言\n\n熱門新聞\n1\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 2\n\n13.5億威力彩「2得主」買法一模一樣！ 只花100元就翻身 3\n\n郭台銘大紅包發威！央行新台幣發行額首破4.2兆  年增率飆3年最高 4\n\n「新版新台幣」可能有石虎！票選結果曝光 台積電僅排第七 5\n\n【房地產週報】輝達簽約落腳北士科！29年最大交屋潮來襲！新竹預售屋慘崩82.3%！七大都會區交易量年減7成\n\n你可能會喜歡\n你上車了嗎？記憶體登蛇年狂飆主力　前10猛將全曝光 FTNN新聞網\n\n九大工業公會聯合肯定台美貿易協定 強調為產業注入強心針 民視財經網\n\n春節搭車風險升溫！行車保護傘保障出行　花1元即可享百萬保障 三立新聞網 setn.com\n\n外食族吃不消! 海南雞飯漲20元 手搖飲過年期間漲5元 民視財經網影音\n\n「台灣價值」竟沒台灣之光！大盤飆新高00940卻回不到10元　股民哀號：成敗皆這1檔 鏡週刊Mirror Media\n\n緝捕馬杜洛震驚全球 美軍傳動用AI工具Anthropic Claude 鉅亨網\n\n信義房屋：年前家電、家具換新需求高 今日新聞NOWNEWS\n\n台股拉警報！專家警告美股7巨頭集體翻車：最慘開年行情 中時財經即時\n\n鄭麗君團隊立大功！謝金河曝「台美ART簽署」意義：台灣獲1席珍貴位子 三立新聞網 setn.com\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 工商時報\n\n租屋族省很大！租金補貼減輕4成負擔 女性與25歲以下青年成主力 太報\n\n法人兩樣情！華邦電發說利多連發...目標價上看200元 　保守派「4理由」只喊88元 FTNN新聞網\n\n美股掀AI恐慌交易　台積電ADR挫0.47％ CTWANT\n\n陸客不去日本！外媒爆25萬大軍「改衝這國」 刷爆103億不手軟 中時財經即時\n\n金蛇年「大漲萬點」封關！0050領銜市值型ETF悍漲　近十年含息報酬率高達509% FTNN新聞網\n\n台灣賓士對「台美貿易協議」成功達成表達祝賀 並承諾回饋消費者 民視財經網\n\n砸5億擴產最快Q2釋產能！PCB股華通衝連3漲　當沖爆量破5萬張登當沖王 FTNN新聞網\n\n輝達下跌、AMD上漲 背後關鍵或在Arista 鉅亨網\n\n台美ART簽署》台經院張建一妙喻：台灣付的午餐費 比別人還低 工商時報\n\n美通膨降溫難掩「AI恐慌」! 美股漲跌互見、台積電ADR下跌0.51％ 新頭殼\n\n大研生醫* 公告本公司股票面額由「新台幣10元」變更為「新台幣1元」，公告期間：114年12月22日至115年3月21日。 Moneydj理財網\n\n外資降評唱衰！大咖投顧逆風喊買面板指標大廠「這檔」　最新目標價曝光 FTNN新聞網\n\n春節放假也能追美股！內部數據曝光　過年反而更敢買 三立新聞網 setn.com\n\n記憶體嚴重短缺！美國軍工企業黑名單 移除中國長鑫、長江存儲 自由時報\n\n運載指標／港務公司貨櫃量上看1,390萬TEU 今日新聞NOWNEWS\n\n關稅干擾消失加AI助攻　經濟成長率上修至7.71％ 卡優新聞網\n\n台積電ADR13日下跌1.74美元跌幅0.47%折台股2309.39元 中央社財經\n\n到全台最夯紫南宮借發財金　主委莊秋安：心存善念有來有保庇 鏡報\n\n新北房市 新莊幸福路商圈 成家首選 工商時報\n\n台美ART 守住重要農產品防線 工商時報\n\n〈能源盤後〉油價因美通膨趨緩回升 周線仍收黑 鉅亨網\n\n主動式ETF規模破1739億！這檔年化配息率10％　豪配0.377元「年後這天」最後上車日 FTNN新聞網\n\n蘇威元：台積電概念股飆漲密碼 這四指標抓飆股一次賺58% 民視財經網影音\n\n13家金控1月獲利全公布！國泰金元月大賺146億元　EPS達0.99元登獲利王 FTNN新聞網\n\n美通膨降溫難掩AI隱憂　美股漲跌互見 太報\n\n〈貴金屬盤後〉黃金、白銀回神 CPI重燃降息預期 鉅亨網\n\n傳統軟體股崩跌回五年前！卡爾先生：掌握這兩點才能存活 民視財經網影音\n\n台股資料來源 臺灣證券交易所 、 臺灣期貨交易所 及 財團法人中華民國證券櫃檯買賣中心 ，國際股市資料來源請參考 Yahoo Finance 。台股行情、個股基本資料及財務資訊為精誠資訊提供。使用Yahoo股市服務前，請您詳閱相關 使用規範與聲明 。\n\n服務條款 隱私權 您的隱私權選擇 加州隱私權通知 © 2026 Yahoo. All rights reserved.\n\n1",
      "Language": "zh",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-13",
      "Time": "11:30:27",
      "Source": "Yahoo奇摩股市",
      "Title": "《美股》焦點股：應材本季樂觀；OpenAI新品亮相",
      "URL": "https://tw.stock.yahoo.com/news/%E7%BE%8E%E8%82%A1-%E7%84%A6%E9%BB%9E%E8%82%A1-%E6%87%89%E6%9D%90%E6%9C%AC%E5%AD%A3%E6%A8%82%E8%A7%80-openai%E6%96%B0%E5%93%81%E4%BA%AE%E7%9B%B8-033027504.html",
      "Content": "【時報編譯柳繼剛綜合外電報導】焦點股：\n●谷歌母公司Alphabet最近發行少見的百年超長天期公司債，有分析師指出，這家高科技巨擘正把借款規模擴大到歷史新高，就是為了數據中心和人工智慧AI基礎設施能夠大量建設，引發外界對AI激烈競爭的新擔憂。除了上周宣布今年資本支出估達1850億美元的Alphabet以外，甲骨文、亞馬遜和微軟也在加大投入AI基建，預計未來五年，這些大型科技公司的公司債總額將達3兆美元。\n\n●應用材料公布最新財報，預測第二季營收和獲利將高於市場預期，應材預測在人工智慧處理器需求大增，以及全球記憶體短缺下，可望推升晶片製造設備的銷售量。應用材料盤後交易時暴漲超過13%，同業科林研發以及科磊的股價，盤後也都一度大漲近3%。根據倫敦證交所集團(LSEG)的數據，應用材料預計第二季銷售額約在76.5億美元，上下誤差各5億美元，先前預期為70.1億美元。美國最大的半導體設備製造商也預測，第二季經調整後的每股盈餘約為 2.64美元，上下範圍0.2美元，高於先前預期的2.28美元。\n\n●美媒報導，蘋果原計畫在幾周內陸續公布更新結果，但現在的時間，可能會延後到幾個月之內，不過應該還是會在2026年發布。另外，FTC(美國聯邦貿易委員會)要求蘋果要檢討Apple News的服務條款和內容審核政策。蘋果上個月公布的第一季財報雖超出預期，但瑞銀卻把美國科技類股的評等下調至中性。\n●美國AI新創公司OpenAI，已正式發布首款在晶片商Cerebras Systems硬體上運作的AI模型，名為GPT-5.3-Codex-Spark，可幫助軟體工程師快速完成特定程式碼編寫和執行測試等不同任務。一月時，才跟Cerebras簽訂超過100億美元合約的OpenAI，希望擴大自己的AI晶片供應商，減少對NVIDIA的單一依賴性，並對抗谷歌與Anthropic\n●美國人工智慧技術開發商Anthropic表示，已經完成金額300億美元的新一輪融資交易，估計市值將達3800億美元。路透社日前曾報導，全球最大另類資產管理公司黑石團(BlackRock)，將增加Anthropic這家OpenAI競爭對手，同時也是Claude聊天機械人開發商的公司持股，至10億美元左右。\n\n檢視留言\n\n相關內容\n《美股》焦點股：Meta蓋超大數據中心；思科財報超標盤後重挫 【時報編譯柳繼剛綜合外電報導】焦點股： ●Meta宣布已在美國印第安納州動工，興建一座超過100億美元的資料中心，加速增加發展人工智慧AI所需之大量運算能力，預計最早2027年底投入營運，是Meta目前為止規模最大的AI基礎設施之一。著名對沖基金經理人阿克曼的Pershing Square基金，已持有Meta大量股份，並認為市場低估Meta在AI領域的長期成長潛力，股價有嚴重被低估之虞。 ●SpaceX執行長馬斯克表示，集團旗下的人工智慧新創公司xAI進行重組，需要跟部分員工暫時分開，不過，也在積極招募新血。馬斯克在X平台上說，此次重組是要提升執行速度，但馬斯克沒有透露哪些員工因這次重組而被裁員，或還是主動離職的。 ●思科最新的季報優於預期，但本季獲利目標並沒有特別地出色，故股價盤後交易大跌超過7%。思科第二財季每股盈餘在調整後為1.04美元，預期為1.02美元。同時，營收為153.5億美元，年增率達10%，預估為151.2億美元。思科預計本季每股盈餘為1.02美元到1.04美元之間，營收為154億美元到156億美元間。但倫敦證券交易所集團(LSEG)的預估值則是每股盈餘1.03美元，\n時報資訊 ・ 1 天前 ・ 發表留言\n\n兩大利空連發 蘋果重挫超5% 創2025年4月最差單日表現 蘋果 (AAPL-US) 週四股價重挫 5%，市場賣壓主要來自兩項利空消息：其一是 Siri 人工智慧升級傳出延期，其二則是 Apple News 的內容策展政策遭美國聯邦貿易委員會 (FTC) 關注，引發投資人對監管風險\n鉅亨網 ・ 1 天前 ・ 發表留言\n\nAlphabet發行罕見百年債券　因應AI龐大支出 （中央社倫敦2026年02月10日綜合外電報導）對人工智慧（AI）的投資支出帶動美國科技大廠的借貸潮。據主辦承銷銀行發送的備忘錄，谷歌母公司Alphabet今天發行罕見百年期債券，是該公司在全球市場籌資315.1億美元債券計畫的一環。路透社報導，根據倫敦證券交易所集團（LSEG）的數據，Alphabet此次發行百年債券，是自1997年摩托羅拉（Motorola）發行以來，科技產業首見。紐約梅隆銀行（BNY）首席投資長葛拉內（JasonGranet）表示：「我們正處於科技劇變的非凡時代...如今Google發行百年期債券，反映出大量資本支出，以及市場與科技領域的大規模投資。」根據路透取得的最終條款清單，Alphabet這次發行的英鎊債券總額達55億英鎊，共分為5檔，其中百年期債券規模為10億英鎊，票面利率6.125%。根據國際金融評論（IF）數據，這檔百年期債券認購需求接近原本發行規模的10倍，債券的殖利率為6.05%。此外，Alphabet也透過另一家承銷商以瑞士法郎籌措30.55億瑞士法郎（約合39.8億美元），同樣分為5檔，最短3年、最長25年。至截稿時間止，Alphabet尚未回\n中央社財經 ・ 2 天前 ・ 發表留言\n\n蘋果在中國逆轉翻身 竟是靠「愛馬仕橙」賣爆救援 蘋果 (AAPL-US) 去年第 4 季在中國營收年增 38%、衝上 260 億美元，約貢獻蘋果全球營收近 5 分之 1，成為最關鍵的成長引擎之一，並且終結長達三年的銷售下\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n比iPhone17還親民？傳蘋果2萬多元低價版MacBook上半年登場 即時中心／綜合報導綜合外電與多份市調報告指出，蘋果正準備推出一款全新打造的「低價版MacBook」，主打教育市場與學生族群，消息一出即引發高度關注。由於售價可能落在新台幣2.2萬至2.5萬元之間，甚至比未來的iPhone 17還要親民，市場普遍看好其銷售表現，認為有機會成為蘋果Mac產品線的新成長動能。\n民視財經網 ・ 2 天前 ・ 發表留言\n\n《國際產業》為AI拚了！Alphabet多國發債 極罕見百年債登場 【時報編譯柯婉琇綜合外電報導】谷歌母公司Alphabet周一發行200億美元的美元債後，緊接著又發行了以英鎊和瑞士法郎計價的公司債，且規模都打破兩大市場的歷史紀錄。這加劇投資人對AI龐大的投資與變現困難的擔憂，周二Alphabet股價下跌1.77%，收在318.58美元，盤中一度跌3%。 Alphabet周一宣布發售價值200億美元公司債以支應AI發展，隨後又發行了英鎊債和瑞郎債。其中，英鎊公司債包括一筆極其罕見的100年期債券，是自網路泡沫化以來，科技公司首次發行此類「極長期」債券。 這波債券發行預計總共集資320億美元。 據媒體報導，市場對Alphabet這批債券反應熱絡，其中，美元債獲得超過1000億美元的認購。該美元債年期最長達40年，將於2066年到期。 Alphabet發行的瑞郎債規模改寫了羅氏集團（Roche Holding）的30億瑞郎歷史紀錄。英鎊債共發行55億英鎊，打破由National Grid在2016年創下的30億英鎊紀錄。規模達10億英鎊的百年債，刖獲得近10倍的超額認購。 為了籌集資金發展AI業務，Alphabet的長期負債到2025年已經達到465億美元\n時報資訊 ・ 3 天前 ・ 發表留言\n\n《國際產業》一天市值蒸發2千億美元 蘋果急稱新版Siri今年如期推出 【時報-台北電】蘋果原訂今年3月推出具人工智慧（AI）升級功能的新版個人助理Siri，但消息人士透露這家科技巨擘可能要再度延遲，令投資人大失所望，蘋果股價12日聞訊重挫5％，市值單日蒸發逾2,000億美元。 蘋果隨後向CNBC確認，新版Siri仍會在2026年如期推出。 不過蘋果的回應基本上只是重申一直以來的公開承諾，並未針對先前媒體報導關於Siri內部開發進度落後的說法作出解釋。 根據道瓊斯市場數據統計，蘋果12日股價跌落至261.73美元，市值蒸發2,020億美元，創該公司有史以來第二大單日身價縮水程度，僅次於2025年4月3日因關稅疑慮而造成市值驟降3,110億美元的記錄。（新聞來源：工商即時 陳怡均）\n時報資訊 ・ 20 小時前 ・ 發表留言\n\n《韓股》AI晶片狂賣 韓股登5,500點巔峰 【時報編譯柳繼剛綜合外電報導】韓股12日一開盤就漲破5400點關卡，買氣不墜下，大盤愈走愈高，一度來到5,515.18新高點，目前在5,496.58點，大漲142.09點或2.65%。同時，韓元也走升。 受惠於全球對人工智慧AI基礎建設的強烈需求，韓國一月資通訊ICT產品出口額達290億美元，2025年同期為162億美元，年增率高達78%，創下歷年來一月最高出口金額。同時，進口額也成長20%至140億美元，貿易順差達149億美元。韓國政府表示，ICT占韓國一月658億美元總出口金額的44.1%，是韓國經濟成長的主要動力。 受到激勵的三星電子，股價一度大幅上漲6%，記憶體競爭對手的SK海力士，也大漲3.3%。電池類股的LGES大漲3.4%，三星SDI也漲1%左右。網路族群的Kakao 上漲近1%，Naver則跌0.4%。 韓國最大入口網路Naver表示，包括執行長還有另外五位高階主管，已累積買進金額為7億韓元，約48.2萬美元的等值Naver股票，主要是展現負責任的管理風格。根據統計，現任執行長日前買進自家股票2億韓元，財務長以及營運長等高層，也各自購入約1億韓元的Naver股票。更早之\n時報資訊 ・ 1 天前 ・ 發表留言\n\n《國際金融》Google破天荒發行「百年債」等不到還錢那天！分析師示警 【時報-台北電】Alphabet首次發行10億英鎊百年期公司債，引發市場高度關注。分析師指出，在信用利差處於歷史低檔、人工智慧（AI）長期需求仍具不確定性、科技變革持續加速的背景下，Alphabet此次發債被視為信貸市場過度樂觀與AI投資泡沫逐步累積的重要訊號，反映產業正進入高風險擴張階段。 本次百年債屬於Alphabet總規模約200億美元的多幣別融資計畫的一部分，涵蓋美元、歐元、英鎊及首次發行的瑞士法郎債券，期限分布廣泛。根據外媒報導，此次10億英鎊百年期債券吸引近10倍超額認購，票面利率較10年期英國公債高出約120個基點。 分析師指出，百年期公司債向來罕見，多由主權國家發行，企業參與比例有限，主要投資人為保險公司與退休基金，用以因應長期負債需求。Alphabet此次進軍英鎊超長天期市場，顯示其積極爭取長期機構資金，同時反映資本市場對AI題材的高度熱情，但同時亦加深外界對泡沫化風險的疑慮。 Wind Shift Capital執行長布萊恩（Bill Blain）指出，Alphabet此次發債，正是目前信貸市場為AI發展而大舉擴張的縮影，其認為，在利差過低、資料中心需求前景未明，以\n時報資訊 ・ 23 小時前 ・ 3 則留言\n\n《國際產業》本田Q3本業獲利暴跌6成 2025財年營利目標不變 【時報編譯柳繼剛綜合外電報導】本田汽車集團10日公布財報時表示，受到美國新關稅政策以及電動車需求疲弱的影響，第三財季營業利益年減61.4%，且連續四季都是下滑的狀況。 這家僅次於豐田汽車的日本第二大車廠指出，第三季營業利益為1,534億日圓，約9.8707億美元，低於倫敦證券交易所集團(LSEG)調查的平均預期值1,745億日圓。 相較之下，2024年同期營業利益為3,973億日圓。本田維持2026年三月底結束，也就是2025財年的營利預估為5,500億日圓。本田表示，汽車業務在本財年的前九個月，也就是2025年4到12月期間都出現營業虧損。 2025財年前九個月，本田汽車合併營收為15.97兆日圓，年減2.2%，同時，營業利益為5915億日圓，年減48%。因此，經稀釋過的每股盈餘為115.53日圓，2024年同期為169.69日圓。\n時報資訊 ・ 3 天前 ・ 發表留言\n\n網路泡沫以來首見！Alphabet挑戰超罕見「百年債」 另將首度進軍英鎊、瑞郎市場 Alphabet(GOOGL-US)計劃在本次大型發債案中，發行超級罕見的「100 年期公司債」，成為自 1990 年代末以來，首家發行如此超長天期債券的科技公司，也凸顯在人工智慧 (AI) 軍備競賽下的融資需求，讓即使是少見的融資工具也開始受青睞。 知情人士指出，這筆 100\n鉅亨網 ・ 3 天前 ・ 發表留言\n\nAlphabet發債200億美元搶攻AI擴張！分析師：2026 年企業債恐創新高 Google 母公司 Alphabet 宣布發行 200 億美元高評級公司債，加入 AI 巨頭大舉融資行列。隨著資料中心與運算需求暴增，亞馬遜、微軟、Meta 等超大規模業者資本支出持續攀升，分析師預期 2026 年美國\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n6600億美元難買華爾街芳心 科技巨頭AI軍備競賽反引發泡沫焦慮 隨著人工智慧競賽進入白熱化階段，全球科技巨頭正以前所未有的速度在基礎建設上「燒錢」。根據最新財測數據顯示，亞馬遜 (AMZN-US)、Google 母公司 Alphabet(GOOGL-US)、微軟 (MSFT-US) 與 Meta\n鉅亨網 ・ 19 小時前 ・ 發表留言\n\n全球股票基金連四週吸金 投資人分散布局當道 MoneyDJ新聞 2026-02-09 11:14:19 李彥瑾 發佈根據倫敦證交所集團（LSEG）最新統計，全球股票基金近期持續吸金，截至2月4日當週淨流入314.6億美元，連續四週吸引資金流入，但規模略低於前週的350.3億美元，顯示美國科技股走勢震盪，促使投資人風險管理意識升高。 從主要市場表現來看，截至2月4日當週，歐洲股票基金吸金達140億美元，創4月30日當週以來最佳單週表現，主要受惠泛歐STOXX 600指數創新高，使歐股躍居資金追逐核心；亞洲與美國股票基金也分別強力吸引95.9億美元、55.8億美元。 瑞銀全球財富管理（UBS Global Wealth Management）投資長Mark Haefele指出，亞洲與歐洲市場受財政擴張及結構性改革推動，吸引資金流入，反映投資人採取更靈活、分散的資產配置策略，以因應全球市場波動與不確定性。 債市方面，上週全球債券基金累計淨流入187.1億美元，連續第五週獲資金青睞，顯示投資人傾向透過多元資產配置，兼顧收益與避險，應對全球金融環境波動。 （圖片來源：iStock） ＊編者按：本文僅供參考之用，並不構成要約、招攬或邀請、誘\nMoneydj理財網 ・ 4 天前 ・ 發表留言\n\n一天市值蒸發2千億美元會怕？蘋果急稱新版Siri今年如期推出 蘋果原訂今年3月推出具人工智慧（AI）升級功能的新版個人助理Siri，但消息人士透露這家科技巨擘可能要再度延遲，令投資人大失所望，蘋果股價12日聞訊重挫5％，市值單日蒸發逾2,000億美元。\n中時財經即時 ・ 22 小時前 ・ 發表留言\n\nAlphabet發行罕見百年期英鎊債 分析師示警：AI泡沫正在累積 Alphabet首次發行10億英鎊百年期公司債，引發市場高度關注。分析師指出，在信用利差處於歷史低檔、人工智慧（AI）長期需求仍具不確定性、科技變革持續加速的背景下，Alphabet此次發債被視為信貸市場過度樂觀與AI投資泡沫逐步累積的重要訊號，反映產業正進入高風險擴張階段。\n中時財經即時 ・ 1 天前 ・ 發表留言\n\n傳亞馬遜擬推內容市場　出版商可向AI企業銷售內容 （中央社洛杉磯2026年2月9日綜合外電報導）科技新聞網站The Information今天報導，亞馬遜公司已向出版業高層透露，正計劃推出一個「AI內容市場」，讓出版商能將內容販售給提供人工智慧（AI）產品的公司。報導引述兩名與亞馬遜公司（Amazon.com Inc.）討論這項計畫人士的說法，在明天舉行的亞馬遜雲端運算服務（Amazon Web Services, AWS）大會前，流傳的簡報投影片提及「內容市場」（contentmarketplace）。投影片顯示，AWS向出版商介紹可運用在業務中的產品時，將該內容市場與Bedrock和Quick Suite等核心AI工具歸在一類。正值出版商與AI公司就線上內容的使用規則進行協商之際，無論是用於訓練模型或為用戶生成解答的內容，出版業界爭取按使用量收費，內容使用越多，費用越高。亞馬遜沒有立即回應路透社的置評請求。微軟公司（Microsoft Corp.）上週也表示，正在開發「出版商內容市場」（Publisher Content Marketplace,PCM），即一個陳列出由出版商設定使用條款的AI授權中心。\n中央社財經 ・ 3 天前 ・ 發表留言\n\n《國際產業》傳亞馬遜擬推AI內容市集 力拚微軟 【時報編譯柯婉琇綜合外電報導】《The Information》周一引述知情人士報導，亞馬遜已經向出版業高層釋出訊號，該公司擬推出一個市集，讓出版商可以將內容賣給提供AI產品的公司。 報導指出，兩位曾與亞馬遜討論過該項目的人士透露，在周二的AWS大會之前，該亞馬遜雲端服務部門已經先流出一些提到「內容市集」（content marketplace）的投影片。這些投影片顯示AWS將該內容市集與Bedrock、Quick Suite等核心AI工具歸為一類，並介紹產品出版商可用於其業務。 此時正值出版業者與AI公司正在就使用線上內容的規則進行談判。無論是用於訓練模型，還是為用戶生成答案，出版商爭取的是按使用量付費，即費用隨著內容使用量而增加。 針對《The Information》的報導，亞馬遜發言人表示「無可奉告」，並稱該公司與出版商已建立長期合作關係，並將繼續投入創新。 上周，微軟宣布該公司正在開發「出版商內容市集」（Publisher Content Marketplace,PCM），即一個AI授權中心，提供出版商設定的使用條款。\n時報資訊 ・ 3 天前 ・ 發表留言\n\n《國際產業》Alphabet擬發百年期公司債 【時報-台北電】谷歌母公司Alphabet在9日成功發債200億美元，並計劃發行100年期公司債，為1990年代末科網股泡沫以來，首度有科技企業挑戰發行超長期債券。專家認為AI競賽愈發激烈，連這種罕見的融資工具也成為選項，顯示企業希望盡可能向各類型投資人籌資。 Alphabet發債規模高於外界預期的150億美元，認購金額逾1,000億美元。繼甲骨文去年9月發行180億美元債券後，臉書母公司Meta、亞馬遜和Alphabet也持續大舉發債，顯示投資人仍然看好科技業透過舉債來支持其AI擴張。 金融時報引述知情者的消息報導，Alphabet還計劃發行以英鎊計價的3年期到100年期公司債，和以瑞士法郎計價的3年期到25年期公司債。 這兩種貨幣計價的公司債估計最快在10日完成定價，並將是Alphabet首次進入英國和瑞士等債券市場。 Alphabet發行長達百年期的英鎊債引發市場關注，因為自1997年摩托羅拉發行百年債後，首次有科技企業再次挑戰發行百年期債券。 為了在AI軍備競賽中籌集資金，科技巨頭開始採用這種極罕見的融資工具，引發市場對是否重演當年科網股泡沫的擔憂。然而，專家認為Alphabe\n時報資訊 ・ 3 天前 ・ 發表留言\n\n《國際產業》測試階段受挫 蘋果Siri升級再延期 【時報-台北電】據Yahoo Finance報導，手機大廠蘋果的語音助手Siri AI升級版原定於3月系統更新中推出，但在近幾周的測試中發現軟體有問題，不少用戶期待的新功能可能會分批次延後上。 報導引述知情人士消息指出，蘋果原計劃在3月發布的系統更新iOS 26.4中實裝升級版Siri，但在測試中發現Siri有時無法正確處理查詢請求，或處理時間過長，導致必須延期。 消息人士指出最有可能延後的功能，包含了透過語音操作App內部的功能，以及讓Siri能更深入取得個人資料，例如簡訊與電子郵件，在理解用戶意圖後完成更複雜的任務的功能。 以爆料蘋果裝置消息聞名的網路媒體MacRumors則指出，蘋果原本還計劃加入尚未公布的功能，例如生成圖片與網路搜尋，由於這兩項功能已在iOS 26.4測試過，可能仍會包含在3月的更新中。 目前多家外媒指出，蘋果工程師被告知使用iOS 26.5來進行更進階的內部測試，意味著升級版的Siri可能得延期至5月發布的iOS 26.5系統更新，或是9月發布的iOS 27系統更新中推出，等待時間恐超過半年。 由於這項更新最早於2024年6月公布，蘋果公司也表示會在2025年\n時報資訊 ・ 1 天前 ・ 發表留言\n\n熱門新聞\n1\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 2\n\n13.5億威力彩「2得主」買法一模一樣！ 只花100元就翻身 3\n\n郭台銘大紅包發威！央行新台幣發行額首破4.2兆  年增率飆3年最高 4\n\n「新版新台幣」可能有石虎！票選結果曝光 台積電僅排第七 5\n\n【房地產週報】輝達簽約落腳北士科！29年最大交屋潮來襲！新竹預售屋慘崩82.3%！七大都會區交易量年減7成\n\n你可能會喜歡\n你上車了嗎？記憶體登蛇年狂飆主力　前10猛將全曝光 FTNN新聞網\n\n九大工業公會聯合肯定台美貿易協定 強調為產業注入強心針 民視財經網\n\n春節搭車風險升溫！行車保護傘保障出行　花1元即可享百萬保障 三立新聞網 setn.com\n\n外食族吃不消! 海南雞飯漲20元 手搖飲過年期間漲5元 民視財經網影音\n\n「台灣價值」竟沒台灣之光！大盤飆新高00940卻回不到10元　股民哀號：成敗皆這1檔 鏡週刊Mirror Media\n\n緝捕馬杜洛震驚全球 美軍傳動用AI工具Anthropic Claude 鉅亨網\n\n信義房屋：年前家電、家具換新需求高 今日新聞NOWNEWS\n\n台股拉警報！專家警告美股7巨頭集體翻車：最慘開年行情 中時財經即時\n\n鄭麗君團隊立大功！謝金河曝「台美ART簽署」意義：台灣獲1席珍貴位子 三立新聞網 setn.com\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 工商時報\n\n租屋族省很大！租金補貼減輕4成負擔 女性與25歲以下青年成主力 太報\n\n法人兩樣情！華邦電發說利多連發...目標價上看200元 　保守派「4理由」只喊88元 FTNN新聞網\n\n美股掀AI恐慌交易　台積電ADR挫0.47％ CTWANT\n\n陸客不去日本！外媒爆25萬大軍「改衝這國」 刷爆103億不手軟 中時財經即時\n\n金蛇年「大漲萬點」封關！0050領銜市值型ETF悍漲　近十年含息報酬率高達509% FTNN新聞網\n\n台灣賓士對「台美貿易協議」成功達成表達祝賀 並承諾回饋消費者 民視財經網\n\n聯電ADR13日上漲0.13美元漲幅1.26%折台股65.68元 中央社財經\n\n砸5億擴產最快Q2釋產能！PCB股華通衝連3漲　當沖爆量破5萬張登當沖王 FTNN新聞網\n\n輝達下跌、AMD上漲 背後關鍵或在Arista 鉅亨網\n\n美通膨降溫難掩「AI恐慌」! 美股漲跌互見、台積電ADR下跌0.51％ 新頭殼\n\n台美ART簽署》台經院張建一妙喻：台灣付的午餐費 比別人還低 工商時報\n\n大研生醫* 公告本公司股票面額由「新台幣10元」變更為「新台幣1元」，公告期間：114年12月22日至115年3月21日。 Moneydj理財網\n\n外資降評唱衰！大咖投顧逆風喊買面板指標大廠「這檔」　最新目標價曝光 FTNN新聞網\n\n蘇威元：台積電概念股飆漲密碼 這四指標抓飆股一次賺58% 民視財經網影音\n\n春節放假也能追美股！內部數據曝光　過年反而更敢買 三立新聞網 setn.com\n\n記憶體嚴重短缺！美國軍工企業黑名單 移除中國長鑫、長江存儲 自由時報\n\n運載指標／港務公司貨櫃量上看1,390萬TEU 今日新聞NOWNEWS\n\n關稅干擾消失加AI助攻　經濟成長率上修至7.71％ 卡優新聞網\n\n主動式ETF規模破1739億！這檔年化配息率10％　豪配0.377元「年後這天」最後上車日 FTNN新聞網\n\n到全台最夯紫南宮借發財金　主委莊秋安：心存善念有來有保庇 鏡報\n\n新北房市 新莊幸福路商圈 成家首選 工商時報\n\n台美ART 守住重要農產品防線 工商時報\n\n〈能源盤後〉油價因美通膨趨緩回升 周線仍收黑 鉅亨網\n\n13家金控1月獲利全公布！國泰金元月大賺146億元　EPS達0.99元登獲利王 FTNN新聞網\n\n美通膨降溫難掩AI隱憂　美股漲跌互見 太報\n\n〈貴金屬盤後〉黃金、白銀回神 CPI重燃降息預期 鉅亨網\n\n傳統軟體股崩跌回五年前！卡爾先生：掌握這兩點才能存活 民視財經網影音\n\n台股資料來源 臺灣證券交易所 、 臺灣期貨交易所 及 財團法人中華民國證券櫃檯買賣中心 ，國際股市資料來源請參考 Yahoo Finance 。台股行情、個股基本資料及財務資訊為精誠資訊提供。使用Yahoo股市服務前，請您詳閱相關 使用規範與聲明 。\n\n服務條款 隱私權 您的隱私權選擇 加州隱私權通知 © 2026 Yahoo. All rights reserved.\n\n1",
      "Language": "zh",
      "IsSummarized": false
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-02-13",
      "Time": "11:00:00",
      "Source": "The Wall Street Journal",
      "Title": "A Memory-Chip Shortage Is Squeezing Consumer Tech—and It’s Set to Get Worse",
      "URL": "https://finance.yahoo.com/m/9239ad87-3c99-3361-a05b-0acd43f5aa6c/a-memory-chip-shortage-is.html",
      "Content": "Facing soaring prices, the world’s biggest electronics companies are staring at a list of unpalatable responses.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-13",
      "Time": "10:53:21",
      "Source": "Yahoo奇摩股市",
      "Title": "《美股》消息面：川普關稅大棒重擊美民眾；油金齊跌",
      "URL": "https://tw.stock.yahoo.com/news/%E7%BE%8E%E8%82%A1-%E6%B6%88%E6%81%AF%E9%9D%A2-%E5%B7%9D%E6%99%AE%E9%97%9C%E7%A8%85%E5%A4%A7%E6%A3%92%E9%87%8D%E6%93%8A%E7%BE%8E%E6%B0%91%E7%9C%BE-%E6%B2%B9%E9%87%91%E9%BD%8A%E8%B7%8C-025321352.html",
      "Content": "【時報編譯柳繼剛綜合外電報導】消息面：\n●紐約聯邦準備銀行報告指出，川普實施的新關稅政策，承擔進口關稅的對象，竟然90%是美國的老百姓。該份報告表示，去年1到8月之間，約94%的關稅成本已轉嫁給美國企業和消費者，9到10月降至92%，11月則在86%。無獨有偶，美國國會預算辦公室(CBO)前一日發布的報告也指出，外國出口商將承擔5%多出的成本，美企自行吸收30%的進口差價，剩下的部分將藉由漲價的方式轉嫁給民眾。\n\n●美國2月首次申請失業救濟人數，較前一周減少5,000人，降至22.7萬，高於市場預期的22.2萬，接近先前修正後的八周高點。同時，1月持續申請失業救濟人數增加2.1萬，來到186.2萬，持續申請失業救濟人數增加，因冬季風暴衝擊美國多處地方，導致商業活動中斷，造成更多家庭經濟面臨困境。\n\n●現貨金價一度大跌4.06%，每盎司曾跌至4878.24美元，收盤時為4921.85美元，但還是下挫3.2%。同時，現貨銀價一度最多重挫11.71%，低點跌至74.4355美元，收盤每盎司為75.2835，大跌10.71%。\n●紐約期油下跌2.77%，每桶收在62.84美元。同時，布蘭特期油也跌2.71%，每桶收67.52美元。國際能源署(IEA)統計，2025年全球石油庫存大幅增加4.77億桶，創2020年以來數量最多。\n●美匯指數一度漲0.25%至97.074點，目前在96.99點，微幅上漲0.06%。美元兌日圓匯價來到153.28，另外，美元兌一歐元則是0.84價位附近。比特幣在66,492.98美元上下，下跌1.38%。\n\n檢視留言\n\n相關內容\n近九成川普關稅成本由美國人買單！報告打臉白宮外國承擔說 《路透》周四 (12 日) 報導，紐約聯邦準備銀行 (New York Fed) 最新報告指出，美國消費者與企業幾乎承擔了川普政府加徵關稅的全部成本，反駁白宮「關稅由外國出口商負擔」的說法。\n鉅亨網 ・ 1 天前 ・ 1 則留言\n\n紐約聯準銀行報告：美國人承擔川普幾乎全部關稅成本 （中央社紐約2026年02月12日綜合外電報導）紐約聯邦準備銀行（Federal Reserve Bank of New York）今天發布報告指出，美國民眾幾乎承擔了總統川普大幅提高進口關稅所帶來的全部成本。路透社報導，紐約聯準銀行表示，川普對進口商品加徵的關稅中，90%由美國消費者與企業負擔。這份報告反駁了川普政府稱「關稅由外國支付」的說法。報告評估去年關稅對經濟的影響。當時平均關稅稅率從2.6%提升至13%。報告指出，2025年平均稅率明顯波動，在4月與5月達到高峰，當時川普將中國商品進口關稅提高至125%，隨後下調至113%。報告作者根據川普第一任期內的關稅運作進行分析。他們表示，面對這類稅負時，「過去的研究發現，外國出口商並未調降價格，因此關稅的全部成本由美國承擔。也就是說，關稅對進口價格的轉嫁率為100%。」報告指出，去年1月至8月期間，美國人承擔94%的關稅衝擊，9月至10月降至92%，11月則為86%。紐約聯準銀行的研究結果與國會預算處（CBO）昨天發布的報告一致。國會預算處指出，「較高的關稅直接提高進口商品成本，推升美國消費者與企業面臨的價格。」至於誰將承擔關稅成本，\n中央社財經 ・ 21 小時前 ・ 1 則留言\n\n《美股》消息面：美預算赤字恐破表；金銀走高 【時報編譯柳繼剛綜合外電報導】消息面： ●美國財政部的數據顯示，截至一月的2026財年前四個月，聯邦政府預算赤字，已從2025年同期8400億美元，降至6970億美元，減幅達17%。同時，關稅收入達1240億美元，年增逾3倍。光是一月來說，關稅收入就高達300億美元，年增高達2.75倍。川普表示，自己的新關稅政策幫助美國減少78%的貿易逆差，明年貿易將會轉為順差。另方面，美國國會預算辦公室(CBO)示警，2026財年預算赤字估將小增至近1.9兆美元，到了2036年時更是增至3.1兆美元。 ●美國總統川普於美東11日，在白宮會見來訪的以色列總理納坦雅胡，川普會後表示，除了自己堅持要持續與伊朗談判，確定是否能達成協議外，與納坦雅胡並沒有達成任何明確的結論。 ●現貨金一度上漲1.87%，每盎斯高點來到5119.3美元，收在5084.53美元，漲幅為1.17%。另外，現貨銀收在84.3115美元，漲4.35%。印尼政府暗示，將大幅刪減今年鎳礦產能配額，倫敦期鎳每噸收18002.38美元，大漲2.55%。 ●紐約期油一度大漲2.92%，高點每桶來到65.83美元，收漲1.05%，為64.63美元\n時報資訊 ・ 1 天前 ・ 發表留言\n\n《美股》消息面：盧特尼克稱美不會阻礙晶片業；比特幣跌破6.9萬美元 【時報編譯柯婉琇綜合外電報導】消息面： ●ADP公布，在截至1月24日的4周內，美國民間就業每周平均增加6500人，高於前值（5000人），為連續第三周成長，並創下1月3日以來新高。 ●美國2025年12月零售銷售額與11月相比持平，不及市場預期的月增0.4%。排除汽車的零售銷售額亦與11月持平，落後市場預期的月增0.3%。 ●美國石油協會（API）公布，上周（截至2月6日）美國原油庫存大增1340萬桶；前一周為庫存減少1110萬桶。此外，汽油庫存增加330萬桶，包括柴油和取暖油在內的餾分油庫存減少200萬桶。 ●周二在參議院撥款委員會小組出席聽政會時，美國商務部長盧特尼克（Howard Lutnick）表示，美國去年第四季國內生產毛額（GDP）成長率預估將突破5%，而今年第一季可能突破6%。他表示，美元回落至「較自然」的價位，有利於促進美國出口和加速經濟增長，今年製造業就業將出現巨大的增長，有助於美國經濟實現如此強勁的增長。盧特尼克並表示，美國對AI晶片的需求龐大，華盛頓不會想採取任何可能阻礙晶片業發展的措施。 ●克利夫蘭聯準銀行總裁哈馬克（Beth Hammack）表示，聯準會利率\n時報資訊 ・ 2 天前 ・ 1 則留言\n\n美關稅成本 企業自行吸收9成 儘管川普政府不斷聲稱對海外實施的對等關稅，其成本將由外國支付，但根據紐約聯準銀行（Federal Reserve Bank of New York）發布的最新報告指出，在川普政府去年激進調高對等關稅後，事實上高達9成的額外成本都落在美國企業與消費者身上。\n工商時報 ・ 5 小時前 ・ 1 則留言\n\n《產業》美豬恐比加拿大豬便宜 豬農憂店家更不願選用國產豬 【時報-台北電】台美簽訂對等貿易協定，美國豬肉關稅將於第3年降至6.3％～10％。豬農指出，未來美國豬肉關稅減半，價格恐比加拿大豬肉更便宜，殺傷力很大，擔憂愛用進口肉的店家更不願意選購國產豬，盼政府大力輔導國內豬農穩住疫病，提升育成率，提升國產豬在市場競爭力；養豬協會則希望政府能做好產地標示。 養豬青年聯盟理事長張佑誠表示，目前國內餐廳、店家使用進口豬肉為主，其中加拿大豬肉最大宗，未來美國豬肉關稅減一半，可能價格比加拿大豬肉更便宜，殺傷力很大，確實是個隱憂，擔心國內業者更不願意選購國產豬肉。 他也指出，國人一般認為豬肉是便宜蛋白質，若與牛肉差不多價位，通常更傾向選擇吃牛肉，近年數據還顯示豬肉需求越來越少，其實美國也是有好的、無萊劑牛肉，加上0關稅，若未來美牛更便宜，國內豬肉需求又低迷，將打擊台灣原本的市場。 張佑誠表示，台灣豬長期面臨疫病困擾，除了先前的非洲豬瘟，應確實去化廚餘，尤其藍耳病、流行性下痢更需要政府極力輔導豬農穩住疫情，並提升育成率，飼養豬隻成本才可能降低，在消費市場更有競爭力。（新聞來源：中時即時 蔡佩珈）\n時報資訊 ・ 20 小時前 ・ 1 則留言\n\n《國際經濟》美國債務占GDP比重 2036年恐升至120％ 【時報-台北電】美國國會預算辦公室（CBO）11日示警，美國目前正走在一條無法持續的財政道路上，預估到2036年時，國家債務占國內生產毛額（GDP）的比重將從2025年的約99％上升至120％。 CBO報告稱，總統川普去年7月推出財政方案《大而美法案》，延長其2017年的減稅措施，並實施新的稅收優惠，預計將使國家債務在2034年前增加4.2兆美元、在2035年前增加4.7兆美元。預測美國債務總額於2036年攀升至56.15兆美元，占GDP比重達120％，明顯高於2025年的30.17兆美元與99％，預估至2030年占GDP比率便將超越1946年、因二戰債務創下的106％高點。 上述減少措施所增加的債務將超過川普提高進口關稅所帶來的收入，其提出的關稅措施，已將平均有效關稅稅率提高到13％以上，至少為20世紀40年代以來的最高水準。 另估算關稅帶來的額外收入將在未來減少3兆美元的赤字，不過前提是，截至11月20日生效的美國貿易政策在未來十年內保持不變。CBO指出，未來數個月和數年內，除美國最高法院將裁定川普徵收多項關稅是否越權外，未來政府亦可能調整政策方向。 此外，淨利息支出預計將推動赤字\n時報資訊 ・ 1 天前 ・ 發表留言\n\n《產業》美製車0關稅真的來了！8大車商受惠款一次看 未來戰略曝 【時報-台北電】台美正式簽署對等貿易協定，關稅15%不疊加，美製小客車降至零關稅，中小貨車維持一定關稅，具體數字仍待公告。此事將改寫台灣車市走向，業界預估未來美製車的市占率有望挑戰兩成，八大車商也將根據自身狀況決定策略。 早在去年，美製車關稅列入台美關稅談判重點之後，消費者陷入觀望，使去年車市陷入結構調整期，如今關稅確定，初估美製車有望降價一成，目前在台灣販售的美製車款並不少，包括美系特斯拉Model 3、Model Y、Model S及Model X；福特Mustang及Mustang Mach-E等。 另外，Jeep的Wrangler與Cherokee。歐系車款方面，BMW的X3、X4、X5、X6、X7與XM；賓士GLE、GLE Coupe、GLS、EQE SUV與EQS SUV；豐田TOYOTA的Highlander及Sienna；日產Nissan的Rogue及Pathfinder，以及Infiniti的QX60等24款。 若車價調降一成，特斯拉入門款有可能挑戰百萬元大關，但確切狀況仍得依官方公告為主。台灣車市迎來變革，各大車廠擴大開放進口美製車款也是必然，必須使產品線更加豐富才\n時報資訊 ・ 1 天前 ・ 6 則留言\n\n《國際經濟》投資與採購換關稅！ 台美貿易協定塵埃落定 【時報編譯張朝欽綜合外電報導】川普政府官員在周四與台灣簽署了一項最終的互惠貿易協定，其中確認了美國對台灣進口商品徵收15%的關稅，同時要求台灣承諾將按時程計畫取消或降低幾乎所有美國商品的關稅。 美國貿易代表辦公室在周四發表一份文件，其中還指出，台灣將2025年至2029年期間大幅增加對美國商品的購買，其中包括444億美元的液化天然氣(LNG)和原油、152億美元的民航飛機和引擎、252億美元的電網設備、發電機、海洋和鋼鐵製造設備。換言之，台灣在4年內要購買近850億美元的美國能源、飛機和機械設備。 最新的協定將台灣商品的關稅(包括台灣的半導體產業)，從川普最初徵收的20%降至15%。這使得台灣與亞洲出口競爭對手韓國和日本處於同等地位。 賴清德總統在臉書說，台灣另外也獲得2000多種出口到美國的產品免徵關稅，這意味著關稅平均稅率將降至12.33%。 而該協定仍須獲得立法院的通過。 台灣承諾的投資方面，企業將投資2500億美元，其中台積電已經承諾了1000億美元投資。美國商務部長盧特尼克(Howard Lutnick)說，台灣政府另外將擔保2500億美元的投資。 最終的文本沒有詳列投資細節\n時報資訊 ・ 22 小時前 ・ 發表留言\n\n台美敲定貿易最終協議 關稅定調15%、擴大採購美國商品 據《路透》報導，美國川普政府官員已簽署互惠貿易最終協議，確認對自台灣進口商品課徵 15% 的關稅，同時承諾台灣將依時程逐步取消或調降幾乎所有美國商品的關稅。\n鉅亨網 ・ 1 天前 ・ 發表留言\n\n美製車0關稅「車價有望降價1成」？ 網酸：台灣玩法加價賣 關稅調降，價格就一定會跟著降嗎？每當稅制出現鬆動，消費者總是第一時間期待「有感降價」，但市場是否真的照公式走，卻往往成為另一場攻防。近期傳出美製汽車關稅可能從17.5%降至0%，消息一出，網路論壇立刻掀起討論。\nEBC東森財經新聞 ・ 1 天前 ・ 9 則留言\n\n美家庭負債創新高 信用卡債飆破1.28兆美元 MoneyDJ新聞 2026-02-11 12:42:35 李彥瑾 發佈近年美國經濟明顯呈現「K型發展」，在股市屢創高帶動下，高薪階層資產快速累積，低薪族群則受高物價與生活成本攀升衝擊，荷包難以負荷。根據紐約聯準銀行最新公布，截至2025年第四季，美國家庭負債總額已達18.8兆美元，再創歷史新高。 CNBC等外媒報導，紐約聯準銀行10日發表最新報告，截至2025年第四季，美國家庭債務總額成長至18.8兆美元，較前季增加1,910億美元，其中房貸借款占13.17兆美元，顯示房貸仍是美國家庭負債的最大來源。 值得注意的是，美國家庭背負的信用卡債務上升至 1.28兆美元，較2024年同期大增5.5%，反映高物價與關稅壓力擠壓民眾預算，部分家庭為支應日常開銷及節慶消費，藉由刷卡來維持支出，債務自然增加。 此外，第四季整體家庭借款的逾期比率升至4.8%，創2017年以來新高，原因包括關稅政策對就業市場造成外溢衝擊，影響低收入家庭的還款能力，推升家庭部門借款的信用風險。 （圖片來源：iStock） ＊編者按：本文僅供參考之用，並不構成要約、招攬或邀請、誘使、任何不論種類或形式之申述或訂立任何建議及\nMoneydj理財網 ・ 2 天前 ・ 1 則留言\n\n《產業》美國液態乳零關稅衝擊生計 酪農盼總量管制 【時報-台北電】台美今簽署對等貿易協定，美國液態乳將0關稅，酪農指出，美國液態乳進口量占比8成，若零關稅，勢必衝擊我國酪農，經營雪上加霜，期盼政府保護他們，針對進口乳進行總量管制。乳業協會則認為，要加強國產乳與進口乳區隔，原訂7月上路進口乳不得標示為鮮乳、取得鮮乳標章才可標示為鮮乳的規範，希望提早實施。 中華民國酪農協會理事長李恂潭表示，美國液態乳占我國進口量8成，若零關稅，相當於每公斤成本降價15.6元，國內廠商為了盈利，將使用更便宜的進口乳，間接影響國產乳銷量，去年國產乳銷售狀況就已不好，美國液態乳零關稅對酪農來說是雪上加霜。 他指出，酪農民國109年起就配合農業部汰弱留強政策進行減產，能經營至今日已相當不容易，沒有人願意放棄，希望政府保護他們，讓酪農永續經營，呼籲針對進口乳進行總量管制，避免國產乳產量被進口乳擠壓，並維持目前國產乳的年度產量及乳價，讓酪農能渡過難關。 中華民國乳業協會秘書長方清泉則分析，目前美國液態乳及紐西蘭液態乳占我國進口量超過5成，美國液態乳0關稅，價格將更便宜，進口量也會提升，與紐西蘭乳產生競爭。（新聞來源：中時即時 蔡佩珈）\n時報資訊 ・ 16 小時前 ・ 1 則留言\n\n美車叩關 車輛公會籲設轉型基金、進口零件同步免稅 美製車進口關稅調降為零幾成定局，儘管美國進口車年銷僅約1萬輛，規模不大，但車輛公會10日發出聲明，呼籲政府仍不可低估結構性衝擊，並提出設立「汽車產業轉型基金」、「台灣無產製零件同步降為零關稅」，以及啟動「智慧移動與韌性人才計畫」等三大建言，盼開放市場同時，能推出周全配套。\n工商時報 ・ 3 天前 ・ 發表留言\n\n《產業》台美關稅15％不疊加 扣件業者：汽車零組件可能受惠 【時報-台北電】台美雙方正式簽訂「台美對等貿易協定」（ART），未來台灣出口到美國的商品關稅率15％且不疊加，2072項輸美產品也豁免對等關稅，以及232條款關稅最優惠待遇；高雄岡山區扣件業者分析，汽車用扣件有部分適用一般對等關稅架構，若談定15％，估計訂單可能提升；但建築工業用的鋼製扣件，仍屬美國232條款，關稅達50％，就看這次「優惠待遇」到什麼程度。 扣件業者指出，高雄岡山區的螺絲工廠大多生產工業、建築用的鋼製扣件為主，此類商品也是出口到美國的重要品項之一，適用美國232條款，關稅高達50％；這次台美談判提及「232條款關稅最優惠待遇」，業者說，要看優惠到什麼程度，才知道壓力是否減輕。（新聞來源：中時即時 紀爰）\n時報資訊 ・ 17 小時前 ・ 發表留言\n\n美國保健品降關稅　業者：市場衝擊有限、短期難降價 （中央社記者何秀玲台北2026年2月13日電）台美對等貿易協定完成簽署，進口美國保健食品關稅自30%降至10%。市場關注是否帶動終端售價下修，藥局、保健品廠商認為，短期須觀察庫存消化與品牌定價策略，不見得會出現降價潮；長期來看，台灣保健品仍具有在地生產和品質優勢。台灣保健營養食品公會創會理事長陳威仁表示，過去受到高關稅及疫情期間供應鏈不穩影響，不少外商為降低成本與確保出貨穩定，會選擇委託台灣廠商代工生產，以避開高關稅。如今關稅調降，若美國品牌改回美國生產，再出口至台灣，可能對本土代工業者形成壓力。對消費者影響方面，陳威仁指出，民眾當然期待美國保健食品價格能隨關稅下降，反映在售價上。他呼籲政府，關稅調降後，應監督廠商是否確實將成本降低回饋消費者，而非僅讓進口端受益。大樹藥局(6469)表示，若關稅調降，品牌商能回饋給消費者，是藥局所樂見。美國品牌若有貿易優勢，應該會提高進口比例；至於是否會壓縮台灣本土品牌貨架，需看台灣廠商因應方式。佑全保健藥妝(6929)總經理文德蘭向中央社記者表示，雖美國保健食品關稅調降，但實際衝擊有限。她指出，台灣食藥署對保健食品的法規管理嚴格，無論是成分規範、標示\n中央社財經 ・ 14 小時前 ・ 發表留言\n\n美製車零關稅車商卻不降價？經長龔明鑫坦言了：自由市場無法干預 台美簽訂貿易協定，美製車關稅確定將會降至0%，國內消費者相當期待車價因此下降，然而也有不少人擔憂關稅成本下降若沒有反映於車價該怎麼辦？經濟部長龔明鑫對此表示，台灣是自由市場，無法干涉定價策略，但如果超乎合理的範圍，會將成本提供給消費者參考。\nYahoo股市 ・ 16 小時前 ・ 235 則留言\n\n《國際產業》不能只給台積電甜頭 傳川普即將祭晶片稅 這群可豁免 【時報編譯柯婉琇綜合外電報導】《金融時報》報導，據知情的美國政府官員透露，川普政府即將實施晶片關稅，但擬給予在美國積極佈建AI資料中心的亞馬遜、Google、微軟等科技巨頭豁免待遇，且這些豁免將與台積電的投資承諾掛鉤。 報導指出，這項由美國商務部審批的關稅豁免，將與最近達成的美台貿易協議相結合。台積電依據這項貿易協議取得的關稅豁免配額可分配給美國大型科技公司，好讓這些客戶能免稅進口台積電的晶片。 報導稱這項關稅豁免計畫凸顯出川普政府開徵晶片關稅、促進本地製造晶片的決心，同時也給高度仰賴進口半導體、正在美國推動AI快速發展的科技公司提供緩衝空間。 受訪的美國政府官員表示，相關計劃尚未拍板，也尚未獲得川普簽署。 美國政府官員透露，美方在計畫公布後，會像老鷹一樣緊盯後續進展，「以確保我們能透過關稅和退稅切實達成目標，也可避免這最終演變成只給台積電送上大禮」。 美國商務部在1月中旬宣布與台灣達成貿易協議，台灣晶片和科技公司將在美國投資至少2500億美元生產晶片和打造晶片工廠，而台灣政府將為這些公司提供信貸擔保2500億美元。作為交換條件，美方將給予台灣「15%且不疊加」的對等關稅稅率，並承諾對\n時報資訊 ・ 3 天前 ・ 發表留言\n\n進口美國保健食品關稅降至10%　產業憂衝擊代工 （中央社記者曾以寧台北2026年02月13日電）台美對等貿易協定今天完成簽署，進口美國保健食品關稅自30%降至10%。產業界指出，為美代工恐將受衝擊；藥界表示將須政府協助創造獨立品牌、加強國際行銷，是挑戰也是契機。台灣保健營養食品公會創會理事長陳威仁今天指出，過去美國廠商會委託在地製造，國內部分製造廠接美國訂單進行代工；在關稅降低後，預期這些訂單可能會回到美國本土製造、直接從美國輸入；不過美國保健營養食品劑型和規格，仍與國內需求有差異。陳威仁說，產業界先前建議美國保健食品關稅分5年逐步降至20%，整體仍要視談判情況、以大局為重，確保民眾可享受零售降價福利；也希望政府多加支持國內保健食品製造業，台灣出口美國關稅能自15%往下降。對於外銷，陳威仁說，國內保健營養食品業者不少是從藥界跨足，以益生菌為例，國內業者發酵、濃縮、製劑技術都很強，因此在外銷上都具有良好競爭力，現有市場包含馬來西亞、中國大陸、日本等國。中華民國藥師公會全國聯合會榮譽理事長黃金舜說，此次關稅調整，對台灣保健食品、藥品業者是挑戰也是契機；未來代工機會減少，台灣應集結力量創造獨立品牌加強行銷，國內業者較缺乏國際經驗，將需政府\n中央社財經 ・ 18 小時前 ・ 發表留言\n\n紐約Fed調查：1月通膨預期降溫 就業場信心略有回升 根據紐約聯邦準備銀行 (NY Fed) 周一 (9 日) 最新公布的調查，美國消費者在 1 月對短期通膨與就業市場的看法略有改善，顯示家庭對物價與勞動前景的擔憂有所緩解。\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n熱門新聞\n1\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 2\n\n13.5億威力彩「2得主」買法一模一樣！ 只花100元就翻身 3\n\n郭台銘大紅包發威！央行新台幣發行額首破4.2兆  年增率飆3年最高 4\n\n「新版新台幣」可能有石虎！票選結果曝光 台積電僅排第七 5\n\n【房地產週報】輝達簽約落腳北士科！29年最大交屋潮來襲！新竹預售屋慘崩82.3%！七大都會區交易量年減7成\n\n你可能會喜歡\n你上車了嗎？記憶體登蛇年狂飆主力　前10猛將全曝光 FTNN新聞網\n\n九大工業公會聯合肯定台美貿易協定 強調為產業注入強心針 民視財經網\n\n春節搭車風險升溫！行車保護傘保障出行　花1元即可享百萬保障 三立新聞網 setn.com\n\n「台灣價值」竟沒台灣之光！大盤飆新高00940卻回不到10元　股民哀號：成敗皆這1檔 鏡週刊Mirror Media\n\n緝捕馬杜洛震驚全球 美軍傳動用AI工具Anthropic Claude 鉅亨網\n\n信義房屋：年前家電、家具換新需求高 今日新聞NOWNEWS\n\n台股拉警報！專家警告美股7巨頭集體翻車：最慘開年行情 中時財經即時\n\n鄭麗君團隊立大功！謝金河曝「台美ART簽署」意義：台灣獲1席珍貴位子 三立新聞網 setn.com\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 工商時報\n\n租屋族省很大！租金補貼減輕4成負擔 女性與25歲以下青年成主力 太報\n\n法人兩樣情！華邦電發說利多連發...目標價上看200元 　保守派「4理由」只喊88元 FTNN新聞網\n\n美股掀AI恐慌交易　台積電ADR挫0.47％ CTWANT\n\n外食族吃不消! 海南雞飯漲20元 手搖飲過年期間漲5元 民視財經網影音\n\n陸客不去日本！外媒爆25萬大軍「改衝這國」 刷爆103億不手軟 中時財經即時\n\n金蛇年「大漲萬點」封關！0050領銜市值型ETF悍漲　近十年含息報酬率高達509% FTNN新聞網\n\n台灣賓士對「台美貿易協議」成功達成表達祝賀 並承諾回饋消費者 民視財經網\n\n聯電ADR13日上漲0.13美元漲幅1.26%折台股65.68元 中央社財經\n\n砸5億擴產最快Q2釋產能！PCB股華通衝連3漲　當沖爆量破5萬張登當沖王 FTNN新聞網\n\n輝達下跌、AMD上漲 背後關鍵或在Arista 鉅亨網\n\n美通膨降溫難掩「AI恐慌」! 美股漲跌互見、台積電ADR下跌0.51％ 新頭殼\n\n台美ART簽署》台經院張建一妙喻：台灣付的午餐費 比別人還低 工商時報\n\n大研生醫* 公告本公司股票面額由「新台幣10元」變更為「新台幣1元」，公告期間：114年12月22日至115年3月21日。 Moneydj理財網\n\n外資降評唱衰！大咖投顧逆風喊買面板指標大廠「這檔」　最新目標價曝光 FTNN新聞網\n\n春節放假也能追美股！內部數據曝光　過年反而更敢買 三立新聞網 setn.com\n\n記憶體嚴重短缺！美國軍工企業黑名單 移除中國長鑫、長江存儲 自由時報\n\n蘇威元：台積電概念股飆漲密碼 這四指標抓飆股一次賺58% 民視財經網影音\n\n運載指標／港務公司貨櫃量上看1,390萬TEU 今日新聞NOWNEWS\n\n關稅干擾消失加AI助攻　經濟成長率上修至7.71％ 卡優新聞網\n\n主動式ETF規模破1739億！這檔年化配息率10％　豪配0.377元「年後這天」最後上車日 FTNN新聞網\n\n到全台最夯紫南宮借發財金　主委莊秋安：心存善念有來有保庇 鏡報\n\n新北房市 新莊幸福路商圈 成家首選 工商時報\n\n台美ART 守住重要農產品防線 工商時報\n\n〈能源盤後〉油價因美通膨趨緩回升 周線仍收黑 鉅亨網\n\n13家金控1月獲利全公布！國泰金元月大賺146億元　EPS達0.99元登獲利王 FTNN新聞網\n\n美通膨降溫難掩AI隱憂　美股漲跌互見 太報\n\n〈貴金屬盤後〉黃金、白銀回神 CPI重燃降息預期 鉅亨網\n\n傳統軟體股崩跌回五年前！卡爾先生：掌握這兩點才能存活 民視財經網影音\n\n台股資料來源 臺灣證券交易所 、 臺灣期貨交易所 及 財團法人中華民國證券櫃檯買賣中心 ，國際股市資料來源請參考 Yahoo Finance 。台股行情、個股基本資料及財務資訊為精誠資訊提供。使用Yahoo股市服務前，請您詳閱相關 使用規範與聲明 。\n\n服務條款 隱私權 您的隱私權選擇 加州隱私權通知 © 2026 Yahoo. All rights reserved.\n\n1",
      "Language": "zh",
      "IsSummarized": false
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-02-13",
      "Time": "09:42:00",
      "Source": "Motley Fool",
      "Title": "The Best Stocks to Buy With $1,000 Right Now",
      "URL": "https://finance.yahoo.com/m/ab7acddd-2bea-3a35-9523-ad0dac43896e/the-best-stocks-to-buy-with.html",
      "Content": "Got some idle money you're ready to put to work for a while? Is there $1,000 you have available (or any amount, really) that you'd like to turn into something more? That's easier said than done right now. Too many stocks have demonstrated a bit too much vulnerability of late. Another wave of weakness feels possible.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-13",
      "Time": "08:10:30",
      "Source": "Yahoo奇摩股市",
      "Title": "《美股》收盤速報：美股下挫 費半大跌",
      "URL": "https://tw.stock.yahoo.com/news/%E7%BE%8E%E8%82%A1-%E6%94%B6%E7%9B%A4%E9%80%9F%E5%A0%B1-%E7%BE%8E%E8%82%A1%E4%B8%8B%E6%8C%AB-%E8%B2%BB%E5%8D%8A%E5%A4%A7%E8%B7%8C-001030571.html",
      "Content": "【時報-台北電】美股三大指數周四(12日)全部下挫，大跌2%的那指跌幅最大。暴跌12%的思科領跌，這家網路硬體製造商最新財報雖亮眼，但本季營運展望卻不如預期。另外，因憂心AI可能取代人力，恐造成部分行業出現失業潮，因此多家著名的美企紛紛重挫，例如，摩根士丹利大跌近5%，卡車物流公司C.H. Robinson暴跌15%， 不動產業者CBRE大跌9%，房地產投資信託公司SL Green Realty也大跌約5%。費半下挫超過2%，NVIDIA、台積電ADR、博通、英特爾以及AMD都表現不佳，只有美光逆勢上漲近1%。\n★四大指數\n\n美股道瓊下跌669.42點或1.34%，收49,451.98點。\n\nS&P500下跌108.71點或1.57%，收6,832.76點。\nNASDAQ下跌469.32點或2.04%，收22,597.15點。\n費城半導體下跌207.16點或2.50%，收8,084.70點。\n★11大類股\n公用事業類股(SPLRCU)漲1.50% 必需消費類股(SPLRCS)漲1.28%\n房地產類股(SPLRCREC)漲0.31% 醫療類股(SPXHC)跌0.17%\n工業類股(SPLRCI)跌1.20% 通訊服務類股(SPLRCL)跌1.46%\n原物料類股(SPLRCM)跌1.49% 非必需消費類股(SPLRCD)跌1.58%\n金融類股(SPSY)跌1.99% 能源類股(SPNY)跌2.17%\n科技類股(SPLRCT)跌2.65%\n★重磅科技股\n1.五大市值股\n微軟(MSFT)下跌0.63%，收401.84美元。\n蘋果(AAPL)下跌5.00%，收261.73美元。\n輝達(NVDA)下跌1.64%，收186.94美元。\nAlphabet(GOOGL)下跌0.63%，收309.00美元。\n亞馬遜(AMZN)下跌2.20%，收199.60美元。\n2.焦點股\n美光(MU)上漲0.88%，收413.97美元。\nSalesforce(CRM)上漲0.23%，收185.43美元。\n甲骨文(ORCL)下跌0.43%，收156.48美元。\n微軟(MSFT)下跌0.63%，收401.84美元。\nAlphabet(GOOGL)下跌0.63%，收309.00美元。\n德州儀器(TXN)下跌1.57%，收223.00美元。\n輝達(NVDA)下跌1.64%，收186.94美元。\n高通(QCOM)下跌1.82%，收138.47美元。\n艾司摩爾(ASML)下跌2.00%，收1406.87美元。\n亞馬遜(AMZN)下跌2.20%，收199.60美元。\n安謀(ARM)下跌2.47%，收122.19美元。\n特斯拉(TSLA)下跌2.62%，收417.07美元。\nMeta(Meta)下跌2.82%，收649.81美元。\n恩智浦(NXPI)下跌3.03%，收242.19美元。\n應用材料(AMAT)下跌3.38%，收328.39美元。\n博通(AVGO)下跌3.38%，收331.17美元。\n超微(AMD)下跌3.58%，收205.94美元。\n英特爾(INTC)下跌3.75%，收46.48美元。\n網飛(NFLX)下跌4.72%，收75.86美元。\nIBM(IBM)下跌4.87%，收259.52美元。\n蘋果(AAPL)下跌5.00%，收261.73美元。\n美超微(SMCI)下跌5.03%，收30.43美元。\n慧與科技(HPE)下跌6.76%，收22.20美元。\n戴爾科技(DELL)下跌9.13%，收112.82美元。\n思科(CSCO)下跌12.32%，收75.00美元。\n★台股 ADR\n台積電下跌5.99美元或1.60%，收368.10美元，換算台股價格為2316.09元。\n聯電下跌0.01美元或0.10%，收10.29美元，換算台股價格為64.74元。\n日月光下跌0.28美元或1.18%，收23.46美元，換算台股價格為369.03元。\n中華電信上漲0.35美元或0.82%，收42.79美元，換算台股價格為134.62元。(編輯：柳繼剛)\n\n檢視留言\n\n相關內容\n【公告】國巨*受邀參加由摩根士丹利證券舉辦之線上法說會，說明114年第四季營運成果 日 期：2026年02月12日公司名稱：國巨*(2327)主 旨：國巨*受邀參加由摩根士丹利證券舉辦之線上法說會，說明114年第四季營運成果發言人：張天成說 明：符合條款第四條第XX款：12事實發生日：115/02/251.召開法人說明會之日期：115/02/252.召開法人說明會之時間：16 時 00 分3.召開法人說明會之地點：線上電話會議4.法人說明會擇要訊息：本公司於115/02/25受邀參加由摩根士丹利證券舉辦之線上法說會，說明114年第四季營運成果，並就公司營運展望及產業概況向投資機構做說明。5.其他應敘明事項：公司網站https://www.yageogroup.com/About/InvestorRelations/InvestorConference完整財務業務資訊請至公開資訊觀測站之法人說明會一覽表或法說會項目下查閱。\n中央社財經 ・ 1 天前 ・ 發表留言\n\n《電零組》國巨* 2月25日受邀參加摩根士丹利證券舉辦線上法說會 【時報-台北電】國巨*(2327)將於115年2月25日受邀參加由摩根士丹利證券舉辦之線上法說會，說明114年第四季營運成果，並就公司營運展望及產業概況向投資機構做說明。（編輯：沈培華）\n時報資訊 ・ 1 天前 ・ 發表留言\n\n大摩：這5檔軟體股今年有機會翻倍 據《Investopedia》報導，摩根士丹利 (Morgan Stanley) 分析師認為，軟體股今年以來雖然重挫，但並未出局。若 AI 恐慌情緒消退，股價回歸其所認定的合理價值，其追蹤的 5 檔軟體股未來 12 個月內有機會翻倍。\n鉅亨網 ・ 1 天前 ・ 發表留言\n\n《台北股市》新商機貢獻尚早 大摩降評面板雙虎 【時報-台北電】摩根士丹利證券指出，台系面板供應鏈股價經過先前一波大漲，股價淨值比（PB）來到0.8倍，面板報價上漲循環的利多已經大致反映在股價上，報酬風險比變得不甚具吸引力，降評友達「中立」，對群創（3481）投資評等同樣為「中立」，且推測合理股價僅19.5元。 除面板報價反彈因素，市場近期高度關注群創的扇出型封裝（FOPLP）進展，及友達（2409）在低軌衛星天線潛在機會，帶動股價高漲。摩根士丹利指出，雖然這些新應用確實有助面板廠活化既有產能，並延伸技術優勢，但現階段對營收與獲利貢獻有限，追逐友達、群創言之過早，也就是說，市場熱情可能過度反應，足以解釋為何股價近期陷入回檔。 觀察台股10日在台積電一馬當先強漲帶動下氣勢如虹，終場大漲逾2％，不少熱門族群均共襄盛舉，激勵加權指數在封關倒數之際衝上33K新高，反觀面板雙虎先前雖曾是多頭焦點，但近期股價均處回檔路上，10日雙雙小跌、並未參與大盤創新高行情。 摩根士丹利證券元月初看多面板產業時提出，在品牌廠提前回補庫存，以及面板廠持續維持供給紀律帶動下，電視面板價格自1月起開始回升，上月電視面板平均價格已月增1％，預期2月將進一步月增約2％\n時報資訊 ・ 3 天前 ・ 1 則留言\n\n面板雙虎短線利多出盡？友達遭大摩降評 群創目標價下修至19.5元 摩根士丹利證券指出，台系面板供應鏈股價經過先前一波大漲，股價淨值比來到0.8倍，面板報價上漲循環的利多已經大致反映在股價上，報酬風險比變得不甚具吸引力，降評友達（2409）「中立」，對群創（3481）投資評等同樣為「中立」，且推測合理股價僅19.5元。\n中時財經即時 ・ 3 天前 ・ 1 則留言\n\n新商機貢獻尚早 大摩降評面板雙虎 摩根士丹利證券指出，台系面板供應鏈股價經過先前一波大漲，股價淨值比（PB）來到0.8倍，面板報價上漲循環的利多已經大致反映在股價上，報酬風險比變得不甚具吸引力，降評友達「中立」，對群創（3481）投資評等同樣為「中立」，且推測合理股價僅19.5元。\n工商時報 ・ 3 天前 ・ 發表留言\n\n摩根士丹利仍看好軟體股！拋「六大」關鍵數據看好後市 Anthropic 推出的 Claude AI 上週引發科技股劇烈震盪，市場擔憂 AI 題材是否見頂。摩根士丹利策略主管 Mike Wilson 指出，AI 生態系基本面順風仍在，軟體股估值降溫、成長動能強勁，「AI 採\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n國巨* 本公司受邀參加由摩根士丹利證券舉辦之線上法說會，說明114年第四季營運成果 公開資訊觀測站重大訊息公告(2327)國巨*-本公司受邀參加由摩根士丹利證券舉辦之線上法說會，說明114年第四季營運成果符合條款第四條第XX款：12事實發生日：115/02/251.召開法人說明會之日期：115/02/252.召開法人說明會之時間：16 時 00 分 3.召開法人說明會之地點：線上電話會議4.法人說明會擇要訊息：本公司於115/02/25受邀參加由摩根士丹利證券舉辦之線上法說會，說明114年第四季營運成果，並就公司營運展望及產業概況向投資機構做說明。5.其他應敘明事項：公司網站https://www.yageogroup.com/About/InvestorRelations/InvestorConference完整財務業務資訊請至公開資訊觀測站之法人說明會一覽表或法說會項目下查閱。延伸閱讀：國巨*2/25參加由摩根士丹利證券舉辦之線上法說會國巨*114年度財報，預計2/25提報董事會 資料來源-MoneyDJ理財網\nMoneydj理財網 ・ 1 天前 ・ 發表留言\n\n15年來最嚴重記憶體荒正在逼近！高盛：縱使消費端需求崩塌也無法阻止 市場研究公司 Counterpoint 周一 (9 日) 表示，截至 2026 年第一季，記憶體價格較去年第四季上漲 80% 至 90%，迎來前所未有的創紀錄漲幅。 高盛日前也發布研究報告指出，2026-2027 年全球記憶體市場將經歷史上最嚴重的供應短缺之一，DRAM、NAN\n鉅亨網 ・ 3 天前 ・ 1 則留言\n\n摩根士丹利策略師Wilson稱，科技股拋售後，AI類股存在上漲空間 【財訊快報／劉敏夫】外電報導指出，摩根士丹利表示，儘管近期人工智能股票交易波動劇烈且有關資本支出的質疑不斷，但是該類股仍有進一步上漲空間。由Michael Wilson領導的摩根士丹利策略分析師團隊指出，市場對人工智能應用企業的估值仍顯不足，而人工智能賦能企業仍具備基本面利多。同時，科技巨頭的預期未來營收成長率已升至數十年高點。值得注意的是，科技七巨頭的預期本益比已降至27倍。同時，美元走弱將提振科技巨頭業績，因其國際銷售業務比重較高。此外，摩根士丹利軟體團隊認為微軟、財捷集團、Salesforce、ServiceNow、Atlassian、Snowflake、Shopify、Cloudflare及派拓網絡公司存在「誘人買入點」。\n財訊快報 ・ 4 天前 ・ 發表留言\n\nAI稅務工具問世 傳統金融股賣壓席捲 《CNBC》報導，人工智慧 (AI) 顛覆疑慮在重創軟體股之後，週二 (10 日) 開始蔓延至金融服務產業\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n馬斯克豪賭太陽能 大摩看好特斯拉能源估值上看1900億美元 根據摩根士丹利 (Morgan Stanley) 分析，馬斯克 (Elon Musk) 計劃將特斯拉 (Tesla)(TSLA-US) 打造為大型太陽能生產商，可能讓公司能源事業的估值再增加 500 億美元。不過，要達成這個目標，公司勢\n鉅亨網 ・ 2 天前 ・ 發表留言\n\n美股小型股獲利表現強勁 羅素2000迎來十年最強漲勢 隨著美國經濟展現韌性，小型股正迎來近年來最亮眼的財報季。這股強勁的獲利動能顯示，市場資金從科技巨頭轉向小型企業的「市場輪動」趨勢，仍有進一步發展的空間。\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n剛降評就認錯買回？封關日三大法人20.7億元狂砸「這檔」　外資、投信、自營商都掃瘋了 [FTNN新聞網]記者何亞軒／綜合報導台股加權指數今（11）日收盤33,605.71點，漲532.74點，漲幅1.61%，三大法人合計買超578.25億元，觀察今日三大法人買超個股...\nFTNN新聞網 ・ 2 天前 ・ 1 則留言\n\n信驊目標價 大摩給出同花順12,345元 摩根士丹利證券指出，全球雲端資本支出今年可望再年增57％，來到7,350億美元，看好雲端半導體將能持續受惠於CPU、GPU與ASIC伺服器的成長，且在強力需求帶動下，毛利率也會進一步上升，股王信驊受惠程度鮮明，將推測合理股價由9,999元，拉高至12,345元。\n工商時報 ・ 1 天前 ・ 1 則留言\n\n科技股修正後更好買？摩根士丹利：AI續撐行情 《彭博》周一 (9 日) 報導，摩根士丹利策略師指出，在人工智慧 (AI) 題材持續發酵、企業銷售前景支撐下，美國科技股仍具備進一步上漲空間。該投行認為，近期市場波動反而使部分大型科技股的估值回落，為投資人提供新的進場機會。\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n白領訓練替代者！微軟AI主管預警：留給這些職業從業人員的準備時間只剩12-18個月 微軟 AI 業務負責人 Mustafa Suleyman 向全球勞動市場投下震撼彈，在接受《金融時報》專訪時發出迄今最激進的自動化預警稱，未來 12-18 個月內，律師、會計師、專案經理等白領職業的「大多數任務」將被 AI 全面接管。 Suleyman 預測的這一時程比商界普遍\n鉅亨網 ・ 21 小時前 ・ 發表留言\n\nAlphabet美元債籌資200億美元超預期，並罕見發行100年期英鎊債 【財訊快報／陳孟朔】谷歌(Google)母公司Alphabet(A股代碼GOOG)週一通過發行美元債券籌集200億美元，規模遠超原定的150億美元目標。由於投資人對人工智能(AI)相關資產需求空前旺盛，此次發行吸引超過1000億美元的認購訂單，創下企業債發行史上最強勁的需求紀錄之一。Alphabet股價連續四天急跌20.83美元6.1%後，週一小彈1.46美元或0.45%，報324.32美元，開春以來漲3.62%。除了美元債外，Alphabet首度進軍瑞士與英國市場。其中最受矚目是擬發行期限高達100年的英鎊債券，這將是自1997年摩托羅拉(Motorola)以來，首家發行百年期債券的科技公司。英國市場因養老基金與保險商對超長期債券需求旺盛，成為Alphabet鎖定長線融資的首選。Alphabet上週宣布，由於斥巨資建設AI數據中心，2026年資本支出預計高達1850億美元，超過過去三年的總和。摩根士丹利(大摩)預計，包含Alphabet、亞馬遜、Meta與微軟在內的四大雲端巨頭，2026年總借款規模將激增至4000億美元，推動投資級債券發行總額達到創紀錄的2.25兆美元。市場觀察人士\n財訊快報 ・ 4 天前 ・ 發表留言\n\nAI巨浪衝擊金融產業　美資產管理公司股價大跌 （中央社記者廖漢原紐約2026年02月10日專電）美股3大指數今天漲跌互見，不過AI巨浪今天衝擊金融服務業，嘉信理財與交易商利普樂金融集團（LPLFinancial）等股價大跌。分析師認為，資產管理業並未出現本質變化，但受AI題材影響的產業都很脆弱。美國道瓊工業指數今天守住5萬點關卡，人工智慧浪潮繼續衝擊商業功能可能被取代的行業，投資理財相關業者股價10日顯著下挫。市場認為AI將協助民眾投資及資產管理，傳統投顧的功能降低，衝擊金融諮詢服務業的營利前景。綜合性資產管理暨投資顧問公司嘉信理財集團（Charles Schwab）大跌7.42%、雷蒙詹姆斯（Raymond James）跌幅達8.75%、阿默普萊斯金融（Ameriprise Financial）下跌6.21%、摩根士丹利（Morgan Stanley）下跌2.45%。美國AI業者近期推出稅務計畫軟體，從高資產人士到一般上班族，都可使用人工智慧高效處理繁雜的申報及節稅程序，其中以資產保管平台Altruist推出的Hazel最受矚目，企業與使用者可透過AI功能一站完成開戶、交易、資產保管、結算與稅務等功能。大型獨立經紀交易商利普樂金\n中央社財經 ・ 3 天前 ・ 發表留言\n\nAlphabet全球發債募資320億美元，罕見「百年債」獲超額認購 【財訊快報／陳孟朔】為了在人工智慧(AI)競賽中保持領先地位，Google母公司Alphabet(美股代碼GOOG)於24小時內在全球信貸市場展開大規模募資。在週一發行200億美元的美元債後，隨即轉戰英鎊與瑞郎市場，合計募集約320億美元(約新台幣1.02兆元)。此次發債規模不僅刷新多項紀錄，更推出自科技泡沫時代以來極為罕見的「100年期」英鎊債，顯示市場對科技巨頭長期信用的強烈信心。本次發債獲得各國投資者熱烈追捧，美元債部分認購金額突破1000億美元；其中最受矚目的10億英鎊「百年債」，超額認購倍數近10倍。這是自1997年摩托羅拉(Motorola)以來，科技公司首次發行如此極端期限的債券。對於通常面臨技術淘汰風險的科技業而言，發行百年債極其罕見，但受到偏好超長期債券的英國養老基金與保險商青睞，該筆債券最終定價較英國基準國債溢價120個基點。Alphabet上週宣佈將今年資本支出大幅調升至1850億美元，規模達去年的兩倍，主要用於興建AI數據中心與採購輝達(Nvidia)等高效能晶片。儘管Alphabet目前坐擁超過1250億美元的現金儲備，但在超大規模雲端服務商的貸款競賽中，Al\n財訊快報 ・ 3 天前 ・ 發表留言\n\n熱門新聞\n1\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 2\n\n13.5億威力彩「2得主」買法一模一樣！ 只花100元就翻身 3\n\n郭台銘大紅包發威！央行新台幣發行額首破4.2兆  年增率飆3年最高 4\n\n「新版新台幣」可能有石虎！票選結果曝光 台積電僅排第七 5\n\n【房地產週報】輝達簽約落腳北士科！29年最大交屋潮來襲！新竹預售屋慘崩82.3%！七大都會區交易量年減7成\n\n你可能會喜歡\n你上車了嗎？記憶體登蛇年狂飆主力　前10猛將全曝光 FTNN新聞網\n\n九大工業公會聯合肯定台美貿易協定 強調為產業注入強心針 民視財經網\n\n春節搭車風險升溫！行車保護傘保障出行　花1元即可享百萬保障 三立新聞網 setn.com\n\n「台灣價值」竟沒台灣之光！大盤飆新高00940卻回不到10元　股民哀號：成敗皆這1檔 鏡週刊Mirror Media\n\n外食族吃不消! 海南雞飯漲20元 手搖飲過年期間漲5元 民視財經網影音\n\n緝捕馬杜洛震驚全球 美軍傳動用AI工具Anthropic Claude 鉅亨網\n\n信義房屋：年前家電、家具換新需求高 今日新聞NOWNEWS\n\n台股拉警報！專家警告美股7巨頭集體翻車：最慘開年行情 中時財經即時\n\n鄭麗君團隊立大功！謝金河曝「台美ART簽署」意義：台灣獲1席珍貴位子 三立新聞網 setn.com\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 工商時報\n\n租屋族省很大！租金補貼減輕4成負擔 女性與25歲以下青年成主力 太報\n\n法人兩樣情！華邦電發說利多連發...目標價上看200元 　保守派「4理由」只喊88元 FTNN新聞網\n\n美股掀AI恐慌交易　台積電ADR挫0.47％ CTWANT\n\n陸客不去日本！外媒爆25萬大軍「改衝這國」 刷爆103億不手軟 中時財經即時\n\n金蛇年「大漲萬點」封關！0050領銜市值型ETF悍漲　近十年含息報酬率高達509% FTNN新聞網\n\n台灣賓士對「台美貿易協議」成功達成表達祝賀 並承諾回饋消費者 民視財經網\n\n砸5億擴產最快Q2釋產能！PCB股華通衝連3漲　當沖爆量破5萬張登當沖王 FTNN新聞網\n\n輝達下跌、AMD上漲 背後關鍵或在Arista 鉅亨網\n\n台美ART簽署》台經院張建一妙喻：台灣付的午餐費 比別人還低 工商時報\n\n美通膨降溫難掩「AI恐慌」! 美股漲跌互見、台積電ADR下跌0.51％ 新頭殼\n\n大研生醫* 公告本公司股票面額由「新台幣10元」變更為「新台幣1元」，公告期間：114年12月22日至115年3月21日。 Moneydj理財網\n\n外資降評唱衰！大咖投顧逆風喊買面板指標大廠「這檔」　最新目標價曝光 FTNN新聞網\n\n春節放假也能追美股！內部數據曝光　過年反而更敢買 三立新聞網 setn.com\n\n記憶體嚴重短缺！美國軍工企業黑名單 移除中國長鑫、長江存儲 自由時報\n\n運載指標／港務公司貨櫃量上看1,390萬TEU 今日新聞NOWNEWS\n\n蘇威元：台積電概念股飆漲密碼 這四指標抓飆股一次賺58% 民視財經網影音\n\n關稅干擾消失加AI助攻　經濟成長率上修至7.71％ 卡優新聞網\n\n台積電ADR13日下跌1.74美元跌幅0.47%折台股2309.39元 中央社財經\n\n到全台最夯紫南宮借發財金　主委莊秋安：心存善念有來有保庇 鏡報\n\n新北房市 新莊幸福路商圈 成家首選 工商時報\n\n台美ART 守住重要農產品防線 工商時報\n\n〈能源盤後〉油價因美通膨趨緩回升 周線仍收黑 鉅亨網\n\n主動式ETF規模破1739億！這檔年化配息率10％　豪配0.377元「年後這天」最後上車日 FTNN新聞網\n\n13家金控1月獲利全公布！國泰金元月大賺146億元　EPS達0.99元登獲利王 FTNN新聞網\n\n美通膨降溫難掩AI隱憂　美股漲跌互見 太報\n\n〈貴金屬盤後〉黃金、白銀回神 CPI重燃降息預期 鉅亨網\n\n傳統軟體股崩跌回五年前！卡爾先生：掌握這兩點才能存活 民視財經網影音\n\n台股資料來源 臺灣證券交易所 、 臺灣期貨交易所 及 財團法人中華民國證券櫃檯買賣中心 ，國際股市資料來源請參考 Yahoo Finance 。台股行情、個股基本資料及財務資訊為精誠資訊提供。使用Yahoo股市服務前，請您詳閱相關 使用規範與聲明 。\n\n服務條款 隱私權 您的隱私權選擇 加州隱私權通知 © 2026 Yahoo. All rights reserved.\n\n1",
      "Language": "zh",
      "IsSummarized": false
    },
    {
      "Ticker": "ADI",
      "Date": "2026-02-13",
      "Time": "07:00:01",
      "Source": "Zacks",
      "Title": "Here's Why Analog Devices (ADI) Fell More Than Broader Market",
      "URL": "https://finance.yahoo.com/news/heres-why-analog-devices-adi-230001477.html",
      "Content": "Analog Devices (ADI) closed the most recent trading day at $331.36, moving -1.67% from the previous trading session. This move lagged the S&P 500's daily loss of 1.57%. Meanwhile, the Dow lost 1.34%, and the Nasdaq, a tech-heavy index, lost 2.04%.\nPrior to today's trading, shares of the semiconductor maker had gained 13.09% outpaced the Computer and Technology sector's loss of 1.83% and the S&P 500's loss of 0.29%.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ADI",
      "Date": "2026-02-13",
      "Time": "01:17:09",
      "Source": "Simply Wall St.",
      "Title": "Analog Devices Governance Move Puts Special Meeting Rights In Focus",
      "URL": "https://finance.yahoo.com/news/analog-devices-governance-move-puts-171709238.html",
      "Content": "Never miss an important update on your stock portfolio and cut through the noise. Over 7 million investors trust Simply Wall St to stay informed where it matters for FREE.\nAnalog Devices (NasdaqGS:ADI) has responded to a shareholder proposal seeking changes to special meeting rights.\nThe company is urging investors to vote against the proposal and is pointing to prior changes that lowered the threshold for calling special meetings.\nManagement is highlighting its broader governance approach, including a stated focus on shareholder rights and board accountability.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ADI",
      "Date": "2026-02-13",
      "Time": "00:06:00",
      "Source": "Zacks",
      "Title": "Cisco's Q2 Earnings Beat Estimates, Revenues Rise Y/Y, Shares Fall",
      "URL": "https://finance.yahoo.com/news/ciscos-q2-earnings-beat-estimates-160600444.html",
      "Content": "Cisco Systems CSCO reported second-quarter fiscal 2026 non-GAAP earnings of $1.04 per share, beating the Zacks Consensus Estimate by 1.96%. The figure increased 10.6% year over year.\n\nRevenues of $15.35 billion surpassed the Zacks Consensus Estimate by 1.49%. The top line increased 9.7% year over year. Total Annual Recurring Revenues (ARR) were $31 billion, up 3% with product ARR growth of 6%. Total subscription revenues were $7.83 billion and represented 51% of Cisco’s total revenues. Total software revenue increased 36.9% year over year to $5.6 billion.\n\nCisco shares were down 7.47% at the time of writing this article.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ADI",
      "Date": "2026-02-13",
      "Time": "00:00:13",
      "Source": "Insider Monkey",
      "Title": "Here’s Why Analog Devices (ADI) Rose in Q4",
      "URL": "https://finance.yahoo.com/news/why-analog-devices-adi-rose-160013574.html",
      "Content": "Carillon Tower Advisers , an investment management company, released its fourth-quarter 2025 investor letter “Carillon Eagle Growth & Income Fund”. A copy of the letter can be downloaded here . 2025 marked a positive period for the equity market. The S&P 500 Index returned 2.7% in Q4 and finished the year up 17.9%. The year started with potential disruptions and heightened volatility, while it ended with optimism driven by strong AI investment, clarity in policies, and U.S. Federal Reserve (Fed) interest rate cuts. The market’s performance was significantly affected by the communication services and technology sectors. From a return‑driver standpoint, the market expansion in the year was driven by earnings growth. The firm observes favorable conditions as 2026 approaches, and believes it can achieve another year of strong equity returns. The Fund holds net assets of $493.06 million across 48 holdings. Please review the Strategy’s top five holdings to gain insights into their key selections for 2025.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ADI",
      "Date": "2026-02-12",
      "Time": "22:44:39",
      "Source": "The Fly",
      "Title": "Shopify upgraded, Coinbase downgraded: Wall Street's top analyst calls",
      "URL": "https://finance.yahoo.com/news/shopify-upgraded-coinbase-downgraded-wall-144439440.html",
      "Content": "The most talked about and market moving research calls around Wall Street are now in one place. Here are today's research calls that investors need to know, as compiled by The Fly.\n\nTop 5 Upgrades:\n\nTD Cowen upgraded Shopify (SHOP) to Buy from Hold with an unchanged price target of $159, citing valuation for the upgrade with the shares down 30% year-to-date. Shopify's \"strong\" quarter, continued growth momentum and the post-earnings pullback \"represents an attractive entry point for investors to own the de facto modern-day eCommerce infrastructure,\" the firm tells investors in a research note. Mizuho also upgraded Shopify to Outperform from Neutral with an unchanged price target of $150.\nDeutsche Bank upgraded BorgWarner (BWA) to Buy from Hold with a price target of $82, up from $46. The firm says the company's entrance into the AI data center market is a \"pivotal shift.\"\nBarclays upgraded Analog Devices (ADI) to Overweight from Equal Weight with a price target of $375, up from $315. The company has the highest industrial exposure within the analog group \"by far\" and a strong correlation between its sales growth and the Purchasing Managers' Index, the firm tells investors in a research note.\nJPMorgan upgraded MercadoLibre (MELI) to Overweight from Neutral with a price target of $2,800, up from $2,650. The firm cites valuation for the upgrade following the stock's recent underperformance.\nWilliam Blair upgraded Fastly (FSLY) to Outperform from Market Perform without a price target. The company reported a \"stellar\" quarter driven by rising contribution from agentic AI traffic, the firm tells investors in a research note.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ADI",
      "Date": "2026-02-12",
      "Time": "22:33:35",
      "Source": "Investing.com",
      "Title": "Barclays upgrades Analog Devices as industrial recovery takes shape",
      "URL": "https://finance.yahoo.com/news/barclays-upgrades-analog-devices-industrial-143335971.html",
      "Content": "Investing.com -- Barclays upgraded Analog Devices to Overweight in a note Thursday, arguing the company is best positioned to benefit from an improving industrial backdrop and carries “the cleanest operating model and balance sheet” in the group.\nAnalyst Tom O’Malley said purchasing manager indexes have finally provided “the PMI inflection needed for some broader Industrial recovery,” though he cautioned that scars remain from the last cycle.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-02-12",
      "Time": "18:44:49",
      "Source": "Simply Wall St.",
      "Title": "QUALCOMM's (NASDAQ:QCOM) Soft Earnings Are Actually Better Than They Appear",
      "URL": "https://finance.yahoo.com/news/qualcomms-nasdaq-qcom-soft-earnings-104449059.html",
      "Content": "The most recent earnings report from QUALCOMM Incorporated ( NASDAQ:QCOM ) was disappointing for shareholders. However, our analysis suggests that the soft headline numbers are getting counterbalanced by some positive underlying factors.\nThis technology could replace computers: discover the 20 stocks are working to make quantum computing a reality.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-02-12",
      "Time": "18:12:19",
      "Source": "Simply Wall St.",
      "Title": "Cadence ChipStack AI Super Agent Puts EDA Role In Focus",
      "URL": "https://finance.yahoo.com/news/cadence-chipstack-ai-super-agent-101219296.html",
      "Content": "Track your investments for FREE with Simply Wall St, the portfolio command center trusted by over 7 million individual investors worldwide.\nCadence Design Systems (NasdaqGS:CDNS) has introduced the ChipStack AI Super Agent, described as a first-of-its-kind agentic AI solution for front-end silicon design and verification.\nThe platform uses multiple virtual engineers powered by Cadence’s existing EDA tools, with the company indicating potential productivity gains of up to tenfold in chip design workflows.\nEarly adoption by Nvidia and Qualcomm, along with Cadence’s investment in robotics AI, points to growing interest in applying artificial intelligence to semiconductor and intelligent device development.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-12",
      "Time": "11:27:59",
      "Source": "Yahoo奇摩股市",
      "Title": "《美股》分析：美1月非農就業佳；川普欣喜頻喊贊",
      "URL": "https://tw.stock.yahoo.com/news/%E7%BE%8E%E8%82%A1-%E5%88%86%E6%9E%90-%E7%BE%8E1%E6%9C%88%E9%9D%9E%E8%BE%B2%E5%B0%B1%E6%A5%AD%E4%BD%B3-%E5%B7%9D%E6%99%AE%E6%AC%A3%E5%96%9C%E9%A0%BB%E5%96%8A%E8%B4%8A-032759714.html",
      "Content": "【時報編譯柳繼剛綜合外電報導】美股分析：\n●Janus Henderson Investors指出，長期以來，因美國勞動力市場疲弱，許多預測機構對經濟前景抱持悲觀的態度。不過，這份美國一月非農就業報告卻提供了一個強而有力的證據，那就是經濟成長強勁，勞動力正在改善，薪資成長能夠支撐消費支出。聯準會在三月將會決定最新的利率，但若考慮到這份報告，要繼續降息的機率就會比較小。\n●Santander US Capital Markets認為，一月就業市場的反彈，可望安撫外界預測，失業率將持續攀升的恐慌，尤其目前正處於人工智慧AI恐對產業帶來不同的影響，加上部份美企不再持續招聘新員工。另外，在此報告發布後，川普立刻在社交媒體上發文說，這份就業資料好極了，川普還表示，美國應該享有全球最低的利率才對。\n\n檢視留言\n\n相關內容\n《國際經濟》美1月非農就業增長估回升 原因卻很悲傷 【時報編譯柯婉琇綜合外電報導】因為一些季節性行業減少裁員，美國1月就業增長可能回升，但由於進口關稅形勢仍不明朗，使人員招聘受到抑制，以及加強移民執法限縮了勞動力供應，實際上，美國的勞動力市場恐仍疲軟。 美國勞工部將於當地時間周三發布備受關注的非農就業報告。市場預期該報告將顯示1月失業率維持在4.4%不變，以及薪資年增長放緩。經濟學家表示，川普政府的貿易和移民政策抑制了就業市場，但減稅應可提振今年的招聘力道。 通常每年1月是季節性裁員最嚴重的月份，但由於去年底零售、物流等季節性招聘減少，因此今年1月的裁員情況可能隨之減少，或許會推升就業增長。 KPMG首席經濟學家Diane Swonk表示，就業市場潛在的壓力比整體失業率所呈現的要大。薪資增長正在減速、失業後更難找到工作、應屆畢業生要找到工作也更加困難。儘管報告上的經濟數據看起來很火熱，但勞動力市場依舊寒氣逼人。 根據路透社所做的調查，受訪經濟學家預估2025年1月非農就業可能增加7萬人，超出12月份的新增5萬人。預測值在介於減少1萬人到增加13.5萬人之間。一些私人調查顯示1月可能出現就業減少的情況。 這份就業報告原定於上周五發布，但受\n時報資訊 ・ 2 天前 ・ 發表留言\n\n《金融》美國就業數據前 美元表現疲弱 【時報-台北電】外匯評論： 1.USD/JPY 美國白宮經濟顧問哈西特稱，因勞動力市場增長放緩和生產率提高，未來幾個月美國就業增長可能放緩，引發美國聯邦準備理事會(FED)內部討論，可能影響未來的政策決定，促使美元在美國關鍵非農業就業數據週三公布前承壓；此外，日本首相高市早苗領導的執政聯盟勝選，其可能推進刺激經濟措施令市場不安。 但政治分析人士認為，呼籲更大膽減稅的在野黨在本次選舉中慘敗，讓獲得強勢授權的高市早苗提供調整刺激計畫的空間，並強調減稅將是臨時性措施，更重申堅持負責任的財政管理，應能讓市場確信財政前景不會出現實質性惡化，提振日本經濟和股市，料日本央行(BOJ)採取更強硬的政策立場，而且日本財務大臣片山皋月週二稱，在探討為計畫中削減食品消費稅籌集資金時，可考慮使用1.4兆美元外匯儲備所錄得盈餘，激勵日圓上漲，導致美元兌日圓於156.29高點賣壓沉重。 隨著美國數據顯示，12月進口與出口物價分別較前月升0.1%及0.3%略優於預期，但11月企業庫存較前月增加0.1%不及預估值，並據美國商務部公布12月零售銷售意外持平，可能暗示消費者支出和整體經濟邁入新年之際走上更緩慢的增長軌道，\n時報資訊 ・ 3 天前 ・ 發表留言\n\n《商情》02/09黃金亞洲電子盤持高 【時報-台北電】因市場參與者預期2026年美國聯準會(Fed)至少將有2次降息，以應對勞動力市場疲軟，令盤中金價走勢持高；截至台北時間2月9日上午11點20分止，貴重金屬亞洲電子盤如下： 4月黃金上漲58.2美元，報每盎司5038.0美元。 3月白銀上漲3.815美元，報每盎司80.710美元。 4月鉑金上漲6.7美元，報每盎司2106.1美元。 3月鈀金下跌2.70美元，報每盎司1738.50美元。(編輯：王聖為) (商品行情網)\n時報資訊 ・ 4 天前 ・ 發表留言\n\n《金融》擔憂干預風險 日圓扭轉跌勢 【時報-台北電】外匯評論： 1.USD/JPY 美國2月消費者信心指數升至六個月最高，但民眾普遍擔憂勞動力市場及與進口關稅相關的通貨膨脹導致生活成本上升，而且美國財政長貝森特認為即使美國聯邦準備理事會(FED)提名人沃什上任後，FED也不會迅速縮減資產負債表，可能至少耗時一年才能敲定具體行動，令美元受阻；此外，日本首相高市早苗領導的自民黨在週日眾議院選舉中取得三分之二以上席位的歷史性勝利，為其承諾的減稅政策及旨在對抗中國的軍事開支鋪平道路，週一引發日本公債收益率攀升。 並據日本政府公布去年12月經常帳盈餘為7,288億日圓低於預期，而且數據顯示日本12月實質薪資較上年年同期跌0.1%，為2025年每月均呈下滑，1月服務業景氣判斷指數則降至47.6，打擊日圓下挫，美元兌日圓升至157.72高點。 隨著市場日益確信高市早苗將繼續在積極財政政策與紀律之間尋求平衡，但擴張財政的風險被消化，並據日本財務官三村淳與內閣官房長官木原稔均警告正以高度緊迫感密切關注匯率波動，限制日圓走貶；此外，紐約聯邦儲備銀行報告顯示1月民眾緩解勞動力市場前景的悲觀情緒，但對一年後通貨膨脹預期降至3.1%及持續加劇憂慮\n時報資訊 ・ 4 天前 ・ 發表留言\n\n《美股》消息面：盧特尼克稱美不會阻礙晶片業；比特幣跌破6.9萬美元 【時報編譯柯婉琇綜合外電報導】消息面： ●ADP公布，在截至1月24日的4周內，美國民間就業每周平均增加6500人，高於前值（5000人），為連續第三周成長，並創下1月3日以來新高。 ●美國2025年12月零售銷售額與11月相比持平，不及市場預期的月增0.4%。排除汽車的零售銷售額亦與11月持平，落後市場預期的月增0.3%。 ●美國石油協會（API）公布，上周（截至2月6日）美國原油庫存大增1340萬桶；前一周為庫存減少1110萬桶。此外，汽油庫存增加330萬桶，包括柴油和取暖油在內的餾分油庫存減少200萬桶。 ●周二在參議院撥款委員會小組出席聽政會時，美國商務部長盧特尼克（Howard Lutnick）表示，美國去年第四季國內生產毛額（GDP）成長率預估將突破5%，而今年第一季可能突破6%。他表示，美元回落至「較自然」的價位，有利於促進美國出口和加速經濟增長，今年製造業就業將出現巨大的增長，有助於美國經濟實現如此強勁的增長。盧特尼克並表示，美國對AI晶片的需求龐大，華盛頓不會想採取任何可能阻礙晶片業發展的措施。 ●克利夫蘭聯準銀行總裁哈馬克（Beth Hammack）表示，聯準會利率\n時報資訊 ・ 2 天前 ・ 1 則留言\n\n統一期貨：台指期開平走高，突破33,800整數關卡，以史高封關 【財訊快報／編輯部】週三晚間即將發布美國1月非農就業報告，於數據發布前美股市場觀望情緒增溫，行情狹幅盤整。台指期在台積電1月營收創高的背景下，表現相對強勁，週三台指期開平走高，突破33,800整數關卡，以史高之姿封關。綜觀法人籌碼，三大法人合計買超575億元，其中外資買超523.6億元，而自營商買超13.7億元，投信則買超37.6億元。檢視選擇權金流，外資布局0.77億元偏空部位，自營商則布局0.25億元偏多部位。選擇權未平倉部分，2月月選價平近9檔賣權最大未平倉上升400點至33,200點，買權最大未平倉上升1,000點至34,000點，最大OI區間上移偏多。期貨方面，外資夜盤加碼2,383口空單，日盤則加碼470口空單，未平倉淨空單增至-25,562口；十大特定法人減碼24口空單至-40口。\n財訊快報 ・ 2 天前 ・ 發表留言\n\n達拉斯聯儲行長Logan指稱，僅通膨回落不足以支持降息 【財訊快報／劉敏夫】外電報導指出，美國聯準會達拉斯分行行長Lorie Logan表示，她對通膨繼續下降持樂觀態度，但只有在勞動力市場出現「實質性」疲軟的情況下，才會支持進一步降息。Logan週二在奧斯汀(Austin)的一場活動致辭中表示，接下來的幾個月，我們將了解到通膨是否正在向目標水準回落，以及勞動力市場是否保持穩定。Logan指出，一旦情況確實如此，表明目前的政策立場是合適的，無需進一步降息即可實現我們的雙重使命目標，相反的，如果看到通膨下降的同時勞動力市場進一步實質性降溫，那麼再次降息可能是合適的。Logan今年在聯邦公開市場委員會(FOMC)擁有投票權。在2025年底連續三次降息後，她支持FOMC在1月份會議上維持利率不變的決定。去年10月和12月Logan曾公開反對降息，理由是通膨依然過高且勞動力市場處於平衡狀態。週二Logan重申了上述觀點，她表示，過去六個月左右的招聘情況接近聯準會研究人員估計的「平衡率」，也就是創造就業的速度與人口成長相匹配。不過，她尚不能完全確信通膨正一路向2%回落。在接掌聯準會達拉斯分行之前，Logan曾在聯準會紐約分行管理央行的資產組合。週二她還\n財訊快報 ・ 3 天前 ・ 發表留言\n\n《國際金融》美指期小幅揚升 關注1月CPI數據 【時報編譯張朝欽綜合外電報導】在美股周四盤前交易，美指期上揚，道瓊指期和標普指期都上漲約0.3%，那斯達克指期也上升約0.2%。 在周三，投資人消化了強勁的1月非農就業報告，美股小幅走弱，道瓊無法連4紅，僅費半逆勢上揚。 在盤後交易中，思科公佈獲利低於預期，股價下跌約7%。 麥當勞上季業績超出預期，股價仍小幅下滑。 美股在周三早盤走勢震盪，但1月非農就業數據公佈，就業人數增加了13萬人，超過分析師預測，隨後股市回穩，標普、道瓊和那指收盤其實變化不大，幾乎都接近平盤。 然而１月的就業強勁表現，也使得市場對聯準會的政策預期，變得更為複雜，強勁的勞動力市場加上粘滯的通膨，都可能減少了降息的預期。但是降息預期卻是近期股市上漲的推力之一。 投資人現在將目光注向本週五即將公佈的1月消費者物價指數(CPI)數據，此為聯準會偏愛的通膨數據。而一個降溫的通膨數據，將提振人們的希望，認為即使經濟持續成長，物價也能維持放緩的水準。 在財報公佈方面，Coinbase、應材、Rivian都將在本周剩下的時間公佈財報。\n時報資訊 ・ 1 天前 ・ 發表留言\n\n《美股》消息面：川普關稅大棒重擊美民眾；油金齊跌 【時報編譯柳繼剛綜合外電報導】消息面： ●紐約聯邦準備銀行報告指出，川普實施的新關稅政策，承擔進口關稅的對象，竟然90%是美國的老百姓。該份報告表示，去年1到8月之間，約94%的關稅成本已轉嫁給美國企業和消費者，9到10月降至92%，11月則在86%。無獨有偶，美國國會預算辦公室(CBO)前一日發布的報告也指出，外國出口商將承擔5%多出的成本，美企自行吸收30%的進口差價，剩下的部分將藉由漲價的方式轉嫁給民眾。 ●美國2月首次申請失業救濟人數，較前一周減少5,000人，降至22.7萬，高於市場預期的22.2萬，接近先前修正後的八周高點。同時，1月持續申請失業救濟人數增加2.1萬，來到186.2萬，持續申請失業救濟人數增加，因冬季風暴衝擊美國多處地方，導致商業活動中斷，造成更多家庭經濟面臨困境。 ●現貨金價一度大跌4.06%，每盎司曾跌至4878.24美元，收盤時為4921.85美元，但還是下挫3.2%。同時，現貨銀價一度最多重挫11.71%，低點跌至74.4355美元，收盤每盎司為75.2835，大跌10.71%。 ●紐約期油下跌2.77%，每桶收在62.84美元。同時，布蘭特期油也跌\n時報資訊 ・ 22 小時前 ・ 1 則留言\n\n美零售銷售疲弱助推Fed降息預期，KOSPI週三收高1%，連三紅 【財訊快報／劉敏夫】韓國股市週三走升，連續第三個交易日上揚，因投資人等待稍晚美國發布的非農就業報告，此前公佈的零售銷售數據疲軟進一步鞏固了市場對聯準會將在今年稍晚時降息的預期。收盤時，Kospi指數上漲52.80點或1.00%，報5,354.49點；追蹤創業板市場行情的Kosdaq指數則是下跌0.33點或0.03%，報1,114.87點。Kospi指數19檔分項類股漲跌不一，其中13檔上揚，6檔下滑。通訊類股指數上揚2.85%，表現最好。運輸設備類股指數以及營建類股指數分別上漲2.13%與2.04%，表現也不錯。反觀，紙張木材類股指數下跌3.02%，表現敬陪末座。紡織成衣類股指數與醫療與精密設備類股指數分別下跌1.34%與1.85%，表現也不理想。週二發布的數據顯示，美國12月零售銷售意外停滯，凸顯去年年末消費乏力。貨幣市場對今年聯準會降息三次的押注略微升溫。市場目光現轉向稍晚時的美國非農報告和週五的通膨數據，以獲取更多有關政策前景的信號。eToro的Bret Kenwell表示，就業報告將是關鍵。一旦數據疲軟，成長擔憂開始加劇，可能進一步推動市場情緒轉向避險。不過，若是數據強勁，或可\n財訊快報 ・ 2 天前 ・ 發表留言\n\n避險大亨重押黃金 預言華許領導下Fed今年降息遠超過兩次 避險基金綠光資本 (Greenlight Capital) 操盤手安霍恩 (David Einhorn) 預期，美國聯準會 (Fed) 今年降息次數可能超越市場預期的兩次，讓他更有信心大舉押注黃金。 雖然美國周三 (11 日) 公布的 1 月非農就業報告意外強勁，稍稍澆熄了降息\n鉅亨網 ・ 1 天前 ・ 發表留言\n\n《金融》英國經濟近停滯 英鎊備受壓力 【時報-台北電】外匯評論： 1.USD/JPY 美國1月聯邦政府預算赤字降至950億美元，而且就業意外加速增長及失業率下降，但經修正後顯示去年實際新增就業僅18.1萬個，遠低於此前估計值，經濟學家更指出，川普總統激進的貿易及移民政策持續給勞動力市場蒙上陰影，不應將1月就業大增視為形勢發生實質性轉變，而且美國聯邦準備理事會(FED)理事米蘭支持進一步降息，週四令美元承壓。 此外，日本央行(BOJ)公布1月企業物價指數(CGPI)較去年同期漲2.3%符合預期，批發通貨膨脹率連續兩個月放緩，但以日圓計價進口物價指數較上年同期漲0.5%，日圓匯率波動將影響通貨膨脹前景和BOJ升息時機，並據日本財務省財務官三村淳警告，政府與美國當局緊密聯繫關注市場動向，而且日本時事通信社援引多位知情人士報導，日本曾於1月要求美國對美元兌日圓匯率價格詢價，提供日圓支撐，美元兌日圓下挫至152.25低點。 隨著路透調查顯示美國長期公債收益率短期內保持穩動，市場預期FED維持利率不變至年中，推動美元兌日圓反彈至153.75高點，但美國上周初請失業金人數降至22.7萬人不及預期，並據全美不動產協會(NAR)表示1月成屋\n時報資訊 ・ 1 天前 ・ 發表留言\n\n匯豐稱未見美股拋壓持續，看好週期性類股 【財訊快報／劉敏夫】外電報導指出，匯豐控股方面表示，尚未見到美股拋壓持續，並看好週期性類股。由Max Kettner領導的匯豐策略分析師團隊認為，上週熱門交易的輪動和平倉不太可能引發股市更大規模的拋售。他們指出，美國勞動力市場數據走弱可能推動對更多財政刺激措施的預期。這分析師團隊指出，上週觀察到的劇烈波動主要是股市內部輪動，而非廣泛的避險拋售。同時，甲骨文250億美元債券發行獲得創紀錄高點的認購，應有助於舒緩對人工智慧融資的部分擔憂。該分析師團隊認為，美國勞動力市場數據的進一步走弱應該會加劇市場對推出更多財政刺激措施的預期。該分析師團隊建議逢低買入，並在戰術層面上偏向週期初期類股，以把握成長動能改善的機會。\n財訊快報 ・ 4 天前 ・ 發表留言\n\n美家庭負債創新高 信用卡債飆破1.28兆美元 MoneyDJ新聞 2026-02-11 12:42:35 李彥瑾 發佈近年美國經濟明顯呈現「K型發展」，在股市屢創高帶動下，高薪階層資產快速累積，低薪族群則受高物價與生活成本攀升衝擊，荷包難以負荷。根據紐約聯準銀行最新公布，截至2025年第四季，美國家庭負債總額已達18.8兆美元，再創歷史新高。 CNBC等外媒報導，紐約聯準銀行10日發表最新報告，截至2025年第四季，美國家庭債務總額成長至18.8兆美元，較前季增加1,910億美元，其中房貸借款占13.17兆美元，顯示房貸仍是美國家庭負債的最大來源。 值得注意的是，美國家庭背負的信用卡債務上升至 1.28兆美元，較2024年同期大增5.5%，反映高物價與關稅壓力擠壓民眾預算，部分家庭為支應日常開銷及節慶消費，藉由刷卡來維持支出，債務自然增加。 此外，第四季整體家庭借款的逾期比率升至4.8%，創2017年以來新高，原因包括關稅政策對就業市場造成外溢衝擊，影響低收入家庭的還款能力，推升家庭部門借款的信用風險。 （圖片來源：iStock） ＊編者按：本文僅供參考之用，並不構成要約、招攬或邀請、誘使、任何不論種類或形式之申述或訂立任何建議及\nMoneydj理財網 ・ 2 天前 ・ 1 則留言\n\n美元下跌壓力加劇 經濟學人：最大問題始於美國自己 自 2025 年初以來，美元匯率已大幅貶值約 10%，這場動盪不僅反映了經濟數據的波動，更揭示了美國國際信譽的深層裂痕。《經濟學人》分析報導稱，長期以來，美元被視為全球避險天堂，然而當前的威脅卻如同恐怖電影般「源自房子內部」。 隨著川普政府推行強硬的關稅政策並翻轉數十年的貿易自\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n《美股》分析：米蘭鼓吹降息優點；花旗示警通膨再起 【時報編譯柳繼剛綜合外電報導】美股分析： ●聯準會理事米蘭表示，聯準會目前的貨幣政策，已經威脅到美國的經濟成長，同時，米蘭也再次說明進一步降息的必要性。米蘭不認為通膨是一個問題，因為住房通膨非常低，可以跟指數內其它項目更高的通膨相互平衡。因此，嘗試使用更寬鬆的貨幣政策，來支撐勞動市場是有意義的。不過，達拉斯聯邦準備銀行行長Logan卻反對進一步降息，Logan指出，自己更擔心的是頑固的高通膨，而不是勞動市場。 ●花旗表示，市場對美國通膨未來發展過於自滿，也就是說市場似乎相信通膨還會下降，但卻沒想到現在的環境，通膨的結構性反而更強，因去年實施的美國新關稅政策，可能會產生更高的通膨風險。 ●美國就業數據良好，聯準會可以在相當長的一段時間內都對利率按兵不動，BAIRD認為，如果CPI真的又開始上揚，聯準會在做出決定之前，還有幾個月的時間來觀察物價趨勢。除非新的CPI報告非常強勁，否則不會對股市和期貨市場產生真正的影響。\n時報資訊 ・ 21 小時前 ・ 發表留言\n\n《國際經濟》韓1月新增就業人數少 想躺平不工作者大增 【時報編譯柳繼剛綜合外電報導】韓國政府11日公布統計數據，當地一月新增加的就業人口數，只有10.8萬而已，已經創下一年多以來最低，若跟2025年同期相比增加0.4%，總就業人數達2,799萬人。 經濟學者指出，韓國一月就業人數呈現溫和成長，表示製造業和營建業持續低迷，其中，青年就業人數更是連續第21個月都在減少，凸顯韓國年輕的求職者還是得面臨諸多挑戰。 依此數據，若按照年齡來區分，15至29歲人口的就業人數，在一月大幅減少17.5萬，故該年齡層的就業率年減1.2%，剩下43.6%。韓聯社表示，這是自2021年以來，一月的最低就業率，五年前比率為41.1%。 在中老年方面，韓國40歲與以上的就業人數也略有下降，減少3,000個工作機會。同時，60歲及以上的就業雖增加14.1萬人，但卻是從2021年一月以來最少的。 相較之下，韓國30歲和50歲的就業人數成長，依序增加10.1萬和4.5萬個工作機會。被認為是韓國經濟支柱的製造業，就業人數比去年同期減少2.3萬，連續第19個月下滑。營建業的就業人數減幅更大，約少掉2萬人，連續第21個月下降。 至於韓國經濟不活躍人口(economically\n時報資訊 ・ 2 天前 ・ 發表留言\n\n《美股》消息面：美預算赤字恐破表；金銀走高 【時報編譯柳繼剛綜合外電報導】消息面： ●美國財政部的數據顯示，截至一月的2026財年前四個月，聯邦政府預算赤字，已從2025年同期8400億美元，降至6970億美元，減幅達17%。同時，關稅收入達1240億美元，年增逾3倍。光是一月來說，關稅收入就高達300億美元，年增高達2.75倍。川普表示，自己的新關稅政策幫助美國減少78%的貿易逆差，明年貿易將會轉為順差。另方面，美國國會預算辦公室(CBO)示警，2026財年預算赤字估將小增至近1.9兆美元，到了2036年時更是增至3.1兆美元。 ●美國總統川普於美東11日，在白宮會見來訪的以色列總理納坦雅胡，川普會後表示，除了自己堅持要持續與伊朗談判，確定是否能達成協議外，與納坦雅胡並沒有達成任何明確的結論。 ●現貨金一度上漲1.87%，每盎斯高點來到5119.3美元，收在5084.53美元，漲幅為1.17%。另外，現貨銀收在84.3115美元，漲4.35%。印尼政府暗示，將大幅刪減今年鎳礦產能配額，倫敦期鎳每噸收18002.38美元，大漲2.55%。 ●紐約期油一度大漲2.92%，高點每桶來到65.83美元，收漲1.05%，為64.63美元\n時報資訊 ・ 1 天前 ・ 發表留言\n\n上季美國勞動力成本成長 意外放緩 美國勞動力需求疲軟抑制薪資成長，最新數據顯示，去年第四季美國勞動力成本成長意外放緩，年增幅僅3.4％，創下4年半來最低紀錄。\n中時財經即時 ・ 3 天前 ・ 發表留言\n\n《國際政治》高市輾壓式勝利 川普第一時間賀 【時報編譯柳繼剛綜合外電報導】川普於美國時間八日，祝賀日本首相高市早苗領導的自民黨，在日本大選中取得壓倒性勝利(landslide victory)，同時，這位美國總統也說，自己前幾天曾公開表示，要支持高市早苗。 川普在社交媒體上發文指出，高市早苗決定提前舉行大選，不僅是大膽且是明智(bold and wise)的，希望高市以在國會絕對的多數，能順利推進保守的和平政策。 在日本自民黨贏得眾議院高達三分之二的多數席位，並創下日本戰後歷史新高後的幾個小時，川普隨即回應，熱情投票的日本人民，將永遠得到我的堅定支持。 美國財政部長貝森特在美國福斯新聞(Fox News)節目中也說，川普與高市早苗的關係很好，當日本強大時，代表美國在亞洲也強大。在八日大選前幾天，川普已表態會全力支持高市，並於三月19日在白宮歡迎這位日本第一位女首相。 日媒指出，高市千尋下個月在就任首相以來，可望首次訪美，且時間上要早於川普計畫四月訪中。幾個月以來，中國一直對高市關於潛在性的台海危機言論，抱持非常強硬的立場。 自從高市早苗在去年10月就任首相以來，川普就一直讚揚高市是日本已故首相安倍晉三的門生，事實上，川普在美國總\n時報資訊 ・ 4 天前 ・ 發表留言\n\n熱門新聞\n1\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 2\n\n13.5億威力彩「2得主」買法一模一樣！ 只花100元就翻身 3\n\n郭台銘大紅包發威！央行新台幣發行額首破4.2兆  年增率飆3年最高 4\n\n「新版新台幣」可能有石虎！票選結果曝光 台積電僅排第七 5\n\n【房地產週報】輝達簽約落腳北士科！29年最大交屋潮來襲！新竹預售屋慘崩82.3%！七大都會區交易量年減7成\n\n你可能會喜歡\n你上車了嗎？記憶體登蛇年狂飆主力　前10猛將全曝光 FTNN新聞網\n\n九大工業公會聯合肯定台美貿易協定 強調為產業注入強心針 民視財經網\n\n春節搭車風險升溫！行車保護傘保障出行　花1元即可享百萬保障 三立新聞網 setn.com\n\n「台灣價值」竟沒台灣之光！大盤飆新高00940卻回不到10元　股民哀號：成敗皆這1檔 鏡週刊Mirror Media\n\n緝捕馬杜洛震驚全球 美軍傳動用AI工具Anthropic Claude 鉅亨網\n\n信義房屋：年前家電、家具換新需求高 今日新聞NOWNEWS\n\n台股拉警報！專家警告美股7巨頭集體翻車：最慘開年行情 中時財經即時\n\n鄭麗君團隊立大功！謝金河曝「台美ART簽署」意義：台灣獲1席珍貴位子 三立新聞網 setn.com\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 工商時報\n\n租屋族省很大！租金補貼減輕4成負擔 女性與25歲以下青年成主力 太報\n\n法人兩樣情！華邦電發說利多連發...目標價上看200元 　保守派「4理由」只喊88元 FTNN新聞網\n\n美股掀AI恐慌交易　台積電ADR挫0.47％ CTWANT\n\n陸客不去日本！外媒爆25萬大軍「改衝這國」 刷爆103億不手軟 中時財經即時\n\n金蛇年「大漲萬點」封關！0050領銜市值型ETF悍漲　近十年含息報酬率高達509% FTNN新聞網\n\n台灣賓士對「台美貿易協議」成功達成表達祝賀 並承諾回饋消費者 民視財經網\n\n外食族吃不消! 海南雞飯漲20元 手搖飲過年期間漲5元 民視財經網影音\n\n聯電ADR13日上漲0.13美元漲幅1.26%折台股65.68元 中央社財經\n\n砸5億擴產最快Q2釋產能！PCB股華通衝連3漲　當沖爆量破5萬張登當沖王 FTNN新聞網\n\n輝達下跌、AMD上漲 背後關鍵或在Arista 鉅亨網\n\n美通膨降溫難掩「AI恐慌」! 美股漲跌互見、台積電ADR下跌0.51％ 新頭殼\n\n台美ART簽署》台經院張建一妙喻：台灣付的午餐費 比別人還低 工商時報\n\n大研生醫* 公告本公司股票面額由「新台幣10元」變更為「新台幣1元」，公告期間：114年12月22日至115年3月21日。 Moneydj理財網\n\n外資降評唱衰！大咖投顧逆風喊買面板指標大廠「這檔」　最新目標價曝光 FTNN新聞網\n\n蘇威元：台積電概念股飆漲密碼 這四指標抓飆股一次賺58% 民視財經網影音\n\n春節放假也能追美股！內部數據曝光　過年反而更敢買 三立新聞網 setn.com\n\n記憶體嚴重短缺！美國軍工企業黑名單 移除中國長鑫、長江存儲 自由時報\n\n運載指標／港務公司貨櫃量上看1,390萬TEU 今日新聞NOWNEWS\n\n關稅干擾消失加AI助攻　經濟成長率上修至7.71％ 卡優新聞網\n\n主動式ETF規模破1739億！這檔年化配息率10％　豪配0.377元「年後這天」最後上車日 FTNN新聞網\n\n到全台最夯紫南宮借發財金　主委莊秋安：心存善念有來有保庇 鏡報\n\n新北房市 新莊幸福路商圈 成家首選 工商時報\n\n台美ART 守住重要農產品防線 工商時報\n\n〈能源盤後〉油價因美通膨趨緩回升 周線仍收黑 鉅亨網\n\n13家金控1月獲利全公布！國泰金元月大賺146億元　EPS達0.99元登獲利王 FTNN新聞網\n\n美通膨降溫難掩AI隱憂　美股漲跌互見 太報\n\n〈貴金屬盤後〉黃金、白銀回神 CPI重燃降息預期 鉅亨網\n\n傳統軟體股崩跌回五年前！卡爾先生：掌握這兩點才能存活 民視財經網影音\n\n台股資料來源 臺灣證券交易所 、 臺灣期貨交易所 及 財團法人中華民國證券櫃檯買賣中心 ，國際股市資料來源請參考 Yahoo Finance 。台股行情、個股基本資料及財務資訊為精誠資訊提供。使用Yahoo股市服務前，請您詳閱相關 使用規範與聲明 。\n\n服務條款 隱私權 您的隱私權選擇 加州隱私權通知 © 2026 Yahoo. All rights reserved.\n\n1",
      "Language": "zh",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-12",
      "Time": "11:02:04",
      "Source": "Yahoo奇摩股市",
      "Title": "《美股》焦點股：Meta蓋超大數據中心；思科財報超標盤後重挫",
      "URL": "https://tw.stock.yahoo.com/news/%E7%BE%8E%E8%82%A1-%E7%84%A6%E9%BB%9E%E8%82%A1-meta%E8%93%8B%E8%B6%85%E5%A4%A7%E6%95%B8%E6%93%9A%E4%B8%AD%E5%BF%83-%E6%80%9D%E7%A7%91%E8%B2%A1%E5%A0%B1%E8%B6%85%E6%A8%99%E7%9B%A4%E5%BE%8C%E9%87%8D%E6%8C%AB-030204534.html",
      "Content": "【時報編譯柳繼剛綜合外電報導】焦點股：\n●Meta宣布已在美國印第安納州動工，興建一座超過100億美元的資料中心，加速增加發展人工智慧AI所需之大量運算能力，預計最早2027年底投入營運，是Meta目前為止規模最大的AI基礎設施之一。著名對沖基金經理人阿克曼的Pershing Square基金，已持有Meta大量股份，並認為市場低估Meta在AI領域的長期成長潛力，股價有嚴重被低估之虞。\n●SpaceX執行長馬斯克表示，集團旗下的人工智慧新創公司xAI進行重組，需要跟部分員工暫時分開，不過，也在積極招募新血。馬斯克在X平台上說，此次重組是要提升執行速度，但馬斯克沒有透露哪些員工因這次重組而被裁員，或還是主動離職的。\n\n●思科最新的季報優於預期，但本季獲利目標並沒有特別地出色，故股價盤後交易大跌超過7%。思科第二財季每股盈餘在調整後為1.04美元，預期為1.02美元。同時，營收為153.5億美元，年增率達10%，預估為151.2億美元。思科預計本季每股盈餘為1.02美元到1.04美元之間，營收為154億美元到156億美元間。但倫敦證券交易所集團(LSEG)的預估值則是每股盈餘1.03美元，營收為151.8億美元。\n\n●蘋果Siri升級計畫，傳出在近期測試中遇到挑戰，多項核心功能的發布日期恐將進一步延後。外媒指出，蘋果原本想在三月的iOS 26.4更新版中推出這些新功能，但部分新功能可能會延至五月發布的iOS 26.5、甚至九月的iOS 27。外傳蘋果在測試中發現，軟體無法正確回應用戶的查詢以及等待時間過長，還有精準度不夠等問題因。\n\n檢視留言\n\n相關內容\n《國際產業》拚AI算力 Meta再砸百億美元建大型資料中心 【時報-台北電】社群媒體巨頭Meta宣布，斥資100億美元在美國印第安納州興建的大型資料中心已於2月11日動工，未來將強化人工智慧（AI）運算能力，因應全球AI競賽升溫。這座資料中心位於印第安納州黎巴嫩市（Lebanon），預計於2027年底或2028年初正式啟用。 Meta表示，這座資料中心完工後將具備1GW電力容量。依據美國電網營運商資料，1GW約可供應80萬戶家庭用電，顯示該設施規模相當龐大。 Meta資料中心副總裁彼得森（Rachel Peterson）表示：「我們將在這個場址快速推進大量建設。」顯示Meta正加速布局，以取得支撐AI模型訓練與運行所需的龐大算力。 近年來，Meta與其他科技巨頭競相擴建超大型資料中心，被視為一場「世代級」AI競賽。然而，資料中心屬於高耗能設施，也引發了環保與消費者團體關切。 對此，彼得森表示，Meta已與當地公用事業公司簽署供電協議，並且強調公司將「自行負擔相關能源基礎建設升級費用」，以確保不將成本轉嫁給一般用戶。 Meta先前已宣布，未來三年將在美國基礎建設與就業領域投資6,000億美元，其中包含多座資料中心建設。2025年10月，Meta與\n時報資訊 ・ 1 天前 ・ 發表留言\n\n拚AI算力 Meta再砸百億美元建大型資料中心 社群媒體巨頭Meta宣布，斥資100億美元在美國印第安納州興建的大型資料中心已於2月11日動工，未來將強化人工智慧（AI）運算能力，因應全球AI競賽升溫。這座資料中心位於印第安納州黎巴嫩市（Lebanon），預計於2027年底或2028年初正式啟用。\n工商時報 ・ 1 天前 ・ 發表留言\n\nMeta斥資逾100億美元建1GW資料中心 推動史詩級AI基建 Meta Platforms (META-US) 週三 (11 日) 宣布，已在印第安納州萊巴嫩市 (Lebanon, Indiana) 為最新一座資料中心動土，該案投資金額超過 100 億美元，加速擴建 AI 基建。\n鉅亨網 ・ 2 天前 ・ 發表留言\n\n《美股》焦點股：應材本季樂觀；OpenAI新品亮相 【時報編譯柳繼剛綜合外電報導】焦點股： ●谷歌母公司Alphabet最近發行少見的百年超長天期公司債，有分析師指出，這家高科技巨擘正把借款規模擴大到歷史新高，就是為了數據中心和人工智慧AI基礎設施能夠大量建設，引發外界對AI激烈競爭的新擔憂。除了上周宣布今年資本支出估達1850億美元的Alphabet以外，甲骨文、亞馬遜和微軟也在加大投入AI基建，預計未來五年，這些大型科技公司的公司債總額將達3兆美元。 ●應用材料公布最新財報，預測第二季營收和獲利將高於市場預期，應材預測在人工智慧處理器需求大增，以及全球記憶體短缺下，可望推升晶片製造設備的銷售量。應用材料盤後交易時暴漲超過13%，同業科林研發以及科磊的股價，盤後也都一度大漲近3%。根據倫敦證交所集團(LSEG)的數據，應用材料預計第二季銷售額約在76.5億美元，上下誤差各5億美元，先前預期為70.1億美元。美國最大的半導體設備製造商也預測，第二季經調整後的每股盈餘約為 2.64美元，上下範圍0.2美元，高於先前預期的2.28美元。 ●美媒報導，蘋果原計畫在幾周內陸續公布更新結果，但現在的時間，可能會延後到幾個月之內，不過應該還是會在2\n時報資訊 ・ 22 小時前 ・ 發表留言\n\n《國際金融》Meta股價被錯殺？華爾街大咖出手砸20億美元抄底 【時報-台北電】億萬投資大亨艾克曼（Bill Ackman）旗下的潘興廣場資本管理公司（Pershing Square Capital Management）11日披露持有臉書母公司Meta大量股份。該基金在年度投資者報告中指出，「我們認為Meta目前的股價低估該公司在人工智慧（AI）方面的長期成長潛力。」 截至2025年底，對Meta持有的部位占潘興資本的10％，約合20億美元。 Meta股價在過去12個月跌落約16％，潘興廣場資本認為，由於市場擔心AI方面的支出過高，是股價下挫的原因，但這家重量級投資公司認為，AI能夠提升Meta的內容推薦與個人化廣告的實力，還有望為穿戴裝置或企業AI數位助理領域帶來新契機。 根據Meta在1月公布的第四季財報，預估2026年與AI相關的資本支出高達1,150億至1,350億美元之間。（新聞來源：工商即時 陳怡均）\n時報資訊 ・ 1 天前 ・ 發表留言\n\n數兆美元的收入機會！馬斯克：只需解鎖數位人類 特斯拉與 SpaceX 執行長馬斯克在最新深度訪談中指出，全球 AI 發展正逼近「電力之牆」，地球能源已難以支撐算力擴張，預估 36 個月內太空將成為部署 AI 最便宜的地方。他並警告中國製造具備結構性優勢，美國若無突破\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n艾克曼重押Meta 持股占資本10%直指股價「深度折價」 避險基金大亨艾克曼 (Bill Ackman) 周三 (11 日) 披露，旗下的潘興廣場 (Pershing Square) 持有 Meta(META-US) 的大量股份，占潘興截至 2025 年底總資本的 10%，相當於 20 億美元，展現對這家社群媒體巨頭轉向人工智慧 (AI) 戰略的信心\n鉅亨網 ・ 1 天前 ・ 發表留言\n\n美元恐不值錢？馬斯克爆沒有「2大核心技術」 美國1000％走向破產 特斯拉執行長馬斯克近日再度對美國快速膨脹的國債發出嚴厲警告，直言若缺乏人工智慧（AI）與機器人技術的支撐，美國最終恐難逃破產命運。\n中時財經即時 ・ 4 天前 ・ 發表留言\n\n股價被低估 投資大亨艾克曼大舉押注Meta 億萬投資大亨艾克曼（Bill Ackman）旗下的潘興廣場資本管理公司（Pershing Square Capital Management）11日披露持有臉書母公司Meta大量股份。該基金在年度投資者報告中指出，「我們認為Meta目前的股價低估該公司在人工智慧（AI）方面的長期成長潛力。」\n中時財經即時 ・ 1 天前 ・ 發表留言\n\n馬斯克：SpaceX將優先在月球打造「自我發展城市」 （中央社倫敦2026年02月8日綜合外電報導）億萬富豪馬斯克今天表示，美國太空探索科技公司（SpaceX）已將重心轉移至在月球上打造一座「能自我發展（self-growing）的城市」，稱這個目標可在不到10年內實現。路透社報導，馬斯克（Elon Musk）在社群平台X的貼文中補充表示：「話雖如此，SpaceX也將努力建造一座火星城市，並在大約5到7年內開始動工，但首要之務是確保文明的未來，而開發月球的速度更快。」馬斯克的言論呼應了「華爾街日報」（The WallStreet Journal）6日的一篇報導，這篇報導稱SpaceX已告知投資者，公司將優先考慮前往月球，並在稍後的時間點嘗試火星之旅，目標是在2027年3月進行一次無人登月任務。他去年曾表示，目標是在2026年底前向火星發送一項無人任務。美國在本世紀面臨來自中國的激烈競爭，雙方都致力於將太空人送返月球。自1972年美國最後一次阿波羅（Apollo）任務以來，便再也無人登陸月球。在馬斯克發表這番言論之前，SpaceX同意收購人工智慧（AI）公司xAI，這項交易對SpaceX的估值為1兆美元，對xAI的估值則為2500億美元。\n中央社財經 ・ 4 天前 ・ 發表留言\n\n《韓股》AI晶片狂賣 韓股登5,500點巔峰 【時報編譯柳繼剛綜合外電報導】韓股12日一開盤就漲破5400點關卡，買氣不墜下，大盤愈走愈高，一度來到5,515.18新高點，目前在5,496.58點，大漲142.09點或2.65%。同時，韓元也走升。 受惠於全球對人工智慧AI基礎建設的強烈需求，韓國一月資通訊ICT產品出口額達290億美元，2025年同期為162億美元，年增率高達78%，創下歷年來一月最高出口金額。同時，進口額也成長20%至140億美元，貿易順差達149億美元。韓國政府表示，ICT占韓國一月658億美元總出口金額的44.1%，是韓國經濟成長的主要動力。 受到激勵的三星電子，股價一度大幅上漲6%，記憶體競爭對手的SK海力士，也大漲3.3%。電池類股的LGES大漲3.4%，三星SDI也漲1%左右。網路族群的Kakao 上漲近1%，Naver則跌0.4%。 韓國最大入口網路Naver表示，包括執行長還有另外五位高階主管，已累積買進金額為7億韓元，約48.2萬美元的等值Naver股票，主要是展現負責任的管理風格。根據統計，現任執行長日前買進自家股票2億韓元，財務長以及營運長等高層，也各自購入約1億韓元的Naver股票。更早之\n時報資訊 ・ 1 天前 ・ 發表留言\n\n《國際產業》Anthropic將承擔更多成本 防止電價轉移消費者 【時報編譯張朝欽綜合外電報導】美國人工智慧公司Anthropic在周三宣布新的措施，以便降低資料中心用電加劇，對消費者電費帳單可能的影響。目前該公司正加大對電力基礎設施的投資。 Anthropic說，公司將提高每月電費負擔，並且涵蓋因資料中心用電增加而導致電網升級所需的成本，以防止電費被轉嫁到消費者。 儘管科技巨頭和美國政界都在敦促資料中心容量增加，以及增加電力生產，以保持美國AI的競爭力，但是美國民眾更加擔心，這些耗電龐大的設施，可能會影響他們的水電費，以及在該地區的土地、水和其它自然資源的使用。 Anthropic同時也表示，公司將帶來新的電力生產和電網容量，以滿足資料中心的用電需求，而不是購買(綠電)信用額度。 該公司補充說，在新發電量仍無法上線的情況下，該公司將與公用事業部門和外部專家合作，估計並抵消資料中心的電價上漲影響。 這些措施與微軟在上個月採取的措施相類似。微軟當時表示，將支付較高的公用事業電費費率，以便得以涵蓋電力成本，公司並將與當地公用事業公司合作，在資料中心需要時能擴大電力供應。 Anthropic在周三還表示，公司正在投資研究，如何減少資料中心用電量，並開發電網\n時報資訊 ・ 1 天前 ・ 發表留言\n\nIPO在即創始團隊半數離職　馬斯克重整xAI布局太空AI （中央社舊金山2026年02月11日綜合外電報導）馬斯克（Elon Musk）創立的人工智慧（AI）新創公司xAI兩名共同創辦人本週接連辭職後，創始團隊目前已有半數成員離開，引發外界對預期初次公開募股（IPO）前的人才留任能力產生新的疑慮。綜合法新社和路透社報導，xAI與馬斯克的太空探索科技公司（SpaceX）上週整合，xAI估值超過2000億美元。這次人事出走發生在一個敏感時刻。合併後的實體預計最快今年夏季上市。xAI在多個國家面臨消費者反彈與監管審查，因其Grok聊天機器人與圖像生成工具曾被用於大量製作深偽色情影像，包括未成年人影像。xAI共同創辦人吳宇懷9日晚間在社群平台X發文宣布辭職，表示「是時候展開人生的下一個篇章」。他協助打造xAI核心推理能力。不到24小時後，另一位共同創辦人巴吉米（JimmyBa）也宣布離職，稱10日是他最後一天在職，並感謝馬斯克「讓我們踏上這段不可思議的旅程」。這兩人接連離開，使得2023年創立xAI的12名共同創辦人中，已有6人離職。xAI當初以挑戰ChatGPT開發商OpenAI、谷歌（Google）及Anthropic為目標成立。近幾個月來，也有\n中央社財經 ・ 1 天前 ・ 發表留言\n\nWhatsApp AI封路？歐盟警告Meta可能違規 綜合外媒周一 (9 日) 報導，Meta Platforms(META-US)因限制競爭對手的人工智慧 (AI) 聊天機器人進入 WhatsApp 平台，遭歐盟示警，歐洲監管機構正考慮採取臨時措施，要求該公司開放平台，相關動作也可\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n《國際產業》傳三星泰勒廠動起來 2026先進晶片訂單目標逾100% 【時報編譯柳繼剛綜合外電報導】美媒指出，已獲得臨時許可的三星電子，可以開始在德州泰勒市的晶圓廠，進行部分生產作業，同時，這也表示這家韓國科技大廠，在美國生產特斯拉下一代AI5晶片的計畫，又向前邁出重要的一步。 韓國中央日報( Korea JoongAng Daily)上周報導，三星電子位於泰勒市的370億美元晶圓代工廠，已獲得臨時使用許可(TCO)，也就是說，這座晶圓廠預訂在2026下半年正式竣工之前，生產線已經可以開始運作。 此報導指出，當地市政府官員證實，三星Fab 1大樓約8,600平方公尺的區域已拿到臨時使用許可，預計將有更多工作場所將獲得使用核准，剩下空間的許可，審核時間尚未確定。不過，泰勒市長預測，三星這座晶圓廠應可提前投產。 根據了解，三星這座泰勒廠預估在2026下半年投產後，可望製造特斯拉的AI5晶片。另外，這座晶圓廠可能還會生產特斯拉即將推出的AI6晶片。特斯拉執行長馬斯克日前曾說，AI5設計接近完成，AI6的研發已開始，未來幾代晶片的設計周期將，控制在九個月之內，也在規畫AI9晶片推出時間。 美媒表示，位於泰勒的這座三星晶圓廠，其餘的建設仍按計畫在進行。據傳三星想在\n時報資訊 ・ 3 天前 ・ 發表留言\n\n《國際產業》本田Q3本業獲利暴跌6成 2025財年營利目標不變 【時報編譯柳繼剛綜合外電報導】本田汽車集團10日公布財報時表示，受到美國新關稅政策以及電動車需求疲弱的影響，第三財季營業利益年減61.4%，且連續四季都是下滑的狀況。 這家僅次於豐田汽車的日本第二大車廠指出，第三季營業利益為1,534億日圓，約9.8707億美元，低於倫敦證券交易所集團(LSEG)調查的平均預期值1,745億日圓。 相較之下，2024年同期營業利益為3,973億日圓。本田維持2026年三月底結束，也就是2025財年的營利預估為5,500億日圓。本田表示，汽車業務在本財年的前九個月，也就是2025年4到12月期間都出現營業虧損。 2025財年前九個月，本田汽車合併營收為15.97兆日圓，年減2.2%，同時，營業利益為5915億日圓，年減48%。因此，經稀釋過的每股盈餘為115.53日圓，2024年同期為169.69日圓。\n時報資訊 ・ 3 天前 ・ 發表留言\n\n台積電3奈米加持 思科殺入AI網路戰場 思科 (CSCO-US) 周二 (10 日) 宣布推出一款全新人工智慧 (AI) 網路晶片與路由器，瞄準大型資料中心的高速資料傳輸需求，並直接與博通 (AVGO-US) 與輝達 (NVDA-US) 爭奪規模高達 6,000 億美元的 AI 基礎設施投\n鉅亨網 ・ 3 天前 ・ 發表留言\n\nSpaceX、特斯拉風險升！經濟學人：馬斯克把整個帝國押在AI上 《經濟學人》指出，全球首富馬斯克正將 SpaceX、xAI 與特斯拉全面押注人工智慧。隨著 SpaceX 與 xAI 以 1.25 兆美元估值合併、太空資料中心與機器人計畫齊發，獲利與監管風險同步升高，一旦 AI 願景落\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n比晶片與電力更難搞定！美國居民正集體對近千億美元AI基礎設施說不 隨著人工智慧浪潮席捲全球，大型科技公司正以前所未有的速度擴張資料中心。然而，這場建設狂潮在美國各地正遭遇強大的地方阻力。根據統計，光是在 2025 年第二季，就有價值 980 億美元的資料中心計畫因地方反對而遭到封鎖或推\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n《科技》AI伺服器 帶動零組件升級潮 【時報-台北電】AI資本支出進入加速期，雲端服務商連續上修資料中心擴建與升級，顯示2026年訓練與推論需求將維持高檔。預估輝達GB200/300出貨量將由2025年的2.5萬櫃成長至2026年的6.5萬～7萬櫃，成長逾1倍。 ASIC AI伺服器亦成2026另一亮點，AWS與Google為ASIC主要兩大客戶，2026年晶片出貨量預計將年增50％～80％。 在平台面，GPU世代更迭推動伺服器「高功耗×高密度×高頻寬」三軸升級。訓練機櫃熱設計功耗由百千瓦級上探兩百千瓦以上，熱管理轉向液冷為主流；水冷板、冷卻迴路與快接頭用量大幅增加，資料中心端的配電、管路與冷卻站建設形成新增價值。 同時，供電體系全面重構：主流電源由單機櫃千瓦級提升至雙位數千瓦級，備援電池模組與配電冗餘與效率規格同步上修。 高速互連則在叢集規模與橫向擴展下加速升級。800GbE迅速普及，1.6TbE的導入時程加速推進；內外部互連需在更高頻寬、低抖動與低延遲下維持信號完整性，帶動更高階材料與加工公差。 PCB/CCL板層由20+向30+演進，低粗糙度銅箔、低介電常數玻纖與石英布滲透率提升，介面材料朝超低損失等級推進；載板面積\n時報資訊 ・ 1 天前 ・ 發表留言\n\n熱門新聞\n1\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 2\n\n13.5億威力彩「2得主」買法一模一樣！ 只花100元就翻身 3\n\n郭台銘大紅包發威！央行新台幣發行額首破4.2兆  年增率飆3年最高 4\n\n「新版新台幣」可能有石虎！票選結果曝光 台積電僅排第七 5\n\n【房地產週報】輝達簽約落腳北士科！29年最大交屋潮來襲！新竹預售屋慘崩82.3%！七大都會區交易量年減7成\n\n你可能會喜歡\n你上車了嗎？記憶體登蛇年狂飆主力　前10猛將全曝光 FTNN新聞網\n\n九大工業公會聯合肯定台美貿易協定 強調為產業注入強心針 民視財經網\n\n春節搭車風險升溫！行車保護傘保障出行　花1元即可享百萬保障 三立新聞網 setn.com\n\n「台灣價值」竟沒台灣之光！大盤飆新高00940卻回不到10元　股民哀號：成敗皆這1檔 鏡週刊Mirror Media\n\n緝捕馬杜洛震驚全球 美軍傳動用AI工具Anthropic Claude 鉅亨網\n\n信義房屋：年前家電、家具換新需求高 今日新聞NOWNEWS\n\n台股拉警報！專家警告美股7巨頭集體翻車：最慘開年行情 中時財經即時\n\n外食族吃不消! 海南雞飯漲20元 手搖飲過年期間漲5元 民視財經網影音\n\n鄭麗君團隊立大功！謝金河曝「台美ART簽署」意義：台灣獲1席珍貴位子 三立新聞網 setn.com\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 工商時報\n\n租屋族省很大！租金補貼減輕4成負擔 女性與25歲以下青年成主力 太報\n\n法人兩樣情！華邦電發說利多連發...目標價上看200元 　保守派「4理由」只喊88元 FTNN新聞網\n\n美股掀AI恐慌交易　台積電ADR挫0.47％ CTWANT\n\n陸客不去日本！外媒爆25萬大軍「改衝這國」 刷爆103億不手軟 中時財經即時\n\n金蛇年「大漲萬點」封關！0050領銜市值型ETF悍漲　近十年含息報酬率高達509% FTNN新聞網\n\n台灣賓士對「台美貿易協議」成功達成表達祝賀 並承諾回饋消費者 民視財經網\n\n聯電ADR13日上漲0.13美元漲幅1.26%折台股65.68元 中央社財經\n\n砸5億擴產最快Q2釋產能！PCB股華通衝連3漲　當沖爆量破5萬張登當沖王 FTNN新聞網\n\n輝達下跌、AMD上漲 背後關鍵或在Arista 鉅亨網\n\n美通膨降溫難掩「AI恐慌」! 美股漲跌互見、台積電ADR下跌0.51％ 新頭殼\n\n台美ART簽署》台經院張建一妙喻：台灣付的午餐費 比別人還低 工商時報\n\n大研生醫* 公告本公司股票面額由「新台幣10元」變更為「新台幣1元」，公告期間：114年12月22日至115年3月21日。 Moneydj理財網\n\n外資降評唱衰！大咖投顧逆風喊買面板指標大廠「這檔」　最新目標價曝光 FTNN新聞網\n\n春節放假也能追美股！內部數據曝光　過年反而更敢買 三立新聞網 setn.com\n\n記憶體嚴重短缺！美國軍工企業黑名單 移除中國長鑫、長江存儲 自由時報\n\n運載指標／港務公司貨櫃量上看1,390萬TEU 今日新聞NOWNEWS\n\n關稅干擾消失加AI助攻　經濟成長率上修至7.71％ 卡優新聞網\n\n主動式ETF規模破1739億！這檔年化配息率10％　豪配0.377元「年後這天」最後上車日 FTNN新聞網\n\n到全台最夯紫南宮借發財金　主委莊秋安：心存善念有來有保庇 鏡報\n\n新北房市 新莊幸福路商圈 成家首選 工商時報\n\n台美ART 守住重要農產品防線 工商時報\n\n蘇威元：台積電概念股飆漲密碼 這四指標抓飆股一次賺58% 民視財經網影音\n\n〈能源盤後〉油價因美通膨趨緩回升 周線仍收黑 鉅亨網\n\n13家金控1月獲利全公布！國泰金元月大賺146億元　EPS達0.99元登獲利王 FTNN新聞網\n\n美通膨降溫難掩AI隱憂　美股漲跌互見 太報\n\n〈貴金屬盤後〉黃金、白銀回神 CPI重燃降息預期 鉅亨網\n\n傳統軟體股崩跌回五年前！卡爾先生：掌握這兩點才能存活 民視財經網影音\n\n台股資料來源 臺灣證券交易所 、 臺灣期貨交易所 及 財團法人中華民國證券櫃檯買賣中心 ，國際股市資料來源請參考 Yahoo Finance 。台股行情、個股基本資料及財務資訊為精誠資訊提供。使用Yahoo股市服務前，請您詳閱相關 使用規範與聲明 。\n\n服務條款 隱私權 您的隱私權選擇 加州隱私權通知 © 2026 Yahoo. All rights reserved.\n\n1",
      "Language": "zh",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-12",
      "Time": "10:42:44",
      "Source": "Yahoo奇摩股市",
      "Title": "《美股》消息面：美預算赤字恐破表；金銀走高",
      "URL": "https://tw.stock.yahoo.com/news/%E7%BE%8E%E8%82%A1-%E6%B6%88%E6%81%AF%E9%9D%A2-%E7%BE%8E%E9%A0%90%E7%AE%97%E8%B5%A4%E5%AD%97%E6%81%90%E7%A0%B4%E8%A1%A8-%E9%87%91%E9%8A%80%E8%B5%B0%E9%AB%98-024244905.html",
      "Content": "【時報編譯柳繼剛綜合外電報導】消息面：\n●美國財政部的數據顯示，截至一月的2026財年前四個月，聯邦政府預算赤字，已從2025年同期8400億美元，降至6970億美元，減幅達17%。同時，關稅收入達1240億美元，年增逾3倍。光是一月來說，關稅收入就高達300億美元，年增高達2.75倍。川普表示，自己的新關稅政策幫助美國減少78%的貿易逆差，明年貿易將會轉為順差。另方面，美國國會預算辦公室(CBO)示警，2026財年預算赤字估將小增至近1.9兆美元，到了2036年時更是增至3.1兆美元。\n\n●美國總統川普於美東11日，在白宮會見來訪的以色列總理納坦雅胡，川普會後表示，除了自己堅持要持續與伊朗談判，確定是否能達成協議外，與納坦雅胡並沒有達成任何明確的結論。\n\n●現貨金一度上漲1.87%，每盎斯高點來到5119.3美元，收在5084.53美元，漲幅為1.17%。另外，現貨銀收在84.3115美元，漲4.35%。印尼政府暗示，將大幅刪減今年鎳礦產能配額，倫敦期鎳每噸收18002.38美元，大漲2.55%。\n●紐約期油一度大漲2.92%，高點每桶來到65.83美元，收漲1.05%，為64.63美元。同時，布蘭特期油也上漲0.87%，每桶收在69.4美元。截至二月六日那周，美國原油庫存大增850萬桶，達4.288億桶，創一年來最大增加數量，遠超過先前預期的增加80萬桶。\n●美匯指數一度上漲0.49%，最高曾來到97.272點，目前在96.81左右。美元兌日圓在152.688價位，美元貶值0.27%。同時，美元兌一歐元在0.8413左右，波動變化不大。\n\n檢視留言\n\n相關內容\n《美股》消息面：川普關稅大棒重擊美民眾；油金齊跌 【時報編譯柳繼剛綜合外電報導】消息面： ●紐約聯邦準備銀行報告指出，川普實施的新關稅政策，承擔進口關稅的對象，竟然90%是美國的老百姓。該份報告表示，去年1到8月之間，約94%的關稅成本已轉嫁給美國企業和消費者，9到10月降至92%，11月則在86%。無獨有偶，美國國會預算辦公室(CBO)前一日發布的報告也指出，外國出口商將承擔5%多出的成本，美企自行吸收30%的進口差價，剩下的部分將藉由漲價的方式轉嫁給民眾。 ●美國2月首次申請失業救濟人數，較前一周減少5,000人，降至22.7萬，高於市場預期的22.2萬，接近先前修正後的八周高點。同時，1月持續申請失業救濟人數增加2.1萬，來到186.2萬，持續申請失業救濟人數增加，因冬季風暴衝擊美國多處地方，導致商業活動中斷，造成更多家庭經濟面臨困境。 ●現貨金價一度大跌4.06%，每盎司曾跌至4878.24美元，收盤時為4921.85美元，但還是下挫3.2%。同時，現貨銀價一度最多重挫11.71%，低點跌至74.4355美元，收盤每盎司為75.2835，大跌10.71%。 ●紐約期油下跌2.77%，每桶收在62.84美元。同時，布蘭特期油也跌\n時報資訊 ・ 22 小時前 ・ 1 則留言\n\n美關稅成本 企業自行吸收9成 儘管川普政府不斷聲稱對海外實施的對等關稅，其成本將由外國支付，但根據紐約聯準銀行（Federal Reserve Bank of New York）發布的最新報告指出，在川普政府去年激進調高對等關稅後，事實上高達9成的額外成本都落在美國企業與消費者身上。\n工商時報 ・ 5 小時前 ・ 1 則留言\n\n《國際經濟》美國債務占GDP比重 2036年恐升至120％ 【時報-台北電】美國國會預算辦公室（CBO）11日示警，美國目前正走在一條無法持續的財政道路上，預估到2036年時，國家債務占國內生產毛額（GDP）的比重將從2025年的約99％上升至120％。 CBO報告稱，總統川普去年7月推出財政方案《大而美法案》，延長其2017年的減稅措施，並實施新的稅收優惠，預計將使國家債務在2034年前增加4.2兆美元、在2035年前增加4.7兆美元。預測美國債務總額於2036年攀升至56.15兆美元，占GDP比重達120％，明顯高於2025年的30.17兆美元與99％，預估至2030年占GDP比率便將超越1946年、因二戰債務創下的106％高點。 上述減少措施所增加的債務將超過川普提高進口關稅所帶來的收入，其提出的關稅措施，已將平均有效關稅稅率提高到13％以上，至少為20世紀40年代以來的最高水準。 另估算關稅帶來的額外收入將在未來減少3兆美元的赤字，不過前提是，截至11月20日生效的美國貿易政策在未來十年內保持不變。CBO指出，未來數個月和數年內，除美國最高法院將裁定川普徵收多項關稅是否越權外，未來政府亦可能調整政策方向。 此外，淨利息支出預計將推動赤字\n時報資訊 ・ 1 天前 ・ 發表留言\n\n美關稅收入1月暴增逾300% 最高法院一紙判決恐牽動退稅風暴 美國 1 月關稅收入暴增逾 300%，市場關注，最高法院針對川普政府關稅合法性所做的裁決仍未出爐，若判決不利，恐迫使美國退還已徵收的關稅，進而衝擊聯邦財政。\n鉅亨網 ・ 2 天前 ・ 發表留言\n\n《國際政治》高市輾壓式勝利 川普第一時間賀 【時報編譯柳繼剛綜合外電報導】川普於美國時間八日，祝賀日本首相高市早苗領導的自民黨，在日本大選中取得壓倒性勝利(landslide victory)，同時，這位美國總統也說，自己前幾天曾公開表示，要支持高市早苗。 川普在社交媒體上發文指出，高市早苗決定提前舉行大選，不僅是大膽且是明智(bold and wise)的，希望高市以在國會絕對的多數，能順利推進保守的和平政策。 在日本自民黨贏得眾議院高達三分之二的多數席位，並創下日本戰後歷史新高後的幾個小時，川普隨即回應，熱情投票的日本人民，將永遠得到我的堅定支持。 美國財政部長貝森特在美國福斯新聞(Fox News)節目中也說，川普與高市早苗的關係很好，當日本強大時，代表美國在亞洲也強大。在八日大選前幾天，川普已表態會全力支持高市，並於三月19日在白宮歡迎這位日本第一位女首相。 日媒指出，高市千尋下個月在就任首相以來，可望首次訪美，且時間上要早於川普計畫四月訪中。幾個月以來，中國一直對高市關於潛在性的台海危機言論，抱持非常強硬的立場。 自從高市早苗在去年10月就任首相以來，川普就一直讚揚高市是日本已故首相安倍晉三的門生，事實上，川普在美國總\n時報資訊 ・ 4 天前 ・ 發表留言\n\n《美股》消息面：盧特尼克稱美不會阻礙晶片業；比特幣跌破6.9萬美元 【時報編譯柯婉琇綜合外電報導】消息面： ●ADP公布，在截至1月24日的4周內，美國民間就業每周平均增加6500人，高於前值（5000人），為連續第三周成長，並創下1月3日以來新高。 ●美國2025年12月零售銷售額與11月相比持平，不及市場預期的月增0.4%。排除汽車的零售銷售額亦與11月持平，落後市場預期的月增0.3%。 ●美國石油協會（API）公布，上周（截至2月6日）美國原油庫存大增1340萬桶；前一周為庫存減少1110萬桶。此外，汽油庫存增加330萬桶，包括柴油和取暖油在內的餾分油庫存減少200萬桶。 ●周二在參議院撥款委員會小組出席聽政會時，美國商務部長盧特尼克（Howard Lutnick）表示，美國去年第四季國內生產毛額（GDP）成長率預估將突破5%，而今年第一季可能突破6%。他表示，美元回落至「較自然」的價位，有利於促進美國出口和加速經濟增長，今年製造業就業將出現巨大的增長，有助於美國經濟實現如此強勁的增長。盧特尼克並表示，美國對AI晶片的需求龐大，華盛頓不會想採取任何可能阻礙晶片業發展的措施。 ●克利夫蘭聯準銀行總裁哈馬克（Beth Hammack）表示，聯準會利率\n時報資訊 ・ 2 天前 ・ 1 則留言\n\n美恢復委內瑞拉石油交易　授權企業參與油氣開發 （中央社華盛頓2026年02月10日綜合外電報導）美國今天進一步放寬對委內瑞拉石油產業的限制。由於委內瑞拉先前已解除國有部門的管控，美方如今擴大允許美企進入當地從事石油業務。法新社報導，美國財政部發布1項許可，放行若干涉及委內瑞拉政府及委內瑞拉國營石油公司（PDVSA）的商業往來，藉此提供在委國「探勘、開發、生產石油或天然氣」所需的物資、技術與軟體。美國財政部另發布許可，授權港口及機場營運所需的特定交易；而第3份文件則開放部分與委內瑞拉產油相關的活動。美國總統川普（Donald Trump）1月3日對委內瑞拉發動致命轟炸行動、推翻馬杜洛（Nicolas Maduro）政權，隨後施壓卡拉卡斯（Caracas）當局開放油田給美國投資者進入。川普支持馬杜洛的副手羅德里格斯（DelcyRodriguez）接掌政權，條件是她必須讓華府得以進入這個擁有全球已探明石油儲量最大的國家。根據美國媒體報導，美國能源部長萊特（ChrisWright）計劃於未來某個時間點前往委內瑞拉，進行石油相關會談。自2019年起遭美國制裁的委內瑞拉，擁有全球約1/5的石油儲量，過去曾是美國主要原油供應國之一。\n中央社財經 ・ 2 天前 ・ 發表留言\n\n《美股》消息面：華許若就任 川普喊GDP飆15%；美發警示 油價彈升 【時報編譯柯婉琇綜合外電報導】消息面： ●美國交通部海事局周一向航經荷姆茲海峽的商船發布新指引，建議「懸掛美國國旗的商船在不影響航行安全下，應盡可能遠離伊朗領海，以降低遭攔查或扣押風險」，「如果伊朗軍隊登船，船員不應以武力抵抗」。海事局表示，伊朗部隊最近一次對通過荷莫茲海峽與阿曼灣的船隻登船檢查，是發生在2月3日。儘管伊朗最高外交官員上周五表示，由阿曼居中斡旋的美伊核談判取得樂觀進展，但美國總統川普卻在同一日加大對伊朗的施壓。川普簽署了行政命令，落實他日前釋出的威脅，也就是對於任何「直接或間接」採購伊朗商品的國家加徵25%進口關稅。 ●Fox Business報導，美國總統川普表示，如果他提名的人選華許（Kevin Warsh）獲准就任聯準會主席，並有效發揮能力、履行其職責，那麼美國經濟成長率可望達到15%，甚至可能更高。川普並表示，華許是他第一個任期時的聯準會主席第二人選，而最終他選擇了鮑爾「真是一大錯誤」。美國2026年GDP成長率預估為2.4%，過去50年的平均年度成長率約為2.8%。自1950年代以來，美國經濟成長長率超過15%的情況，寥寥無幾。 ●周一紐約尾盤美元指數跌0.8\n時報資訊 ・ 3 天前 ・ 發表留言\n\n台美敲定貿易最終協議 關稅定調15%、擴大採購美國商品 據《路透》報導，美國川普政府官員已簽署互惠貿易最終協議，確認對自台灣進口商品課徵 15% 的關稅，同時承諾台灣將依時程逐步取消或調降幾乎所有美國商品的關稅。\n鉅亨網 ・ 1 天前 ・ 發表留言\n\n「拋售美國」幻滅！ 外資反手掃貨 美債成安全港超諷刺 美國國債近期的拍賣中，外國投資者的參與度持續上升，緩解了市場對美國國債避險地位下降以及龐大財政赤字可能阻礙海外資金流入的擔憂。根據道明證券（TD Securities）分析美國財政部數據，1月外國及國際帳戶在美國國債拍賣中的獲配比例約為19%，為近3年最高水準。回顧過去5年，這一比例在2022年初一度接近25%，但到2024年11月曾降至不到10%。\n中時財經即時 ・ 2 天前 ・ 2 則留言\n\n金融時報：川普擬縮減鋼鋁產品部分關稅 （中央社華盛頓2026年02月13日綜合外電報導）美國總統川普計劃縮減對鋼鐵及鋁製品的部分關稅，以因應生活成本危機帶來的壓力，這場危機已導致他的支持率下滑，而距離美國11月期中選舉僅剩幾個月。英國「金融時報」（Financial Times）報導，川普（Donald Trump）去年夏天對進口鋼鋁課徵最高達50%的關稅，並將課稅範圍擴及許多鋼鋁製品，例如洗碗機和烤箱。不過根據3名知情人士，川普政府現正審查受鋼鋁關稅影響的產品清單，計劃給予部分品項豁免、停止擴大課稅清單，並轉而對特定商品展開更具針對性的國家安全調查。這些知情人士透露，美國商務部及美國貿易代表署（USTR）的貿易官員認為，這些關稅促使烤盤、食品罐和飲料罐等商品漲價，對消費者造成傷害。川普的關稅攻勢使美國關稅水準攀升至第二次世界大戰戰前以來最高峰，不過隨著選民對美國生活成本危機的不滿日益加劇，川普已多次撤回部分最嚴格的關稅措施。皮尤研究中心（Pew Research Center）本月發布的民調顯示，逾7成美國成年人認為當前經濟狀況「普通」或「不佳」，約52%美國人認為川普的經濟政策導致情況惡化。美國商務部、美國貿易代表署及\n中央社財經 ・ 17 小時前 ・ 發表留言\n\n美行政命令可變性高 市場高度關注 台美對等貿易協定（ART）終於完成簽署，雖說可藉此扭轉過去沒有與美國簽署自由貿易協定（FTA）的貿易劣勢，但仍有多個關鍵問題有待持續關注，首先，兩者本質卻截然不同。前者是川普政府利用關稅為手段的貿易政策手段；後者則是以消除貿易壁壘為主要目的。此外，這次ART為台灣爭取到2,072項產品的豁免關稅，但當中有337項產品是美國對「全球豁免」的產品，鑒於川普政府的反覆不定，導致未來仍有高度不確定性。\n工商時報 ・ 5 小時前 ・ 發表留言\n\n紐約聯準銀行報告：美國人承擔川普幾乎全部關稅成本 （中央社紐約2026年02月12日綜合外電報導）紐約聯邦準備銀行（Federal Reserve Bank of New York）今天發布報告指出，美國民眾幾乎承擔了總統川普大幅提高進口關稅所帶來的全部成本。路透社報導，紐約聯準銀行表示，川普對進口商品加徵的關稅中，90%由美國消費者與企業負擔。這份報告反駁了川普政府稱「關稅由外國支付」的說法。報告評估去年關稅對經濟的影響。當時平均關稅稅率從2.6%提升至13%。報告指出，2025年平均稅率明顯波動，在4月與5月達到高峰，當時川普將中國商品進口關稅提高至125%，隨後下調至113%。報告作者根據川普第一任期內的關稅運作進行分析。他們表示，面對這類稅負時，「過去的研究發現，外國出口商並未調降價格，因此關稅的全部成本由美國承擔。也就是說，關稅對進口價格的轉嫁率為100%。」報告指出，去年1月至8月期間，美國人承擔94%的關稅衝擊，9月至10月降至92%，11月則為86%。紐約聯準銀行的研究結果與國會預算處（CBO）昨天發布的報告一致。國會預算處指出，「較高的關稅直接提高進口商品成本，推升美國消費者與企業面臨的價格。」至於誰將承擔關稅成本，\n中央社財經 ・ 21 小時前 ・ 1 則留言\n\n川普自豪宣稱美國已進入「川普經濟」！民調卻顯示多數民眾不買單 美國總統川普在接受《NBC》專訪時宣稱，美國已正式進入「川普經濟」時代，並預測 2026 年經濟將更勝以往。不過，最新民調顯示，多數美國民眾對經濟現況仍感不滿，官方數據與川普所稱的經濟成長與投資金額也出現落差，相關說法引\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n道明證券分析顯示，近幾個月來外資對美債需求穩健 【財訊快報／劉敏夫】外電報導指出，道明證券(TD Securities)方面表示，近幾個月來，外國買家在美國中長期國債拍賣中比重持續提升，舒緩了市場對避險屬性受損以及巨額財政赤字可能令海外資金卻步的擔憂。道明證券對美國財政部數據的分析顯示，1月份，外國及國際帳戶在美國國債拍賣中的獲配比例約19%，創近三年來最高水準。過去五年中，這一比例曾在2022年初一度高達近25%，此後在2024年11月降至不足10%。美國發行七種常規美國國債，期限從2年至30年不等，以及三種通膨保值國債(TIPS)。道明證券策略分析師Gennadiy Goldberg、Jan Nevruzi和Molly Brooks在報告中表示，外國帳戶在國債拍賣中的獲配比例上升，「覆蓋面相對廣泛」。Goldberg接受採訪時表示，我們獲得的數據越多，就越覺得所謂的「拋售美國」交易更多是一種市場說法，而非現實。美國財政部的另一組數據顯示，外國投資者在2025年4月關稅宣布後曾賣出530億美元美國國債，但此後至11月又增持了3,540億美元美債。Goldberg表示，當你詢問許多外國投資者如何處理其美債持倉時，他們會承認對其他投資\n財訊快報 ・ 3 天前 ・ 發表留言\n\n為選舉拉民心！傳川普有意調降部分鋼鐵和鋁製品關稅 路透引述金融時報（FT）報導，知情人士透露，美國總統川普計劃調降部分鋼鐵和鋁製品的關稅。\n中時財經即時 ・ 18 小時前 ・ 發表留言\n\n川普關稅推升海關保證金缺口 金額創近36億美元新高 《CNBC》周四 (12 日) 報導，美國總統川普關稅政策推動下，愈來愈多將商品運往美國的企業，無法滿足聯邦政府要求的海關保證金額度，導致美國政府出現創紀錄的資金缺口。\n鉅亨網 ・ 1 天前 ・ 發表留言\n\n美加又吵? 控未用美建材 川普嗆封邊境大橋 [非凡新聞]記者林文浩在加強邊境管制、加徵關稅，還揚言併吞之後，川普又威脅加拿大要封鎖邊境大橋，以未獲公平補償、未使用美國建材，以及加拿大深化對中經貿為由，要求美方要取得這座橋的半數資產。加拿大總理卡尼...\n非凡新聞 ・ 2 天前 ・ 發表留言\n\n美國國務院：冀與日本合作，推動印太及全球層級安全與經濟共同利益 美國川普總統祝賀日本高市早苗首相於眾議院選舉大勝及相關日本媒體輿論反應 依據日本經濟新聞本(2026)年2月9日報導，美國川普總統於8日透過社群媒體向日本首相高市早苗表達祝賀，肯定自民黨於眾議院選舉中取得壓倒性勝利，並稱讚高市首相果斷決定解散眾院、舉行選舉之政治判斷，成功鞏固執政基礎，同時期盼高市首相能成功實現其所倡議之「以實力維護和平」（Peace through Strength）之保守派外交與安全政策。惟日經亦進一步分析報導，川普總統對高市內閣之「全面支持」除基於理念相近外，亦夾雜日本對美國5,500億美元投融資進度落後之不滿與施壓意涵。 川普總統於選前即曾罕見表態，對高市首相領導之自民黨、維新會執政聯盟給予「完全且全面的支持」，並於選後再次強調對日本選民及高市政權之高度評價。相關發言被日媒普遍解讀為美方對日本防衛力強化及日美同盟深化之高度期待，亦顯示川普政府將高市政權視為印太戰略中之重要夥伴。此外，美國財政部長Scott Bessent亦於社群平台祝賀高市首相，形容此次選舉為「戰後最大票差的歷史性勝利」，並指出「日本越強，美國在亞洲就越強」，強調日美領袖間之密切關係有助於強化雙\nMoneydj理財網 ・ 2 天前 ・ 發表留言\n\n路透調查：Fed今年料降息2次 6月重啟降息 路透12日公布最新調查顯示，預期聯準會今年兩度降息，隨著新任主席華許（Kevin Warsh）就職，料於6月重啟降息。但華許主張的大幅縮表，專家認為恐因財政部大量發債難以實現。\n中時財經即時 ・ 1 天前 ・ 發表留言\n\n熱門新聞\n1\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 2\n\n13.5億威力彩「2得主」買法一模一樣！ 只花100元就翻身 3\n\n郭台銘大紅包發威！央行新台幣發行額首破4.2兆  年增率飆3年最高 4\n\n「新版新台幣」可能有石虎！票選結果曝光 台積電僅排第七 5\n\n【房地產週報】輝達簽約落腳北士科！29年最大交屋潮來襲！新竹預售屋慘崩82.3%！七大都會區交易量年減7成\n\n你可能會喜歡\n你上車了嗎？記憶體登蛇年狂飆主力　前10猛將全曝光 FTNN新聞網\n\n九大工業公會聯合肯定台美貿易協定 強調為產業注入強心針 民視財經網\n\n春節搭車風險升溫！行車保護傘保障出行　花1元即可享百萬保障 三立新聞網 setn.com\n\n「台灣價值」竟沒台灣之光！大盤飆新高00940卻回不到10元　股民哀號：成敗皆這1檔 鏡週刊Mirror Media\n\n緝捕馬杜洛震驚全球 美軍傳動用AI工具Anthropic Claude 鉅亨網\n\n信義房屋：年前家電、家具換新需求高 今日新聞NOWNEWS\n\n台股拉警報！專家警告美股7巨頭集體翻車：最慘開年行情 中時財經即時\n\n鄭麗君團隊立大功！謝金河曝「台美ART簽署」意義：台灣獲1席珍貴位子 三立新聞網 setn.com\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 工商時報\n\n租屋族省很大！租金補貼減輕4成負擔 女性與25歲以下青年成主力 太報\n\n法人兩樣情！華邦電發說利多連發...目標價上看200元 　保守派「4理由」只喊88元 FTNN新聞網\n\n美股掀AI恐慌交易　台積電ADR挫0.47％ CTWANT\n\n陸客不去日本！外媒爆25萬大軍「改衝這國」 刷爆103億不手軟 中時財經即時\n\n金蛇年「大漲萬點」封關！0050領銜市值型ETF悍漲　近十年含息報酬率高達509% FTNN新聞網\n\n外食族吃不消! 海南雞飯漲20元 手搖飲過年期間漲5元 民視財經網影音\n\n台灣賓士對「台美貿易協議」成功達成表達祝賀 並承諾回饋消費者 民視財經網\n\n聯電ADR13日上漲0.13美元漲幅1.26%折台股65.68元 中央社財經\n\n砸5億擴產最快Q2釋產能！PCB股華通衝連3漲　當沖爆量破5萬張登當沖王 FTNN新聞網\n\n輝達下跌、AMD上漲 背後關鍵或在Arista 鉅亨網\n\n美通膨降溫難掩「AI恐慌」! 美股漲跌互見、台積電ADR下跌0.51％ 新頭殼\n\n台美ART簽署》台經院張建一妙喻：台灣付的午餐費 比別人還低 工商時報\n\n大研生醫* 公告本公司股票面額由「新台幣10元」變更為「新台幣1元」，公告期間：114年12月22日至115年3月21日。 Moneydj理財網\n\n外資降評唱衰！大咖投顧逆風喊買面板指標大廠「這檔」　最新目標價曝光 FTNN新聞網\n\n春節放假也能追美股！內部數據曝光　過年反而更敢買 三立新聞網 setn.com\n\n記憶體嚴重短缺！美國軍工企業黑名單 移除中國長鑫、長江存儲 自由時報\n\n運載指標／港務公司貨櫃量上看1,390萬TEU 今日新聞NOWNEWS\n\n蘇威元：台積電概念股飆漲密碼 這四指標抓飆股一次賺58% 民視財經網影音\n\n關稅干擾消失加AI助攻　經濟成長率上修至7.71％ 卡優新聞網\n\n主動式ETF規模破1739億！這檔年化配息率10％　豪配0.377元「年後這天」最後上車日 FTNN新聞網\n\n到全台最夯紫南宮借發財金　主委莊秋安：心存善念有來有保庇 鏡報\n\n新北房市 新莊幸福路商圈 成家首選 工商時報\n\n台美ART 守住重要農產品防線 工商時報\n\n〈能源盤後〉油價因美通膨趨緩回升 周線仍收黑 鉅亨網\n\n13家金控1月獲利全公布！國泰金元月大賺146億元　EPS達0.99元登獲利王 FTNN新聞網\n\n美通膨降溫難掩AI隱憂　美股漲跌互見 太報\n\n〈貴金屬盤後〉黃金、白銀回神 CPI重燃降息預期 鉅亨網\n\n傳統軟體股崩跌回五年前！卡爾先生：掌握這兩點才能存活 民視財經網影音\n\n台股資料來源 臺灣證券交易所 、 臺灣期貨交易所 及 財團法人中華民國證券櫃檯買賣中心 ，國際股市資料來源請參考 Yahoo Finance 。台股行情、個股基本資料及財務資訊為精誠資訊提供。使用Yahoo股市服務前，請您詳閱相關 使用規範與聲明 。\n\n服務條款 隱私權 您的隱私權選擇 加州隱私權通知 © 2026 Yahoo. All rights reserved.\n\n1",
      "Language": "zh",
      "IsSummarized": false
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-02-12",
      "Time": "09:08:50",
      "Source": "Simply Wall St.",
      "Title": "Intel AI Push Deepens With SambaNova Bet And New GPU Chief",
      "URL": "https://finance.yahoo.com/news/intel-ai-push-deepens-sambanova-010850786.html",
      "Content": "Get insights on thousands of stocks from the global community of over 7 million individual investors at Simply Wall St.\nIntel (NasdaqGS:INTC) is committing at least US$100 million to AI chip startup SambaNova Systems.\nThe company has also appointed former Qualcomm executive Eric Demers as its new Chief GPU Architect.\nBoth moves reflect a shift in how Intel is approaching AI chips and GPU development.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-12",
      "Time": "08:00:03",
      "Source": "Yahoo奇摩股市",
      "Title": "《美股》收盤速報：道瓊連3紅畫句號 費半逆揚",
      "URL": "https://tw.stock.yahoo.com/news/%E7%BE%8E%E8%82%A1-%E6%94%B6%E7%9B%A4%E9%80%9F%E5%A0%B1-%E9%81%93%E7%93%8A%E9%80%A33%E7%B4%85%E7%95%AB%E5%8F%A5%E8%99%9F-%E8%B2%BB%E5%8D%8A%E9%80%86%E6%8F%9A-000003457.html",
      "Content": "【時報-台北電】美股三大指數周三(11日)全數走低，標普持平，那指跌幅較大，道瓊則無法連四個交易日繼續收紅。不過，費半卻大幅走高，包括NVIDIA、英特爾以及台積電ADR都上漲，美光甚至飆升10%。另外，美國一月非農就業人數新增13萬，遠高於部分經濟學者預估只增加5.5萬人。同時，失業率也從4.4%小幅降至4.3%。美國最新的勞動力報告大好之下，CME(芝商所)FedWatch Tool數據中，高達95%的機率聯準會在一個月之後不會變動利率，只剩下約5%覺得，聯準會下次還會降息一碼。\n★四大指數\n\n美股道瓊下跌66.74點或0.13%，收50,121.40點。\n\nS&P500下跌0.34點或0.00%，收6,941.47點。\nNASDAQ下跌36.01點或0.16%，收23,066.47點。\n費城半導體上漲184.73點或2.28%，收8,291.86點。\n★11大類股\n能源類股(SPNY)漲2.59% 必需消費類股(SPLRCS)漲1.40%\n原物料類股(SPLRCM)漲1.30% 公用事業類股(SPLRCU)漲0.87%\n醫療類股(SPXHC)漲0.60% 工業類股(SPLRCI)漲0.51%\n科技類股(SPLRCT)漲0.21% 房地產類股(SPLRCREC)漲0.05%\n非必需消費類股(SPLRCD)跌0.55% 通訊服務類股(SPLRCL)跌1.31%\n金融類股(SPSY)跌1.49%\n★重磅科技股\n1.五大市值股\n微軟(MSFT)下跌2.15%，收404.37美元。\n蘋果(AAPL)上漲0.67%，收275.50美元。\n輝達(NVDA)上漲0.80%，收190.05美元。\nAlphabet(GOOGL)下跌2.39%，收310.96美元。\n亞馬遜(AMZN)下跌1.39%，收204.08美元。\n2.焦點股\n美光(MU)上漲9.94%，收410.34美元。\n恩智浦(NXPI)上漲5.55%，收249.75美元。\n應用材料(AMAT)上漲3.29%，收339.88美元。\n德州儀器(TXN)上漲2.55%，收226.56美元。\n英特爾(INTC)上漲2.46%，收48.29美元。\n艾司摩爾(ASML)上漲1.56%，收1435.63美元。\n輝達(NVDA)上漲0.80%，收190.05美元。\n特斯拉(TSLA)上漲0.72%，收428.27美元。\n高通(QCOM)上漲0.68%，收141.04美元。\n博通(AVGO)上漲0.68%，收342.76美元。\n蘋果(AAPL)上漲0.67%，收275.50美元。\n超微(AMD)上漲0.00%，收213.58美元。\nMeta(Meta)下跌0.30%，收668.69美元。\n安謀(ARM)下跌0.53%，收125.28美元。\n慧與科技(HPE)下跌0.67%，收23.81美元。\n思科(CSCO)下跌0.87%，收85.54美元。\n亞馬遜(AMZN)下跌1.39%，收204.08美元。\n戴爾科技(DELL)下跌1.47%，收124.16美元。\n甲骨文(ORCL)下跌1.71%，收157.16美元。\n微軟(MSFT)下跌2.15%，收404.37美元。\nAlphabet(GOOGL)下跌2.39%，收310.96美元。\n網飛(NFLX)下跌3.15%，收79.62美元。\n美超微(SMCI)下跌3.87%，收32.04美元。\nSalesforce(CRM)下跌4.37%，收185.00美元。\nIBM(IBM)下跌6.50%，收272.81美元。\n★台股 ADR\n台積電上漲12.18美元或3.37%，收374.09美元，換算台股價格為2355.12元。\n聯電上漲0.39美元或3.94%，收10.30美元，換算台股價格為64.84元。\n日月光上漲1.25美元或5.56%，收23.74美元，換算台股價格為373.64元。\n中華電信上漲0.31美元或0.74%，收42.44美元，換算台股價格為133.59元。(編輯：柳繼剛)\n\n檢視留言\n\n相關內容\n《美股掃瞄》憂AI搶飯碗 軟體股續挫 【時報編譯柳繼剛綜合外電報導】美股三大指數周三(11日)全數走低，標普持平，那指跌幅較大，道瓊則無法連四個交易日繼續收紅。不過，費半卻大幅走高，包括NVIDIA、英特爾以及台積電ADR都上漲，美光甚至飆升10%。另外，美國一月非農就業人數新增13萬，遠高於部分經濟學者預估只增加5.5萬人。同時，失業率也從4.4%小幅降至4.3%。美國最新的勞動力報告大好之下，CME(芝商所)FedWatch Tool數據中，高達95%的機率聯準會在一個月之後不會變動利率，只剩下約5%覺得聯準會下次還會降息一碼。 美股最新收盤價，道瓊下跌66.74點或0.13%，收50,121.4點。S&P500微幅下跌0.34點，幾乎持平，收6,941.47點。NASDAQ也跌36.01點或0.16%，收23,066.47點。不過，費城半導體卻大漲184.73點或2.28%，收8,291.86點。 標普11大類股上漲居多，例如，大漲2.59%的能源漲幅最大，必需消費漲1.4%，原物料漲1.3%，公用事業漲0.87%，醫療漲0.6%，工業漲0.51%，科技漲0.21%，房地產也小漲0.05%。相反地，非必需消費跌0.5\n時報資訊 ・ 1 天前 ・ 發表留言\n\n英特爾先進製程傳獲聯發科、蘋果青睞，惟前景疑慮致週二股價重挫逾6% 【財訊快報／陳孟朔】儘管英特爾(Intel，美股代碼INTC)在先進製程代工領域頻傳捷報，但週二(10日)股價仍慘遭血洗，收盤大跌3.11美元或6.19%，報47.13美元，淪為費城半導體指數表現最差的成分股。市場人士指出，雖然英特爾成功吸引聯發科(2454)與蘋果(Apple)評估其最新技術，但投資人更擔憂其產能轉換期的財測疲軟與供應短缺問題。在代工業務方面，最新消息指出聯發科有機會成為英特爾14A製程的首批重量級客戶，計畫利用該1.4奈米級工藝量產新一代「天璣(Dimensity)」行動晶片。此外，蘋果亦傳出已簽署保密協議，積極評估英特爾18A-P製程與先進封裝技術。分析師預測，若測試順利，蘋果最快將在2027年將入門級M系列晶片、2028年將非Pro版iPhone晶片部分轉交英特爾代工，這將打破台積電(2330)近十年來獨家供應蘋果先進晶片的局面。然而，亮眼的客戶名單未能挽救疲軟的短期股價。英特爾近期公布的2026第一季財測遠低於華爾街預期，財務長Zinsner表示，由於正全力從舊製程轉向18A等先進節點，加上緩衝庫存已耗盡，第一季將面臨嚴重的供應瓶頸。這種「有需求卻無貨可賣」的\n財訊快報 ・ 3 天前 ・ 發表留言\n\n前技術長22年見證　追隨者如何躍升領跑者 孫元成：台積電憑什麼　繳得起海外擴廠「學費」 台積電加速海外擴廠，引發成本上升與技術外移疑慮。前台積電技術長孫元成以22年第1線見證，拆解護國神山得以制霸全球的底氣，來自3項關鍵決策。\n財訊 ・ 19 小時前 ・ 發表留言\n\n瀾起科技登港股 首日漲6成 全球記憶體介面晶片龍頭瀾起科技9日在港交所正式掛牌交易，首日表現強勁，開盤報每股168港幣，較106.89港幣發行價飆漲57.2％，終場收在175港幣漲64％，全日成交量2,116.72萬股，成交金額達33.96億港幣。\n工商時報 ・ 4 天前 ・ 發表留言\n\n1月獲利狂飆856%！「伺服器滑軌廠」漲停後再衝6%寫新天價　輝達、CSP伺服器需求爆發 [FTNN新聞網]記者陳献朋／綜合報導受惠於AI霸主輝達（NVIDIA）旗下GB200產品放量以及CSP通用型伺服器需求大增，滑軌廠南俊國際（6584）1月獲利年增率高達856....\nFTNN新聞網 ・ 3 天前 ・ 發表留言\n\n《晨間解盤》壓力拆彈 台股樂看高檔封關 【時報-台北電】科技股延續漲勢加上軟體服務股持續反彈帶動，美股早盤震盪後走高，四大指數同步收漲，道瓊再度改寫新高。輝達上漲2.5%、台積電ADR收漲1.88%。 周一受到美股強彈帶動，台積電開盤挑戰天價，領軍電子權值反攻，台股衝高884點後持續高檔震盪。大盤開高走高，上漲1.96%作收，量縮至6500餘億元。記憶體、封測、機器人、低軌、矽光子、探針卡成為封關前的主流類股。 群益投顧指出，農曆春節長假在即，影響買盤追價積極度，惟指數收復短期均線，大幅化解技術面弱化壓力，預期可望維持高檔封關。 操作上，個股確實依據短期均線多空，汰弱留強擇優適度持倉。指數區間看31800~33000點。（編輯：張嘉倚）\n時報資訊 ・ 4 天前 ・ 發表留言\n\n〈美股早盤〉美1月就業報告超預期 主要指數開高 美股主要指數周三 (11 日) 開盤走高，延續近期走勢，主因美國 1 月就業數據優於市場預期，顯示經濟仍具韌性。標普 500 指數期貨上揚，指數走勢有望再度逼近歷史高點；道瓊工業指數盤初亦同步走強。資金動向方面，投資人降低對聯準會(F\n鉅亨網 ・ 2 天前 ・ 發表留言\n\n一輩子的痛！鴻海豪撒3億獎金「抽10位千萬大獎」　4人中獎不在場重抽 [FTNN新聞網]實習記者陳又綺／綜合報導鴻海（2317）昨（12）日在台北大巨蛋舉辦「2026全鴻海運動會」，現場湧入逾3萬名員工與眷屬同歡，輝達（NVIDIA）執行長...\nFTNN新聞網 ・ 1 天前 ・ 1 則留言\n\n亞洲最大恐龍親子樂園「啵比星球」引進AI機器人與機器狗 打造科技娛樂新地標 2026年春節最吸睛的科技娛樂話題正式登場！海灣集團(3252)旗下的亞洲最大恐龍主題親子樂園「HiONE啵比星球」今（12）日宣布，春節期間（2/17至2/22）斥資逾千萬元，引進全台第一機器人AI人形機器人，打造結合「恐龍×AI×未來科技」的沉浸式娛樂體驗，為傳統親子樂園注入嶄新科技能量，有望成為中台灣春節期間最具話題性的打卡熱點。\n中時財經即時 ・ 1 天前 ・ 發表留言\n\n中國國產AI算力突圍！摩爾線程旗艦GPU實測核彈級「參數」曝光 對標輝達H100 摩爾線程旗艦 GPU 實測性能對標輝達 H100 國產 AI 算力突圍 摩爾線程周四 (12 日) 宣布旗艦 AI 訓推一體 GPU MTT S5000 成功完成智譜新一代大模型 GLM-5 全流程適配驗證，實測性能突破國產算力天花板。 這款\n鉅亨網 ・ 1 天前 ・ 發表留言\n\n買房送裝修以為賺很大！其實暗藏貓膩？｜房市觀點 每當房市景氣反轉時，市場上就開始聽到有建商端出牛肉吸客，最常見的就是「買屋送家電」，甚至找已購客戶回娘家辦活動抽現金大獎吸客，也有建案主打「買房送裝修」，包括天、地、壁、廚具、衛浴設備，甚至連燈飾、櫃子、冷氣通通到位，更加碼送電視、冰箱、洗衣機等家電，標榜一卡皮箱即可入住。\nYahoo房地產編輯部 ・ 1 天前 ・ 1 則留言\n\n總統揮棒祝福！ 「大頭叔叔」爆米花球棒挺中華隊征戰2026經典賽 2026 年世界棒球經典賽（WBC）即將登場，中華隊再度踏上國際舞台，全台棒球熱潮持續升溫。這不僅是一場體育賽事，更是一場屬於台灣的榮耀時刻。 迎接這場全球矚目的棒球盛事，食品品牌「大頭叔叔」推出主題商品——「台灣尚勇」巨大球棒爆米花，以棒球象徵元素結合創意爆米花造型設計，成為\n鉅亨網 ・ 1 天前 ・ 發表留言\n\n超強AI差點不叫ChatGPT？OpenAI高層：上市前一天才改名 大家平時會跟ChatGPT聊天嗎？作為全球知名AI工具，ChatGPT差點就不叫這個名字！OpenAI首席研究長陳信翰（Mark Chen）在產品負責人尼克特莉（Nick Turley）在播客節目中分享，2022年上市前一天，該產品名稱仍是「Chat with GPT-3.5」，研發團隊為了讓大眾更容易記憶，才改成了如今的「ChatGPT」\nEBC東森財經新聞 ・ 1 天前 ・ 發表留言\n\n鴻海獎金\"好大一包\" 劉揚偉出席運動會:準備很多現金! 財經中心／楊思敏、李奇 台北報導春假連假前，鴻海包下台北大巨蛋，舉辦運動會，上萬名員工與眷屬同歡。搭上AI浪潮，鴻海去年又創佳績，營收首度突破8兆元，員工績效獎金入帳，驚呼好大一個紅包，平均比去年多了一成。董事長劉揚偉也預告，活動上準備了很多現金，要好好犒賞員工。\n民視財經網 ・ 1 天前 ・ 發表留言\n\n【瘦瘦針風潮2】猛健樂爆紅中小型健身房壓力山大？行銷專家：3因素成消費者考量 近來瘦瘦針、猛健樂等減重方式掀起熱潮，不少民眾期待「打一針就能瘦」，間接衝擊以教練課為主要營收來源的中小型健身房。對此，台灣行銷傳播專業認證協會理事長王福闓受訪時表示，從行銷與消費者行為角度觀察，猛健樂之所以能在短時間內爆紅，背後涉及「產品替代」、「時間成本」與「體驗互動」三大因素，也反映現代人對減重焦慮與價值排序的轉變。\nYahoo股市 ・ 20 小時前 ・ 發表留言\n\n投信週撒41億買年貨！重押欣興、華邦電　「HDI板龍頭」搭衛星題材猛飆100%同入列 [FTNN新聞網]記者周雅琦／綜合報導台股本週（02/09~02/11）終場加權指數上漲1,822.79點，漲幅5.74%，收在33,605.71點，再度改寫歷史新高。根據證交所盤後籌碼...\nFTNN新聞網 ・ 1 天前 ・ 2 則留言\n\n台美關稅拍板》美車0關稅、鬆綁美豬美牛 2,072項輸美產品免15％關稅 台灣與美國經歷長時間談判，終於在美東時間2月12日簽署「台美對等關稅協定」（ART）。行政院表示，本次談判總體完成六大目標，對等關稅降至15％不疊加，我輸美2,072項產品豁免對等關稅。\n中時財經即時 ・ 1 天前 ・ 10 則留言\n\n初一不能回娘家？ 婆婆喊「是習俗」 網不挺：越講越要回去 農曆年假即將到來，多數人都會安排時間回家拜訪父母。已婚女兒是否要遵守「大年初一不能回娘家」的禁忌，常引發熱議。有網友表示不用在意，但也有網友認為要尊重長輩想法。\nEBC東森財經新聞 ・ 1 天前 ・ 1 則留言\n\n白領訓練替代者！微軟AI主管預警：留給這些職業從業人員的準備時間只剩12-18個月 微軟 AI 業務負責人 Mustafa Suleyman 向全球勞動市場投下震撼彈，在接受《金融時報》專訪時發出迄今最激進的自動化預警稱，未來 12-18 個月內，律師、會計師、專案經理等白領職業的「大多數任務」將被 AI 全面接管。 Suleyman 預測的這一時程比商界普遍\n鉅亨網 ・ 21 小時前 ・ 發表留言\n\n「500元運動幣」今抽籤！1招秒查中籤結果 領取、使用方法一次看 運動幣抽籤時間就在今（12）天！為落實全民運動政策目標，運動部預計發放60萬份面額500元的「運動幣」。至於運動幣中籤結果該如何查詢、使用，《東森財經新聞》記者為大家整理好「運動幣懶人包」，讓大家一看就懂！\nEBC東森財經新聞 ・ 1 天前 ・ 3 則留言\n\n熱門新聞\n1\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 2\n\n13.5億威力彩「2得主」買法一模一樣！ 只花100元就翻身 3\n\n郭台銘大紅包發威！央行新台幣發行額首破4.2兆  年增率飆3年最高 4\n\n「新版新台幣」可能有石虎！票選結果曝光 台積電僅排第七 5\n\n【房地產週報】輝達簽約落腳北士科！29年最大交屋潮來襲！新竹預售屋慘崩82.3%！七大都會區交易量年減7成\n\n你可能會喜歡\n你上車了嗎？記憶體登蛇年狂飆主力　前10猛將全曝光 FTNN新聞網\n\n九大工業公會聯合肯定台美貿易協定 強調為產業注入強心針 民視財經網\n\n春節搭車風險升溫！行車保護傘保障出行　花1元即可享百萬保障 三立新聞網 setn.com\n\n「台灣價值」竟沒台灣之光！大盤飆新高00940卻回不到10元　股民哀號：成敗皆這1檔 鏡週刊Mirror Media\n\n緝捕馬杜洛震驚全球 美軍傳動用AI工具Anthropic Claude 鉅亨網\n\n信義房屋：年前家電、家具換新需求高 今日新聞NOWNEWS\n\n台股拉警報！專家警告美股7巨頭集體翻車：最慘開年行情 中時財經即時\n\n鄭麗君團隊立大功！謝金河曝「台美ART簽署」意義：台灣獲1席珍貴位子 三立新聞網 setn.com\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 工商時報\n\n外食族吃不消! 海南雞飯漲20元 手搖飲過年期間漲5元 民視財經網影音\n\n租屋族省很大！租金補貼減輕4成負擔 女性與25歲以下青年成主力 太報\n\n法人兩樣情！華邦電發說利多連發...目標價上看200元 　保守派「4理由」只喊88元 FTNN新聞網\n\n美股掀AI恐慌交易　台積電ADR挫0.47％ CTWANT\n\n陸客不去日本！外媒爆25萬大軍「改衝這國」 刷爆103億不手軟 中時財經即時\n\n金蛇年「大漲萬點」封關！0050領銜市值型ETF悍漲　近十年含息報酬率高達509% FTNN新聞網\n\n台灣賓士對「台美貿易協議」成功達成表達祝賀 並承諾回饋消費者 民視財經網\n\n聯電ADR13日上漲0.13美元漲幅1.26%折台股65.68元 中央社財經\n\n砸5億擴產最快Q2釋產能！PCB股華通衝連3漲　當沖爆量破5萬張登當沖王 FTNN新聞網\n\n輝達下跌、AMD上漲 背後關鍵或在Arista 鉅亨網\n\n美通膨降溫難掩「AI恐慌」! 美股漲跌互見、台積電ADR下跌0.51％ 新頭殼\n\n台美ART簽署》台經院張建一妙喻：台灣付的午餐費 比別人還低 工商時報\n\n大研生醫* 公告本公司股票面額由「新台幣10元」變更為「新台幣1元」，公告期間：114年12月22日至115年3月21日。 Moneydj理財網\n\n外資降評唱衰！大咖投顧逆風喊買面板指標大廠「這檔」　最新目標價曝光 FTNN新聞網\n\n春節放假也能追美股！內部數據曝光　過年反而更敢買 三立新聞網 setn.com\n\n記憶體嚴重短缺！美國軍工企業黑名單 移除中國長鑫、長江存儲 自由時報\n\n運載指標／港務公司貨櫃量上看1,390萬TEU 今日新聞NOWNEWS\n\n關稅干擾消失加AI助攻　經濟成長率上修至7.71％ 卡優新聞網\n\n蘇威元：台積電概念股飆漲密碼 這四指標抓飆股一次賺58% 民視財經網影音\n\n主動式ETF規模破1739億！這檔年化配息率10％　豪配0.377元「年後這天」最後上車日 FTNN新聞網\n\n到全台最夯紫南宮借發財金　主委莊秋安：心存善念有來有保庇 鏡報\n\n新北房市 新莊幸福路商圈 成家首選 工商時報\n\n台美ART 守住重要農產品防線 工商時報\n\n〈能源盤後〉油價因美通膨趨緩回升 周線仍收黑 鉅亨網\n\n13家金控1月獲利全公布！國泰金元月大賺146億元　EPS達0.99元登獲利王 FTNN新聞網\n\n美通膨降溫難掩AI隱憂　美股漲跌互見 太報\n\n〈貴金屬盤後〉黃金、白銀回神 CPI重燃降息預期 鉅亨網\n\n傳統軟體股崩跌回五年前！卡爾先生：掌握這兩點才能存活 民視財經網影音\n\n台股資料來源 臺灣證券交易所 、 臺灣期貨交易所 及 財團法人中華民國證券櫃檯買賣中心 ，國際股市資料來源請參考 Yahoo Finance 。台股行情、個股基本資料及財務資訊為精誠資訊提供。使用Yahoo股市服務前，請您詳閱相關 使用規範與聲明 。\n\n服務條款 隱私權 您的隱私權選擇 加州隱私權通知 © 2026 Yahoo. All rights reserved.\n\n1",
      "Language": "zh",
      "IsSummarized": false
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-02-12",
      "Time": "03:41:21",
      "Source": "Insider Monkey",
      "Title": "UBS Keeps a Neutral Rating on QUALCOMM Incorporated (QCOM)",
      "URL": "https://finance.yahoo.com/news/ubs-keeps-neutral-rating-qualcomm-194121633.html",
      "Content": "QUALCOMM Incorporated (NASDAQ: QCOM ) is among the 12 Best Autonomous Driving Stocks to Buy Right Now .",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-02-11",
      "Time": "22:55:00",
      "Source": "Zacks",
      "Title": "Gold.com and Qualcomm have been highlighted as Zacks Bull and Bear of the Day",
      "URL": "https://finance.yahoo.com/news/gold-com-qualcomm-highlighted-zacks-145500161.html",
      "Content": "For Immediate Release Chicago, IL &ndash; February 11, 2026 &ndash; Zacks Equity Research shares Gold.com GOLD as the Bull of the Day and Qualcomm QCOM as the Bear of the Day. In addition, Zacks Equity Research provides analysis on NVIDIA Corp. NVDA and Micron Technology, Inc.&rsquo;s MU .\nHere is a synopsis of all four stocks.\nBull of the Day: A recent pullback in Gold.com stock may be short-lived as gold prices have rebounded to new record highs of over $5,000 per ounce, as shown below, following a sharp pullback to around $4,400 per ounce earlier in the month.\nAmid an unprecedented commodity price boom for various precious metals, Gold.com&rsquo;s stock has been one of the market&rsquo;s top performers in 2026 so far, soaring nearly +90% through the first two months of the year and recently hitting a 52-week high of $66 a share.\nOffering a fully integrated alternative assets platform, sentiment continues to build for Gold.com&rsquo;s outlook after reporting impressive results for its fiscal second quarter last Thursday and attracting positive attention from analysts in the process.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-02-11",
      "Time": "22:50:00",
      "Source": "Motley Fool",
      "Title": "1 No-Brainer Artificial Intelligence (AI) Chip Stock to Buy Now With $150",
      "URL": "https://finance.yahoo.com/m/b1ead8f0-0702-36f3-8e97-e6944c55b5e7/1-no-brainer-artificial.html",
      "Content": "Investors looking to buy into AI stocks, particularly semiconductor stocks, should look beyond the biggest names like Nvidia or Broadcom . Additionally, the surge in memory chipmaker's values amid the push for more AI compute power has left those stocks looking fairly expensive.\nBut investors with just $150 can still buy a great AI chipmaker. Despite a disappointing outlook for the next year, Qualcomm (NASDAQ: QCOM) looks like a no-brainer buy for patient investors who can withstand a bit of financial pressure in the near term.\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-02-11",
      "Time": "20:50:12",
      "Source": "24/7 Wall St.",
      "Title": "Here Are Wednesday’s Top Wall Street Analyst Research Calls: BP Plc., Cloudflare, Dick’s Sporting Goods, Mattel, Noble Corp., Qualcomm, Tyler Technologies, XPO, and More",
      "URL": "https://finance.yahoo.com/m/e4b074db-f25e-351b-bc0a-dadb739145eb/here-are-wednesday%E2%80%99s-top-wall.html",
      "Content": "Quick Read The flash-crash rally hit a speed bump on Tuesday after the disappointing December retail sales report.\nToday’s January non-farm payrolls report and Friday’s consumer price index numbers could move the markets.\nWith earnings for the fourth quarter all but over, economic data could play a bigger role the rest of the month.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality. Read more here .\nPre-Market Stock Futures:\nFutures are trading higher after a stellar and surprising January jobs report as we get to the middle of the trading week. While the Dow Jones Industrial Average managed a winning day, closing up 0.20% at 50,188, the disappointment over the December retail sales report hung over the market like a sword of Damocles all day. With today's January non-farm payrolls report and the January consumer price index expected on Friday, economic data could drive markets. The S&P 500 closed Tuesday at 6,941, down 0.33%, while the Nasdaq closed at 23,021, lower by 0.59%. The Russell 2000 declined 0.24% to 2,682.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-11",
      "Time": "11:46:56",
      "Source": "Yahoo奇摩股市",
      "Title": "《美股》分析：看漲信號出現；「壞消息就是好消息」行情登場",
      "URL": "https://tw.stock.yahoo.com/news/%E7%BE%8E%E8%82%A1-%E5%88%86%E6%9E%90-%E7%9C%8B%E6%BC%B2%E4%BF%A1%E8%99%9F%E5%87%BA%E7%8F%BE-%E5%A3%9E%E6%B6%88%E6%81%AF%E5%B0%B1%E6%98%AF%E5%A5%BD%E6%B6%88%E6%81%AF-%E8%A1%8C%E6%83%85%E7%99%BB%E5%A0%B4-034656919.html",
      "Content": "【時報編譯柯婉琇綜合外電報導】美股分析：\n●Ameriprise Financial首席市場策略師Anthony Saglimbene在談到美國去年12月零售銷售數據意外疲弱時表示，目前中低收入族群消費緊絀的另一個因素，是他們對就業環境的感受，我們知道就業形勢變得較為不明。如果1月份的就業增長不如預期，這可能會給這種擴張的漲勢帶來一些壓力。Saglimbene並表示，資金似乎正在轉向其他較不受AI交易影響的族群，例如最近原材料股和公用事業股等類股走高。\n\n●標普500指數在上周跌破50日和100日移動均線後，目前已成功收復這兩條均線上方的支撐關卡，且許多資產類別的表現都優於該指數，就操盤手而言，這些都是看漲信號。\n●Janney Montgomery Scott首席投資策略師Mark Luschini以「壞消息就是好消息」來形容令人失望的零售數據，尤其是對於那些對利率敏感的類股，如公用事業股和房地產類股。周二(2月10日)公用事業類股漲1.59%、房地產類股漲1.39%，在標普500指數11大類股中表現最佳。不過，Luschini提醒，在備受關注的非農就業報告公布前，投資人應保持謹慎。受先前美國政府局部停擺影響，該就業報告延至本周三公布。\n\n檢視留言\n\n相關內容\n《美股掃瞄》AI嚇倒金融業 台積電ADR逆勢創高 【時報編譯柯婉琇綜合外電報導】周二(2月10日)道瓊指數微升且連續第3日改寫收盤歷史高點。標普500指數收黑，因零售銷售數據不如預期，以及Altruist推出新的AI稅務規劃工具，投資人越來越擔心AI對金融業構成的威脅。輝達、微軟、Alphabet等科技巨頭普遍下跌，但台積電1月營收月增19.8%、年增36.8%，並再創歷史新高，其ADR逆勢收漲近2%，至361.91美元，再創新高。目前美指期小漲。 最新發布的零售銷售數據顯示美國去年12月消費者支出陷入停滯，不如市場預期的月增0.4%和11月的月增0.6%。 白宮經濟顧問哈塞特（Kevin Hassett）周一的發言或許也給市場帶來些許壓力。他表示，由於AI提升生產力以及勞動力增長放緩，未來幾個月美國的就業增長可能下滑。 接下來，投資人將緊盯周三公布的非農就業報告和周五公布的消費者物價指數（CPI）。 周二收盤，道瓊指數漲52.27點或0.10%，收50,188.14點。標普500指數跌23.01點或0.33%，收6,941.81點。那斯達克指數跌136.20點或0.59%，收23,102.47點。費城半導體指數跌55.45點或0.6\n時報資訊 ・ 3 天前 ・ 發表留言\n\n《盤前掃瞄-國外消息》道瓊續創新高；AI類股偏弱 【時報-台北電】國外消息： 1.周二(2月10日)道指微升且連3日改寫收盤歷史高點。標普500收黑，因零售銷售數據不如預期，以及Altruist推出新的AI稅務規劃工具，投資人越來越擔心AI對金融業構成的威脅。輝達、微軟、Alphabet等科技巨頭普遍下跌，但台積電1月營收月增19.8%、年增36.8%，並再創歷史新高，其ADR逆勢收漲近2%，至361.91美元，再創新高。 2.外媒引述消息人士表示，美國川普政府不打算讓亞馬遜、谷歌和微軟等企業，遭受到即將實施的晶片關稅衝擊，因此計劃給予企業晶片關稅豁免，而這項豁免與台積電在美國的投資承諾息息相關。 3.美國商務部10日公布，2025年12月零售銷售與前月相比持平零成長，低於11月的月增0.6％與市場預期的0.4％增幅。原因是惡劣氣候與通膨居高不下影響，導致12月年終購物季消費活動明顯放緩。 4.Business Times網站報導，全球記憶體供應持續吃緊，價格飆升已在資本市場掀起劇烈震盪，並拉大產業間的表現差距。投資人普遍認為，這波供需失衡短期內難以緩解，對消費性電子與科技產業的衝擊，恐將延續至今年底。 5.美國政府於10日發布通知，\n時報資訊 ・ 3 天前 ・ 發表留言\n\n美國華爾街主要指數開盤上漲　道瓊漲57.6點 即時中心／綜合報導美國華爾街主要指數今（10）日開盤上漲。投資人也關注零售銷售數據，這也是這週一系列重要經濟數據發布的開端。截稿前，道瓊上漲57.6點，或0.11%，報50,193.49點；標準普爾500漲了9.7點，或 0.14%，報6,974.49點；而納史達克上揚32.6點，或 0.14%，報 23,271.224 點。\n民視財經網 ・ 2 天前 ・ 發表留言\n\n美零售銷售疲弱助推Fed降息預期，KOSPI週三收高1%，連三紅 【財訊快報／劉敏夫】韓國股市週三走升，連續第三個交易日上揚，因投資人等待稍晚美國發布的非農就業報告，此前公佈的零售銷售數據疲軟進一步鞏固了市場對聯準會將在今年稍晚時降息的預期。收盤時，Kospi指數上漲52.80點或1.00%，報5,354.49點；追蹤創業板市場行情的Kosdaq指數則是下跌0.33點或0.03%，報1,114.87點。Kospi指數19檔分項類股漲跌不一，其中13檔上揚，6檔下滑。通訊類股指數上揚2.85%，表現最好。運輸設備類股指數以及營建類股指數分別上漲2.13%與2.04%，表現也不錯。反觀，紙張木材類股指數下跌3.02%，表現敬陪末座。紡織成衣類股指數與醫療與精密設備類股指數分別下跌1.34%與1.85%，表現也不理想。週二發布的數據顯示，美國12月零售銷售意外停滯，凸顯去年年末消費乏力。貨幣市場對今年聯準會降息三次的押注略微升溫。市場目光現轉向稍晚時的美國非農報告和週五的通膨數據，以獲取更多有關政策前景的信號。eToro的Bret Kenwell表示，就業報告將是關鍵。一旦數據疲軟，成長擔憂開始加劇，可能進一步推動市場情緒轉向避險。不過，若是數據強勁，或可\n財訊快報 ・ 2 天前 ・ 發表留言\n\n美債爆「大反轉」警訊！原以為經濟過熱 專家戳破假象 美國公債價格持續上揚，今年表現可望創下5年來最佳，《MarketWatch》指出，美國於周二公布的 12 月零售銷售數據表現不如預期，對市場原本看好的經濟成長前景投下震撼彈，也進一步推升美國公債價格走高。\n中時財經即時 ・ 2 天前 ・ 發表留言\n\n《美股》收盤速報：AI威脅金融業 標普收黑 台積電ADR逆勢再創高 【時報-台北電】周二(2月10日)道指微升且連3日改寫收盤歷史高點。標普500收黑，因零售銷售數據不如預期，以及Altruist推出新的AI稅務規劃工具，投資人越來越擔心AI對金融業構成的威脅。輝達、微軟、Alphabet等科技巨頭普遍下跌，但台積電1月營收月增19.8%、年增36.8%，並再創歷史新高，其ADR逆勢收漲近2%，至361.91美元，再創新高。目前美指期小漲。 ★四大指數 美股道瓊上漲52.27點或0.10%，收50,188.14點。 S&P500下跌23.01點或0.33%，收6,941.81點。 NASDAQ下跌136.20點或0.59%，收23,102.47點。 費城半導體下跌55.45點或0.68%，收8,107.13點。 ★11大類股 公用事業類股(SPLRCU)漲1.59% 房地產類股(SPLRCREC)漲1.39% 原物料類股(SPLRCM)漲1.29% 非必需消費類股(SPLRCD)漲0.45% 工業類股(SPLRCI)漲0.12% 能源類股(SPNY)跌0.08% 科技類股(SPLRCT)跌0.58% 必需消費類股(SPLRCS)跌0.63% 醫療類股(\n時報資訊 ・ 3 天前 ・ 發表留言\n\n《國際金融》金融股帶衰 歐股翻黑收跌0.49% 【時報編譯張朝欽綜合外電報導】歐洲股市周四早盤再創新高，但是在工業股、公用事業股和金融股下跌之下，尾盤翻黑，收在下跌。 在前一天創收盤新高後，泛歐Stoxx 600指數周四收盤下跌3.06點或0.49%，為618.52點。主要地區股市由紅翻黑，其中英國股市跌0.67%，荷蘭股市跌2.07%。 工業和服務股指數也跌1.2%，其中荷蘭支付公司Adyen公布謹慎的財測後，大跌21.9%，為近兩年最大單日跌幅。丹麥的貨運服務商DSV也大跌10.5%，為近6年最大跌幅。 公用事業股下跌0.4%，此前由於擔心歐盟將干預碳市場，修改碳交易系統，投資人擔憂將壓縮水泥等公用事業的獲利。 Webull UK交易平台的執行長Nick Saunders說，這些成本會影響到利潤率。如果成本轉嫁給大型的能源消費公司，它還有可能加劇通膨壓力。 金融股指數大跌1.8%，其中匯豐控股跌2.9%，桑坦德銀行(Banco Santander)跌1.5%。 奢侈品股則逆勢上漲。愛馬仕(Hermes)說，在美國和日本市場強勁銷售之下，上季營收穩定成長，隨後升2.6%，股價創近兩個月新高。 在併購消息方面，美國資產管理公司Nuv\n時報資訊 ・ 1 天前 ・ 發表留言\n\n美國債市突亮起經濟警訊：經濟過熱的擔憂其實是誤判？ 據《MarketWatch》報導，周二 (10 日) 公布的美國 12 月零售銷售數據打擊了市場對經濟成長的預期，推動美國公債漲勢進一步擴大。\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n《國際產業》歐盟擬放鬆碳管制 碳價下滑 【時報編譯張朝欽綜合外電報導】由於擔心歐盟將干預碳市場，進行改革，市場擔心將擠壓獲利空間，讓歐洲的公用事業公司和水泥商股價大跌。 德國和義大利等歐洲領導人說，歐盟應考慮修改和鬆綁歐盟碳排放交易體系(ETS)。隨後歐洲的基準碳合約價格，跌至去年8月以來最低水準。 能源交易基金SpesX的投資長Luca Moro說，如果此一說法獲得接受，那些一直購買綠色憑證的人可能會意識到，憑證在未來可能會出現一些稀釋。Moro說，如果碳權(CO2 credits)價格下跌，電價就會下跌，電力公司的收入就會減少。 週四歐洲的公用事業股指數一度跌2.3%，抵消了今年以來的強勁漲幅。 德國的萊茵集團(RWE)、義大利A2A和義大利電力(Enel)、芬蘭國有能源公司富騰(Fortum)、奧地利電力公司Verbund、丹麥的沃旭能源(Orsted)都大跌在3%至7%之間。 近幾個月以來，受到AI基礎設施發展，帶來對電力的強烈需求，歐洲公用事業公司和再生能源公司的股票急遽上揚。但目前碳排放規則的潛在變化，讓這些公司的前景變得更加複雜。 Moro說，放鬆碳排管制，會壓低電價，另一方面，資料中心的持續建設會推高電價，問\n時報資訊 ・ 22 小時前 ・ 發表留言\n\n美國公債價格週二上揚，10年期殖利率滑落5.94個基點至4.1427% 【財訊快報／劉敏夫】美國公債價格週二上揚，引領殖利率下跌，因美國零售銷售數據表現欠佳，且市場也在消化一系列大宗交易。根據債券交易報價，2年期公債價格上揚，殖利率下跌3.31個基點，報3.4520%；5年期公債價格上漲，殖利率下滑4.34個基點，報3.7012%。10年期公債價格揚升，殖利率滑落5.94個基點，報4.1427%；30年期公債價格則是上升，殖利率下降7.42個基點，報4.7840%。美國公債週二買盤旺盛，在美國12月零售銷售數據不及預期後走高。隨後，儘管自盤中5年期和10年期美債期貨出現一波大宗賣盤，美債仍基本守住漲幅。與聯準會會期掛鉤的隔夜指數互換(OIS)轉向偏鴿，市場目前預計到12月降息約58個基點，高於週一收盤時的56個基點。此外，3年期美債標售結果穩健後，短天期債券價格守住漲幅，此次標售得標殖利率低於發行前交易水準，且投標指標表現穩健。一級交易商獲配比例降至10.9%，低於此前水準。間接投標人獲配比例升至57.1%，直接投標人獲配比例至31.9%，超過此前12月創下的紀錄高點29.5%。\n財訊快報 ・ 3 天前 ・ 發表留言\n\n《美股》消息面：盧特尼克稱美不會阻礙晶片業；比特幣跌破6.9萬美元 【時報編譯柯婉琇綜合外電報導】消息面： ●ADP公布，在截至1月24日的4周內，美國民間就業每周平均增加6500人，高於前值（5000人），為連續第三周成長，並創下1月3日以來新高。 ●美國2025年12月零售銷售額與11月相比持平，不及市場預期的月增0.4%。排除汽車的零售銷售額亦與11月持平，落後市場預期的月增0.3%。 ●美國石油協會（API）公布，上周（截至2月6日）美國原油庫存大增1340萬桶；前一周為庫存減少1110萬桶。此外，汽油庫存增加330萬桶，包括柴油和取暖油在內的餾分油庫存減少200萬桶。 ●周二在參議院撥款委員會小組出席聽政會時，美國商務部長盧特尼克（Howard Lutnick）表示，美國去年第四季國內生產毛額（GDP）成長率預估將突破5%，而今年第一季可能突破6%。他表示，美元回落至「較自然」的價位，有利於促進美國出口和加速經濟增長，今年製造業就業將出現巨大的增長，有助於美國經濟實現如此強勁的增長。盧特尼克並表示，美國對AI晶片的需求龐大，華盛頓不會想採取任何可能阻礙晶片業發展的措施。 ●克利夫蘭聯準銀行總裁哈馬克（Beth Hammack）表示，聯準會利率\n時報資訊 ・ 2 天前 ・ 1 則留言\n\n《國際經濟》美1月非農就業增長估回升 原因卻很悲傷 【時報編譯柯婉琇綜合外電報導】因為一些季節性行業減少裁員，美國1月就業增長可能回升，但由於進口關稅形勢仍不明朗，使人員招聘受到抑制，以及加強移民執法限縮了勞動力供應，實際上，美國的勞動力市場恐仍疲軟。 美國勞工部將於當地時間周三發布備受關注的非農就業報告。市場預期該報告將顯示1月失業率維持在4.4%不變，以及薪資年增長放緩。經濟學家表示，川普政府的貿易和移民政策抑制了就業市場，但減稅應可提振今年的招聘力道。 通常每年1月是季節性裁員最嚴重的月份，但由於去年底零售、物流等季節性招聘減少，因此今年1月的裁員情況可能隨之減少，或許會推升就業增長。 KPMG首席經濟學家Diane Swonk表示，就業市場潛在的壓力比整體失業率所呈現的要大。薪資增長正在減速、失業後更難找到工作、應屆畢業生要找到工作也更加困難。儘管報告上的經濟數據看起來很火熱，但勞動力市場依舊寒氣逼人。 根據路透社所做的調查，受訪經濟學家預估2025年1月非農就業可能增加7萬人，超出12月份的新增5萬人。預測值在介於減少1萬人到增加13.5萬人之間。一些私人調查顯示1月可能出現就業減少的情況。 這份就業報告原定於上周五發布，但受\n時報資訊 ・ 2 天前 ・ 發表留言\n\n《國際產業》Anthropic將承擔更多成本 防止電價轉移消費者 【時報編譯張朝欽綜合外電報導】美國人工智慧公司Anthropic在周三宣布新的措施，以便降低資料中心用電加劇，對消費者電費帳單可能的影響。目前該公司正加大對電力基礎設施的投資。 Anthropic說，公司將提高每月電費負擔，並且涵蓋因資料中心用電增加而導致電網升級所需的成本，以防止電費被轉嫁到消費者。 儘管科技巨頭和美國政界都在敦促資料中心容量增加，以及增加電力生產，以保持美國AI的競爭力，但是美國民眾更加擔心，這些耗電龐大的設施，可能會影響他們的水電費，以及在該地區的土地、水和其它自然資源的使用。 Anthropic同時也表示，公司將帶來新的電力生產和電網容量，以滿足資料中心的用電需求，而不是購買(綠電)信用額度。 該公司補充說，在新發電量仍無法上線的情況下，該公司將與公用事業部門和外部專家合作，估計並抵消資料中心的電價上漲影響。 這些措施與微軟在上個月採取的措施相類似。微軟當時表示，將支付較高的公用事業電費費率，以便得以涵蓋電力成本，公司並將與當地公用事業公司合作，在資料中心需要時能擴大電力供應。 Anthropic在周三還表示，公司正在投資研究，如何減少資料中心用電量，並開發電網\n時報資訊 ・ 1 天前 ・ 發表留言\n\n亞馬遜陷2006年以來最長跌勢 資本支出疑慮籠罩 據《彭博》報導，亞馬遜 (Amazon)(AMZN-US) 股價出現近 20 年來最長的連續下跌走勢，投資人持續質疑這家電商與雲端運算公司龐大的資本支出。\n鉅亨網 ・ 3 小時前 ・ 發表留言\n\n《國際產業》軟體股走向AI末路？分析師點名2檔前景俏 【時報編譯柯婉琇綜合外電報導】在AI崛起可能構成生存威脅的陰霾籠罩下，近來軟體服務類股陷入劇烈震盪。惟分析師點名兩大軟體股未來走勢看俏。 美國獨立投銀和金融服務公司Raymond James Financial Inc周二將遊戲軟體開發與經銷商Take-Two Interactive Software的股票評級從「優於大盤」（outperform）調升為「強勢買進」（strong buy），稱最近這一波AI引爆的拋售帶來買進機會。Raymond James亦將Take-Two目標價維持在285美元不變，意味著與周一收盤價相比還有39%的上漲空間。 周二（2月10日）Take-Two Interactive Software股價上2.77%，收在210.71美元。 Raymond James分析師Andrew Marok出具報告指出，自1月29日周四收盤以來，Take-Two股價下跌了15%，這主要受到雙重疑慮影響，即谷歌推出Project Genie，以及AI工具對現有發行商可能造成衝擊。之後，可能被AI取代的擔憂引爆整個軟體股的賣壓，使Take-Two加速下跌。但我們認為這已經過頭了\n時報資訊 ・ 2 天前 ・ 發表留言\n\n美製進口車「零關稅」倒數？經濟部產發署提1計畫：背水一戰 即時中心／黃于庭報導台美關稅談判日前正式拍板，稅率調降為15%且不疊加，我國也將以「台灣模式」與美方合作，2,500億美元由台灣企業直接自主投資，另由政府銀行融資信保支持2,500億美元。外界關注美製車關稅細節，更有傳聞指出可朝向「零關稅」邁進。對此，經濟部產發署長邱求慧坦言，這確實成為台美協議中的一項隱憂，對於台灣汽車產業來說是背水一戰。\n民視財經網 ・ 1 天前 ・ 發表留言\n\n從懷舊卡通推手到音樂創作 張童童用音樂紀錄唱出人生下半場 深耕影音內容產業、曾參與推動多部懷舊卡通重新發行，陪伴一整個世代長大的張童童，如今從媒體幕後走到創作，成為音樂創作歌手。張童童曾發行「小英的故事」、「湯姆歷險記」等多部懷舊卡通系列，她把人生的經歷選擇用音樂，為自己的人生下半場留下聲音紀錄。\n中時財經即時 ・ 21 小時前 ・ 發表留言\n\n台美關稅談判告捷！32％降至15％不疊加　專家：半導體、汽車上游受惠 即時中心／林韋慈、許雯絜報導台美關稅談判歷經長時間協商，最終結果被外界解讀為「實質性突破」。原本最高可能面臨32％關稅，如今成功降至20％甚至15％，且採取不疊加計算，顯示談判團隊付出極大心力。台新新光金控首席經濟學家李鎮宇指出，整體條件比起日本、南韓都好，並且在亞洲競爭國中具相當優勢。\n民視財經網 ・ 23 小時前 ・ 3 則留言\n\n不止黃金！高盛：銅鋁逆勢飆漲 全因各國掀「保險式」囤貨潮 高盛分析師周二 (10 日) 出具研究報告指出，各國政府近年為對沖地緣政治與金融風險，通過央行購金推動國際金價持續飆升。這一趨勢正驅動類似的「保險型」策略向銅、鋁等工業金屬市場擴散，形成全球大宗商品供應格局的深遠變革。 報告強調，美國等國利用關稅壁壘、出口管制及戰略儲備等措施強\n鉅亨網 ・ 1 天前 ・ 發表留言\n\n貼春聯也有吉時！ 貼對一整年「順又旺」 在宋代人們便開始在桃木板上寫對聯，一則不失桃木鎮邪的意義，二則表達自己美好心願，三則裝飾門戶，以求美觀。又在象徵喜氣吉祥的紅紙上寫對聯，新春之際貼在門窗兩邊，春聯的語句以吉祥意義的字詞為主，寄寓了人們希冀美好生活的情感，影射出對新一年生活的期盼。\nEBC東森財經新聞 ・ 1 天前 ・ 發表留言\n\n熱門新聞\n1\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 2\n\n13.5億威力彩「2得主」買法一模一樣！ 只花100元就翻身 3\n\n郭台銘大紅包發威！央行新台幣發行額首破4.2兆  年增率飆3年最高 4\n\n「新版新台幣」可能有石虎！票選結果曝光 台積電僅排第七 5\n\n【房地產週報】輝達簽約落腳北士科！29年最大交屋潮來襲！新竹預售屋慘崩82.3%！七大都會區交易量年減7成\n\n你可能會喜歡\n你上車了嗎？記憶體登蛇年狂飆主力　前10猛將全曝光 FTNN新聞網\n\n九大工業公會聯合肯定台美貿易協定 強調為產業注入強心針 民視財經網\n\n春節搭車風險升溫！行車保護傘保障出行　花1元即可享百萬保障 三立新聞網 setn.com\n\n「台灣價值」竟沒台灣之光！大盤飆新高00940卻回不到10元　股民哀號：成敗皆這1檔 鏡週刊Mirror Media\n\n緝捕馬杜洛震驚全球 美軍傳動用AI工具Anthropic Claude 鉅亨網\n\n信義房屋：年前家電、家具換新需求高 今日新聞NOWNEWS\n\n台股拉警報！專家警告美股7巨頭集體翻車：最慘開年行情 中時財經即時\n\n鄭麗君團隊立大功！謝金河曝「台美ART簽署」意義：台灣獲1席珍貴位子 三立新聞網 setn.com\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 工商時報\n\n租屋族省很大！租金補貼減輕4成負擔 女性與25歲以下青年成主力 太報\n\n法人兩樣情！華邦電發說利多連發...目標價上看200元 　保守派「4理由」只喊88元 FTNN新聞網\n\n美股掀AI恐慌交易　台積電ADR挫0.47％ CTWANT\n\n外食族吃不消! 海南雞飯漲20元 手搖飲過年期間漲5元 民視財經網影音\n\n陸客不去日本！外媒爆25萬大軍「改衝這國」 刷爆103億不手軟 中時財經即時\n\n金蛇年「大漲萬點」封關！0050領銜市值型ETF悍漲　近十年含息報酬率高達509% FTNN新聞網\n\n台灣賓士對「台美貿易協議」成功達成表達祝賀 並承諾回饋消費者 民視財經網\n\n聯電ADR13日上漲0.13美元漲幅1.26%折台股65.68元 中央社財經\n\n砸5億擴產最快Q2釋產能！PCB股華通衝連3漲　當沖爆量破5萬張登當沖王 FTNN新聞網\n\n輝達下跌、AMD上漲 背後關鍵或在Arista 鉅亨網\n\n美通膨降溫難掩「AI恐慌」! 美股漲跌互見、台積電ADR下跌0.51％ 新頭殼\n\n台美ART簽署》台經院張建一妙喻：台灣付的午餐費 比別人還低 工商時報\n\n大研生醫* 公告本公司股票面額由「新台幣10元」變更為「新台幣1元」，公告期間：114年12月22日至115年3月21日。 Moneydj理財網\n\n外資降評唱衰！大咖投顧逆風喊買面板指標大廠「這檔」　最新目標價曝光 FTNN新聞網\n\n春節放假也能追美股！內部數據曝光　過年反而更敢買 三立新聞網 setn.com\n\n記憶體嚴重短缺！美國軍工企業黑名單 移除中國長鑫、長江存儲 自由時報\n\n運載指標／港務公司貨櫃量上看1,390萬TEU 今日新聞NOWNEWS\n\n關稅干擾消失加AI助攻　經濟成長率上修至7.71％ 卡優新聞網\n\n蘇威元：台積電概念股飆漲密碼 這四指標抓飆股一次賺58% 民視財經網影音\n\n主動式ETF規模破1739億！這檔年化配息率10％　豪配0.377元「年後這天」最後上車日 FTNN新聞網\n\n到全台最夯紫南宮借發財金　主委莊秋安：心存善念有來有保庇 鏡報\n\n新北房市 新莊幸福路商圈 成家首選 工商時報\n\n台美ART 守住重要農產品防線 工商時報\n\n〈能源盤後〉油價因美通膨趨緩回升 周線仍收黑 鉅亨網\n\n13家金控1月獲利全公布！國泰金元月大賺146億元　EPS達0.99元登獲利王 FTNN新聞網\n\n美通膨降溫難掩AI隱憂　美股漲跌互見 太報\n\n〈貴金屬盤後〉黃金、白銀回神 CPI重燃降息預期 鉅亨網\n\n傳統軟體股崩跌回五年前！卡爾先生：掌握這兩點才能存活 民視財經網影音\n\n台股資料來源 臺灣證券交易所 、 臺灣期貨交易所 及 財團法人中華民國證券櫃檯買賣中心 ，國際股市資料來源請參考 Yahoo Finance 。台股行情、個股基本資料及財務資訊為精誠資訊提供。使用Yahoo股市服務前，請您詳閱相關 使用規範與聲明 。\n\n服務條款 隱私權 您的隱私權選擇 加州隱私權通知 © 2026 Yahoo. All rights reserved.\n\n1",
      "Language": "zh",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-11",
      "Time": "11:21:33",
      "Source": "Yahoo奇摩股市",
      "Title": "《美股》消息面：盧特尼克稱美不會阻礙晶片業；比特幣跌破6.9萬美元",
      "URL": "https://tw.stock.yahoo.com/news/%E7%BE%8E%E8%82%A1-%E6%B6%88%E6%81%AF%E9%9D%A2-%E7%9B%A7%E7%89%B9%E5%B0%BC%E5%85%8B%E7%A8%B1%E7%BE%8E%E4%B8%8D%E6%9C%83%E9%98%BB%E7%A4%99%E6%99%B6%E7%89%87%E6%A5%AD-%E6%AF%94%E7%89%B9%E5%B9%A3%E8%B7%8C%E7%A0%B46-9%E8%90%AC%E7%BE%8E%E5%85%83-032133846.html",
      "Content": "【時報編譯柯婉琇綜合外電報導】消息面：\n●ADP公布，在截至1月24日的4周內，美國民間就業每周平均增加6500人，高於前值（5000人），為連續第三周成長，並創下1月3日以來新高。\n●美國2025年12月零售銷售額與11月相比持平，不及市場預期的月增0.4%。排除汽車的零售銷售額亦與11月持平，落後市場預期的月增0.3%。\n●美國石油協會（API）公布，上周（截至2月6日）美國原油庫存大增1340萬桶；前一周為庫存減少1110萬桶。此外，汽油庫存增加330萬桶，包括柴油和取暖油在內的餾分油庫存減少200萬桶。\n\n●周二在參議院撥款委員會小組出席聽政會時，美國商務部長盧特尼克（Howard Lutnick）表示，美國去年第四季國內生產毛額（GDP）成長率預估將突破5%，而今年第一季可能突破6%。他表示，美元回落至「較自然」的價位，有利於促進美國出口和加速經濟增長，今年製造業就業將出現巨大的增長，有助於美國經濟實現如此強勁的增長。盧特尼克並表示，美國對AI晶片的需求龐大，華盛頓不會想採取任何可能阻礙晶片業發展的措施。\n\n●克利夫蘭聯準銀行總裁哈馬克（Beth Hammack）表示，聯準會利率路徑上行或下行的風險大致達成平衡，聯邦公開市場委員會（FOMC）可能會在相當長的一段時期內維持利率不變。\n●美國總統川普表示，如果美國與伊朗的談判未能取得成果，他考慮再派遣一支美國航母打擊群前向中東，為可能的軍事行動做準備。此番發言使道瓊指數盤中漲幅急吐。\n●比特幣再度跌破7萬美元大關，加密貨幣難以擺脫「信心危機」，Compass Point分析師Ed Engel警告比特幣仍有可能下探6萬美元，且不排除進一步跌至5.5萬～6萬美元區間的可能性。目前比特幣價格跌2.95%，報68,627.20美元，跌破6.9萬美元大關。\n●投資人縮手觀望延遲於本周發布的美國非農就業報告與CPI通膨數據，周二美元在狹幅區間波動，現貨金下跌。周一紐約尾盤，美元指數大致持平，報96.82。黃金現貨價格下跌1%，報每盎司5013美元。4月期金漲1%，報每盎司5031美元。\n●周二布蘭特期油收跌0.24美元或0.3%，報每桶68.80美元。美國WTI期油跌0.40美元或0.6%，收在每桶63.96美元。市場觀望美伊和烏俄局勢發展，以及即將發布的美國重要經濟數據和原油庫存報告。\n\n檢視留言\n\n相關內容\n美家庭負債創新高 信用卡債飆破1.28兆美元 MoneyDJ新聞 2026-02-11 12:42:35 李彥瑾 發佈近年美國經濟明顯呈現「K型發展」，在股市屢創高帶動下，高薪階層資產快速累積，低薪族群則受高物價與生活成本攀升衝擊，荷包難以負荷。根據紐約聯準銀行最新公布，截至2025年第四季，美國家庭負債總額已達18.8兆美元，再創歷史新高。 CNBC等外媒報導，紐約聯準銀行10日發表最新報告，截至2025年第四季，美國家庭債務總額成長至18.8兆美元，較前季增加1,910億美元，其中房貸借款占13.17兆美元，顯示房貸仍是美國家庭負債的最大來源。 值得注意的是，美國家庭背負的信用卡債務上升至 1.28兆美元，較2024年同期大增5.5%，反映高物價與關稅壓力擠壓民眾預算，部分家庭為支應日常開銷及節慶消費，藉由刷卡來維持支出，債務自然增加。 此外，第四季整體家庭借款的逾期比率升至4.8%，創2017年以來新高，原因包括關稅政策對就業市場造成外溢衝擊，影響低收入家庭的還款能力，推升家庭部門借款的信用風險。 （圖片來源：iStock） ＊編者按：本文僅供參考之用，並不構成要約、招攬或邀請、誘使、任何不論種類或形式之申述或訂立任何建議及\nMoneydj理財網 ・ 2 天前 ・ 1 則留言\n\n美元下跌壓力加劇 經濟學人：最大問題始於美國自己 自 2025 年初以來，美元匯率已大幅貶值約 10%，這場動盪不僅反映了經濟數據的波動，更揭示了美國國際信譽的深層裂痕。《經濟學人》分析報導稱，長期以來，美元被視為全球避險天堂，然而當前的威脅卻如同恐怖電影般「源自房子內部」。 隨著川普政府推行強硬的關稅政策並翻轉數十年的貿易自\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n巴西收成以及價格壓力 美國上週黃豆出口減少 MoneyDJ新聞 2026-02-10 11:10:32 黃文章 發佈美國農業部2月9日公佈的每週出口檢定報告顯示，截至2月5日當週，美國小麥一週出口檢定量為580,130公噸，佔穀物出口總量的18%；較前週增加76%，較上年同期增加2%，主要出口市場為菲律賓（179,957公噸）、孟加拉（119,479公噸）、墨西哥（63,146公噸）。去年6月起的2025/26年度小麥累計出口量年增18%至17,326,585公噸。美國農業部1月報告維持2025/26年度小麥出口量小麥出口量預估為2,450萬噸，較上年度增加200萬噸。 截至2月5日當週，美國玉米一週出口檢定量為1,307,781公噸，佔穀物出口總量的42%；較前週增加14%，較上年同期減少4%，主要出口市場為墨西哥（476,628公噸）、日本（187,063公噸）、哥倫比亞（135,816公噸）。去年9月起的2025/26年度，美國玉米出口檢定量年增47%至33,931,058公噸。美國農業部1月報告維持2025/26年度玉米出口量預估為創紀錄的8,130萬噸。 美國黃豆截至2月5日為止的一週出口檢定量為1,136,099公噸\nMoneydj理財網 ・ 3 天前 ・ 發表留言\n\n全球股市與道瓊指數創新高 市場靜待非農就業報告 全球主要股市漲跌互現，全球股市指數創歷史新高，美國道瓊指數則連續第三個交易日寫下收盤高點紀錄，但那斯達克與標普500指數則走低。此外，美國最新公布的零售額暗示經濟可能正在放緩，投資人密切關注11日出爐的1月美國非農就業報告。。\n中時財經即時 ・ 2 天前 ・ 發表留言\n\n《國際產業》鄭麗君：40%半導體產能遷往美國 是「不可能的」 【時報編譯張朝欽綜合外電報導】台灣首席關稅談判代表、行政院副院長鄭麗君在週日晚間接受華視專訪時表示，將台灣半導體40%產能遷移到美國是「不可能的」。 鄭麗君說，她已經告訴美方，台灣數十年建立起的半導體生態系，不可能搬到美國。「我已經向美國明確表示，這是不可能的」。此處不可能指的是40%產能搬遷。 鄭麗君表示，台灣的生態系將繼續成長，她補充稱，半導體業將繼續在台灣本土投資。 鄭同時指出，「但我們可以擴展我們在美國的業務」。「我們的國際擴張，包括在美國增加投資，是基於這樣一種前提，即我們仍然牢牢地紮根於台灣，並繼續擴大國內投資」。 美國商務部長盧特尼克(Howard Lutnick)在上周二說，美政府需要將半導體帶回美國。他說：「你不可以把所有半導體製造業務都放在距離中國80英哩的地方(台灣)」，「這完全不合邏輯，所以我們需要把它帶回來」。 「就本屆政府而言，我的目標是要有40%的尖端半導體製造的市場占比」。 盧特尼克在上個月接受CNBC訪問時曾威脅說，他的目標是將台灣40%的晶片供應鏈和生產遷往美國。如果這不能實現，對台灣的關稅很可能提高至100%。 盧特尼克甚至在去年9月時表示，美方對\n時報資訊 ・ 4 天前 ・ 3 則留言\n\n《美股》消息面：川普關稅大棒重擊美民眾；油金齊跌 【時報編譯柳繼剛綜合外電報導】消息面： ●紐約聯邦準備銀行報告指出，川普實施的新關稅政策，承擔進口關稅的對象，竟然90%是美國的老百姓。該份報告表示，去年1到8月之間，約94%的關稅成本已轉嫁給美國企業和消費者，9到10月降至92%，11月則在86%。無獨有偶，美國國會預算辦公室(CBO)前一日發布的報告也指出，外國出口商將承擔5%多出的成本，美企自行吸收30%的進口差價，剩下的部分將藉由漲價的方式轉嫁給民眾。 ●美國2月首次申請失業救濟人數，較前一周減少5,000人，降至22.7萬，高於市場預期的22.2萬，接近先前修正後的八周高點。同時，1月持續申請失業救濟人數增加2.1萬，來到186.2萬，持續申請失業救濟人數增加，因冬季風暴衝擊美國多處地方，導致商業活動中斷，造成更多家庭經濟面臨困境。 ●現貨金價一度大跌4.06%，每盎司曾跌至4878.24美元，收盤時為4921.85美元，但還是下挫3.2%。同時，現貨銀價一度最多重挫11.71%，低點跌至74.4355美元，收盤每盎司為75.2835，大跌10.71%。 ●紐約期油下跌2.77%，每桶收在62.84美元。同時，布蘭特期油也跌\n時報資訊 ・ 22 小時前 ・ 1 則留言\n\n《國際經濟》投資與採購換關稅！ 台美貿易協定塵埃落定 【時報編譯張朝欽綜合外電報導】川普政府官員在周四與台灣簽署了一項最終的互惠貿易協定，其中確認了美國對台灣進口商品徵收15%的關稅，同時要求台灣承諾將按時程計畫取消或降低幾乎所有美國商品的關稅。 美國貿易代表辦公室在周四發表一份文件，其中還指出，台灣將2025年至2029年期間大幅增加對美國商品的購買，其中包括444億美元的液化天然氣(LNG)和原油、152億美元的民航飛機和引擎、252億美元的電網設備、發電機、海洋和鋼鐵製造設備。換言之，台灣在4年內要購買近850億美元的美國能源、飛機和機械設備。 最新的協定將台灣商品的關稅(包括台灣的半導體產業)，從川普最初徵收的20%降至15%。這使得台灣與亞洲出口競爭對手韓國和日本處於同等地位。 賴清德總統在臉書說，台灣另外也獲得2000多種出口到美國的產品免徵關稅，這意味著關稅平均稅率將降至12.33%。 而該協定仍須獲得立法院的通過。 台灣承諾的投資方面，企業將投資2500億美元，其中台積電已經承諾了1000億美元投資。美國商務部長盧特尼克(Howard Lutnick)說，台灣政府另外將擔保2500億美元的投資。 最終的文本沒有詳列投資細節\n時報資訊 ・ 22 小時前 ・ 發表留言\n\n《美股》消息面：華許若就任 川普喊GDP飆15%；美發警示 油價彈升 【時報編譯柯婉琇綜合外電報導】消息面： ●美國交通部海事局周一向航經荷姆茲海峽的商船發布新指引，建議「懸掛美國國旗的商船在不影響航行安全下，應盡可能遠離伊朗領海，以降低遭攔查或扣押風險」，「如果伊朗軍隊登船，船員不應以武力抵抗」。海事局表示，伊朗部隊最近一次對通過荷莫茲海峽與阿曼灣的船隻登船檢查，是發生在2月3日。儘管伊朗最高外交官員上周五表示，由阿曼居中斡旋的美伊核談判取得樂觀進展，但美國總統川普卻在同一日加大對伊朗的施壓。川普簽署了行政命令，落實他日前釋出的威脅，也就是對於任何「直接或間接」採購伊朗商品的國家加徵25%進口關稅。 ●Fox Business報導，美國總統川普表示，如果他提名的人選華許（Kevin Warsh）獲准就任聯準會主席，並有效發揮能力、履行其職責，那麼美國經濟成長率可望達到15%，甚至可能更高。川普並表示，華許是他第一個任期時的聯準會主席第二人選，而最終他選擇了鮑爾「真是一大錯誤」。美國2026年GDP成長率預估為2.4%，過去50年的平均年度成長率約為2.8%。自1950年代以來，美國經濟成長長率超過15%的情況，寥寥無幾。 ●周一紐約尾盤美元指數跌0.8\n時報資訊 ・ 3 天前 ・ 發表留言\n\n上季美國勞動力成本成長 意外放緩 美國勞動力需求疲軟抑制薪資成長，最新數據顯示，去年第四季美國勞動力成本成長意外放緩，年增幅僅3.4％，創下4年半來最低紀錄。\n中時財經即時 ・ 3 天前 ・ 發表留言\n\n《國際產業》40%晶片供應鏈遷美？鄭麗君說「不可能」 專家贊同 【時報編譯柯婉琇綜合外電報導】行政院副院長、台灣首席關稅貿易談判代表鄭麗君周日接受媒體訪問時斬釘截鐵地再度強調，台灣已經告知華盛頓，將台灣40%半導體供應鏈轉移到美國「是不可能的事」。分析師和專家普遍贊同鄭麗君的說法。 鄭麗君表示，她已明確向華盛頓表示，台灣幾十年來建立起的半導體生態圈，不是說遷就能遷。包括在美國的投資，台灣的國際擴張都基於一個前提：半導體產業仍將「根留台灣」，並將繼續擴大在國內投資。 在今年1月初台灣與美國達成貿易協議後，美國商務部長盧特尼克（Howard Lutnick）接受CNBC訪問時公開提到，他希望在川普總統任內，台灣40%的晶片供應鏈轉移到美國。當時他說道：「我們將在美國建造巨型的半導體產業園區……這是讓我們把半導體帶回美國之5000億美元的頭期款」，他並表示，不在美國建廠的台灣晶片公司，可能面臨川普曾揚言要課徵的100%半導體關稅。 半導體產業分析師普遍認同鄭麗君的說法，即華府這項最野心勃勃的半導體回流計畫根本不可行，因為要轉移如此先進的供應鏈存在許多困難。 分析師和業內人士表示，美國這項計劃的主要障礙包括台灣半導體生態圈高度整合、美國的勞動力短缺，以及成\n時報資訊 ・ 3 天前 ・ 發表留言\n\n川普力推「美國製造」卻反噬本土工廠？ 陸企強勢壓境爆爭議 美國總統川普上任以來，多次呼籲外國企業赴美設廠投資，希望補回在全球化過程中流失的製造業工作機會，並讓「美國製造」重返榮耀。然而，《華爾街日報》一篇聚焦俄亥俄州的報導，卻讓這項政策目標浮現尷尬現實：當外資，特別是中資企業，在美國本土以更低成本站穩腳步，甚至擊敗美國老牌工廠時，製造業復興是否反而變成另一場內部衝擊。\n中時財經即時 ・ 3 天前 ・ 發表留言\n\n台美協定禮成 仍應引以為鑑 台美正式簽署「對等貿易協定」（ART），確立台灣對等關稅降至15％不疊加，與日韓等競爭對手站在同一立足點。但早一步與美國談妥的韓國，目前卻因關稅協議卡在國會，面臨川普總統放話關稅調高至25％的威脅；此外日本對美投資延宕，也遭川普質疑是否刻意拖延。台美協議日後是否仍有變數，日韓也許可作為借鏡。\n工商時報 ・ 5 小時前 ・ 發表留言\n\n《金融》美國就業數據前 美元表現疲弱 【時報-台北電】外匯評論： 1.USD/JPY 美國白宮經濟顧問哈西特稱，因勞動力市場增長放緩和生產率提高，未來幾個月美國就業增長可能放緩，引發美國聯邦準備理事會(FED)內部討論，可能影響未來的政策決定，促使美元在美國關鍵非農業就業數據週三公布前承壓；此外，日本首相高市早苗領導的執政聯盟勝選，其可能推進刺激經濟措施令市場不安。 但政治分析人士認為，呼籲更大膽減稅的在野黨在本次選舉中慘敗，讓獲得強勢授權的高市早苗提供調整刺激計畫的空間，並強調減稅將是臨時性措施，更重申堅持負責任的財政管理，應能讓市場確信財政前景不會出現實質性惡化，提振日本經濟和股市，料日本央行(BOJ)採取更強硬的政策立場，而且日本財務大臣片山皋月週二稱，在探討為計畫中削減食品消費稅籌集資金時，可考慮使用1.4兆美元外匯儲備所錄得盈餘，激勵日圓上漲，導致美元兌日圓於156.29高點賣壓沉重。 隨著美國數據顯示，12月進口與出口物價分別較前月升0.1%及0.3%略優於預期，但11月企業庫存較前月增加0.1%不及預估值，並據美國商務部公布12月零售銷售意外持平，可能暗示消費者支出和整體經濟邁入新年之際走上更緩慢的增長軌道，\n時報資訊 ・ 3 天前 ・ 發表留言\n\n《商情》USDA：美棉出口調降 庫存上調 【時報-台北電】據美國農業部USDA發布2月世界農業供需預測WASDE報告顯示，2025/26年度棉花平衡表的變動幅度較小，美國棉花種植單產、產量、期初庫存和國內消費均無變化，因美棉出口簽約落後，美棉出口預測下調了20萬包，期末庫存隨之同步上調，美國庫存消費比為32%，美國陸地棉農場均價為60美分/磅，環比下調1美分。(編輯：鄧凱綺)(商品行情網)\n時報資訊 ・ 2 天前 ・ 發表留言\n\n《金融》美國就業數據強 引發美元震盪 【時報-台北電】外匯評論： 1.USD/JPY 美國12月零售銷售意外持平，商務部同時下修10月零售銷售數據，表明在生活成本持續攀升的壓力下，占經濟總量三分之二的消費者支出呈現疲態，疊加企業庫存小幅上升的態勢，可能預示著消費者支出和經濟在新的一年進入增長放緩軌道，促使經濟學家下調美國第四季經濟增長預期，亦為美國聯邦準備理事會(FED)降息提供更大空間，衝擊美國公債收益率走低，週三令美元承壓。 並隨著投資人押注日本首相高市早苗在選舉中取得壓倒性勝利，將使其未來可以在掌控財政政策方面處於強勢地位，可能採取更負責任的財政政策，並紛紛湧入日本股市，期待刺激政策能惠及消費者和日本企業，並有外資流入日本股市推升對日圓的需求，適逢日本假期休市，亞洲時段交投清淡，導致美元兌日圓備受壓力。據美國勞工部數據顯示，1月非農業就業崗位加速增長13萬個、失業率降至4.3%及平均時薪較前月增加0.4%皆優於預期，顯示勞動力市場保持穩定，為FED利率不變一段時間提供空間，一度激勵美元兌日圓上揚至154.65高點，但隨後大幅下修去年3月止年度就業崗位增幅，較先前估計少86.2萬個，並據美國國會預算辦公室(CBO)預測\n時報資訊 ・ 1 天前 ・ 發表留言\n\n《國際經濟》美1月非農就業增長估回升 原因卻很悲傷 【時報編譯柯婉琇綜合外電報導】因為一些季節性行業減少裁員，美國1月就業增長可能回升，但由於進口關稅形勢仍不明朗，使人員招聘受到抑制，以及加強移民執法限縮了勞動力供應，實際上，美國的勞動力市場恐仍疲軟。 美國勞工部將於當地時間周三發布備受關注的非農就業報告。市場預期該報告將顯示1月失業率維持在4.4%不變，以及薪資年增長放緩。經濟學家表示，川普政府的貿易和移民政策抑制了就業市場，但減稅應可提振今年的招聘力道。 通常每年1月是季節性裁員最嚴重的月份，但由於去年底零售、物流等季節性招聘減少，因此今年1月的裁員情況可能隨之減少，或許會推升就業增長。 KPMG首席經濟學家Diane Swonk表示，就業市場潛在的壓力比整體失業率所呈現的要大。薪資增長正在減速、失業後更難找到工作、應屆畢業生要找到工作也更加困難。儘管報告上的經濟數據看起來很火熱，但勞動力市場依舊寒氣逼人。 根據路透社所做的調查，受訪經濟學家預估2025年1月非農就業可能增加7萬人，超出12月份的新增5萬人。預測值在介於減少1萬人到增加13.5萬人之間。一些私人調查顯示1月可能出現就業減少的情況。 這份就業報告原定於上周五發布，但受\n時報資訊 ・ 2 天前 ・ 發表留言\n\n價格上漲帶動 2025年美國礦產產值年增5.6% MoneyDJ新聞 2026-02-10 09:00:35 黃文章 發佈根據美國地質調查局2月6日發布的年度《礦產商品摘要》，2025年美國非燃料礦產總產值年增5.6%，達到1,120億美元，主要受黃金與白銀等貴金屬價格上漲的帶動。報告同時凸顯非燃料礦產對美國航太、電子與建築等產業的整體重要性。依賴礦產的相關產業於2025年創造了4.09兆美元的產值，占美國經濟總量的八分之一以上。 美國地質調查局局長內德·馬穆拉表示：「關鍵礦產已成為美國政府政策制定與國際關係中的核心議題。2025年，礦產相關產業為美國經濟貢獻超過4兆美元，顯然礦產將成為二十一世紀全球經濟的命脈。三十年來，這些報告持續揭示礦產的重要性，以及美國對關鍵礦產進口依賴程度的上升。而川普政府所推動的政策、協議與重大投資，已開始著手降低這種依賴。」 內華達州連續第二年成為礦產產值最高的州，但亞利桑那州的產值超越德州，躍居第二。內華達州曾於2015年至2020年間居首，之後2021年與2022年由亞利桑那州領先，2023年則由德州居冠。 亞利桑那州之所以超越德州，主因在於銅、鉬、黃金與白銀的產值上升。德州方面，建築相關礦產的產值雖\nMoneydj理財網 ・ 4 天前 ・ 發表留言\n\n《國際產業》不能只給台積電甜頭 傳川普即將祭晶片稅 這群可豁免 【時報編譯柯婉琇綜合外電報導】《金融時報》報導，據知情的美國政府官員透露，川普政府即將實施晶片關稅，但擬給予在美國積極佈建AI資料中心的亞馬遜、Google、微軟等科技巨頭豁免待遇，且這些豁免將與台積電的投資承諾掛鉤。 報導指出，這項由美國商務部審批的關稅豁免，將與最近達成的美台貿易協議相結合。台積電依據這項貿易協議取得的關稅豁免配額可分配給美國大型科技公司，好讓這些客戶能免稅進口台積電的晶片。 報導稱這項關稅豁免計畫凸顯出川普政府開徵晶片關稅、促進本地製造晶片的決心，同時也給高度仰賴進口半導體、正在美國推動AI快速發展的科技公司提供緩衝空間。 受訪的美國政府官員表示，相關計劃尚未拍板，也尚未獲得川普簽署。 美國政府官員透露，美方在計畫公布後，會像老鷹一樣緊盯後續進展，「以確保我們能透過關稅和退稅切實達成目標，也可避免這最終演變成只給台積電送上大禮」。 美國商務部在1月中旬宣布與台灣達成貿易協議，台灣晶片和科技公司將在美國投資至少2500億美元生產晶片和打造晶片工廠，而台灣政府將為這些公司提供信貸擔保2500億美元。作為交換條件，美方將給予台灣「15%且不疊加」的對等關稅稅率，並承諾對\n時報資訊 ・ 3 天前 ・ 發表留言\n\n韓國會成立特別委員會　預料3/9前完成對美投資立法 （中央社首爾2026年2月9日綜合外電報導）韓國國會今天下午召開全體會議，通過成立專門審議對美投資特別法案的特別委員會。外界普遍認為法案將在下月9日委員會活動期限屆滿前通過朝野協商，完成立法程序。美國總統川普（Donald Trump）不滿韓國國會尚未通過去年與美國達成的貿易協議，上月揚言調高從韓國進口產品關稅。根據該協議，韓國承諾將向美國投資3500億美元。韓國兩大黨國會領袖上週在簡報會上已預告，今天將設立特別委員會，該委員會擁有法案草擬權，並預定3月9日前拍板法案。韓聯社報導，韓國產業通商部長官金正官今天表示，上週曾與美國商務部長盧特尼克（HowardLutnick）舉行兩次視訊會議，對於韓國朝野同意在一個月內完成對美投資特別法案立法程序，盧特尼克給予高度評價。金正官並稱，通常美方在總統表態後3天至1週內便會在「聯邦公報」（Federal Register）刊登相關措施，但自川普上月發表相關言論以來已過去2週，相關措施迄今仍未登報，這在一定程度上反映出美方認可韓方的努力。金正官也強調，鑒於川普主要將問題歸咎於立法延誤，若相關問題得以解決，關稅上調獲得暫緩的可能性較大。\n中央社財經 ・ 4 天前 ・ 發表留言\n\n道瓊尾盤漲幅差點全吐 川普或增派第二支航母艦隊駛向伊朗 《Axios》週二獨家報導，美國總統川普受訪表示，若與伊朗的談判未能達成協議，他正考慮向中東增派第二支航空母艦打擊群，以便在外交破局時，為可能的軍事行動預作準備。\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n熱門新聞\n1\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 2\n\n13.5億威力彩「2得主」買法一模一樣！ 只花100元就翻身 3\n\n郭台銘大紅包發威！央行新台幣發行額首破4.2兆  年增率飆3年最高 4\n\n「新版新台幣」可能有石虎！票選結果曝光 台積電僅排第七 5\n\n【房地產週報】輝達簽約落腳北士科！29年最大交屋潮來襲！新竹預售屋慘崩82.3%！七大都會區交易量年減7成\n\n你可能會喜歡\n你上車了嗎？記憶體登蛇年狂飆主力　前10猛將全曝光 FTNN新聞網\n\n九大工業公會聯合肯定台美貿易協定 強調為產業注入強心針 民視財經網\n\n春節搭車風險升溫！行車保護傘保障出行　花1元即可享百萬保障 三立新聞網 setn.com\n\n「台灣價值」竟沒台灣之光！大盤飆新高00940卻回不到10元　股民哀號：成敗皆這1檔 鏡週刊Mirror Media\n\n緝捕馬杜洛震驚全球 美軍傳動用AI工具Anthropic Claude 鉅亨網\n\n信義房屋：年前家電、家具換新需求高 今日新聞NOWNEWS\n\n台股拉警報！專家警告美股7巨頭集體翻車：最慘開年行情 中時財經即時\n\n鄭麗君團隊立大功！謝金河曝「台美ART簽署」意義：台灣獲1席珍貴位子 三立新聞網 setn.com\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 工商時報\n\n租屋族省很大！租金補貼減輕4成負擔 女性與25歲以下青年成主力 太報\n\n法人兩樣情！華邦電發說利多連發...目標價上看200元 　保守派「4理由」只喊88元 FTNN新聞網\n\n外食族吃不消! 海南雞飯漲20元 手搖飲過年期間漲5元 民視財經網影音\n\n美股掀AI恐慌交易　台積電ADR挫0.47％ CTWANT\n\n陸客不去日本！外媒爆25萬大軍「改衝這國」 刷爆103億不手軟 中時財經即時\n\n金蛇年「大漲萬點」封關！0050領銜市值型ETF悍漲　近十年含息報酬率高達509% FTNN新聞網\n\n台灣賓士對「台美貿易協議」成功達成表達祝賀 並承諾回饋消費者 民視財經網\n\n聯電ADR13日上漲0.13美元漲幅1.26%折台股65.68元 中央社財經\n\n砸5億擴產最快Q2釋產能！PCB股華通衝連3漲　當沖爆量破5萬張登當沖王 FTNN新聞網\n\n輝達下跌、AMD上漲 背後關鍵或在Arista 鉅亨網\n\n美通膨降溫難掩「AI恐慌」! 美股漲跌互見、台積電ADR下跌0.51％ 新頭殼\n\n台美ART簽署》台經院張建一妙喻：台灣付的午餐費 比別人還低 工商時報\n\n大研生醫* 公告本公司股票面額由「新台幣10元」變更為「新台幣1元」，公告期間：114年12月22日至115年3月21日。 Moneydj理財網\n\n蘇威元：台積電概念股飆漲密碼 這四指標抓飆股一次賺58% 民視財經網影音\n\n外資降評唱衰！大咖投顧逆風喊買面板指標大廠「這檔」　最新目標價曝光 FTNN新聞網\n\n春節放假也能追美股！內部數據曝光　過年反而更敢買 三立新聞網 setn.com\n\n記憶體嚴重短缺！美國軍工企業黑名單 移除中國長鑫、長江存儲 自由時報\n\n運載指標／港務公司貨櫃量上看1,390萬TEU 今日新聞NOWNEWS\n\n關稅干擾消失加AI助攻　經濟成長率上修至7.71％ 卡優新聞網\n\n主動式ETF規模破1739億！這檔年化配息率10％　豪配0.377元「年後這天」最後上車日 FTNN新聞網\n\n到全台最夯紫南宮借發財金　主委莊秋安：心存善念有來有保庇 鏡報\n\n新北房市 新莊幸福路商圈 成家首選 工商時報\n\n台美ART 守住重要農產品防線 工商時報\n\n〈能源盤後〉油價因美通膨趨緩回升 周線仍收黑 鉅亨網\n\n13家金控1月獲利全公布！國泰金元月大賺146億元　EPS達0.99元登獲利王 FTNN新聞網\n\n美通膨降溫難掩AI隱憂　美股漲跌互見 太報\n\n〈貴金屬盤後〉黃金、白銀回神 CPI重燃降息預期 鉅亨網\n\n傳統軟體股崩跌回五年前！卡爾先生：掌握這兩點才能存活 民視財經網影音\n\n台股資料來源 臺灣證券交易所 、 臺灣期貨交易所 及 財團法人中華民國證券櫃檯買賣中心 ，國際股市資料來源請參考 Yahoo Finance 。台股行情、個股基本資料及財務資訊為精誠資訊提供。使用Yahoo股市服務前，請您詳閱相關 使用規範與聲明 。\n\n服務條款 隱私權 您的隱私權選擇 加州隱私權通知 © 2026 Yahoo. All rights reserved.\n\n1",
      "Language": "zh",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-11",
      "Time": "10:31:27",
      "Source": "Yahoo奇摩股市",
      "Title": "《美股》焦點股：標普漲跌幅最大個股出列；福特、Lyft盤後發財報",
      "URL": "https://tw.stock.yahoo.com/news/%E7%BE%8E%E8%82%A1-%E7%84%A6%E9%BB%9E%E8%82%A1-%E6%A8%99%E6%99%AE%E6%BC%B2%E8%B7%8C%E5%B9%85%E6%9C%80%E5%A4%A7%E5%80%8B%E8%82%A1%E5%87%BA%E5%88%97-%E7%A6%8F%E7%89%B9-lyft%E7%9B%A4%E5%BE%8C%E7%99%BC%E8%B2%A1%E5%A0%B1-023127433.html",
      "Content": "【時報編譯柯婉琇綜合外電報導】焦點股：\n●可口可樂第四季營收不如華爾街預期，周二股價收跌1.5%。其2025年第四季營收年增2%，為118億美元，不如分析師預估的120.3億美元。經調整後每股盈盈0.58美元，優於市場預期的0.56美元。\n●Datadog大漲13.7%，在標普500指數成分股中漲幅領先。該雲端監控和分析平台第四季財報優於市場預期，其營收年增29%並創下歷史新高，且看好2026年營收突破40億美元大關。\n\n●S&P Global公布的2026年獲利預測不及分析師預期，周二股價重挫9.7%，在標普500指數成分股中跌幅最大。其同業穆迪（Moody's）和MSCI亦收黑。\n\n●Spotify飆漲14.7%，受惠於強勁的用戶增長和調漲價格，該音樂串流平台第一季獲利預測優於市場預期。\n●福特汽車周二收跌0.15%，但盤後漲0.66%，儘管其財報不如市場預期，且因認列電動車業務轉型相關的一次性費用，其去年第四季與全年分別虧損111億和82億美元。\n●Lyft周二收漲1.44%，盤後重挫逾17%。該共享乘車平台盤後公布季報，其去年第四季營收年增3%，為15.9億美元，不及市場預估的17.6億美元。總預訂額（Gross Bookings）年增19%，為50.7億美元，符合市場預期。活躍乘客數2920萬人，總搭乘次數2.435億次，都落後市場預期。Lyft預估今年第一季經調整後息稅折舊攤銷前獲利（EBITDA）為介於1.2億～1.4億美元，分析師預測均值為1.398 億美元。\n\n檢視留言\n\n相關內容\n可口可樂Q4業績好轉 但今年展望偏弱拖累股價 可口可樂在10日美股盤前公布第四季財報，儘管業績有好轉，但其預測今年有機銷售成長幅度在4％到5％之間，低於市場平均預估成長5.01％，拖累其盤前股價下跌約1％。\n中時財經即時 ・ 3 天前 ・ 發表留言\n\n〈財報〉可口可樂看淡今年營收展望 需求壓力拖累股價走跌 可口可樂周二 (10 日) 美股盤前公布最新財報並釋出 2026 年全年展望，雖然 2025 會計年度第四季 (截至去年 12/31) 獲利表現略優於市場預期，但對今年營收成長的預測低於分析師原先期待，加上北美與部分海外市場汽水需求仍顯疲弱\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n友達去年轉盈 稅後純益68.4億元 EPS 0.9元 友達公佈2025年第四季合併財報，第四季合併營業額為701.4億元，較2025年第三季增加0.3%，與2024年第四季相比增加2.1%，稅後純益為28.8億元，每股純益為0.38元。合計2025年全年合併營業額為2,813.9億元，較2024年增加0.4%，稅後純益68.4億元，基本每股純益為0.90元。\n中時財經即時 ・ 3 天前 ・ 發表留言\n\n中光電去年EPS 0.95元，估今年Q1節能、影像出貨量季減 【財訊快報／記者張家瑋報導】中光電(5371)今日舉行法說會暨公布去年第四季財報，展望2026年第一季營運。總經理林惠姿表示，受到傳統淡季及大環境影響，預期第一季節能產品出貨量將較上季減少，但可較去年同期成長，而影像產品出貨量則將減少三成左右。受到傳統淡季與工作天數減少等因素影響，中光電節能產品第一季整體出貨量預期將較第四季減少，但可望較去年同期成長。預期2026年節能產品的整體出貨量將成長一到二成。他表示，面對地緣政治引發的供應鏈重組與關稅壁壘挑戰，今年除持續強化越南廠增量製造以滿足客戶需求外，亦已在大陸擴大OLED模組產能以承接更多大尺寸顯示器生意，並推出適用於電子紙與反射式螢幕的高效能前光模組，以拓展戶外看板與教育市場，同時也因應歐美法規趨嚴聚焦高技術門檻的車載顯示與綠色護眼技術，積極發展主/副駕駛資訊顯示所需的主動式防窺技術。而影像產品第一季受傳統淡季及整體經濟環境仍不明朗影響，預估整體出貨量將減少三成左右。林惠姿說，2026上半年市場需求仍具不確定性，主要來自各國在國防預算上的排擠、通膨、美國關稅政策及各區域GDP成長預期保守等因素影響。然而，依市調資料預估，世界盃足球賽事可\n財訊快報 ・ 3 天前 ・ 發表留言\n\n友達去年Q4/全年轉盈，惟本業皆仍虧損 MoneyDJ新聞 2026-02-10 14:06:29 李宜秦 發佈友達(2409)今(10)日舉行法說會並公布去(2025)年第四季與全年財報，第四季合併營收701.4億元，季增0.3%、年增2.1%；歸屬母公司淨利28.8億元、轉盈，基本每股盈餘0.38元。其中第四季毛利率10.7%、營業淨損18.9億元，營業淨損率2.7%，EBITDA獲利率8.1%。 累計2025年全年，友達合併營收2,813.9億元、年增0.4%；歸屬母公司淨利68.4億元、全年轉盈，終結連續三年的虧損局面，基本每股盈餘0.9元。其中全年毛利率11.5%、營業淨損10.6億元，營業淨損率0.4%，EBITDA獲利率10.2%。 回顧2025年，友達指出，年初市場原預期全球經濟穩定發展，但其後受到對等關稅、地緣政治、原物料漲價等因素干擾，加上新台幣對美元升值帶來逆風，營收僅小幅增長；不過公司持續推動轉型，帶動營收結構優化，使年度損益呈轉虧為盈。 展望2026年，友達表示，依目前掌握的業務狀況，對整體市場需求採「審慎樂觀」看法，但外在變數仍多，管理團隊將密切關注市場變化、持續開拓業務，並更嚴謹做好成本與費用控\nMoneydj理財網 ・ 3 天前 ・ 1 則留言\n\n歐洲能源商道達爾Q4淨利38.4億美元，表現符合預期 【財訊快報／劉敏夫】外電報導指出，歐洲能源商道達爾能源公司(TTE FP)發布第四季財報，結果當季經調整後的淨獲利表現符合預期。根據財報，道達爾能源公司第四季經調整後的淨獲利38.4億美元，較上年同期萎縮13%，市場分析師的預估中值為38.1億美元。第四季經調整後息稅折舊及攤銷前利潤(Ebitda)100.7億美元，較上年同期減少4.4%，市場分析師的預估中值為98.7億美元。第四季調整後每股獲利1.73美元，市場分析師預估中值為1.75美元；營收459.3億美元，市場分析師的預估中值為355.8億美元。\n財訊快報 ・ 2 天前 ・ 發表留言\n\n〈財報〉幣圈急凍！Coinbase第四季暴虧6.67億美元 營收衰退20% 加密貨幣交易所巨頭 Coinbase 在美股周四 (13 日) 盤後交出一份慘淡的第四季成績單，營收年減 20% 至 18 億美元，淨虧損高達 6.67 億美元，遠遜於一年前 13 億美元的淨利表現，而業績暴跌背後是加密貨幣市場嚴重遇冷。 虧損主因是對加密貨幣持倉及投資的帳面減\n鉅亨網 ・ 23 小時前 ・ 發表留言\n\n華邦電Q4每股賺0.88元 毛利率降至41.9% 今年砸421億擴產 記憶體大廠華邦電子（2344）今日召開2025年第四季法說會，公佈2025年第四季及全年財務業績。受惠於AI動能爆發及多元應用需求成長，華邦電2025年下半年獲利顯著回溫，第四季EPS來到0.76元。合併毛利率來到41.9%，較第三季減少5%。全年淨利達31.77億元，EPS 0.88元。公司也同步宣佈2026年資本支出計畫將提升至421億元，以支應Flash與CMS產線的擴產計畫。\nEBC東森財經新聞 ・ 3 天前 ・ 發表留言\n\n研調：去年Q4筆電市場出貨優於預期，Q1將有顯著季減，聯想、宏碁、蘋果較佳 【財訊快報／記者王宜弘報導】根據DIGITIMES最新產銷調查顯示，去年第四季全球筆電出貨表現優於原先預期，主因記憶體價格於第四季出現明顯飆漲，且漲勢預期延續至今年初，促使品牌業者為降低未來成本壓力而提前備貨，進而推升第四季筆電出貨量。而提前拉貨亦墊高比較基期，今年首季全球筆電出貨面臨明顯回檔壓力，將有較顯著季減。DIGITIMES分析師張珩表示，從供給面觀察，2026年首季面臨筆電主要生產基地因春節假期而工時縮減的問題，預計產能將減少而不利出貨。且記憶體價格持續上漲，平價機款不易透過降規方式因應，因此品牌業者勢將面臨成本壓力，部分機款出貨轉為保守。需求端方面，消費市場及商務市場皆因預期終端價格將上漲而提前於2025年第四季消費及採購，加上首季本屬筆電消費市場傳統淡季，整體需求明顯轉弱，將加重全球筆電出貨下滑壓力，預估今年首季全球筆電出貨約4,039萬台，季減逾13%，年減逾4%。就品牌表現而言，2026年首季全球筆電品牌業者出貨排名預期將維持不變，但個別品牌表現方面則是漲跌互見。聯想(Lenovo)、宏碁(2353)及蘋果(Apple)於首季出貨相對較佳，其中，蘋果將受惠新品效應，是\n財訊快報 ・ 3 天前 ・ 發表留言\n\n穩懋去年EPS 4元，預估Q1營收季減高個位數百分比 【財訊快報／記者張家瑋報導】砷化鎵晶圓代工廠穩懋(3105)今日舉行法說會暨公布去年第四季財報，第四季歸屬母公司業主淨利10.29億元、季減4%，每股盈餘 2.43元；2025全年歸屬母公司業主淨利16.94億元、年增121%，每股盈餘4元。展望2026年第一季，穩懋指出，受傳統淡季及較少工作天數的影響，單季營收預計將較前一季下滑高個位數百分比，合併毛利率則約為25%上下的水準。穩懋去年第四季合併營收47.94億元，較前一季成長7%，與前一年同期相比成長 29%，略優於原先的預期。單季毛利率31.8%，較上一季上升4.9個百分點，產能利用率維持上一季的60%，毛利率成長主要歸功於產品組合優於上一季，加上合併子公司轉投資中國客戶上市股票相關利益貢獻合併毛利率約0.45個百分點。穩懋表示，去年第四季Infrastructure（通訊基礎建設）延續前一季的動能，仍然是成長最為強勁的族群，營收持續成長。在WiFi方面，隨著美系旗艦手機鋪貨旺季逐漸進入尾聲，以及路由器市場需求較弱，第四季Wi-Fi PA營收呈現些微下滑。Cellular（手機行動網路）PA在終端銷售優於預期的情況之下，加上安卓系\n財訊快報 ・ 2 天前 ・ 發表留言\n\n《光電股》友達去年EPS升至0.9元止連3虧 今年審慎樂觀 【時報記者葉時安台北報導】友達(2409)周二召開實體法說會，並公布2025年第四季合併財務報表。友達去年第四季、去年度順利轉盈，受到獲利結構持續改善，加上業外處分利益，去年第四季基本每股盈餘為新台幣0.38元，年度基本每股盈餘為新台幣0.90元，止步連三年赤字。展望今年，友達董事長彭(又又)浪表示，公司審慎樂觀看待今年整體市場需求。但目前外在變數仍多，包括記憶體缺貨漲價、關稅談判、區域衝突，管理團隊將會密切關注市場變化，友達今年營收挑戰逐季上升。 友達總計2025年第四季合併營業額為新台幣701.4億元，季增加0.3%、年增加2.1%。2025年第四季毛利率為10.7%，營業淨損為新台幣18.9億元，營業淨損率為2.7%，歸屬母公司業主之淨利為新台幣28.8億元，基本每股盈餘為新台幣0.38元，再度轉盈，高於2024年第四季的0.21元，以及優於去年第三季的每股虧損0.17元。友達三大支柱，去年第四季營運皆符合預期。 友達合計2025年全年合併營業額為新台幣2813.9億元，年增加0.4%。全年毛利率為11.5%，營業淨損為新台幣10.6億元，營業淨損率為0.4%，歸屬於母公司業主之\n時報資訊 ・ 3 天前 ・ 發表留言\n\n【公告】聚鼎114年第四季及年度合併自結損益 日 期：2026年02月13日公司名稱：聚鼎(6224)主 旨：聚鼎114年第四季及年度合併自結損益發言人：侯全興說 明：1.事實發生日:115/02/132.公司名稱:聚鼎科技股份有限公司3.與公司關係(請輸入本公司或子公司):本公司4.相互持股比例:不適用5.發生緣由:公告本公司114年第四季及年度合併自結損益(尚未經會計師查核)：(單位：新台幣仟元)114年10-12月 114年1-12月合併營業利益(損失) (39,623) 6,026合併稅前淨利(淨損) (34,157) 67,702本期淨利(淨損)歸屬於母公司業主 (26,133) 57,020基本每股盈餘（新台幣元） (0.31) 0.67註：上述各項金額係為本公司之自結數，尚未經會計師查核。6.因應措施:無7.其他應敘明事項(若事件發生或決議之主體係屬公開發行以上公司，本則重大訊息同時符合證券交易法施行細則第7條第9款所定對股東權益或證券價格有重大影響之事項):本公司 114 年第四季單季呈現虧損，係受元件事業營收及獲利衰退、美國子公司營運虧損及其認列資產報廢損失影響所致。惟 114 年度歸屬於母公司業主之淨利仍為新臺\n中央社財經 ・ 18 小時前 ・ 發表留言\n\n【公告】致茂將召開法說會說明2025年第四季營運結果 日 期：2026年02月13日公司名稱：致茂(2360)主 旨：致茂將召開法說會說明2025年第四季營運結果發言人：應正說 明：符合條款第四條第XX款：12事實發生日：115/02/251.召開法人說明會之日期：115/02/252.召開法人說明會之時間：14 時 30 分3.召開法人說明會之地點：桃園市龜山區文茂路88號(本公司會議室)4.法人說明會擇要訊息：2025年第四季營運結果5.其他應敘明事項：無完整財務業務資訊請至公開資訊觀測站之法人說明會一覽表或法說會項目下查閱。\n中央社財經 ・ 16 小時前 ・ 發表留言\n\n富時羅素點出中國結構逆風，內需與高科技投資成2026年關鍵動能 【財訊快報／劉敏夫】外電報導指出，富時羅素發表「2026馬年中國市場展望」指出，中國在2025年實現了全年實際GDP增長5%的目標，主要得益於第四季4.5%的穩健擴張。富時羅素表示，儘管對美國出口年比值大幅下降20%，但中國成功將貿易流向轉向更為多元化的市場，包括東盟、歐洲和非洲，因此商品出口表現強勁，進口相對低迷，為其擴大了經常帳盈餘，提振宏觀經濟提供了重要助力。富時羅素指出，雖然消費品補貼效應逐步減弱後，零售銷售在第四季動能放緩，中國工業活動在全年依然保持亮眼成績。強勁的出口表現持續支撐工業部門，促使2025年工業利潤年比值微增0.6%，成為自2021年以來的首次正增長。富時羅素還指出，結構性阻力依然存在。勞動力市場持續疲軟，以及第四季房地產銷售和房地產投資進一步萎縮，家庭情緒和消費持續承壓。此外，通縮壓力也依然嚴峻，生產者價格自2022年第四季以來一直處於負值區間。展望2026年，中國將以國內需求、創新和高科技投資作為經濟增長的關鍵驅動力，並輔以擴張性的財政政策。\n財訊快報 ・ 3 天前 ・ 發表留言\n\n美國去年Q4雇傭成本指數小增0.7%，增幅創四年最低 【財訊快報／劉敏夫】外電報導指出，2025年第四季，美國雇傭成本指數創四年最低增幅。美國勞工統計局週二發布的數據顯示，雇傭成本指數在截至2025年12月的三個月攀升了0.7%。這是2021年第二季以來最小增幅。44位受訪經濟專家的預估中值為增加0.8%，預估區間介於上揚0.7%至上揚0.9%。從年比值來看，第四季雇傭成本指數成長3.4%。這份數據顯示，去年第四季薪資季比值上漲0.7%、年比值攀升3.3%；福利成本季比值成長0.7%、年比值成長3.4%。\n財訊快報 ・ 3 天前 ・ 1 則留言\n\n【公告】系微114年第四季自結損益 日 期：2026年02月13日公司名稱：系微(6231)主 旨：系微114年第四季自結損益發言人：徐心吾說 明：1.事實發生日:115/02/132.公司名稱:系微股份有限公司3.與公司關係(請輸入本公司或子公司):本公司4.相互持股比例:不適用5.傳播媒體名稱:不適用6.報導內容:不適用7.發生緣由:本公司民國114年第四季財務報告，自結(尚未經會計師核閱)114年第四季(以下簡稱本季)，本季合併營收新台幣451,745仟元，本季合併營業利益新台幣123,673仟元，本季稅前利益新台幣132,516仟元。8.因應措施:無。9.其他應敘明事項:無。\n中央社財經 ・ 17 小時前 ・ 發表留言\n\n焦點股：盛群2025年虧轉盈，股價量增突破前高 【財訊快報／研究員吳旻蓁】MCU廠盛群( 6202 )公布去年財報，去年第四季每股純益0.14元，2025年每股純益0.76元，由虧轉盈。去年第四季合併營收6.82億元，季減9.4%、年減1.3%，去年合併營收30.57億元，年增22.2%。公司近期觀察到客戶長單詢問與能見度浮現，因此對上半年營運維持審慎偏正向的看法。股價底部第一波起漲回測月線後，量能重新放大，今股價突破前波高點，短線可觀察前高，若具支撐，則有利短多維持。\n財訊快報 ・ 3 天前 ・ 發表留言\n\n《光電股》中光電114年EPS為0.95元 今年節能、影像產品出貨量拚增2成 【時報記者葉時安台北報導】中光電(5371)周二召開線上法人說明會，並公布114年第四季財務報表。中光電去年第四季獲利2億元，季成長110%、年成長4%，單季基本每股盈餘為新台幣0.51元，為五個季度最高。展望今年，第一季受到淡季、工作天數而走跌，但中光電預期節能產品的年度整體出貨量將成長一到二成，預期影像產品全年整體出貨量也將年成長一至二成。 中光電總計去年第四季合併營業收入淨額為新台幣112.97億元，季比、年比皆成長14%。第四季合併毛利率為18.1%，由於產品組合及匯率變化，季增加2.9個百分點、年減0.9個百分點。合併營業淨利為新台幣2.7億元，季增215%、年增293%。合併稅後淨利為新台幣1.97億元，季成長127%、年減少15%。歸屬母公司股東之淨利為新台幣2億元，季成長110%、年成長4%。114年第四季基本每股盈餘為新台幣0.51元，為五個季度最高。 中光電114年全年合併營業收入淨額為新台幣395.77億元，年比相當。合併毛利率為17.3%，年減少0.5個百分點，主要係受到匯率不利影響。合併營業淨損為新台幣1.31億元，轉虧減少170%。合併稅後淨利為新台幣3.5\n時報資訊 ・ 3 天前 ・ 發表留言\n\n擊敗所有預測 馬來西亞2025年第四季經濟增長達6.3% 馬來西亞經濟在 2025 年第四季展現出強勁的韌性，GDP 較去年同期增長達 6.3%，不僅遠高於官方先前預測的 5.7%，更創下 3 年來最高的單季增長紀錄。\n鉅亨網 ・ 18 小時前 ・ 發表留言\n\n倍微自結114年合併稅前獲利8032萬元，每股稅前1.11元 公開資訊觀測站重大訊息公告(6270)倍微-公告本公司114年度第四季自結損益1.事實發生日:115/02/132.公司名稱:倍微科技股份有限公司3.與公司關係(請輸入本公司或子公司):本公司4.相互持股比例:不適用5.發生緣由:民國114年第四季財務報告，自結(尚未經會計師審核)114年第四季合併營收為新台幣5.76億元，稅前獲利新台幣817萬元，按目前實收股本新台幣7.21億元計算，第四季每股稅前盈餘新台幣0.11元。本年度累計至第四季合併營收為新台幣27.7億元，稅前淨利新台幣8,032萬元，每股稅前盈餘新台幣1.11元。6.因應措施:無。7.其他應敘明事項(若事件發生或決議之主體係屬公開發行以上公司，本則重大訊息同時符合證券交易法施行細則第7條第9款所定對股東權益或證券價格有重大影響之事項):無。延伸閱讀：倍微 公告本公司114年度第四季自結損益倍微 115年1月營收2.55億、年增23.57% 資料來源-MoneyDJ理財網\nMoneydj理財網 ・ 13 小時前 ・ 發表留言\n\n熱門新聞\n1\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 2\n\n13.5億威力彩「2得主」買法一模一樣！ 只花100元就翻身 3\n\n郭台銘大紅包發威！央行新台幣發行額首破4.2兆  年增率飆3年最高 4\n\n「新版新台幣」可能有石虎！票選結果曝光 台積電僅排第七 5\n\n【房地產週報】輝達簽約落腳北士科！29年最大交屋潮來襲！新竹預售屋慘崩82.3%！七大都會區交易量年減7成\n\n你可能會喜歡\n你上車了嗎？記憶體登蛇年狂飆主力　前10猛將全曝光 FTNN新聞網\n\n九大工業公會聯合肯定台美貿易協定 強調為產業注入強心針 民視財經網\n\n春節搭車風險升溫！行車保護傘保障出行　花1元即可享百萬保障 三立新聞網 setn.com\n\n「台灣價值」竟沒台灣之光！大盤飆新高00940卻回不到10元　股民哀號：成敗皆這1檔 鏡週刊Mirror Media\n\n外食族吃不消! 海南雞飯漲20元 手搖飲過年期間漲5元 民視財經網影音\n\n緝捕馬杜洛震驚全球 美軍傳動用AI工具Anthropic Claude 鉅亨網\n\n信義房屋：年前家電、家具換新需求高 今日新聞NOWNEWS\n\n台股拉警報！專家警告美股7巨頭集體翻車：最慘開年行情 中時財經即時\n\n鄭麗君團隊立大功！謝金河曝「台美ART簽署」意義：台灣獲1席珍貴位子 三立新聞網 setn.com\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 工商時報\n\n租屋族省很大！租金補貼減輕4成負擔 女性與25歲以下青年成主力 太報\n\n法人兩樣情！華邦電發說利多連發...目標價上看200元 　保守派「4理由」只喊88元 FTNN新聞網\n\n美股掀AI恐慌交易　台積電ADR挫0.47％ CTWANT\n\n陸客不去日本！外媒爆25萬大軍「改衝這國」 刷爆103億不手軟 中時財經即時\n\n金蛇年「大漲萬點」封關！0050領銜市值型ETF悍漲　近十年含息報酬率高達509% FTNN新聞網\n\n台灣賓士對「台美貿易協議」成功達成表達祝賀 並承諾回饋消費者 民視財經網\n\n聯電ADR13日上漲0.13美元漲幅1.26%折台股65.68元 中央社財經\n\n砸5億擴產最快Q2釋產能！PCB股華通衝連3漲　當沖爆量破5萬張登當沖王 FTNN新聞網\n\n輝達下跌、AMD上漲 背後關鍵或在Arista 鉅亨網\n\n美通膨降溫難掩「AI恐慌」! 美股漲跌互見、台積電ADR下跌0.51％ 新頭殼\n\n台美ART簽署》台經院張建一妙喻：台灣付的午餐費 比別人還低 工商時報\n\n大研生醫* 公告本公司股票面額由「新台幣10元」變更為「新台幣1元」，公告期間：114年12月22日至115年3月21日。 Moneydj理財網\n\n外資降評唱衰！大咖投顧逆風喊買面板指標大廠「這檔」　最新目標價曝光 FTNN新聞網\n\n春節放假也能追美股！內部數據曝光　過年反而更敢買 三立新聞網 setn.com\n\n記憶體嚴重短缺！美國軍工企業黑名單 移除中國長鑫、長江存儲 自由時報\n\n運載指標／港務公司貨櫃量上看1,390萬TEU 今日新聞NOWNEWS\n\n關稅干擾消失加AI助攻　經濟成長率上修至7.71％ 卡優新聞網\n\n主動式ETF規模破1739億！這檔年化配息率10％　豪配0.377元「年後這天」最後上車日 FTNN新聞網\n\n到全台最夯紫南宮借發財金　主委莊秋安：心存善念有來有保庇 鏡報\n\n新北房市 新莊幸福路商圈 成家首選 工商時報\n\n台美ART 守住重要農產品防線 工商時報\n\n蘇威元：台積電概念股飆漲密碼 這四指標抓飆股一次賺58% 民視財經網影音\n\n〈能源盤後〉油價因美通膨趨緩回升 周線仍收黑 鉅亨網\n\n13家金控1月獲利全公布！國泰金元月大賺146億元　EPS達0.99元登獲利王 FTNN新聞網\n\n美通膨降溫難掩AI隱憂　美股漲跌互見 太報\n\n〈貴金屬盤後〉黃金、白銀回神 CPI重燃降息預期 鉅亨網\n\n傳統軟體股崩跌回五年前！卡爾先生：掌握這兩點才能存活 民視財經網影音\n\n台股資料來源 臺灣證券交易所 、 臺灣期貨交易所 及 財團法人中華民國證券櫃檯買賣中心 ，國際股市資料來源請參考 Yahoo Finance 。台股行情、個股基本資料及財務資訊為精誠資訊提供。使用Yahoo股市服務前，請您詳閱相關 使用規範與聲明 。\n\n服務條款 隱私權 您的隱私權選擇 加州隱私權通知 © 2026 Yahoo. All rights reserved.\n\n1",
      "Language": "zh",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-11",
      "Time": "07:55:19",
      "Source": "Yahoo奇摩股市",
      "Title": "《美股》收盤速報：AI威脅金融業 標普收黑 台積電ADR逆勢再創高",
      "URL": "https://tw.stock.yahoo.com/news/%E7%BE%8E%E8%82%A1-%E6%94%B6%E7%9B%A4%E9%80%9F%E5%A0%B1-ai%E5%A8%81%E8%84%85%E9%87%91%E8%9E%8D%E6%A5%AD-%E6%A8%99%E6%99%AE%E6%94%B6%E9%BB%91-%E5%8F%B0%E7%A9%8D%E9%9B%BBadr%E9%80%86%E5%8B%A2%E5%86%8D%E5%89%B5%E9%AB%98-235519973.html",
      "Content": "【時報-台北電】周二(2月10日)道指微升且連3日改寫收盤歷史高點。標普500收黑，因零售銷售數據不如預期，以及Altruist推出新的AI稅務規劃工具，投資人越來越擔心AI對金融業構成的威脅。輝達、微軟、Alphabet等科技巨頭普遍下跌，但台積電1月營收月增19.8%、年增36.8%，並再創歷史新高，其ADR逆勢收漲近2%，至361.91美元，再創新高。目前美指期小漲。\n★四大指數\n美股道瓊上漲52.27點或0.10%，收50,188.14點。\n\nS&P500下跌23.01點或0.33%，收6,941.81點。\n\nNASDAQ下跌136.20點或0.59%，收23,102.47點。\n費城半導體下跌55.45點或0.68%，收8,107.13點。\n★11大類股\n公用事業類股(SPLRCU)漲1.59% 房地產類股(SPLRCREC)漲1.39%\n原物料類股(SPLRCM)漲1.29% 非必需消費類股(SPLRCD)漲0.45%\n工業類股(SPLRCI)漲0.12% 能源類股(SPNY)跌0.08%\n科技類股(SPLRCT)跌0.58% 必需消費類股(SPLRCS)跌0.63%\n醫療類股(SPXHC)跌0.63% 金融類股(SPSY)跌0.75%\n通訊服務類股(SPLRCL)跌0.84%\n★重磅科技股\n1.五大市值股\n微軟(MSFT)下跌0.08%，收413.27美元。\n蘋果(AAPL)下跌0.34%，收273.68美元。\n輝達(NVDA)下跌0.79%，收188.54美元。\nAlphabet(GOOGL)下跌1.77%，收318.58美元。\n亞馬遜(AMZN)下跌0.84%，收206.96美元。\n2.焦點股\n戴爾科技(DELL)上漲4.22%，收126.01美元。\n恩智浦(NXPI)上漲3.37%，收236.62美元。\n甲骨文(ORCL)上漲2.11%，收159.89美元。\n特斯拉(TSLA)上漲1.89%，收425.21美元。\n安謀(ARM)上漲1.08%，收125.95美元。\n德州儀器(TXN)上漲0.98%，收220.92美元。\n網飛(NFLX)上漲0.91%，收82.21美元。\n高通(QCOM)上漲0.84%，收140.09美元。\n慧與科技(HPE)上漲0.25%，收23.97美元。\n微軟(MSFT)下跌0.08%，收413.27美元。\nSalesforce(CRM)下跌0.30%，收193.45美元。\n蘋果(AAPL)下跌0.34%，收273.68美元。\n應用材料(AMAT)下跌0.45%，收329.07美元。\n思科(CSCO)下跌0.56%，收86.29美元。\n美超微(SMCI)下跌0.60%，收33.33美元。\n輝達(NVDA)下跌0.79%，收188.54美元。\n亞馬遜(AMZN)下跌0.84%，收206.96美元。\nMeta(Meta)下跌0.96%，收670.72美元。\nIBM(IBM)下跌0.98%，收291.76美元。\n艾司摩爾(ASML)下跌0.98%，收1413.62美元。\n博通(AVGO)下跌1.02%，收340.44美元。\n超微(AMD)下跌1.13%，收213.57美元。\nAlphabet(GOOGL)下跌1.77%，收318.58美元。\n美光(MU)下跌2.67%，收373.25美元。\n英特爾(INTC)下跌6.19%，收47.13美元。\n★台股 ADR\n台積電上漲6.50美元或1.83%，收361.91美元，換算台股價格為2283.65元。\n聯電下跌0.14美元或1.39%，收9.91美元，換算台股價格為62.53元。\n日月光上漲0.34美元或1.54%，收22.49美元，換算台股價格為354.78元。\n中華電信上漲0.33美元或0.79%，收42.13美元，換算台股價格為132.92元。（編輯：柯婉琇）\n\n檢視留言\n\n相關內容\nAI支出破6千億美元也救不了？輝達股價為何不漲 儘管科技巨頭持續上調人工智慧 (AI) 基礎建設支出計畫，市場對 AI 熱潮的信心卻未能再度推升輝達股價。作為這波 AI 投資潮的最大受惠者之一，輝達 (NVDA-US) 股價近幾個月大致呈現區間震盪，自去年第四季以來累計下跌逾 1%，即\n鉅亨網 ・ 6 小時前 ・ 發表留言\n\nAlphabet傳發百年債募資、坦承有\"產能過剩\"風險 MoneyDJ新聞 2026-02-10 07:56:44 郭妍希 發佈Google母公司Alphabet Inc.傳出準備發行期限長達一個世紀(100年)的公司債，成為繼甲骨文(Oracle)一週前發行250億美元債券後，今(2026)年第二家透過債市融資的科技巨頭。 華爾街日報、CNBC 9日等外電報導，熟悉詳情的未具名投資者透露，Alphabet計畫發行以美元、英鎊及瑞郎計價的多種期限債券。其中，英鎊債券的到期期限從3年到100年不等，而瑞郎債券則為3~25年。 根據消息，美元債券總發行額將達200億美元，高於原先預期的150億美元。英鎊與瑞郎計價的債券預計週二(2月10日)銷售完畢。 Alphabet、甲骨文是少數幾家開始大舉融資的科技企業，以資助AI基礎建設的龐大投資案。截至2025年3月，Alphabet申報的長期債務還不到110億美元。 值得注意的是，Alphabet重返債市為AI建設融資之際，也坦承AI崛起、基礎建設的大規模投資存在新風險。 Alphabet上週公佈財報時，特地提到AI對核心廣告業務的潛在風險，以及高昂投資承諾導致「產能過剩」(excess capaci\nMoneydj理財網 ・ 4 天前 ・ 發表留言\n\n搶翻？傳谷歌發債額飆破300億美元、Meta想跟進 MoneyDJ新聞 2026-02-11 08:15:40 郭妍希 發佈谷歌(Google)母公司Alphabet Inc.的發債規模愈滾愈大。最新消息顯示，Alphabet的全球債券發行計畫已快要結束，目前規模突破了300億美元，遠高於週一(2月9日)募得的200億美元。 CNBC 10日報導，消息人士透露，Alphabet透過發行英鎊、瑞郎計價的債券，在歐洲市場募到約110億美元。稍早有媒體報導，Alphabet募資總額已接近320億美元。 一名消息人士指出，投資者對這些AI科技巨頭發行的優質債券表現出強勁需求。 甲骨文(Oracle)是第一家測試2026年債市需求的大型科技業者，上週發行了250億美元的債券。消息透露，Facebook母公司Meta Platforms Inc.也準備在2026年上半年進行大規模的債務融資，旨在加速推進全美各地的資料中心建置計畫。 華爾街日報等外電甫於2月9日報導，熟悉詳情的未具名投資者透露，Alphabet計畫發行以美元、英鎊及瑞郎計價的多種期限債券。其中，英鎊債券的到期期限從3年到100年不等，而瑞郎債券則為3~25年。 Alphabet 2月\nMoneydj理財網 ・ 3 天前 ・ 發表留言\n\n《美股》收盤速報：道指再創史高 AI股強強滾！ 【時報-台北電】在科技股上漲帶動下，周一(2月9日)四大指數再度收高，標普500距收盤歷史高點僅差臨門一腳。道指繼上周五首度收盤站在5萬點重大里程碑後再創收盤與盤中新高。由AI晶片熱門股輝達漲2.5%、台積電ADR漲1.88%、博通和超微漲超過3%帶動，費半表現相對亮眼。AI概念股甲骨文大漲9.6%，獲D.A. Davidson以看好OpenAI與其受惠族群為由將其投資評級從中立調升至買進。投資人將關注本周陸續公布的非農就業等重大經濟數據和新一批財報。 ★四大指數 美股道瓊上漲20.20點或0.04%，收50,135.87點。 S&P500上漲32.52點或0.47%，收6,964.82點。 NASDAQ上漲207.46點或0.90%，收23,238.67點。 費城半導體上漲113.96點或1.42%，收8,162.58點。 ★11大類股 科技類股(SPLRCT)漲1.59% 原物料類股(SPLRCM)漲1.44% 能源類股(SPNY)漲0.84% 通訊服務類股(SPLRCL)漲0.80% 房地產類股(SPLRCREC)漲0.59% 工業類股(SPLRCI)漲0.33% 公用事業類股(\n時報資訊 ・ 4 天前 ・ 發表留言\n\nAlphabet發行罕見百年期英鎊債 分析師示警：AI泡沫正在累積 Alphabet首次發行10億英鎊百年期公司債，引發市場高度關注。分析師指出，在信用利差處於歷史低檔、人工智慧（AI）長期需求仍具不確定性、科技變革持續加速的背景下，Alphabet此次發債被視為信貸市場過度樂觀與AI投資泡沫逐步累積的重要訊號，反映產業正進入高風險擴張階段。\n中時財經即時 ・ 1 天前 ・ 發表留言\n\n網路泡沫以來首見！Alphabet挑戰超罕見「百年債」 另將首度進軍英鎊、瑞郎市場 Alphabet(GOOGL-US)計劃在本次大型發債案中，發行超級罕見的「100 年期公司債」，成為自 1990 年代末以來，首家發行如此超長天期債券的科技公司，也凸顯在人工智慧 (AI) 軍備競賽下的融資需求，讓即使是少見的融資工具也開始受青睞。 知情人士指出，這筆 100\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n拚AI資金戰！Alphabet挑戰發行百年債 27年來科技業首見創舉 谷歌母公司 Alphabet(GOOGL-US) 計畫在其大規模債券發行計畫中，推出極為罕見的「百年期債券」，這是自 1990 年代末以來，首次有科技企業挑戰如此長天期的\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n《國際產業》為AI拚了！Alphabet多國發債 極罕見百年債登場 【時報編譯柯婉琇綜合外電報導】谷歌母公司Alphabet周一發行200億美元的美元債後，緊接著又發行了以英鎊和瑞士法郎計價的公司債，且規模都打破兩大市場的歷史紀錄。這加劇投資人對AI龐大的投資與變現困難的擔憂，周二Alphabet股價下跌1.77%，收在318.58美元，盤中一度跌3%。 Alphabet周一宣布發售價值200億美元公司債以支應AI發展，隨後又發行了英鎊債和瑞郎債。其中，英鎊公司債包括一筆極其罕見的100年期債券，是自網路泡沫化以來，科技公司首次發行此類「極長期」債券。 這波債券發行預計總共集資320億美元。 據媒體報導，市場對Alphabet這批債券反應熱絡，其中，美元債獲得超過1000億美元的認購。該美元債年期最長達40年，將於2066年到期。 Alphabet發行的瑞郎債規模改寫了羅氏集團（Roche Holding）的30億瑞郎歷史紀錄。英鎊債共發行55億英鎊，打破由National Grid在2016年創下的30億英鎊紀錄。規模達10億英鎊的百年債，刖獲得近10倍的超額認購。 為了籌集資金發展AI業務，Alphabet的長期負債到2025年已經達到465億美元\n時報資訊 ・ 3 天前 ・ 發表留言\n\nAI衝擊本業！Alphabet首揭廣告業務風險 擬發債200億美元拚AI Alphabet 大舉投入 AI 基礎建設並計畫發債募資 200 億美元，同時首度在財報中警示 AI 可能衝擊廣告與搜尋核心業務。在科技巨頭資本支出全面暴增下，AI 競賽已進入高成本與高風險並存的新階段。\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n《美股》焦點股：OpenAI帶旺 甲骨文飆漲；Alphabet發債 市場熱絡 【時報編譯柯婉琇綜合外電報導】焦點股： ●AI概念股甲骨文周一（2月9日）股價大漲9.64%，收在156.59美元，帶動標普軟體服務股指數終場大漲2.9%，連漲第2日。D.A. Davidson以看好OpenAI與其受惠族群為由，將甲骨文投資評級從「中立」調升至「買進」，並維持180美元目標價。 D.A. Davidson分析師Gil Luria出具報告指出，我們認為市場過度反應，股價已經跌過頭。近幾個月來，OpenAI的商業模式已有顯著進步，「OpenAI似乎已經修正策略失誤，並重新聚焦於核心的前沿模型（frontier models），也開始考慮安插廣告的「變現」模式，「我們認為重整後的OpenAI可望重返Google最大挑戰者的位置」。CNBC報導，OpenAI執行長奧特曼（Sam Altman）上周五告知員工和投資人，ChatGPT的月成長率已重返逾10%。他並透露本周將推出升級版的AI聊天機器人模型。 ●Alphabet漲0.45%，收在324.32美元。據外媒報導，Google母公司Alphabet周一成功發行公司債籌資200億美元，規模超出原訂的150億美元。Alphab\n時報資訊 ・ 3 天前 ・ 1 則留言\n\nAlphabet擴大AI投資 尋求發行150億美元公司債 美媒引述知情者的消息報導，谷歌母公司Alphabet為了在AI競賽中保持優勢，正準備發行投資級美元公司債，籌資約150億美元來擴大AI投資。\n中時財經即時 ・ 4 天前 ・ 發表留言\n\n《國際產業》Alphabet擬發百年期公司債 【時報-台北電】谷歌母公司Alphabet在9日成功發債200億美元，並計劃發行100年期公司債，為1990年代末科網股泡沫以來，首度有科技企業挑戰發行超長期債券。專家認為AI競賽愈發激烈，連這種罕見的融資工具也成為選項，顯示企業希望盡可能向各類型投資人籌資。 Alphabet發債規模高於外界預期的150億美元，認購金額逾1,000億美元。繼甲骨文去年9月發行180億美元債券後，臉書母公司Meta、亞馬遜和Alphabet也持續大舉發債，顯示投資人仍然看好科技業透過舉債來支持其AI擴張。 金融時報引述知情者的消息報導，Alphabet還計劃發行以英鎊計價的3年期到100年期公司債，和以瑞士法郎計價的3年期到25年期公司債。 這兩種貨幣計價的公司債估計最快在10日完成定價，並將是Alphabet首次進入英國和瑞士等債券市場。 Alphabet發行長達百年期的英鎊債引發市場關注，因為自1997年摩托羅拉發行百年債後，首次有科技企業再次挑戰發行百年期債券。 為了在AI軍備競賽中籌集資金，科技巨頭開始採用這種極罕見的融資工具，引發市場對是否重演當年科網股泡沫的擔憂。然而，專家認為Alphabe\n時報資訊 ・ 3 天前 ・ 發表留言\n\n不只200億美元！傳Alphabet發債規模衝破300億美元 AI基建掀資本市場巨浪 Alphabet 正將全球債券融資規模推升至 300 億美元以上，背後是 AI 基礎建設投資暴增至最高 1850 億美元的資金需求。隨著科技巨頭集體投入算力競賽，產業資本結構與現金流模式正快速重塑，市場進入高槓桿 AI 時代。\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n《國際金融》Google破天荒發行「百年債」等不到還錢那天！分析師示警 【時報-台北電】Alphabet首次發行10億英鎊百年期公司債，引發市場高度關注。分析師指出，在信用利差處於歷史低檔、人工智慧（AI）長期需求仍具不確定性、科技變革持續加速的背景下，Alphabet此次發債被視為信貸市場過度樂觀與AI投資泡沫逐步累積的重要訊號，反映產業正進入高風險擴張階段。 本次百年債屬於Alphabet總規模約200億美元的多幣別融資計畫的一部分，涵蓋美元、歐元、英鎊及首次發行的瑞士法郎債券，期限分布廣泛。根據外媒報導，此次10億英鎊百年期債券吸引近10倍超額認購，票面利率較10年期英國公債高出約120個基點。 分析師指出，百年期公司債向來罕見，多由主權國家發行，企業參與比例有限，主要投資人為保險公司與退休基金，用以因應長期負債需求。Alphabet此次進軍英鎊超長天期市場，顯示其積極爭取長期機構資金，同時反映資本市場對AI題材的高度熱情，但同時亦加深外界對泡沫化風險的疑慮。 Wind Shift Capital執行長布萊恩（Bill Blain）指出，Alphabet此次發債，正是目前信貸市場為AI發展而大舉擴張的縮影，其認為，在利差過低、資料中心需求前景未明，以\n時報資訊 ・ 23 小時前 ・ 3 則留言\n\nAlphabet擬發債籌資150億美元 加碼AI投資 《彭博》周一 (9 日) 援引知情人士消息報導，Google 母公司 Alphabet (GOOGL-US)正計畫透過發行美國投資級美元公司債，籌資約 150 億美元，進一步加入人工智慧 (AI) 投資熱潮下，大型科技企業的發債行列。\n鉅亨網 ・ 4 天前 ・ 發表留言\n\nAlphabet擬發百年期公司債 谷歌母公司Alphabet在9日成功發債200億美元，並計劃發行100年期公司債，為1990年代末科網股泡沫以來，首度有科技企業挑戰發行超長期債券。專家認為AI競賽愈發激烈，連這種罕見的融資工具也成為選項，顯示企業希望盡可能向各類型投資人籌資。\n工商時報 ・ 3 天前 ・ 發表留言\n\n買氣超強！Alphabet發債獲超額認購 籌資200億美元超越原定目標 Alphabet(GOOGL-US) 透過發行美元債券籌資 200 億美元，高於最初計劃的 150 億美元，而且根據知情人士透露，這批債券吸引超過 1000 億美元的認購，創下公司債史上最強認購紀錄之一，反映投資人對人工智慧 (AI) 融資的需求殷切。 Alphabet 周一宣\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n台積電逼近2000元還能追？ 外媒曝3理由：像末日般買進 當股價一路刷新歷史高點，投資人往往在「錯過恐懼」與「追高焦慮」之間拉扯。蛇年封關日，台積電（2330）盤中一度觸及1925元，終場收在1915元，再度改寫收盤新高。面對逼近2000元整數關卡的價位，市場開始出現觀望氣氛。\nEBC東森財經新聞 ・ 19 小時前 ・ 11 則留言\n\n美國華爾街主要指數開盤上漲　道瓊漲57.6點 即時中心／綜合報導美國華爾街主要指數今（10）日開盤上漲。投資人也關注零售銷售數據，這也是這週一系列重要經濟數據發布的開端。截稿前，道瓊上漲57.6點，或0.11%，報50,193.49點；標準普爾500漲了9.7點，或 0.14%，報6,974.49點；而納史達克上揚32.6點，或 0.14%，報 23,271.224 點。\n民視財經網 ・ 2 天前 ・ 發表留言\n\nAlphabet發債200億美元搶攻AI擴張！分析師：2026 年企業債恐創新高 Google 母公司 Alphabet 宣布發行 200 億美元高評級公司債，加入 AI 巨頭大舉融資行列。隨著資料中心與運算需求暴增，亞馬遜、微軟、Meta 等超大規模業者資本支出持續攀升，分析師預期 2026 年美國\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n熱門新聞\n1\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 2\n\n13.5億威力彩「2得主」買法一模一樣！ 只花100元就翻身 3\n\n郭台銘大紅包發威！央行新台幣發行額首破4.2兆  年增率飆3年最高 4\n\n「新版新台幣」可能有石虎！票選結果曝光 台積電僅排第七 5\n\n【房地產週報】輝達簽約落腳北士科！29年最大交屋潮來襲！新竹預售屋慘崩82.3%！七大都會區交易量年減7成\n\n你可能會喜歡\n你上車了嗎？記憶體登蛇年狂飆主力　前10猛將全曝光 FTNN新聞網\n\n九大工業公會聯合肯定台美貿易協定 強調為產業注入強心針 民視財經網\n\n春節搭車風險升溫！行車保護傘保障出行　花1元即可享百萬保障 三立新聞網 setn.com\n\n「台灣價值」竟沒台灣之光！大盤飆新高00940卻回不到10元　股民哀號：成敗皆這1檔 鏡週刊Mirror Media\n\n緝捕馬杜洛震驚全球 美軍傳動用AI工具Anthropic Claude 鉅亨網\n\n信義房屋：年前家電、家具換新需求高 今日新聞NOWNEWS\n\n台股拉警報！專家警告美股7巨頭集體翻車：最慘開年行情 中時財經即時\n\n鄭麗君團隊立大功！謝金河曝「台美ART簽署」意義：台灣獲1席珍貴位子 三立新聞網 setn.com\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 工商時報\n\n租屋族省很大！租金補貼減輕4成負擔 女性與25歲以下青年成主力 太報\n\n法人兩樣情！華邦電發說利多連發...目標價上看200元 　保守派「4理由」只喊88元 FTNN新聞網\n\n美股掀AI恐慌交易　台積電ADR挫0.47％ CTWANT\n\n陸客不去日本！外媒爆25萬大軍「改衝這國」 刷爆103億不手軟 中時財經即時\n\n金蛇年「大漲萬點」封關！0050領銜市值型ETF悍漲　近十年含息報酬率高達509% FTNN新聞網\n\n台灣賓士對「台美貿易協議」成功達成表達祝賀 並承諾回饋消費者 民視財經網\n\n外食族吃不消! 海南雞飯漲20元 手搖飲過年期間漲5元 民視財經網影音\n\n砸5億擴產最快Q2釋產能！PCB股華通衝連3漲　當沖爆量破5萬張登當沖王 FTNN新聞網\n\n輝達下跌、AMD上漲 背後關鍵或在Arista 鉅亨網\n\n台美ART簽署》台經院張建一妙喻：台灣付的午餐費 比別人還低 工商時報\n\n美通膨降溫難掩「AI恐慌」! 美股漲跌互見、台積電ADR下跌0.51％ 新頭殼\n\n大研生醫* 公告本公司股票面額由「新台幣10元」變更為「新台幣1元」，公告期間：114年12月22日至115年3月21日。 Moneydj理財網\n\n外資降評唱衰！大咖投顧逆風喊買面板指標大廠「這檔」　最新目標價曝光 FTNN新聞網\n\n春節放假也能追美股！內部數據曝光　過年反而更敢買 三立新聞網 setn.com\n\n記憶體嚴重短缺！美國軍工企業黑名單 移除中國長鑫、長江存儲 自由時報\n\n蘇威元：台積電概念股飆漲密碼 這四指標抓飆股一次賺58% 民視財經網影音\n\n運載指標／港務公司貨櫃量上看1,390萬TEU 今日新聞NOWNEWS\n\n關稅干擾消失加AI助攻　經濟成長率上修至7.71％ 卡優新聞網\n\n台積電ADR13日下跌1.74美元跌幅0.47%折台股2309.39元 中央社財經\n\n到全台最夯紫南宮借發財金　主委莊秋安：心存善念有來有保庇 鏡報\n\n新北房市 新莊幸福路商圈 成家首選 工商時報\n\n台美ART 守住重要農產品防線 工商時報\n\n〈能源盤後〉油價因美通膨趨緩回升 周線仍收黑 鉅亨網\n\n主動式ETF規模破1739億！這檔年化配息率10％　豪配0.377元「年後這天」最後上車日 FTNN新聞網\n\n13家金控1月獲利全公布！國泰金元月大賺146億元　EPS達0.99元登獲利王 FTNN新聞網\n\n美通膨降溫難掩AI隱憂　美股漲跌互見 太報\n\n〈貴金屬盤後〉黃金、白銀回神 CPI重燃降息預期 鉅亨網\n\n傳統軟體股崩跌回五年前！卡爾先生：掌握這兩點才能存活 民視財經網影音\n\n台股資料來源 臺灣證券交易所 、 臺灣期貨交易所 及 財團法人中華民國證券櫃檯買賣中心 ，國際股市資料來源請參考 Yahoo Finance 。台股行情、個股基本資料及財務資訊為精誠資訊提供。使用Yahoo股市服務前，請您詳閱相關 使用規範與聲明 。\n\n服務條款 隱私權 您的隱私權選擇 加州隱私權通知 © 2026 Yahoo. All rights reserved.\n\n1",
      "Language": "zh",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-11",
      "Time": "06:50:00",
      "Source": "Yahoo奇摩股市",
      "Title": "《美股》AI隱憂衝擊財富顧問股、零售軟 那指跌",
      "URL": "https://tw.stock.yahoo.com/news/%E7%BE%8E%E8%82%A1-ai%E9%9A%B1%E6%86%82%E8%A1%9D%E6%93%8A%E8%B2%A1%E5%AF%8C%E9%A1%A7%E5%95%8F%E8%82%A1-%E9%9B%B6%E5%94%AE%E8%BB%9F-%E9%82%A3%E6%8C%87%E8%B7%8C-225000509.html",
      "Content": "MoneyDJ新聞 2026-02-11 06:50:04 郭妍希 發佈\nAI競爭疑慮衝擊財富管理顧問類股，再加上零售銷售表現比預期疲弱、市場靜待其他關鍵經濟數據出爐，美國四大指數10日跌多漲少。\n道瓊工業平均指數2月10日終場上漲0.1%(52.27點)、收50,188.14點，連續第3個交易日創歷史收盤新高。那斯達克指數下跌0.59%(136.2點)、收23,102.47點。標準普爾500指數下跌0.33%(23.01點)、收6,941.81點。費城半導體指數下跌0.68%(55.45點)、收8,107.13點。\n\n最新公布的12月零售銷售報告顯示，消費者支出僅持平、遜於道瓊社調查的經濟學家預估值(月增0.4%)。11月零售銷售額則月增0.6%。零售類股應聲走軟。好市多(Costco)、沃爾瑪(Walmart)分別下挫2.64%、1.8%。\n\n新創科技財富平台Altruist宣布於旗下AI平台「Hazel」推出一項全新的稅務規劃工具，可運用AI「讀取並解讀客戶的1040表(指美國個人所得稅申報表)、薪資單、帳戶對帳單、會議記錄、電子郵件，以及託管機構與CRM (客戶關係管理)系統的數據，在分析中應用稅務邏輯，協助顧問為客戶制定個人化的稅務策略。」\n財富管理顧問商應聲下挫。LPL Financial、嘉信理財(Charles Schwab)、Raymond James Financial分別大跌8.31%、7.42%、8.75%。摩根士丹利(Morgan Stanley、通稱大摩)同步下跌2.45%、收177.89美元。\n標普500通訊服務類股成為表現最弱的族群，主要是受到Google母公司Alphabet Inc.拖累。Alphabet宣布發行了價值200億美元的債券，Class A股聞訊下挫1.77%、收318.58美元。\n其他個股變化方面，雲端基礎建設效能監測軟體商Datadog公布的上季財報擊敗華爾街預期，股價應聲飆漲13.74%、收129.67美元。\n市場關注即將在本週三(11日)公布的1月非農就業報告(因政府最近部分關門而延遲發布)，以及週五的1月消費者物價指數(CPI)。\n芝加哥商業交易所(CME) FedWatch工具顯示，聯邦基金期貨投資人10日預測，聯準會(Fed)要等到6月才會首度降息，屆時正好是美國總統川普(Donald Trump)提名的華許(Kevin Warsh)接掌Fed主席的時候。\n(圖片來源：shutterstock)\n＊編者按：本文僅供參考之用，並不構成要約、招攬或邀請、誘使、任何不論種類或形式之申述或訂立任何建議及推薦，讀者務請運用 個人獨立思考能力，自行作出投資決定，如因相關建議招致損失，概與《精實財經媒體》、編者及作者無涉。\n延伸閱讀：\n《美股》軟體、AI晶片股回神 那指站回100日線\n亞馬遜資本支出將激增50%+Q1營益預估遜 盤後摔\n資料來源- MoneyDJ理財網\n\n檢視留言\n\n相關內容\n《美股》軟體、AI晶片股回神 那指站回100日線 MoneyDJ新聞 2026-02-10 07:04:25 郭妍希 發佈軟體、AI晶片類股回神，激勵那斯達克指數站回100日移動平均線、費城半導體指數同步跳高，但隨著關鍵經濟數據即將出爐、投資人決定謹慎行事，標準普爾500指數終場未能刷新歷史收盤高。 道瓊工業平均指數2月9日終場上漲0.04%(20.20點)、收50,135.87點，連續第2個交易日創歷史收盤新高。那斯達克指數上漲0.9%(207.46點)、收23,238.67點，站回100日移動平均線(23,151.68點)。標準普爾500指數上漲0.47%(32.52點)、收6,964.82點，連續第2個交易日站回50日移動平均線(6,889.66點)。費城半導體指數上漲1.42%(133.96點)、收8,162.58點，創1月29日以來收盤新高。 甲骨文(Oracle)獲DA Davidson分析師Gil Luria將投資評等從「中立」調高至「買進」，股價聞訊強彈9.64%、收156.59美元，創2月2日以來收盤新高。Davidson對甲骨文與OpenAI簽訂的協議感到樂觀，並認為「軟體產業並未消亡」(software isn’\nMoneydj理財網 ・ 4 天前 ・ 發表留言\n\n元富期貨：加權指數上漲621.7點或1.96%，史上第10大單日漲點 【財訊快報／編輯部】美股方面，近來隨著AI、軟體股走弱的AI領頭羊輝達週五(6日)強勢反彈，抵銷亞馬遜的疲弱走勢，美國四大指數週五(6日)全面跳漲，其中道瓊工業平均指數更首度站上5萬點整數關卡，創歷史收盤新高紀錄。標普500十一大類股有9個走揚，資訊科技類股大漲4.1%為領漲族群，其次是工業類股、漲幅來到2.84%。台指方面，受到美股大漲以及日本自民黨大勝選帶動日股暴漲的雙重激勵，台指早盤狂飆近900點，一舉收復32000點整數大關，權值王台積電更是追平歷史天價，扮演攻堅要角，加上記憶體股大反攻。終場成交量6308.8億元，加權指數上漲621.7點、漲幅1.96%、收在32404.62點，為史上第10大單日漲點。綜合分析，台指重新收復所有均線之上，隨著電子權值股回神，封關前蓄勢再戰歷史高點，下方月線為重要多空分水線，跌破之前偏多架構不變。受美國政府關門影響而延宕的1月非農就業與1月消費者物價指數(CPI)將在本週公布。\n財訊快報 ・ 4 天前 ・ 發表留言\n\n法人全員站多 台積電收1915元天價帶台股破頂/AI爸爸降臨北士科 輝達宅行情要噴了？/記憶體面板回魂 玻纖布同步熱炒｜Yahoo財經掃描 AI與科技股近期缺乏明確主流題材帶領，再加上零售銷售表現較預期疲弱，市場靜待其他關鍵經濟數據出爐，使美股投資氣氛轉趨保守。道瓊指數上漲0.10%，連續三日創歷史收盤新高；那斯達克指數下跌0.59%，標普500指數下跌0.33%，費城半導體指數下跌0.68%。盤面上，零售數據疲弱拖累好市多與沃爾瑪走低，而AI財富管理工具題材引發市場重新評價，LPL Financial、嘉信理財等財富顧問股大跌逾7%，Alphabet因發債消息亦承壓；台積電ADR則延續強勢上漲1.83%，連三日創高，反映半導體族群基本面支撐仍在。\n亞股方面，區域市場整體維持偏多格局，日股因建國紀念日休市一天；韓股上漲0.99%，港股上漲0.31%，上證指數小漲，顯示資金情緒仍偏正向但追價力道略為不足。\n回到台股，今（11）日大盤迎向蛇年封關，在權值股帶動下強勢收高，加權指數大漲532.74點、收33,605.71點，再刷新歷史新高，成交金額6,757.96億元，周線同步收紅。權王台積電(2330)盤中一度衝上1925元歷史天價，終場收1915元，成為推升指數最關鍵力量；資金集中電子權值與AI供應鏈，鴻海(2317)、台達電(2308)、聯發科(2454)同步走揚，題材股方面富喬(1815)受納入MSCI小型指數激勵攻上漲停，記憶體族群放量強勢，電子、金融、傳產等輪動盤面熱度，也為蛇年全年行情合計萬點漲幅劃下亮眼句點。\nYahoo財經編輯室 ・ 2 天前 ・ 發表留言\n\n與台積投資掛勾？傳川普將為AI巨頭豁免晶片關稅 MoneyDJ新聞 2026-02-10 11:39:12 郭妍希 發佈市場謠傳，川普政府打算讓亞馬遜(Amazon.com)、Google母公司Alphabet Inc.與微軟(Microsoft Corp.)等企業免受即將實施的晶片關稅影響，以免衝擊AI資料中心的建設熱潮。 英國金融時報9日引述未具名消息人士報導，美國商務部正在規劃，為國內超大規模雲端服務商(hyperscalers)提供關稅豁免(tariff carve-outs)。這些豁免跟台積電(2330)的投資承諾息息相關。 傳聞中的豁免機制顯示，川普政府推行晶片關稅、獎勵本土晶片製造的同時，也為支持美國迅速擴張AI的企業提供些許緩衝，因為這些企業高度仰賴進口的晶片。儘管川普以關稅威脅作為推動美國製造的手段，但至今仍未對進口自台灣的半導體全面實施關稅，以免動搖大型科技公司的供應鏈。 白宮1月曾宣布，準備對晶片進口商課徵「高昂」關稅。然而，新的方案會允許台積電為美國客戶分配下一波關稅的豁免額度，這些額度跟台積電在美國的投資規模掛勾。 這項複雜的計劃旨在促使台積電把更多產能移往美國。透露消息的政府官員表示，上述計畫仍未定案，總\nMoneydj理財網 ・ 3 天前 ・ 發表留言\n\n學術與商業的碰撞？xAI兩天痛失2位共同創辦人 MoneyDJ新聞 2026-02-11 13:46:50 郭妍希 發佈馬斯克(Elon Musk)旗下的人工智慧新創商xAI，在短短兩天內就失去兩名共同創辦人。 CNBC、路透社等外電報導，深具影響力的AI研究人員Jimmy Ba，週二(2月10日)在社交平台X宣布離職，在向馬斯克致謝的同時，也稱他「很感激能從一開始就參與共同創辦行動。」早在Ba離職的前一天，同樣是xAI共同創辦人的Tony Wu也宣布退出xAI。 馬斯克甫於本(2)月稍早確認，太空探索技術公司SpaceX將收購xAI，以創造「最具野心且垂直整合的創新引擎」。 Ba身為多倫多大學教授，是公認推動Grok第4版AI模型關鍵研究的功臣。除了Ba、Wu外，其他離職的共同創辦人還包括Igor Babuschkin、Kyle Kosic和Christian Szegedy。此外，Greg Yang上個月也宣布因要專心對抗萊姆病(Lyme disease)而退居幕後。 英國金融時報先前報導，Ba的辭職，是因為技術團隊內部關係日益緊張。由於馬斯克極力推動公司追趕OpenAI、Anthropic等競爭對手，團隊在面臨提升AI模型性能\nMoneydj理財網 ・ 2 天前 ・ 發表留言\n\n《美債》12月零售銷售不如預期 殖利率全線走跌 MoneyDJ新聞 2026-02-11 07:26:46 李彥瑾 發佈本週市場焦點聚焦美國經濟數據表現。由於最新出爐的12月零售銷售報告不如預期，顯示美國經濟動能似乎出現放緩跡象，引發買盤湧入債市，美債殖利率10日全面走低。 根據CNBC報價，紐約債市10日尾盤時，對聯準會（Fed）貨幣政策較為敏感的2年期公債殖利率略跌逾3個基點至3.452%；10年期公債殖利率滑落逾5個基點至4.141%；30年期公債殖利率也下跌逾5個基點至4.781%。（註：公債價格與殖利率呈現反向走勢。） 美國商務部10日公布12月零售銷售額，為觀察美國內需動能的重要指標。數據顯示，12月零售銷售額與前月持平，明顯低於11月的0.6%增幅，也不及道瓊調查預估的0.4%，原因包括關稅造成物價上漲，使民眾支出趨於保守。 展望本週，還有多項重磅經濟數據陸續揭曉。其中，原定於6日公布的1月非農就業報告，因先前聯邦政府局部停擺而延至11日發布。根據道瓊（Dow Jones）調查，分析師平均預期，1月非農就業人數將較前月增加5.5萬人，增幅略高於12月的5萬人，失業率則可望保持在4.4%的相對穩定水準。 其他關鍵數據包括\nMoneydj理財網 ・ 3 天前 ・ 發表留言\n\n《盤中解析》抱股過年信心不減！ 權王、大盤雙新高 【時報記者葉時安台北報導】周二美股四大指數震盪偏弱，除了道瓊指數連續第三個交易日創新高，科技股巨頭承壓，主要指數跌多漲少，不過在零售銷售數據意外疲弱仍相對穩住。台股封關在即，台股周三開漲13.18點報33086.15點，春節期間市場變數仍多，但市場對抱股過年仍有信心，指數、台積電早盤衝上33661.72點、1925元最高，再度改寫歷史紀錄，分別上漲588.75點、45元，電子、金融、傳產均上揚表態，MSCI全球標準型指數成分股最新季度調整，DRAM雙雄未入榜，華邦電法說利多仍推升股價持續走揚，記憶體熱度未滅，挾帶AI、散熱、邊緣AI均有漲勢。 台股ADR表現，台積電ADR周二續漲1.83%，收在361.91美元，較台北交易溢價21.51%。日月光ADR亦上漲1.53%，然晶圓雙雄不同調，聯電ADR收跌1.39%。周三台積電(2330)股價開高走高，盤中衝上1925元最高，再度改寫歷史紀錄，上漲45元或2.39。聯電(2303)同步走揚，日月光投控(3711)、鴻海(2317)、台達電(2308)等股價更強勁，聯發科(2454)亦震盪拉回平盤。 記憶體熱度不減，即使MSCI公布最新季度調\n時報資訊 ・ 2 天前 ・ 1 則留言\n\n盤點軟體股15強 Palantir/微軟/甲骨文脫穎而出 MoneyDJ新聞 2026-02-11 09:02:38 郭妍希 發佈美國軟體股近來因AI競爭威脅股價直落，分析顯示，甲骨文(Oracle)、微軟(Microsoft)未來兩年營收有望飛快成長，股價目前已來到距吸引力的價位。相較之下，矽谷大數據分析商Palantir Technologies Inc.雖然未來的營收成長態勢極佳，但本益比依舊偏高。 MarketWatch 10日發布分析報導，將LSEG調查中至少有5名分析師追蹤、且2026年與2027年可望呈現獲利狀態的個股篩選出來。在選出的55檔個股中，取其中15檔2025~2027年營收年複合成長率(CAGR)最高的企業。(如下表) 其中，Palantir的2025~2027年營收CAGR高達51.6%，居名單之冠，遠高於標準普爾500指數的7.7%以及標普500資訊科技類股的18.6%。 然而，Palantir以未來12個月每股盈餘預估值計算的前瞻本益比仍多達100.7倍，雖已遠低於2025年12月31日的173.1倍，卻仍明顯超出標普500的22.4倍及標普500資訊科技類股的26.1倍。 不過，William Blair分析\nMoneydj理財網 ・ 3 天前 ・ 發表留言\n\n【美股盤後】收漲 （中央社台北2026年2月10日電）投資人靜待本週另一波企業財報與重要經濟數據之際，美國股市4大指數今天全部收漲，延續了上週末的反彈走勢，其中道瓊指數持續創下新高紀錄。道瓊工業指數小升20.20點或0.04%，收50135.87點。標準普爾500指數上揚32.52點或0.47%，收6964.82點。那斯達克指數揚升207.46點或0.90%，收23238.67點。費城半導體指數攀漲113.96點或1.42%，收8162.58點。\n中央社財經 ・ 4 天前 ・ 發表留言\n\nAstera財報財測優、聘新任財務長 盤後不漲反摔 MoneyDJ新聞 2026-02-11 12:28:23 郭妍希 發佈AI基礎設施高速連接解決方案供應商Astera Labs (ALAB.US)公布的第四季(2025年10-12月)財報結果擊敗華爾街預期，但公司決定聘請新的財務長，盤後股價下殺。 Seeking Alpha、Investor`s Business Daily報導，Astera 10日盤後公布Q4財報：營收較去年同期大增91.8%至2.706億美元；經調整的本業每股盈餘則為0.58美元。根據FactSet調查，分析師原本預測Q4營收、本業每股盈餘為2.496億美元、0.52美元。 Astera執行長Jitendra Mohan透過聲明表示，Q4營收季增17%至創紀錄的2.706億美元，為亮麗的2025年畫下完美句點，全年營收年增率高達115%。 Mohan指出，旗下智慧連結平台(Intelligent Connectivity Platform)商機正持續快速擴張，當中涵蓋了多條產品線、物理介質、規格尺寸，以及適用於標準與客製化應用的各類通訊協定。考慮到強勁的客戶動能與營收機會，Astera正加速研發投資，包括在以色\nMoneydj理財網 ・ 2 天前 ・ 發表留言\n\n元富期貨：蛇年完美封關，全年瘋漲10080點 【財訊快報／編輯部】美股方面，因美國政府局部停擺延期公布的數據顯示，去年12月零售銷售意外停滯，顯示在假期消費旺季尾聲，消費者對經濟成長的支撐力道不如市場原先預期。美國四大指數週二(10日)跌多漲少，標普500和那斯達克指數收黑， 結束連續兩個交易日的上漲，道瓊工業指數則小幅上揚，連續第三個交易日創下收盤新高。台指方面，台指今日呈現開高走高格局，漲勢集中在權值股與高價股，權值王台積電盤中以1925元再創新天價，截至封關日，股價超過千元的個股已達33檔。終場成交量6740.77億元，加權指數上漲532.74點、漲幅1.61%、收在33605.71點，蛇年完美封關，一整年瘋狂上漲10080點。綜合分析，金蛇年封關迎來史上第二長休市期間，在台積電的領軍下，台指回檔空間有限，偏多架構不變，行情可望延續。值得關注的是，受美國政府關門影響而延宕的1月非農就業與1月消費者物價指數(CPI)將在本週陸續公布。\n財訊快報 ・ 2 天前 ・ 發表留言\n\n美零售銷售停滯，美股指數跌多漲少，道瓊小漲52點、那指跌0.59% 【財訊快報／陳孟朔】美國12月零售銷售意外按月持平、遜於市場預期，帶動10年期公債殖利率下探至近一個月低位附近，利率期貨顯示市場對聯準會(Fed)今年降息3次的押注升溫，美股主要股指週二呈現跌多漲少局面；道瓊工業指數高開後，開盤約半小時追高約377點或0.8%至50,513點的日高暨史上新高後，升勢逐級而下，終場只漲約52點或0.1%連續三天破頂。但同日，標普、那指和費半翻空依序跌0.33%、0.59%和0.68%。不過，台積電ADR追高1.83%與道瓊同步連三天破頂。道瓊一度由升轉跌至50,155點的日低，主因市場同時消化地緣政治與政策訊號：川普表示若與伊朗談判無果，正考慮向中東再增派一支航空母艦打擊群；同日克里夫蘭聯準銀行總裁哈瑪克(Beth Hammack)稱利率路徑上行與下移風險大致平衡，政策利率可能在相當長一段時間內維持不變，壓抑風險偏好。紐約股市10日收盤時，道瓊工業指數漲52.27點或0.10%，收在50,188.14點；標普500指數跌23.01點或0.33%，報6,941.81點；那斯達克指數(那指)跌136.20點或0.59%，報23,102.47點。以晶片為主的費\n財訊快報 ・ 3 天前 ・ 發表留言\n\nAlphabet傳發百年債募資、坦承有\"產能過剩\"風險 MoneyDJ新聞 2026-02-10 07:56:44 郭妍希 發佈Google母公司Alphabet Inc.傳出準備發行期限長達一個世紀(100年)的公司債，成為繼甲骨文(Oracle)一週前發行250億美元債券後，今(2026)年第二家透過債市融資的科技巨頭。 華爾街日報、CNBC 9日等外電報導，熟悉詳情的未具名投資者透露，Alphabet計畫發行以美元、英鎊及瑞郎計價的多種期限債券。其中，英鎊債券的到期期限從3年到100年不等，而瑞郎債券則為3~25年。 根據消息，美元債券總發行額將達200億美元，高於原先預期的150億美元。英鎊與瑞郎計價的債券預計週二(2月10日)銷售完畢。 Alphabet、甲骨文是少數幾家開始大舉融資的科技企業，以資助AI基礎建設的龐大投資案。截至2025年3月，Alphabet申報的長期債務還不到110億美元。 值得注意的是，Alphabet重返債市為AI建設融資之際，也坦承AI崛起、基礎建設的大規模投資存在新風險。 Alphabet上週公佈財報時，特地提到AI對核心廣告業務的潛在風險，以及高昂投資承諾導致「產能過剩」(excess capaci\nMoneydj理財網 ・ 4 天前 ・ 發表留言\n\n搶翻？傳谷歌發債額飆破300億美元、Meta想跟進 MoneyDJ新聞 2026-02-11 08:15:40 郭妍希 發佈谷歌(Google)母公司Alphabet Inc.的發債規模愈滾愈大。最新消息顯示，Alphabet的全球債券發行計畫已快要結束，目前規模突破了300億美元，遠高於週一(2月9日)募得的200億美元。 CNBC 10日報導，消息人士透露，Alphabet透過發行英鎊、瑞郎計價的債券，在歐洲市場募到約110億美元。稍早有媒體報導，Alphabet募資總額已接近320億美元。 一名消息人士指出，投資者對這些AI科技巨頭發行的優質債券表現出強勁需求。 甲骨文(Oracle)是第一家測試2026年債市需求的大型科技業者，上週發行了250億美元的債券。消息透露，Facebook母公司Meta Platforms Inc.也準備在2026年上半年進行大規模的債務融資，旨在加速推進全美各地的資料中心建置計畫。 華爾街日報等外電甫於2月9日報導，熟悉詳情的未具名投資者透露，Alphabet計畫發行以美元、英鎊及瑞郎計價的多種期限債券。其中，英鎊債券的到期期限從3年到100年不等，而瑞郎債券則為3~25年。 Alphabet 2月\nMoneydj理財網 ・ 3 天前 ・ 發表留言\n\nSpaceX重心轉往月球 馬斯克高呼：每個人都能去 MoneyDJ新聞 2026-02-10 09:01:29 郭妍希 發佈馬斯克(Elon Musk)週日(2月8日)改口，直指旗下太空探索技術公司SpaceX已把重心轉移到在月球建立一座能「自我成長的城市」(self-growing city)，預計能在不到10年達標。 馬斯克9日透過社交平台X指出，SpaceX已將重心轉到在月球建立一座自我成長型城市，預估有機會在不到10年內完成。相較之下，火星則需耗費20年以上的時間。 馬斯克表示，SpaceX的使命依舊相同：將我們所知的意識與生命延伸至星際。 不過，行星每26個月才對齊一次(單趟航程要花六個月)，只有此時才可能前往火星，而月球則每10天就可發射一次(單程只需兩天)。這意味著，月球城市的完成速度，會比火星快得多。 話雖如此，馬斯克仍表示，SpaceX仍會努力建設火星城市，並在5~7年內展開行動。然而，當前首要任務仍是確保文明的未來，而開發月球的速度確實更快。 馬斯克10日又表示，SpaceX會建立一個讓每個人都可前往月球及火星的系統。「這會超級酷。」 (圖片來源：SpaceX) ＊編者按：本文僅供參考之用，並不構成要約、招攬或邀請、\nMoneydj理財網 ・ 4 天前 ・ 發表留言\n\n盧特尼克嗆銷中條款\"必須遵守\" 輝達終止連二紅 MoneyDJ新聞 2026-02-11 07:41:57 郭妍希 發佈美國商務部長盧特尼克(Howard Lutnick、見圖)強硬表示，輝達(Nvidia Corp.)將第二先進的AI晶片賣給中國時，「絕對要遵守」(must live with)國家的授權規定。 路透社報導，盧特尼克10日在一場聽證會上表示，「授權條款非常詳盡，是我們跟國務院共同制定的，這些條款輝達必須遵守。」被問及是否信任中國會遵守輝達「H200」晶片的使用限制時，他把問題交給美國總統川普(Donald Trump)定奪。 上週曾有消息傳出，輝達尚未同意研議的中國使用限制條款，當中包括「了解你的客戶」(Know-Your-Customer)規定，這項規定確保中國軍方無法取用相關晶片。 川普與中國國家主席習近平去(2025)年10月在南韓達成貿易停火協議後，輝達獲准將AI晶片銷往中國。當初兩國的協議，包括華盛頓當局承諾把「禁止向中國數千家企業出口美國科技」的規定，延遲一年實施。 被問及上述決策時，盧特尼克再度把問題推給川普，表示美國、中國的「複雜關係」都掌握在川普及國務卿手裡。「他們協助並指示我們，我們只是聽令行事\nMoneydj理財網 ・ 3 天前 ・ 發表留言\n\nAI恐改寫傳統財管模式 美券商股集體重挫 MoneyDJ新聞 2026-02-11 08:42:08 李彥瑾 發佈美國券商股10日遭遇賣壓，市場對AI應用的疑慮已從科技股蔓延至金融股。投資人擔心，隨著新興AI科技快速進展，傳統以人力為核心的財富管理生態恐被翻轉，拖累主要券商股價全面下跌。 路透社報導，近年金融產業積極將AI導入客戶服務，美國金融科技新創公司Altruist看準美國報稅制度繁瑣，推出全新AI稅務規劃工具，引發市場揣測，未來AI是否有機會取代人類財務顧問，促使大量資金撤離券商股。 MoneyDJ XQ全球贏家系統報價顯示，2月10日，LPL Financial（LPLA.US）與Raymond James Financial（RJF.US）股價雙雙重挫逾8%；嘉信理財Charles Schwab（SCHW.US）跌幅逾7%；Ameriprise Financial（AMP.US）下挫6.2%；Stifel Financial（SF.US）及 Morgan Stanley（MS.US）也分別走低3.8%、2.5%。 報導指出，Altruist將旗下Hazel AI平台運用於稅務規劃，客戶只需上傳1040表格、薪資明細\nMoneydj理財網 ・ 3 天前 ・ 發表留言\n\n【歐股盤後】互有漲跌 （中央社台北2026年2月11日電）歐洲股市今天大致漲跌互見，投資人正在評估企業財報表現與科技產業前景，並靜待關鍵的經濟數據出爐；同時，美國零售銷售數據表現乏力，也讓投資人態度趨於謹慎。倫敦FTSE 100指數下滑32.39點或0.31%，收報10353.84點。法蘭克福DAX指數下跌27.0點或0.11%，收在24987.85點。巴黎CAC 40指數上漲4.6點或0.06%，收8327.88點。\n中央社財經 ・ 3 天前 ・ 發表留言\n\n對美能源採購重壓天然氣 龔明鑫指不包含買核能設備 台美對等貿易協定今(13)正式簽署，台灣將在2025年至2029年間大幅擴大對美採購規模，項目涵蓋能源、航空與基礎建設等領域預，金額高達848億美元。經濟部長龔明鑫今(13)強調，這筆投資不涵蓋購買核能設備，因為我門市重啟，不須大幅汰換設備與零件。主要是天然氣採購，計畫到 2029 年美國占比提升到25％。\n中時財經即時 ・ 12 小時前 ・ 發表留言\n\n歷史性時刻！中國乘用車出口 新能源車首度比重過半 中國汽車工業協會周三（11 日）發布的數據顯示，1 月汽車出口 68.1 萬輛，年增 44.9%，其中乘用車出口 58.9 萬輛，激增 48.9%，商用車出口 9.3 萬輛，大增 23.6%。\n鉅亨網 ・ 1 天前 ・ 發表留言\n\n熱門新聞\n1\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 2\n\n13.5億威力彩「2得主」買法一模一樣！ 只花100元就翻身 3\n\n郭台銘大紅包發威！央行新台幣發行額首破4.2兆  年增率飆3年最高 4\n\n「新版新台幣」可能有石虎！票選結果曝光 台積電僅排第七 5\n\n【房地產週報】輝達簽約落腳北士科！29年最大交屋潮來襲！新竹預售屋慘崩82.3%！七大都會區交易量年減7成\n\n你可能會喜歡\n你上車了嗎？記憶體登蛇年狂飆主力　前10猛將全曝光 FTNN新聞網\n\n九大工業公會聯合肯定台美貿易協定 強調為產業注入強心針 民視財經網\n\n春節搭車風險升溫！行車保護傘保障出行　花1元即可享百萬保障 三立新聞網 setn.com\n\n「台灣價值」竟沒台灣之光！大盤飆新高00940卻回不到10元　股民哀號：成敗皆這1檔 鏡週刊Mirror Media\n\n外食族吃不消! 海南雞飯漲20元 手搖飲過年期間漲5元 民視財經網影音\n\n緝捕馬杜洛震驚全球 美軍傳動用AI工具Anthropic Claude 鉅亨網\n\n信義房屋：年前家電、家具換新需求高 今日新聞NOWNEWS\n\n台股拉警報！專家警告美股7巨頭集體翻車：最慘開年行情 中時財經即時\n\n鄭麗君團隊立大功！謝金河曝「台美ART簽署」意義：台灣獲1席珍貴位子 三立新聞網 setn.com\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 工商時報\n\n租屋族省很大！租金補貼減輕4成負擔 女性與25歲以下青年成主力 太報\n\n法人兩樣情！華邦電發說利多連發...目標價上看200元 　保守派「4理由」只喊88元 FTNN新聞網\n\n美股掀AI恐慌交易　台積電ADR挫0.47％ CTWANT\n\n陸客不去日本！外媒爆25萬大軍「改衝這國」 刷爆103億不手軟 中時財經即時\n\n金蛇年「大漲萬點」封關！0050領銜市值型ETF悍漲　近十年含息報酬率高達509% FTNN新聞網\n\n台灣賓士對「台美貿易協議」成功達成表達祝賀 並承諾回饋消費者 民視財經網\n\n砸5億擴產最快Q2釋產能！PCB股華通衝連3漲　當沖爆量破5萬張登當沖王 FTNN新聞網\n\n輝達下跌、AMD上漲 背後關鍵或在Arista 鉅亨網\n\n台美ART簽署》台經院張建一妙喻：台灣付的午餐費 比別人還低 工商時報\n\n美通膨降溫難掩「AI恐慌」! 美股漲跌互見、台積電ADR下跌0.51％ 新頭殼\n\n大研生醫* 公告本公司股票面額由「新台幣10元」變更為「新台幣1元」，公告期間：114年12月22日至115年3月21日。 Moneydj理財網\n\n蘇威元：台積電概念股飆漲密碼 這四指標抓飆股一次賺58% 民視財經網影音\n\n外資降評唱衰！大咖投顧逆風喊買面板指標大廠「這檔」　最新目標價曝光 FTNN新聞網\n\n春節放假也能追美股！內部數據曝光　過年反而更敢買 三立新聞網 setn.com\n\n記憶體嚴重短缺！美國軍工企業黑名單 移除中國長鑫、長江存儲 自由時報\n\n運載指標／港務公司貨櫃量上看1,390萬TEU 今日新聞NOWNEWS\n\n關稅干擾消失加AI助攻　經濟成長率上修至7.71％ 卡優新聞網\n\n台積電ADR13日下跌1.74美元跌幅0.47%折台股2309.39元 中央社財經\n\n到全台最夯紫南宮借發財金　主委莊秋安：心存善念有來有保庇 鏡報\n\n新北房市 新莊幸福路商圈 成家首選 工商時報\n\n台美ART 守住重要農產品防線 工商時報\n\n〈能源盤後〉油價因美通膨趨緩回升 周線仍收黑 鉅亨網\n\n主動式ETF規模破1739億！這檔年化配息率10％　豪配0.377元「年後這天」最後上車日 FTNN新聞網\n\n13家金控1月獲利全公布！國泰金元月大賺146億元　EPS達0.99元登獲利王 FTNN新聞網\n\n美通膨降溫難掩AI隱憂　美股漲跌互見 太報\n\n〈貴金屬盤後〉黃金、白銀回神 CPI重燃降息預期 鉅亨網\n\n傳統軟體股崩跌回五年前！卡爾先生：掌握這兩點才能存活 民視財經網影音\n\n台股資料來源 臺灣證券交易所 、 臺灣期貨交易所 及 財團法人中華民國證券櫃檯買賣中心 ，國際股市資料來源請參考 Yahoo Finance 。台股行情、個股基本資料及財務資訊為精誠資訊提供。使用Yahoo股市服務前，請您詳閱相關 使用規範與聲明 。\n\n服務條款 隱私權 您的隱私權選擇 加州隱私權通知 © 2026 Yahoo. All rights reserved.\n\n1",
      "Language": "zh",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-10",
      "Time": "16:03:33",
      "Source": "Yahoo奇摩股市",
      "Title": "週三封關日 要不要抱股過年？群益投顧這樣說",
      "URL": "https://tw.stock.yahoo.com/news/%E9%80%B1%E4%B8%89%E5%B0%81%E9%97%9C%E6%97%A5-%E8%A6%81%E4%B8%8D%E8%A6%81%E6%8A%B1%E8%82%A1%E9%81%8E%E5%B9%B4-%E7%BE%A4%E7%9B%8A%E6%8A%95%E9%A1%A7%E9%80%99%E6%A8%A3%E8%AA%AA-080333255.html",
      "Content": "財經中心／綜合報導\n上週五美股道瓊再創(收盤)歷史新高，美國總統川普將這一里程碑歸功於關稅政策，並預測道瓊指數將在任期結束前衝上”10萬點”。在此同時，今(9)日日股亦飆漲再創歷史新高日本第51屆眾議院選舉結果揭曉，現任首相高市早苗領導的自民黨”大勝”，除鞏固高市政權的統治基礎，(股)市場更普遍解讀為日本經濟結構改革的強力訊號。\n週二台股開高走高，終場上漲668點，指數收在33072點，指數創收盤歷史新高，得益於台積電創下新高紀錄，上漲65元，收在1880元天價。\n\n股市似乎瀰漫樂觀強勢氛圍，但農曆春節長假不確定因素，大盤技術面(周kd值)又處高檔，加上環境(美股)風險估計可能相對過往幾年存較多變數下，今年農曆春節長假前的持股策略，應該更審慎檢視應對。這樣的環境結構所衍生的思維下，本文除針對較多數投資人關切的熱門(電子)概念族群，進行應對建議策略外，主要將針對相對有機會被長假風險趨避需求關注的區塊進行評析，並列出保守型投資人相對可留意的區塊提供投資人操作參考。\n\n群益投顧用KD值提醒交易風險(圖/群益投顧)\n\n群益投顧認為從技術面來看，節前後的疑慮偏高，因此建議可以留意熱門電子概念股族群，其中包括記憶體 和機器人概念股。\n群益投顧表示， 就展望而言，雖然產品漲價趨勢明顯，但一方面波段大漲的股價可謂已相當程度內含未來漲價挹注的預期，加上漲價趨勢會來是否生出供需變數，是誰也不敢完全論斷的，加上技術面基期風險偏高，因此面對長假變數，務須進行多空交易(避險)應對，因此 建議偏空技術面有做頭疑慮的至上(8112)等，偏多受惠三星電子在第一季將NAND快閃記憶體價格大幅上調逾100%，遠超市場原先預期的33%至38%的旺宏(2337)(建議以月線為防守線)等，多空交易應對。\n另外機器人概念股部分，受到科技巨擘輝達與電動車大廠特斯拉執行長(黃仁勳與馬斯克)。不約而同強調”機器人”前景展望的廣闊。 但台股機器人概念股，多數量價結構普遍偏弱勢，折射出台股相關機器人概念，題材炒作成分偏高，實質挹注營運相當有限的”窘迫”狀況。 建議偏多”沾到”機器人概念的新鉅科(3630)、騰輝電子-KY(6672)等，偏空佳能(2374)、所羅門(2359)等，多空交易應對。\n另外對於前陣子火熱的軍工股，群益投顧也提醒，軍工概念的優缺點：優點為政策積極大力偏多無虞，缺點則是面臨立院多數的在野黨阻力明顯，形成題材與實際挹注的未知變數。\n結構多空衝突下，建議偏多長榮航太(2645)、龍德造船(6753)與台船(2208)，偏空中光電(5371)，多空交易應對。\n軍工股多空交戰 投資人留意風險(圖/群益投顧)\n\n[[注意：我們並不確保此資訊的完整性與正確性，投資人應了解，報告中有關未來預測之陳述可能不會實現，因而不應被依賴。而且此報告並非根據特定投資目的或依預定對象之財務狀況所撰寫出來的，因此，此研究報告的目的，既非對投資人於買賣證券、選擇權、期貨或其他證券相關之衍生性商品提供詢價服務，亦非作為進行交易的要約]]\n《民視新聞網》提醒您：內容僅供參考，投資人於決策時應審慎評估風險，並就投資結果自行負責。\n原文出處： 週三封關日 要不要抱股過年？群益投顧這樣說\n更多民視新聞報導\n一月整體出口成長近七成 機械產業成長三成景氣回春？\n台積電1月營收出爐！月增19.8%、年增36.8%\n台股創新高33072！收漲668點「史上第八強」 明封關\n\n檢視留言\n\n相關內容\nAI驅動 台股萬馬奔騰 美國總統川普政府的對等關稅，曾於2025年4月初造成台股由23,000以上高點下挫至18,000點以下。然在大跌之後，股市展現韌性呈現破底翻轉並一路震盪走高，2025年12月31日台灣加權股價指數以28,963點歷史最高封關，全年上漲25.74％，表現亮眼。\n工商時報 ・ 1 天前 ・ 發表留言\n\n《台北股市》AI驅動 台股萬馬奔騰 【時報-台北電】美國總統川普政府的對等關稅，曾於2025年4月初造成台股由23,000以上高點下挫至18,000點以下。然在大跌之後，股市展現韌性呈現破底翻轉並一路震盪走高，2025年12月31日台灣加權股價指數以28,963點歷史最高封關，全年上漲25.74％，表現亮眼。 台股在大跌後反轉走高的主要動力在於美國AI投資挹注經濟增長及企業獲利，並進一步帶動台灣AI供應鏈出貨且一舉將台灣2025年GDP增長率推升至8.63％，創15年新高。展望2026年，全球金融市場關注以下三大變數交錯影響，包括美國期中選舉、美國聯準會主席改選，以及AI技術的加速發展。 首先，美國國會期中選舉預計於2026年11月舉行，將重塑國會的權力結構。如果出現政黨翻轉或分裂政府的局勢，將對稅制改革、基礎建設、科技監管等政策造成轉折。群益認為，為了爭取選票，預期川普政府將採取更多民生優惠及放鬆監管等利多政策，原先施行嚴格的關稅政策也將逐步退縮，有利物價逐步走低。 其次，聯準會主席的改選也備受關注，目前主席鮑爾任期將於2026年5月15日結束，川普也於2026年初任命前美國聯邦準備理事會（Fed）官員華許（Kevin\n時報資訊 ・ 1 天前 ・ 發表留言\n\n台股封關衝上33K！大漲逾200點創高 台積電飆1900元天價 （9:10更新）台股大漲逾200點，衝上33304.35點再創新高，台積電漲20元至1900元，記憶體股華邦電漲近4%。\n中時財經即時 ・ 3 天前 ・ 發表留言\n\n行政院前院長陳冲：促成「現代合縱」的不是蘇秦 而是川普 行政院前院長陳冲11日指出，去年4月2日美國總統川普宣布所謂解放日後，各國尤其是middle power（中等強國），一直期待並苦等美方通知談判，其實這種心態適正踏入所謂連橫的圈套。\n中時財經即時 ・ 2 天前 ・ 發表留言\n\n川普喊道指上10萬點　貝森特：美經濟進入週期性復原 （中央社記者廖漢原紐約2026年02月8日專電）美股道瓊工業指數上週首破5萬點關卡，美國總統川普推文預測任期內將漲至10萬點。財政部長貝森特今天表示，美國經濟已進入週期性循環復原。就業與通膨報告是本週影響美股動態的觀察重點。道瓊工業指數6日收盤首度突破5萬點關卡，美國總統川普（Donald Trump）在個人社媒推文，專家說道指在他任期結束前達到5萬點就算重大表現，但他提早3年完成。川普接連推文，股市創紀錄和美國國家安全都是關稅所驅動，他預測指數卸任前將達到10萬點。美國股市自川普第2任期上任至今，道指漲幅約為15.2%，期間對全球推出對等關稅，導致包括政府公債等美元資產與美元信心下跌，貴金屬價格狂飆，AI人工智慧業者持續引領資金浪潮。美股未來漲幅難以預料，不過道指表現今年超過那斯達克與標普500，顯示美國從科技資通訊到消費零售、金融銀行業均普遍成長。分析師多認為美國經濟週期循環是這波漲幅的主要因素。財政部長貝森特（Scott Bessent）8日在福斯新聞頻道（Fox News）訪問中表示，現在看到的是週期性市場擴張因素，道指因此升至新高，另外代表小型企業的羅素2000指數等都出現新\n中央社財經 ・ 4 天前 ・ 發表留言\n\n《美股掃瞄》AI股領軍 道指再創史高、標普500僅差1步 【時報編譯柯婉琇綜合外電報導】在科技股上漲帶動下，周一(2月9日)四大指數再度收高，標普500指數距離收盤歷史高點僅差臨門一腳。道瓊指數繼上周五首度收盤站在5萬點重大里程碑後再創收盤與盤中新高。由AI晶片熱門股輝達漲2.5%、台積電ADR漲1.88%、博通和超微漲超過3%帶動，費半表現相對亮眼。 投資人將關注本周陸續公布的非農就業等重大經濟數據和新一批財報。 儘管這兩天科技股表現亮眼，但如果本周發布的業績報喜，最近從科技股轉出的輪動仍有可能在本周再度上演。可口可樂和福特汽車將於周二發布季報。 投資人也將關注美國勞工統計局延後於本周三發布的1月就業報告。該關鍵就業數據原本應於上周五發布，但由於政府局部停擺而推遲。市場預估美國1月非農就業增加55,000人。 上周ADP發布的1月民間就業僅增加22,000人，遠不及市場預期。 1月消費者物價指數（CPI）亦因政府停擺而延至本周五公布，市場預估CPI年漲2.5%。 根據芝商所FedWatch工具，目前市場押注聯準會將在6月會議宣告今年的首次降息，屆時美國總統川普提名的聯準會主席人選華許（Kevin Warsh）可能已經就任。 周一收盤，道瓊指\n時報資訊 ・ 4 天前 ・ 發表留言\n\nAI疑慮再起美股跌多漲少 台積電ADR漲超1.8％ AI獲利疑慮再起，美股四大指數今天跌多漲少，道瓊指數收盤上漲52點，連續第三個交易日創新高，坐穩50,000 點之上。台積電ADR漲6.49美元、漲幅1.83％，收361.90美元。\n中時財經即時 ・ 3 天前 ・ 發表留言\n\n【美股盤後】收漲 （中央社台北2026年2月10日電）投資人靜待本週另一波企業財報與重要經濟數據之際，美國股市4大指數今天全部收漲，延續了上週末的反彈走勢，其中道瓊指數持續創下新高紀錄。道瓊工業指數小升20.20點或0.04%，收50135.87點。標準普爾500指數上揚32.52點或0.47%，收6964.82點。那斯達克指數揚升207.46點或0.90%，收23238.67點。費城半導體指數攀漲113.96點或1.42%，收8162.58點。\n中央社財經 ・ 4 天前 ・ 發表留言\n\n南早：4月川習會上　美中擬延長貿易休戰協議1年 （中央社記者張謙香港2026年02月12日電）據報導，美國總統川普預計於4月初訪問中國，屆時他與中國國家主席習近平在北京會面時，美中準備把雙方在韓國達成的貿易休戰協議延長至多1年。南華早報今天在報導中表示，去年10月，美中兩國領導人在韓國釜山舉行雙邊會面後達成了一項暫時休戰協議。此前數月，中美關係持續緊張，雙方曾加徵3位數字的「報復性」關稅，北京方面也宣布全面抵制美國農產品，禁令持續到2025年的大部分時間。此後，中美關係恢復，中國也恢復購買美國大豆。報導引述多名消息人士說，相關官員認為，延長長達數月的非正式諒解是現實及可行的，可以令峰會焦點圍繞著短期經濟成果，包括中國新的採購承諾。據報導，由於越來越擔心能否保住國會多數席位，川普正敦促各方在11月中期選舉前拿出實際成果。上週，川普在與習近平進行了近兩個小時通話後透露，北京正考慮從美國購買更多大豆。報導又引述4位知情人士透露，川普預計於4月初訪問中國；其中兩人表示，最初考慮的抵達日期是3月31日，屆時他將與習近平在4月首週舉行雙邊會晤，而此行維持3天左右。但消息人士說，川普訪問中國的具體時間仍在討論中，因為北京方面正在考慮清明節（4月5\n中央社財經 ・ 1 天前 ・ 發表留言\n\n南華早報：川普可能3/31訪問中國 美中貿易戰休兵延長一年 多名知情人士透露，美國總統川普與中國國家主席習近平預定 4 月初在北京見面，屆時可望拍板將貿易戰休兵延長一年。\n鉅亨網 ・ 1 天前 ・ 1 則留言\n\n川普傳考慮退出美墨加協定 北美貿易局勢再添變數 外媒報導指出，美國總統川普正私下評估退出其首任內簽署的《美墨加協定》（USMCA），並已詢問幕僚為何不應退約。此舉為美、加、墨三國貿易關係投下震撼彈，也讓北美經貿前景增添不確定性。\n中時財經即時 ・ 2 天前 ・ 發表留言\n\n《國際經濟》川普關稅政策大勝！美貿易代表署「雙關po文」讚交易大師 【時報-台北電】美國貿易代表署（USTR）於社群平台X發布最新貼文，引發外界高度關注。該貼文巧妙運用「雙關語」致敬美國總統川普的經典著作，大讚其關稅政策成功讓美國在國際談判中取得優勢，而台美經貿關係迎來重大突破，雙方於華盛頓正式簽署「台美對等貿易協定」（ART）。 美國貿易代表署（USTR）於社群平台X發布最新貼文該貼文巧妙運用「雙關語」致敬美國總統川普的經典著作，大讚其關稅政策成功讓美國在國際談判中取得優勢。川普對此也大方表態，強調正是因為強硬的關稅手段，才讓全球各國紛紛低頭，「同意支付更多錢」。 有趣的是，「對等貿易協定」的英文縮寫正好是「ART」，正好呼應了川普在1987年出版的暢銷書《交易的藝術》（The Art of the Deal）。 在此背景下，台美關稅協議也贏來新突破，在歷經9個月的密集談判後，雙方於華盛頓正式簽署「台美對等貿易協定」（ART）。 這項協定不僅象徵兩國關稅談判圓滿落幕，美國貿易代表葛里爾（Jamieson Greer）更強調，此舉將大幅提升高科技產業的供應鏈韌性。 由行政院副院長鄭麗君與經貿辦總談判代表楊珍妮率領的團隊，本週赴美完成最後一哩路。在鄭麗君\n時報資訊 ・ 23 小時前 ・ 發表留言\n\n《晨間解盤》多方集結！ 封關前拚再戰新高 【時報-台北電】亞馬遜調高資本支出，AI族群回神帶動上周五美股四大指數大漲，道瓊指數史上首次突破5萬點大關，連帶激勵週一台股跳空開高，指數收盤站上所有均線之上。 統一投顧從技術面觀察，週一收量縮帶上影線紅K棒，收盤指數站上所有均線之上，技術指標KD指標即將黃金交叉，RSI指標向上，MACD黑柱狀體縮小，短線上技術面再度轉強，在5日線未跌破前，台股封關前有機會再度挑戰新高。OTC指數收量縮紅K，收盤仍在月線之下，整體技術面表現比加權指數弱。 統一投顧表示，AI代理應用推陳出新，AWS上修資本支出，台灣科技股在AI硬體供應佔有重要地位。財政部公布台灣1月出口連27紅，金額657.7億美元創歷年單月新高，台股昨日收盤站上所有均線，封關前仍有機會再度挑戰新高，基本面加上資金面共振，中長線多頭格局不變。因此欲規劃抱股過農曆年者建議挑選市場認同度高之績優股分批佈局。（編輯：邱致馨）\n時報資訊 ・ 4 天前 ・ 發表留言\n\n川普指習近平年底將訪白宮 對台軍售成關鍵 美國總統川普日前在接受全國廣播公司（NBC）專訪時表示，將在2026年4月前往中國進行國是訪問，而中國國家主席習近平預計年底將赴美進行回訪，屆時將到訪白宮。\n中時財經即時 ・ 4 天前 ・ 發表留言\n\n川普改口護航Nexstar併購案 直言要「擊倒假新聞」對抗ABC、NBC 美國總統川普周六 (7 日) 改口，表態支持全美最大廣播電視營運商 Nexstar Media Group 收購其競爭對手 Tegna 的交易案。這項高達 62 億美元的併購計畫，不僅象徵著地方廣播電視市場的巨大整合，更因川普立場的「180 度大轉彎」而引發輿論沸騰。 去年 1\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n川普祝賀高市早苗勝選：日本人將永遠擁有我堅定的支持 日本眾議院大選落幕，自民黨在高市早苗領導下大勝，取得具歷史意義的三分之二席次。美國總統川普透過社群平台發文祝賀，盛讚高市的選舉決策，並表態支持其「以實力換取和平」的施政路線。\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n川普自豪宣稱美國已進入「川普經濟」！民調卻顯示多數民眾不買單 美國總統川普在接受《NBC》專訪時宣稱，美國已正式進入「川普經濟」時代，並預測 2026 年經濟將更勝以往。不過，最新民調顯示，多數美國民眾對經濟現況仍感不滿，官方數據與川普所稱的經濟成長與投資金額也出現落差，相關說法引\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n市場變數多 南山人壽提解方 全球關稅戰爭、地緣政治風險、各類資產價格持續攀高，讓2026年的投資市場充滿變數，加上美國聯準會主席5月即將換人，新任主席是否加速執行美國總統川普的降息意志，更讓資本市場前景不明，南山人壽2月即於全通路協助保戶以「固定、穩定、確定」方案來因應不確定，針對手中已有美元資產、穩健保守型、偏好美元保單、想兼顧家庭保障與資產傳承、及外貿企業主等五大類客戶，提供解方。\n工商時報 ・ 3 天前 ・ 發表留言\n\n川普將指示五角大樓與燃煤發電廠簽訂合約，重振煤炭行業 【財訊快報／劉敏夫】外電報導指出，美國總統川普將公佈利用政府資金和五角大樓合約來維持美國燃煤發電廠的計畫，試圖推動國內對化石燃料的依賴。白宮官員透露，這項將於週三宣布的計畫將透過行政命令的形式推出，川普指示國防部長海格塞斯(Pete Hegseth)執行，與煤電廠簽訂協議，購買電力以支持軍事行動。以相關計畫尚未公開為由要求匿名的知情官員表示，此舉預計將動用1950年《國防生產法》下的冷戰時期特殊授權，該法賦予白宮廣泛的權力，可以指導私營行業維護國家安全。川普政府也曾在第一個總統任期考慮過類似方法。這位官員表示，總統還將宣布能源部計畫撥款1.75億美元，用於肯塔基州、北卡羅來納州、俄亥俄州、維吉尼亞州和西維吉尼亞州六座燃煤電廠的升級改造。能源部去年宣布了可用資金，並表示此舉旨在提高一些燃煤電廠的效率並延長其營運時間。在川普宣布這些舉措之際，煤炭企業高層主管、採礦商和能源行業領導人將訪問白宮。這些舉措是川普為振興日漸衰落的煤炭行業而採取的最新努力。\n財訊快報 ・ 2 天前 ・ 發表留言\n\n川普：美伊必須達成協議 否則後果「非常慘烈」 美國總統川普週四表示，美國必須與伊朗達成協議，並警告若談判破裂，後果將「非常慘烈」。他並對談判進展表達樂觀，稱美伊之間有望在未來「一個月內」達成協議。\n鉅亨網 ・ 1 天前 ・ 發表留言\n\n熱門新聞\n1\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 2\n\n13.5億威力彩「2得主」買法一模一樣！ 只花100元就翻身 3\n\n郭台銘大紅包發威！央行新台幣發行額首破4.2兆  年增率飆3年最高 4\n\n「新版新台幣」可能有石虎！票選結果曝光 台積電僅排第七 5\n\n【房地產週報】輝達簽約落腳北士科！29年最大交屋潮來襲！新竹預售屋慘崩82.3%！七大都會區交易量年減7成\n\n你可能會喜歡\n你上車了嗎？記憶體登蛇年狂飆主力　前10猛將全曝光 FTNN新聞網\n\n九大工業公會聯合肯定台美貿易協定 強調為產業注入強心針 民視財經網\n\n春節搭車風險升溫！行車保護傘保障出行　花1元即可享百萬保障 三立新聞網 setn.com\n\n「台灣價值」竟沒台灣之光！大盤飆新高00940卻回不到10元　股民哀號：成敗皆這1檔 鏡週刊Mirror Media\n\n緝捕馬杜洛震驚全球 美軍傳動用AI工具Anthropic Claude 鉅亨網\n\n外食族吃不消! 海南雞飯漲20元 手搖飲過年期間漲5元 民視財經網影音\n\n信義房屋：年前家電、家具換新需求高 今日新聞NOWNEWS\n\n台股拉警報！專家警告美股7巨頭集體翻車：最慘開年行情 中時財經即時\n\n鄭麗君團隊立大功！謝金河曝「台美ART簽署」意義：台灣獲1席珍貴位子 三立新聞網 setn.com\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 工商時報\n\n租屋族省很大！租金補貼減輕4成負擔 女性與25歲以下青年成主力 太報\n\n法人兩樣情！華邦電發說利多連發...目標價上看200元 　保守派「4理由」只喊88元 FTNN新聞網\n\n美股掀AI恐慌交易　台積電ADR挫0.47％ CTWANT\n\n陸客不去日本！外媒爆25萬大軍「改衝這國」 刷爆103億不手軟 中時財經即時\n\n金蛇年「大漲萬點」封關！0050領銜市值型ETF悍漲　近十年含息報酬率高達509% FTNN新聞網\n\n台灣賓士對「台美貿易協議」成功達成表達祝賀 並承諾回饋消費者 民視財經網\n\n聯電ADR13日上漲0.13美元漲幅1.26%折台股65.68元 中央社財經\n\n砸5億擴產最快Q2釋產能！PCB股華通衝連3漲　當沖爆量破5萬張登當沖王 FTNN新聞網\n\n輝達下跌、AMD上漲 背後關鍵或在Arista 鉅亨網\n\n美通膨降溫難掩「AI恐慌」! 美股漲跌互見、台積電ADR下跌0.51％ 新頭殼\n\n台美ART簽署》台經院張建一妙喻：台灣付的午餐費 比別人還低 工商時報\n\n大研生醫* 公告本公司股票面額由「新台幣10元」變更為「新台幣1元」，公告期間：114年12月22日至115年3月21日。 Moneydj理財網\n\n外資降評唱衰！大咖投顧逆風喊買面板指標大廠「這檔」　最新目標價曝光 FTNN新聞網\n\n春節放假也能追美股！內部數據曝光　過年反而更敢買 三立新聞網 setn.com\n\n記憶體嚴重短缺！美國軍工企業黑名單 移除中國長鑫、長江存儲 自由時報\n\n運載指標／港務公司貨櫃量上看1,390萬TEU 今日新聞NOWNEWS\n\n關稅干擾消失加AI助攻　經濟成長率上修至7.71％ 卡優新聞網\n\n主動式ETF規模破1739億！這檔年化配息率10％　豪配0.377元「年後這天」最後上車日 FTNN新聞網\n\n到全台最夯紫南宮借發財金　主委莊秋安：心存善念有來有保庇 鏡報\n\n蘇威元：台積電概念股飆漲密碼 這四指標抓飆股一次賺58% 民視財經網影音\n\n新北房市 新莊幸福路商圈 成家首選 工商時報\n\n台美ART 守住重要農產品防線 工商時報\n\n〈能源盤後〉油價因美通膨趨緩回升 周線仍收黑 鉅亨網\n\n13家金控1月獲利全公布！國泰金元月大賺146億元　EPS達0.99元登獲利王 FTNN新聞網\n\n美通膨降溫難掩AI隱憂　美股漲跌互見 太報\n\n〈貴金屬盤後〉黃金、白銀回神 CPI重燃降息預期 鉅亨網\n\n傳統軟體股崩跌回五年前！卡爾先生：掌握這兩點才能存活 民視財經網影音\n\n台股資料來源 臺灣證券交易所 、 臺灣期貨交易所 及 財團法人中華民國證券櫃檯買賣中心 ，國際股市資料來源請參考 Yahoo Finance 。台股行情、個股基本資料及財務資訊為精誠資訊提供。使用Yahoo股市服務前，請您詳閱相關 使用規範與聲明 。\n\n服務條款 隱私權 您的隱私權選擇 加州隱私權通知 © 2026 Yahoo. All rights reserved.\n\n1",
      "Language": "zh",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-10",
      "Time": "11:40:20",
      "Source": "Yahoo奇摩股市",
      "Title": "《美股》分析：科技股大漲 AI兩巨頭救全村 抽腿時間未到？",
      "URL": "https://tw.stock.yahoo.com/news/%E7%BE%8E%E8%82%A1-%E5%88%86%E6%9E%90-%E7%A7%91%E6%8A%80%E8%82%A1%E5%A4%A7%E6%BC%B2-ai%E5%85%A9%E5%B7%A8%E9%A0%AD%E6%95%91%E5%85%A8%E6%9D%91-%E6%8A%BD%E8%85%BF%E6%99%82%E9%96%93%E6%9C%AA%E5%88%B0-034020163.html",
      "Content": "【時報編譯柯婉琇綜合外電報導】美股分析：\n●在談到周一科技股再度大漲時，Truist Advisory Services投資長Keith Lerner表示，除了甲骨文獲D.A. Davidson調升投資評級至買進之外，OpenAI執行長奧特曼（Sam Altman）的發言也帶來提振。Lerner表示，這是一個嚴重超賣的市場，只要有一點點利多消息就能帶來顯著的效果。在上周的拋售中，科技股和軟體股的「橡皮筋被拉伸得太長了」。\n\nCNBC報導，OpenAI執行長奧特曼上周五向員工和投資人表示，ChatGPT的月成長率已重返逾10%。他並透露本周將推出升級版的AI聊天機器人模型。此外，D.A. Davidson以看好OpenAI與其受惠族群為由，將甲骨文投資評級從「中立」調升至「買進」，並維持180美元目標價。\n●CFRA Research首席投資策略師Sam Stovall表示，投資人都在說「好吧，我們經歷了一次強勁的反彈。這種反彈能持續嗎？這是我可能陷入且最終慘輸的事嗎？或者這真的是另一個買進的機會？」。在談到科技股基於獲利預測的前瞻本益比（forward P/E ratio）與過去五年均值相比時，Stovall表示，我們從溢價17%變成了折價8%，你可能會說「哇，這相當不錯，所以也許現在還不是拋售科技股的時候」。\n\n檢視留言\n\n相關內容\nOpenAI本周推升級版聊天模型 ChatGPT用戶月增率恢復10％以上 隨著競爭對手 Anthropic 升級編程工具，OpenAI 面臨的競爭壓力持續加劇，OpenAI 執行長奧特曼（Sam Altman）向員工與投資者表示，OpenAI 正重新展現增長勢頭。\n鉅亨網 ・ 3 天前 ・ 發表留言\n\nChatGPT成長重回雙位數！OpenAI將推升級模型、Codex爆發式成長並啟動廣告測試 在 AI 競爭升溫下，OpenAI 執行長奧特曼透露 ChatGPT 月成長率重回 10% 以上，並將推出升級版聊天模型。程式開發工具 Codex 近一周成長約 50%，正蠶食 Claude Code 市占；同時 Ope\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n奧特曼：ChatGPT用戶月增率恢復10％以上 本周推升級版聊天模型 面對Anthropic推出的AI工具來勢洶洶，OpenAI創辦人奧特曼表示，聊天機器人ChatGPT每月活躍用戶數恢復10％以上的成長率，本周也將推出升級版聊天模型，意在向員工與投資人展示，OpenAI重拾成長動能。\n中時財經即時 ・ 4 天前 ・ 發表留言\n\nChatGPT本周上線廣告！奧特曼食言引爭議 專家：凸顯OpenAI商業化焦慮與財務黑洞壓力 兩年前，OpenAI 執行長奧特曼在哈佛演講中明確反對 ChatGPT 植入廣告，稱此舉將摧毀用戶信任，直言「廣告是最後不得已的選擇」，但本周正式啟動聊天機器人廣告測試，與其創辦人的承諾背道而馳。這場策略轉向背後是 OpenAI 面臨的千億級財務黑洞與商業化焦慮。 為支撐 Ch\n鉅亨網 ・ 1 天前 ・ 發表留言\n\n《美股》焦點股：OpenAI帶旺 甲骨文飆漲；Alphabet發債 市場熱絡 【時報編譯柯婉琇綜合外電報導】焦點股： ●AI概念股甲骨文周一（2月9日）股價大漲9.64%，收在156.59美元，帶動標普軟體服務股指數終場大漲2.9%，連漲第2日。D.A. Davidson以看好OpenAI與其受惠族群為由，將甲骨文投資評級從「中立」調升至「買進」，並維持180美元目標價。 D.A. Davidson分析師Gil Luria出具報告指出，我們認為市場過度反應，股價已經跌過頭。近幾個月來，OpenAI的商業模式已有顯著進步，「OpenAI似乎已經修正策略失誤，並重新聚焦於核心的前沿模型（frontier models），也開始考慮安插廣告的「變現」模式，「我們認為重整後的OpenAI可望重返Google最大挑戰者的位置」。CNBC報導，OpenAI執行長奧特曼（Sam Altman）上周五告知員工和投資人，ChatGPT的月成長率已重返逾10%。他並透露本周將推出升級版的AI聊天機器人模型。 ●Alphabet漲0.45%，收在324.32美元。據外媒報導，Google母公司Alphabet周一成功發行公司債籌資200億美元，規模超出原訂的150億美元。Alphab\n時報資訊 ・ 3 天前 ・ 1 則留言\n\n年終5.8個月卻不開心！「摸魚同事領6.2個月」她超氣 上班族最期待的就是揭曉年終獎金。有網友表示，今年年終領到5.8個月看似不錯，但發現另一名很混的同事年終竟高達6.2個月，瞬間開心不起來，打算「存夠錢就跳槽」。\nEBC東森財經新聞 ・ 1 天前 ・ 1 則留言\n\n《國際經濟》關稅讓美國人苦哈哈？川普愛將用神邏輯反駁 【時報編譯柯婉琇綜合外電報導】聯準會理事米蘭（Stephen Miran）周一表示，數據顯示美國人並沒有受到關稅衝擊。川普政府的貿易關稅政策已經證明比許多人所擔心的要溫和。外國人和他們的公司才是主要為關稅上漲買單的人，而不是美國人。 不過，米蘭的言論似乎與數據相互矛盾。數據顯示支付關稅的負擔落在美國人身上。 周一，在波士頓大學Questrom商學院發表演說時，米蘭表示，我認為在一些議題上，世界已經逐漸認同我的方向。他特別提到了關稅及其對經濟的影響，並表示一年前，當川普的第二任期剛開始時，大家都擔心大幅提高進口稅會打擊美國經濟。我認為許多專家隨著時間逐漸認同了我的觀點，並認為關稅對經濟的影響「相當有限」。 米蘭也反駁經濟學界普遍存在的觀點：關稅推升物價，進而由美國民眾承擔，而非由出口國犧牲利潤來承擔。 去年底，美國總統川普曾經承認，由於他提高關稅，美國人正面臨物價上漲，雖然這項政策總體而言對美國經濟是有利的，但我認為「美國人可能得付出一些代價」。 聯準會曾表示，2026年通膨率將超過2%目標，大多是因為關稅壓力。 耶魯預算實驗室（Yale Budget Lab）上個月底出具報告指出，每戶\n時報資訊 ・ 3 天前 ・ 發表留言\n\n鬆綁美豬牛 政院提4不變 作為本次台美對等貿易協定最爭議的部分，鬆綁嚴守20年的美豬美牛，預計成為未來國會朝野審議協定的焦點。不過行政院表示，將以「四不變」捍衛國民健康，以科學實證、對齊國際標準方式管理美豬牛進口。\n工商時報 ・ 5 小時前 ・ 發表留言\n\n福壽1月營收達12.72億元 洪堯昆看今年穀物價格持平往上 福壽10日公布1月營收達12.72億元，較去年同期成長7.89%；福壽董事長洪堯昆表示，主要是去年同期基期相對低所致，他對今年穀物價格表示，應會比去年好。\n中時財經即時 ・ 3 天前 ・ 發表留言\n\n《國際產業》OpenAI控訴DeepSeek 竊取模型訓練AI 【時報編譯張朝欽綜合外電報導】OpenAI對美國國會議員警告說，中國的DeepSeek正在瞄準OpenAI以及美國其它頂尖的AI公司，複製他們的模型，並且用於自己的訓練。 OpenAI執行長奧特曼(Sam Altman)指責DeepSeek：「持續地努力利用OpenAI和其它美國尖端實驗室開發的能量」。 DeepSeek這種被稱為「蒸餾」的技術，涉及到使用更成熟和強大的舊AI模型，來評估新模型答案的品質，並有效地轉移舊模型的學習過程。 OpenAI在週四發給美國眾議院一個特別委員會的備忘錄，指出DeepSeek員工相關的帳戶正在開發能繞過OpenAI訪問限制和訪問模型的方法，主要是透過混淆的第三方路由器和其它可以掩蓋來源的方式，來迴避訪問限制。 OpenAI說，DeepSeek的員工開發了代碼，以便獲取美國AI模型的訪問，並獲取了輸出結果。 DeepSeek是在2025年初推出了AI模型，足以媲美美國最好的產品，當時也震撼了市場，認為無需使用先進的AI晶片，僅在AI模型的進步，也可以推理出優異的成果。 OpenAI說，公司會主動移除那些似乎試圖提取模型、以便開發出競爭模型的用戶。\n時報資訊 ・ 18 小時前 ・ 發表留言\n\n韓國加密貨幣交易所Bithumb曝系統漏洞，上週出現400億美元錯誤轉帳 【財訊快報／劉敏夫】外電報導指出，韓國加密貨幣交易所Bithumb週三表示，其內部系統存在嚴重漏洞，易遭受潛在破壞，且未能阻止上週發生的逾400億美元資產錯誤轉帳事件。Bithumb這家韓國第二大虛擬資產交易所表示，在一次推廣活動中，平台誤向用戶發放了約62萬枚比特幣，而非原本的62萬韓元(426美元)，此舉導致比特幣價格暴跌17%。Bithumb首席執行長Lee Jae-won表示，此次誤發的資產規模相當於該交易所持有量(4.2萬枚比特幣)的15倍。主要原因是交易處理存在約24小時的延遲，導致虛擬資產餘額更新被延後。Lee Jae-won就該事件舉行的國會聽證會上表示，我們深刻意識到內部系統管控存在缺陷。交易所原本用於核對轉帳金額與實際持有資產量的風控機制失效，且涉事資金也未劃入獨立帳戶以保障交易安全。監管機構表示，Bithumb已追回大部分比特幣，但在交易所凍結收款用戶帳戶前的幾分鐘內，已有1,786枚比特幣被售出。售出這些比特幣的用戶在法律上有義務返還所得。韓國國會議員對政府及企業在虛擬資產市場的監管失職表示失望。按交易量計算，韓國是全球虛擬資產交易最活躍的市場之一。金融監督院(\n財訊快報 ・ 2 天前 ・ 發表留言\n\n福壽董座估今年穀物平穩向上有利營運，美肉品零關稅若擴及雞豬衝擊大 【財訊快報／記者劉居全報導】福壽(1219)去(2025)年合併營收144.08億元，年增0.44%；今(2026)年1月合併營收12.71億元，年增7.89%；展望今(2026)年，福壽董事長洪堯昆表示，今年穀物價格應會比去年好，今年需求應會較高，戰爭應會較少，國際穀物價格應該有機會平穩往上，穀物價格若平穩向上對福壽營運較好，因為漲的時候對於庫存有利，跌的時候則對庫存不利。至於市場傳出政府可能開放美國牛絞肉及內臟進口零關稅，洪堯昆表示，台灣本身牛肉不多，影響還好，不過如果開放雞肉或豬肉影響衝擊會很大；目前台灣已經很多進口豬肉，包含西班牙伊比利豬、巴拉圭進口的豬肉，進口雞隻只有從美國來，未來若再開放其他國家衝擊將更大。針對穀物價格，洪堯昆開玩笑表示，神仙難斷五穀價，福壽總經理趙文強表示，飼料跟原物料有關，不是單方面能決定，以去年12月飼料為例，為反應國際大宗原物料上漲宣布每公斤調漲0.5元，不過最終每公斤只成功調漲0.3元。至於今年是否還會再調漲價格？趙文強表示，要看大宗物資怎麼走，若中國大陸採購多可能會帶動價格向上。至於外傳政府可能開放美國牛絞肉及內臟進口零關稅，洪堯昆表示，台灣人食\n財訊快報 ・ 3 天前 ・ 發表留言\n\n《國際政治》烏軍無人機重創伏爾加格勒煉油廠 俄反擊導致烏南斷水電 【時報編譯張朝欽綜合外電報導】俄羅斯南部地區的首長在周五表示，烏克蘭無人機攻擊了俄國南部、靠近哈薩克的伏爾加格勒(Volgograd)地區的民用住宅和工業設施，導致多人受傷。 由於在美國斡旋之下的和平談判沒有取得實際的成果，烏克蘭和俄羅斯雙方開始加強了無人機攻擊力度。 烏克蘭官員也反擊表示，俄羅斯在週四夜間向烏克蘭發射了無人機和彈道飛彈，攻擊了烏克蘭的能源系統，導致首都基輔、第聶伯羅(Dnipro)地區的部分城市，以及奧德薩市(Odesa)數以萬計的人斷暖、斷電、斷水。 伏爾加格勒地區的州長Andrei Bocharov在社群媒體Telegram上表示，伏爾加格勒和附近地區有許多民房和汽車遭到破壞，有3個人被送往醫院。 他還表示，無人機攻擊了市區以及該地區的一些工業設施。但他沒有透露細節。 據產業界消息人士透露，俄羅斯盧克石油(Lukoil)旗下的伏爾加格勒煉油廠，在烏克蘭攻擊下發生火災，該煉油廠並於週三暫停營運。\n時報資訊 ・ 18 小時前 ・ 發表留言\n\n南韓政府調查酷澎用戶個資外洩：資安漏洞須全面修補 南韓政府公布調查指出，電商巨頭酷澎（Coupang）因身分驗證系統存在漏洞，導致多達 3,370 萬名用戶個資外洩，涉案者為一名前資深工程師。官方並指控酷澎延遲通報、違反資訊網路法，恐面臨高額罰款，事件也升高南韓與美國間\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n去年總稅收3.79兆元 創歷年新高 財政部11日表示，加計遞延入帳稅款後，上修114年全國總稅收實徵淨額至3兆7,879億元、續創歷年新高水準，但仍較預算數短少143億元，達成率99.6%，包括營所稅、貨物稅、土增稅均低於預算數，證交稅、遺產稅則高出預算數逾百億元。\n中時財經即時 ・ 2 天前 ・ 發表留言\n\nECB管委Simkus稱下一步升息或降息機率均等，風險平衡隨時可能變化 【財訊快報／劉敏夫】外電報導指出，歐洲央行管理委員會成員Gediminas Simkus表示，政策制定者下一步行動在升息或降息方面的機率均等。Simkus週一在維爾紐斯(Vilnius)像媒體表示，經濟成長接近潛在水準，但風險平衡隨時可能發生變化。在當前不確定的國際地緣政治環境下，必須做好因應任何情況的準備。目前升息或降息的可能性相同，各有一半。Simkus還表示，經濟正處於一種微妙的平衡狀態，我們現在正在努力維持這種平衡。經濟接近潛在水準，我們正處於中性利率水準。如果沒有意外情況發生，我們將繼續按照預測的路線前進。關於歐元，Simkus表示，他不認為我們會因為歐元升值而必須做出決定。\n財訊快報 ・ 4 天前 ・ 發表留言\n\n美光大漲近10% HBM4晶片已進入高量產階段、向客戶出貨 美光 (MU-US) 周三 (12 日) 收盤大漲近 10%，高層表示近期疑慮，表示 HBM4 晶片已經進入高量產階段，而且已向客戶出貨，比去年 12 月所估的時間表提早了一季。 美光財務長 Mark Murphy 表示，有關高頻寬記憶體 (HBM) 的報導不正確，他說：「我們\n鉅亨網 ・ 2 天前 ・ 發表留言\n\n對美能源採購重壓天然氣 龔明鑫指不包含買核能設備 台美對等貿易協定今(13)正式簽署，台灣將在2025年至2029年間大幅擴大對美採購規模，項目涵蓋能源、航空與基礎建設等領域預，金額高達848億美元。經濟部長龔明鑫今(13)強調，這筆投資不涵蓋購買核能設備，因為我門市重啟，不須大幅汰換設備與零件。主要是天然氣採購，計畫到 2029 年美國占比提升到25％。\n中時財經即時 ・ 12 小時前 ・ 發表留言\n\n歷史性時刻！中國乘用車出口 新能源車首度比重過半 中國汽車工業協會周三（11 日）發布的數據顯示，1 月汽車出口 68.1 萬輛，年增 44.9%，其中乘用車出口 58.9 萬輛，激增 48.9%，商用車出口 9.3 萬輛，大增 23.6%。\n鉅亨網 ・ 1 天前 ・ 發表留言\n\n過年紅包「14大禁忌」！ 包對旺人旺己 包錯恐破財 紅色象徵強盛活力、開心愉快、喜氣與好運，包紅包是華人新年的一種習俗，華人喜愛紅色，紅包裡面的錢除了讓人開心，同時也有祝福喜事臨門，旺財好運到，發財富貴的意思，但有些禁忌、禮俗，避免破財，甚至旺財方法您一定要知道！社團法人台中市名門命理教育協會創會理事長楊登嵙整理過年紅包「14大禁忌」，包對能旺財，包錯恐破財，一定要當心！\nEBC東森財經新聞 ・ 1 天前 ・ 發表留言\n\n熱門新聞\n1\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 2\n\n13.5億威力彩「2得主」買法一模一樣！ 只花100元就翻身 3\n\n郭台銘大紅包發威！央行新台幣發行額首破4.2兆  年增率飆3年最高 4\n\n「新版新台幣」可能有石虎！票選結果曝光 台積電僅排第七 5\n\n【房地產週報】輝達簽約落腳北士科！29年最大交屋潮來襲！新竹預售屋慘崩82.3%！七大都會區交易量年減7成\n\n你可能會喜歡\n你上車了嗎？記憶體登蛇年狂飆主力　前10猛將全曝光 FTNN新聞網\n\n九大工業公會聯合肯定台美貿易協定 強調為產業注入強心針 民視財經網\n\n春節搭車風險升溫！行車保護傘保障出行　花1元即可享百萬保障 三立新聞網 setn.com\n\n「台灣價值」竟沒台灣之光！大盤飆新高00940卻回不到10元　股民哀號：成敗皆這1檔 鏡週刊Mirror Media\n\n緝捕馬杜洛震驚全球 美軍傳動用AI工具Anthropic Claude 鉅亨網\n\n信義房屋：年前家電、家具換新需求高 今日新聞NOWNEWS\n\n台股拉警報！專家警告美股7巨頭集體翻車：最慘開年行情 中時財經即時\n\n鄭麗君團隊立大功！謝金河曝「台美ART簽署」意義：台灣獲1席珍貴位子 三立新聞網 setn.com\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 工商時報\n\n租屋族省很大！租金補貼減輕4成負擔 女性與25歲以下青年成主力 太報\n\n慕尼黑安全會議 盧比奧、王毅場邊會談 鉅亨網\n\n美股掀AI恐慌交易　台積電ADR挫0.47％ CTWANT\n\n法人兩樣情！華邦電發說利多連發...目標價上看200元 　保守派「4理由」只喊88元 FTNN新聞網\n\n外食族吃不消! 海南雞飯漲20元 手搖飲過年期間漲5元 民視財經網影音\n\n陸客不去日本！外媒爆25萬大軍「改衝這國」 刷爆103億不手軟 中時財經即時\n\n金蛇年「大漲萬點」封關！0050領銜市值型ETF悍漲　近十年含息報酬率高達509% FTNN新聞網\n\n台灣賓士對「台美貿易協議」成功達成表達祝賀 並承諾回饋消費者 民視財經網\n\n砸5億擴產最快Q2釋產能！PCB股華通衝連3漲　當沖爆量破5萬張登當沖王 FTNN新聞網\n\n聯電ADR13日上漲0.13美元漲幅1.26%折台股65.68元 中央社財經\n\n輝達下跌、AMD上漲 背後關鍵或在Arista 鉅亨網\n\n美通膨降溫難掩「AI恐慌」! 美股漲跌互見、台積電ADR下跌0.51％ 新頭殼\n\n台美ART簽署》台經院張建一妙喻：台灣付的午餐費 比別人還低 工商時報\n\n外資降評唱衰！大咖投顧逆風喊買面板指標大廠「這檔」　最新目標價曝光 FTNN新聞網\n\n大研生醫* 公告本公司股票面額由「新台幣10元」變更為「新台幣1元」，公告期間：114年12月22日至115年3月21日。 Moneydj理財網\n\n春節放假也能追美股！內部數據曝光　過年反而更敢買 三立新聞網 setn.com\n\n記憶體嚴重短缺！美國軍工企業黑名單 移除中國長鑫、長江存儲 自由時報\n\n蘇威元：台積電概念股飆漲密碼 這四指標抓飆股一次賺58% 民視財經網影音\n\n運載指標／港務公司貨櫃量上看1,390萬TEU 今日新聞NOWNEWS\n\n主動式ETF規模破1739億！這檔年化配息率10％　豪配0.377元「年後這天」最後上車日 FTNN新聞網\n\n關稅干擾消失加AI助攻　經濟成長率上修至7.71％ 卡優新聞網\n\n到全台最夯紫南宮借發財金　主委莊秋安：心存善念有來有保庇 鏡報\n\n新北房市 新莊幸福路商圈 成家首選 工商時報\n\n〈能源盤後〉油價因美通膨趨緩回升 周線仍收黑 鉅亨網\n\n13家金控1月獲利全公布！國泰金元月大賺146億元　EPS達0.99元登獲利王 FTNN新聞網\n\n美通膨降溫難掩AI隱憂　美股漲跌互見 太報\n\n〈貴金屬盤後〉黃金、白銀回神 CPI重燃降息預期 鉅亨網\n\n傳統軟體股崩跌回五年前！卡爾先生：掌握這兩點才能存活 民視財經網影音\n\n台股資料來源 臺灣證券交易所 、 臺灣期貨交易所 及 財團法人中華民國證券櫃檯買賣中心 ，國際股市資料來源請參考 Yahoo Finance 。台股行情、個股基本資料及財務資訊為精誠資訊提供。使用Yahoo股市服務前，請您詳閱相關 使用規範與聲明 。\n\n服務條款 隱私權 您的隱私權選擇 加州隱私權通知 © 2026 Yahoo. All rights reserved.\n\n1",
      "Language": "zh",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-10",
      "Time": "11:16:36",
      "Source": "Yahoo奇摩股市",
      "Title": "《美股》焦點股：OpenAI帶旺 甲骨文飆漲；Alphabet發債 市場熱絡",
      "URL": "https://tw.stock.yahoo.com/news/%E7%BE%8E%E8%82%A1-%E7%84%A6%E9%BB%9E%E8%82%A1-openai%E5%B8%B6%E6%97%BA-%E7%94%B2%E9%AA%A8%E6%96%87%E9%A3%86%E6%BC%B2-alphabet%E7%99%BC%E5%82%B5-031636638.html",
      "Content": "【時報編譯柯婉琇綜合外電報導】焦點股：\n●AI概念股甲骨文周一（2月9日）股價大漲9.64%，收在156.59美元，帶動標普軟體服務股指數終場大漲2.9%，連漲第2日。D.A. Davidson以看好OpenAI與其受惠族群為由，將甲骨文投資評級從「中立」調升至「買進」，並維持180美元目標價。\nD.A. Davidson分析師Gil Luria出具報告指出，我們認為市場過度反應，股價已經跌過頭。近幾個月來，OpenAI的商業模式已有顯著進步，「OpenAI似乎已經修正策略失誤，並重新聚焦於核心的前沿模型（frontier models），也開始考慮安插廣告的「變現」模式，「我們認為重整後的OpenAI可望重返Google最大挑戰者的位置」。CNBC報導，OpenAI執行長奧特曼（Sam Altman）上周五告知員工和投資人，ChatGPT的月成長率已重返逾10%。他並透露本周將推出升級版的AI聊天機器人模型。\n\n●Alphabet漲0.45%，收在324.32美元。據外媒報導，Google母公司Alphabet周一成功發行公司債籌資200億美元，規模超出原訂的150億美元。Alphabet此次發債吸引超過1000億美元認購，成為史上企業債發行需求最強勁的交易之一，顯示對於科技巨頭舉債發展AI，市場目前仍然樂意買單。分析師表示，這可能帶動今年企業債發行規模創下歷史新高。\n\n●Waters Corp周一崩跌13.94%，收在328.14美元，在醫療保健成分股中跌幅最大。該實驗室設備製造商第一季獲利預測不如市場預期，此外，投資人也關注去年收購的Becton Dickinson表現疲弱。\n●Hims & Hers Health暴跌16%，為連跌第七天。諾和諾德（Novo Nordisk）以侵犯專利權為由向這家遠距醫療（telehealth）公司提起告訴。此前，在美國食藥管理局（FDA）強烈反對下，Hims & Hers Health在推出僅48小時後後又立即下架一款售價僅49美元的諾和諾德減肥藥Wegovy仿製藥。\n\n檢視留言\n\n相關內容\nAlphabet傳發百年債募資、坦承有\"產能過剩\"風險 MoneyDJ新聞 2026-02-10 07:56:44 郭妍希 發佈Google母公司Alphabet Inc.傳出準備發行期限長達一個世紀(100年)的公司債，成為繼甲骨文(Oracle)一週前發行250億美元債券後，今(2026)年第二家透過債市融資的科技巨頭。 華爾街日報、CNBC 9日等外電報導，熟悉詳情的未具名投資者透露，Alphabet計畫發行以美元、英鎊及瑞郎計價的多種期限債券。其中，英鎊債券的到期期限從3年到100年不等，而瑞郎債券則為3~25年。 根據消息，美元債券總發行額將達200億美元，高於原先預期的150億美元。英鎊與瑞郎計價的債券預計週二(2月10日)銷售完畢。 Alphabet、甲骨文是少數幾家開始大舉融資的科技企業，以資助AI基礎建設的龐大投資案。截至2025年3月，Alphabet申報的長期債務還不到110億美元。 值得注意的是，Alphabet重返債市為AI建設融資之際，也坦承AI崛起、基礎建設的大規模投資存在新風險。 Alphabet上週公佈財報時，特地提到AI對核心廣告業務的潛在風險，以及高昂投資承諾導致「產能過剩」(excess capaci\nMoneydj理財網 ・ 4 天前 ・ 發表留言\n\n搶翻？傳谷歌發債額飆破300億美元、Meta想跟進 MoneyDJ新聞 2026-02-11 08:15:40 郭妍希 發佈谷歌(Google)母公司Alphabet Inc.的發債規模愈滾愈大。最新消息顯示，Alphabet的全球債券發行計畫已快要結束，目前規模突破了300億美元，遠高於週一(2月9日)募得的200億美元。 CNBC 10日報導，消息人士透露，Alphabet透過發行英鎊、瑞郎計價的債券，在歐洲市場募到約110億美元。稍早有媒體報導，Alphabet募資總額已接近320億美元。 一名消息人士指出，投資者對這些AI科技巨頭發行的優質債券表現出強勁需求。 甲骨文(Oracle)是第一家測試2026年債市需求的大型科技業者，上週發行了250億美元的債券。消息透露，Facebook母公司Meta Platforms Inc.也準備在2026年上半年進行大規模的債務融資，旨在加速推進全美各地的資料中心建置計畫。 華爾街日報等外電甫於2月9日報導，熟悉詳情的未具名投資者透露，Alphabet計畫發行以美元、英鎊及瑞郎計價的多種期限債券。其中，英鎊債券的到期期限從3年到100年不等，而瑞郎債券則為3~25年。 Alphabet 2月\nMoneydj理財網 ・ 3 天前 ・ 發表留言\n\n拚AI資金戰！Alphabet挑戰發行百年債 27年來科技業首見創舉 谷歌母公司 Alphabet(GOOGL-US) 計畫在其大規模債券發行計畫中，推出極為罕見的「百年期債券」，這是自 1990 年代末以來，首次有科技企業挑戰如此長天期的\n鉅亨網 ・ 3 天前 ・ 發表留言\n\nAlphabet發行罕見百年期英鎊債 分析師示警：AI泡沫正在累積 Alphabet首次發行10億英鎊百年期公司債，引發市場高度關注。分析師指出，在信用利差處於歷史低檔、人工智慧（AI）長期需求仍具不確定性、科技變革持續加速的背景下，Alphabet此次發債被視為信貸市場過度樂觀與AI投資泡沫逐步累積的重要訊號，反映產業正進入高風險擴張階段。\n中時財經即時 ・ 1 天前 ・ 發表留言\n\n網路泡沫以來首見！Alphabet挑戰超罕見「百年債」 另將首度進軍英鎊、瑞郎市場 Alphabet(GOOGL-US)計劃在本次大型發債案中，發行超級罕見的「100 年期公司債」，成為自 1990 年代末以來，首家發行如此超長天期債券的科技公司，也凸顯在人工智慧 (AI) 軍備競賽下的融資需求，讓即使是少見的融資工具也開始受青睞。 知情人士指出，這筆 100\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n《國際產業》為AI拚了！Alphabet多國發債 極罕見百年債登場 【時報編譯柯婉琇綜合外電報導】谷歌母公司Alphabet周一發行200億美元的美元債後，緊接著又發行了以英鎊和瑞士法郎計價的公司債，且規模都打破兩大市場的歷史紀錄。這加劇投資人對AI龐大的投資與變現困難的擔憂，周二Alphabet股價下跌1.77%，收在318.58美元，盤中一度跌3%。 Alphabet周一宣布發售價值200億美元公司債以支應AI發展，隨後又發行了英鎊債和瑞郎債。其中，英鎊公司債包括一筆極其罕見的100年期債券，是自網路泡沫化以來，科技公司首次發行此類「極長期」債券。 這波債券發行預計總共集資320億美元。 據媒體報導，市場對Alphabet這批債券反應熱絡，其中，美元債獲得超過1000億美元的認購。該美元債年期最長達40年，將於2066年到期。 Alphabet發行的瑞郎債規模改寫了羅氏集團（Roche Holding）的30億瑞郎歷史紀錄。英鎊債共發行55億英鎊，打破由National Grid在2016年創下的30億英鎊紀錄。規模達10億英鎊的百年債，刖獲得近10倍的超額認購。 為了籌集資金發展AI業務，Alphabet的長期負債到2025年已經達到465億美元\n時報資訊 ・ 3 天前 ・ 發表留言\n\nAI衝擊本業！Alphabet首揭廣告業務風險 擬發債200億美元拚AI Alphabet 大舉投入 AI 基礎建設並計畫發債募資 200 億美元，同時首度在財報中警示 AI 可能衝擊廣告與搜尋核心業務。在科技巨頭資本支出全面暴增下，AI 競賽已進入高成本與高風險並存的新階段。\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n不只200億美元！傳Alphabet發債規模衝破300億美元 AI基建掀資本市場巨浪 Alphabet 正將全球債券融資規模推升至 300 億美元以上，背後是 AI 基礎建設投資暴增至最高 1850 億美元的資金需求。隨著科技巨頭集體投入算力競賽，產業資本結構與現金流模式正快速重塑，市場進入高槓桿 AI 時代。\n鉅亨網 ・ 3 天前 ・ 發表留言\n\nAlphabet擴大AI投資 尋求發行150億美元公司債 美媒引述知情者的消息報導，谷歌母公司Alphabet為了在AI競賽中保持優勢，正準備發行投資級美元公司債，籌資約150億美元來擴大AI投資。\n中時財經即時 ・ 4 天前 ・ 發表留言\n\nAlphabet擬發債籌資150億美元 加碼AI投資 《彭博》周一 (9 日) 援引知情人士消息報導，Google 母公司 Alphabet (GOOGL-US)正計畫透過發行美國投資級美元公司債，籌資約 150 億美元，進一步加入人工智慧 (AI) 投資熱潮下，大型科技企業的發債行列。\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n買氣超強！Alphabet發債獲超額認購 籌資200億美元超越原定目標 Alphabet(GOOGL-US) 透過發行美元債券籌資 200 億美元，高於最初計劃的 150 億美元，而且根據知情人士透露，這批債券吸引超過 1000 億美元的認購，創下公司債史上最強認購紀錄之一，反映投資人對人工智慧 (AI) 融資的需求殷切。 Alphabet 周一宣\n鉅亨網 ・ 4 天前 ・ 發表留言\n\nAlphabet擬發百年期公司債 谷歌母公司Alphabet在9日成功發債200億美元，並計劃發行100年期公司債，為1990年代末科網股泡沫以來，首度有科技企業挑戰發行超長期債券。專家認為AI競賽愈發激烈，連這種罕見的融資工具也成為選項，顯示企業希望盡可能向各類型投資人籌資。\n工商時報 ・ 3 天前 ・ 發表留言\n\n《國際產業》Alphabet擬發百年期公司債 【時報-台北電】谷歌母公司Alphabet在9日成功發債200億美元，並計劃發行100年期公司債，為1990年代末科網股泡沫以來，首度有科技企業挑戰發行超長期債券。專家認為AI競賽愈發激烈，連這種罕見的融資工具也成為選項，顯示企業希望盡可能向各類型投資人籌資。 Alphabet發債規模高於外界預期的150億美元，認購金額逾1,000億美元。繼甲骨文去年9月發行180億美元債券後，臉書母公司Meta、亞馬遜和Alphabet也持續大舉發債，顯示投資人仍然看好科技業透過舉債來支持其AI擴張。 金融時報引述知情者的消息報導，Alphabet還計劃發行以英鎊計價的3年期到100年期公司債，和以瑞士法郎計價的3年期到25年期公司債。 這兩種貨幣計價的公司債估計最快在10日完成定價，並將是Alphabet首次進入英國和瑞士等債券市場。 Alphabet發行長達百年期的英鎊債引發市場關注，因為自1997年摩托羅拉發行百年債後，首次有科技企業再次挑戰發行百年期債券。 為了在AI軍備競賽中籌集資金，科技巨頭開始採用這種極罕見的融資工具，引發市場對是否重演當年科網股泡沫的擔憂。然而，專家認為Alphabe\n時報資訊 ・ 3 天前 ・ 發表留言\n\nAlphabet發行罕見百年債券　因應AI龐大支出 （中央社倫敦2026年02月10日綜合外電報導）對人工智慧（AI）的投資支出帶動美國科技大廠的借貸潮。據主辦承銷銀行發送的備忘錄，谷歌母公司Alphabet今天發行罕見百年期債券，是該公司在全球市場籌資315.1億美元債券計畫的一環。路透社報導，根據倫敦證券交易所集團（LSEG）的數據，Alphabet此次發行百年債券，是自1997年摩托羅拉（Motorola）發行以來，科技產業首見。紐約梅隆銀行（BNY）首席投資長葛拉內（JasonGranet）表示：「我們正處於科技劇變的非凡時代...如今Google發行百年期債券，反映出大量資本支出，以及市場與科技領域的大規模投資。」根據路透取得的最終條款清單，Alphabet這次發行的英鎊債券總額達55億英鎊，共分為5檔，其中百年期債券規模為10億英鎊，票面利率6.125%。根據國際金融評論（IF）數據，這檔百年期債券認購需求接近原本發行規模的10倍，債券的殖利率為6.05%。此外，Alphabet也透過另一家承銷商以瑞士法郎籌措30.55億瑞士法郎（約合39.8億美元），同樣分為5檔，最短3年、最長25年。至截稿時間止，Alphabet尚未回\n中央社財經 ・ 2 天前 ・ 發表留言\n\nAlphabet美元債籌資200億美元超預期，並罕見發行100年期英鎊債 【財訊快報／陳孟朔】谷歌(Google)母公司Alphabet(A股代碼GOOG)週一通過發行美元債券籌集200億美元，規模遠超原定的150億美元目標。由於投資人對人工智能(AI)相關資產需求空前旺盛，此次發行吸引超過1000億美元的認購訂單，創下企業債發行史上最強勁的需求紀錄之一。Alphabet股價連續四天急跌20.83美元6.1%後，週一小彈1.46美元或0.45%，報324.32美元，開春以來漲3.62%。除了美元債外，Alphabet首度進軍瑞士與英國市場。其中最受矚目是擬發行期限高達100年的英鎊債券，這將是自1997年摩托羅拉(Motorola)以來，首家發行百年期債券的科技公司。英國市場因養老基金與保險商對超長期債券需求旺盛，成為Alphabet鎖定長線融資的首選。Alphabet上週宣布，由於斥巨資建設AI數據中心，2026年資本支出預計高達1850億美元，超過過去三年的總和。摩根士丹利(大摩)預計，包含Alphabet、亞馬遜、Meta與微軟在內的四大雲端巨頭，2026年總借款規模將激增至4000億美元，推動投資級債券發行總額達到創紀錄的2.25兆美元。市場觀察人士\n財訊快報 ・ 4 天前 ・ 發表留言\n\nAlphabet發債200億美元搶攻AI擴張！分析師：2026 年企業債恐創新高 Google 母公司 Alphabet 宣布發行 200 億美元高評級公司債，加入 AI 巨頭大舉融資行列。隨著資料中心與運算需求暴增，亞馬遜、微軟、Meta 等超大規模業者資本支出持續攀升，分析師預期 2026 年美國\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n《國際金融》Google破天荒發行「百年債」等不到還錢那天！分析師示警 【時報-台北電】Alphabet首次發行10億英鎊百年期公司債，引發市場高度關注。分析師指出，在信用利差處於歷史低檔、人工智慧（AI）長期需求仍具不確定性、科技變革持續加速的背景下，Alphabet此次發債被視為信貸市場過度樂觀與AI投資泡沫逐步累積的重要訊號，反映產業正進入高風險擴張階段。 本次百年債屬於Alphabet總規模約200億美元的多幣別融資計畫的一部分，涵蓋美元、歐元、英鎊及首次發行的瑞士法郎債券，期限分布廣泛。根據外媒報導，此次10億英鎊百年期債券吸引近10倍超額認購，票面利率較10年期英國公債高出約120個基點。 分析師指出，百年期公司債向來罕見，多由主權國家發行，企業參與比例有限，主要投資人為保險公司與退休基金，用以因應長期負債需求。Alphabet此次進軍英鎊超長天期市場，顯示其積極爭取長期機構資金，同時反映資本市場對AI題材的高度熱情，但同時亦加深外界對泡沫化風險的疑慮。 Wind Shift Capital執行長布萊恩（Bill Blain）指出，Alphabet此次發債，正是目前信貸市場為AI發展而大舉擴張的縮影，其認為，在利差過低、資料中心需求前景未明，以\n時報資訊 ・ 23 小時前 ・ 3 則留言\n\n《美股掃瞄》AI嚇倒金融業 台積電ADR逆勢創高 【時報編譯柯婉琇綜合外電報導】周二(2月10日)道瓊指數微升且連續第3日改寫收盤歷史高點。標普500指數收黑，因零售銷售數據不如預期，以及Altruist推出新的AI稅務規劃工具，投資人越來越擔心AI對金融業構成的威脅。輝達、微軟、Alphabet等科技巨頭普遍下跌，但台積電1月營收月增19.8%、年增36.8%，並再創歷史新高，其ADR逆勢收漲近2%，至361.91美元，再創新高。目前美指期小漲。 最新發布的零售銷售數據顯示美國去年12月消費者支出陷入停滯，不如市場預期的月增0.4%和11月的月增0.6%。 白宮經濟顧問哈塞特（Kevin Hassett）周一的發言或許也給市場帶來些許壓力。他表示，由於AI提升生產力以及勞動力增長放緩，未來幾個月美國的就業增長可能下滑。 接下來，投資人將緊盯周三公布的非農就業報告和周五公布的消費者物價指數（CPI）。 周二收盤，道瓊指數漲52.27點或0.10%，收50,188.14點。標普500指數跌23.01點或0.33%，收6,941.81點。那斯達克指數跌136.20點或0.59%，收23,102.47點。費城半導體指數跌55.45點或0.6\n時報資訊 ・ 3 天前 ・ 發表留言\n\nAlphabet全球發債募資320億美元，罕見「百年債」獲超額認購 【財訊快報／陳孟朔】為了在人工智慧(AI)競賽中保持領先地位，Google母公司Alphabet(美股代碼GOOG)於24小時內在全球信貸市場展開大規模募資。在週一發行200億美元的美元債後，隨即轉戰英鎊與瑞郎市場，合計募集約320億美元(約新台幣1.02兆元)。此次發債規模不僅刷新多項紀錄，更推出自科技泡沫時代以來極為罕見的「100年期」英鎊債，顯示市場對科技巨頭長期信用的強烈信心。本次發債獲得各國投資者熱烈追捧，美元債部分認購金額突破1000億美元；其中最受矚目的10億英鎊「百年債」，超額認購倍數近10倍。這是自1997年摩托羅拉(Motorola)以來，科技公司首次發行如此極端期限的債券。對於通常面臨技術淘汰風險的科技業而言，發行百年債極其罕見，但受到偏好超長期債券的英國養老基金與保險商青睞，該筆債券最終定價較英國基準國債溢價120個基點。Alphabet上週宣佈將今年資本支出大幅調升至1850億美元，規模達去年的兩倍，主要用於興建AI數據中心與採購輝達(Nvidia)等高效能晶片。儘管Alphabet目前坐擁超過1250億美元的現金儲備，但在超大規模雲端服務商的貸款競賽中，Al\n財訊快報 ・ 3 天前 ・ 發表留言\n\n《美股》收盤速報：AI威脅金融業 標普收黑 台積電ADR逆勢再創高 【時報-台北電】周二(2月10日)道指微升且連3日改寫收盤歷史高點。標普500收黑，因零售銷售數據不如預期，以及Altruist推出新的AI稅務規劃工具，投資人越來越擔心AI對金融業構成的威脅。輝達、微軟、Alphabet等科技巨頭普遍下跌，但台積電1月營收月增19.8%、年增36.8%，並再創歷史新高，其ADR逆勢收漲近2%，至361.91美元，再創新高。目前美指期小漲。 ★四大指數 美股道瓊上漲52.27點或0.10%，收50,188.14點。 S&P500下跌23.01點或0.33%，收6,941.81點。 NASDAQ下跌136.20點或0.59%，收23,102.47點。 費城半導體下跌55.45點或0.68%，收8,107.13點。 ★11大類股 公用事業類股(SPLRCU)漲1.59% 房地產類股(SPLRCREC)漲1.39% 原物料類股(SPLRCM)漲1.29% 非必需消費類股(SPLRCD)漲0.45% 工業類股(SPLRCI)漲0.12% 能源類股(SPNY)跌0.08% 科技類股(SPLRCT)跌0.58% 必需消費類股(SPLRCS)跌0.63% 醫療類股(\n時報資訊 ・ 3 天前 ・ 發表留言\n\n熱門新聞\n1\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 2\n\n13.5億威力彩「2得主」買法一模一樣！ 只花100元就翻身 3\n\n郭台銘大紅包發威！央行新台幣發行額首破4.2兆  年增率飆3年最高 4\n\n「新版新台幣」可能有石虎！票選結果曝光 台積電僅排第七 5\n\n【房地產週報】輝達簽約落腳北士科！29年最大交屋潮來襲！新竹預售屋慘崩82.3%！七大都會區交易量年減7成\n\n你可能會喜歡\n你上車了嗎？記憶體登蛇年狂飆主力　前10猛將全曝光 FTNN新聞網\n\n九大工業公會聯合肯定台美貿易協定 強調為產業注入強心針 民視財經網\n\n春節搭車風險升溫！行車保護傘保障出行　花1元即可享百萬保障 三立新聞網 setn.com\n\n「台灣價值」竟沒台灣之光！大盤飆新高00940卻回不到10元　股民哀號：成敗皆這1檔 鏡週刊Mirror Media\n\n緝捕馬杜洛震驚全球 美軍傳動用AI工具Anthropic Claude 鉅亨網\n\n信義房屋：年前家電、家具換新需求高 今日新聞NOWNEWS\n\n台股拉警報！專家警告美股7巨頭集體翻車：最慘開年行情 中時財經即時\n\n鄭麗君團隊立大功！謝金河曝「台美ART簽署」意義：台灣獲1席珍貴位子 三立新聞網 setn.com\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 工商時報\n\n租屋族省很大！租金補貼減輕4成負擔 女性與25歲以下青年成主力 太報\n\n慕尼黑安全會議 盧比奧、王毅場邊會談 鉅亨網\n\n美股掀AI恐慌交易　台積電ADR挫0.47％ CTWANT\n\n法人兩樣情！華邦電發說利多連發...目標價上看200元 　保守派「4理由」只喊88元 FTNN新聞網\n\n陸客不去日本！外媒爆25萬大軍「改衝這國」 刷爆103億不手軟 中時財經即時\n\n外食族吃不消! 海南雞飯漲20元 手搖飲過年期間漲5元 民視財經網影音\n\n金蛇年「大漲萬點」封關！0050領銜市值型ETF悍漲　近十年含息報酬率高達509% FTNN新聞網\n\n台灣賓士對「台美貿易協議」成功達成表達祝賀 並承諾回饋消費者 民視財經網\n\n砸5億擴產最快Q2釋產能！PCB股華通衝連3漲　當沖爆量破5萬張登當沖王 FTNN新聞網\n\n輝達下跌、AMD上漲 背後關鍵或在Arista 鉅亨網\n\n台美ART簽署》台經院張建一妙喻：台灣付的午餐費 比別人還低 工商時報\n\n蘇威元：台積電概念股飆漲密碼 這四指標抓飆股一次賺58% 民視財經網影音\n\n美通膨降溫難掩「AI恐慌」! 美股漲跌互見、台積電ADR下跌0.51％ 新頭殼\n\n大研生醫* 公告本公司股票面額由「新台幣10元」變更為「新台幣1元」，公告期間：114年12月22日至115年3月21日。 Moneydj理財網\n\n外資降評唱衰！大咖投顧逆風喊買面板指標大廠「這檔」　最新目標價曝光 FTNN新聞網\n\n春節放假也能追美股！內部數據曝光　過年反而更敢買 三立新聞網 setn.com\n\n記憶體嚴重短缺！美國軍工企業黑名單 移除中國長鑫、長江存儲 自由時報\n\n運載指標／港務公司貨櫃量上看1,390萬TEU 今日新聞NOWNEWS\n\n關稅干擾消失加AI助攻　經濟成長率上修至7.71％ 卡優新聞網\n\n台積電ADR13日下跌1.74美元跌幅0.47%折台股2309.39元 中央社財經\n\n到全台最夯紫南宮借發財金　主委莊秋安：心存善念有來有保庇 鏡報\n\n新北房市 新莊幸福路商圈 成家首選 工商時報\n\n〈能源盤後〉油價因美通膨趨緩回升 周線仍收黑 鉅亨網\n\n主動式ETF規模破1739億！這檔年化配息率10％　豪配0.377元「年後這天」最後上車日 FTNN新聞網\n\n13家金控1月獲利全公布！國泰金元月大賺146億元　EPS達0.99元登獲利王 FTNN新聞網\n\n美通膨降溫難掩AI隱憂　美股漲跌互見 太報\n\n〈貴金屬盤後〉黃金、白銀回神 CPI重燃降息預期 鉅亨網\n\n傳統軟體股崩跌回五年前！卡爾先生：掌握這兩點才能存活 民視財經網影音\n\n台股資料來源 臺灣證券交易所 、 臺灣期貨交易所 及 財團法人中華民國證券櫃檯買賣中心 ，國際股市資料來源請參考 Yahoo Finance 。台股行情、個股基本資料及財務資訊為精誠資訊提供。使用Yahoo股市服務前，請您詳閱相關 使用規範與聲明 。\n\n服務條款 隱私權 您的隱私權選擇 加州隱私權通知 © 2026 Yahoo. All rights reserved.\n\n1",
      "Language": "zh",
      "IsSummarized": false
    },
    {
      "Ticker": ".SPX",
      "Date": "2026-02-10",
      "Time": "10:34:11",
      "Source": "Yahoo奇摩股市",
      "Title": "《美股》消息面：華許若就任 川普喊GDP飆15%；美發警示 油價彈升",
      "URL": "https://tw.stock.yahoo.com/news/%E7%BE%8E%E8%82%A1-%E6%B6%88%E6%81%AF%E9%9D%A2-%E8%8F%AF%E8%A8%B1%E8%8B%A5%E5%B0%B1%E4%BB%BB-%E5%B7%9D%E6%99%AE%E5%96%8Agdp%E9%A3%8615-%E7%BE%8E%E7%99%BC%E8%AD%A6%E7%A4%BA-023411249.html",
      "Content": "【時報編譯柯婉琇綜合外電報導】消息面：\n●美國交通部海事局周一向航經荷姆茲海峽的商船發布新指引，建議「懸掛美國國旗的商船在不影響航行安全下，應盡可能遠離伊朗領海，以降低遭攔查或扣押風險」，「如果伊朗軍隊登船，船員不應以武力抵抗」。海事局表示，伊朗部隊最近一次對通過荷莫茲海峽與阿曼灣的船隻登船檢查，是發生在2月3日。儘管伊朗最高外交官員上周五表示，由阿曼居中斡旋的美伊核談判取得樂觀進展，但美國總統川普卻在同一日加大對伊朗的施壓。川普簽署了行政命令，落實他日前釋出的威脅，也就是對於任何「直接或間接」採購伊朗商品的國家加徵25%進口關稅。\n\n●Fox Business報導，美國總統川普表示，如果他提名的人選華許（Kevin Warsh）獲准就任聯準會主席，並有效發揮能力、履行其職責，那麼美國經濟成長率可望達到15%，甚至可能更高。川普並表示，華許是他第一個任期時的聯準會主席第二人選，而最終他選擇了鮑爾「真是一大錯誤」。美國2026年GDP成長率預估為2.4%，過去50年的平均年度成長率約為2.8%。自1950年代以來，美國經濟成長長率超過15%的情況，寥寥無幾。\n\n●周一紐約尾盤美元指數跌0.8%，報96.81，投資人等待本周公布的非農就業和通膨等重要經濟數據，以及日本政府可能出手干預的預期給日圓帶來支撐。\n●周一布蘭特期油上漲99美分或1.5%，收於每桶69.04美元。美國WTI期油漲81美分或1.3%，收在每桶64.36美元。美國海事局對懸掛美國國旗行經荷姆茲海峽的商船發布警示，加劇對中東緊張升溫的擔憂。\n●受美元走軟激勵，周一金價收復每盎司5000美元大關。黃金現貨價格上漲1.9%，報每盎司5056.21美元，延續上周五大漲4%的升勢。4月期金收漲2%，報每盎司5079.40美元。繼上周五強彈近10%後，周一白銀亦大漲6.3%，報每盎司82.86美元。\n\n檢視留言\n\n相關內容\n美方建議：懸掛美國國旗商船遠離伊朗領海 美國周一（9 日）向途經荷姆茲海峽的商船發布最新指南，據美國交通部海事管理局發布的指導意見，該機構建議「懸掛美國國旗的商船盡可能遠離伊朗領海，並在被伊朗軍隊要求登船時口頭拒絕——如果伊朗軍隊登船，船員不應強行抵抗」。\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n美警告商船避開荷莫茲海峽 油市波動恐再起 美國政府於10日發布通知，建議美國商船遠離荷莫茲海峽（Strait of Hormuz），使外界對美伊兩國之間的核計畫談判憂慮再起，由於該航道為運送中東原油的重要航道，也令市場擔憂供應有中斷可能，恐令油市波動再起。\n工商時報 ・ 3 天前 ・ 發表留言\n\n美、伊緊張局勢升溫，布蘭特和紐約期油週一追高逾1% 【財訊快報／陳孟朔】美國交通部發布航行公告，要求懸掛美國國旗的船隻在經過荷姆茲海峽和安曼灣時盡量遠離伊朗領海影響，兩大期油週一追高超過1%。市場對美、伊緊張局勢可能導致供應中斷的擔憂重燃，抵銷先前因雙方重申繼續間接談判而帶來的跌勢。布蘭特4月期油收盤上漲99美分或1.5%，結算價為每桶69.04美元；紐約3月期油漲81美分或1.3%，收於每桶64.36美元。上述兩大期油上週五各收高0.7%和0.4%。儘管美、伊雙方形容近期討論具積極性，但伊朗外交部長上週六警告，若遭美軍攻擊，將回擊美國在海灣地區的基地，使地緣政治風險溢價持續注入市場。除中東局勢外，投資人也密切關注對俄羅斯石油出口的新制裁。歐盟委員會提議全面禁止支持俄羅斯海運原油出口的相關服務，且消息人士指出，印度煉油商正避免購買4月交付的俄羅斯原油。分析師認為，若印度完全停止採購俄油，將構成油市持續看漲的動力。在產量方面，由雪佛龍領導的哈薩克騰吉茲(Tengiz)巨型油田產能已恢復至峰值的60%，預計2月23日恢復全線生產。此外，路透初步調查顯示，上週美國原油庫存可能增加，而汽油及蒸餾油庫存預期將減少。\n財訊快報 ・ 4 天前 ・ 發表留言\n\n川普：美伊必須達成協議 否則後果「非常慘烈」 美國總統川普週四表示，美國必須與伊朗達成協議，並警告若談判破裂，後果將「非常慘烈」。他並對談判進展表達樂觀，稱美伊之間有望在未來「一個月內」達成協議。\n鉅亨網 ・ 1 天前 ・ 發表留言\n\n《美股》消息面：盧特尼克稱美不會阻礙晶片業；比特幣跌破6.9萬美元 【時報編譯柯婉琇綜合外電報導】消息面： ●ADP公布，在截至1月24日的4周內，美國民間就業每周平均增加6500人，高於前值（5000人），為連續第三周成長，並創下1月3日以來新高。 ●美國2025年12月零售銷售額與11月相比持平，不及市場預期的月增0.4%。排除汽車的零售銷售額亦與11月持平，落後市場預期的月增0.3%。 ●美國石油協會（API）公布，上周（截至2月6日）美國原油庫存大增1340萬桶；前一周為庫存減少1110萬桶。此外，汽油庫存增加330萬桶，包括柴油和取暖油在內的餾分油庫存減少200萬桶。 ●周二在參議院撥款委員會小組出席聽政會時，美國商務部長盧特尼克（Howard Lutnick）表示，美國去年第四季國內生產毛額（GDP）成長率預估將突破5%，而今年第一季可能突破6%。他表示，美元回落至「較自然」的價位，有利於促進美國出口和加速經濟增長，今年製造業就業將出現巨大的增長，有助於美國經濟實現如此強勁的增長。盧特尼克並表示，美國對AI晶片的需求龐大，華盛頓不會想採取任何可能阻礙晶片業發展的措施。 ●克利夫蘭聯準銀行總裁哈馬克（Beth Hammack）表示，聯準會利率\n時報資訊 ・ 2 天前 ・ 1 則留言\n\n〈能源盤後〉美示警避開伊朗海域 全球五分之一石油運輸面臨壓力 原油漲逾1% 美國示警航運避開伊朗周邊海域，引發市場對中東局勢升溫與原油供應中斷疑慮，推升國際油價上漲逾 1%。在美伊談判、俄油制裁與全球庫存變動多重因素交織下，油市短線波動風險持續升高。\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n川普大讚華許：由他出任Fed主席 美國GDP成長率可達15% 美國總統川普表示，他提名的聯準會 (Fed) 主席接班人華許 (Kevin Warsh) 如果在國會獲得確認，將可推升美國經濟成長 15%。這番話似乎代表川普期待華許在期中選舉前能推動經濟成長，但這個高度樂觀的目標，也凸顯華許上任將面臨的龐大壓力。 川普周一 (9 日) 接受\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n華許將掌Fed 川普誇海口：GDP成長飆到15% [非凡新聞]記者陳鳴駿美國總統川普對經濟前景畫出驚人大餅，聲稱只要華許執掌聯準會，美國經濟成長率將狂飆至15%，但相較於總統的豪語，白宮官員卻顯得保守，提前示警即將公布的就業數據可能轉弱。此外，川普限制華...\n非凡新聞 ・ 3 天前 ・ 發表留言\n\n《國際政治》尼坦雅胡7度會川普 防堵伊朗核武發展不夠 堅要納入飛彈 【時報-台北電】美國總統川普將於週三（11日）在白宮會晤以色列總理尼坦雅胡（Benjamin Netanyahu），也是川普第二任期以來，兩人第7次會晤。預料雙方將就伊朗核談判、加薩停火及中東安全情勢進行深入討論。尼坦雅胡此行重點，將爭取美方在與伊朗談判中納入飛彈與區域安全議題，而不僅限於核計畫。 路透社報導，尼坦雅胡總理希望能藉由這次會面，在美國和伊朗於阿曼進行核子談判之後，對華府接下來的對伊政策產生影響。川普總統之前曾經警告說，如果無法與伊朗達成協議，美國可能會採取軍事打擊的手段，而德黑蘭方面也公開表示將會採取報復行動，這使得中東地區的局勢升溫，衝突的風險也因此加劇。 川普總統在接受媒體採訪時提到，「一個好的協議」必須確保伊朗「沒有核武器、沒有飛彈」，並且表示如果德黑蘭拒絕讓步，美國將會採取「非常強硬」的行動。他也透露，美國正在考慮向伊朗周邊地區增派第二支航空母艦打擊群，以加強軍事部署。 以色列方面擔心，美國可能只會尋求一項狹義的協議，僅僅限制伊朗的核計畫，而沒有將彈道飛彈的發展，以及伊朗對哈瑪斯、真主黨等代理武裝力量的支持納入考量。 有知情人士指出，尼坦雅胡總理將會向川普總統闡述\n時報資訊 ・ 2 天前 ・ 發表留言\n\n《國際油價》美、伊緊張關係持續　2/9歐美原油期貨續漲 【時報-台北電】美、伊緊張關係持續，周一歐美原油期貨續漲，美國要求懸掛美國國旗的商船遠離伊朗領海，美國與伊朗緊張關係不斷升溫，提振國際油價連2日反彈上漲。 美國NYMEX-3月輕質原油期貨上漲0.81美元，報每桶64.36美元；3月熱燃油漲0.01美元，報每加侖2.42美元；3月RBOB汽油漲0.04美元，報每加侖1.99美元，倫敦ICE-4月布蘭特原油期貨上漲0.99美元，報每桶69.04美元。(編輯：鄧凱綺)(商品行情網)\n時報資訊 ・ 3 天前 ・ 發表留言\n\n道瓊尾盤漲幅差點全吐 川普或增派第二支航母艦隊駛向伊朗 《Axios》週二獨家報導，美國總統川普受訪表示，若與伊朗的談判未能達成協議，他正考慮向中東增派第二支航空母艦打擊群，以便在外交破局時，為可能的軍事行動預作準備。\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n《國際政治》高市輾壓式勝利 川普第一時間賀 【時報編譯柳繼剛綜合外電報導】川普於美國時間八日，祝賀日本首相高市早苗領導的自民黨，在日本大選中取得壓倒性勝利(landslide victory)，同時，這位美國總統也說，自己前幾天曾公開表示，要支持高市早苗。 川普在社交媒體上發文指出，高市早苗決定提前舉行大選，不僅是大膽且是明智(bold and wise)的，希望高市以在國會絕對的多數，能順利推進保守的和平政策。 在日本自民黨贏得眾議院高達三分之二的多數席位，並創下日本戰後歷史新高後的幾個小時，川普隨即回應，熱情投票的日本人民，將永遠得到我的堅定支持。 美國財政部長貝森特在美國福斯新聞(Fox News)節目中也說，川普與高市早苗的關係很好，當日本強大時，代表美國在亞洲也強大。在八日大選前幾天，川普已表態會全力支持高市，並於三月19日在白宮歡迎這位日本第一位女首相。 日媒指出，高市千尋下個月在就任首相以來，可望首次訪美，且時間上要早於川普計畫四月訪中。幾個月以來，中國一直對高市關於潛在性的台海危機言論，抱持非常強硬的立場。 自從高市早苗在去年10月就任首相以來，川普就一直讚揚高市是日本已故首相安倍晉三的門生，事實上，川普在美國總\n時報資訊 ・ 4 天前 ・ 發表留言\n\n《美股》消息面：美預算赤字恐破表；金銀走高 【時報編譯柳繼剛綜合外電報導】消息面： ●美國財政部的數據顯示，截至一月的2026財年前四個月，聯邦政府預算赤字，已從2025年同期8400億美元，降至6970億美元，減幅達17%。同時，關稅收入達1240億美元，年增逾3倍。光是一月來說，關稅收入就高達300億美元，年增高達2.75倍。川普表示，自己的新關稅政策幫助美國減少78%的貿易逆差，明年貿易將會轉為順差。另方面，美國國會預算辦公室(CBO)示警，2026財年預算赤字估將小增至近1.9兆美元，到了2036年時更是增至3.1兆美元。 ●美國總統川普於美東11日，在白宮會見來訪的以色列總理納坦雅胡，川普會後表示，除了自己堅持要持續與伊朗談判，確定是否能達成協議外，與納坦雅胡並沒有達成任何明確的結論。 ●現貨金一度上漲1.87%，每盎斯高點來到5119.3美元，收在5084.53美元，漲幅為1.17%。另外，現貨銀收在84.3115美元，漲4.35%。印尼政府暗示，將大幅刪減今年鎳礦產能配額，倫敦期鎳每噸收18002.38美元，大漲2.55%。 ●紐約期油一度大漲2.92%，高點每桶來到65.83美元，收漲1.05%，為64.63美元\n時報資訊 ・ 1 天前 ・ 發表留言\n\n川普自豪宣稱美國已進入「川普經濟」！民調卻顯示多數民眾不買單 美國總統川普在接受《NBC》專訪時宣稱，美國已正式進入「川普經濟」時代，並預測 2026 年經濟將更勝以往。不過，最新民調顯示，多數美國民眾對經濟現況仍感不滿，官方數據與川普所稱的經濟成長與投資金額也出現落差，相關說法引\n鉅亨網 ・ 4 天前 ・ 發表留言\n\n台美敲定貿易最終協議 關稅定調15%、擴大採購美國商品 據《路透》報導，美國川普政府官員已簽署互惠貿易最終協議，確認對自台灣進口商品課徵 15% 的關稅，同時承諾台灣將依時程逐步取消或調降幾乎所有美國商品的關稅。\n鉅亨網 ・ 1 天前 ・ 發表留言\n\n美行政命令可變性高 市場高度關注 台美對等貿易協定（ART）終於完成簽署，雖說可藉此扭轉過去沒有與美國簽署自由貿易協定（FTA）的貿易劣勢，但仍有多個關鍵問題有待持續關注，首先，兩者本質卻截然不同。前者是川普政府利用關稅為手段的貿易政策手段；後者則是以消除貿易壁壘為主要目的。此外，這次ART為台灣爭取到2,072項產品的豁免關稅，但當中有337項產品是美國對「全球豁免」的產品，鑒於川普政府的反覆不定，導致未來仍有高度不確定性。\n工商時報 ・ 5 小時前 ・ 發表留言\n\n雙航母施壓伊朗 川普證實已調派「福特號」前往中東 美國總統川普週五 (13 日) 證實，五角大廈正把一艘航空母艦從加勒比海調往中東，此舉將使美軍在該地區同時部署兩艘航母，因應美國與伊朗之間緊張情勢升高。\n鉅亨網 ・ 4 小時前 ・ 發表留言\n\n川普力挺新掌門人華許 放話經濟增速上看15% 稱當年選鮑爾是「大錯」 川普在公布新任聯準會主席人選後，罕見公開承認首任期提名鮑爾是重大錯誤。隨著司法調查與政策衝突升溫，美國貨幣政策與政治角力正進入新一輪敏感階段。\n鉅亨網 ・ 3 天前 ・ 發表留言\n\n紐油與布油亞洲電子盤初翻空，小跌0.4% 【財訊快報／陳孟朔】受美國與伊朗緊張升溫，以及歐盟研議加碼收緊俄羅斯石油出口制裁影響，兩大期油在連二紅後，在亞洲週一電子盤初翻空小跌。布蘭特4月期油下跌0.25美元或0.4%至每桶68.79美元，紐約3月期油跌0.23美元或0.4%至每桶64.13美元。兩大期油前兩個交易日各漲了2.2%和1.7%。週一油價一度大漲逾1%，主因美國交通部海事管理局發布最新安全建議，要求美籍商船通過荷姆茲海峽時，盡可能遠離伊朗領海，若遭要求登船則以口頭方式婉拒(若被強行登船則不建議以武力抵抗)，市場解讀為地緣風險再度升溫。分析師指出，荷姆茲海峽為全球能源運輸要道，全球相當比重的原油供應需經此航道，任何攔截、扣船或封鎖疑慮都會放大油價波動；即便伊朗方面提及在阿曼斡旋下的對話出現正向訊號，市場對衝突外溢的風險溢價仍難快速消退。另一方面，歐盟最新一籃子制裁提案傳出將把範圍延伸至格魯吉亞與印尼的港口，以更全面封堵俄油出口與「繞道」流通路徑；同時，印度石油公司近期也自西非與中東採購約600萬桶原油，市場解讀為在貿易與地緣結構重組下，部分買方正調整來源以降低對俄油依賴，後續將牽動供需平衡與運價。\n財訊快報 ・ 3 天前 ・ 發表留言\n\n金融時報：川普擬縮減鋼鋁產品部分關稅 （中央社華盛頓2026年02月13日綜合外電報導）美國總統川普計劃縮減對鋼鐵及鋁製品的部分關稅，以因應生活成本危機帶來的壓力，這場危機已導致他的支持率下滑，而距離美國11月期中選舉僅剩幾個月。英國「金融時報」（Financial Times）報導，川普（Donald Trump）去年夏天對進口鋼鋁課徵最高達50%的關稅，並將課稅範圍擴及許多鋼鋁製品，例如洗碗機和烤箱。不過根據3名知情人士，川普政府現正審查受鋼鋁關稅影響的產品清單，計劃給予部分品項豁免、停止擴大課稅清單，並轉而對特定商品展開更具針對性的國家安全調查。這些知情人士透露，美國商務部及美國貿易代表署（USTR）的貿易官員認為，這些關稅促使烤盤、食品罐和飲料罐等商品漲價，對消費者造成傷害。川普的關稅攻勢使美國關稅水準攀升至第二次世界大戰戰前以來最高峰，不過隨著選民對美國生活成本危機的不滿日益加劇，川普已多次撤回部分最嚴格的關稅措施。皮尤研究中心（Pew Research Center）本月發布的民調顯示，逾7成美國成年人認為當前經濟狀況「普通」或「不佳」，約52%美國人認為川普的經濟政策導致情況惡化。美國商務部、美國貿易代表署及\n中央社財經 ・ 17 小時前 ・ 發表留言\n\n熱門新聞\n1\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 2\n\n13.5億威力彩「2得主」買法一模一樣！ 只花100元就翻身 3\n\n郭台銘大紅包發威！央行新台幣發行額首破4.2兆  年增率飆3年最高 4\n\n「新版新台幣」可能有石虎！票選結果曝光 台積電僅排第七 5\n\n【房地產週報】輝達簽約落腳北士科！29年最大交屋潮來襲！新竹預售屋慘崩82.3%！七大都會區交易量年減7成\n\n你可能會喜歡\n你上車了嗎？記憶體登蛇年狂飆主力　前10猛將全曝光 FTNN新聞網\n\n九大工業公會聯合肯定台美貿易協定 強調為產業注入強心針 民視財經網\n\n春節搭車風險升溫！行車保護傘保障出行　花1元即可享百萬保障 三立新聞網 setn.com\n\n「台灣價值」竟沒台灣之光！大盤飆新高00940卻回不到10元　股民哀號：成敗皆這1檔 鏡週刊Mirror Media\n\n緝捕馬杜洛震驚全球 美軍傳動用AI工具Anthropic Claude 鉅亨網\n\n信義房屋：年前家電、家具換新需求高 今日新聞NOWNEWS\n\n台股拉警報！專家警告美股7巨頭集體翻車：最慘開年行情 中時財經即時\n\n鄭麗君團隊立大功！謝金河曝「台美ART簽署」意義：台灣獲1席珍貴位子 三立新聞網 setn.com\n\n美規車零關稅》最多降1成！車廠降價有譜 雙B開第一槍 工商時報\n\n租屋族省很大！租金補貼減輕4成負擔 女性與25歲以下青年成主力 太報\n\n慕尼黑安全會議 盧比奧、王毅場邊會談 鉅亨網\n\n美股掀AI恐慌交易　台積電ADR挫0.47％ CTWANT\n\n法人兩樣情！華邦電發說利多連發...目標價上看200元 　保守派「4理由」只喊88元 FTNN新聞網\n\n陸客不去日本！外媒爆25萬大軍「改衝這國」 刷爆103億不手軟 中時財經即時\n\n金蛇年「大漲萬點」封關！0050領銜市值型ETF悍漲　近十年含息報酬率高達509% FTNN新聞網\n\n台灣賓士對「台美貿易協議」成功達成表達祝賀 並承諾回饋消費者 民視財經網\n\n外食族吃不消! 海南雞飯漲20元 手搖飲過年期間漲5元 民視財經網影音\n\n砸5億擴產最快Q2釋產能！PCB股華通衝連3漲　當沖爆量破5萬張登當沖王 FTNN新聞網\n\n聯電ADR13日上漲0.13美元漲幅1.26%折台股65.68元 中央社財經\n\n輝達下跌、AMD上漲 背後關鍵或在Arista 鉅亨網\n\n美通膨降溫難掩「AI恐慌」! 美股漲跌互見、台積電ADR下跌0.51％ 新頭殼\n\n台美ART簽署》台經院張建一妙喻：台灣付的午餐費 比別人還低 工商時報\n\n外資降評唱衰！大咖投顧逆風喊買面板指標大廠「這檔」　最新目標價曝光 FTNN新聞網\n\n大研生醫* 公告本公司股票面額由「新台幣10元」變更為「新台幣1元」，公告期間：114年12月22日至115年3月21日。 Moneydj理財網\n\n春節放假也能追美股！內部數據曝光　過年反而更敢買 三立新聞網 setn.com\n\n蘇威元：台積電概念股飆漲密碼 這四指標抓飆股一次賺58% 民視財經網影音\n\n記憶體嚴重短缺！美國軍工企業黑名單 移除中國長鑫、長江存儲 自由時報\n\n運載指標／港務公司貨櫃量上看1,390萬TEU 今日新聞NOWNEWS\n\n主動式ETF規模破1739億！這檔年化配息率10％　豪配0.377元「年後這天」最後上車日 FTNN新聞網\n\n關稅干擾消失加AI助攻　經濟成長率上修至7.71％ 卡優新聞網\n\n到全台最夯紫南宮借發財金　主委莊秋安：心存善念有來有保庇 鏡報\n\n新北房市 新莊幸福路商圈 成家首選 工商時報\n\n〈能源盤後〉油價因美通膨趨緩回升 周線仍收黑 鉅亨網\n\n13家金控1月獲利全公布！國泰金元月大賺146億元　EPS達0.99元登獲利王 FTNN新聞網\n\n美通膨降溫難掩AI隱憂　美股漲跌互見 太報\n\n〈貴金屬盤後〉黃金、白銀回神 CPI重燃降息預期 鉅亨網\n\n傳統軟體股崩跌回五年前！卡爾先生：掌握這兩點才能存活 民視財經網影音\n\n台股資料來源 臺灣證券交易所 、 臺灣期貨交易所 及 財團法人中華民國證券櫃檯買賣中心 ，國際股市資料來源請參考 Yahoo Finance 。台股行情、個股基本資料及財務資訊為精誠資訊提供。使用Yahoo股市服務前，請您詳閱相關 使用規範與聲明 。\n\n服務條款 隱私權 您的隱私權選擇 加州隱私權通知 © 2026 Yahoo. All rights reserved.\n\n1",
      "Language": "zh",
      "IsSummarized": false
    }
  ]
}