{
  "last_updated": "2026-02-14T07:14:54.427Z",
  "total_news_count": 24,
  "news": [
    {
      "Ticker": "NVDA",
      "Date": "2026-02-14",
      "Time": "14:25:00",
      "Source": "Motley Fool",
      "Title": "Is Nvidia Set to Help Joby Aviation Become the Tesla of the Skies?",
      "URL": "https://finance.yahoo.com/m/34f6a3ab-0e5e-3c8f-9ed7-9c15f100c270/is-nvidia-set-to-help-joby.html",
      "Content": "In late 2025, the news that Joby Aviation (NYSE: JOBY) and Nvidia were teaming up to develop an autonomous flight capability hit the market by surprise. Given that Joby is pursuing a vertically integrated strategy (designing, manufacturing, owning, and operating its own aircraft as a transportation company) in the electric vertical take-off and landing (eVTOL) market, the parallel with Tesla' s robotaxi rollout is obvious. Is it set to make Joby the undisputed eVTOL champion?\n\nThe collaboration will involve Joby using Nvidia's computing power via its new IGX Thor Platform, which is under development alongside Joby's Superpilot autonomous flight technology. It's an interesting move that highlights the differences in approaches among Joby, Archer Aviation , and the eVTOL company no one talks about: Boeing's Wisk.\n\nWill AI create the world's first trillionaire? Our team just released a report on the one little-known company, called an \"Indispensable Monopoly\" providing the critical technology Nvidia and Intel both need. Continue »\n\nEach company has its own strategy. Archer aims to be an eVTOL manufacturer and will sell its aircraft to others. Joby and Wisk, on the other hand, want to run transportation services. The key difference is that Joby, like Archer, is starting with piloted aircraft, while Wisk is focused only on autonomous planes.\n\nHaving pilots means that Joby and Archer are significantly ahead in the certification process. Still, if Wisk's autonomous eVTOL gets certified later, they're highly likely to substantially undercut Joby's airtaxis, in the same way that Tesla's robotaxis are likely to be heavily price-competitive with conventional taxis.\n\nThe potential threat from Wisk is somewhat mitigated by Joby's ongoing development with Superpilot and, more recently, the Nvidia collaboration. Joby plans to develop autonomous functions (mission management, radar processing, etc.) that will act as a digital copilot to assist a human pilot.\n\nHowever, Joby plans to use Nvidia's technology platform to continue developing Superpilot so it can ultimately \"pursue certifiable autonomy for near-term defense and long-term civil applications as the Federal Aviation Administration advances the capabilities of national airspace,\" according to a Joby press release.\n\nThe company's plan to develop autonomous eVTOLs for the military in the near term makes sense, as it could establish and test its technology ahead of civil adoption. Moreover, the plan to use Superpilot as a digital copilot on civil airtaxis will give the company substantial flight-hour data to improve it ahead of a potential launch. Again, the analogy with Tesla works, as the EV company has billions of miles of data on its full-self-driving (FSD) software from Tesla drivers.\n\nBy working with Nvidia, Joby is reducing the risk that Wisk will overtake it in the autonomous market. The company could have piloted airtaxis in service, and possibly even autonomous ones for the military, before Wisk's civil autonomous eVTOL is certified.\n\nJoby's first-mover advantage could prove telling in funding rounds and establishing technology and trust in the marketplace. Consequently, it's an attractive stock for investors looking for eVTOL exposure.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "NVDA",
      "Date": "2026-02-14",
      "Time": "14:22:00",
      "Source": "Motley Fool",
      "Title": "This Is the Best AI Stock to Buy in February 2026, According to Wall Street",
      "URL": "https://finance.yahoo.com/m/b1abf2c8-d60c-30f3-b00f-7678ff5af75d/this-is-the-best-ai-stock-to.html",
      "Content": "While Wall Street's price targets shouldn't be the only factor retail investors weigh when researching potential investments, they are great to look at for validation that you're looking in the right places. It's a red flag for me if a stock that I'm considering has poor analyst projections, as it may tell me that I haven't quite learned enough about the company to understand why others think its upside is so low.\n\nHowever, one that interests me now is a stock that Wall Street analysts believe has huge one-year growth potential: Nvidia (NASDAQ: NVDA) . Anyone who follows artificial intelligence (AI) investing is likely already aware of this stock, as are many non-AI investors. It has been one of the top-performing stocks over the past few years thanks to its position in the AI landscape. With massive projected top-line growth ahead, it should come as no surprise that Nvidia's price target from the average Wall Street analyst is sky-high.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\n\nCurrently, Nvidia's stock trades at about $185 per share. That's about 10% below its all-time high. However, Wall Street analysts covering the company expect monster growth over the next year, with an average price target of $253.62. That indicates a one-year upside of 37%.\n\nIf you want an even more bullish projection, one analyst has a price target of $352 per share on Nvidia stock, which is slightly less than double what it is now. But are those realistic projections?\n\nSeveral AI hyperscalers have announced their 2026 capital expenditure plans for AI data centers , and the numbers are jaw-dropping. While Nvidia won't get all of this spending, it will capture a nice chunk. This supports the impressive growth projections for it this year: The Wall Street consensus is that Nvidia will report about $213 billion in revenue for its fiscal 2026, which ended late last month. Analysts further forecast that it will grow its revenue by 53% in fiscal 2027 to $326 billion. If Nvidia can maintain its 53% profit margin, that would amount to $173 billion in profits.\n\nAt a price-to-earnings ratio of 40 -- lower than it currently sports -- that would give Nvidia a market cap of $6.9 trillion, or upside of 53%. However, its actual earnings multiple at that point could be different depending on how bullish or bearish the market is on AI spending a year from now.\n\nRegardless, there's a pretty clear-cut bull case for Nvidia. In my view, it's one of the best AI stocks to buy in February.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-02-14",
      "Time": "13:20:00",
      "Source": "Motley Fool",
      "Title": "3 Stocks That Will Be Worth $3 Trillion or More in 3 Years",
      "URL": "https://finance.yahoo.com/m/f0f05ce2-ad5e-3bff-873f-fd4b5883db84/3-stocks-that-will-be-worth.html",
      "Content": "There have only been four companies to reach a $3 trillion market cap or greater. But as the stock market rises, the $3 trillion level will eventually be breached by many more companies. In fact, I think three of them will each reach that level over the next three years.\n\nThe three that I've got my eye on are Amazon (NASDAQ: AMZN) , Taiwan Semiconductor (NYSE: TSM) , and Broadcom (NASDAQ: AVGO) . All of these companies are within striking distance, and each looks like a worthy investment option now.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\n\nSome of these companies have further to go than others. Amazon is already a $2.4 trillion company, so projecting that it will rise to a market cap of $3 trillion in three years isn't really that bold a call. It only needs to manage a growth rate of 8% over the next three years to get there. If that's all, the faster it grows, the more likely it will be a disappointment for most investors. I think Amazon has a much better growth case than that, but we'll get to that in a bit.\n\nTaiwan Semiconductor and Broadcom have much further to go. Taiwan Semiconductor is a $1.72 trillion company, while Broadcom tops the sales at $1.47 trillion. It will take a compounded annual growth rate (CAGR) of 20% and 27%, respectively, for each to rise to a $3 trillion cap three years from now.\n\nThat's no easy task, but if each can deliver that rate of return, they will make for no-brainer buys right now. But are these growth rates feasible?\n\nAmazon is probably the easiest company to make a case for. Although it only needs to deliver an 8% growth rate to reach this level, it has managed to grow its revenue above double digits for the past four years.\n\nAMZN Revenue (Quarterly YoY Growth) data by YCharts.\n\nI have no doubt that it will continue that trend over the next few years, and it could grow at an even faster rate thanks to the acceleration of artificial intelligence (AI) spending. Amazon Web Services (AWS), its cloud computing service that powers traditional and AI workloads, posted revenue growth of 24% in the fourth quarter (Q4) -- the best in 13 quarters. This is a clear sign that Amazon's business is thriving, and with AWS having a much better operating margin than the rest of the business, its outsized growth will have an even greater effect on profits. Amazon is a lock to reach a $3 trillion market cap in three years and should beat the market along the way.\n\nTaiwan Semiconductor is a key part of the AI build-out, as its chip foundries manufacture a large chunk of the logic chips utilized in AI devices. Management expects huge growth from AI over the next few years, with AI chip revenue rising at nearly a 60% CAGR. However, that's not a companywide growth rate, as other companies utilize its foundry services outside of AI. From 2024 to 2029, management expects a CAGR of nearly 25% companywide, easily surpassing the 20% return threshold needed to rise to a $3 trillion company three years from now.\n\nLast is Broadcom. It has the longest way to go but will likely grow at the fastest rate. Although it does several other things, its biggest growth driver is its custom AI chips, which it designs in a partnership with AI hyperscalers. By designing a chip around a specific workload, Broadcom can achieve better results at a lower price point but at the cost of flexibility. These are massively growing in popularity, and Broadcom expects to double its AI segment revenue year over year during Q1 2026. As more hyperscalers launch their custom chip design with Broadcom, their growth rate will continue to be strong. This will drive Broadcom to become a $3 trillion company quickly, and investors shouldn't miss out on this stock .",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-02-14",
      "Time": "10:23:00",
      "Source": "Motley Fool",
      "Title": "What Is One of the Best Tech Stocks to Own for the Next 10 Years?",
      "URL": "https://finance.yahoo.com/m/425a2af2-1e43-391b-b69b-9e1026372ce8/what-is-one-of-the-best-tech.html",
      "Content": "A few big names dominate tech stock headlines. This is rightfully so, but there are other tech companies worthy of investors' time and money.\n\nBroadcom (NASDAQ: AVGO) is absolutely one. What was once a standard networking and software company is now a cutting-edge artificial intelligence (AI) custom chip builder partnering with the world's top hyperscalers.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\n\nWhat separates Broadcom from the pack is its strong financial profile. The company's solid free cash flow, currently standing at $7.4 billion, has enabled it to pay dividends consistently while continuing to invest in growth. Recent earnings reinforce the narrative that Broadcom is a powerhouse .\n\nIn its fourth-quarter 2025 report, Broadcom's revenues grew 28% year over year, and free cash flow was up 36%. Even if growth slows slightly in the coming quarters, Broadcom's robust balance sheet has given it a true economic moat. The company also announced a 10% increase in its dividend in its latest earnings.\n\nBroadcom's stock is somewhat volatile, but historically patient Broadcom investors have been rewarded . As of Feb. 11, the stock has risen 45% over the past 12 months and an astounding 615% over the past five years. Broadcom's market cap has exploded to more than $1 trillion in this time as well, making it one of the largest companies in the world.\n\nWhat's most impressive about Broadcom is its ability to execute and deliver. Broadcom's $162 billion backlog should ensure it has room to run for the next decade.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MU",
      "Date": "2026-02-14",
      "Time": "09:02:00",
      "Source": "Zacks",
      "Title": "The Surge in Micron Technology Stock Looks Poised to Continue",
      "URL": "https://finance.yahoo.com/news/surge-micron-technology-stock-looks-010200212.html",
      "Content": "Being a leading provider of semiconductor memory solutions, Micron Technology MU is the most searched for stock on Zacks.com outside of Nvidia NVDA .\n\nThis comes as the storied memory chip shortage has made Micron a central beneficiary of the AI hardware boom.\n\nThe rapid expansion of AI hardware — data centers, GPUs, and accelerators — is consuming most of the memory chip supply and bandwidth, driving a sharp increase in demand for Micron’s offerings.\n\nWith the demand shock being structural and not a temporary spike, Micron’s stock more than tripled last year and is already up more than 40% in 2026.\n\nWhile this is an unprecedented surge, analysts argue that Micron’s valuation remains compelling because earnings are rising even faster than the stock price.\n\nFollowing a recent pullback from an all-time high of $455 a share, the surge in Micron’s stock looks poised to continue.\n\nTo that point, Micron is still seeing an eye-catching trend of positive EPS revisions, and has held a spot on the coveted Zacks Rank #1 (Strong Buy) list since this past August.\n\nMicron’s HBM (high-bandwidth memory), server-class DRAM (dynamic random-access memory), DDR5 (double data rate), and broader DRAM portfolio are seeing explosive demand.\n\nNotably, AI chips from Nvidia, AMD AMD , and Alphabet GOOGL require enormous amounts of HBM, making it the single most supply-constrained memory type in the world right now.\n\nDDR5 is the fifth generation of advanced synchronous DRAM and has been in short supply as well, making this category a major growth driver for Micron as the latest, fastest, and most efficient memory standard powering modern servers, PCs, and AI systems.\n\nReflecting the exceptionally favorable supply and demand dynamic, Micron’s FY25 sales hit a record $37.38 billion, with annual earnings near multi-year highs at $8.29 per share. And of course, top and bottom line peaks are projected this year.\n\nWall Street expects Micron’s EPS to spike 300% in FY26 to a record $33.22, a staggering acceleration that reflects both pricing power and volume growth. Better still, FY27 EPS is projected to climb another 35% to a whopping $44.95.\n\nSince most recently crushing earnings expectations for its fiscal first quarter in December, Micron’s FY26 and FY27 EPS estimates have continued to trend higher and are now up 78% and 91% in the last 60 days, respectively.\n\nImage Source: Zacks Investment Research\n\nAstonishingly, the year-ago earnings estimates picture shows that FY26 and FY27 EPS revisions have now skyrocketed 207% and 490%, respectively.\n\nImage Source: Zacks Investment Research\n\nJust as captivating is that despite such an exhilarating rally, Micron stock still trades at 12X forward earnings. This is well below the rather stretched P/E premiums other high-growth tech stocks can command and offers a distinct discount to the benchmark S&P 500.\n\nMore intriguing, MU trades nicely beneath Sandisk Corporation SNDK and Western Digital’s WDC forward earnings multiples of 23X and 31X, as two of the other prime beneficiaries of the global memory chip shortage.\n\nImage Source: Zacks Investment Research\n\nMicron has enjoyed exceptional pricing power, an advantage that strongly supports the continued momentum in its stock. Since being added to the Zacks Rank #1 (Strong Buy) list on August 20, 2025, Micron stock has soared a staggering 865% .\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AMAT",
      "Date": "2026-02-14",
      "Time": "07:07:00",
      "Source": "TheStreet",
      "Title": "BofA revamps Applied Materials stock price target after CEO message",
      "URL": "https://finance.yahoo.com/m/2c08fc88-27e9-329a-b57c-2eae160b3b28/bofa-revamps-applied.html",
      "Content": "Applied Materials ( AMAT ) reported its Q1 earnings on February 12. The earnings beat consensus estimates for adjusted EPS and revenue, and the stock is trading 10% higher at the time of writing, Friday morning, Feb. 13, according to Yahoo Finance .\n\nThe supplier of semiconductor and semiconductor-related fabrication equipment reported revenue of $7 billion, a 2% year-over-year decline, yet the earnings report got investors excited and prompted Bank of America analyst Vivek Arya to raise his price target for Applied Materials.\n\nThe cause of excitement was CEO Gary Dickerson’s prepared remarks during the earnings call : “For Applied, we expect to grow our semiconductor equipment business more than 20% this calendar year. We see the demand profile weighted towards the second half of the calendar year, with availability of customer cleanroom space being a key factor pacing the rate of investment.”\n\nDickerson continued by making this great outlook sound even better. “Our largest customers are giving us increased longer-term visibility to ensure we have operational capacity and service support in place for their ramps,\" he added.\n\n\"Based on this visibility, we expect strong growth momentum to be carried into 2027.”\n\nTo put it all in perspective, we can look at the complete Q2 guidance versus what analysts expected. The numbers come from the Bank of America research note shared with TheStreet.\n\nMetric\n\nManagement Guidance (Q2 2026)\n\nWall Street Consensus\n\nBank of America\n\nTotal Revenue\n\n$7.65 Billion (±$500M)\n\n$7.03 Billion\n\n$6.85 billion\n\nNon-GAAP Diluted EPS\n\n$2.64 (±$0.20)\n\n$2.29\n\n$2.20\n\nNon-GAAP Gross Margin\n\n~49.3%\n\n48.5%\n\n48.4%\n\nThe great outlook makes even more sense when we consider what the Semiconductor Industry Association (SIA) estimates for 2026.\n\n“The global semiconductor industry posted its highest-ever annual sales in 2025, nearly hitting $800 billion, and global sales in 2026 are projected to reach roughly $1 trillion,” stated SIA CEO John Neuffer.\n\nFollowing the report’s release, Bank of America analyst Vivek Arya and his team updated their view on AMAT stock.\n\nRevenue of $7.65 billion\n\nNon-GAAP diluted EPS of $2.64\n\nNon-GAAP gross margin of 49.3%\n\nThe team estimates the company will gain approximately 1% in 2026, thanks to cyclical growth, leadership in DRAM, advanced packaging, and deposition and conductor etch systems.\n\nAnalysts raised their non-GAAP EPS estimates for 2026 and 2027 by 18% and 24% to $11.86 and $14.57, respectively.\n\nApplied Global Services could grow at a rate higher than the typical low-double-digit pace through steady install base expansion, with all recurring revenue helping fund capital returns.\n\nApplied Materials captures more than 50% of the serviceable addressable market share in inflection points such as Gate-All-Around (GAA) and backside power delivery, where revenue opportunities increase by 30% versus FinFET .\n\nSystems' gross margins of 54% improved by 1% year over year and can expand further as Applied Materials prices to value.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MU",
      "Date": "2026-02-14",
      "Time": "06:00:00",
      "Source": "Zacks",
      "Title": "Top Stock Reports for Micron Technology, Goldman Sachs & Verizon",
      "URL": "https://finance.yahoo.com/news/top-stock-reports-micron-technology-220000475.html",
      "Content": "Friday, February 13, 2026\n\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Micron Technology, Inc. (MU), The Goldman Sachs Group, Inc. (GS) and Verizon Communications Inc. (VZ), as well as two micro-cap stocks Natural Grocers by Vitamin Cottage, Inc. (NGVC) and Team, Inc. (TISI). The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\n\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\n\nYou can see all of today&rsquo;s research reports here >>>\n\nAhead of Wall Street\n\nThe daily 'Ahead of Wall Street' article is a must-read for all investors who would like to be ready for that day's trading action. The article comes out before the market opens, attempting to make sense of that morning's economic releases and how they will affect that day's market action. You can read this article for free on our home page and can actually sign up there to get an email notification as this article comes out each morning.\n\nYou can read today's AWS here >>> Near-Perfect CPI Report Brings Pre-Markets Near Breakeven\n\nToday's Featured Research Reports\n\nMicron Technology&rsquo;s shares have outperformed the Zacks Computer - Integrated Systems industry over the past six months (+227.9% vs. +59.6%). The company is benefiting from the rapidly expanding artificial intelligence (AI)-driven memory and storage markets. The positive impacts of inventory improvement across multiple end markets are driving top-line growth.\n\nThe surging demand for HBM and robust DRAM pricing recovery will aid significant revenue and earnings growth in the coming quarters. Its solid financials, positive free cash flow and strong balance sheet provide the flexibility to invest in growth initiatives while enhancing shareholder value.\n\nMicron Technology&rsquo;s long-term customer agreements and expanding AI partnerships reduce volatility and enhance revenue visibility. Nonetheless, rising operating costs and a massive increase in capital expenditure pose a downside risk to Micron&rsquo;s near-term profitability.\n\n(You can read the full research report on Micron Technology here >>> )\n\nShares of Goldman Sachs have outperformed the Zacks Financial - Investment Bank industry over the past six months (+22.3% vs. +7.5%). The company beat earnings estimates in each of the trailing four quarters. It is refocusing on the core strengths of investment banking (IB) and trading businesses through restructuring and scaling back its consumer banking footprint, which will likely support top line growth in the upcoming period.\n\nHowever, its high dependence on overseas revenues is worrisome. The rising expense base due to ongoing investments in technology and elevated transaction-based costs during periods of higher client activity might hamper near term profitability.\n\nNonetheless, the company's expansion in the private equity credit market is expected to diversify revenues and will support its growth over the long run. Further, a solid liquidity profile will support its capital distribution activities.\n\n(You can read the full research report on Goldman Sachs here >>> )\n\nVerizon&rsquo;s shares have outperformed the Zacks Wireless National industry over the past six months (+17.7% vs. -1.3%). The company recorded solid fourth-quarter 2025 results, with both adjusted earnings and revenues beating the respective Zacks Consensus Estimate. The buyout of Frontier Communications has accelerated its broadband expansion plans.\n\nVerizon appears to be at a critical inflection point and remains focused on making necessary capital expenditures for steady 5G deployment, the densification of the 4G LTE wireless network to cater to huge traffic demands across multiple verticals and fiber densification.\n\nHowever, the spectrum crunch has become a major issue in the U.S. telecom industry. Most of the carriers are finding it increasingly difficult to manage surging data traffic. High spending on promotional activities to attract customers is straining Verizon&rsquo;s profits. Weakness in the wireline business is another concern.\n\n(You can read the full research report on Verizon here >>> )\n\nShares of Natural Grocers by Vitamin Cottage have underperformed the Zacks Food - Natural Foods Products industry over the past six months (-32.8% vs. -25.9%). This microcap company with a market capitalization of $595.64 million is facing risks which include margin pressure from inventory shrink, long-term lease obligations limiting flexibility, macro and supply chain vulnerabilities, and weak digital capabilities. Trading at just 0.43X EV/sales and 6.02X EV/EBITDA, valuations are attractive versus peers.\n\nNevertheless, Natural Grocers posted a 14% YoY rise in Q1 FY26 net income to $11.3M, with EPS up to 49 cents, supported by disciplined cost control and 1.6% revenue growth. EBITDA rose to $22.6M, highlighting operational leverage despite modest top-line gains. Strong liquidity ($23.2M cash, $67.6M credit availability) and a debt-light balance sheet support a 25% dividend hike and active buybacks.\n\nNatural Grocers by Vitamin Cottage is expanding cautiously with 6&ndash;8 new stores planned, enhancing brand reach in underserved markets. Its 900+ private-label SKUs support margin and loyalty, reinforcing differentiation in the competitive organic segment. Operating efficiency improved.\n\n(You can read the full research report on Natural Grocers by Vitamin Cottage here >>> )\n\nTeam&rsquo;s shares have underperformed the Zacks Building Products - Maintenance Service industry over the past six months (-34.3% vs. +2.5%). This microcap company with a market capitalization of $65.64 million is facing structural leverage, high interest burden, persistent GAAP losses, working capital drag, MS segment margin volatility and contingent legal liabilities. Upside hinges on sustained margin expansion, cash flow conversion and progress toward double-digit adjusted EBITDA margins.\n\nNevertheless, Team benefits from a large, durable opportunity in critical infrastructure services, supported by aging assets, regulatory requirements, and sustained energy, midstream and industrial demand. The third-quarter 2025 results showed solid execution, with 6.7% year-over-year revenue growth, strong momentum in the IHT and MS segments, and meaningful margin expansion,driven by pricing, mix and cost discipline.\n\nCanadian operations are recovering, validating localized commercial strategies, while an integrated service model supports lifecycle-driven growth and operating leverage.\n\n(You can read the full research report on Team here >>> )\n\nOther noteworthy reports we are featuring today include Hilton Worldwide Holdings Inc. (HLT), Sun Life Financial Inc. (SLF) and Tenet Healthcare Corp. (THC).\n\nMark Vickery\nSenior Editor\n\nNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\n\nToday's Must Read\n\nMicron (MU) Gains From Rising AI Spending and Inventory Improvement\n\nFocus on IB and Trading Businesses Aid Goldman's (GS) Growth\n\nVerizon (VZ) Rides on Holistic Growth for Solid Wireless Traction\n\nFeatured Reports\n\nHilton (HLT) Aids From Expansion and RevPAR Growth Amid China Weakness\nPer the Zacks analyst, Hilton is benefiting from strong net unit growth, RevPAR improvement and global expansion. However, weak performance in China and macroeconomic uncertainty remain key concerns.\n\nSun Life (SLF) Gains on Solid Asia Business Amid High Costs\nPer the Zacks analyst, Sun Life is set for grow on solid Asia business that are expected to provide higher return and expanding global asset management business. However, high costs remain a concern.\n\nGrowing Revenues, Acquisitions Aid Tenet Healthcare (THC)\nPer the Zacks analyst, Tenet Healthcare's rising top line, driven by higher adjusted admissions and surgeries, will pave the way for growth. Acquisitions enable it to expand its capabilities.\n\nIncreasing Orders Drive Kratos Defense (KTOS) Amid Labor Shortage\nPer the Zacks analyst, Kratos Defense is likely to benefit from increasing orders from the Pentagon and US allies. Yet labor shortage result in delays and likely impact operating results.\n\nHalozyme's (HALO) ENHANZE Drug Delivery Technology Aid Growth\nPer the Zacks Analyst, Halozyme's collaboration deals with large pharma companies related to ENHANZE technology, drives revenues growth. Over dependence on partners for revenues remains a concern.\n\nLyft Continues to Gain From Rideshare Market Amid Rising Expenses\nThe Zacks Analyst is impressed that an uptick in driver supply boosts Lyft's gross bookings. Escalating operating expenses are likely to hurt the company's bottom line.\n\nNabors (NBR) Buoyed by Strengthened Balance Sheet\nThe Zacks analyst notes that Nabors cut its net debt by $550 million that lowered leverage to 1.7x, boosting balance sheet strength, but modest 2026 guidance raises concern.\n\nNew Upgrades\n\nLattice (LSCC) Rides on Solid Traction in AI Data Center Vertical\nPer the Zacks analyst, rapid AI server growth, higher FPGA attach rates per server, and increasing average selling prices will likely drive Lattice's top line.\n\nStrategic Priorities, Strong Solvency Aid Envista (NVST)\nThe Zacks Analyst is impressed with Envista's strategic and operational progress, that signals long-term value creation. Also, a favorable solvency amid the ongoing macro-uncertainty bodes well.\n\nLoans, Fee Income and Stabilizing Funding Costs Aid BankUnited (BKU)\nPer the Zacks analyst, decent loan demand, stabilizing funding costs and focus on fee income will aid BankUnited. A solid balance sheet and liquidity position will support its capital distributions.\n\nNew Downgrades\n\nDeclining HDMC Margins and Dealer Inventory Imbalance Ail Harley (HOG)\nPer the Zacks analyst, higher tariff costs are expected to compress Harley-Davidson Motor Company's gross margins. Also, dealer inventory imbalances can pressure pricing.\n\nSoftness in Rent-A-Center Segment Hurts Upbound's (UPBD) Top Line\nPer the Zacks analyst, softness in Upbound's Rent-A-Center (RAC) segment continues to weigh on overall performance. Revenue at RAC declined 4.7% year over year to $461.1 million in the third quarter.\n\nRising Infrastructure Costs Hurt Cloudflare's (NET) Gross Margins\nPer the Zacks analyst, Cloudflare's gross margin is hurt by rising infrastructure and traffic-related costs tied to higher usage and product mix shifts, mainly from fast-growing platform services.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MU",
      "Date": "2026-02-14",
      "Time": "04:02:28",
      "Source": "Barchart",
      "Title": "Competition Is Heating Up for Micron. Should You Buy, Sell, or Hold MU Stock Now?",
      "URL": "https://finance.yahoo.com/m/0a217c71-2823-3481-b3b8-a8566d088e5b/competition-is-heating-up-for.html",
      "Content": "Artificial intelligence (AI) is reshaping the tech landscape at breakneck speed, and investors are scrambling to lock in the biggest winners. Yet even in a crowded AI trade, few names have delivered like Micron Technology (MU). The memory-chip giant has ridden the AI wave to record highs, with MU stock delivering massive returns over the past year. Surging demand for memory chips from AI hyperscalers racing to build out massive data center capacity has been the primary engine behind Micron’s remarkable ascent.\n\nBut every rally eventually meets a reality check. Micron’s momentum recently hit a speed bump earlier this week after reports suggested that Samsung Electronics is nearing certification from Nvidia (NVDA) for its next-generation HBM4 chips. High-bandwidth memory (HBM), a specialized chip designed to move enormous volumes of data at ultra-fast speeds, is a critical component inside AI accelerators.\n\n1 High-Yield Dividend Stock to Buy Hand Over Fist in February 2026\n\n4,500 Reasons to Buy Amazon Stock Today\n\nStocks Plunge on Tech Weakness and AI Fears\n\nGet exclusive insights with the FREE Barchart Brief newsletter. Subscribe now for quick, incisive midday market analysis you won't find anywhere else.\n\nNvidia relies heavily on HBM for its AI processors, making supplier approvals a closely watched development on Wall Street. Now, with Samsung reportedly preparing to begin mass production of its next-generation HBM chips earlier than expected, competitive dynamics in the AI memory space could shift quickly.\n\nThe South Korean tech giant’s progress threatens to add meaningful pressure on Micron, which is a key supplier of advanced memory products used across data centers and AI infrastructure. Given this latest development, should you buy, sell, or hold MU stock? Let's take a closer look.\n\nBased in Boise, Idaho, Micron Technology stands at the center of the global memory market, supplying the chips that quietly power today’s data-driven world. The company designs and manufactures a broad portfolio of DRAM, NAND, and NOR memory products that sit inside everything from cloud data centers to smartphones and connected devices.\n\nWith a strong emphasis on engineering expertise and manufacturing scale, Micron plays a critical role in enabling AI workloads and other compute-intensive applications. From large-scale data centers to edge devices and mobile platforms, its memory and storage solutions form the backbone of systems that process, store, and move vast amounts of information every day. With a market capitalization of roughly $465 billion, Micron has grown into a semiconductor heavyweight.\n\nShares dipped about 2.8% on Feb. 9 following news surrounding Samsung, but that pullback barely dents what has been an extraordinary run. Over the past year, the stock has skyrocketed an eye-popping 336%, leaving the broader S&P 500 Index ($SPX) — up just 12% over the same stretch — far in the dust. After touching a record high of $455.50 last month, Micron now sits only about 9% below that peak, underscoring just how powerful its AI-fueled rally has been.\n\nWhile Micron has delivered a breathtaking rally, its valuation remains far from excessive. MU stock trades at roughly 12.6 times forward earnings, a sharp discount to the sector median of 23.6 times. For a company powering the AI memory boom, that gap suggests investors are still paying a relatively modest price for its growth trajectory, even after an extraordinary run.\n\nMicron kicked off fiscal 2026 with a strong quarter. In its Dec. 17 earnings report, the company crushed both top- and bottom-line expectations, posting revenue of $13.6 billion, up 57% year-over-year (YOY) and comfortably ahead of the $12.7 billion consensus estimate. The results marked Micron’s third-straight quarter of record revenue, powered by a 69% surge in DRAM sales and a 22% increase in NAND revenue.\n\nDRAM alone generated $10.8 billion, accounting for 79% of total sales, while NAND contributed $2.7 billion, or 20%. Notably, total company revenue, DRAM and NAND revenue, HBM and data center revenue, and revenue across each business unit all reached new records. Cloud memory sales climbed to $5.28 billion, doubling YOY, while core data center revenue rose 4% annually to $2.38 billion.\n\nThe company said performance across both major segments was driven by higher pricing. Profitability also followed a similar growth trajectory. Adjusted gross margin came in at 56.8%, up from 39.5% in the year-ago quarter. On the bottom line, adjusted EPS soared a stunning 167% YOY to $4.78, crushing the Street’s $3.78 estimate.\n\nLooking ahead, Micron struck an optimistic tone for Q2 fiscal 2026, projecting revenue of around $18.7 billion and adjusted EPS of $8.42. Management expects strong AI-driven demand across data centers and edge computing to continue, even as supply constraints are likely to persist through 2026, a backdrop that could further reinforce pricing strength.\n\nDespite intensifying competition, Wall Street’s conviction in Micron remains firmly intact. MU stock carries a consensus “Strong Buy” rating, with 33 out of 42 analysts calling it a “Strong Buy,” six assigning a “Moderate Buy” rating, and just three recommending a “Hold.”\n\nEven after its powerful run, optimism hasn’t faded. While MU has already surged beyond its average price target of $345.97, the Street-high target of $500 implies that there could still be roughly 21% upside ahead. That's a sign that many analysts believe the AI-driven momentum is far from over.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-02-14",
      "Time": "03:10:00",
      "Source": "Motley Fool",
      "Title": "2 AI Stocks That Could Go Parabolic",
      "URL": "https://finance.yahoo.com/m/6f238a68-97f3-3e7a-9319-183bda38ddfc/2-ai-stocks-that-could-go.html",
      "Content": "Wall Street may argue all about the artificial intelligence (AI) bubble, but big tech's spending plans in global AI infrastructure are too large to ignore, right now. Amazon , Alphabet , Microsoft , and Meta Platforms expect to collectively spend roughly $650 billion on AI infrastructure in 2026, up about 60% year over year.\n\nWill AI create the world's first trillionaire? Our team just released a report on the one little-known company, called an \"Indispensable Monopoly\" providing the critical technology Nvidia and Intel both need. Continue »\n\nWith a significant portion of this spending already locked in through data center permits, power contracts, and supply agreements, core AI infrastructure players such as Nvidia (NASDAQ: NVDA) and Broadcom (NASDAQ: AVGO) are likely to benefit from the near-term demand.\n\nHere's why stocks of these two companies can go parabolic in the coming years.\n\nNvidia's CEO, Jensen Huang, refers to AI as the \"largest infrastructure buildout in human history.\" The company estimates global AI infrastructure spending to reach $3 trillion to $4 trillion by the end of 2030. With a full-stack AI platform that includes hardware, software, and enterprise platforms and an annual product cadence (releasing new upgrades and architectures each year), the company is well-positioned to capitalize on this opportunity.\n\nIn 2026, hyperscalers are increasingly adopting Nvidia's Blackwell B200 systems, which the company claims deliver up to 30x higher inference (real-time model deployment) performance and better power efficiency than the prior-generation H100 chips. The company is also focusing on selling rack-scale solutions such as GB200 NVL72 \"AI factory\" systems, which bundle CPUs, GPUs, networking interconnects, and supporting software into complete AI server solutions, instead of stand-alone chips. This transition can eventually boost average selling prices and the company's margins.\n\nBeyond Blackwell, the company has introduced the Vera Rubin system, a six-chip platform designed to deliver even higher performance and power efficiency than Blackwell systems for complex AI and agentic AI workloads. With Vera Rubin currently in full production, the company expects to launch these systems in the second half of 2026. Management has highlighted cumulative revenue visibility for Nvidia's Blackwell and Rubin systems of over $500 billion from the start of 2025 through the end of 2026.\n\nConsidering these tailwinds, Nvidia's stock may soar in the coming years.\n\nBroadcom is also a major beneficiary of the increasing enterprise and hyperscaler spending on custom chips and high-speed networking in AI data centers.\n\nAccording to research firm Counterpoint, hyperscalers are increasingly deploying custom AI server chips for specialized AI training and real-time deployment workloads. Broadcom is estimated to account for almost 60% share of this market by 2027.\n\nThat growing adoption is already translating into a multiyear backlog. Broadcom exited fiscal 2025 (ending Nov. 2, 2025) with a consolidated backlog of $162 billion, of which custom AI chips accounted for $73 billion to be delivered over the next 18 months. The company's networking switches are also seeing increased demand in AI data centers, as evidenced by the over $10 billion AI switch backlog at the end of fiscal 2025.\n\nBroadcom reported a 65% year-over-year jump in AI revenues to $20 billion, driven by demand for custom chips, high-speed networking, and optical interconnects. This revenue growth trajectory can become even steeper if the company's backlog converts as expected or faster, and it has a few new multiyear client wins.\n\nHence, Broadcom can see parabolic growth even at current elevated valuation levels.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AMD",
      "Date": "2026-02-14",
      "Time": "01:44:45",
      "Source": "GuruFocus.com",
      "Title": "AMD Rated Neutral on AI Competition Concerns",
      "URL": "https://finance.yahoo.com/news/amd-rated-neutral-ai-competition-174445344.html",
      "Content": "This article first appeared on GuruFocus .\n\nAdvanced Micro Devices ( AMD , Financials ) was initiated with a Neutral rating by DA Davidson , with a $220 price target implying limited upside from current levels.\n\nWarning! GuruFocus has detected 5 Warning Signs with AMD.\n\nIs AMD fairly valued? Test your thesis with our free DCF calculator.\n\nGil Luria, an analyst, noted that the company's caution has nothing to do with AMD's overall business, which is still strong in consumer and server CPUs. Instead, the worry is about AMD's ability to compete in the rapidly rising market for artificial intelligence accelerators.\n\nLuria said that performance at scale depended on more than just chip characteristics, even if AMD's Instinct MI300 GPUs seem to do well on technical benchmarks. Nvidia is ahead of the game when it comes to sophisticated networking, software integration, and ecosystem support, which are all things that large AI training clusters need.\n\nThe expert said that AMD was behind in AI accelerators and that big AI developers still relied largely on Nvidia systems for heavy workloads.\n\nEven if the company is neutral, the overall mood on Wall Street is still favorable, and many analysts still give AMD buy recommendations because they think the company has a lot of room to develop in the long run.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-02-14",
      "Time": "01:21:36",
      "Source": "Barchart",
      "Title": "How Much Further Will Qualcomm Fall After 18% Slide This Year?",
      "URL": "https://finance.yahoo.com/m/7b73c7c7-d4fe-3ec1-993e-d95ebb97af00/how-much-further-will.html",
      "Content": "Shares of Qualcomm (QCOM) have struggled so far this year, with the stock down more than 18% year-to-date (YTD) and nearly 32% below its 52-week high. Despite the significant pullback, unfavorable industry dynamics around memory supply could weigh on QCOM’s earnings. With sentiment already negative, the possibility of the stock revisiting its two-year low of $120.80 cannot be ruled out.\n\nQualcomm delivered better-than-expected Q1 financial numbers. Revenue of $12.3 billion rose 5% YoY and slightly exceeded consensus expectations, reflecting steady demand across key end markets. The Qualcomm Technology Licensing (QTL) segment delivered $1.6 billion in revenue with a strong EBT margin, supported by higher unit volumes and a favorable product mix.\n\n1 High-Yield Dividend Stock to Buy Hand Over Fist in February 2026\n\nA $100 Million Reason to Buy Intel Stock Now\n\n4,500 Reasons to Buy Amazon Stock Today\n\nOur exclusive Barchart Brief newsletter is your FREE midday guide to what's moving stocks, sectors, and investor sentiment - delivered right when you need the info most. Subscribe today!\n\nThe core Qualcomm CDMA Technologies (QCT) business posted revenue of $10.6 billion, driven by demand across smartphones, automotive, and IoT markets. Handset revenues within QCT climbed to a record $7.8 billion, benefiting from the launch cycle of premium flagship devices. IoT revenue grew 9% YoY to $1.7 billion, driven by consumer and networking applications, while automotive revenue reached $1.1 billion, up 15%, as adoption of Snapdragon Digital Chassis platforms accelerated.\n\nIts adjusted EPS of $3.50 rose 3% YoY and surpassed expectations.\n\nThe market’s negative reaction to QCOM stock reflects management’s weak guidance. Management guided for second-quarter revenue of $10.2 billion to $11 billion and adjusted EPS of $2.45 to $2.65, both below Wall Street expectations. This raised concerns that near-term headwinds will likely weigh on its growth.\n\nThe most significant challenge impacting Qualcomm's growth is the uncertainty in global memory markets. Surging demand for memory solutions, led by AI data centers, has diverted supply away from smartphones, driving higher prices for handset manufacturers. This has been especially disruptive in China, where OEMs are responding by scaling back production plans and tightening inventory management.\n\nWhile Qualcomm maintains that the fundamental demand environment for handsets remains intact, highlighting better-than-expected global shipments in the December quarter and a strong Snapdragon design win pipeline, the near-term outlook remains cautious. OEMs are adjusting build plans downward to manage cost pressures, and Qualcomm is seeing reduced chipset orders as a result.\n\nFor the second quarter, Qualcomm forecasts QCT handset revenues of $6 billion, reflecting a sharp sequential decline. While management expects QCT handset revenues to return to their prior growth trajectory once memory supply and pricing normalize. However, until visibility into memory availability improves and OEM production plans stabilize, Qualcomm’s earnings may remain under pressure. That uncertainty helps explain why the shares have continued to slide despite solid underlying execution.\n\nWhile the company’s handset revenues could continue to face near-term pressure, management has pointed to meaningful strength in other businesses.\n\nQualcomm’s QCT IoT revenue is projected to grow by a low teens percentage YoY. That growth will likely be driven by expanding demand across both industrial and consumer IoT applications. Further, the momentum in the QCT automotive business will be sustained. Qualcomm anticipates YoY revenue growth accelerating to more than 35% in the second fiscal quarter.\n\nFrom a valuation standpoint, QCOM stock appears inexpensive at 16.3 times forward earnings. However, that multiple fails to attract. Analysts expect QCOM’s earnings to decline 14.7% in fiscal 2026, and there is still limited visibility into a meaningful reacceleration in fiscal 2027. With handset revenues under pressure and earnings momentum weakening, Qualcomm's stock could still remain under pressure.\n\nAnalysts maintain a “Moderate Buy” consensus rating on QCOM stock. However, if memory constraints persist longer than expected, the risk of Qualcomm shares drifting toward their two-year low increases.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ADI",
      "Date": "2026-02-14",
      "Time": "01:11:00",
      "Source": "Zacks",
      "Title": "Airbnb Q4 Earnings Miss Estimates, Revenues Rise Y/Y, Shares Up",
      "URL": "https://finance.yahoo.com/news/airbnb-q4-earnings-miss-estimates-171100231.html",
      "Content": "Airbnb ABNB reported fourth-quarter 2025 adjusted earnings of 56 cents per share, which lagged the Zacks Consensus Estimate by 14.89%. The company reported adjusted earnings of 73 cents per share in the year-ago quarter.\n\nRevenues of $2.78 billion increased 12% year over year on a reported basis and 11% on a forex-neutral basis, driven by solid growth in nights stayed and a slight increase in Average Daily Rate (ADR). The top line beat the Zacks Consensus Estimate by 2.01%.\n\nFollowing the results, ABNB shares were up roughly 3.98% at the time of writing this article.\n\nThe fourth quarter of 2025 Gross Booking Value (GBV) was $20.4 billion, up 16% year over year on a reported basis or 13% excluding the impact of forex. The take rate (defined as revenue divided by GBV) of 13.6% decreased year over year compared with 14.1% in the year-ago quarter. For 2025, revenues from guest travel insurance, which is available in 12 of ABNB’s largest countries, increased more than 40% year over year.\n\nAirbnb, Inc. price-consensus-eps-surprise-chart | Airbnb, Inc. Quote\n\nNights and Seats Booked were 121.9 million, up 9.8% year over year. This growth was observed across all regions, with Latin America growing in the high teens, Asia Pacific in the mid-teens, EMEA in the high single digits and North America in the mid-single digits.\n\nADR (Gross Booking Value per Night and Experience Booked) was $168, up 6% on a year-over-year basis. Excluding forex, ADR grew 3% year over year and increased across all regions due to price appreciation.\n\nNights booked on the app in the fourth quarter increased 20% year over year and comprised 64% of total nights booked (up from 60% in the year-ago quarter). The company also reported year-over-year growth of first-time bookers, which accelerated to 8% in the fourth quarter of 2025, driven by strong results across all age cohorts.\n\nIn the fourth quarter of 2025, total costs and expenses as a percentage of revenues increased 770 basis points (bps) year over year to 90.3% in the reported quarter. Cost of revenues increased 30 bps year over year. Product development declined 50 bps while sales and marketing expenses increased 300 bps. Operations and support, and general and administrative, as a percentage of revenues, increased 10 bps and 480 bps, respectively.\n\nAdjusted EBITDA was $786 million, up 2.7% year over year on a reported basis. The adjusted EBITDA margin was 28.3%, down 260 bps year over year.\n\nThe fourth quarter of 2025 operating margin contracted 770 bps year over year to 9.7%.\n\nAs of Dec. 31, 2025, cash and cash equivalents, short-term investments, and restricted cash amounted to $11 billion compared with $11.68 billion as of Sept. 30, 2025. ABNB had $7 billion of funds held on behalf of guests.\n\nNet cash provided by operating activities was $526 million in the fourth quarter of 2025, down from $1.36 billion reported in the third quarter of 2025 but up from $466 million in the year-ago quarter.\n\nAirbnb generated a free cash flow of $521 million in the fourth quarter of 2025 and $4.61 billion over the trailing 12 months.\n\nABNB repurchased shares worth $1.1 billion in the fourth quarter of 2025. As of Dec. 31, 2025, the company has $5.6 billion remaining under repurchase authorization.\n\nFor the first quarter of 2026, Airbnb expects revenues between $2.59 billion and $2.63 billion, reflecting a year-over-year increase of 14-16%. Gross booking value (GBV) is expected to grow low teens year over year.\n\nFor the first quarter of 2026, Airbnb expects GBV to grow in the low teens year over year, driven by high single-digit growth in Nights and Seats Booked and a moderate increase in ADR (Average Daily Rate).\n\nFor the first quarter of 2026, Airbnb expects adjusted EBITDA to be approximately flat on a year-over-year basis.\n\nFor 2026, year-over-year revenue growth is expected to accelerate to at least low double digits, driven by sustained strength in the core business, healthy demand and execution of key growth initiatives.\n\nFor 2026, Airbnb expects adjusted EBITDA to be stable on a year-over-year basis.\n\nAirbnb currently has a Zacks Rank #2 (Buy).\n\nSome other top-ranked stocks in the broader Zacks Computer and Technology sector include Analog Devices ADI, Applied Optoelectronics AAOI, and MKS MKSI. While MKSI sports a Zacks Rank #1 (Strong Buy), Analog Devices and Applied Optoelectronics carry a Zacks Rank of 2 at present. You can see the complete list of today’s Zacks #1 Rank stocks here .\n\nAnalog Devices’ shares have gained 58.2% in the past 12-month period. Analog Devices is scheduled to release first-quarter 2026 results on Feb. 18, 2026.\n\nApplied Optoelectronics shares have returned 62.7% in the past 12-month period. Applied Optoelectronics is set to report fourth-quarter 2025 results on Feb. 26.\n\nMKS shares have surged 143.7% in the past 12-month period. MKS is set to report its fourth-quarter 2025 results on Feb. 17, 2026.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-02-14",
      "Time": "00:51:00",
      "Source": "Zacks",
      "Title": "ALAB Stock Dips 31% Post Q4 Earnings: Should You Buy, Hold, or Sell?",
      "URL": "https://finance.yahoo.com/news/alab-stock-dips-31-post-165100520.html",
      "Content": "Astera Labs ALAB shares have plunged 30.8% since it reported fourth-quarter 2025 results on Tuesday. The decline was due to a slight decrease in non-GAAP gross margin in the fourth quarter of 2025, which dropped 70 basis points sequentially to 75.7% compared to the previous quarter. This decrease was primarily attributed to a higher mix of hardware sales.\n\nNon-GAAP operating margins also fell 150 basis points sequentially to 40.2%, driven by a $16 million increase in operating expenses due to the expansion of the R&D organization, including the aiXscale acquisition.\n\nALAB’s shares have also plunged 33.6% in the trailing six-month period, underperforming the broader Zacks Computer & Technology sector’s rise of 10.3% and the Zacks Internet - Software industry’s decline of 20.3% over the same time frame. The underperformance can be attributed to challenging macroeconomic uncertainties and stiff competition in the PCIe retimers market.\n\nHowever, the company is benefiting from its robust and diversified product portfolio to address the growing demands of AI infrastructure and connectivity solutions, as well as its expanding partner base. It benefits from strong demand for its PCIe solutions, which have also been a major growth driver.\n\nImage Source: Zacks Investment Research\n\nAstera Labs’ product portfolio, including Scorpio, Aries, and Taurus, has been a key catalyst. In the fourth quarter of 2025, ALAB started increasing production of its Scorpio X-Series lead platform.\n\nThe company also expanded the Smart Fabric Switch roadmap with hyperscaler partners, adding new features to meet the needs of next-generation scale-up networking. Early interest from customers is pushing more investment into the quickly growing merchant scale-up switching market, which is expected to reach $20 billion by 2030.\n\nIn the fourth quarter of 2025, ALAB expanded its product portfolio with custom NVLink Fusion connectivity solutions designed with hyperscaler partners to optimize heterogeneous AI infrastructure performance, improve energy efficiency, and reduce cost across diverse next-generation AI workloads.\n\nALAB’s expanding portfolio underpins the company’s expectation that its served addressable market opportunity will expand by more than 10x over the next five years to reach $25 billion. This growth is expected to be driven by its copper-based product families, including Aries and Taurus signal conditioning solutions, Scorpio AI fabric switches, Leo CXL Memory Controllers, and custom solutions for scale-up connectivity.\n\nAster Lab is benefiting from strong demand for its Aries, Taurus, and Scorpio product families, all of which are expected to drive growth in the first quarter of 2025.\n\nAstera Labs expects first-quarter 2026 revenues between $286 million and $297 million. Earnings are expected to be between 53 cents and 54 cents per share for the first quarter.\n\nThe Zacks Consensus Estimate for first-quarter 2026 earnings is pegged at 52 cents per share, unchanged over the past 30 days. The figure calls for a year-over-year increase of 57.58%.\n\nAstera Labs, Inc. price-consensus-chart | Astera Labs, Inc. Quote\n\nDespite an expanding portfolio and strong partner base, ALAB is facing stiff competition from other industry players like Marvell Technology MRVL, Credo Technology CRDO, and Broadcom AVGO in the connectivity space.\n\nMarvell Technology is expanding its portfolio through acquisitions. Marvell Technology recently completed its acquisition of Celestial AI, strengthening its scale-up optical connectivity capabilities for large-scale AI deployments.\n\nCredo Technology is expanding its footprint in the PCIe retimers market with a healthy pipeline of PCIe Gen6 AECs and retimers, with further customer wins expected to support fiscal 2026 growth. Credo Technology’s shares have rallied 3.8% in the trailing six-month period.\n\nBroadcom is expanding its footprint in the PCIe retimers market by developing advanced solutions that enhance signal quality and extend the reach of PCIe connections in high-speed data environments. Broadcom shares have surged 50.3% in the trailing 12-month period.\n\nAstera Labs’ stock is trading at a premium, as suggested by the Value Score of F.\n\nIn terms of the forward 12-month Price/Sales, ALAB is trading at 17.67X, higher than the Computer & Technology sector’s 6.51X.\n\nImage Source: Zacks Investment Research\n\nAstera Labs’ strong fundamentals, expanding partnerships, and rising AI demand reinforce its leadership in connectivity solutions. However, challenging macroeconomic uncertainties and stiff competition remain a headwind. Stretched valuation also remains a concern.\n\nAstera Labs currently has a Zacks Rank #3 (Hold), suggesting that it may be wise to wait for a more favorable entry point to accumulate the stock. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ADI",
      "Date": "2026-02-13",
      "Time": "22:56:00",
      "Source": "Zacks",
      "Title": "Applied Materials Q1 Earnings Beat Estimates, Revenues Fall Y/Y",
      "URL": "https://finance.yahoo.com/news/applied-materials-q1-earnings-beat-145600580.html",
      "Content": "Applied Materials AMAT reported first-quarter fiscal 2026 non-GAAP earnings of $2.38 per share, which beat the Zacks Consensus Estimate by 8.7%. AMAT’s first-quarter fiscal 2026 non-GAAP earnings remained flat from the year-ago quarter’s reported figure.\n\nAMAT beat the Zacks Consensus Estimate in each of the trailing four quarters, with an average surprise of 5.2%.\n\nAMAT reported revenues of $7.01 billion in the first quarter of fiscal 2026, surpassing the Zacks Consensus Estimate by 1.79%. The top line decreased 2.2% from the year-ago quarter.\n\nThis strong quarterly result pushed AMAT stock up 11.8% in Friday's pre-market session. AMAT stock has surged 112% in the past year.\n\nApplied Materials, Inc. price-consensus-eps-surprise-chart | Applied Materials, Inc. Quote\n\nSegment-wise, Semiconductor Systems generated revenues of $5.14 billion, contributing 73.3% to total net revenues and declining 8.1% from the year-ago quarter.\n\nApplied Global Services posted revenues of $1.56 billion (22.2% of total net revenues), which increased 15.2% year over year.\n\nOther revenues totaled $312 million (4.4% of total revenues), up 44.4% year over year.\n\nRevenues in the United States, Europe, Japan, Korea, Taiwan, Southeast Asia and China were $656 million, $221 million, $525 million, $1.46 billion, $1.72 billion, $335 million and $2.1 billion, contributing 9%, 3%, 7%, 21%, 25%, 5% and 30% to total net sales, respectively.\n\nYear over year, revenues in Taiwan and Southeast Asia grew 45.6% and 17.1%, respectively, while revenues in Japan, Europe, China, Korea and the United States declined 2.8%, 33.0%, 6.6%, 12.5% and 28.5%, respectively.\n\nThe non-GAAP gross margin was 49.1%, expanding 20 basis points year over year. Non-GAAP operating expenses were $1.34 billion, up 1.7% year over year.\n\nThe non-GAAP operating margin came in at 30.0%, down 60 basis points from the year-ago quarter.\n\nAs of Jan. 25, 2026, cash and cash equivalents plus short-term investments were $8.51 billion, compared with $8.57 billion at the end of the prior quarter. Long-term debt was $6.45 billion at the end of the first quarter of fiscal 2026.\n\nApplied Materials generated non-GAAP free cash flow of $1.04 billion. The company returned $702 million to shareholders, including $337 million in share repurchases and $365 million in dividends for the quarter.\n\nFor the fiscal second quarter of 2026, Applied Materials expects net sales of $7.65 billion (+/- $500 million). The Zacks Consensus Estimate for the second quarter of fiscal 2026 is pegged at $7.03 billion, indicating a year-over-year decline of 1%.\n\nSemiconductor Systems, Applied Global Services, and Display (reported under Corporate & Other) sales are anticipated to be $5.80 billion, $1.60 billion, and $250 million, respectively.\n\nApplied Materials expects a non-GAAP gross margin of approximately 49.3% and non-GAAP operating expenses of around $1.42 billion. It projects a non-GAAP tax rate of roughly 11%.\n\nManagement expects non-GAAP earnings per share of $2.64 (+/- $0.20). The Zacks Consensus Estimate for second-quarter fiscal 2026 is pegged at $2.29, indicating a year-over-year rise of 2.1%.\n\nAMAT carries a Zacks Rank #2 (Buy) at present.\n\nMKS MKSI sports a Zacks Rank #1 (Strong Buy). MKS shares have gained 133% in the past 12-month period. The company is scheduled to report its fourth-quarter 2025 results on Feb. 17, 2026. You can see the complete list of today’s Zacks #1 Rank stocks here .\n\nAnalog Devices ADI carries a Zacks Rank #2 at present. Analog Devices shares have surged 64.3% in the trailing 12-month period. Analog Devices is set to report its earnings on Feb. 18, 2026.\n\nApplied Optoelectronics AAOI carries a Zacks Rank #2 at present. Applied Optoelectronics shares have surged 93.4% in the trailing 12-month period. Applied Optoelectronics is slated to report fourth-quarter 2025 results on Feb. 26.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ADI",
      "Date": "2026-02-13",
      "Time": "22:30:04",
      "Source": "Zacks",
      "Title": "Is It Worth Investing in Analog Devices (ADI) Based on Wall Street's Bullish Views?",
      "URL": "https://finance.yahoo.com/news/worth-investing-analog-devices-adi-143004519.html",
      "Content": "Investors often turn to recommendations made by Wall Street analysts before making a Buy, Sell, or Hold decision about a stock. While media reports about rating changes by these brokerage-firm employed (or sell-side) analysts often affect a stock's price, do they really matter?\n\nLet's take a look at what these Wall Street heavyweights have to say about Analog Devices (ADI) before we discuss the reliability of brokerage recommendations and how to use them to your advantage.\n\nAnalog Devices currently has an average brokerage recommendation (ABR) of 1.52, on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell, etc.) made by 33 brokerage firms. An ABR of 1.52 approximates between Strong Buy and Buy.\n\nOf the 33 recommendations that derive the current ABR, 23 are Strong Buy and three are Buy. Strong Buy and Buy respectively account for 69.7% and 9.1% of all recommendations.\n\nCheck price target & stock forecast for Analog Devices here>>>\n\nWhile the ABR calls for buying Analog Devices, it may not be wise to make an investment decision solely based on this information. Several studies have shown limited to no success of brokerage recommendations in guiding investors to pick stocks with the best price increase potential.\n\nDo you wonder why? As a result of the vested interest of brokerage firms in a stock they cover, their analysts tend to rate it with a strong positive bias. According to our research, brokerage firms assign five \"Strong Buy\" recommendations for every \"Strong Sell\" recommendation.\n\nThis means that the interests of these institutions are not always aligned with those of retail investors, giving little insight into the direction of a stock's future price movement. It would therefore be best to use this information to validate your own analysis or a tool that has proven to be highly effective at predicting stock price movements.\n\nWith an impressive externally audited track record, our proprietary stock rating tool, the Zacks Rank, which classifies stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), is a reliable indicator of a stock's near-term price performance. So, validating the Zacks Rank with ABR could go a long way in making a profitable investment decision.\n\nAlthough both Zacks Rank and ABR are displayed in a range of 1--5, they are different measures altogether.\n\nBroker recommendations are the sole basis for calculating the ABR, which is typically displayed in decimals (such as 1.28). The Zacks Rank, on the other hand, is a quantitative model designed to harness the power of earnings estimate revisions. It is displayed in whole numbers -- 1 to 5.\n\nAnalysts employed by brokerage firms have been and continue to be overly optimistic with their recommendations. Since the ratings issued by these analysts are more favorable than their research would support because of the vested interest of their employers, they mislead investors far more often than they guide.\n\nIn contrast, the Zacks Rank is driven by earnings estimate revisions. And near-term stock price movements are strongly correlated with trends in earnings estimate revisions, according to empirical research.\n\nFurthermore, the different grades of the Zacks Rank are applied proportionately across all stocks for which brokerage analysts provide earnings estimates for the current year. In other words, at all times, this tool maintains a balance among the five ranks it assigns.\n\nAnother key difference between the ABR and Zacks Rank is freshness. The ABR is not necessarily up-to-date when you look at it. But, since brokerage analysts keep revising their earnings estimates to account for a company's changing business trends, and their actions get reflected in the Zacks Rank quickly enough, it is always timely in indicating future price movements.\n\nLooking at the earnings estimate revisions for Analog Devices, the Zacks Consensus Estimate for the current year has increased 0.9% over the past month to $9.97.\n\nAnalysts' growing optimism over the company's earnings prospects, as indicated by strong agreement among them in revising EPS estimates higher, could be a legitimate reason for the stock to soar in the near term.\n\nThe size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #2 (Buy) for Analog Devices. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>>\n\nTherefore, the Buy-equivalent ABR for Analog Devices may serve as a useful guide for investors.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "AMD",
      "Date": "2026-02-13",
      "Time": "22:29:03",
      "Source": "Investing.com",
      "Title": "D.A. Davidson starts coverage of AMD, INTC, AVGO and TSMC. Only 1 is Buy rated",
      "URL": "https://finance.yahoo.com/news/d-davidson-starts-coverage-amd-142903265.html",
      "Content": "Investing.com -- D.A. Davidson initiated coverage of four major semiconductor names, AMD, Intel, Broadcom and Taiwan Semiconductor Manufacturing Co. in notes to clients on Thursday, with only one receiving a Buy rating.\n\nAnalyst Gil Luria initiated coverage of the group, pointing to diverging competitive positions.\n\nOn Broadcom , D.A. Davidson stated that the company is “sitting on a shrinking iceberg” as hyperscalers increasingly favour customised accelerators.\n\nThe firm warned that the largest of customers could internalise more of their silicon stack, ultimately “pressuring supplier economics.” Luria believes Broadcom’s AI ASIC exposure does not justify “a premium multiple versus market leaders such as NVIDIA,” initiating the stock at Neutral with a $335 price target.\n\nIntel was also started at Neutral. D.A. Davidson said “it wouldn’t be an overstatement to claim that Intel is attempting one of the hardest resets in semiconductor history,” arguing the company must rebuild leading-edge process capability while proving itself as a third-party foundry.\n\nWhile noting “real developments” in the business, the firm said Intel remains “the ultimate ‘show me’ story,” and set a $45 price target.\n\nAMD received a Neutral rating as well. D.A. Davidson said AMD is “a marginal AI accelerator player … in the act of playing catch-up,” despite strength in CPUs. The firm initiated with a $220 price target.\n\nFinally, TSMC was the lone Buy. Luria said the company’s leading-edge execution represents “a durable, self-reinforcing advantage” as AI compute demand expands. He also highlighted “a compounding execution moat in leading edge manufacturing.” The analyst assigned TSM a $450 price target.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-02-13",
      "Time": "09:42:00",
      "Source": "Motley Fool",
      "Title": "The Best Stocks to Buy With $1,000 Right Now",
      "URL": "https://finance.yahoo.com/m/ab7acddd-2bea-3a35-9523-ad0dac43896e/the-best-stocks-to-buy-with.html",
      "Content": "Got some idle money you're ready to put to work for a while? Is there $1,000 you have available (or any amount, really) that you'd like to turn into something more? That's easier said than done right now. Too many stocks have demonstrated a bit too much vulnerability of late. Another wave of weakness feels possible.\n\nNot every name is uncomfortably risky here, however. Even if the market does get upended again, a few stocks are apt to hold up well enough and then enjoy more than their fair share of any recovery. Here's a rundown of three of these names.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\n\nQualcomm 's (NASDAQ: QCOM) 23% share price pullback from its early January peak makes enough superficial sense. Not only has this been a tough period for most of the technology sector , but this company has clearly conceded that a lack of enough memory chips to sell is holding it back. But as Qualcomm CEO Cristiano Amon plainly said when the company posted its fiscal first-quarter results and Q2 guidance earlier this month, the matter is purely one of supply -- demand for its high-performance processors remains robust.\n\nHere's the thing: Right or wrong, memory makers have a habit of over-responding. Once they do the same with this cycle this time around -- and they will soon enough -- Qualcomm can begin making more shipments. The bears have simply priced in too much pessimism here.\n\nPayPal 's dominance of the online payment space is in no immediate jeopardy. It would be naïve, however, to pretend other contenders can't penetrate this market and put up some strong growth numbers once in it. Remitly Global (NASDAQ: RELY) is one of these others.\n\nIn simplest terms, Remitly makes it easy to transfer U.S. dollars to another country, allowing its app's users to clear all the logistical hurdles with just a few simple steps. It serves both consumers and businesses.\n\nAnd business is good. The company facilitated the transfer of $19.5 billion during the third quarter of last year, up 35% year over year, generating $419.5 million in revenue for itself. Of that amount, $61.2 million was converted into earnings before interest, taxes, depreciation, and amortization (EBITDA), up 29% from the year-ago comparison. Analysts are looking for the same pace of growth at least through 2028, too, although given how easy it makes this otherwise-complicated process, it's likely to maintain this rate of growth for well beyond that.\n\nYes, its steep valuation is a big reason this stock's been halved since February of last year. It's also 50% below analysts' consensus price target of $20.25, though, and all nine analysts covering this ticker agree that it's a strong buy at this time.\n\nFinally, The Trade Desk (NASDAQ: TTD) is one of the many technology stocks that were driven lower as part of the sector's sweeping sell-off of late. But the market threw the proverbial baby out with the bathwater. This digital advertising optimization platform is needed regardless of the economic backdrop or changing business landscape.\n\nAnalysts expect this reliably profitable company's revenue to grow another 16% this year, in fact, following what's projected to be top-line growth of 18% for all of last year. Moreover, priced at only about 12 times this year's anticipated per-share earnings of $2.09, The Trade Desk stock is deep into bargain territory. The market's just forgotten how necessary this company is.\n\nEver feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\n\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $492,937 !*\n\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $52,460 !*\n\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $429,385 !*\n\nRight now, we’re issuing “Double Down” alerts for three incredible companies , available when you join Stock Advisor , and there may not be another chance like this anytime soon.\n\nSee the 3 stocks »\n\n*Stock Advisor returns as of February 9, 2026\n\nJames Brumley has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends PayPal, Qualcomm, and The Trade Desk. The Motley Fool recommends the following options: long January 2027 $42.50 calls on PayPal and short March 2026 $65 calls on PayPal. The Motley Fool has a disclosure policy .\n\nThe Best Stocks to Buy With $1,000 Right Now was originally published by The Motley Fool",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ADI",
      "Date": "2026-02-13",
      "Time": "07:00:01",
      "Source": "Zacks",
      "Title": "Here's Why Analog Devices (ADI) Fell More Than Broader Market",
      "URL": "https://finance.yahoo.com/news/heres-why-analog-devices-adi-230001477.html",
      "Content": "Analog Devices (ADI) closed the most recent trading day at $331.36, moving -1.67% from the previous trading session. This move lagged the S&P 500's daily loss of 1.57%. Meanwhile, the Dow lost 1.34%, and the Nasdaq, a tech-heavy index, lost 2.04%.\n\nPrior to today's trading, shares of the semiconductor maker had gained 13.09% outpaced the Computer and Technology sector's loss of 1.83% and the S&P 500's loss of 0.29%.\n\nThe upcoming earnings release of Analog Devices will be of great interest to investors. The company's earnings report is expected on February 18, 2026. The company's upcoming EPS is projected at $2.3, signifying a 41.10% increase compared to the same quarter of the previous year. Meanwhile, our latest consensus estimate is calling for revenue of $3.12 billion, up 28.67% from the prior-year quarter.\n\nADI's full-year Zacks Consensus Estimates are calling for earnings of $9.97 per share and revenue of $12.97 billion. These results would represent year-over-year changes of +27.98% and +17.73%, respectively.\n\nInvestors should also take note of any recent adjustments to analyst estimates for Analog Devices. These recent revisions tend to reflect the evolving nature of short-term business trends. As such, positive estimate revisions reflect analyst optimism about the business and profitability.\n\nBased on our research, we believe these estimate revisions are directly related to near-term stock moves. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.\n\nThe Zacks Rank system, spanning from #1 (Strong Buy) to #5 (Strong Sell), boasts an impressive track record of outperformance, audited externally, with #1 ranked stocks yielding an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has moved 0.92% higher. Analog Devices is currently a Zacks Rank #2 (Buy).\n\nDigging into valuation, Analog Devices currently has a Forward P/E ratio of 33.81. This signifies a discount in comparison to the average Forward P/E of 41.23 for its industry.\n\nAlso, we should mention that ADI has a PEG ratio of 1.83. Comparable to the widely accepted P/E ratio, the PEG ratio also accounts for the company's projected earnings growth. As the market closed yesterday, the Semiconductor - Analog and Mixed industry was having an average PEG ratio of 1.49.\n\nThe Semiconductor - Analog and Mixed industry is part of the Computer and Technology sector. This industry currently has a Zacks Industry Rank of 62, which puts it in the top 26% of all 250+ industries.\n\nThe Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nYou can find more information on all of these metrics, and much more, on Zacks.com.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ADI",
      "Date": "2026-02-13",
      "Time": "00:06:00",
      "Source": "Zacks",
      "Title": "Cisco's Q2 Earnings Beat Estimates, Revenues Rise Y/Y, Shares Fall",
      "URL": "https://finance.yahoo.com/news/ciscos-q2-earnings-beat-estimates-160600444.html",
      "Content": "Cisco Systems CSCO reported second-quarter fiscal 2026 non-GAAP earnings of $1.04 per share, beating the Zacks Consensus Estimate by 1.96%. The figure increased 10.6% year over year.\n\nRevenues of $15.35 billion surpassed the Zacks Consensus Estimate by 1.49%. The top line increased 9.7% year over year. Total Annual Recurring Revenues (ARR) were $31 billion, up 3% with product ARR growth of 6%. Total subscription revenues were $7.83 billion and represented 51% of Cisco’s total revenues. Total software revenue increased 36.9% year over year to $5.6 billion.\n\nCisco shares were down 7.47% at the time of writing this article.\n\nRevenues from Networking in the second quarter of fiscal 2026 were $8.29 billion, up 21% on a year-over-year basis. Security revenues were $2.01 billion, down 4% year over year. Collaboration revenues were $1.05 billion, up 6% year over year. Observability revenues were $277 million, which was in line year over year.\n\nCisco Systems, Inc. price-consensus-eps-surprise-chart | Cisco Systems, Inc. Quote\n\nTotal Product revenues in the second quarter of fiscal 2026 were $11.64 billion, comprising 75.8% of Cisco’s total revenues. On a year-over-year basis, product revenues increased 13.8%. Service Revenues were $3.70 billion, comprising 24.2% of Cisco’s total revenues and down 1.3% on a year-over-year basis.\n\nRegion-wise, the Americas’ revenues increased 8% year over year to $8.84 billion. EMEA (Europe, Middle East, and Africa) revenues climbed 15% year over year to $4.42 billion. APJC (Asia Pacific Japan China) revenues climbed 8% year over year to $2.08 billion.\n\nIn the second quarter of fiscal 2026, AI Infrastructure orders from webscale customers exceeded $2.1 billion.\n\nSecond-quarter fiscal 2026 non-GAAP gross margin was 67.5%, which contracted 120 basis points (bps) year over year. On a non-GAAP basis, the product gross margin decreased 90 bps on a year-over-year basis to 50.4%. Service gross margin decreased 210 bps to 17.1%.\n\nIn the second quarter of fiscal 2026, Cisco reported total non-GAAP operating expenses of $5.04 billion, up 6.2% year over year. As a percentage of revenues, operating expenses declined 110 bps year over year.\n\nConsequently, CSCO reported a non-GAAP operating income of $5.31 billion, up 9.3% year over year. Operating margin contracted 10 bps year over year to 34.6%.\n\nAs of Jan. 24, 2026, cash and cash equivalents and investments totaled $15.8 billion, which increased from $15.7 billion as of Oct. 25, 2026.\n\nTotal debt was $30 billion as of Jan. 24, 2026, compared with $28.1 billion as of Oct. 25, 2025.\n\nThe remaining performance obligations (RPO) at the end of the second quarter of fiscal 2026 were $43.4 billion, up 5% year over year. Product RPO increased 8% year over year, of which long-term RPO was $11.8 billion, up 11% year over year. Services RPO was up 2% year over year.\n\nIn the second quarter of fiscal 2026, CSCO returned $3 billion to stockholders through share buybacks and dividends.\n\nFor the third quarter of fiscal 2026, Cisco expects non-GAAP earnings between $1.02 and $1.04 per share. Revenues are expected to be in the range of $15.4 billion-$15.6 billion. Non-GAAP gross margins are expected to be between 65.5% and 66.5%.\n\nNon-GAAP operating margin is anticipated to be between 33.5% and 34.5%. For fiscal 2026, Cisco expects non-GAAP earnings between $4.13 and $4.17 per share.\n\nThe company expects revenues between $61.2 billion and $61.7 billion.\n\nCisco currently has a Zacks Rank #3 (Hold).\n\nSome better-ranked stocks in the broader Zacks Computer and Technology sector include Analog Devices ADI, Applied Optoelectronics AAOI, and MKS MKSI. While MKSI sports a Zacks Rank #1 (Strong Buy), Analog Devices and Applied Optoelectronics carry a Zacks Rank of 2 (Buy) at present. You can see the complete list of today’s Zacks #1 Rank stocks here .\n\nAnalog Devices’ shares have gained 61% in the past 12-month period. Analog Devices is scheduled to release first-quarter 2026 results on Feb. 18, 2026.\n\nApplied Optoelectronics shares have returned 93.4% in the past 12-month period. Applied Optoelectronics is set to report fourth-quarter 2025 results on Feb. 26.\n\nMKS shares have surged 149.5% in the past 12-month period. MKS is set to report its fourth-quarter 2025 results on Feb. 17, 2026.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ADI",
      "Date": "2026-02-13",
      "Time": "00:00:13",
      "Source": "Insider Monkey",
      "Title": "Here’s Why Analog Devices (ADI) Rose in Q4",
      "URL": "https://finance.yahoo.com/news/why-analog-devices-adi-rose-160013574.html",
      "Content": "Carillon Tower Advisers , an investment management company, released its fourth-quarter 2025 investor letter “Carillon Eagle Growth & Income Fund”. A copy of the letter can be downloaded here . 2025 marked a positive period for the equity market. The S&P 500 Index returned 2.7% in Q4 and finished the year up 17.9%. The year started with potential disruptions and heightened volatility, while it ended with optimism driven by strong AI investment, clarity in policies, and U.S. Federal Reserve (Fed) interest rate cuts. The market’s performance was significantly affected by the communication services and technology sectors. From a return‑driver standpoint, the market expansion in the year was driven by earnings growth. The firm observes favorable conditions as 2026 approaches, and believes it can achieve another year of strong equity returns. The Fund holds net assets of $493.06 million across 48 holdings. Please review the Strategy’s top five holdings to gain insights into their key selections for 2025.\n\nIn its fourth-quarter 2025 investor letter, Carillon Eagle Growth & Income Fund highlighted stocks like Analog Devices, Inc. (NASDAQ: ADI ). Analog Devices, Inc. (NASDAQ:ADI) is a semiconductor company that designs and manufactures integrated circuits (ICs), software, and subsystems products. On February 11, 2026, Analog Devices, Inc. (NASDAQ:ADI) stock closed at $337.00 per share. One-month return of Analog Devices, Inc. (NASDAQ:ADI) was 13.30%, and its shares are up 63.50% over the past twelve months. Analog Devices, Inc. (NASDAQ:ADI) has a market capitalization of $167.508 billion.\n\nCarillon Eagle Growth & Income Fund stated the following regarding Analog Devices, Inc. (NASDAQ:ADI) in its fourth quarter 2025 investor letter:\n\nAnalog Devices, Inc. (NASDAQ:ADI) is not on our list of 30 Most Popular Stocks Among Hedge Funds . According to our database, 84 hedge fund portfolios held Analog Devices, Inc. (NASDAQ:ADI) at the end of the third quarter, up from 79 in the previous quarter. While we acknowledge the potential of Analog Devices, Inc. (NASDAQ:ADI) as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\n\nIn another article , we covered Analog Devices, Inc. (NASDAQ:ADI) and shared stock picks from Goldman Sachs semiconductor stocks. In addition, please check out our hedge fund investor letters Q4 2025 page for more investor letters from hedge funds and other leading investors.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ADI",
      "Date": "2026-02-12",
      "Time": "22:33:35",
      "Source": "Investing.com",
      "Title": "Barclays upgrades Analog Devices as industrial recovery takes shape",
      "URL": "https://finance.yahoo.com/news/barclays-upgrades-analog-devices-industrial-143335971.html",
      "Content": "Investing.com -- Barclays upgraded Analog Devices to Overweight in a note Thursday, arguing the company is best positioned to benefit from an improving industrial backdrop and carries “the cleanest operating model and balance sheet” in the group.\n\nAnalyst Tom O’Malley said purchasing manager indexes have finally provided “the PMI inflection needed for some broader Industrial recovery,” though he cautioned that scars remain from the last cycle.\n\nBarclays noted that inventories at distributors have normalised, but “company inventories remain historically high impacting loadings and utilization, and impairing margins.”\n\nAgainst that backdrop, the bank sees emerging growth tied to data-center trends but remains selective across analog names. O’Malley wrote that ADI has “the most leverage to Industrial exposure,” making it the most attractive way to position for an upturn.\n\nBy contrast, Barclays initiated Microchip at Equal Weight, noting the company is exposed to networking and memory demand from AI data-center buildouts but faces challenges including “a difficult spot from a leverage perspective” and “share loss in low end MCUs.”\n\nThe bank assigned the stock an $80 price target.\n\nBarclays also started coverage of ON Semiconductor at Equal Weight with a $75 target, citing upside from rising data-center dollar content in the move to 800-volt architectures.\n\nHowever, O’Malley said the stock cannot “break out” without a broader recovery in auto demand, which “remains mum for foreseeable future.”\n\nBarclays added that each company in the group faces at least one industry-specific challenge, reinforcing its preference for ADI’s mix of industrial leverage and balance-sheet strength.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-02-12",
      "Time": "03:41:21",
      "Source": "Insider Monkey",
      "Title": "UBS Keeps a Neutral Rating on QUALCOMM Incorporated (QCOM)",
      "URL": "https://finance.yahoo.com/news/ubs-keeps-neutral-rating-qualcomm-194121633.html",
      "Content": "QUALCOMM Incorporated (NASDAQ: QCOM ) is among the 12 Best Autonomous Driving Stocks to Buy Right Now .\n\nTheFly stated on January 26, 2026, that UBS kept its rating at Neutral and reduced its price objective for QUALCOMM Incorporated (NASDAQ:QCOM) from $185 to $160.\n\nMizuho also lowered the corporation’s price target that day from $175 to $160. It maintained a Neutral rating. Mizuho predicted that global handset shipments will drop 4% year over year in 2026, with additional declines anticipated in the second half. This is due to memory constraints and pricing pressures. The downgrade came after an industry call on handsets.\n\nOn February 5, 2026, Reuters reported that QUALCOMM Incorporated (NASDAQ:QCOM) expected second-quarter revenue of $10.2 billion to $11 billion and adjusted earnings of $2.45 to $2.65 per share, both lower than LSEG projections. The firm attributed a global memory chip shortage to impacting smartphone users. After-hours trading saw a 9% decline in shares, which have now dropped more than 13% this year as of February 5, 2026. According to CEO Cristiano Amon, memory limits were the only reason for the projection failure. OEMs, especially in China, were cutting back on inventory as memory prices rose across the mobile device industry.\n\nQUALCOMM Incorporated (NASDAQ:QCOM) develops and distributes semiconductors, software, and wireless technology solutions.\n\nWhile we acknowledge the potential of QCOM as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-02-11",
      "Time": "22:55:00",
      "Source": "Zacks",
      "Title": "Gold.com and Qualcomm have been highlighted as Zacks Bull and Bear of the Day",
      "URL": "https://finance.yahoo.com/news/gold-com-qualcomm-highlighted-zacks-145500161.html",
      "Content": "Chicago, IL &ndash; February 11, 2026 &ndash; Zacks Equity Research shares Gold.com GOLD as the Bull of the Day and Qualcomm QCOM as the Bear of the Day. In addition, Zacks Equity Research provides analysis on NVIDIA Corp. NVDA and Micron Technology, Inc.&rsquo;s MU .\n\nHere is a synopsis of all four stocks.\n\nA recent pullback in Gold.com stock may be short-lived as gold prices have rebounded to new record highs of over $5,000 per ounce, as shown below, following a sharp pullback to around $4,400 per ounce earlier in the month.\n\nAmid an unprecedented commodity price boom for various precious metals, Gold.com&rsquo;s stock has been one of the market&rsquo;s top performers in 2026 so far, soaring nearly +90% through the first two months of the year and recently hitting a 52-week high of $66 a share.\n\nOffering a fully integrated alternative assets platform, sentiment continues to build for Gold.com&rsquo;s outlook after reporting impressive results for its fiscal second quarter last Thursday and attracting positive attention from analysts in the process.\n\nHeadquartered in Costa Mesa, California, and formerly known as A-Mark Precious Metals, Gold.com provides an array of precious metals, including minted gold bars, silver, platinum, and palladium, along with copper bullion and numismatic coins to wholesale and retail consumers.\n\nStrong Q2 Results & Strategic Expansion\n\nEnforcing the narrative that Gold.com is executing well, Q2 sales spiked 136% year over year to a quarterly record of $6.47 billion from $2.74 billion in the comparative quarter. Net income came in at $11.6 million or adjusted earnings of $0.91 per share, a 55% increase from EPS of $0.55 in the prior year quarter.\n\nDrawing analysts' attention is that Gold.com crushed consensus sales and EPS expectations of $2.92 billion and $0.70 per share by 121.2% and 30%, respectively.\n\nAttributing to Gold.com&rsquo;s compelling expansion is its international growth, with its wholly owned subsidiary, LPM Group Limited, being based in Hong Kong and becoming one of the largest precious metals dealers in Asia.\n\nLPM also has an expanding presence in Singapore, with it noteworthy that Gold.com acquired Monex Deposit Company in January, an established U.S. precious metal dealer that should significantly expand its product offerings and customer base as well. Furthermore, management emphasized ongoing efforts to integrate acquisitions and optimize costs to maintain long-term margin expansion.\n\nFavorable EPS Revisions & Attractive P/E Valuation\n\nSupportive of more upside in GOLD shares is that Gold.com&rsquo;s fiscal 2026 EPS estimates have spiked over 50% in the last 60 days, with FY27 EPS revisions still up nearly 12%.\n\nWithin the last week, FY26 EPS estimates have risen 13% despite a 5% decline in FY27 EPS revisions. Gold.com&rsquo;s EPS is now expected to soar 63% this year and is projected rise another 15% in FY27 to $4.09.\n\nMaking Gold.com&rsquo;s EPS outlook more attractive is that GOLD still trades at a reasonable 22X forward earnings multiple, offering a slight discount to the benchmark S&P 500 amid heavy market interest.\n\nConclusion\n\nAs a beneficiary of sky-high gold prices and other booming precious metals, Gold.com&rsquo;s rebranding couldn&rsquo;t have come at a better time, cleverly changing its ticker symbol from ARMK to GOLD in December.\n\nBut as the company has stated, &ldquo;This transition represents far more than a name change. It encapsulates our corporate identity as the most trusted and globally recognized precious metals platform, and our commitment to delivering value for our customers, partners, and, of course, our shareholders.&rdquo;\n\nWith now appearing to be an ideal time to invest in Gold.com stock based on a pleasant trend of positive EPS revisions, its Zacks Rank #1 (Strong Buy) rating is further supported by an overall &ldquo;A&rdquo; Zacks Style Scores grade for the combination of Value, Growth, and Momentum.\n\nQualcomm shares are down 5% since its fiscal first quarter report last Wednesday, and have now fallen nearly 20% year to date.\n\nEven though Qualcomm exceeded quarterly expectations, its guidance came in below Wall Street's estimates, attributed to the well-documented memory chip shortage.\n\nDespite record Q1 sales, a cautious tone surrounding the shortage from Qualcomm&rsquo;s management has weighed on investor sentiment and analysts' outlook for the stock.\n\nTriggering a Zacks Rank #5 (Strong Sell), Qualcomm is experiencing an unfavorable trend of declining EPS revisions, and lands the Bear of the Day.\n\nThe Global Memory Chip Shortage\n\nQualcomm has emphasized that memory chip shortages are hurting smartphone demand, which directly impacts its core handset processor business.\n\nThe company has warned that original equipment manufacturers (OEMs) are pulling back on orders due to memory constraints, which is expected to weigh on sales in the near term.\n\nWhile investors love upstream suppliers during a shortage that can raise prices, such as storage and flash-chip memory providers, like Sandisk and Western Digital, they typically avoid downstream component providers in the supply chain, like Qualcomm, which designs processors and modems that go into the finished devices.\n\nIn other words, upstream suppliers sell the scarce resource; downstream suppliers depend on it.\n\nWeak Guidance & Declining EPS Revisions\n\nQualcomm&rsquo;s Q2 revenue guidance of $10.2&ndash;$11 billion missed the consensus estimates of $11.1 billion. More concerning, Q2 EPS guidance of $2.45&ndash;$2.65 was well under the Zacks Consensus of $2.85.\n\nSuggesting more downside risk ahead is that over the last 30 days, Qualcomm's fiscal 2026 and FY27 EPS estimates have now dropped over 7%, following a noticeable decline in the last week.\n\nBottom Line\n\nIronically, skyrocketing demand for AI data centers has diverted memory supply away from smartphones, causing OEM production delays and forcing Qualcomm to lower its guidance.\n\nAlthough Qualcomm has AI data center endeavors of its own, smartphone production is still its biggest revenue source. Until there is a resolution to the memory chip shortage, it wouldn't be surprising if there is more volatility ahead for Qualcomm stock.\n\nMicron Is Quietly Outperforming NVIDIA &mdash; Don&rsquo;t Ignore It\n\nWith the rise of artificial intelligence (AI), NVIDIA Corp. has delivered impressive returns, soaring more than 1,000% over the past five years. Yet, in the past year, Micron Technology, Inc .&rsquo;s shares outpaced NVIDIA&rsquo;s (+307% vs +43.1%). Let&rsquo;s see why Micron is emerging as the new go-to AI investment, even amid NVIDIA&rsquo;s strong bullish momentum.\n\nNVIDIA&rsquo;s Strong Demand and Growth Outlook Keep Investors Bullish\n\nNVIDIA remains the center of attraction among investors, and for good reasons. Consistently, NVIDIA delivered encouraging quarterly results that exceeded Wall Street expectations even in the face of several geopolitical hurdles. This is because demand for its next-generation Blackwell chips and cloud graphics processing units (GPUs) remains strong.\n\nSomewhat easing of the U.S.-China trade tensions and incessant increase in data center spending, in all likelihood, could boost NVIDIA&rsquo;s sales. NVIDIA remains optimistic about its future growth and expects revenues for the fiscal fourth quarter of 2026 to hit nearly $65 billion, plus or minus 2%, according to investor.nvidia.com. This would be more than the company&rsquo;s fiscal third-quarter 2026 revenues of $57 billion, and if achieved, it will surely raise the stock further (read more: NVIDIA vs. Palantir: One AI Stock is a Clear Buy Right Now).\n\nMicron Emerges as a Key AI Beneficiary on Strong HBM Demand\n\nWhile NVIDIA continues to command the spotlight, another chipmaker, Micron, has steadily gained investors&rsquo; attention, driven by strong demand for its high-bandwidth memory (HBM) chips amid the rapid expansion of AI.\n\nThe demand for Micron&rsquo;s HBM chips has surged as data center operators and hyperscalers ramp up AI infrastructure investments. At the same time, constrained HBM supply amid high demand is likely to enhance Micron&rsquo;s profit margin and support its growth trajectory. Micron CEO Sanjay Mehrotra also added that tight HBM supply is expected to persist as demand remains strong, creating a demand-supply imbalance that could push prices higher and benefit Micron in the near future.\n\nAgainst this backdrop, Micron is quite optimistic about its financial performance, with management expecting fiscal second-quarter 2026 revenues to come between $18.3 billion and $19.1 billion, more than the $13.64 billion reported in first-quarter fiscal 2026, according to investors.micron.com. The company also expects net income to increase further.\n\nWhy Micron Is a Solid Buy Right Now\n\nMicron is gaining investors&rsquo; attention as AI-driven HBM demand and tight supply bolster its growth outlook. Micron&rsquo;s net profit margin of 28.2%, more than the Computer - Integrated Systems industry's 14.3%, also clearly suggests strong growth potential.\n\nMoreover, Micron offers an attractive buying opportunity at a reasonable valuation. Micron&rsquo;s forward price-to-earnings (P/E) ratio of 11.66 is well below the industry&rsquo;s average of 18.18.\n\nTherefore, from an investment standpoint, Micron is too promising to ignore right now. Its Zacks Consensus Estimate of $32.9 for earnings per share (EPS) implies growth of 204.3% year over year.\n\nCurrently, Micron sports a Zacks Rank #1 (Strong Buy). You can see the complete list of today&rsquo;s Zacks #1 Rank stocks here.\n\nFree: Instant Access to Zacks' Market-Crushing Strategies\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\n\nToday you can tap into those powerful strategies &ndash; and the high-potential stocks they uncover &ndash; free. No strings attached.\n\nGet all the details here >>\n\nMedia Contact\n\nZacks Investment Research\n\n800-767-3771 ext. 9339\n\nhttps://www.zacks.com\n\nZacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer.\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index.Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-02-11",
      "Time": "22:50:00",
      "Source": "Motley Fool",
      "Title": "1 No-Brainer Artificial Intelligence (AI) Chip Stock to Buy Now With $150",
      "URL": "https://finance.yahoo.com/m/b1ead8f0-0702-36f3-8e97-e6944c55b5e7/1-no-brainer-artificial.html",
      "Content": "Investors looking to buy into AI stocks, particularly semiconductor stocks, should look beyond the biggest names like Nvidia or Broadcom . Additionally, the surge in memory chipmaker's values amid the push for more AI compute power has left those stocks looking fairly expensive.\n\nBut investors with just $150 can still buy a great AI chipmaker. Despite a disappointing outlook for the next year, Qualcomm (NASDAQ: QCOM) looks like a no-brainer buy for patient investors who can withstand a bit of financial pressure in the near term.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\n\nThe growing demand for artificial intelligence compute has created an interesting challenge for Qualcomm.\n\nThe chipmaker generates the vast majority of its revenue from the sale of wireless handsets. That stems from both licensing its intellectual property for 3G, 4G LTE, and 5G chipsets as well as making its own baseband chips and mobile processors. Unfortunately, the smartphone industry is facing pressure due to the rising cost of memory chips, a key component. As a result, Qualcomm warned that smartphone volume will decline this year, pushing its revenue lower.\n\nMemory chips have climbed in price because AI accelerator chips and GPUs are packaged together with lots of memory to facilitate faster and more effective large language model training and inference. But supply hasn't caught up with demand. Memory chipmaker Micron expects supply to remain tight through the end of calendar 2026. As a result, Qualcomm could see pressure on its revenue through the middle of its fiscal 2027 as memory chip supply slowly ramps up. Management's second-quarter outlook calls for a 3.5% year-over-year decline in total revenue.\n\nBut Qualcomm has worked to diversify beyond smartphones. Its automotive segment continues to grow quickly and should remain unaffected by the memory chip shortage. Likewise, its Internet of Things (IoT) business should keep growing over the next few years. Qualcomm is also pushing into the data center chip business with a pair of chips designed for AI inference. That could be a meaningful growth driver over the next few years, partially offsetting the pressure on the handset business.\n\nIn the long run, however, Qualcomm looks like a great opportunity. As AI inference moves from something done exclusively on data center servers to something that could be run on devices, Qualcomm is in a great position to capitalize long term. Its Snapdragon mobile processors are some of the best high-end chips for smartphones. On-device AI could increase demand for more high-end devices, meaning more devices with Qualcomm's chips inside.\n\nImportantly, management expects the setback in smartphone production to be a temporary headwind. It maintained its 2029 revenue outlook, which means the long-term potential for the stock remains intact. While the stock certainly deserved a haircut in price after the news, the market may be giving patient investors a great opportunity right now. At less than $140 per share as of this writing, investors are paying just 12 times forward earnings expectations. And those earnings should show meaningful growth in the years to come after resetting this year amid the smartphone headwind.",
      "Language": "en",
      "IsSummarized": false
    }
  ]
}