{
  "last_updated": "2026-02-14T07:20:34.541Z",
  "total_news_count": 30,
  "news": [
    {
      "Ticker": "TSM",
      "Date": "2026-02-14",
      "Time": "13:20:00",
      "Source": "Motley Fool",
      "Title": "3 Stocks That Will Be Worth $3 Trillion or More in 3 Years",
      "URL": "https://finance.yahoo.com/m/f0f05ce2-ad5e-3bff-873f-fd4b5883db84/3-stocks-that-will-be-worth.html",
      "Content": "There have only been four companies to reach a $3 trillion market cap or greater. But as the stock market rises, the $3 trillion level will eventually be breached by many more companies. In fact, I think three of them will each reach that level over the next three years.\n\nThe three that I've got my eye on are Amazon (NASDAQ: AMZN) , Taiwan Semiconductor (NYSE: TSM) , and Broadcom (NASDAQ: AVGO) . All of these companies are within striking distance, and each looks like a worthy investment option now.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\n\nSome of these companies have further to go than others. Amazon is already a $2.4 trillion company, so projecting that it will rise to a market cap of $3 trillion in three years isn't really that bold a call. It only needs to manage a growth rate of 8% over the next three years to get there. If that's all, the faster it grows, the more likely it will be a disappointment for most investors. I think Amazon has a much better growth case than that, but we'll get to that in a bit.\n\nTaiwan Semiconductor and Broadcom have much further to go. Taiwan Semiconductor is a $1.72 trillion company, while Broadcom tops the sales at $1.47 trillion. It will take a compounded annual growth rate (CAGR) of 20% and 27%, respectively, for each to rise to a $3 trillion cap three years from now.\n\nThat's no easy task, but if each can deliver that rate of return, they will make for no-brainer buys right now. But are these growth rates feasible?\n\nAmazon is probably the easiest company to make a case for. Although it only needs to deliver an 8% growth rate to reach this level, it has managed to grow its revenue above double digits for the past four years.\n\nAMZN Revenue (Quarterly YoY Growth) data by YCharts.\n\nI have no doubt that it will continue that trend over the next few years, and it could grow at an even faster rate thanks to the acceleration of artificial intelligence (AI) spending. Amazon Web Services (AWS), its cloud computing service that powers traditional and AI workloads, posted revenue growth of 24% in the fourth quarter (Q4) -- the best in 13 quarters. This is a clear sign that Amazon's business is thriving, and with AWS having a much better operating margin than the rest of the business, its outsized growth will have an even greater effect on profits. Amazon is a lock to reach a $3 trillion market cap in three years and should beat the market along the way.\n\nTaiwan Semiconductor is a key part of the AI build-out, as its chip foundries manufacture a large chunk of the logic chips utilized in AI devices. Management expects huge growth from AI over the next few years, with AI chip revenue rising at nearly a 60% CAGR. However, that's not a companywide growth rate, as other companies utilize its foundry services outside of AI. From 2024 to 2029, management expects a CAGR of nearly 25% companywide, easily surpassing the 20% return threshold needed to rise to a $3 trillion company three years from now.\n\nLast is Broadcom. It has the longest way to go but will likely grow at the fastest rate. Although it does several other things, its biggest growth driver is its custom AI chips, which it designs in a partnership with AI hyperscalers. By designing a chip around a specific workload, Broadcom can achieve better results at a lower price point but at the cost of flexibility. These are massively growing in popularity, and Broadcom expects to double its AI segment revenue year over year during Q1 2026. As more hyperscalers launch their custom chip design with Broadcom, their growth rate will continue to be strong. This will drive Broadcom to become a $3 trillion company quickly, and investors shouldn't miss out on this stock .",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "CSCO",
      "Date": "2026-02-14",
      "Time": "02:07:33",
      "Source": "Barchart",
      "Title": "Cisco Systems Reports Lower Free Cash Flow - But, Is CSCO Stock a Buy Here?",
      "URL": "https://finance.yahoo.com/m/14dd4500-29b1-38a4-89ef-4432127802e1/cisco-systems-reports-lower.html",
      "Content": "Cisco Systems ( CSCO ) reported positive free cash flow (FCF) for the latest quarter ending Jan. 24, 2026, albeit lower than last year. Nevertheless, its FCF margin is still strong, and despite higher capex, management's guidance was for higher earnings.\n\nAs a result, analysts have higher target prices for CSCO stock. For example, Yahoo! Finance now reports that the average of 26 analysts' price targets is $87.86. That's 14% higher than today's price.\n\nDespite a Blistering Start to the New Year, the Smart Money is Still Riding with Intel (INTC) Stock\n\nExxon Mobil’s Options Heat Up—31 Unusually Active Contracts Signal Key Trading Setups\n\nOXY Earnings Play: Using Puts to Get Paid While You Wait\n\nGet exclusive insights with the FREE Barchart Brief newsletter. Subscribe now for quick, incisive midday market analysis you won't find anywhere else.\n\nCSCO is trading at $76.87 , down from a recent peak of $86.78 on Feb. 9, just before the Feb. 11 earnings release.\n\nBased on its strong FCF and FCF margins, despite higher AI-related investments and capital expenditures (capex), Cisco Systems' stock has good upside. This article will show why and a conservative way to play CSCO.\n\nCisco reported that its fiscal Q2 revenue (ending Jan. 24, 2026) was up 10.3% to $15.3 billion, and earnings per share (EPS) rose faster, +11%.\n\nHowever, its operating cash flow (OCF), which includes all cash flow before capital expenditures (capex), was down from $2.24 billion last year to $1.82 billion.\n\nNevertheless, that still represented 11.8% of its quarterly revenue, albeit lower than last year's 16 OCF margin and 21.% in the prior quarter. This can be seen on page 17 of its slide deck:\n\nHowever, after higher capex spending, its Q2 FCF was $1.539 billion (10.0% of revenue) compared to $2.03 billion last year (14.5% FCF margin), according to Stock Analysis.\n\nMoreover, over the trailing 12 months (TTM), its FCF was still strong ($12.24 billion), representing 20.73% of TTM revenue. That was down less from the prior year's 23.6% FCF margin.\n\nAs a result, based on management's higher revenue forecasts for this year, we can expect that FCF could be higher over the next 12 months (NTM).\n\nFor example, management guided that this year it expects revenue to range between $61.2 billion and $61.7 billion (see page 4 of its earnings release). The midpoint of $61.45 billion is 8.5% higher than last year's $56.65 billion revenue.\n\nIn fact, analysts' forecasts are higher. Seeking Alpha shows that 19 analysts project $61.56 billion for the year ending July 2026, and $64.93 billion for the following fiscal year. That implies that over the next 12 months (NTM) revenue could rise to $63.245 billion , up 11.64% over FY 2025.\n\nAs a result, if we assume that Cisco Systems could maintain around 21% FCF margin (slightly higher than its TTM 20.73% margin), FCF could rise to almost $13.3 billion:\n\n$63.245 billion NTM revenue x 0.21 = $13.28 billion NTM FCF\n\nThat would be over $1 billion higher than its LTM FCF of $12.24 billion, or +8.5%.\n\nAs a result, CSCO's value over the next 12 months (NTM) could be higher. Here's why.\n\nRight now, Cisco's stock has a market capitalization of $302.456 billion, according to Yahoo! Finance. As a result, its FCF yield on a trailing 12-month (TTM) basis is just over 4%:\n\n$12.24b TTM FCF / $302.456 b mkt cap = 0.0405 = 4.05% FCF yield\n\nAssuming its FCF yield improves to 4.0% over the next 12 months, the market value could rise to $332 billion:\n\n$13.28 NTM FCF / 0.04 = $332 billion NTM mkt cap\n\nThat's $30 billion higher than todays mkt cap or about 10% higher.\n\nIn other words, even before share buybacks, which have been strong at Cisco, its price target (PT) is 10% higher:\n\n$76.87 x 1.10 = $84.56 PT (i.e., +10%)\n\nThat is even lower than Yahoo! Finance's survey PT of $87.86, and Barchart's mean survey PT of $87.15 per share. Moreover, 18 analysts surveyed by AnaChart.com, which tracks recent analyst write-ups, show an average PT of $98.23. These surveys average $91.06 , or +18.5% higher.\n\nThe bottom line is that CSCO stock could be worth between 10% to 18.5% more than today's price.\n\nOne way to conservatively play this is to sell short out-of-the-money (OTM) put options in one-month expiration periods. That way, an investor can get paid while setting a potential lower buy-in point.\n\nFor example, look at the March 20, 2026, expiration period. It shows that the $72.50 strike price put, over 5% lower than today's price, has a midpoint premium of $0.87 per put contract.\n\nThat means a short-seller can make $87 immediately after securing $7,250 with their brokerage firm and placing a “Sell to Open” trade order for this contract.\n\nThat represents a one-month yield of 1.20% (i.e., $87/$7,250). The worst that can happen is CSCO falls to $72.50 or lower, and the collateral is used to buy 100 shares at that price.\n\nThis could result in an unrealized capital loss. But the breakeven point is $71.63 (i.e., $72.50-$0.87), which is 6.8% lower than today's price. So, it provides a good potential entry point.\n\nMoreover, less risk-averse investors could use the premium to help buy longer-dated in-the-money (ITM) CSCO call options. That way, they can gain upside in CSCO stock that is potentially greater than buying CSCO shares. I have discussed this in other articles.\n\nThe bottom line is that Cisco Systems' stock looks cheap here, and shorting OTM puts and buying ITM calls are conservative ways to play CSCO.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "TSM",
      "Date": "2026-02-14",
      "Time": "01:04:31",
      "Source": "GuruFocus.com",
      "Title": "Frank Sands Reduces Stake in Taiwan Semiconductor Manufacturing Co Ltd by 26.22%",
      "URL": "https://finance.yahoo.com/news/frank-sands-reduces-stake-taiwan-170431333.html",
      "Content": "This article first appeared on GuruFocus .\n\nWarning! GuruFocus has detected 5 Warning Signs with NVDA.\n\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\n\nFrank Sands ( Trades , Portfolio ) recently submitted the 13F filing for the fourth quarter of 2025, providing insights into his investment moves during this period. Frank M. Sands, Jr., CFA is the Chief Executive Officer and Chief Investment Officer of Sands Capital Management, an investment management firm focused on investing in quality growth businesses throughout the world. He spends most of his time on investment research and decision making, as well as business strategy.Sands Capital Management was founded by his father, Frank M. Sands, Sr. in 1992. Frank Sands ( Trades , Portfolio ), Jr. joined the firm in 2000 after working for six years as a research analyst and portfolio manager for Fayez Sarofim & Co., an institutional investment management firm based in Houston, Texas. Since joining Sands Capital Management, working alongside his father, the firm has continued to produce strong investment results for its clients. Sands Jr. earned a BA from Washington & Lee University, an MS from Johns Hopkins University and an MBA from the Darden School at the University of Virginia. Sands Capital believes that over time, stock prices reflect the earnings growth of their underlying businesses. Their team is dedicated to identifying the relatively small number of truly exceptional growth businesses that they expect to own for many years. The firm has two primary concentrated growth strategies: Select Growth, emphasizing rapidly growing innovative businesses, and Global Growth, emphasizing rapidly growing business all over the world.\n\nFrank Sands ( Trades , Portfolio ) added a total of 6 stocks, among them:\n\nThe most significant addition was Quanta Services Inc ( NYSE:PWR ), with 576,896 shares, accounting for 0.74% of the portfolio and a total value of $243.48 million.\n\nThe second largest addition to the portfolio was Carpenter Technology Corp ( NYSE:CRS ), consisting of 621,684 shares, representing approximately 0.6% of the portfolio, with a total value of $195.73 million.\n\nThe third largest addition was Boston Scientific Corp ( NYSE:BSX ), with 805,164 shares, accounting for 0.23% of the portfolio and a total value of $76.77 million.\n\nFrank Sands ( Trades , Portfolio ) also increased stakes in a total of 20 stocks, among them:\n\nThe most notable increase was Shopify Inc ( NASDAQ:SHOP ), with an additional 2,568,765 shares, bringing the total to 9,506,036 shares. This adjustment represents a significant 37.03% increase in share count, a 1.26% impact on the current portfolio, with a total value of $1,530,186,620.\n\nThe second largest increase was Carvana Co ( NYSE:CVNA ), with an additional 751,019 shares, bringing the total to 2,442,534. This adjustment represents a significant 44.4% increase in share count, with a total value of $1,030,798,200.\n\nFrank Sands ( Trades , Portfolio ) completely exited 4 of the holdings in the fourth quarter of 2025, as detailed below:\n\nDexCom Inc ( NASDAQ:DXCM ): Frank Sands ( Trades , Portfolio ) sold all 4,934,189 shares, resulting in a -0.92% impact on the portfolio.\n\nOracle Corp ( NYSE:ORCL ): Frank Sands ( Trades , Portfolio ) liquidated all 936,043 shares, causing a -0.73% impact on the portfolio.\n\nFrank Sands ( Trades , Portfolio ) also reduced positions in 38 stocks. The most significant changes include:\n\nReduced Taiwan Semiconductor Manufacturing Co Ltd ( NYSE:TSM ) by 2,425,714 shares, resulting in a -26.22% decrease in shares and a -1.87% impact on the portfolio. The stock traded at an average price of $293.5 during the quarter and has returned 30.78% over the past 3 months and 21.13% year-to-date.\n\nReduced ServiceNow Inc ( NYSE:NOW ) by 2,388,471 shares, resulting in a -38.33% reduction in shares and a -1.21% impact on the portfolio. The stock traded at an average price of $171.37 during the quarter and has returned -36.96% over the past 3 months and -30.07% year-to-date.\n\nAt the fourth quarter of 2025, Frank Sands ( Trades , Portfolio )'s portfolio included 66 stocks, with top holdings including 11.37% in NVIDIA Corp ( NASDAQ:NVDA ), 6.31% in Taiwan Semiconductor Manufacturing Co Ltd ( NYSE:TSM ), 5.22% in Amazon.com Inc ( NASDAQ:AMZN ), 4.7% in Alphabet Inc ( NASDAQ:GOOGL ), and 4.65% in Shopify Inc ( NASDAQ:SHOP ).\n\nThe holdings are mainly concentrated in 7 of all the 11 industries: Technology, Consumer Cyclical, Communication Services, Financial Services, Industrials, Healthcare, and Basic Materials.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "KLAC",
      "Date": "2026-02-13",
      "Time": "23:16:00",
      "Source": "Zacks",
      "Title": "ASML Climbs 11% in a Month: Time to Buy, Sell or Hold the Stock?",
      "URL": "https://finance.yahoo.com/news/asml-climbs-11-month-time-151600663.html",
      "Content": "ASML Holding ASML shares have surged 11.3% in the past month, outperforming the Zacks Computer and Technology sector’s decline of 3.4%. ASML stock has also outperformed its peers, namely Lam Research LRCX and KLA Corporation KLAC, while underperforming Applied Materials AMAT in the same time frame.\n\nImage Source: Zacks Investment Research\n\nShares of Lam Research, KLA Corporation and Applied Materials have returned 10.8%, 1.1% and 19.1%, respectively. This surge in stock price has also made ASML stock overvalued. ASML stock trades at a forward 12-month price-to-sales (P/S) of 12.66X compared with the sector average of 6.37X, which makes it overvalued at present, as suggested by the Zacks Value Score of F.\n\nImage Source: Zacks Investment Research\n\nNow the question remains: Should the investors buy, sell or hold shares of this semiconductor manufacturing equipment player?\n\nSustained demand for artificial intelligence and high performance computing chips by global data centers, AI labs and hyperscalers has reinforced ASML’s long-term growth outlook as the company provides extreme ultraviolet (EUV) semiconductor lithography tools to chip manufacturers that enable them to accelerate capacity expansion.\n\nASML’s management on the fourth-quarter 2025 earnings call noted that ASML’s customers have become more confident about medium-term AI demand, leading to stronger order intake and investment plans as chipmakers transition from 4-nanometer to 3-nanometer and prepare for the 2-nanometer transition.\n\nAs EUV intensity per wafer continues to rise, AI and HPC workloads are addressed more efficiently. In memory, robust demand for high-bandwidth memory (HBM) and advanced DRAM nodes is expected to tighten supply through at least 2026, further supporting EUV demand.\n\nASML is also benefiting from a growing installed base, which is driving high-margin service and upgrade revenues as customers increasingly view upgrades as the fastest way to add capacity. With a €38.8 billion backlog and reaffirmed long-term targets, ASML remains well-positioned to capitalize on the AI-led semiconductor investment cycle.\n\nFor 2026, ASML expects its revenues in the range of €34-€39 billion. The Zacks Consensus Estimate for ASML’s 2026 revenues is pegged at $43.31 billion, indicating a year-over-year improvement of 17%.\n\nAlthough ASML faces competitive pressure from players like Lam Research, Applied Materials and KLA Corporation in the broader wafer equipment manufacturing market, ASML holds a near-monopoly in EUV technology.\n\nEUV is crucial for the world’s most advanced chips at 3nm and below; it benefits from extraordinary pricing power and strategic importance with major customers like TSMC, Samsung and Intel.\n\nASML’s venture into sub-2nm production with High Numerical Aperture (High-NA) EUV systems is the next technological leap for chipmakers. This technology will provide ASML with long-term potential as the industry moves toward denser and more efficient chips. ASML’s High-NA machines will be central to that shift.\n\nThe Zacks Consensus Estimate for ASML’s 2026 earnings is pegged at $33.63, indicating a year-over-year improvement of 20.3%. The consensus estimate has been revised upward in the past seven days.\n\nImage Source: Zacks Investment Research\n\nASML’s unmatched EUV leadership, AI-driven demand visibility, and strong earnings momentum support a long-term bullish view, making this Zacks Rank #2 (Buy) stock attractive at present. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "TSM",
      "Date": "2026-02-13",
      "Time": "23:09:34",
      "Source": "Insider Monkey",
      "Title": "TSMC Reports Strong January Revenue Growth",
      "URL": "https://finance.yahoo.com/news/tsmc-reports-strong-january-revenue-150934439.html",
      "Content": "Taiwan Semiconductor Manufacturing Company Limited (NYSE: TSM ) is among the most profitable mega cap stocks to buy . On February 9, Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) reported consolidated net revenue of NT$401.26 billion for January 2026, up 19.8% from December 2025 and 36.8% from January 2025. Additionally, the board of directors approved a cash dividend of NT$6.0 per share for Q4 2025.\n\nEarlier on February 5, Reuters reported that Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) is planning mass production of advanced 3-nanometre chips in Kumamoto, southern Japan. This announcement places Japan at the forefront of the production of top-notch 3-nanometre chips, which are utilized in both HPC and AI servers. These chips are set to be manufactured at the company’s second fab in Arizona next year. This acceleration in AI will help the company outperform its peers.\n\nAs stated by CEO C.C. Wei in Tokyo at a meeting with Japan’s Prime Minister Sanae Takaichi,\n\nTaiwan Semiconductor Manufacturing Company Limited (NYSE:TSM), founded in 1987, is a global foundry for integrated circuits and other semiconductor devices. The core offerings of this Taiwanese company include wafer fabrication processes, mask manufacturing, and engineering support services, among others.\n\nWhile we acknowledge the potential of TSM as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MPWR",
      "Date": "2026-02-13",
      "Time": "22:54:58",
      "Source": "Insider Monkey",
      "Title": "KeyBanc Raises Monolithic Power Systems (MPWR) Price Target on Record Quarterly Revenue",
      "URL": "https://finance.yahoo.com/news/keybanc-raises-monolithic-power-systems-145458481.html",
      "Content": "Monolithic Power Systems, Inc. (NASDAQ: MPWR ) ranks among the best high growth high margin stocks to buy now . On February 6, KeyBanc boosted its price target for Monolithic Power Systems, Inc. (NASDAQ:MPWR) to $1,500 from $1,300, retaining an Overweight rating on the company’s shares. The boost comes after the company’s fourth-quarter results and first-quarter forecasts, which KeyBanc defined as “strong”. Notably, Monolithic Power Systems, Inc. (NASDAQ:MPWR) raked in a record quarterly revenue of $751.2 million, exceeding expectations of $740.23 million.\n\nKeyBanc stated that the company’s fourth-quarter momentum was prominent in the Data Center division, which produced substantial year-over-year growth spanning Enterprise Data, Computing & Storage, and Communications.\n\nGiven the strong market demand and share gains, the firm noted that Monolithic Power Systems, Inc. (NASDAQ:MPWR) has raised its 2026 Enterprise Data growth expectation from an earlier projection of 35% to more than 50%, though it considers this goal to be conservative.\n\nMonolithic Power Systems, Inc. (NASDAQ:MPWR) produces and markets small, ultra-efficient, user-friendly power management systems for various industries, including computers, automotive, data centers, and communications.\n\nWhile we acknowledge the potential of MPWR as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "CSCO",
      "Date": "2026-02-13",
      "Time": "22:00:02",
      "Source": "Barchart",
      "Title": "As Cisco Unveils a New AI Networking Chip, Should You Buy, Sell, or Hold CSCO Stock?",
      "URL": "https://finance.yahoo.com/m/dcc8033e-5850-3335-a152-a4b86ed19e4f/as-cisco-unveils-a-new-ai.html",
      "Content": "Cisco Systems (CSCO) just released an artificial intelligence (AI) networking chip that could reshape how the world's biggest data centers handle AI workloads. The Silicon One G300 delivers 102.4 terabits per second of switching capacity.\n\nThat's more than double what the previous generation could handle. The chip powers new systems designed specifically for massive AI clusters, where thousands of GPUs must constantly communicate.\n\nA $100 Million Reason to Buy Intel Stock Now\n\n4,500 Reasons to Buy Amazon Stock Today\n\n1 High-Yield Dividend Stock to Buy Hand Over Fist in February 2026\n\nOur exclusive Barchart Brief newsletter is your FREE midday guide to what's moving stocks, sectors, and investor sentiment - delivered right when you need the info most. Subscribe today!\n\nHere's what investors should know about CSCO stock in light of the news.\n\nThe G300 chip tackles AI's biggest infrastructure problem. When training large language models or running AI inference at scale, data must be constantly moved between GPUs. Any delays or dropped packets can stall entire jobs, wasting expensive compute time.\n\nCisco's chip uses something called Intelligent Collective Networking. Think of it as traffic management for data. The chip has an industry-leading buffer that can absorb sudden bursts of traffic without dropping packets. It also continuously monitors the network and reroutes traffic around issues before they cause failures.\n\nThe results speak for themselves. Cisco reports that the technology delivers 33% higher network utilization than traditional approaches. Job completion times drop by 28%. That means more AI tokens generated per hour from the same GPU hardware. For companies spending millions on AI infrastructure, those improvements translate directly to better returns on investment.\n\nCisco has built complete systems around the G300 that address AI's power and cooling challenges. The new Cisco N9000 and Cisco 8000 systems come in both liquid-cooled and air-cooled versions. The liquid-cooled systems achieve nearly 70% better energy efficiency. One new system delivers the same bandwidth as six older systems. That matters enormously as data centers struggle with power constraints, fitting more AI capacity in the same physical space while using less energy.\n\nCisco also introduced 1.6 terabit optics and new 800G linear pluggable optics that cut power consumption by 50% compared to older designs. Overall, switch power consumption drops by 30%, improving operational reliability and sustainability.\n\nCisco's management shared compelling numbers during recent investor conferences. The company took in $1.3 billion in AI infrastructure orders during just the first quarter of fiscal 2026. That's from hyperscalers alone. The figure doesn't include sovereign cloud providers, neoclouds, or enterprise customers.\n\nFor fiscal 2026, Cisco expects to take in at least double the $2 billion in AI orders from fiscal 2025, while AI-powered revenue should increase to $3 billion. Even more impressive, Cisco now has design wins at five of the six largest hyperscalers. In Q1 alone, the company won four new design wins across four different hyperscalers. These aren't one-time purchases, as design wins can generate orders for three-plus years. Four hyperscalers increased their orders with Cisco by more than 100% year-over-year (YOY) in the first quarter. That shows deepening relationships beyond initial trials.\n\nSilicon One gives Cisco real advantages. CFO Mark Patterson called it one of the company's \"most strategic assets.” The chip is also highly programmable. Customers can upgrade equipment with new features even after deployment. That protects long-term infrastructure investments and creates stickiness. Cisco now has a variety of Silicon One product families, covering everything from AI data centers to enterprise networks.\n\nThe hyperscaler business receives the most attention, but Cisco sees significant opportunities elsewhere. For example, the sovereign cloud and neocloud pipeline exceeds $2.5 billion. These customers want AI infrastructure but need local control over their data and operations. Cisco's relationships with partners such as HUMAIN position it well.\n\nEnterprise AI remains early, but could dwarf everything else. Cisco's partnership with Nvidia (NVDA) focuses on simplifying enterprise AI deployment. The companies offer validated reference architectures that remove complexity.\n\nPresident Jeetu Patel noted at Cisco's AI Summit that token generation will become \"one of the core currencies of every company and every country.\" Organizations that can generate AI tokens efficiently and cost-effectively will gain a competitive advantage.\n\nWhile AI grabs headlines, Cisco's campus networking refresh provides steady growth. The company has billions of dollars worth of installed switches approaching the end of support. These older systems pose security risks and can't handle modern AI workloads.\n\nCisco refreshed virtually its entire campus portfolio in June. The new switches incorporate AI and security directly into the fabric. Campus networking orders accelerated in the first quarter compared to the fourth quarter of fiscal 2025. Adoption of new platforms is happening faster than previous product launches.\n\nThis isn't a one-quarter spike. The campus refresh will unfold over multiple years as enterprises modernize their networks to support AI-powered applications and agile workloads.\n\nCisco generated strong cash flow while investing heavily in AI. The company bought back $2 billion in CSCO stock during Q1 at an average price of $68. That shows management's confidence while returning capital to shareholders.\n\nGross margins held steady at around 68% despite the inclusion of a lower-margin hyperscaler business. The company manages its diverse portfolio to maintain profitability while growing revenue.\n\nOperating expenses are growing more slowly than revenue. Earnings are growing faster than the top line in every recent quarter and in the full-year guidance.\n\nOut of 24 analysts covering Cisco stock, 15 recommend a “Strong Buy,” one recommends a “Moderate Buy,” and eight recommend a “Hold” rating. That makes for a consensus “Moderate Buy” rating. The average CSCO stock price target is $86.90, which represents 16% potential upside from current levels.\n\nThe AI networking opportunity is massive, and Cisco has real technological advantages. Design wins at multiple hyperscalers validate the technology and create multi-year revenue streams.\n\nThe sovereign cloud and enterprise markets are just beginning. As AI moves beyond hyperscalers into broader deployment, Cisco's full-stack approach becomes even more valuable. Cisco's campus refresh also supports steady growth as the company scales its AI infrastructure. Security through Splunk adds another growth vector as customers prioritize protecting AI deployments.\n\nNear-term volatility is possible if AI spending pauses or memory costs spike. But Cisco's diversified business model and strong balance sheet can handle bumps. For investors who can handle some volatility, Cisco offers exposure to AI infrastructure growth at a reasonable valuation with dividend income while you wait.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "STM",
      "Date": "2026-02-13",
      "Time": "05:16:48",
      "Source": "Barchart",
      "Title": "1 Lesser-Known Chip Stock to Snap Up ASAP",
      "URL": "https://finance.yahoo.com/m/349c0009-d82f-3a1e-a7ec-0501e66b89ec/1-lesser-known-chip-stock-to.html",
      "Content": "The global semiconductor industry appears to be going through structural tailwinds. Fueled by the artificial intelligence (AI) infrastructure boom, global semiconductor industry annual sales are projected to touch $975 billion in 2026, a historic peak. Furthermore, with sustained growth, annual sales may touch $2 trillion by 2036.\n\nWith that in mind, it's unsurprising that semiconductor stocks have surged higher. While some investors might have missed out on the big rally, there also still seem to be pockets of opportunity left. Amid volatility, shares of STMicroelectronics (STM) have trended 43% higher in the last 52 weeks. This lesser-known chip stock seems to hold significant potential.\n\n4,500 Reasons to Buy Amazon Stock Today\n\nA $100 Million Reason to Buy Intel Stock Now\n\nPfizer Reports Strong Earnings Outlook - Unusual Call Options Activity Shows Investors are Bullish\n\nGet exclusive insights with the FREE Barchart Brief newsletter. Subscribe now for quick, incisive midday market analysis you won't find anywhere else.\n\nSTMicroelectronics recently announced a partnership with Amazon's (AMZN) Amazon Web Services (AWS), and this multi-billion-dollar collaboration underscores the point of scope for value creation. As part of the deal, STM will be a supplier of advanced semiconductor technologies and products to AWS. Further, STM will issue warrants to AWS for up to 24.8 million shares. Besides establishing credibility, this deal is likely to be a top-line growth driver for STMicroelectronics and STM stock.\n\nBased in the Netherlands and headquartered in Switzerland, STMicroelectronics is a designer, developer, and manufacturer of semiconductor products globally. The company’s key business segments include RF & Optical Communications, Analog Products, MEMS & Sensors, Embedded Processing, and Power & Discrete Products. In terms of end users, the automotive, industrial and personal electronics segments are business growth drivers for the company.\n\nFor fiscal 2025, STMicroelectronics reported revenue of $11.8 billion with a gross margin of 33.9%. For the same period, the firm reported free cash flow of $265 million.\n\nWhile STMicroelectronics reported revenue degrowth in fiscal 2025, SMT stock has trended higher by 28% in the last six months, in part due to a positive long-term outlook backed by key strategic partnerships.\n\nWhile revenue degrowth is a concern, STM stock has been in an uptrend. After all, the company has multiple growth catalysts in the next few years. The partnership with AWS is one growth trigger. Similarly, the company’s chip supply to SpaceX for Starlink is expected to double in the next two years.\n\nSTM has also indicated that revenue from silicon carbide power devices is expected to return to 2024 levels by next year. This is after a contraction in revenue in 2025. Further, the firm is targeting data center revenue of $1 billion before the end of the decade.\n\nIn another important development in December 2025, the European Investment Bank (EIB) signed a €500 million financing agreement with the company. This is the initial tranche for a €1 billion credit line that’s intended to boost Europe’s competitiveness in the semiconductor sector. According to the agreement, 60% of the funds will be utilized toward “high-volume manufacturing capabilities” within Europe while 40% will be dedicated to research & development activities. These investments are likely to translate into growth and provide STM with an innovation edge, especially with the emphasis on R&D.\n\nGiven the ratings of 17 analysts, STM stock is a consensus “Moderate Buy.” While eight analysts assign a “Strong Buy” rating to STM, another eight have a “Hold\" rating while one analyst has a bearish “Strong Sell” rating.\n\nBased on these opinions, STM stock has a mean price target of $33.25 currently, implying potential downside of 1% from current levels. However, the most bullish price target of $45 suggests that STM could rise as much as 34% from here.\n\nOne important point to note is that STM stock trades at an attractive forward price-to-earnings (P/E) ratio of 31 times. With analysts estimating earnings growth of 100% and 68% for fiscal 2026 and fiscal 2027, respectively, shares will likely remain in an uptrend.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "BTDR",
      "Date": "2026-02-13",
      "Time": "03:02:15",
      "Source": "GuruFocus.com",
      "Title": "Bitdeer Technologies Group (BTDR) Q4 2025 Earnings Call Highlights: Record Revenue Growth ...",
      "URL": "https://finance.yahoo.com/news/bitdeer-technologies-group-btdr-q4-190215502.html",
      "Content": "This article first appeared on GuruFocus .\n\nRelease Date: February 12, 2026\n\nFor the complete transcript of the earnings call, please refer to the full earnings call transcript .\n\nBitdeer Technologies Group ( NASDAQ:BTDR ) achieved a significant revenue increase of 226% year-over-year, reaching $225 million in Q4 2025.\n\nThe company has expanded its self-mining hash rate to over 63 exahashes per second, establishing itself as one of the largest publicly listed Bitcoin miners.\n\nBTDR is making strategic progress in AI infrastructure, with plans to retrofit a 225-megawatt facility in Norway for AI workloads, leveraging hydropower for cost efficiency.\n\nThe company is actively expanding its GPU as a service platform, with plans to add capacity in Malaysia and the United States, targeting sectors like biomedical, robotics, and gaming.\n\nBTDR's vertically integrated strategy, including proprietary chip design and a robust global power portfolio, positions it well for future growth in both Bitcoin mining and AI infrastructure.\n\nDespite revenue growth, BTDR's gross profit and adjusted EBITDA declined sequentially due to lower Bitcoin prices and higher electricity costs.\n\nThe company faces litigation that could potentially delay development at its Clarington site, impacting its AI data center expansion plans.\n\nBTDR's gross margin significantly decreased to 4.7% in Q4 2025 from 24.1% in Q3 2025, driven by lower Bitcoin prices and increased depreciation expenses.\n\nOperating expenses increased to $66.3 million in Q4 2025, up from $60.5 million in Q3 2025, due to higher headcount and general corporate activities.\n\nThe company reported an adjusted net loss of $82.6 million in Q4 2025, primarily due to higher energy and depreciation costs, despite higher revenue.\n\nWarning! GuruFocus has detected 6 Warning Signs with BTDR.\n\nIs BTDR fairly valued? Test your thesis with our free DCF calculator.\n\nQ : What are the main items being discussed in your co-location negotiations? Is it down to price, duration, timing, or design? A : Harris Bassett, Chief Strategy Officer: Discussions vary with different counterparties, covering all those aspects. These discussions are sensitive and active, and while we are confident about closing deals soon, predicting the exact timeframe is challenging.\n\nQ : Regarding financing, what should we expect in terms of debt, cost of capital, and credit enhancements? A : Harris Bassett, Chief Strategy Officer: The cost of capital will depend on the counterparties and deal terms, making it hard to predict until deals are finalized. Credit enhancements are crucial for determining development costs, and we are exploring various approaches, though nothing dramatically different from existing market practices.\n\nQ : Can you provide more details on the infrastructure piece, specifically the Tel Norway site and its customer profile? A : Harris Bassett, Chief Strategy Officer: The Tel Norway site retrofit is expected to complete by year-end, with production GPUs installed early next year. The site benefits from a low PUE of around 1.1 due to its hydropower and cold climate. Customer discussions are sensitive, but there is overlap with US customers.\n\nQ : How should we think about the growth of your Bitcoin mining business in 2026, especially with AI infrastructure deals in play? A : Harris Bassett, Chief Strategy Officer: We are long-term believers in Bitcoin and will continue investing in mining capacity. While we haven't projected future hash rates, we remain committed to expanding our self-mining operations.\n\nQ : With lower Bitcoin prices, is there a point where you would slow mining activity due to higher costs? A : Harris Bassett, Chief Strategy Officer: There is a price point where we might slow down, but we haven't reached it yet. Our fleet's efficiency and low energy costs allow us to continue operations even if prices drop further. Older machines might be turned off first, but we don't anticipate reaching that point soon.\n\nFor the complete transcript of the earnings call, please refer to the full earnings call transcript .",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MPWR",
      "Date": "2026-02-13",
      "Time": "01:00:04",
      "Source": "Zacks",
      "Title": "What Makes Monolithic Power (MPWR) a Strong Momentum Stock: Buy Now?",
      "URL": "https://finance.yahoo.com/news/makes-monolithic-power-mpwr-strong-170004817.html",
      "Content": "Momentum investing revolves around the idea of following a stock's recent trend in either direction. In \"long context,\" investors will be essentially be \"buying high, but hoping to sell even higher.\" With this methodology, taking advantage of trends in a stock's price is key; once a stock establishes a course, it is more than likely to continue moving that way. The goal is that once a stock heads down a fixed path, it will lead to timely and profitable trades.\n\nWhile many investors like to look for momentum in stocks, this can be very tough to define. There is a lot of debate surrounding which metrics are the best to focus on and which are poor quality indicators of future performance. The Zacks Momentum Style Score, part of the Zacks Style Scores, helps address this issue for us.\n\nBelow, we take a look at Monolithic Power (MPWR) , which currently has a Momentum Style Score of A. We also discuss some of the main drivers of the Momentum Style Score, like price change and earnings estimate revisions.\n\nIt's also important to note that Style Scores work as a complement to the Zacks Rank, our stock rating system that has an impressive track record of outperformance. Monolithic Power currently has a Zacks Rank of #2 (Buy). Our research shows that stocks rated Zacks Rank #1 (Strong Buy) and #2 (Buy) and Style Scores of \"A or B\" outperform the market over the following one-month period.\n\nYou can see the current list of Zacks #1 Rank Stocks here >>>\n\nLet's discuss some of the components of the Momentum Style Score for MPWR that show why this chipmaker shows promise as a solid momentum pick.\n\nA good momentum benchmark for a stock is to look at its short-term price activity, as this can reflect both current interest and if buyers or sellers currently have the upper hand. It's also helpful to compare a security to its industry; this can show investors the best companies in a particular area.\n\nFor MPWR, shares are up 9.4% over the past week while the Zacks Semiconductor - Analog and Mixed industry is up 7.78% over the same time period. Shares are looking quite well from a longer time frame too, as the monthly price change of 21.67% compares favorably with the industry's 11.65% performance as well.\n\nWhile any stock can see its price increase, it takes a real winner to consistently beat the market. That is why looking at longer term price metrics -- such as performance over the past three months or year -- can be useful as well. Shares of Monolithic Power have increased 35.28% over the past quarter, and have gained 71.09% in the last year. On the other hand, the S&P 500 has only moved 1.65% and 15.6%, respectively.\n\nInvestors should also take note of MPWR's average 20-day trading volume. Volume is a useful item in many ways, and the 20-day average establishes a good price-to-volume baseline; a rising stock with above average volume is generally a bullish sign, whereas a declining stock on above average volume is typically bearish. Right now MPWR is averaging 710,006 shares for the last 20 days..\n\nThe Zacks Momentum Style Score also takes into account trends in estimate revisions, in addition to price changes. Please note that estimate revision trends remain at the core of Zacks Rank as well. A nice path here can help show promise, and we have recently been seeing that with MPWR.\n\nOver the past two months, 7 earnings estimates moved higher compared to none lower for the full year. These revisions helped boost MPWR's consensus estimate, increasing from $20.91 to $21.63 in the past 60 days. Looking at the next fiscal year, 3 estimates have moved upwards while there have been no downward revisions in the same time period.\n\nTaking into account all of these elements, it should come as no surprise that MPWR is a #2 (Buy) stock with a Momentum Score of A. If you've been searching for a fresh pick that's set to rise in the near-term, make sure to keep Monolithic Power on your short list.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "BTDR",
      "Date": "2026-02-13",
      "Time": "00:47:03",
      "Source": "Motley Fool",
      "Title": "Bitdeer (BTDR) Q4 2025 Earnings Call Transcript",
      "URL": "https://finance.yahoo.com/m/8ebf20eb-4526-3457-9b0a-caa7b4f88418/bitdeer-%28btdr%29-q4-2025.html",
      "Content": "Image source: The Motley Fool.\n\nThursday, Feb. 12, 2026 at 8:00 a.m. ET\n\nChief Executive Officer — Jihan Wu\n\nChief Business Officer — Haris Basit\n\nChief Financial Officer — Matt Linghui Kong\n\nHaris will provide a high-level overview of Bitdeer Technologies Group's fourth quarter 2025 results and discuss the company's strategy, provide a detailed business update, and review the financial results for the quarter. Jihan, Matt, and Haris will be available for questions after the formal remarks. To accompany today's call, we have provided a supplemental investor presentation available on Bitdeer Technologies Group’s investor relations website under Webcasts and Presentations. Before management begins their formal remarks, I would like to remind everyone that during today's call, we may make certain forward-looking statements. These statements are based on management's current expectations and are subject to risks and uncertainties, which may cause actual results to differ materially.\n\nFor a more complete discussion on forward-looking statements and the risks and uncertainties related to Bitdeer Technologies Group's business, please refer to the company's filings with the SEC. In addition to discussing results calculated in accordance with International Financial Reporting Standards, or IFRS, we will also reference certain non-IFRS financial measures such as adjusted EBITDA and adjusted profit and loss. For more detailed information on our non-IFRS financial measures, please refer to our earnings release published earlier today, which can be found on Bitdeer Technologies Group’s IR website. With that, I will now turn the call over to Haris. Thank you, John, and good day, everyone.\n\nHaris Basit: It is great to be with you today. The 2025 marked a defining period of execution and strategic progress for Bitdeer Technologies Group. Achieved critical milestones across our three strategic pillars, and position the company for sustained growth as a vertically integrated Bitcoin and AI infrastructure company. I will start with a brief overview of our financial performance for the quarter. Fourth quarter total revenue reached $225,000,000, up 226% year over year and 33% sequentially. Gross profit totaled $10,600,000, adjusted EBITDA was $31,200,000 for the quarter.\n\nWhile both metrics declined sequentially, the results primarily reflect a combination of lower average Bitcoin pricing, modestly higher electricity costs, substantially higher depreciation expense due to the rapid expansion of our self-mining capacity, and further investment in new talent to support our growing AI HPC initiatives. I will discuss these factors in greater detail later in the call. Let me begin with a brief review of our power and infrastructure portfolio. We continue to make meaningful progress during the quarter, advancing a global portfolio of sites that we believe are well suited to support both large-scale Bitcoin mining and next-generation AI and HPC workloads.\n\nAcross regions, our focus remains on developing power-rich, capital-efficient infrastructure that provides flexibility, speed to market, and long-term strategic optionality. From an energy infrastructure perspective, execution during the quarter remained on track. At the January, we had over 1.66 gigawatts of capacity online, and a total global power pipeline of three gigawatts. We believe this represents one of the most attractive and AI-suitable power portfolios in the industry and provides us with a vast opportunity as the demand for such capacity continues to grow. Over the past several months, have seen a significant shift in market dynamics around AI data center development.\n\nDemand for large-scale colocation capacity has increased substantially and we have responded by refining our approach to better align with this opportunity. Therefore, we are currently prioritizing colocation services provided to Norway and the United States that are suitable for large-scale AI HPC deployments. Let me walk through a few sites and where we stand with our development plans. First, Teadle, Norway, represents our most near-term colocation opportunity. This 225-megawatt facility was originally constructed to Tier III data center specifications, which puts us in a favorable position for conversion to AI workloads.\n\nWe estimate the retrofit will require much less incremental capital expenditure to add uninterruptible power supply systems, backup batteries, and generation, as well as some additional cooling capacity compared to industry benchmarks for greenfield Tier III data center development, which typically run in the $8,000,000 to $12,000,000 per megawatt range. The site benefits from hydropower with attractive economics; independent 100-megawatt transformers provide redundancy. We are currently in lease discussions with multiple counterparties and expect to be in a position to announce a signed lease agreement for Teadle as soon as possible in 2026, although the exact timing is very difficult to predict.\n\nThis site should be capable of supporting initial test GPU deployment late 2026 and first production GPUs expected in early 2027. Second, our 570-megawatt site in Clarington represents one of the larger AI data center development opportunities in the United States. Have made progress on two fronts here. First, the local utility has accelerated our interconnection timeline. Second, we are currently in discussion with multiple prospective tenants. These are well recognizable companies in the space, and the discussions are progressing. While litigation has recently been filed that could potentially delay development at this location, believe that we have meritorious claims and a strong defense and will pursue an expedient solution.\n\nGiven the scale of this site, even a partial or first phase lease would represent a significant milestone for Bitdeer Technologies Group and would provide substantial contracted revenue while derisking our development capital. Third, at Rockdale, we are pursuing a strategy that allows us to maintain our current Bitcoin mining operations while developing new HPC capacity. We are evaluating the acquisition of adjacent land to our existing facility we could potentially construct a purpose-built HPC data center. This approach would minimize disruption during data center development to our 563-megawatt mining operation, which continues to generate revenue. The greenfield HPC build would be designed from the ground up for AI workloads.\n\nThe Rockdale site benefits from its location in the ERCOT market, provides operational flexibility. We are currently talking with prospective colocation tenants for this site. The dual-track approach, maintaining Bitcoin mining while developing HPC capacity, reflects our commitment to both businesses and our ability to optimize our power portfolio across use cases. While we are prioritizing colocation for our larger sites, continue to see opportunity in GPU-as-a-service for targeted markets. We are expanding our cloud platform in Malaysia by 10 to 15 megawatts, building on the success we have had in Singapore serving customers in biomedical, robotics, and gaming sectors who need fully managed orchestrated infrastructure.\n\nIn the United States, we are planning to add 10 megawatts of GPU capacity in Washington state and are evaluating a partial conversion of our Knoxville site from Bitcoin mining to GPU cloud. I want to be clear that the scale of our long-term US GPU-as-a-service expansion is predicated on signing customer contracts. Do not anticipate deploying large speculative capacity. Expect all major GPU deployments will be backed by committed revenue from enterprise customers who are seeking meaningful capacity with comprehensive managed services. This disciplined approach ensures we are deploying capital we have revenue certainty. A key element of our strategy is how we are approaching data center development.\n\nWe have built an internal development team with experience in very large data center construction and we are augmenting that team through strategic hires, working with experienced EPC contractors and general contractors on a fee basis rather than through joint venture arrangements. This gives us greater control over timelines and specifications, and importantly, it allows us to retain more of the economic value these assets generate. As we look ahead, the growth will continue to be anchored by our three strategic pillars, between mining, ASIC development, and HPC AI. Together, these represent a vertically integrated, highly defensible platform that leverages our deep technology expertise, proprietary chip design capabilities, and extensive global power portfolio.\n\nThe supply-demand imbalance for AI compute continues to widen, and we expect this shortage to persist well into 2027. Time to power is a critical variable, and we believe Bitdeer Technologies Group is exceptionally well positioned to serve customers seeking both near-term and midterm capacity. On the Bitcoin mining side, the rapid expansion of our self-mining platform continues. We exited the year with more than 55 exahash per second of self-mining hash rate, and in the month of January alone, we brought another eight exahash per second online, exiting the month of January at over 63 exahash per second. This firmly establishes Bitdeer Technologies Group as one of the largest publicly listed Bitcoin miners by total hash rate under management.\n\nSupported by the disciplined rollout of our SealMiner fleet, accelerated deployment of SealMiner rigs has driven material improvements in fleet-wide efficiency. The SealMiner A2 and A3 being actively deployed in our self-mining business operate at approximately 15 to 16.5 joules per terahash and 12.5 to 14 joules per terahash respectively, and represent industry-leading power efficiency. As these next-generation rigs replace legacy third-party equipment, our blended fleet efficiency continues to improve, with our overall fleet-wide efficiency currently standing at 17.5 joules per terahash as of 01/31/2026. As SealMiner penetration increases throughout 2026, we expect our overall fleet-wide efficiency to continue to improve, enhancing our mining margins. Looking ahead, our self-mining operations are not plateauing.\n\nOur investments in chip design are delivering tangible results. During the quarter, we commenced mass production of the SealMiner A3 series. Initial shipments began in November, and we have deployed a total of 8.7 exahash of our SealMiner A3 to date. As we continue to retire older-generation third-party rigs, we expect the A3 series to continue to meaningfully contribute to our fleet efficiency improvements and growth throughout 2026. On the R&D front, our CLO4-1 chip was completed back in September. The CLO4-1 represents a meaningful step forward in efficiency and positions Bitdeer Technologies Group to maintain technological leadership as the industry continues its relentless drive towards lower power consumption per unit of hash rate.\n\nMass production of mining rigs based on the CLO4-1 chip will begin in Q1 2026. CLO4-2 chip design remains under development at our US-based design center. Additionally, we have successfully taped out a new Litecoin chip, SEAL-DL1, designed for Doge and Litecoin mining. The initial test results of SEAL-DL1 have exceeded comparable rigs in both energy efficiency and hash rate. On the recent market conditions, the CLDL1 generates higher fiat-based returns per megawatt than our SealMiner A2. Preparation for USA SealMiner manufacturing remains in progress. This initiative is a core component of our vertically integrated strategy and aligns with both operational resilience objectives and evolving trade and supply chain dynamics.\n\nNow let me walk through our detailed financial results for the quarter. Before I begin, I would like to remind everyone that all figures I refer to today are in US dollars. Fourth quarter consolidated revenue was $224,800,000, up 225.8% year over year and up 32.5% sequentially. The year-over-year growth and sequential growth in revenue was primarily driven by significantly higher self-mining hash rate as a result of continued CLMiner deployment, as well as contributions from SealMiner sales, offset in part by slightly lower Bitcoin prices for the quarter. Self-mining revenue was $168,600,000, compared to $41,500,000 in Q4 2024 and $130,900,000 in Q3 2025, representing year-over-year growth of 306% and a sequential growth of 28.7%.\n\nContinued growth from Q3 2025 levels reflects a significant increase in average operating hash rate and associated Bitcoin production during the quarter, offset in part by 13% lower average Bitcoin prices quarter on quarter. SealMiner sales revenue was $23,400,000, up 105.4% over the $11,400,000 reported in Q3 2025. Total gross profit for the quarter was $10,600,000, reflecting a gross margin of 4.7%, versus 7.4% in Q4 2024 and $40,800,000 or 24.1% in Q3 2025. Significant decline in gross margin reflects the combined impact of several drivers during the quarter. First, obviously, we experienced 13% lower Bitcoin prices during the quarter along with the gradual increase of the global hash rate.\n\nSecond, on the cost side, experienced an approximately 5% increase in average electricity costs per unit during the quarter when compared to Q3 2025, mainly due to the seasonal winter pricing dynamics at Norway sites. Third, the growth in our self-mining hash rate comes with a concurrent noncash depreciation expense associated with this fleet of new miners. Additionally, during the quarter, we changed our methodology for calculating depreciation expense to reflect a more conservative approach. Now depreciate rigs using a three-year straight-line method versus our prior assumption of a five-year depreciable life for hardware. Total operating expenses for the quarter were $66,300,000 compared to $42,500,000 in Q4 2024 and $60,500,000 in Q3 2025.\n\nThe sequential increase in operating expenses was primarily driven by the following factors compared to Q3. We added more headcount to support both mining site operations and our AI infrastructure expansion, incurred additional holiday season compensation, along with an increase in year-end general corporate activities. These expenditures reflect the operational requirements of our growing infrastructure footprint and the resources necessary to execute on our strategic initiatives. Other operating expenses for the quarter was $43,800,000 compared to $3,700,000 in Q4 2024 and other operating income of $26,500,000 in Q3 2025. This was largely attributable to the fair value change of Bitcoins pledged for the Bitcoin-collateralized loan since Q3 2025.\n\nOther net gain for the quarter was $208,900,000 compared to other net loss of $4 and $79,800,000 in Q4 2024 and $238,500,000 in Q3 2025. This was largely attributable to noncash fair value change of derivative liabilities related to the convertible senior notes issued in November 2024, June 2025, and November 2025. Adjusted net loss was $82,600,000 versus $37,400,000 in Q4 2024 and $36,300,000 in Q3 2025. The increase in loss was primarily due to higher energy and depreciation costs, higher operating and interest expense, partially offset by the year-over-year higher revenue. Adjusted EBITDA was $31,200,000, versus negative $4,300,000 in Q4 2024 and positive $39,600,000 in Q3 2025.\n\nThe sequential decline was primarily driven by higher energy costs and higher operating expenses attributed to salaries and wages for recent additions to our headcount, as well as a number of elevated costs associated with year-end holiday allowance and year-end general corporate activities. To provide a better sense of our G&A expense on a run-rate basis, our Q4 2025 results reflect approximately $3,000,000 of salary, wage, and benefits expense which will largely be recurring, as well as another $6,000,000 to $7,000,000 in consulting, legal, and travel expenses which can vary significantly from quarter to quarter.\n\nNet cash used for operating activities was $599,500,000, primarily driven by SealMiner supply chain and manufacturing costs, electricity costs from the mining business, general corporate overhead, and interest expense. Net cash generated from investing activities was $97,900,000, which includes $50,700,000 of capital expenditures relating to data center infrastructure construction, GPU equipment procurement, and tariffs and freight for mining rigs delivered to the data centers, and $150,600,000 of proceeds from the disposal of cryptocurrencies.\n\nNet cash generated from financing activities for the quarter $454,500,000, which resulted primarily from $388,500,000 of proceeds from the issuance of convertible senior notes, $168,000,000 in borrowings from a related party, and $141,500,000 of proceeds from shares sold under our ATM and ELOC program, free offset by $171,100,000 of repayments of borrowings. For the full calendar year 2025, capital expenditures for the continued build out of our global power and data center infrastructure totaled $176,000,000. Looking to full year 2026, we anticipate total infrastructure spend in the range of $180,000,000 to $200,000,000 for crypto mining data center construction.\n\nPlease note that this guidance covers power and crypto mining data center infrastructure only and does not include CapEx for SealMiners and GPU. AI cloud and colocation capital expenditures are also not included. Turning to our balance sheet and financial position. We exited the year with $149,400,000 in cash and cash equivalents, $83,100,000 in cryptocurrencies, held at cost less impairment, $135,600,000 in cryptocurrency receivables held at fair market value, and $1,000,000,000 in borrowings excluding derivative liabilities. Derivative liabilities were $501,100,000, relate to the November 2024, June 2025, and November 2025 convertible senior notes.\n\nThis represents $171,400,000 reduction compared to the prior quarter, reflecting a noncash fair value adjustment driven by the change in our stock price and settlement for partial principal of November 2024 convertible senior notes. As I mentioned earlier, this does not impact our liquidity or operations. Regarding our outstanding ATM and ELOC facility, we received approximately $143,600,000 in gross proceeds during the quarter. Approximately 6,700,000 additional shares issued. We have exercised disciplined capital allocation throughout the year using the ATM and ELOC opportunistically to support our growth initiative while minimizing dilution.\n\nAs a final note to our financial update, we wish to note that starting in Q1 2026, we will begin to use GAAP instead of IFRS as our accounting standard. In summary, we are proud of our team's execution this quarter and throughout 2025. I want to express my deep pride what our team has accomplished this year. Established Bitdeer Technologies Group as one of the world's largest publicly listed Bitcoin mining operators by total hash rate under management. Our leadership position in self-mining and our proprietary SealMiner technology provide multiple paths to value creation that few, if any, competitors can match.\n\nOur pipeline of developed and contracted power capacity gives us a meaningful competitive edge in serving a variety of customers. The colocation opportunity ahead of us is immense, we are pursuing it proactively. We enter 2026 with strong operational momentum, a differentiated asset base, and a team that has proven its ability to execute at scale. Excited about what lies ahead and remain committed to delivering long-term value for our shareholders. Thank you, Operator. Please open the call for questions.\n\nOperator: Thank you. We will now open for questions. As a reminder, to ask a question, you will need to press *11 and wait for your name to be announced. To withdraw your question, please press *11 again. Our first question comes from the line of Nick Giles of B. Securities. Your line is now open.\n\nNick Giles: Yes. Thank you so much, Operator. Good morning, everyone. Haris, really appreciate the comprehensive update, especially on the colocation side. And my first question was just, and I am sure you are speaking to a range of customers, and you know, at this point of negotiations or discussions, what is really the main items that are being discussed? Is it down to price, duration, timing? There is still a lot of work ongoing around design. Just any additional color on where you stand in the process.\n\nHaris Basit: It is different with different potential counterparties, and we are all of those things that you mentioned are being discussed, maybe not with the same counterparty, but you know, I hesitate to say too much about these discussions. They are sensitive, and you know, very active at this time. So you know, we feel pretty confident that we are going to get colocation deals done in the near future. Predicting that time frame is going to be hard. And, you know, the discussions are pretty intense with several counterparties.\n\nNick Giles: No. Understood. That is helpful, and just my second question was, we think about financing, you made some important comments there on having a larger share of the economics. But should we be expecting in terms of debt cost of capital and what kind of credit enhancements are you looking at, if any?\n\nHaris Basit: Cost of capital for these projects, for the colocation projects, will be very much determined by the counterparties and exact terms of the deal. So I think that is hard to predict right now until we, you know, announce which of these deals are done with which counterparties. Was that responsive to your question? I am not sure if that is what you were.\n\nNick Giles: Asking.\n\nHaris Basit: I mean, that is an important part of any deal. And, you know, it is because it does determine the cost of development to a large extent. And so we are, you know, we are looking at many different approaches here. It is a very important part of getting the deal done right. So it is something that we are focusing on as well. I cannot really say which ones are better or worse. It depends a lot on the counterparty, and it depends on, you know, there is a number of ways to do this. Most of them have been already done in the Marketplace.\n\nAnd know, I do not think you will see anything too dramatically different from those when we announce.\n\nNick Giles: Got it. Understood. Well, again, I appreciate the update, and continue. Best of luck.\n\nJihan Wu: Thank you.\n\nOperator: Thank you. One moment for our next question. Our next question comes from the line of Mike Colonnese of H.C. Wainwright & Co. Your line is now open.\n\nMike Colonnese: Today. First one for me on the infrastructure piece. It sounds like you are pretty far along in negotiations for a potential colo deal at the Teadle site. Curious what type of customers you are in discussions with specifically at that campus. And, Haris, if I heard correctly, it sounds like the full retrofit for the 225 megs could be completed by the end of this year. There a PUE you guys are assuming that number? I know it is built with Tier III standards in mind, but any additional color would be helpful there.\n\nHaris Basit: Yeah. That is correct. We do expect completion of that Teadle Norway site in at the end of this year and then installation of production GPUs at the beginning of next year. And the PUE at that site is actually very low, which is one of the biggest advantages of that site. It is, you know, it is 100% hydropower. It is a nice cold climate. And there is chilled water available from a nearby lake. So the PUE there, for estimation purposes, is around 1.1. It is dramatically better than most locations.\n\nMike Colonnese: Got it. And then, the typical customer profile for that site specific, I know you are in discussions with the range of customers across the portfolio. I would be just curious with that international facility, the type of customers you are looking at.\n\nHaris Basit: Yeah. I mean, there is some difference, but, you know, there is still a lot of overlap with the customers there versus customers in the United States. So but, you know, I really do not want to say too much about who we are talking to and the exact nature of those deals. They are fairly sensitive negotiations at this point. Understood. Understood. And then as it relates to the Bitcoin mining business, you guys are one of the few public miners that continue to rapidly expand your self-mining capacity. How should we think about growth in this business in 2026? Particularly as you look to pursue these AI infrastructure deals across parts of the portfolio?\n\nHaris Basit: So one thing to say is that we are long-term believers in Bitcoin. And, of course, Bitcoin is in a little bit of a down cycle right now. But long term, we believe in Bitcoin. And we will continue to invest in our Bitcoin mining capacity. We have not given any projections for what the total hash rate for our company might be by the end of this year or in any future quarter yet. We are still evaluating that and we may project that at a later time. But at this time, we do not have any projections to share publicly for future growth of our hash rate.\n\nMike Colonnese: Got it. Thanks for the color, Haris, and best of luck with these opportunities.\n\nOperator: Thank you, Mike. Thank you. One moment for our next question. Our next question comes from the line of Kevin Cassidy of Rosenblatt Securities. Your line is now open.\n\nKevin Cassidy: Yes. Thanks for taking my question. And congratulations on all this capacity you have activated. But maybe along those lines that was asked before, with the lower Bitcoin prices, is there a price where you slow your mining activity because costs are higher versus what the hash price would be?\n\nHaris Basit: I am sure there is such a price, so we just have not reached it yet. So you know, our efficiency of our fleet keeps improving. And, so it also, you know, as price goes down, it be the entire fleet. Some parts of the fleet, you know, because of the efficiency and because of the energy price at that location, can continue to operate for quite some, you know, in quite some even further decrease beyond here. And then you will, some of the older machines that have been around for several years, those could be turned off first. Right? In fact, just in our normal upgrade cycle, we will be replacing those.\n\nSo there is, you know, we have not reached that point now, and I do not anticipate that we will. But, you know, of course, there is such a price. It is just much lower than what we are at now.\n\nKevin Cassidy: Okay. Great. That is good information. I guess as you keep lowering your costs, then you can handle lower Bitcoin prices. But just as another topic, is the GPU-as-a-service, is there a good market for the, say, N minus one GPU clusters rather than spending money on the very leading edge of GPUs? Is there still a need for GPU-as-a-service for the older GPUs?\n\nHaris Basit: Yes. There is. We are, though, however, typically pursuing the latest and greatest GPUs. But I mean, we still get demand for, you know, even our oldest H100s that we have in Singapore.\n\nKevin Cassidy: Okay. Great. Thanks.\n\nOperator: Thank you. One moment for our next question. Our next question comes from the line of Darren Aftahi of ROTH. Your line is now open.\n\nDarren Aftahi: Yes, good morning. Good evening. Thanks for taking my questions. Haris, could you dive a little bit more into sort of the scale and scope of the hires you have made for digital infrastructure towards the end of the year that you spoke to, and then kind of the cadence of continued investment in maybe Q1 and into 2026? I guess, at what point do you feel like you have an adequate team to kind of attack this opportunity?\n\nHaris Basit: Yeah. I mean, we are very pleased with some of our recent hires. We have hired people with direct expertise in AI, in cloud services. And a lot of those folks have been in the United States, but also in Asia. The team is, you know, the number of people dedicated to this has grown dramatically. I do not think I have an exact number. But we continue to hire. I do not think we have reached, you know, a place where we think we have enough folks yet. But we are still looking for people, especially on the side of the engineering part of building data centers with still open racks there. So no.\n\nI expect that we will continue to hire throughout the year. And a lot of those folks will be in the United States. But, you know, we have also done significant AI hiring in Asia.\n\nDarren Aftahi: Got it. And then same question on the Rockdale site is sort of twofold. In terms of land acquisition for that, kind of where are you, and what is the timeline on process? And then I know Oncor is supposed to put another substation in, and I think you guys have spoken to additional capacity there. I think it is in the 100-some plus megawatts. But in light of kind of the seesaw that is going on with ERCOT and decision on batching, just kind of curious about your thoughts about prospects of Rockdale actually growing as a site. Thanks.\n\nHaris Basit: The recent, you know, information around ERCOT and power allocation in that region, we do not believe that applies to the growth at Rockdale. So the 179, up to 179 megawatts that we anticipate we could add there, should not be affected by that. And I say it that way because, of course, we do not know what the exact regulations will be. They are just still under discussion. So we do expect that we will get most of that, if not all of that additional capacity. The land acquisition there is moving forward. You know, it is not done until it is done, but we are, we are, yeah.\n\nI am not sure how to characterize where we are in that process, but, you know, we are actively pursuing it. And we expect that we will finish it. But until we do, it is hard to say exactly when that is going to happen. Great. Appreciate the insights. Thanks.\n\nOperator: Thank you. One moment for our next question. Next question comes from the line of Greg Lewis of BTIG. Your line is now open.\n\nGreg Lewis: Hey. Thank you, and good morning. Good open. Hey, I guess first, I mean, on published numbers, I guess you guys are the bitcoin miner of the listed companies by XFASH. So congrats on that. I did want to talk a little bit about the GPU business. You noted about potential expanse. You should a mouthful. The potential expansion in Malaysia. Know, just kind of curious, is that infrastructure that we are building, are we leasing? And then just kind of how should we think about, you know, the rollout of that, I guess, I think you mentioned 15 megawatts in Malaysia for the GPUs.\n\nHaris Basit: Yeah. That is infrastructure that we are leasing. I welcome Matt or Jihan to add to that. They want. But what was the second part of your question? How should we think about the rollout of bringing those 15 megawatts online and generating revenue from that? I mean, we have proactively purchased some, I think, the GB200 NVL72 and installed it just recently there. So that is in place right now. In terms of additional machines there, do not think we have made any announcements at present. So that is actually.\n\nGreg Lewis: Okay. But it is, but it sounds like it sounds like we could start seeing revenue maybe in the second quarter, and then maybe that scales up sequentially for a couple of quarters?\n\nHaris Basit: Yeah. I think, John and Matt are closer to that than I am. So I do not know if, is that a, is that a correct statement that you have?\n\nJihan Wu: I think we will be able to deploy GPUs into those infrastructures at the fourth quarter or third quarter of this year. It depends on when that infrastructure will be ready. We will no tests. It will be ready around June. But, and maybe there will be one or two month delays. So I sent 2024 can be more conservative estimation.\n\nGreg Lewis: Okay. Super helpful. Alright. Hey, everybody. Thanks for the time, and have a great day.\n\nJihan Wu: Thank you, Greg.\n\nOperator: Thank you. One moment for our next question. Our next question comes from the line of John Todaro of Needham. Your line is now open.\n\nJohn Todaro: Hey, great. Thanks for taking my question and the all the extra hash, bro. I guess, can we just get a bit more color on Clarrington? Like, do you need litigation results before signing an HPC customer there? You view that differently. Maybe any guardrails on timeline there? And then I have a follow-up on the mining piece.\n\nHaris Basit: So because it is litigation, we have to be sort of, you know, more careful in what we say here. You know, our attorneys feel very strongly that we have a very good case here, and the litigation has little merit, and we will, you know, prevail here. And on the business side, we are, you know, exploring alternative that can mitigate the impact of the litigation. I do not really want to say a lot more than that. You know, as we said in our scripted remarks, we do anticipate that there will be, you know, some potential delay. But, you know, we are still confident in the site overall.\n\nBut it is early days, and we, you know, we are looking at some significant alternatives.\n\nJihan Wu: Yeah. I think the alternative, alternative here, we have multiple alternative options. Creating alternative options is to solve those problems. I believe it is very critical solving those problems. And at a company level, Clarrington, Rockdale, and our lower chin size, we would be able to have lots of alternatives. Other than Carrington. This is the company level. And under the Clariton level, we believe we have several solutions. So I do not think that we are really caught at this kind of litigation.\n\nJohn Todaro: Okay. Understood. Thank you for that. And then on the that latest tape out for the Dogecoin and Litecoin mining, do you anticipate mining some of these other assets? Alongside Bitcoin? And maybe I was looking at some of the margin profile. It looks like there is still some margin there. But maybe the opportunity in those as well.\n\nJihan Wu: Well, I think 99% or 98% will still be Bitcoin mining. This autochrome mining operations cannot really be scalable very much due to the market cap. So we count into a very small size operations. But on those, on those capacity, we deploy those manual rates yield out of from those capacity will be significantly improved. So I think it is worth the effort to add some, add some. And then, by the way, this is our first b commanding chip and the manual machines that are designed and manufactured totally depends on our Singapore and the Malaysia office. And the Malaysia operation as well. Malaysia operation, we started to build since last year or earlier.\n\nI think that this product, it also means that our supply chain center in Malaysia has been quite mature. So Malaysia and Vietnam, we will have two supply chain center. For companies. Think it is very strategic and important for the resilience of our business in the future.\n\nHaris Basit: Understood. That is helpful. Thank you, gentlemen. Appreciate it. Thanks, John.\n\nOperator: Thank you. One moment for our next question. Our next question comes from the line of Brett Knoblauch of Cantor Fitzgerald. Your line is now open.\n\nBrett Knoblauch: Hi, guys. Thank you for taking my question. Maybe now that we are several weeks into the year, I am curious if you have any insights into what wafer allocation is going to look like this year compared to last year? And on the back of that, with Bitcoin price coming down, network cash staying resilient, hash price going to kind of near all-time lows, does that, you know, more incentivize you guys to use manufacturing capacity for, call it, internal use rather than sell external? Or how should we kind of look at the split between what you guys manufacture for yourselves Versus sell this year? Thank you.\n\nJihan Wu: We cannot tell the exact number or situation with the different allocation, but we have a really good relationships. And even though the we all know that the demand for AI business is huge, several times. Then take them to rehab, but we will get some co coda from additional capacity. And the hash price drops to historically due now recently. And it became very difficult for sending the money works with profit. But we have our own capacities or electricity cost is one of the lowest on the market. And our CapEx, so perhaps combined together, we are the lowest on the market.\n\nSo our self money definitely became kind of very defensive, very safe strategy for our companies to make sure that even though in this kind of environment, our Bitcoin mining operations will be profitable. So self deployment will be a very important strategy in 2006, especially in the kind of a very bearish marketplace. I think our market share for the Bitcoin mining output will continue to grow. Into something.\n\nHaris Basit: Perfect. Thank you.\n\nOperator: Thank you. One moment for our next question. Our next question comes from the line of Mike Grondahl of Northland. Your line is now open.\n\nMike Grondahl: Hey, thank you. Hey, Haris, I just wanted to ask, on the November call, there was a significant emphasis on, you know, GPU rental, and that is what Bitdeer Technologies Group wanted to do. And now it seems like you are adjusting that a little bit on some of the larger sites, you know, colocation. Can you just talk about pivot away or why you are seemingly deemphasizing GPU rental at some of those large sites?\n\nHaris Basit: Maybe, Jihan, do you want to do that answer first, and then I can chime in if there is still.\n\nJihan Wu: Yes. I as an on the very live site, colocation is kind of very natural and good choice for a company. And for GPU rental, we have a smaller size Washington State and Tennessee State. We can absolutely handle that ourselves. And maybe a larger capacitors for a lot of interest is besides, like, 10 megawatts or 50 megawatts. They want the nitrocytes anyway, and the nitrocytes in before company better to have some coefficient deal.\n\nHaris Basit: Do you have another question, Mike?\n\nMike Grondahl: No. So hey. Just so I understand, you have just sort of the larger sites, you will go colocation. The smaller ones, you go GPU rental. I guess that was kinda my takeaway. Is that fair?\n\nHaris Basit: Yes. That is correct. Got it.\n\nOperator: Okay. Thank you. Thank you. One moment for our next question. Our next question comes from the line Steven Glagola of KBW. Your line is now open.\n\nSteven Glagola: Hey, thanks for the question. I have two. First for Haris. I would like to clarify whether Bitdeer Technologies Group’s US AI cloud expansion and potential expansion in Washington and Tennessee is dependent on securing multiyear reserve capacity agreements? And if so, one of those commitments would primarily be for bare metal deployments. That is one. And then second, for Jihan and Matt, you know, it would be helpful to hear your perspective on why USA cloud expansion is strategically attractive at this stage. You know, how do you think about sort of long-term competitive advantages in AI cloud as you broaden beyond your current Asia-centric footprint? Thank you.\n\nHaris Basit: So the first part, our expansion of GPU in the United States is dependent on, you know, signing contracts, at least any significant large-scale expansion is. You know, we can speculatively do small expansion in the United States. But as we said in the statement, anything significant would be backed by contracts.\n\nJihan Wu: And we have our own data centers. I think that is very important advantage right now in the US market. Means that under the end of this year, we will be able to deploy the H300 and about rubings with our own data centers. In the United States right now is the center of AI innovation globally. The demand in US market is so much stronger than any other market. And also the US customers also just one. Capacity on US soil. So we have this kind of capacity in US. And we are going to build it, and then we can build it. We will finish it.\n\nI think this will be the most important advantage on the market right now.\n\nOperator: Thank you. Thank you. I am showing no further questions at this time. Thank you for your participation in today's conference. This does conclude the program. You may now disconnect.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "BTDR",
      "Date": "2026-02-12",
      "Time": "23:00:04",
      "Source": "Zacks",
      "Title": "BITDEER TEC GRP (BTDR) Reports Q4 Earnings: What Key Metrics Have to Say",
      "URL": "https://finance.yahoo.com/news/bitdeer-tec-grp-btdr-reports-150004836.html",
      "Content": "For the quarter ended December 2025, Bitdeer Technologies Group (BTDR) reported revenue of $224.84 million, up 225.8% over the same period last year. EPS came in at -$0.73, compared to -$3.22 in the year-ago quarter.\n\nThe reported revenue compares to the Zacks Consensus Estimate of $209.85 million, representing a surprise of +7.14%. The company delivered an EPS surprise of -430.91%, with the consensus EPS estimate being -$0.14.\n\nWhile investors scrutinize revenue and earnings changes year-over-year and how they compare with Wall Street expectations to determine their next move, some key metrics always offer a more accurate picture of a company's financial health.\n\nSince these metrics play a crucial role in driving the top- and bottom-line numbers, comparing them with the year-ago numbers and what analysts estimated about them helps investors better project a stock's price performance.\n\nHere is how BITDEER TEC GRP performed in the just reported quarter in terms of the metrics most widely monitored and projected by Wall Street analysts:\n\nBitcoin mined (self-mining only) : 1,673 versus 1,673 estimated by two analysts on average.\n\nRevenues by category- Self-mining : $168.6 million versus $163.91 million estimated by three analysts on average.\n\nRevenues by category- Membership hosting : $16.3 million compared to the $11.75 million average estimate based on two analysts.\n\nRevenues by category- SEALMINERs and Accessories : $23.4 million versus the two-analyst average estimate of $32.25 million.\n\nRevenues by category- General hosting : $7.6 million versus the two-analyst average estimate of $8.25 million.\n\nView all Key Company Metrics for BITDEER TEC GRP here>>>\n\nShares of BITDEER TEC GRP have returned -18.8% over the past month versus the Zacks S&P 500 composite's -0.3% change. The stock currently has a Zacks Rank #3 (Hold), indicating that it could perform in line with the broader market in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "CRUS",
      "Date": "2026-02-12",
      "Time": "22:40:02",
      "Source": "Zacks",
      "Title": "Is Cirrus Logic (CRUS) Outperforming Other Computer and Technology Stocks This Year?",
      "URL": "https://finance.yahoo.com/news/cirrus-logic-crus-outperforming-other-144002040.html",
      "Content": "The Computer and Technology group has plenty of great stocks, but investors should always be looking for companies that are outperforming their peers. Has Cirrus Logic (CRUS) been one of those stocks this year? By taking a look at the stock's year-to-date performance in comparison to its Computer and Technology peers, we might be able to answer that question.\n\nCirrus Logic is one of 612 companies in the Computer and Technology group. The Computer and Technology group currently sits at #5 within the Zacks Sector Rank. The Zacks Sector Rank considers 16 different groups, measuring the average Zacks Rank of the individual stocks within the sector to gauge the strength of each group.\n\nThe Zacks Rank is a proven system that emphasizes earnings estimates and estimate revisions, highlighting a variety of stocks that are displaying the right characteristics to beat the market over the next one to three months. Cirrus Logic is currently sporting a Zacks Rank of #1 (Strong Buy).\n\nWithin the past quarter, the Zacks Consensus Estimate for CRUS' full-year earnings has moved 14.1% higher. This signals that analyst sentiment is improving and the stock's earnings outlook is more positive.\n\nBased on the most recent data, CRUS has returned 19.1% so far this year. In comparison, Computer and Technology companies have returned an average of -0%. As we can see, Cirrus Logic is performing better than its sector in the calendar year.\n\nAnother Computer and Technology stock, which has outperformed the sector so far this year, is KE Holdings Inc. Sponsored ADR (BEKE). The stock has returned 19.5% year-to-date.\n\nThe consensus estimate for KE Holdings Inc. Sponsored ADR's current year EPS has increased 1% over the past three months. The stock currently has a Zacks Rank #2 (Buy).\n\nTo break things down more, Cirrus Logic belongs to the Electronics - Semiconductors industry, a group that includes 47 individual companies and currently sits at #87 in the Zacks Industry Rank. This group has gained an average of 6.8% so far this year, so CRUS is performing better in this area.\n\nIn contrast, KE Holdings Inc. Sponsored ADR falls under the Internet - Services industry. Currently, this industry has 32 stocks and is ranked #155. Since the beginning of the year, the industry has moved -1.3%.\n\nCirrus Logic and KE Holdings Inc. Sponsored ADR could continue their solid performance, so investors interested in Computer and Technology stocks should continue to pay close attention to these stocks.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "SIMO",
      "Date": "2026-02-12",
      "Time": "21:58:55",
      "Source": "Insider Monkey",
      "Title": "Silicon Motion Technology Corporation (SIMO) Stock in Focus Amid Strong Start to 2026",
      "URL": "https://finance.yahoo.com/news/silicon-motion-technology-corporation-simo-135855747.html",
      "Content": "We recently compiled a list of the 15 Best Strong Buy Tech Stocks to Invest In . The eleventh stock on our list of best Strong Buy stocks is Silicon Motion Technology Corporation.\n\nTheFly reported on February 5 that B. Riley raised its price target on SIMO to $167 from $135 while maintaining a Buy rating. The company’s Q4 results significantly exceeded consensus estimates, and its Q1 guidance indicates continued strong momentum.\n\nOn the same day, Wedbush analyst Matt Bryson also raised the price target on Silicon Motion Technology Corporation (NASDAQ:SIMO) to $150 from $130 while maintaining an Outperform rating. NAND/memory limits and possible headwinds from a lower PC and cellphone market were the primary concerns going into the report. However, management guided Q1 higher and projected a sequential increase throughout 2026, with a target of revenues reaching $1.2 billion.\n\nAccording to reports posted on February 3, SIMO expects Q1 revenues to be between $292 million and $306 million, which is higher than the average estimate of $230.44 million. This suggests that the year is off to a far better start than anticipated. Additionally, Silicon Motion expects Q1 operating margins of 16% to 18%, indicating higher profitability. The primary drivers of growth, according to management, were expanding the customer and product portfolio, expanding market share, and entering new markets.\n\nSilicon Motion Technology Corporation (NASDAQ:SIMO) is a global leader in developing and supplying NAND flash controllers and related storage solutions for SSDs, mobile embedded storage, and industrial applications, powering data centers, PCs, smartphones, and IoT devices worldwide.\n\nWhile we acknowledge the potential of SIMO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MPWR",
      "Date": "2026-02-12",
      "Time": "21:30:02",
      "Source": "Zacks",
      "Title": "Here's How Much a $1000 Investment in Monolithic Power Made 10 Years Ago Would Be Worth Today",
      "URL": "https://finance.yahoo.com/news/heres-much-1000-investment-monolithic-133002935.html",
      "Content": "For most investors, how much a stock's price changes over time is important. This factor can impact your investment portfolio as well as help you compare investment results across sectors and industries.\n\nThe fear of missing out, or FOMO, also plays a factor in investing, especially with particular tech giants, as well as popular consumer-facing stocks.\n\nWhat if you'd invested in Monolithic Power (MPWR) ten years ago? It may not have been easy to hold on to MPWR for all that time, but if you did, how much would your investment be worth today?\n\nWith that in mind, let's take a look at Monolithic Power's main business drivers.\n\nMonolithic Power Systems, based in Kirkland, WA, designs, develops and markets high-performance power solutions. The company focuses on the market for high-performance analog and mixed-signal integrated circuits (ICs).\n\nMonolithic&rsquo;s products are widely used in industrial applications, telecommunications infrastructure, cloud computing, and automotive and consumer applications.\n\nBeing a fabless company, Monolithic works with third-party contractors and chip assemblers for the manufacturing, assembling and testing of wafers and ICs. This approach permits the company to focus more on the designing and development of process technology at a lower fixed cost.\n\nUnlike other fabless semiconductor companies, Monolithic installs its own proprietary process technologies in third-party contractors&rsquo; equipment and facilities.\n\nMonolithic reported total revenues of $751.15 million in the fourth quarter of 2025.\n\nThe company&rsquo;s key product families are direct current to direct current (DC to DC) products and Lighting Control products.\n\nDC to DC ICs are used to convert and control voltages within a broad range of electronic systems, such as portable electronic devices, wireless LAN access points, computers and monitors, automobiles and medical equipment.\n\nLighting control ICs are used in backlighting and general illumination products.\n\nBy end market, 21.5% of total revenues came from Storage and Computing in the fourth quarter of 2025.\n\nEnterprise Data, Consumer, Industrial, Automotive and Communications end-markets contributed 31%, 8.8%, 7.2%, 20.1% and 11.14%, respectively, to the fourth quarter of 2025 revenues.\n\nMonolithic&rsquo;s primary competitors are Skyworks Solutions, Microchip Technology, Lattice Semiconductor, IPG Photonics, Power Integrations, Cree, Semtech, Micron Technology, Analog Devices, and GLOBALFOUNDRIES.\n\nPutting together a successful investment portfolio takes a combination of research, patience, and a little bit of risk. For Monolithic Power, if you bought shares a decade ago, you're likely feeling really good about your investment today.\n\nA $1000 investment made in February 2016 would be worth $21,271.42, or a 2,027.14% gain, as of February 12, 2026, according to our calculations. Investors should note that this return excludes dividends but includes price increases.\n\nThe S&P 500 rose 279.51% and the price of gold increased 292.77% over the same time frame in comparison.\n\nGoing forward, analysts are expecting more upside for MPWR.\n\nMonolithic reported strong fourth-quarter 2025 results, with both adjusted earnings and revenues surpassing the respective Zacks Consensus Estimate. It has a strong growth opportunity due to its robust product portfolio that targets In-Car connectivity and infotainment, advanced driver assistance system and rapid adoption of LED lightings in cars and vehicles. Being a fabless company, MPWR works with third-party contractors and chip assemblers for the manufacturing, assembling and testing of wafers and ICs. This approach permits the company to focus more on the design and development of process technology at a lower fixed cost. However, MPWR faces challenges due to the cyclical nature of the semiconductor industry. Rapid product obsolescence and price erosion, evolving standards and short product life-cycles are other challenges.\n\nThe stock is up 21.67% over the past four weeks, and no earnings estimate has gone lower in the past two months, compared to 7 higher, for fiscal 2026. The consensus estimate has moved up as well.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "BTDR",
      "Date": "2026-02-12",
      "Time": "21:15:02",
      "Source": "Zacks",
      "Title": "Bitdeer Technologies Group (BTDR) Reports Q4 Loss, Beats Revenue Estimates",
      "URL": "https://finance.yahoo.com/news/bitdeer-technologies-group-btdr-reports-131502177.html",
      "Content": "Bitdeer Technologies Group (BTDR) came out with a quarterly loss of $0.73 per share versus the Zacks Consensus Estimate of a loss of $0.14. This compares to a loss of $3.22 per share a year ago. These figures are adjusted for non-recurring items.\n\nThis quarterly report represents an earnings surprise of -430.91%. A quarter ago, it was expected that this company would post a loss of $0.22 per share when it actually produced a loss of $1.28, delivering a surprise of -481.82%.\n\nOver the last four quarters, the company has surpassed consensus EPS estimates just once.\n\nBITDEER TEC GRP, which belongs to the Zacks Technology Services industry, posted revenues of $224.84 million for the quarter ended December 2025, surpassing the Zacks Consensus Estimate by 7.14%. This compares to year-ago revenues of $69.02 million. The company has topped consensus revenue estimates four times over the last four quarters.\n\nThe sustainability of the stock's immediate price movement based on the recently-released numbers and future earnings expectations will mostly depend on management's commentary on the earnings call.\n\nBITDEER TEC GRP shares have added about 7% since the beginning of the year versus the S&P 500's gain of 1.4%.\n\nWhile BITDEER TEC GRP has outperformed the market so far this year, the question that comes to investors' minds is: what's next for the stock?\n\nThere are no easy answers to this key question, but one reliable measure that can help investors address this is the company's earnings outlook. Not only does this include current consensus earnings expectations for the coming quarter(s), but also how these expectations have changed lately.\n\nEmpirical research shows a strong correlation between near-term stock movements and trends in earnings estimate revisions. Investors can track such revisions by themselves or rely on a tried-and-tested rating tool like the Zacks Rank, which has an impressive track record of harnessing the power of earnings estimate revisions.\n\nAhead of this earnings release, the estimate revisions trend for BITDEER TEC GRP was mixed. While the magnitude and direction of estimate revisions could change following the company's just-released earnings report, the current status translates into a Zacks Rank #3 (Hold) for the stock. So, the shares are expected to perform in line with the market in the near future. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.\n\nIt will be interesting to see how estimates for the coming quarters and the current fiscal year change in the days ahead. The current consensus EPS estimate is -$0.16 on $203.69 million in revenues for the coming quarter and -$0.15 on $1.18 billion in revenues for the current fiscal year.\n\nInvestors should be mindful of the fact that the outlook for the industry can have a material impact on the performance of the stock as well. In terms of the Zacks Industry Rank, Technology Services is currently in the bottom 38% of the 250 plus Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.\n\nAnother stock from the same industry, Cricut, Inc. (CRCT), has yet to report results for the quarter ended December 2025. The results are expected to be released on March 3.\n\nThis company is expected to post quarterly earnings of $0.04 per share in its upcoming report, which represents a year-over-year change of -33.3%. The consensus EPS estimate for the quarter has remained unchanged over the last 30 days.\n\nCricut, Inc.'s revenues are expected to be $198.69 million, down 5.1% from the year-ago quarter.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "GFS",
      "Date": "2026-02-12",
      "Time": "19:49:06",
      "Source": "Insider Monkey",
      "Title": "Globalfoundries (GFS) Hits New High on Swing to Profits",
      "URL": "https://finance.yahoo.com/news/globalfoundries-gfs-hits-high-swing-114906247.html",
      "Content": "We recently published 10 Stocks Turning Heads With Double-Digit Returns . Globalfoundries Inc. (NASDAQ:GFS) was one of the best performers on Wednesday.\n\nGlobalfoundries jumped to an over one-year high on Wednesday, as investors gobbled up shares after the company swung to profitability last year, marking a 439 percent improvement year-on-year.\n\nIn an earnings call, Globalfoundries Inc. (NASDAQ:GFS) said that it swung to a net income of $888 million in 2025 from a $262 million net loss in 2024. This came despite a mere 1 percent uptick in net revenues at $6.79 billion from $6.75 billion year-on-year.\n\nIn the fourth quarter alone, net income stood at $200 million, reversing a $729 million net loss in the same quarter a year earlier. Revenues, however, were flat at $1.83 billion.\n\nFollowing the results, Globalfoundries Inc. (NASDAQ:GFS) saw its intra-day share price on Wednesday jump to as much as $48.88 before trimming a few cents to finish the session just up by 16.32 percent at $48.74 apiece.\n\nIn other news, Globalfoundries Inc. (NASDAQ:GFS) announced plans to buy back $500 million worth of its common shares in a bid to boost shareholder value.\n\nThe buyback may be implemented from time to time, through open market purchases and privately negotiated transactions, among others.\n\nThe initiative will run for a period of 12 months and may be modified, suspended, or terminated at anytime.\n\nWhile we acknowledge the potential of GFS as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on the best short-term AI stock .",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "KLAC",
      "Date": "2026-02-12",
      "Time": "00:57:00",
      "Source": "Zacks",
      "Title": "KLA Shares Drop 15% Post Q2 Earnings: Should You Buy on the Dip?",
      "URL": "https://finance.yahoo.com/news/kla-shares-drop-15-post-165700060.html",
      "Content": "KLA Corporation KLAC shares dropped 15.1% post second-quarter fiscal 2026 results on Jan. 29. The plunge can be attributed to the company’s not-so-impressive guidance, as well as operational headwinds. KLA now expects third-quarter fiscal 2026 revenues of $3.35 billion (+/- $150 million), reflecting a modestly weak product mix on a sequential basis. The guidance also reflects the rapidly escalating cost of DRAM chips used in KLA’s image processing computers that ship with its systems, thereby hurting gross margin. Increasing lead times of its products due to supply constraints and negative tariff impact, roughly 100 bps, are headwinds in the near term.\n\nSo, what should investors do with KLA shares? Let’s find out?\n\nKLA shares have jumped 90.6% in the trailing 12 months, outperforming the Zacks Computer and Technology sector’s return of 23.1% and the Zacks Electronics-Miscellaneous Products industry’s appreciation of 37.4%. KLA is benefiting from its dominant process control market share, strong AI infrastructure investment and momentum in advanced packaging.\n\nThe company has outperformed peers, including Applied Materials AMAT, ASML Holding ASML and Axcelis Technologies ACLS, in the past year. Shares of Applied Materials, ASML Holding and Axcelis have returned 81.9%, 87% and 48.1%, respectively, over the same timeframe.\n\nImage Source: Zacks Investment Research\n\nKLA is benefiting from strong demand for leading-edge logic, high-bandwidth memory and advanced packaging, which is driving top-line growth. Advanced packaging revenues are expected to grow mid-to-high teens on a year-over-year basis in 2026. Strong investments in WFE and advanced packaging represent a strong growth opportunity for the company. Growth of advanced packaging supporting heterogeneous chip integration has become a new market for KLA, which is currently worth $11 billion and growing faster than core WFE.\n\nKLA’s robust portfolio and its leadership in process control systems are enabling customers to manage increasing design complexity. Process control accelerates time to results by resolving process integration challenges during the fab ramp-up phase to optimize time to market for a diverse mix of semiconductor designs.\n\nMoreover, the growing investment in custom silicon, particularly among hyperscalers developing their own custom chips, has led to a proliferation of unique device designs. This has put customers under pressure to deliver performance, volume and time to market, resulting in strong demand for advanced process control. This aids KLA’s prospects as each new chip design requires rigorous inspection, metrology and yield optimization solutions. This bodes well for KLAC’s top-line growth.\n\nKLAC expects the core WFE market to grow in the high single to low double digits in 2026, reaching the low $120 billion range, up from approximately $110 billion in 2025. The company expects the advanced packaging component of the market to grow at a similar rate to roughly $12 billion for a total market forecast in the mid-$130 billion range, an increase in the low double digits versus its forecast for 2025.\n\nThe Zacks Consensus Estimate for fiscal 2026 earnings is pegged at $36.58 per share, up 3% over the past 30 days and indicating 9.9% growth from 2025’s reported figure. The consensus mark for fiscal 2026 revenues is pegged at $13.39 billion, suggesting 10.1% growth from the 2025’s reported figure.\n\nKLA Corporation price-consensus-chart | KLA Corporation Quote\n\nThe Zacks Consensus Estimate for third-quarter fiscal 2026 earnings is pegged at $9.12 per share, up 2.4% over the past 30 days and indicating 8.4% growth over the year-ago quarter’s reported figure. The consensus mark for third-quarter fiscal 2026 revenues is pegged at $3.37 billion, suggesting 9.9% growth from the year-ago quarter’s reported figure.\n\nKLAC shares are trading at a premium, as suggested by a Value Score of F.\n\nIn terms of the forward 12-month price-to-earnings (P/E), KLAC is trading at 33.83X, higher than the broader sector and peers. The broader sector is trading at 26.08X while Applied Materials and Axcelis trade at 32.21X and 20.17X, respectively. However, ASML is pricey with a P/E multiple of 41.48.\n\nImage Source: Zacks Investment Research\n\nTechnically, KLA is currently trading above the 50-day and the 200-day moving averages, indicating a bullish trend.\n\nImage Source: Zacks Investment Research\n\nKLA benefits from strong demand for advanced packaging despite increasing lead times and conservative guidance. Robust AI demand bodes well for KLAC’s prospects and justifies a premium valuation.\n\nKLA currently has a Zacks Rank #1 (Strong Buy), which suggests that investors should start accumulating the stock right now as the dip offers a massive opportunity. You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "MPWR",
      "Date": "2026-02-11",
      "Time": "23:00:00",
      "Source": "Zacks",
      "Title": "Best Momentum Stock to Buy for February 11th",
      "URL": "https://finance.yahoo.com/news/best-momentum-stock-buy-february-150000309.html",
      "Content": "Here are three stocks with buy rank and strong momentum characteristics for investors to consider today, February 11th:\n\nENGIE - Sponsored ADR ENGIY: This company, which engages in the power, natural gas, and energy services businesses. It operates through Renewables, Networks, Energy Solutions, FlexGen, Retail, Nuclear and Others segments, has a Zacks Rank #1(Strong Buy), and witnessed the Zacks Consensus Estimate for its current year earnings increasing 5.1% over the last 60 days.\n\nENGIE - Sponsored ADR price-consensus-chart | ENGIE - Sponsored ADR Quote\n\nENGIE - Sponsored ADR's shares gained 25.5% over the last three month compared with the S&P 500’s gain of 1.3%. The company possesses a Momentum Score of A.\n\nENGIE - Sponsored ADR price | ENGIE - Sponsored ADR Quote\n\nMonolithic Power Systems MPWR: This company, which designs, develops and markets high-performance power solutions, has a Zacks Rank #1, and witnessed the Zacks Consensus Estimate for its current year earnings increasing 3.2% over the last 60 days.\n\nMonolithic Power Systems, Inc. price-consensus-chart | Monolithic Power Systems, Inc. Quote\n\nMonolithic Power Systems’ shares gained 19.9% over the last three month compared with the S&P 500’s gain of 1.3%. The company possesses a Momentum Score of A.\n\nMonolithic Power Systems, Inc. price | Monolithic Power Systems, Inc. Quote\n\nSeanergy Maritime Holdings SHIP: This company, which is a prominent pure-play Capesize ship-owner which provides marine dry bulk transportation services through a modern fleet of Capesize vessels, has a Zacks Rank #1, and witnessed the Zacks Consensus Estimate for its current year earnings increasing 8.6% over the last 60 days.\n\nSeanergy Maritime Holdings Corp price-consensus-chart | Seanergy Maritime Holdings Corp Quote\n\nSeanergy Maritime Holdings’ shares gained 27.4% over the last three month compared with the S&P 500’s gain of 1.3%. The company possesses a Momentum Score of A.\n\nSeanergy Maritime Holdings Corp price | Seanergy Maritime Holdings Corp Quote\n\nSee the full list of top ranked stocks here\n\nLearn more about the Momentum score and how it is calculated here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "SIMO",
      "Date": "2026-02-11",
      "Time": "22:00:03",
      "Source": "Zacks",
      "Title": "Investors Heavily Search Silicon Motion Technology Corporation (SIMO): Here is What You Need to Know",
      "URL": "https://finance.yahoo.com/news/investors-heavily-search-silicon-motion-140003883.html",
      "Content": "Silicon Motion (SIMO) has been one of the most searched-for stocks on Zacks.com lately. So, you might want to look at some of the facts that could shape the stock's performance in the near term.\n\nShares of this chip company have returned +15.6% over the past month versus the Zacks S&P 500 composite's -0.3% change. The Zacks Computer - Integrated Systems industry, to which Silicon Motion belongs, has gained 4.8% over this period. Now the key question is: Where could the stock be headed in the near term?\n\nAlthough media reports or rumors about a significant change in a company's business prospects usually cause its stock to trend and lead to an immediate price change, there are always certain fundamental factors that ultimately drive the buy-and-hold decision.\n\nHere at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock.\n\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\n\nSilicon Motion is expected to post earnings of $1.14 per share for the current quarter, representing a year-over-year change of +90%. Over the last 30 days, the Zacks Consensus Estimate has changed +25.5%.\n\nThe consensus earnings estimate of $5.42 for the current fiscal year indicates a year-over-year change of +52.7%. This estimate has changed +21.9% over the last 30 days.\n\nFor the next fiscal year, the consensus earnings estimate of $6.93 indicates a change of +27.8% from what Silicon Motion is expected to report a year ago. Over the past month, the estimate has changed +6%.\n\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #1 (Strong Buy) for Silicon Motion.\n\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n\nEven though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\n\nFor Silicon Motion, the consensus sales estimate for the current quarter of $299.65 million indicates a year-over-year change of +80%. For the current and next fiscal years, $1.24 billion and $1.41 billion estimates indicate +39.5% and +14.2% changes, respectively.\n\nSilicon Motion reported revenues of $278.46 million in the last reported quarter, representing a year-over-year change of +45.7%. EPS of $1.26 for the same period compares with $0.91 a year ago.\n\nCompared to the Zacks Consensus Estimate of $261.2 million, the reported revenues represent a surprise of +6.61%. The EPS surprise was -2.33%.\n\nOver the last four quarters, Silicon Motion surpassed consensus EPS estimates three times. The company topped consensus revenue estimates each time over this period.\n\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\n\nWhile comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.\n\nThe Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an A is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\n\nSilicon Motion is graded D on this front, indicating that it is trading at a premium to its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\n\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Silicon Motion. However, its Zacks Rank #1 does suggest that it may outperform the broader market in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "TXN",
      "Date": "2026-02-11",
      "Time": "21:18:57",
      "Source": "Insider Monkey",
      "Title": "Should You Be Optimistic on Texas Instruments’ (TXN) Growth Potential?",
      "URL": "https://finance.yahoo.com/news/optimistic-texas-instruments-txn-growth-131857066.html",
      "Content": "Matrix Asset Advisors , an asset management company, released its Q4 2025 investor letter. A copy of the letter can be downloaded here . The stock market hit a new all-time high in the fourth quarter of 2025, rising +2.66%. Three-quarter-point interest rate cuts from the Federal Reserve, strong corporate results, and ongoing AI momentum drove investor optimism. The S&P 500 Index recorded its third consecutive year of double-digit gains, returning +17.88% in 2025. Matrix’s equity portfolios returned double-digit gains in 2025 and positive results in the fourth quarter. Matrix’s Large Cap Value portfolio (LCV) returned 20% in 2025, outperforming the S&P 500 Index. Matrix’s fixed income returns, except long-term bonds, were slightly positive in the fourth quarter, and for the year, the returns were up in the mid to high single-digit range, depending on maturity. Entering 2026, the firm maintains a cautious, optimistic view on the economy and the market. Please review the Firm’s top five holdings to gain insights into their key selections for 2025.\n\nIn its fourth-quarter 2025 investor letter, Matrix Asset Advisors highlighted Texas Instruments Incorporated (NASDAQ: TXN ). Headquartered in Dallas, Texas, Texas Instruments Incorporated (NASDAQ:TXN) is a global semiconductor company. On February 10, 2026, Texas Instruments Incorporated (NASDAQ:TXN) stock closed at $220.92 per share. One-month return of Texas Instruments Incorporated (NASDAQ:TXN) was 14.20%, and its shares are up 22.74% over the past twelve months. Texas Instruments Incorporated (NASDAQ:TXN) has a market capitalization of $200.733 billion.\n\nMatrix Asset Advisors stated the following regarding Texas Instruments Incorporated (NASDAQ:TXN) in its fourth quarter 2025 investor letter:\n\nTexas Instruments Incorporated (NASDAQ:TXN) is not on our list of 30 Most Popular Stocks Among Hedge Funds . According to our database, 72 hedge fund portfolios held Texas Instruments Incorporated (NASDAQ:TXN) at the end of the third quarter, up from 68 in the previous quarter. Texas Instruments Incorporated (NASDAQ:TXN) announced Q4 2025 revenue of $4.4 billion, reflecting a 10% year-over-year growth. While we acknowledge the potential of Texas Instruments Incorporated (NASDAQ:TXN) as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\n\nIn another article , we covered Texas Instruments Incorporated (NASDAQ:TXN) and shared a list of stocks Jim Cramer discussed. In addition, please check out our hedge fund investor letters Q4 2025 page for more investor letters from hedge funds and other leading investors.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "ON",
      "Date": "2026-02-11",
      "Time": "01:19:00",
      "Source": "Zacks",
      "Title": "onsemi's Q4 Earnings Beat Estimates, Revenues Down Y/Y, Shares Drop",
      "URL": "https://finance.yahoo.com/news/onsemis-q4-earnings-beat-estimates-171900670.html",
      "Content": "onsemi ON reported fourth-quarter 2025 non-GAAP earnings of 64 cents per share, which beat the Zacks Consensus Estimate by 3.23% but plunged 32.6% year over year.\n\nRevenues of $1.53 billion missed the Zacks Consensus Estimate by 0.19% and decreased 11.2% on a year-over-year basis.\n\nON shares were down 4.92% at the time of writing this article.\n\nPower Solutions Group's revenues of $724.2 million (contributed 47.3% to revenues) decreased 10.5% year over year. Analog & Mixed Group revenues of $556.3 million (36.4% of revenues) decreased 8.9% on a year-over-year basis. Intelligent Sensing Group revenues of $249.6 million (16.3% of revenues) decreased 17.5% year over year.\n\nON Semiconductor Corporation price-consensus-eps-surprise-chart | ON Semiconductor Corporation Quote\n\nNon-GAAP gross margin was 38.2% compared with 45.3% reported in the year-ago quarter.\n\nNon-GAAP operating expenses decreased 12.2% year over year to $282 million. As a percentage of revenues, operating expenses decreased 20 bps year over year.\n\nNon-GAAP operating margin was 19.8% compared with 26.7% reported in the year-ago quarter.\n\nAs of Dec. 31, 2025, ON had cash and cash equivalents of $2.55 billion compared with $2.87 billion as of Oct. 3, 2025. Long-term debt, as of Dec. 31, 2025, was $2.98 billion, down 11.1% sequentially.\n\nFourth-quarter 2025 cash flow from operations amounted to $554.5 million compared with the previous quarter’s reported figure of $418.7 million.\n\nFree cash flow amounted to $485.4 million compared with free cash flow of $372.4 million in the previous quarter.\n\nFor the first quarter of 2026, onsemi expects revenues between $1.44 billion and $1.54 billion.\n\nNon-GAAP gross margin is projected to be in the range of 37.5-39.5%.\n\nNon-GAAP operating expenses are expected to be in the range of $285-$300 million.\n\nNon-GAAP earnings are expected to be between 56 cents and 66 cents per share.\n\nON currently carries a Zacks Rank #3 (Hold).\n\nAnalog Devices ADI, Applied Materials AMAT, and MKS MKSI are some better-ranked stocks that investors can consider in the broader Zacks Computer and Technology sector.\n\nMKS shares have gained 125.9% in the past 12-month period. MKSI is set to report its fourth-quarter 2025 results on Feb. 17, 2026. The company currently sports a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nAnalog Devices' shares have gained 58.5% in the past 12-month period. ADI currently carries a Zacks Rank #2 (Buy). The company is scheduled to release first-quarter 2026 results on Feb. 18, 2026.\n\nApplied Materials shares have gained 80.4% in the past 12-month period. AMAT is scheduled to release its first-quarter 2026 results on Feb. 12, 2026. Applied Materials currently carries a Zacks Rank of 2.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "KLAC",
      "Date": "2026-02-11",
      "Time": "00:36:00",
      "Source": "Zacks",
      "Title": "AMAT Climbs 8% in a Month: Time to Buy, Sell or Hold the Stock?",
      "URL": "https://finance.yahoo.com/news/amat-climbs-8-month-time-163600277.html",
      "Content": "Applied Materials AMAT shares have risen 7.6% in a month, outperforming the Zacks Computer and Technology sector and the Zacks Electronics - Semiconductors industry’s decline of 1.6% and 0.1%, respectively.\n\nImage Source: Zacks Investment Research\n\nThe rise in the stock price has made AMAT a premium, as it trades at a forward price-to-sales (P/S) ratio of 8.67, which is above the Zacks Electronics - Semiconductors industry’s P/S ratio of 8.46.\n\nImage Source: Zacks Investment Research\n\nGiven AMAT’s stock price rise in the past month and its overvaluation at present, investors might question: Should they buy, hold or sell the stock? Let’s discuss the fundamentals in detail.\n\nAMAT specializes in Gate-All-Around (GAA) transistors at 2nm and below, Backside power delivery, Advanced wiring and interconnect, HBM stacking and hybrid bonding and 3D device metrology, which are indispensable for manufacturing next-generation semiconductor chips. Recent launches like Xtera epi, Kinex hybrid bonding, and PROVision 10 eBeam will add to AMAT’s growth story.\n\nAMAT expects next-generation technologies to be produced in large volume, which means that the company’s customers will be ramping up their foundries, naturally benefiting AMAT’s business. In 2025, AMAT strengthened its leadership in DRAM, growing revenues from leading-edge customers by more than 50%. This trend is likely to continue in the future.\n\nAMAT expects its leading-edge foundry, logic, dynamic random access memory and high bandwidth memory to be the fastest-growing wafer fabrication equipment businesses in 2026. AMAT’s advanced packaging business, which is currently valued at $1.5 billion, is still on track to double to $3 billion over the next few years, driven by HBM demand and next-generation packaging architectures.\n\nThese factors will contribute to increased traction in Applied Materials’ wafer fabrication equipment (WFE), driven by growing usage of semiconductors in artificial intelligence and high performance computing. AMAT reported that its leading-edge foundry/logic, DRAM and advanced packaging will be the fastest-growing areas of the WFE market.\n\nAMAT restructured its pricing program, and it is expected to contribute most of the 120-bps gross margin expansion in the coming fiscal year. This cost restructuring will further provide AMAT with enough headroom to ramp up its R&D investments. AMAT is setting up the Equipment and Process Innovation and Commercialization center for research, which is expected to be operational by 2026.\n\nApplied Materials is winning over its competition like KLA Corporation KLAC, Lam Research LRCX and ASML Holding ASML in the semiconductor supply chain market.\n\nLam Research develops Atomic Layer Deposition tools like AT200M, AT410 and AT650P that are similar to the devices made by AMAT. Both ASML and AMAT specialize in advanced semiconductor nodes, although they develop solutions for various stages of semiconductor production. ASML Holdings develops lithography solutions, including EXE and NXE systems.\n\nApplied Materials and KLA Corporation offer similar solutions like Wafer Inspection, Yield Enhancement and Process Control inspection systems. KLA Corporation develops inspection systems, including 3935 and 3920 EP broadband plasma defect inspection systems. Although Applied Materials is dealing with a broader market sell-off and growing competition, not everything is gloom and doom for the company.\n\nApplied Materials leads the market with its superior design wins. It is well-positioned to capitalize on the technology-inflection-led growing demand for next-generation chips on the back of its product innovations and leadership in leading-edge logic, compute memory, high bandwidth memory and advanced packaging.\n\nAMAT is likely to capitalize on AI-driven semiconductor demand. The company has made significant strides in cutting-edge chip manufacturing, particularly in GAA transistors, high-bandwidth memory and advanced packaging. These innovations are critical to enabling faster, more energy-efficient AI processing.\n\nWith these factors in place, AMAT’s long-term growth outlook remains strong. The Zacks Consensus Estimate for AMAT’s fiscal 2027 revenues are expected to rise 13.3% year over year. The Zacks Consensus Estimate for AMAT’s fiscal 2027 earnings is expected to grow 22% year over year. AMAT's fiscal 2027 earnings estimates have been revised upward in the past 30 days.\n\nImage Source: Zacks Investment Research\n\nThe continuous strength across wafer fabrication equipment for foundry/logic, DRAM, NAND, flash memory, GAA and advanced packaging, driven by increased usage of semiconductors in artificial intelligence and high performance computing, is a tailwind for AMAT stock. Considering these long-term growth factors, we suggest investors book this Zacks Rank #2 (Buy) stock at present. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "KLAC",
      "Date": "2026-02-10",
      "Time": "23:00:00",
      "Source": "Zacks",
      "Title": "Lam Research Stock's High P/E: Justified Premium or Too Pricey to Buy?",
      "URL": "https://finance.yahoo.com/news/lam-research-stocks-high-p-150000625.html",
      "Content": "Lam Research Corporation LRCX, a leader in semiconductor fabrication equipment, currently trades at a forward 12-month price-to-earnings (P/E) ratio of 38.14, significantly higher than the Zacks Electronics – Semiconductors industry average of 32.\n\nLRCX’s P/E multiple is also higher than that of some other semiconductor fabrication equipment providers, including KLA Corporation KLAC, Onto Innovation Inc. ONTO and Applied Materials, Inc. AMAT. At present, KLA Corporation, Onto Innovation and Applied Materials have a forward 12-month P/E ratio of 34.16, 33.78 and 31.60, respectively.\n\nImage Source: Zacks Investment Research\n\nLRCX’s lofty valuation multiple is a result of robust appreciation in its share price. In the trailing 12 months, Lam Research shares have soared 174.9%, outperforming the industry’s gain of 35.1%. It has also outpaced the returns of KLA Corporation, Applied Materials and Onto Innovation. Shares of KLA Corporation, Applied Materials and Onto Innovation have rallied 90%, 80.4% and 21.6%, respectively.\n\nImage Source: Zacks Investment Research\n\nAlthough it seems investors are willing to pay a premium for the stock, the billion-dollar question is: Is it justified to overpay?\n\nIn our opinion, Lam Research’s strong growth prospects amid artificial intelligence (AI)-driven demand for advanced nodes justify this premium valuation. The company’s high growth potential in AI and high-performance computing (HPC) markets, along with back-to-back quarters of strong financial performance, suggest that LRCX stock’s upward momentum is far from over.\n\nDespite ongoing macroeconomic challenges, geopolitical issues, and trade and tariff wars, LRCX’s financials remain impressive. In the company’s last reported financial results for the second quarter of fiscal 2026, total revenues rose 22% year over year to $5.34 billion and beat the Zacks Consensus Estimate by 2.1%, primarily driven by continued demand across the Systems and Customer Support Business Group segments.\n\nLam Research reported second-quarter non-GAAP earnings of $1.27 per share, which beat the consensus mark by 8.5%. The bottom line also increased 39.6% on a year-over-year basis.\n\nLam Research Corporation price-consensus-eps-surprise-chart | Lam Research Corporation Quote\n\nExpanding its manufacturing operations in Asia has also helped the company lower costs and improve margins. In the second quarter, Lam Research’s non-GAAP operating margin rose to 34.3%, up 360 basis points from the year-ago quarter, which is impressive, considering the challenging macroeconomic environment.\n\nThis strong financial performance reinforces Lam Research’s resilience in navigating an evolving semiconductor cycle. As demand grows for advanced nodes, LRCX’s specialized technology in etch and deposition tools for high-aspect-ratio structures positions it well to capitalize on this trend. The company’s second-quarter results also highlight its effective cost management, which has enabled sustained profitability.\n\nLam Research is capitalizing on AI trends. It builds the tools chipmakers need to manufacture next-generation semiconductors, including high-bandwidth memory (HBM) and chips used in advanced packaging. These technologies are vital for powering AI and cloud data centers.\n\nLam Research’s products are not only critical but also innovative. For example, its ALTUS ALD tool uses molybdenum to improve speed and efficiency in chip production. Another product, the Aether platform, helps chipmakers achieve higher performance and density. These are essential capabilities as demand for advanced AI chips continues to increase.\n\nIn 2025, Lam Research’s revenues from advanced packaging grew significantly, and management anticipates strong 40% year-over-year growth for 2026. The industry’s migration to backside power distribution and dry-resist processing presents growth opportunities for LRCX’s cutting-edge fabrication solutions.\n\nThese trends are aiding Lam Research’s financial performance. The company has demonstrated consistent execution, maintaining quarterly revenues of more than $5 billion for the past three consecutive quarters, reflecting solid demand from leading chipmakers such as Taiwan Semiconductor Manufacturing and Samsung.\n\nWith AI-driven investments accelerating, Lam Research’s leading position in etch and deposition makes it a key beneficiary of the ongoing semiconductor spending cycle. The Zacks Consensus Estimate for fiscal 2026 and 2027 revenues implies a year-over-year increase of 19.5% and 21.2%, respectively. The consensus mark for fiscal 2026 and 2027 earnings per share indicates growth of 26.1% and 24.4%, respectively.\n\nLam Research’s solid financial performance and strategic focus on AI-driven growth make it a compelling investment option right now despite lofty valuations. The company’s expanding market share in AI and datacenter fabrication, coupled with innovative product launches, strengthens its competitive positioning.\n\nCurrently, Lam Research sports a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here .\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "TXN",
      "Date": "2026-02-10",
      "Time": "22:15:02",
      "Source": "Zacks",
      "Title": "Texas Instruments (TXN) Reliance on International Sales: What Investors Need to Know",
      "URL": "https://finance.yahoo.com/news/texas-instruments-txn-reliance-international-141502723.html",
      "Content": "Have you evaluated the performance of Texas Instruments' (TXN) international operations for the quarter ending December 2025? Given the extensive global presence of this chipmaker, analyzing the patterns in international revenues is crucial for understanding its financial strength and potential for growth.\n\nIn the current global economy, which is more interconnected than ever, a company's success in penetrating international markets is crucial for its financial health and growth journey. Investors must understand a company's dependence on overseas markets, as this offers a window into the company's earnings stability, its ability to benefit from varied economic cycles and its potential for long-term growth.\n\nInternational market involvement serves as insurance against economic downturns at home and enables engagement with economies that are growing more quickly. Still, this move toward diversification is not without its challenges, as it involves navigating through the fluctuations of currencies, geopolitical threats, and the distinctive nature of various markets.\n\nWhile analyzing TXN's performance for the last quarter, we found some intriguing trends in revenues from its overseas segments that Wall Street analysts commonly model and monitor.\n\nThe company's total revenue for the quarter amounted to $4.42 billion, showing rise of 10.4%. We will now explore the breakdown of TXN's overseas revenue to assess the impact of its international operations.\n\nDuring the quarter, Japan contributed $290 million in revenue, making up 6.6% of the total revenue. When compared to the consensus estimate of $297.43 million, this meant a surprise of -2.5%. Looking back, Japan contributed $313 million, or 6.6%, in the previous quarter, and $277 million, or 6.9%, in the same quarter of the previous year.\n\nRest of World generated $98 million in revenues for the company in the last quarter, constituting 2.2% of the total. This represented a surprise of +26.34% compared to the $77.57 million projected by Wall Street analysts. Comparatively, in the previous quarter, Rest of World accounted for $74 million (1.6%), and in the year-ago quarter, it contributed $69 million (1.7%) to the total revenue.\n\nOf the total revenue, $948 million came from Europe, Middle East and Africa during the last fiscal quarter, accounting for 21.4%. This represented a surprise of +3.13% as analysts had expected the region to contribute $919.21 million to the total revenue. In comparison, the region contributed $972 million, or 20.5%, and $786 million, or 19.6%, to total revenue in the previous and year-ago quarters, respectively.\n\nRest of Asia accounted for 10.3% of the company's total revenue during the quarter, translating to $457 million. Revenues from this region represented a surprise of -4.19%, with Wall Street analysts collectively expecting $476.96 million. When compared to the preceding quarter and the same quarter in the previous year, Rest of Asia contributed $505 million (10.7%) and $432 million (10.8%) to the total revenue, respectively.\n\nChina generated $951 million in revenues for the company in the last quarter, constituting 21.5% of the total. This represented a surprise of +1.9% compared to the $933.3 million projected by Wall Street analysts. Comparatively, in the previous quarter, China accounted for $1.02 billion (21.5%), and in the year-ago quarter, it contributed $821 million (20.5%) to the total revenue.\n\nWall Street analysts expect Texas Instruments to report $4.51 billion in total revenue for the current fiscal quarter, indicating an increase of 11% from the year-ago quarter. Japan, Rest of World, Europe, Middle East and Africa, Rest of Asia and China are expected to contribute 6.5% (translating to $293.26 million), 1.7% ($77.37 million), 20.5% ($925.54 million), 10.5% ($473.62 million), and 20.7% ($933.44 million) to the total revenue, respectively.\n\nFor the full year, a total revenue of $19.36 billion is expected for the company, reflecting an increase of 9.5% from the year before. The revenues from Japan, Rest of World, Europe, Middle East and Africa, Rest of Asia and China are expected to make up 6.4%, 1.7%, 20%, 10.3%, and 20.5% of this total, corresponding to $1.24 billion, $322.14 million, $3.86 billion, $2 billion, and $3.97 billion, respectively.\n\nTexas Instruments' reliance on international markets for revenues offers both opportunities and risks. Hence, keeping an eye on its international revenue trends could significantly help forecast the company's prospects.\n\nIn an environment where global interconnections and geopolitical skirmishes are intensifying, Wall Street analysts keep a keen eye on these trends, particularly for firms with overseas operations, to adjust their earnings predictions. Moreover, a range of other aspects, including how a company fares in its home country, significantly affects these projections.\n\nHere at Zacks, we put a great deal of emphasis on a company's changing earnings outlook, as empirical research has shown that's a powerful force driving a stock's near-term price performance. Quite naturally, the correlation is positive here -- an upward revision in earnings estimates drives the stock price higher.\n\nBoasting a remarkable track record that's been externally verified, the Zacks Rank, our unique stock rating system, leverages changes in earnings projections to function as a reliable gauge for predicting short-term stock price movements.\n\nTexas Instruments, bearing a Zacks Rank #3 (Hold), is expected to mirror the broader market's movements in the near term. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>> .\n\nOver the past month, the stock has gained 15.7% versus the Zacks S&P 500 composite's no change. The Zacks Computer and Technology sector, of which Texas Instruments is a part, has declined 1.1% over the same period. The company's shares have increased 41.2% over the past three months compared to the S&P 500's 3.7% increase. Over the same period, the sector has risen 2.3%\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "TXN",
      "Date": "2026-02-10",
      "Time": "18:20:00",
      "Source": "Motley Fool",
      "Title": "2 Dividend Stocks That Are Off to Hot Starts to 2026",
      "URL": "https://finance.yahoo.com/m/3add3e16-b666-3ad6-a2b7-121aa95277b1/2-dividend-stocks-that-are.html",
      "Content": "The S&P 500 is off to a fairly underwhelming start. As of Monday's close, it was up less than 2% since January. Many growth stocks have been struggling, while dividend stocks are suddenly becoming hot buys.\n\nTwo dividend stocks that are off to hot starts since the beginning of the year are Lockheed Martin (NYSE: LMT) and Texas Instruments (NASDAQ: TXN) . They have soared past the broad index, and here's why it might not be too late to invest in them.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\n\nEntering trading on Tuesday, Lockheed Martin's stock was up 32% year to date. It's a fantastic performance after an unexciting year in 2025, when its share price was flat.\n\nThe company posted some strong earnings numbers at the end of January, reporting that its backlog was a record $194 billion. Its numbers came in better than its own expectations, and the business said it experienced \"unprecedented demand\" in the previous year. With strong government relationships and more growth expected for 2026, it's little wonder the defense stock has been a good buy early on.\n\nIts yield of 2.2% is also about twice what you'd get with the average S&P 500 stock right now. And at 21 times its expected future earnings (based on analyst projections), it's not an expensive stock to own, either. For long-term investors, Lockheed Martin can be a great stock to buy and hold.\n\nAnother stock that's been red hot to start 2026 is semiconductor company Texas Instruments. It's up just over 26% and it also recently released its earnings numbers. For the last three months of 2025, its revenue of $4.4 billion rose by 10% year over year, as demand from data centers has been strong and driving a lot of growth for the business.\n\nIts diversified semiconductor business features more than 80,000 parts that help companies in various industries, making it an attractive option for growth-oriented investors. Its forward price-to-earnings multiple of 33 is a bit high, but with some encouraging long-term growth prospects and its data center segment potentially being a catalyst for the foreseeable future, the stock can still be a suitable option for investors who are looking to buy and hold for years.\n\nTexas Instruments pays an above-average dividend that yields 2.6%, and it has been increasing its payout for 22 consecutive years. This is not only a promising growth investment, but also a terrific dividend stock to hang on to for the long haul.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "STM",
      "Date": "2026-02-10",
      "Time": "05:06:59",
      "Source": "GuruFocus.com",
      "Title": "AWS deepens STMicro tie with 24.8 million-share warrant deal",
      "URL": "https://finance.yahoo.com/news/aws-deepens-stmicro-tie-24-210659043.html",
      "Content": "This article first appeared on GuruFocus .\n\nAmazon ( NASDAQ:AMZN ) Web Services appears to be tightening its grip on critical data-center infrastructure by deepening its relationship with STMicroelectronics NV ( NYSE:STM ), as the cloud unit looks to secure a broader range of semiconductor technologies for its hyperscale operations. Under the agreement disclosed on Monday, STMicro will supply AWS with chips supporting high-bandwidth connectivity and energy-efficient power management, components that are increasingly relevant as AI workloads place heavier demands on data-center performance and power efficiency. The structure of the deal suggests AWS is positioning itself not just as a customer, but as a long-term partner as global data-center build-outs accelerate.\n\nWarning! GuruFocus has detected 2 Warning Sign with AMZN.\n\nIs AMZN fairly valued? Test your thesis with our free DCF calculator.\n\nAlongside the commercial supply arrangement, AWS received warrants to acquire up to 24.8 million ordinary STMicro shares, with vesting linked to AWS's purchases of STMicro products over time. The warrants can be exercised over a seven-year period at an initial exercise price of $28.38, giving AWS the flexibility to build an equity position in stages. STMicro shares rose 6.5% at the market open to $26.51 following the announcement, while for AWS the move represents at least its second investment in a semiconductor company, reinforcing the view that cloud operators could increasingly blend procurement and capital allocation to secure strategic supply.\n\nThe backdrop to the agreement is a widening semiconductor opportunity driven by AI-related data-center investment, where demand is extending beyond advanced processors into analog chips used for power management, sensing, and cooling. STMicro, which supplies customers such as Tesla ( NASDAQ:TSLA ) and Apple Inc. ( NASDAQ:AAPL ), recently forecast first-quarter revenue that came in above analysts' expectations, with consumer electronics demand showing signs of recovery late last year after a prolonged slump. At the same time, management has cautioned that the rebound remains uneven, with Chief Executive Officer Jean-Marc Chery noting that the automotive market is not yet stable, suggesting that AI-driven infrastructure demand could be an important, though not uniform, support for the company's outlook.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "KLAC",
      "Date": "2026-02-09",
      "Time": "22:58:00",
      "Source": "Zacks",
      "Title": "AMAT to Post Q1 Earnings: Time to Buy, Sell or Hold the Stock?",
      "URL": "https://finance.yahoo.com/news/amat-post-q1-earnings-time-145800605.html",
      "Content": "Applied Materials AMAT is scheduled to report first-quarter fiscal 2026 results on Feb. 12.\n\nFor the fiscal first quarter, AMAT expects revenues to be $6.85 billion (+/- $500 million). The Zacks Consensus Estimate for revenues is pegged at $6.89 billion, suggesting a decline of 3.87% from the year-ago quarter’s reading.\n\nApplied Materials projects non-GAAP earnings to be $2.18 (+/- $0.20). The Zacks Consensus Estimate for earnings is pegged at $2.19 per share, indicating a decline of 7.98% from the year-ago quarter’s reported figure. The figure has remained unchanged in the past 60 days.\n\nImage Source: Zacks Investment Research\n\nAMAT has an impressive earnings surprise history. AMAT beat the Zacks Consensus Estimate in each of the past four quarters, with an average earnings surprise of 4.17%.\n\nApplied Materials, Inc. price-eps-surprise | Applied Materials, Inc. Quote\n\nOur proven model predicts an earnings beat for AMAT this earnings season. The combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) increases the chances of an earnings beat, which is the case here.\n\nEarnings ESP: Earnings ESP, which represents the difference between the Most Accurate Estimate ($2.26 per share) and the Zacks Consensus Estimate ($2.19 per share), is +3.06%. You can uncover the best stocks to buy or sell before they are reported with our Earnings ESP Filter.\n\nZacks Rank: AMAT carries a Zacks Rank #2 at present. You can see the complete list of today’s Zacks #1 Rank stocks here .\n\nAMAT’s wafer fabrication equipment (WFE) is experiencing increased demand due to a rise in the usage of semiconductors in artificial intelligence and high performance computing (HPC). In the previous quarter, AMAT reported that its leading-edge foundry/logic, DRAM and advanced packaging will be the fastest-growing areas of the WFE market.\n\nAMAT’s flash memory or NAND sales nearly doubled to $1.41 billion in fiscal 2025 from the year-ago sales of $747.4 million. Although AMAT has a lower market share in the NAND space, it is gaining prominence. This trend is likely to have persisted in the to-be-reported quarter, supporting AMAT’s top-line growth.\n\nApplied Materials’ leadership in GAA transistors at 2nm and below, Backside power delivery, Advanced wiring and interconnect, HBM stacking and hybrid bonding and 3D device metrology, which are indispensable for manufacturing next-generation semiconductor chips, are likely to have driven AMAT’s semiconductor segment in the fiscal first quarter.\n\nAMAT’s display business has rebounded in the fiscal 2025 with year-over-year growth of 19.8%. In the fourth quarter of fiscal 2025, the display revenues grew 68.2% year over year as Applied Materials shipped a richer mix of advanced systems and increased prices broadly. These factors are likely to have benefited AMAT’s corporate and other segment’s revenues.\n\nThe company’s Applied Global Services segment is also likely to have seen steady growth, aided by strong demand for comprehensive service agreements and the expansion of its subscription-based business.\n\nApplied Materials shares have gained 74.9% over the past six months, outperforming the Zacks Electronics – Semiconductors industry, which has gained 19.4%.\n\nImage Source: Zacks Investment Research\n\nLet us now look at the value Applied Materials offers to its investors at current levels. AMAT is currently trading at a premium with a forward 12-month price-to-sales (P/S) of 8.46X compared with the industry’s 8.26X.\n\nImage Source: Zacks Investment Research\n\nApplied Materials operates in a highly competitive market space where it faces competition from players, including Lam Research LRCX in the semiconductor space, ASML Holding ASML in the photolithography and advanced manufacturing equipment segment. KLA Corporation KLAC is a dominant competitor in the wafer inspection space.\n\nFor instance, Lam Research develops Atomic Layer Deposition tools like AT200M, AT410 and AT650P that are similar to the devices made by AMAT. Both ASML and AMAT specialize in advanced semiconductor nodes, although developing solutions for various stages of semiconductor production. ASML Holding develops lithography solutions, including EXE and NXE systems.\n\nApplied Materials and KLA Corporation offer similar solutions, such as Wafer Inspection, Yield Enhancement and Process Control inspection systems. KLA Corporation develops inspection systems, including 3935 and 3920 EP broadband plasma defect inspection systems. Although Applied Materials is dealing with a broader market sell-off and growing competition, not everything is gloom and doom for the company.\n\nApplied Materials leads the market with its superior design wins. It is well-positioned to capitalize on the technology-inflection-led growing demand for next-generation chips on the back of its product innovations and leadership in leading-edge logic, compute memory, high bandwidth memory and advanced packaging.\n\nAMAT is likely to capitalize on AI-driven semiconductor demand. The company has made significant strides in cutting-edge chip manufacturing, particularly in gate-all-around (GAA) transistors, high-bandwidth memory and advanced packaging. These innovations are critical to enabling faster, more energy-efficient AI processing.\n\nAMAT is gaining from continuous strength across wafer fabrication equipment for foundry/logic, DRAM, NAND, flash memory, GAA and advanced packaging driven by increased usage of semiconductors in artificial intelligence and HPC. AMAT’s HBM stacking and hybrid bonding and 3D device metrology technologies are indispensable for manufacturing next-generation semiconductor chips. Considering these factors, we suggest investors buy this stock now.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "CRUS",
      "Date": "2026-02-09",
      "Time": "22:15:05",
      "Source": "Zacks",
      "Title": "Cirrus Logic, Inc. (CRUS) Soars to 52-Week High, Time to Cash Out?",
      "URL": "https://finance.yahoo.com/news/cirrus-logic-inc-crus-soars-141505325.html",
      "Content": "Have you been paying attention to shares of Cirrus Logic (CRUS) ? Shares have been on the move with the stock up 17.3% over the past month. The stock hit a new 52-week high of $144.76 in the previous session. Cirrus Logic has gained 20.5% since the start of the year compared to the -0.6% move for the Zacks Computer and Technology sector and the 3.2% return for the Zacks Electronics - Semiconductors industry.\n\nThe stock has a great record of positive earnings surprises, having beaten the Zacks Consensus Estimate in each of the last four quarters. In its last earnings report on February 3, 2026, Cirrus Logic reported EPS of $2.97 versus consensus estimate of $2.42.\n\nFor the current fiscal year, Cirrus Logic is expected to post earnings of $8.51 per share on $1.94 in revenues. This represents a 12.86% change in EPS on a 2.35% change in revenues. For the next fiscal year, the company is expected to earn $8.77 per share on $2.03 in revenues. This represents a year-over-year change of 3.03% and 4.48%, respectively.\n\nThough Cirrus Logic has recently hit a 52-week high, what is next for Cirrus Logic? A key aspect of this question is taking a look at valuation metrics in order to determine if the company is due for a pullback from this level.\n\nOn this front, we can look at the Zacks Style Scores, as they provide investors with an additional way to sort through stocks (beyond looking at the Zacks Rank of a security). The individual style scores for Value, Growth, Momentum and the combined VGM Score run from A through F. Investors should consider the style scores a valuable tool that can help you to pick the most appropriate Zacks Rank stocks based on their individual investment style.\n\nCirrus Logic has a Value Score of C. The stock's Growth and Momentum Scores are A and A, respectively, giving the company a VGM Score of A.\n\nIn terms of its value breakdown, the stock currently trades at 16.8X current fiscal year EPS estimates, which is not in-line with the peer industry average of 37.6X. On a trailing cash flow basis, the stock currently trades at 19.4X versus its peer group's average of 23.4X. This isn't enough to put the company in the top echelon of all stocks we cover from a value perspective.\n\nWe also need to look at the Zacks Rank for the stock, as this supersedes any trend on the style score front. Fortunately, Cirrus Logic currently has a Zacks Rank of #1 (Strong Buy) thanks to rising earnings estimates.\n\nSince we recommend that investors select stocks carrying Zacks Rank of 1 (Strong Buy) or 2 (Buy) and Style Scores of A or B, it looks as if Cirrus Logic fits the bill. Thus, it seems as though Cirrus Logic shares could still be poised for more gains ahead.\n\nShares of CRUS have been soaring, and the company still appears to be a decent choice, but what about the rest of the industry? One industry peer that looks good is Applied Materials, Inc. (AMAT) . AMAT has a Zacks Rank of #2 (Buy) and a Value Score of D, a Growth Score of B, and a Momentum Score of A.\n\nEarnings were strong last quarter. Applied Materials, Inc. beat our consensus estimate by 2.84%, and for the current fiscal year, AMAT is expected to post earnings of $9.62 per share on revenue of $29.17 billion.\n\nShares of Applied Materials, Inc. have gained 7.1% over the past month, and currently trade at a forward P/E of 33.53X and a P/CF of 31.95X.\n\nThe Electronics - Semiconductors industry is in the top 25% of all the industries we have in our universe, so it looks like there are some nice tailwinds for CRUS and AMAT, even beyond their own solid fundamental situation.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.",
      "Language": "en",
      "IsSummarized": false
    },
    {
      "Ticker": "TXN",
      "Date": "2026-02-09",
      "Time": "18:39:00",
      "Source": "Motley Fool",
      "Title": "Prediction: This Chip Stock Could Be a Top Performer by 2027",
      "URL": "https://finance.yahoo.com/m/4506dcb6-826d-3c7c-a937-5e482df4a4c9/prediction%3A-this-chip-stock.html",
      "Content": "When investors look at investing in computer chips to take advantage of the artificial intelligence (AI) revolution, they are likely to start with a company like Nvidia (NASDAQ: NVDA) . That makes sense, given that it makes the most popular chips for handling AI workloads. However, there's another chip stock that could also turn out to be a huge AI winner: Texas Instruments (NASDAQ: TXN) .\n\nNvidia makes high-powered parallel processing chips that act as the primary brains that undergird AI software. Texas Instruments makes analog chips, the boring ones that convert physical events into digital signals. When you push a button on a digital device, it is likely being controlled by an analog chip. Texas Instruments' chips are simple, relatively low cost, and can be found in tech products virtually everywhere.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\n\nIn the artificial intelligence hardware world, Texas Instruments' chips provide power management. That's a vital function within the data centers that house AI. Given the expectation that the AI infrastructure buildout is only just beginning, Texas Instruments could have years of growth ahead of it in this end market.\n\nOver the last few years, the analog chip sector has been in a rut. However, Texas Instruments has been investing in new chip production capacity. Just recently, it agreed to buy competitor Silicon Labs (NASDAQ: SLAB) . In other words, Texas Instruments is preparing for growth.\n\nIt is also shifting the way it reports its sales. In the fourth quarter of 2025, the company broke out its data center business as a separate end market. The segment accounted for around 9% of the top line. However, it grew 64% year over year in the fourth quarter.\n\nThat's probably not a number to bake into your growth expectations, given that the AI opportunity is brand new. Still, revenue rose by a mid-single-digit percentage from the third quarter. If this is just the beginning of the AI buildout, this segment could help supercharge an upturn in the typically cyclical analog chip sector and support growth for years to come.\n\nThere are other analog chipmakers , and there are chipmakers that make more exciting chips than Texas Instruments. However, for most investors, opening a position in this industry-leading company will probably set you up for long-term success. And given the strength of the business and the company's growth efforts, the AI buildout could easily turn Texas Instruments into a top-performing chipmaker by 2027, if not sooner.",
      "Language": "en",
      "IsSummarized": false
    }
  ]
}