{
  "stock_id": "AAPL",
  "last_updated": "2025-12-18T13:11:26.653Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-18",
      "Time": "20:35:00",
      "Source": "Motley Fool",
      "Title": "2 Unstoppable Stocks to Buy No Matter What Happens in 2026",
      "URL": "https://finance.yahoo.com/m/e0a71a55-de4f-38de-8f4c-18bef668a9f9/2-unstoppable-stocks-to-buy.html",
      "Content": "2 Unstoppable Stocks to Buy No Matter What Happens in 2026\n\nProsper Junior Bakiny, The Motley Fool\nThu, December 18, 2025 at 4:35 AM PST 5 min read\n\nIn this article: AMZN\n\nAAPL\n\nKey Points These two tech leaders had a challenging year but have demonstrated their resilience.\nThey also boast strong prospects and economic moats, making them excellent long-term investments.\n10 stocks we like better than Amazon ›\nIn 2025, tariff threats and trade wars rocked equities and nearly triggered a full-blown bear market. Despite all that, stocks have performed pretty well this year.\n\nWhat's in store for 2026? Nobody knows. However, some companies can navigate the challenges ahead -- whatever they may be -- and perform well over the long run. These are the kind of businesses that investors want to set their eyes on.\nHere are two excellent, well-known candidates that fit the bill: Amazon (NASDAQ: AMZN) and Apple (NASDAQ: AAPL) . These longtime market beaters are still worth investing in and sticking with next year and beyond.\n1. Amazon Amazon has basically moved sideways this year. The e-commerce specialist is lagging broader equities and most of its \"Magnificent Seven\" peers. What's going on with the company?\nThere are several things, and here's one of the most important: Many investors are worried that the company is losing market share to its closest competitors in the cloud computing industry.\n\nAmazon Web Services (AWS) accounts for most of Amazon's operating profits, as it boasts much juicier margins than its e-commerce operations. If it loses ground in this market, Amazon could see slower-growing earnings. That said, Amazon is showing it can perform well, despite this issue.\nDuring the third quarter, the company's sales growth within AWS accelerated, compared to recent quarters, and was stronger than anything investors have seen since 2022. Amazon maintains its lead at the top of the cloud computing industry.\nElsewhere, the company is seeking ways to enhance margins and profits within its e-commerce division. To that end, it has deployed a fleet of industrial robots in its warehouses.\nThe company's goal with this initiative is twofold. First, it will seek to cut costs while making shipping and deliveries faster, thereby improving the customer experience. Amazon's efforts here could help increase its razor-thin margin in its e-commerce division. Even a relatively small improvement may meaningfully boost the company's earnings.\n\nSecond, Amazon has several other potential growth drivers. Its advertising business is going strong, and it's making strides within its healthcare division, thanks to initiatives such as Amazon Pharmacy. And here's the best part: The industries and markets where it dominates still have significant long-term growth prospects.\n\nStory Continues\nThat's the case with e-commerce, which, despite its seeming ubiquity, still captures less than 20% of retail transactions in the U.S. It's also true of cloud computing and artificial intelligence (AI), which, CEO Andy Jassy has observed, are still in their early innings.\nLastly, Amazon has a wide economic moat due to its brand name, switching costs, and network effects. The company's investment thesis remains intact, despite the headwinds it has faced in 2025.\n\n2. Apple Apple is more exposed to the threat of tariffs than perhaps any of its similarly sized peers. The company still generates most of its sales from its hardware devices, particularly the iPhone, which is manufactured in countries such as China -- a country on which the Trump administration tried to impose steep tariffs.\n\nDespite all that, Apple's shares are up 12% year to date. That's below the performance of the S&P 500 but better than many expected six months ago.\nApple's strength lies in its ability to continue convincing new and existing customers to purchase more iPhones. The company's latest launch, the iPhone 17, was well received and is expected to drive a strong renewal cycle over the next three years, helping to maintain decent sales growth.\nHowever, Apple's hardware business isn't where the company's most important long-term opportunities lie. The company's services segment -- where Apple boasts more than 1 billion paid memberships -- arguably takes that crown. It accounted for a meaningful 39% of its sales, as of the last quarter.\n\nMoreover, the services segment has been growing its revenue, on average, faster than the rest of the business for years, a trend that should continue for the foreseeable future. Since services boast significantly higher margins than hardware sales, Apple's profits should increase meaningfully over the long run as the company expands this segment.\nRevenue from services will rise as Apple's large installed base of devices expands. The company routinely hits new highs in that department. And given the company's high switching costs -- Apple makes it hard to leave its ecosystem -- Apple's installed base should, at the very least, remain stable.\nApple has demonstrated that it can navigate the threat from tariffs, still maintains a solid hardware business, and boasts attractive tailwinds within services. To top it all off, it remains an excellent dividend stock . These are all good reasons to stick with Apple in 2026 and beyond.\n\nShould you invest $1,000 in Amazon right now? Before you buy stock in Amazon, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Amazon wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,955 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,089,460 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 968 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nProsper Junior Bakiny has positions in Amazon. The Motley Fool has positions in and recommends Amazon and Apple. The Motley Fool has a disclosure policy .\n2 Unstoppable Stocks to Buy No Matter What Happens in 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:08:37",
      "Source": "GuruFocus.com",
      "Title": "Apple Opens iPhones to Alternative App Stores in Japan",
      "URL": "https://finance.yahoo.com/news/apple-opens-iphones-alternative-app-120837392.html",
      "Content": "Apple Opens iPhones to Alternative App Stores in Japan\n\nFaizan Farooque\nThu, December 18, 2025 at 4:08 AM PST 1 min read\n\nIn this article: AAPL\n\nThis article first appeared on GuruFocus .\nApple Inc. ( AAPL , Financials ) said it would allow alternative iPhone app shops in Japan to comply with new smartphone competition laws. Japanese developers may launch app marketplaces and pay Apple for transactions at 5% under the new architecture. Developers may add their own in-app payment methods, but Apple's will remain accessible.\n\nWarning! GuruFocus has detected 4 Warning Sign with FRA:CVC1.\nIs AAPL fairly valued? Test your thesis with our free DCF calculator.\nThis is another major adjustment in Apple's worldwide App Store business, which has faced regulatory criticism in many nations. Developers pay Apple up to 30% on digital sales. Japan's new laws vary from Europe's, where Apple must expose its iOS environment. Apple approves third-party marketplaces in Japan and applies age ratings and notarization to any software sold outside its store.Apple also charged 15% for external payment connections in applications and 26% for App Store in-app purchases. Apple must also handle third-party device access requests, although it may refuse privacy-risky requests. The legislation requires hardware compatibility.Apple claimed it reduced security risks and maintained privacy requirements under the new approach. The company's compliance in Japan follows European and US legal actions. By 2025, Japan's restrictions will harm Apple's valuable services business, so investors will look for updates.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:00:39",
      "Source": "Yahoo Finance Video",
      "Title": "Amazon, Apple, Google, etc.: Why the Mag 7 needs to 'recalibrate'",
      "URL": "https://finance.yahoo.com/video/amazon-apple-google-etc-why-120039409.html",
      "Content": "Amazon, Apple, Google, etc.: Why the Mag 7 needs to 'recalibrate'\n\nYahoo Finance Video and Brian Sozzi\nThu, December 18, 2025 at 4:00 AM PST\n\nIn this video: TSLA\n\n^GSPC\n\nAAPL\n\nGOOG\n\nMSFT\n\nThe S&P 500 ( ^GSPC ) is concentrated primarily in the top ten technology stocks, according to Barclays.\nPNC Asset Management Group chief investment officer Amanda Agati, Yahoo Finance Senior Business Reporter Ines Ferré , and Yahoo Finance Senior Reporter Brooke DiPalma join Opening Bid host Brian Sozzi to discuss the market's concentration in tech and whether it's time for investors to start selling the \"Magnificent Seven.\"\nTo watch more expert insights and analysis on the latest market action, check out more Opening Bid .\n\nVideo Transcript\n\n00:00 Speaker A\nWhat I mentioned at the top about how much concentration risk there is in the S&P 500. What does that mean exactly for investors as we gear up for next year?\n00:10 Amanda\nWell, it's a great question and it's great to be with all of you again.\n00:15 Amanda\nIt's tough out there. Uh certainly for active managers to try and own enough of those top seven or top 10 names to really make a difference in terms of trying to keep up with, let alone outperform the S&P 500.\n00:30 Amanda\nSo for multi- asset investors, it's I think it's just going to continue to be a challenging environment to keep up with the S&P 500. It's hard to bet against them though.\n00:43 Amanda\nBut I think for 2026, it's going to be less about valuation multiple expansion and much more about what happens to the bottom 490 or 493, however you want to calculate it. I think that market breadth story, it was a little bit elusive this year, but I think it's going to come to the forefront next year and make a difference for multi- asset investor positioning.\n01:00 Speaker A\nAmanda, that's good points. Uh is the sell-offs we're seeing in Oracle and CoreWeave over the past few weeks, is that the signal Amanda to investors to start lightning the load on the Mag 7?\n01:11 Amanda\nI don't know that it's necessarily a signal to start selling. Again, we're not trying to bet against that story. It's it's very secular, thematic, long runway, still very much early innings. So we're all in on it. I think just the reality of where valuations have moved to is a little bit, I don't want to say nonsensical, but I just said nonsensical.\n01:28 Amanda\nIt feel it feels like we need to recalibrate a little bit. And so I think what's happening here is some seasonality, selling some of those winners and hoping that we get another crack at it, maybe early in the new year.\n01:40 Speaker A\nInez, this is all one big fat bubble, right?\n01:44 Ines\nLook, uh Sozzi, uh like Amanda was saying, I mean, yes, there is this concentration uh and also Goldman Sachs uh just recently put out a note as well talking about that concentration for earnings growth for next year and concentrated in the largest uh S&P 500, the largest seven stocks of the S&P 500.\n02:05 Ines\nHowever, like what Amanda was just saying, there is this expectation that for the other 493, that you will see a bit of an acceleration of earnings growth for those companies as well. So there may be a little tiny bit of broadening out when it comes to that.\n02:22 Ines\nBut a lot of this of course is the AI theme that we've been talking about and this is what Wall Street has been bullish on, is this AI theme that AI uh driven productivity will also be supporting earnings.\n02:37 Speaker A\nUh important point here Brooke is that within these 10 stocks that have uh essentially taken over the S&P 500 and taken over the minds of investors. These companies have earnings, the earnings are good and they're still accelerating. So I guess to Amanda's point, it's going to be hard to bet against these names next year.\n02:53 Brooke\nBrian, but I think what the key point here that investors have really weighed in on is the future outlook of these companies, the guidance that they're putting out.\n03:02 Brooke\nAnd I think that's why we're seeing investors fall disappointed based upon what these companies say will be the end results or what exactly the end result could potentially be for revenue when it comes to all the AI investments that they're currently making, the spending that they're currently doing.\n03:20 Brooke\nAnd and that's why sometimes we're not seeing the same return that we see from other uh stocks, other investments because of the fact that these these uh guidance, these outlook that these companies put out just doesn't meet the very high bar that these investors have set for these sort of companies.\n03:42 Brooke\nAnd also, we are seeing a bit of a different fold. Over the past three months, we've seen Tesla, Apple, and Alphabet outperform the broader uh Mag 7.\n03:51 Brooke\nAnd that's largely because of the fact that investors seem to be liking the way in which these companies are now pursuing AI. And so we're seeing this bit of a uh a differ, you know, a difference in what we're seeing in these latter parts of the month than maybe earlier this year when we really saw Nvidia, Amazon, Microsoft, as well as Meta really lead the way within this AI tech rally, especially over the summer months.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "18:20:00",
      "Source": "Motley Fool",
      "Title": "Alphabet Has Another Hidden Asset, and Its Value Is About to Go to the Moon in 2026",
      "URL": "https://finance.yahoo.com/m/114d184c-89e0-39a8-90ab-896f0b85de58/alphabet-has-another-hidden.html",
      "Content": "Alphabet Has Another Hidden Asset, and Its Value Is About to Go to the Moon in 2026\n\nGeoffrey Seiler, The Motley Fool\nThu, December 18, 2025 at 2:20 AM PST 6 min read\n\nIn this article: GOOG\n\nAAPL\n\nKey Points Alphabet's core business remains Google, but it has several other prominent businesses.\nThe company has some hidden assets in Waymo and quantum computing, but a lesser-known one is its investment in space companies.\nThe company is about to see a big windfall from its earlier investment in SpaceX.\n10 stocks we like better than Alphabet ›\n\nAlphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) is best known for Google, which is the most dominant search engine on the planet. Google commands an approximate 90% market share in search, in large part due to the distribution advantages it has. The company owns both the world's leading web browser in Chrome and the No. 1 smartphone operating system in Android.\nAlphabet also has a search revenue-sharing deal with Apple to be the default search on all its devices. This essentially makes Google the gateway to the internet for most people. Meanwhile, the company monetizes its search engine through the massive global ad network it has created, which can serve everything from global brands to local merchants. It has gained both the trust of users and advertisers, creating a power network effect that is still in place, even as the market shifts due to the introduction of artificial intelligence (AI) .\nAlphabet's many businesses However, Google is not Alphabet's only business. It also owns the popular YouTube streaming service, which is the largest video platform on the planet. It also owns a plethora of apps and tools, such as Google Maps, Gmail, and Google Workspace. The company also helps other websites and apps monetize their content through its AdSense network.\n\nMeanwhile, Alphabet's fastest-growing segment is its cloud computing business, Google Cloud. This is an infrastructure-as-a-service business that has been seeing strong growth driven by AI, as customers look to build out their own AI models and apps.\nAlphabet has established a nice edge in this business, as the company has developed its own custom AI chips, called Tensor Processing Units (TPUs), that give it a big cost advantage compared to competitors. It has also helped build one of the top large language models (LLMs) in Gemini, which it lets customers use as a foundational model to build upon. And it's infused Gemini across its own products to make them better.\nAlphabet also has some attractive emerging bets. The one furthest along is its robotaxi business, Waymo. Waymo is expanding rapidly across the U.S. and recently surpassed 450,000 weekly paid rides. It currently has a big first-mover advantage in the U.S. and is also looking to expand internationally into Tokyo, Japan, and London, England. This business could be a big growth driver for the company in the future.\n\nStory Continues\nMeanwhile, it is also making strides in the area of quantum computing. Its Willow chip has shown the ability to correct errors in real-time as it scales, which is a major hurdle for the space. Quantum computing is likely many years away from becoming a contributing business, but it's another area where Alphabet is leading the way.\n\nAnother hidden asset While Waymo and its quantum computing unit are two hidden assets at Alphabet, they are not the only ones. Alphabet also owns about a 7% stake in Elon Musk's SpaceX, which could IPO late next year.\nAlphabet made a $900 million investment in SpaceX back in 2015, when the company was valued at around $12 billion. In a secondary market transaction, the company was recently valued at $800 billion, and Musk has said he will be looking for a $1.5 trillion valuation in an IPO. That would value Alphabet's stake at over $100 billion.\n\nSpaceX could look to go public next year to help fund an increasing launch schedule. The company has launched over 100 rockets just this year, with more than 70 for its own Starlink satellites. The company has established a huge satellite network that now powers its Starlink high-speed mobile internet service, which can work around the globe, even in remote areas. That business has been booming, with the company having more than 8 million customers, and the service available in 150 markets and being used by about two dozen airlines.\nSpaceX also makes money through launch services for both the U.S. government and commercial customers. Meanwhile, it also has big ambitions for orbital data centers, which would use solar power from the sun and have free cooling. While that may sound far-fetched, a lot of companies are actually looking into it, including Alphabet.\n\nAlphabet plans to test orbital data centers with its Project Suncatcher, in partnership with satellite imagery company Planet Labs , in which Alphabet owns a 10% stake. It will launch two prototype satellites in 2027 to test the technology and how the hardware handles being in space. Alphabet also owns a stake in AST SpaceMobile , which has a technology that lets satellite networks connect to current smartphones.\nSo, in addition to its many well-publicized businesses, Alphabet also has a nice investment portfolio of intriguing space businesses, one of which is about to be worth a lot of money in SpaceX. However, that's just an added reason to own the stock. The main reason to own it is that it's becoming an AI leader that has the most complete tech stack of any company, with its highly regarded custom AI chips and world-class Gemini AI model. Meanwhile, the stock is attractively valued, trading at a forward price-to-earnings (P/E) ratio of 27 times 2026 analyst estimates.\n\nShould you invest $1,000 in Alphabet right now? Before you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,955 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,089,460 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 968 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nGeoffrey Seiler has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet and Apple. The Motley Fool has a disclosure policy .\nAlphabet Has Another Hidden Asset, and Its Value Is About to Go to the Moon in 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "17:41:35",
      "Source": "MT Newswires",
      "Title": "Apple Intends to Expand Ads in App Store Search Results From 2026",
      "URL": "https://finance.yahoo.com/news/apple-intends-expand-ads-app-094135327.html",
      "Content": "PREMIUM\nApple Intends to Expand Ads in App Store Search Results From 2026\n\nMT Newswires\nThu, December 18, 2025 at 1:41 AM PST 1 min read\n\nIn this article: AAPL\n\nApple (AAPL) said Wednesday it plans to increase the number of advertisements that appear in its App\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "17:31:21",
      "Source": "MT Newswires",
      "Title": "Apple Updates iOS in Japan to Comply With Mobile Software Competition Act",
      "URL": "https://finance.yahoo.com/news/apple-updates-ios-japan-comply-093121278.html",
      "Content": "PREMIUM\nApple Updates iOS in Japan to Comply With Mobile Software Competition Act\n\nMT Newswires\nThu, December 18, 2025 at 1:31 AM PST\n\nIn this article: AAPL\n\nApple (AAPL) said Thursday that it implemented changes to its iOS in Japan to comply with the countr\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "14:00:00",
      "Source": "Barrons.com",
      "Title": "Walmart and 2 More American Icons Are About to Get New Leadership. Trust the Process.",
      "URL": "https://finance.yahoo.com/m/020c66e6-7575-36f3-9f5f-a1b983c4f617/walmart-and-2-more-american.html",
      "Content": "Walmart and 2 More American Icons Are About to Get New Leadership. Trust the Process.\n\nAndy Serwer\nWed, December 17, 2025 at 10:00 PM PST 5 min read\n\nIn this article: BRK-B\n\n^GSPC\n\nWMT\n\nOPAI.PVT\n\nAAPL\n\nWalmart, Berkshire Hathaway, and Apple—arguably America’s three most important companies—will soon see a change of the guard.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "13:39:40",
      "Source": "Insider Monkey",
      "Title": "Evercore ISI Raises PT on Apple (AAPL) Stock",
      "URL": "https://finance.yahoo.com/news/evercore-isi-raises-pt-apple-053940499.html",
      "Content": "Evercore ISI Raises PT on Apple (AAPL) Stock\n\nBob Karr\nWed, December 17, 2025 at 9:39 PM PST 2 min read\n\nIn this article: AAPL\n\nApple Inc. (NASDAQ: AAPL ) is one of the Top AI and Technology Stocks to Buy According to Hedge Funds. On December 8, Evercore ISI lifted the price target on the company’s stock to $325 from $300, while keeping an “Outperform” rating on the company’s stock. As per the analyst, Apple Inc. (NASDAQ:AAPL)’s upcoming Siri 2.0, powered by Gemini, is expected to act as a catalyst for potential upside in profits and valuation. The strategic launch has been planned for March 2026.\nIn a different update, Citi raised the price objective on Apple Inc. (NASDAQ:AAPL)’s stock to $330, hinting at stronger-than-expected momentum for the iPhone 17 cycle, along with a healthier upgrade pool moving ahead into 2026 and 2027. Notably, the firm expects iPhone upside in Apple Inc. (NASDAQ:AAPL)’s December and March quarters, amidst iPhone 12 and 13 users entering the company’s upgrade window. Also, Citi raised its earnings estimates to reflect iPhone 17 strength.\n\nThe firm’s analyst expects further tailwinds due to the company’s shift to WMCM (Wafer-level Multi-Chip Module) packaging in 2026. This can enable efficiency gains and place future devices for heavier on-device AI workloads. Furthermore, the firm bases the new target on a ~33x multiple of 2027 earnings. According to Citi, Apple Inc. (NASDAQ:AAPL)’s margin profile, services mix, and balance sheet tend to justify the premium.\nWhile we acknowledge the potential of AAPL as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 13 Cheap AI Stocks to Buy According to Analysts and 11 Unstoppable Growth Stocks to Invest in Now\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "09:00:00",
      "Source": "Business Wire",
      "Title": "Apple announces changes to iOS in Japan",
      "URL": "https://finance.yahoo.com/news/apple-announces-changes-ios-japan-010000433.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nApple announces changes to iOS in Japan\n\nBusiness Wire\nWed, December 17, 2025 at 5:00 PM PST 9 min read\n\nIn this article: AAPL\n\nThe changes include new options for developers to distribute apps and process payments, and new protections to help reduce privacy and security risks the MSCA creates\nCUPERTINO, Calif., December 18, 2025 --( BUSINESS WIRE )--Apple® today announced changes impacting iOS apps in Japan to comply with the Mobile Software Competition Act (MSCA). These updates create new options for developers to distribute apps on alternative app marketplaces and to process app payments for digital goods and services outside of Apple In-App Purchase. Across these changes, Apple has worked to reduce new privacy and security risks the law creates to provide users in Japan the best and safest experience possible.\n\nThe MSCA’s requirements for alternative app marketplaces and app payments open new avenues for malware, fraud and scams, and privacy and security risks. Apple has worked with Japanese regulators to introduce protections from new threats — including important safeguards for younger users. These protections include Notarization for iOS apps, an authorization process for app marketplaces, and requirements that help protect children from inappropriate content and scams.\nWhile these safeguards do not eliminate the new risks, they are essential to Apple’s work to ensure iOS remains the best, most secure mobile platform available in Japan. Apple will continue to engage with regulators on strengthening protections for iOS users.\nDevelopers can learn about the new capabilities on the Apple Developer Support page and can integrate them into their apps beginning today as part of the iOS 26.2 release.\n\nNew Options for Developers to Distribute Apps on iOS in Japan\nThe App Store® — where every app is reviewed to meet the App Store’s high bar for privacy and security — remains the best place for iOS users in Japan to discover and download the apps they love. This includes App Store features that protect users against fraud and scams and empower parents to ensure their kids have age-appropriate experiences.\nWith the MSCA’s new requirements, developers will also have the option to distribute iOS apps in Japan using alternative app marketplaces other than the App Store. Alternative app marketplaces will have to be authorized by Apple and will need to meet ongoing requirements to serve developers and users. However, apps downloaded outside the App Store will not benefit from the same protections Apple provides through App Review, introducing new risks for apps that contain scams, fraud, and abuse, or that expose users to illicit, objectionable, or harmful content not allowed on the App Store.\n\nStory Continues\nTo reduce some of these new risks, Apple will conduct a baseline review — called Notarization — that applies to all iOS apps and focuses on basic functionality and protecting users from serious threats. This Notarization process involves a combination of automated checks and human review, and helps ensure apps function as promised and are free of known malware, viruses, or other security threats. However, Notarization is less comprehensive than the App Review process that applies to all apps on the App Store.\n\nDevelopers can learn more about operating or distributing from alternative app marketplaces on the new Apple Developer Support page .\nNew Options for Payments in App Store Apps on iOS\nOn the App Store, users in Japan can continue to use Apple In-App Purchase to buy digital goods and services, manage subscriptions, request refunds, and view their payment history.\nTo comply with the MSCA, Apple is sharing tools that enable developers to offer more ways for users to purchase digital goods and services in apps on the App Store. For their iOS apps distributed on the App Store in Japan, developers will be able to include an alternative payment processing method in their app and/or link users to a website to complete a transaction.\nThese alternative payment options will always be presented alongside Apple In-App Purchase, so that users in Japan are clear on when they are transacting through Apple. When users choose to pay with Apple In-App Purchase, they’ll continue to receive familiar protections and tools like refund support, subscription management, and Report a Problem. App Store users’ purchase history and subscription management will only reflect transactions made using Apple In-App Purchase.\n\nFor apps that use alternative payment processing or link users to the web for transactions, Apple will not be able to issue refunds and will have less ability to support customers encountering issues, scams, or fraud. Users may need to share their payment information with additional parties, which can introduce new privacy and security risks.\nUpdated Business Terms for iOS Apps in Japan\nTo reflect these options for app distribution and payment processing, Apple is also sharing updated business terms for developers’ iOS apps in Japan. These business terms reflect the many ways Apple creates value for developers’ apps, whether or not they use the App Store and/or Apple In-App Purchase.\nUnder the business terms for iOS apps in Japan, Apple will continue to only charge a commission on the sale of digital goods and services. The new terms include:\n\nApp Store commission : iOS apps on the App Store will pay a reduced commission of either 10 percent for the vast majority of developers — including members of the Small Business Program, Video Partner Program, Mini Apps Partner Program, and for subscriptions following their first year — or 21 percent on transactions for digital goods and services. The App Store commission reflects the value of the tools, technology, and services that enable developers to create apps, in addition to App Store distribution, discovery, and ongoing services.\nApple payment processing fee : In their iOS apps on the App Store, developers can process payments using Apple In-App Purchase for an additional 5 percent fee.\nStore services commission : iOS apps on the App Store will pay a commission of 15 percent on transactions for digital goods and services made on a website linked to by the developer’s app. Developers in the programs mentioned above, and subscriptions following their first year, will pay a reduced rate of 10 percent.\nCore Technology Commission : iOS apps distributed outside of the App Store will pay a 5 percent commission on the sale of digital goods and services, including paid apps. The Core Technology Commission compensates Apple for the tools, technologies, and services that enable developers to build and share their apps with iOS users.\n\nUnder these new business terms, developers that sell digital goods and services in Japan will pay Apple the same or less than they do today. Developers that do not sell digital goods and services will continue not to pay Apple any commissions or fees.\nImpacts to Kids’ Online Safety\nApple created the App Store to be a safe place for kids, where parents are empowered to ensure their children have age-appropriate experiences and have the tools they need to keep their children safe online. That’s why Apple has created industry-leading features like age ratings, Content & Privacy Restrictions, content filters, Ask to Buy, and powerful controls that help parents choose how children use their devices.\nWith the changes introduced under the MSCA, the new options for alternative distribution and payment methods may expose children to new risks. For instance, apps downloaded from outside the App Store may include illicit and objectionable content, and they will not undergo the same rigorous review process Apple employs to evaluate apps made for children on the App Store. For instance, similar regulatory changes in Europe have enabled types of apps that were previously unavailable on iOS, including pornography apps.\n\nIn an effort to reduce new risks of fraud or scams targeting children, Apple has worked with regulators in Japan to preserve some guardrails, including:\nApps in the Kids category on the App Store will not include links to websites to complete transactions, to reduce the risk of fraud or scams targeting children.\nFor users under 18 years old , all apps from the App Store that use alternative payment processing or link to a website for transactions must include a parental gate that requires younger users to involve their parent or guardian before making a purchase.\nFor users under 13 years old, apps from the App Store cannot link to websites for transactions to protect against the risk of scams that target younger kids.\nApple is also working to provide developers using alternative payments with a new API so they can enable parents to monitor and approve purchases made outside of Apple In-App Purchase.\n\nDevelopers must also continue to provide age ratings for their apps, whether their app is distributed on the App Store or an alternative app marketplace.\nApple will continue innovating to meet the evolving risks to kids’ safety online by building on the powerful tools and features it makes available today — like Child Accounts, web content filters, app restrictions, monitoring tools like Screen Time and Family Sharing, Communication Safety, and Communication Limits, which help parents shape who their children communicate with and shield them from inappropriate content.\nAdditional Updates to iOS\nAlongside the new app distribution and payment options, Apple has introduced additional controls and choices for users in Japan with the release of iOS 26.2. These include:\n\nA browser choice screen and search engine choice experience , giving users in Japan new ways to pick their preferred browser and search engine.\nDefault controls for navigation apps and app marketplaces.\nAcross these controls, users can review and adjust their choices at any time in Settings.\nFor developers, Apple is sharing tools in addition to the new options for alternative distribution and app payments, including:\nNew options for developers of browser apps to use alternative browser engines other than WebKit, with strict security and privacy requirements.\nA new API that enables developers of voice-based conversational apps to provide users the option to launch their app with the iPhone® side button.\nA process to request interoperability with core technologies in iPhone and iOS.\n\nApple is providing detailed resources to help developers understand the options now available for their apps in Japan, which they can access from the Apple Developer Support page .\nApple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, AirPods, Apple Watch, and Apple Vision Pro. Apple’s six software platforms — iOS, iPadOS, macOS, watchOS, visionOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, iCloud, and Apple TV. Apple’s more than 150,000 employees are dedicated to making the best products on earth and to leaving the world better than we found it.\n\nNOTE TO EDITORS: For additional information visit Apple Newsroom ( www.apple.com/newsroom ), or email Apple’s Media Helpline at media.help@apple.com .\n© 2025 Apple Inc. All rights reserved. Apple, the Apple logo, App Store and iPhone are trademarks of Apple. Other company and product names may be trademarks of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251217568962/en/\nContacts\nPress Contacts:\nPeter Ajemian\nApple\npajemian@apple.com\nApple Media Helpline\nmedia.help@apple.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "06:50:00",
      "Source": "Motley Fool",
      "Title": "Prediction: This AI Stock Could Be the Next $4 Trillion Company in 2026",
      "URL": "https://finance.yahoo.com/m/f46acf11-d9c2-3202-9658-c4f99e042462/prediction%3A-this-ai-stock.html",
      "Content": "Prediction: This AI Stock Could Be the Next $4 Trillion Company in 2026\n\nWill Healy, The Motley Fool\nWed, December 17, 2025 at 2:50 PM PST 4 min read\n\nIn this article: GOOG\n\nMSFT\n\nNVDA\n\nAAPL\n\nKey Points Alphabet's market cap has come out of nowhere to surpass Microsoft's.\nMassive investments in its technology and the release of Gemini 3 have dramatically changed perceptions about the Google parent.\nAlphabet has the second-lowest P/E ratio in the \"Magnificent Seven.\"\n10 stocks we like better than Alphabet ›\n\nMany investors were shocked when Nvidia became the first company to achieve a $4 trillion market cap . The competition for the world's largest market cap was long a contest between Apple and Microsoft , so to see Nvidia emerge out of nowhere likely came as a surprise.\nNow, the question is, which company is the next to achieve a $4 trillion market cap? Today, Apple has already achieved that, but instead of Microsoft (which previously reached that point before retreating), I believe another emerging company will be the next one to reach this milestone. Here's why.\nThe next $4 trillion company Today, the stock most likely to reach $4 trillion and stay above that point is Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) . Currently, its market cap is at $3.7 trillion, surpassing Microsoft's current $3.5 trillion market cap.\nThat choice may come as a surprise to some investors. As recently as spring 2025, the Google parent's market cap was under $2 trillion.\nAlphabet stock had long been smaller than many of its \"Magnificent Seven\" peers, as the rise of ChatGPT weighed on the stock. When GPT-4 came out in 2023, investors soured on Google Search, and its market share had fallen below 90% for the first time in decades.\nAt that point, not only did ChatGPT offer more thorough and concise results, but it bypassed the advertising ecosystem that had long served as the primary source of the Google parent's revenue.\n\nThe company released Google Gemini later that year. Still, Gemini did not initially stand out from the likes of Claude, Grok, Copilot, and numerous other AI platforms trying to unseat ChatGPT.\nAlso, investors should remember that Alphabet has long worked to reduce its dependence on advertising for revenue. In recent years, Google Cloud has claimed an increasing share of the revenue. Still, even though Alphabet was an early pioneer in artificial intelligence (AI), these efforts did not seem to impress investors.\nWhat changed? However, Alphabet has long benefited from a massive level of liquidity and considerable free cash flows. In late 2024, it pledged to spend $75 billion on capital expenditures (capex) in 2025, later raising that to the $91 billion-$93 billion range.\nMuch of that spending has gone into improving legacy products. Search now incorporates AI-driven results, and Google Cloud offers upgraded infrastructure, multimodality AI models, and new tools for developers. Additionally, AI should help to make Waymo a source of revenue as it seeks to compete in the autonomous driving space.\n\nStory continues\nNonetheless, it seems to be the release of Gemini 3 in November that has captured the most attention recently. With improved reasoning, coding, and multimodal understanding, some analysts claim it is \"better than ChatGPT.\"\nWith that, the stock is up more than 60% over the last year, and more than 110% from its April low. Not surprisingly, almost half of that increase has occurred since October.\nMoreover, despite these gains, it is the second-cheapest Magnificent Seven stock. Its P/E ratio of around 30 is undercut only by Meta Platforms , a stock trading at 28 times earnings. That comparative discount could give investors all the more reason to continue buying stock in the Google parent.\nAlphabet at $4 trillion (and beyond) Between the relatively low valuation and the newfound success of Gemini 3, Alphabet appears likely to reach $4 trillion next.\nUltimately, investors like winners in cutting-edge technologies, and amid Alphabet's massive investments, having Gemini 3 perceived as \"better than ChatGPT\" positions Alphabet stock for higher moves.\n\nAdditionally, the AI pioneer is aggressively applying the technology to Google Cloud, and its efforts with Waymo could begin to bear fruit soon. As investors notice the stock as undervalued relative to peers, it continues to benefit from numerous tailwinds.\nAmid such successes, Alphabet may not only reach $4 trillion, but could challenge Apple and Nvidia for the world's largest market cap.\nShould you invest $1,000 in Alphabet right now? Before you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,955 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,089,460 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 968 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nWill Healy has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nPrediction: This AI Stock Could Be the Next $4 Trillion Company in 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "06:03:13",
      "Source": "MT Newswires",
      "Title": "Nasdaq Composite Logs Worst Day in Nearly 4 Weeks Amid Tech Selloff",
      "URL": "https://finance.yahoo.com/news/nasdaq-composite-logs-worst-day-220313643.html",
      "Content": "PREMIUM\nNasdaq Composite Logs Worst Day in Nearly 4 Weeks Amid Tech Selloff\n\nMT Newswires\nWed, December 17, 2025 at 2:03 PM PST 3 min read\n\nIn this article: ^IXIC\n\nORCL\n\n^DJI\n\n^GSPC\n\nCSCO\n\nThe Nasdaq Composite on Wednesday posted its worst day in nearly four weeks, with technology stocks\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "05:35:00",
      "Source": "Motley Fool",
      "Title": "Prediction: These 2 AI Darlings Will Be Worth $5 Trillion or More in 2026",
      "URL": "https://finance.yahoo.com/m/4977ae5d-77b1-3725-9640-7cc449c478a0/prediction%3A-these-2-ai.html",
      "Content": "Prediction: These 2 AI Darlings Will Be Worth $5 Trillion or More in 2026\n\nKeithen Drury, The Motley Fool\nWed, December 17, 2025 at 1:35 PM PST 5 min read\n\nIn this article: GOOG\n\nNVDA\n\nAMZN\n\nAAPL\n\nMSFT\n\nKey Points Nvidia's growth is expected to be rapid in 2026.\nAlphabet could see its valuation increase and strong growth continue to cross the $5 trillion mark.\n10 stocks we like better than Nvidia ›\nCurrently, there are no stocks with a $5 trillion market cap or greater. Nvidia (NASDAQ: NVDA) is valued at $4.3 trillion, and was recently valued at over $5 trillion before pulling back. Following up Nvidia are Apple at $4 trillion, Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) at $3.7 trillion, and Microsoft at $3.5 trillion. These are the only real candidates that can be worth $5 trillion or more, as Amazon is the fifth-largest company in the world at $2.6 trillion, which means its stock would have to more than double to breach the $5 trillion threshold.\nSo, of these four, which ones could be worth $5 trillion or more in 2026? I think there are only two real answers, and one may surprise you.\nReaching the $5 trillion valuation threshold won't be easy for one of these stocks It should come as no surprise that I think Nvidia will cross the $5 trillion valuation threshold in 2026. It's still growing at a rapid pace thanks to its best-in-class graphics processing units (GPU) technology stack. Demand for artificial intelligence computing power in data centers isn't slowing down, and it is shouldn't for some time. Nvidia believes global data center capital expenditures will reach $3 trillion to $4 trillion by 2030, up from $600 billion in 2025. Should that come to fruition, Nvidia would be a monster performer over the next five years, and 2026 is shaping up to be another phenomenal year.\n\nCEO Jensen Huang noted that the company is \"sold out\" of cloud GPUs, although he didn't elaborate on how far in the future they are sold out. Regardless, demand outpaces supply for its GPUs, which allows it to maintain high prices and lofty profit margins. This will fuel Nvidia's growth in 2026, and Wall Street analysts are expecting 48% growth again in fiscal year 2027 (ending January 2027) after rising a projected 63% in fiscal year 2026 (ending January 2026).\nWith growth like that, it won't take a whole lot for Nvidia to reach the $5 trillion threshold in 2026.\nHowever, it will take a bit more effort from Alphabet.\nAlphabet was a bit of a laggard in the AI arms race because competitors launched generative AI tools before it did. Furthermore, the initial release of its model was bad and caused several PR nightmares. However, Alphabet has addressed those issues and is now one of the leading providers of generative AI. In addition, Alphabet's core Google search business was spared from being broken up due to monopoly concerns earlier this year, and its future is now much clearer than it was just six months ago.\n\nStory Continues\nSince July 1, Alphabet's stock has been on fire, rising about 80%. However, for Alphabet's stock to be worth $5 trillion, it must rise at least 35% from today's levels.\nCan it do that?\nAlphabet's earnings growth has been impressive in recent quarters There are a few ways for a stock to rise: growing revenue and earnings, or an increase in valuation. Both of these are reasonable actions for a share price to rise, and Alphabet will likely need a boost from both to cross the $5 trillion threshold. In Q3, revenue rose 16% year over year, and diluted earnings per share (EPS) increased 35%. If Alphabet can keep up its EPS growth, then it could cross the $5 trillion threshold with growth alone. However, I think it could also use some help in the valuation department.\nDespite growing at the same pace or faster than Apple or Microsoft, Alphabet trades at a discount from a price-to-earnings perspective.\nShould Alphabet's stock receive a 35 times trailing earnings valuation, that would result in 14% growth alone.\nAlphabet will need all the help it can get to reach a $5 trillion valuation by the end of 2026, but I think it can do it. Even if it doesn't, I think it could easily reach that level by 2027.\n\nShould you buy stock in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,955 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,089,460 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 968 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nKeithen Drury has positions in Alphabet, Amazon, and Nvidia. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nPrediction: These 2 AI Darlings Will Be Worth $5 Trillion or More in 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "05:18:00",
      "Source": "Motley Fool",
      "Title": "3 Best Tech ETF Picks for 2026",
      "URL": "https://finance.yahoo.com/m/55aa3d2e-3691-3182-85b2-a3f3a0b548ec/3-best-tech-etf-picks-for-2026.html",
      "Content": "3 Best Tech ETF Picks for 2026\n\nDavid Dierking, The Motley Fool\nWed, December 17, 2025 at 1:18 PM PST 4 min read\n\nIn this article: NVDA\n\nMSFT\n\nAAPL\n\nKey Points Tech has been a strong outperformer, but it might be time to rethink investing in this sector.\nCompanies with strong fundamentals and more reasonable valuations present enticing opportunities.\nSoftware and digital payments are two subsectors that have the chance to outperform in 2026.\n10 stocks we like better than Amplify ETF Trust - Amplify Digital Payments ETF ›\n\nAs we wrap up 2025, tech stocks are again on pace to be one of the best-performing S&P 500 sectors. Fueled by strong demand for anything tied to artificial intelligence (AI) , investors steadily bought stocks and pushed the Nasdaq-100 index to several new all-time highs.\nWhile the \" Magnificent Seven \" stocks helped lead the way higher, 2026 may not be a repeat. If you're looking to invest in tech, it may be time to look beyond just Nvidia , Microsoft , and Apple . While these have been terrific-performing companies for a long time, there are a number of opportunities within the sector that may be flying under the radar.\nIn particular, undervalued areas of the tech sector could see better performance. The mega-cap companies, as well as chip stocks, have really gotten all the attention lately. Areas, such as software and digital payments, could enjoy renewed interest if investors begin seeking out more value-oriented stocks backed by healthy fundamentals.\nHere are three tech ETFs that I believe could outperform in the coming year.\nInvesco S&P 500 Equal Weight Technology ETF The Invesco S&P 500 Equal Weight Technology ETF (NYSEMKT: RSPT) invests in all of the big large-cap tech companies, but removes the concentration factor. It equally weights the roughly 70 tech stocks within the S&P 500 and rebalances quarterly to ensure it maintains its diversified exposure.\n\nRSPT is a great way to invest in the tech stocks that have led the market over the past several years, but broaden out the exposure in case the mega-cap names begin to underperform. We've already seen some hints that investors are worried about Magnificent Seven valuations. This ETF allows you to invest in the long-term tech narrative while mitigating some of that idiosyncratic risk.\nTop holdings currently include Western Digital , Micron Technology , and Teradyne .\nAmplify Digital Payments ETF Think of the one thing that almost every person does at least once a day (and probably multiple times): buy something! Years ago, people would pay for these purchases using cash or a check. Today, everybody uses credit cards or some form of digital payment, such as PayPal .\nThe Amplify Digital Payments ETF (NYSEMKT: IPAY) invests in all the major companies that provide payment services. Its top three holdings -- American Express , Visa , and MasterCard -- are all major credit card issuers, but other companies within the top 10 reflect how the entire sector is evolving. PayPal is more of a traditional online payment platform. Global Payments is a payment processor and software provider. Coinbase Global is a cryptocurrency trading platform.\n\nStory Continues\nThe transaction processing space is already a big cash flow generator. Adding the next-generation fintech evolution to it provides a great long-term growth opportunity.\niShares Expanded Tech-Software Sector ETF Ever since coming out of the 2022 bear market, software has been a tech laggard. The AI boom had investors gravitating toward semiconductor stocks, leaving certain segments of the sector underbought and unloved.\nWithin the iShares Expanded Tech-Software Sector ETF (NYSEMKT: IGV) , there are a lot of high-quality companies with strong revenue growth and solid margins that could finally see some of that value get unlocked in 2026. Top 10 holdings include Palantir Technologies , Salesforce , Intuit , and ServiceNow alongside industry heavyweight Microsoft.\n\nSoftware is intriguing because it covers so many areas within tech. IGV is essentially an investment in cloud computing, enterprise automation, cybersecurity, and AI productivity tools. There's constant demand for performance improvement and staying ahead of the latest threats. That makes a lot of these companies steady cash flow generators that can actually add some stability to a portfolio.\nWith software lagging behind the Nasdaq-100 in 2025, there's some catch-up potential in 2026.\nShould you invest $1,000 in Amplify ETF Trust - Amplify Digital Payments ETF right now? Before you buy stock in Amplify ETF Trust - Amplify Digital Payments ETF, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Amplify ETF Trust - Amplify Digital Payments ETF wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,955 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,089,460 !*\nNow, it’s worth noting Stock Advisor’s total average return is 968 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nAmerican Express is an advertising partner of Motley Fool Money. David Dierking has positions in Apple. The Motley Fool has positions in and recommends Apple, Intuit, Mastercard, Microsoft, Nvidia, Palantir Technologies, PayPal, Salesforce, ServiceNow, and Visa. The Motley Fool recommends Coinbase Global and Teradyne and recommends the following options: long January 2026 $395 calls on Microsoft, long January 2027 $42.50 calls on PayPal, short December 2025 $75 calls on PayPal, and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\n3 Best Tech ETF Picks for 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "03:44:31",
      "Source": "Barchart",
      "Title": "Dear BlackBerry Stock Fans, Mark Your Calendars for December 18",
      "URL": "https://finance.yahoo.com/m/65870a7d-29d5-39df-8a1a-84c9bf0ed0c8/dear-blackberry-stock-fans%2C.html",
      "Content": "Dear BlackBerry Stock Fans, Mark Your Calendars for December 18\n\nAnushka Mukherji\nWed, December 17, 2025 at 11:44 AM PST 5 min read\n\nIn this article: BB\n\nAAPL\n\nOnce a household name in smartphones, BlackBerry (BB) famously lost its grip on the booming mobile market to Apple’s (AAPL) iPhone and Android-powered rivals. After walking away from handset manufacturing altogether, the company reinvented itself as a software-driven player focused on Internet of Things (IoT) and cybersecurity solutions. Even as competition in the cybersecurity software space continues to heat up, BlackBerry stock has still managed a respectable run in 2025, albeit with some volatility, supported by solid financial performance that has helped keep investor confidence intact.\n\nThat optimism was reinforced in September, when BlackBerry delivered a strong fiscal 2026 second-quarter earnings report, highlighted by particularly robust results from its QNX segment, which quickly caught the market’s attention. Now, the company is preparing to report its third-quarter earnings on Dec. 18, and Wall Street is heading into the release expecting meaningful gains in the upcoming quarter. With that backdrop, here’s a closer look at what lies ahead for BlackBerry.\nMore News from Barchart While AI Panic Struck Applied Digital (APLD) Stock, the Smart Money Has a Different View\nJPMorgan Says to Sell NVDA March $160 Puts. Should You Actually?\nCathie Wood Keeps Buying the Dip in CoreWeave Stock. Should You?\nGet exclusive insights with the FREE Barchart Brief newsletter. Subscribe now for quick, incisive midday market analysis you won't find anywhere else.\n\nAbout BlackBerry Stock Founded in 1984, BlackBerry built its legacy as a pioneer of secure mobile communication, once dominating the smartphone market with its iconic keyboard devices. Headquartered in Waterloo, Ontario, the company has since exited the handset business completely and reinvented itself as a software-first enterprise focused on mission-critical technologies. Today, BlackBerry supports enterprises and governments with intelligent software and services that keep the world running behind the scenes.\n\nThe company’s high-performance foundational software empowers top automakers and industrial leaders to build transformative applications, open up new revenue opportunities, and introduce innovative business models, while maintaining the highest standards of safety, security, and reliability. Its QNX operating system is a key revenue engine, embedded in millions of vehicles worldwide and increasingly central to next-generation automotive and industrial systems.\nAlongside this, BlackBerry’s cybersecurity business delivers endpoint protection, secure communications, and threat intelligence to enterprises and governments, positioning the company as a behind-the-scenes enabler of safety, security, and connectivity in an increasingly digital world. The company is currently valued at a market capitalization of roughly $2.6 billion.\n\nStory Continues\nAfter surging an impressive 32.34% over the past year, BlackBerry’s rally has lost some steam more recently as investors weigh uncertainties around its ongoing shift toward cybersecurity and IoT, along with renewed debate over the company’s long-term direction. Even so, the stock has held up well in 2025, rising a solid 12.04% for the year, just a notch below the broader S&P 500 Index's ($SPX) 14.49% gain during the same stretch.\nA Look Inside BlackBerry’s Q2 Performance On Sept. 25, BlackBerry delivered a standout second-quarter earnings report that showcased clear operational progress and marked its second consecutive quarter of GAAP profitability. The results exceeded expectations across the board and sparked a strong market reaction, with the stock surging nearly 9% on the day of the announcement, followed by another 6.7% gain on Sept. 26.\n\nFor the quarter, BlackBerry reported revenue of $129.6 million, up 3% year-over-year (YOY), comfortably topping Wall Street’s $122 million forecast and landing above management’s own guidance. Strength was evident across BlackBerry’s key businesses, led by its QNX division, which focuses on embedded software for automotive and IoT applications. QNX generated $63.1 million in revenue, representing a robust 15% YOY increase and coming in ahead of guidance.\nAlso, the segment delivered an impressive 32% adjusted EBITDA margin, while its adjusted gross margin remained flat at a healthy 83%, highlighting the durability and profitability of the platform. The company’s Secure Communications segment, which includes UEM, SecuSUITE, and AtHoc, also posted solid results, generating $59.9 million in revenue during the quarter.\n\nImportantly, Secure Communications' annual recurring revenue (ARR) continued to trend higher, rising both YOY and sequentially to $213 million, signaling improving momentum and revenue visibility. Profitability further strengthened BlackBerry’s investment case. The company posted GAAP earnings of $0.02 per share, a sharp reversal from a loss of $0.03 per share in the year-ago quarter.\nOn an adjusted basis, earnings came in at $0.04 per share, well ahead of Wall Street’s $0.01 estimate. Additionally, BlackBerry returned $20 million to shareholders through the repurchase of roughly five million common shares during the quarter, while total cash, cash equivalents, and short- and long-term investments declined $18.4 million sequentially to $363.5 million.\n\nDear BlackBerry Investors, Mark Your Calendars for Dec. 18 Looking ahead to the third quarter, BlackBerry’s management has laid out an upbeat outlook. The company expects revenue to come in between $132 million and $140 million, with the fast-growing QNX segment projected to deliver $66 million to $70 million in revenue. Meanwhile, Secure Communications revenue is forecast to land in the $60 million to $64 million range. On the bottom line, BlackBerry sees adjusted earnings of $0.02 to $0.04 per share, signaling continued progress on profitability.\n\nWith that backdrop, the former smartphone pioneer is set to report its third-quarter earnings after the market closes on Thursday, Dec. 18, and anticipation is clearly building. Options markets are pricing in a sizable move of 10.18% around the earnings release, reflecting heightened investor interest. Looking further out, analysts covering the stock expect third-quarter earnings of $0.03 per share, which would represent a striking 200% YOY improvement and underscore the momentum behind BlackBerry’s turnaround.\nHow Are Analysts Viewing BlackBerry Stock? Despite the buzz around BlackBerry’s upcoming earnings, Wall Street’s overall tone remains somewhat cautious. The stock currently carries a consensus “Hold” rating, reflecting a wait-and-see stance among analysts. Of the seven analysts covering the name, just one is bullish enough to rate it a “Strong Buy,” while the other six are sitting on the sidelines with “Hold” recommendations.\nRegardless, room for upside is still possible. The average price target of $5.06 points to a potential gain of 19.34% from current levels. At the same time, the most optimistic Street estimate pegs the stock at $6, implying upside of up to 41.51% if BlackBerry delivers on expectations.\nOn the date of publication, Anushka Mukherji did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "03:07:25",
      "Source": "MT Newswires",
      "Title": "Equity Markets Fall Intraday as Tech Sector Slides",
      "URL": "https://finance.yahoo.com/news/equity-markets-fall-intraday-tech-190725283.html",
      "Content": "PREMIUM\nEquity Markets Fall Intraday as Tech Sector Slides\n\nMT Newswires\nWed, December 17, 2025 at 11:07 AM PST 2 min read\n\nIn this article: ^GSPC\n\nORCL\n\n^DJI\n\n^IXIC\n\nAAPL\n\nUS benchmark equity indexes were lower intraday amid a notable decline in the technology sector, whi\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nCondiciones y Política de privacidad\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "02:31:15",
      "Source": "24/7 Wall St.",
      "Title": "Investors Love Warren Buffett, So Why Aren’t They Listening to His Warning?",
      "URL": "https://finance.yahoo.com/m/09274f6a-92c8-3b52-ab66-6454ea5768ba/investors-love-warren.html",
      "Content": "Investors Love Warren Buffett, So Why Aren’t They Listening to His Warning?\n\nRich Duprey\nWed, December 17, 2025 at 10:31 AM PST 4 min read\n\nIn this article: BRK.A\n\nBRK-B\n\nAAPL\n\n^GSPC\n\nQuick Read Warren Buffett has been a net seller of stocks for 12 straight quarters. Berkshire Hathaway ( BRK-A , BRK-B ) now holds a record $382B in cash.\nBerkshire reduced its Apple stake from 50% of the portfolio to 20% over the past year.\nThe Buffett Indicator sits at 223%, signaling extreme overvaluation at 77% above trend line.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality. Read more here .\n\nWarren Buffett's remarkable success over six decades has turned Berkshire Hathaway ( NYSE:BRK-A )( NYSE:BRK-B ) into a phenomenon with something close to a cult following. Since assuming the helm of Berkshire in the mid-1960's, the \"Oracle of Omaha\" has delivered better than 5 million percent returns, about 20% annually or twice those of the S&P 500 over the period.\nEvery year, thousands of investors travel to Omaha for the annual shareholder meeting, often called the \"Woodstock for Capitalists,\" to hear Buffett share his insights on investing and business. As Buffett's long tenure as CEO nears its end -- he plans to step down by the end of the year -- many fans continue to admire him.\nYet, despite their adoration, investors appear to be ignoring the warning he has been giving about the stock market.\n\nBuffett's Actions Speak Louder Than Words Now, Buffett has not issued any explicit warnings about an impending market crash. He hasn't said, don't buy stocks. However, his portfolio moves raise clear concerns.\nFor three consecutive years -- 12 straight quarters -- Berkshire Hathaway has been a net seller of stocks. The company sold more equities than it bought, with net sales reaching billions of dollars in recent periods. This pattern has built a record cash pile of approximately $382 billion.\n\nBuffett has made occasional purchases, including new stakes in tech names, but few major aggressive bets. For example, he has unloaded shares in Apple ( NASDAQ:AAPL ) reducing his stake from about half of the portfolio down to 20%, but he bought over 5 million shares in UnitedHealth Group ( NYSE:UNH ) in the second quarter this year.\nAnalysts interpret this cash buildup as preparation for opportunities when prices drop, indicating he is uncomfortable with current market valuations.\nA Classic Value Approach in Action This strategy aligns with Buffett's core value investing philosophy of not overpaying for stocks. As he put it, \"It's far better to buy a wonderful company at a fair price than a fair company at a wonderful price.\" By holding massive cash reserves, Berkshire positions itself to deploy capital advantageously during downturns and buy numerous \"wonderful\" stocks.\n\nStory continues\nInvestors may question how to identify overvaluation today. While AI-driven gains have propelled stocks --and stock valuations -- higher, echoing past tech booms, many of these companies are supported by genuine demand growth that continues to grow.\nBuffett, though, has provided investors with guidance through key metrics. In a 2001 Fortune article, he described the ratio of total U.S. stock market capitalization to GDP as \"probably the best single measure of where valuations stand at any given moment.\"\n\nA Persistent Red Flag Known as the Buffett Indicator, this metric divides total market cap -- often using the Wilshire 5000 as a proxy -- by U.S. GDP. Readings above 100% indicate potential overvaluation, and below that -- around 70% to 80% -- undervaluation. It should be noted that Buffett has since backed away from relying solely on one measure, instead using a more holistic approach to determine valuation. However, even Buffett himself can't be ignoring the flashing red lights of what the Buffett Indicator is signaling today.\n\nCurrent readings are at record highs. Today, the Wilshire 5000 shows a total market capitalization of around $68.7 trillion while U.S. GDP currently sits around $30.5 trillion, or about 223% -- some 77% above its trend line. Historically, levels above 200% have signaled extreme overvaluation and \"playing with fire,\" as Buffett once warned. Even adjusted versions exceed the long-term averages near 100%.\nThese figures indicate stocks have far outpaced economic output, raising the risk of a correction if growth or earnings fail to justify prices.\nKey Takeaway Every sign points to Buffett viewing the market as extremely overvalued, prompting his shift to cash. His consistent net selling over three years and record hoard underscore patience for better entry points. Investors who ignore Buffett's warnings do so at their own peril.\nData Shows One Habit Doubles American’s Savings And Boosts Retirement Most Americans drastically underestimate how much they need to retire and overestimate how prepared they are. But data shows that people with one habit have more than double the savings of those who don’t.\nAnd no, it’s got nothing to do with increasing your income, savings, clipping coupons, or even cutting back on your lifestyle. It’s much more straightforward (and powerful) than any of that. Frankly, it’s shocking more people don’t adopt the habit given how easy it is .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "00:51:58",
      "Source": "GuruFocus.com",
      "Title": "Apple Plans Major iPhone Expansion as Global Sales Accelerate",
      "URL": "https://finance.yahoo.com/news/apple-plans-major-iphone-expansion-165158883.html",
      "Content": "Apple Plans Major iPhone Expansion as Global Sales Accelerate\n\nMoz Farooque ACCA\nWed, December 17, 2025 at 8:51 AM PST 1 min read\n\nIn this article: AAPL\n\nThis article first appeared on GuruFocus .\nApple Inc. ( AAPL , Financials ) is expanding its iPhone lineup as worldwide sales show signs of improvement. Early indicators suggest the iPhone 17 is performing well across several regions, including China, giving Apple room to push for growth over the next two years.\n\nWarning! GuruFocus has detected 4 Warning Sign with APP.\nIs AAPL fairly valued? Test your thesis with our free DCF calculator.\nCurrently, Apple sells five iPhone models globally, though industry watchers expect that number to rise by 2027. Reports citing internal roadmaps and supply-chain sources suggest Apple could introduce as many as seven models by that time, though the company has not officially confirmed such an expansion and the final lineup remains subject to change.\nOne of the most anticipated developments is Apple's first foldable iPhone, widely rumored to arrive in September 2026. According to supply-chain and concept reports, the device may unfold to roughly the size of an iPad mini, representing Apple's most significant iPhone design shift in years. That said, Apple has not confirmed the form factor, specifications, or final design.\n\nLooking further ahead, Apple is also expected to mark the iPhone's 20th anniversary in 2027. Concept leaks and analyst speculation point to a bold redesign, potentially featuring a near-edge-to-edge display, but these descriptions are based on rumors rather than official disclosures .\nApple's push to broaden its product range reflects intensifying competition and rising expectations around on-device AI features, including a more capable Siri. With the iPhone still accounting for roughly half of Apple's revenue, the stakes remain high.\nAs Apple prepares for its next major product cycle, investors will closely watch upcoming product events for clarity on how much of this reported roadmap ultimately becomes reality.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "00:51:33",
      "Source": "Investor's Business Daily",
      "Title": "Apple Seen Moving From AI Laggard To Leader In 2026",
      "URL": "https://finance.yahoo.com/m/3d64dab4-f7d8-3490-89cd-14c757b3a8c2/apple-seen-moving-from-ai.html",
      "Content": "Apple Seen Moving From AI Laggard To Leader In 2026\n\nPATRICK SEITZ\nWed, December 17, 2025 at 8:51 AM PST 2 min read\n\nIn this article: AAPL\n\nGOOG\n\nInvestment bank Morgan Stanley sees Apple becoming an AI leader in 2026, starting with a new Siri digital assistant.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "00:37:00",
      "Source": "Zacks",
      "Title": "Services Rides on Apple TV and Arcade: What's Ahead for Apple Stock?",
      "URL": "https://finance.yahoo.com/news/services-rides-apple-tv-arcade-163700702.html",
      "Content": "Services Rides on Apple TV and Arcade: What's Ahead for Apple Stock?\n\nAniruddha Ganguly\nWed, December 17, 2025 at 8:37 AM PST 3 min read\n\nIn this article: AAPL\n\nDIS\n\nApple AAPL has been riding on a strong Services business, driven by strong Apple TV content and an expanding Apple Arcade game portfolio. In fiscal 2025, the Services business accounted for 26.2% of net sales with revenues growing 14% year over year, better than 13% year-over-year growth in fiscal 2024. Strong Apple TV content and an expanding Apple Arcade game portfolio have been catalysts for the Services business over the past couple of fiscal years.\n\nApple’s endeavor to continuously expand its Arcade game portfolio is expected to keep subscribers engaged in the upcoming holiday season. The latest farming expansion, which is massive, is expected to keep players engrossed with Sneaky Sasquatch . SpongeBob: Patty Pursuit 2 , PowerWash Simulator , Cult of the Lamb Arcade Edition, Subway Surfers+ and NARUTO: Ultimate Ninja STORM+ are the new games that joined Apple Arcade in December. Cozy Caravan , Sago Mini Jinja’s Garden , True Skate+ and Potion Punch 2+ are the new games set to join in January 2026.\n\nApple’s focus on expanding sports content is noteworthy. Beginning in 2026, all Major League Soccer (MLS) games will be available to stream for Apple TV subscribers at no additional cost. Apple TV has become the exclusive new broadcast partner for Formula 1 in the United States in 2026 under a five-year partnership. The introduction of Apple TV and the Peacock bundle from Oct. 20 is expected to drive subscriber base.\n\nApple Faces Tough Competition in Streaming Market AAPL is facing stiff competition from the likes of Disney DIS and Netflix NFLX in the streaming space.\n\nDisney’s streaming services — Disney+ and Hulu — now reach 191 million subscribers. The launch of the standalone ESPN DTC service on Aug. 21, 2025, marks a major milestone in repositioning Disney’s ESPN as a fully digital sports powerhouse. Content investments in Marvel and Star Wars franchises are driving strong box office results for Disney.\n\nNetflix has set an ambitious target to double its revenues by 2030 and reach a $1 trillion market capitalization, supported by a diversified content strategy, including international programming, live events, and gaming initiatives. For the fourth quarter, Netflix projects $11.96 billion in revenue with 16.7% growth and a 23.9% operating margin, featuring major releases including Stranger Things' final season and NFL Christmas games. Netflix raised its full-year free cash flow forecast to $9 billion from $8-8.5 billion.\n\nAAPL’s Share Price Performance, Valuation & Estimates Apple shares have jumped 39.7% in the past six-month period, outperforming the broader Zacks Computer and Technology sector’s return of 22.2%.\n\nStory Continues\nApple Stock Beat Sector in 6 Months\n\nImage Source: Zacks Investment Research\nThe AAPL stock is trading at a premium, with a forward 12-month price/earnings of 32.98X compared with the broader sector’s 27.76X. AAPL has a Value Score of F.\n\nAAPL Stock is Overvalued\n\nImage Source: Zacks Investment Research\n\nThe Zacks Consensus Estimate for fiscal 2026 earnings is pegged at $8.12 per share, up by 3 cents over the past 30 days, suggesting 8.9% growth from fiscal 2025’s reported figure.\n\nApple Inc. Price and Consensus Apple Inc. price-consensus-chart | Apple Inc. Quote\n\nApple currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nApple Inc. (AAPL) : Free Stock Analysis Report\nNetflix, Inc. (NFLX) : Free Stock Analysis Report\nThe Walt Disney Company (DIS) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "00:31:00",
      "Source": "Motley Fool",
      "Title": "My Surprising Top \"Magnificent Seven\" Stock Pick for 2026",
      "URL": "https://finance.yahoo.com/m/62bdc046-5e09-3421-90c2-479d4473424a/my-surprising-top.html",
      "Content": "My Surprising Top \"Magnificent Seven\" Stock Pick for 2026\n\nStefon Walters, The Motley Fool\nWed, December 17, 2025 at 8:31 AM PST 4 min read\n\nIn this article: AMZN\n\nTSLA\n\n^GSPC\n\nNVDA\n\nAAPL\n\nKey Points Investors have become impatient with the lack of immediate results from Amazon's increased spending.\nAmazon is adding more computing capacity to Amazon Web Services.\nAdvertising was Amazon's fastest-growing segment in the third quarter.\n10 stocks we like better than Amazon ›\nThe \" Magnificent Seven \" is the name given to the group of Nvidia , Apple , Microsoft , Alphabet , Meta , Tesla , and Amazon (NASDAQ: AMZN) . These seven companies are bundled together because they have driven much of the stock market's gains in recent years. As of Dec. 15, they are seven of the world's top nine most valuable companies and represent nearly 35% of the S&P 500 .\nSo far this year, every \"Magnificent Seven\" stock has produced double-digit returns except for one: Amazon.\nOnce the face of growth stocks, Amazon has lagged over the past year, frustrating its investors along the way. Despite that retreat, Amazon may be positioned to bounce back in 2026.\nWhy has Amazon's stock been lagging? There hasn't been one issue that's caused Amazon's underperformance. It's more a combination of factors. First, Amazon has spent a lot of money this year, with capital expenditures (capex) of around $90 billion through the first nine months of 2025.\nGiven how much Amazon has been spending (mostly on AI infrastructure), investors have been wanting more to show for it -- especially when it comes to Amazon Web Services (AWS) growth. With many of the \"Magnificent Seven\" stocks making big splashes in AI, some people viewed Amazon as falling behind in the race.\nAmazon's heavy spending has weighed on its free cash flow, and that's not something investors typically like without seeing more immediate results. Add in how expensive Amazon's stock has been, and there was little room for error in many investors' eyes.\nAWS is positioning itself for the future AWS may not have been producing the results that we've grown used to seeing over the years, but investors jumping ship seems like a premature overreaction (which is no surprise if you know investors). Yes, AWS has been losing market share to Microsoft's Azure and Alphabet's Google Cloud, but it's still the world's largest cloud platform by far.\n\nCloud platforms are, and will continue to be, crucial to AI training and scaling. That's why Amazon has been focusing so much on building out more infrastructure and adding computing capacity. It has added more than 3.8 gigawatts in the past 12 months and plans to double its capacity through 2027.\n\nStory Continues\nThis investment is noteworthy because, according to calculations from investment bank Oppenheimer , each incremental gigawatt of capacity could add $3 billion in revenue. The high capex might be weighing on Amazon's financials right now, but it's poised to pay off in the long term.\nAmazon has an underrated profit machine There's no doubt that AWS is Amazon's profit engine, accounting for most of its operating income. However, advertising is a high-margin business that has been growing steadily over the past couple of years.\nOn one hand, Amazon has access to data from its millions of customers and Prime members, making it more effective at helping advertisers with targeted ad campaigns. They know what customers buy, when they buy it, what they watch, what they listen to, what they browse, and other information that allows advertisers to target with greater precision.\nOn the other hand, Amazon's massive reach means it has plenty of places to set these ads. Whether it's online, when you search for a specific product, stream something on Prime Video, watch Twitch, or listen to music, there's no shortage of real estate for advertisers looking to reach potential customers. Amazon also announced that it recently struck partnerships that allow its advertisers to buy ad space on Netflix , Spotify , and SiriusXM .\n\nIn the third quarter, Amazon's advertising services revenue grew 24% to $17.7 billion, outpacing its revenue from subscriptions ($12.5 billion). Beyond revenue growth, advertising is a high-margin business that can help Amazon boost its overall profitability. I expect the momentum to continue in 2026.\nShould you invest $1,000 in Amazon right now? Before you buy stock in Amazon, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Amazon wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,955 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,089,460 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 968 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nStefon Walters has positions in Apple and Microsoft. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Netflix, Nvidia, Spotify Technology, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nMy Surprising Top \"Magnificent Seven\" Stock Pick for 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "00:23:58",
      "Source": "MT Newswires",
      "Title": "US Big Tech Set as Main Beneficiaries of AI Monetization Inflection in 2026, Wedbush Says",
      "URL": "https://finance.yahoo.com/news/us-big-tech-set-main-162358858.html",
      "Content": "PREMIUM\nUS Big Tech Set as Main Beneficiaries of AI Monetization Inflection in 2026, Wedbush Says\n\nMT Newswires\nWed, December 17, 2025 at 8:23 AM PST 1 min read\n\nIn this article: GOOG\n\nNVDA\n\nAAPL\n\nMSFT\n\nMETA\n\nUS big tech companies are set to be primary beneficiaries of an expected inflection point for artifi\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "00:13:06",
      "Source": "MT Newswires",
      "Title": "IT Hardware Sector Faces Cyclical Challenges in 2026, Opportunities Remain, Morgan Stanley Says",
      "URL": "https://finance.yahoo.com/news/hardware-sector-faces-cyclical-challenges-161306678.html",
      "Content": "PREMIUM\nIT Hardware Sector Faces Cyclical Challenges in 2026, Opportunities Remain, Morgan Stanley Says\n\nMT Newswires\nWed, December 17, 2025 at 8:13 AM PST 1 min read\n\nIn this article: WDC\n\nSTX\n\nAAPL\n\nSNX\n\nTDC\n\nIT hardware companies face growing cyclical challenges in 2026, but pockets of opportunity remain, M\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "23:35:15",
      "Source": "MT Newswires",
      "Title": "Jefferies Adjusts Price Target on Apple to $283.36 From $246.99, Maintains Hold Rating",
      "URL": "https://finance.yahoo.com/news/jefferies-adjusts-price-target-apple-153515499.html",
      "Content": "PREMIUM\nJefferies Adjusts Price Target on Apple to $283.36 From $246.99, Maintains Hold Rating\n\nMT Newswires\nWed, December 17, 2025 at 7:35 AM PST\n\nIn this article: AAPL\n\nApple (AAPL) has an average rating of overweight and mean price target of $291.92, according to anal\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "23:03:39",
      "Source": "24/7 Wall St.",
      "Title": "Why Sam Altman Sees Apple and Not Google as its Top AI Rival",
      "URL": "https://finance.yahoo.com/m/6a2d7130-a8fd-3494-a708-8da1e3ea5b9d/why-sam-altman-sees-apple-and.html",
      "Content": "Why Sam Altman Sees Apple and Not Google as its Top AI Rival\n\nJoey Frenette\nWed, December 17, 2025 at 7:03 AM PST 4 min read\n\nIn this article: GOOG\n\nAAPL\n\nOPAI.PVT\n\nQuick Read Sam Altman views Apple as OpenAI’s top AI rival despite Google’s recent Gemini 3.0 momentum.\nApple pays only $1B annually to use Gemini and plans to integrate it into Siri in 2026.\nApple’s Gemini-powered Siri could become the default iPhone AI option over ChatGPT.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality. Read more here .\n\nOpenAI's top boss, Sam Altman, has been quite busy of late responding to Google Gemini 3.0 with a \"code red\" of sorts. And while the latest ChatGPT 5.2 seems to be a worthy rival, questions linger as to whether OpenAI is about to lose its AI lead to the likes of Google and its parent company, Alphabet ( NASDAQ:GOOG ). Arguably, the torch has already passed after Gemini 3.0 garnered spectacular feedback while powering impressive App Store downloads.\nThough Google has made massive ground over the past year, I still think it's a tad too early in the game to deem Google as the winner of the AI race, even though Gemini 3.0's strong launch has made a case for switched chatbots. While Google is an AI force to be reckoned with, I found it quite interesting that Altman expressed his view that it's Apple ( NASDAQ:AAPL ), a firm it's partnered up with to offer ChatGPT via Apple Intelligence, as opposed to Google, which could be the most significant AI rival, at least over the long term, for the GPT-maker.\n\nSam Altman is right to acknowledge Apple's AI abilities Sure, such a comment seems laughable for now, especially given where Apple Intelligence currently stands in the AI race. However, as we head into 2026, Apple is going to be launching what could be its biggest AI offering to date: Siri with a Gemini boost. Of course, in the longer term, it might be more about Apple's dominance in software and hardware that makes Apple a serious contender in the AI war.\n\nThough it may seem far-fetched to think that the Cupertino giant is a bigger threat than the likes of Google, which has all the right tools in place to extend its lead in the race, I certainly wouldn't doubt Apple CEO Tim Cook and company as they look to learn from the mistakes of other tech titans to offer an AI experience that's simply better than what most other firms are currently offering. In a prior piece, I shone a bright light on the great deal that Apple was getting to use Gemini.\nJust $1 billion per year to use Gemini and add to it seems like a great deal that only Apple has the leverage to make. The most exciting thing, I believe, is what else Apple adds on top of Gemini. As the AI experience becomes more about what's added on top of a large language model (LLM), it will be very interesting to see how Apple's take on AI will be in 2026.\n\nStory Continues\nApple's big AI upgrades are coming. It might be the biggest AI story of 2026 My guess is the Gemini experience will be made that much richer with Apple's polishings added on top. Either way, Apple users are going to get a premium and more exclusive AI product pretty much for free. And that might power a device refresh cycle, the likes of which we may not have witnessed since the COVID lockdown days. Personally, I think Apple's new Gemini-powered Siri could be a hit. And it might cause further competitive pressures for OpenAI.\n\nOf course, ChatGPT is likely to stick around as an option for iPhone users, but if it's not the default option, things could have the potential to get very sticky for OpenAI as it looks to fight off a new threat in Apple, as it continues to do its best to keep up with Google and Gemini. Add the OpenAI device that former Apple CDO Jony Ive has been working on into the equation, and Apple stands out as a top foe in AI consumer hardware.\nAnd with OpenAI also looking to make strides in AI chips, Apple and its M-series chips also stand out as a top rival. If Apple's Siri upgrade goes well, perhaps it's M-series chips in Apple's Private Cloud Compute and A-series chips on the edge that we'll all be using as we stay in that Apple ecosystem.\nData Shows One Habit Doubles American’s Savings And Boosts Retirement Most Americans drastically underestimate how much they need to retire and overestimate how prepared they are. But data shows that people with one habit have more than double the savings of those who don’t.\nAnd no, it’s got nothing to do with increasing your income, savings, clipping coupons, or even cutting back on your lifestyle. It’s much more straightforward (and powerful) than any of that. Frankly, it’s shocking more people don’t adopt the habit given how easy it is .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:47:00",
      "Source": "Yahoo Finance Video",
      "Title": "Memory chip prices could pressure smartphone shipments in 2026: RPT",
      "URL": "https://finance.yahoo.com/video/memory-chip-prices-could-pressure-144700650.html",
      "Content": "Memory chip prices could pressure smartphone shipments in 2026: RPT\n\nYahoo Finance Video and Julie Hyman\nWed, December 17, 2025 at 6:47 AM PST\n\nIn this video: MU\n\nSSNLF\n\nAAPL\n\nCounterpoint Research expects smartphone shipments to fall by 2.1% in 2026 over rising memory chip costs as more companies invest billions into AI infrastructure buildouts.\nCounterpoint Research senior research analyst Yang Wang and Bloomberg Intelligence analyst Mandeep Singh come on Morning Brief to expand on these global tech trends.\nTo watch more expert insights and analysis on the latest market action, check out more Morning Brief .\n\nVideo Transcript\n\n00:00 Speaker A\nLet's talk about the sort of ripple effect of the AI buildout and in sort of Micron being a case study, so to speak. And Yang, you know a lot about this because we have seen memory chip prices go through the roof because a lot of memory is sort of being dedicated and diverted to the AI build out now. You guys have been doing research on that. So what effect has that been having?\n00:30 Yang\nWell, I mean, first of all, I mean, we we will be looking very closely at the Micron earnings, especially because they've announced recently that they will be winding down the crucial business unit which caters to consumer electronic segment and smartphones. Uh will be the first to get hit.\n00:53 Yang\nNow, come, zooming out a bit. You, when we look at the key memory components such as DRAM, prices have gone up 70% in this quarter, and we've we're projecting it to go up another 40% next quarter. So, what that directly means is that the build cost or bill of materials for smartphones, they have already increased 20 to 30% for, you know, the low-end devices below $200.\n01:29 Yang\nBut even for think of the flagship devices from from Apple, from Samsung, even those prices have will be going up 10 to 15 um percent. Now, what is the compounding effect, right? It means that costs are going up. And then, you know, companies have to make a tough decision, will they bite the the bullet and take the um, take take the additional cost or will they choose, which in our opinion is a likely case, pass through the the cost to consumers.\n02:07 Yang\nAnd in an environment where um prices are high, inflation isn't really coming down yet, it's going to be a tough decision for consumers whether they're going to upgrade or whether they're going to postpone. And in our, in our understanding, through our consumer surveys, they're very likely to to postpone and that means it's leads to our our latest forecast that the smartphone shipments for the global market next year is going to be coming down 2.1%.\n02:44 Yang\nAnd that is a big um delta from uh from what has happened in this year, which the market grew 3%. So a a swing of 5% is going to be painful for all industry players in the smartphone industry.\n03:00 Speaker A\nYang, when's the last time there was a decline in shipments year over year?\n03:04 Yang\nWell, I mean, the last time we had a big decline was in 2022, 23, when obviously on the onset of the the Ukraine war, you had inflation and uh central banks hiking rates. So, of course, that, you know, there was also the compounded effect of a massive amount of pent up demand working from home. So there was a lot of um device refreshes ahead of it.\n03:41 Yang\nSo, entering into that cycle, you had a lot of um supply chain pains, but on the demand side, it created. So, luckily, and in looking at what's going to turn out next year, we see demand remaining fairly resilient, and that's mainly because the trading environment has been fairly stable. I mean, the growth engines, emerging markets, you look at big markets like India, Southeast Asia, they're still on a growth trajectory.\n04:16 Yang\nUm the US, you know, China, Europe remaining stable, and let's not forget, um US, China, um the the one year uh trade war or tech war truce. And that kind of paves a stable environment for our industry. So thankfully, we're not get going to get a demand collapse. But yeah, I mean, on the, who knows what happens in a year's time when, you know, we uh we hopefully get out of the memory squeeze cycle, but then geopolitics could rear its ugly tail again.\n05:08 Speaker A\nYes, most definitely. And who knows also the AI build out what other kind of knock on effects it will have. And Mandeep, I want to bring you back to to pose that question to you because we just heard Yang talking about the higher prices of memory chips, um and the effect that could have smartphones, but I'm also curious for the AI build out itself. Um, you know, are we going to see price volatility in all of the things needed to go into that build out and have the major players really insured their supply or are we going to see a lot of volatility there as well?\n06:01 Mandeep\nYeah, I mean, you could see, you know, supply shortages and certain components at a given point of time, but to my mind, you know, the buildout is more or less uh you know, certain in the sense like that three trillion number in aggregate spending through 2030 does sound very plausible given what we have seen in terms of the intent around AI investments and uh frankly speaking, the ROI that people are seeing when it comes to the generative AI use cases, whether it's coding agents or customer service.\n07:00 Mandeep\nSo from that perspective, you know, the buildout will take place. It's just a question of whether, you know, the neo clouds uh aren't able to raise funding at a given point of time because of concerns around excessive leverage or, you know, there could be some component shortages, which is why CoreWeave had to push out its data center going live last quarter. So all those are part of the build out, but there is no doubt that, you know, uh companies are committed when it comes to uh deploying AI and and they do need the compute uh which is pretty much uh a requirement when it comes to uh doing inferencing uh on these large language models.\n07:53 Speaker A\nYeah.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:28:45",
      "Source": "Yahoo Finance",
      "Title": "The stock market is being powered by 10 stocks that are fueling AI bubble fears",
      "URL": "https://finance.yahoo.com/news/the-stock-market-is-being-powered-by-10-stocks-that-are-fueling-ai-bubble-fears-142845016.html",
      "Content": "The stock market is being powered by 10 stocks that are fueling AI bubble fears\n\nBrian Sozzi · Executive Editor\nUpdated Wed, December 17, 2025 at 6:28 AM PST 2 min read\n\nIn this article: ^GSPC\n\n^DJI\n\n^IXIC\n\n^SPX\n\nGOOG\n\nIf you're in the \"stock market is in a bubble\" camp, look no further than the composition of the S&P 500 ( ^GSPC ).\nThe top 10 stocks now account for roughly 32% of S&P 500 earnings and over 41% of total market capitalization — levels not seen since at least 1980, according to new data from Barclays strategist Venu Krishna.\n\nThe \"Magnificent Seven\" stocks have been the primary driver of this market power concentration. Those seven companies — Microsoft ( MSFT ), Amazon ( AMZN ), Alphabet ( GOOGL ), Meta ( META ), Tesla ( TSLA ), Nvidia ( NVDA ), and Apple ( AAPL ) — are essentially powering the artificial intelligence boom.\nThese stocks are up on average 21% this year compared to a 15% gain for the S&P 500, according to Yahoo Finance data. Alphabet is the top performer with an advance of 62% amid optimism on its new Gemini 3 model.\nIn turn, the valuation of the S&P 500 has reached a level even most bulls would agree is on the rich side. Krishna's work reveals the S&P 500 is trading at the 91st percentile relative to its 10-year valuation history.\n\"Complacency\" could ignite an AI bubble, Deutsche Bank strategist Adrian Cox told me on Yahoo Finance's Opening Bid (video above).\nRead more: How AI, unemployment, and interest rates could shape the stock market and your investments next year\nIndeed, complacency appears to have settled in, despite the risks investors had to endure this year.\nRemember the \"Liberation Day\" tariff spectacle in April? The S&P 500 tanked 4.8% the day after President Trump unveiled sweeping tariffs on April 2. The Dow Jones Industrial Average ( ^DJI ) dropped a staggering 1,679 points.\n\nTariffs are now in effect, though they are not as severe as first advertised.\nAnd more recently, disappointments from AI darlings CoreWeave ( CRWV ) and Oracle ( ORCL ) have begun to call into question the near-term outlook for the AI trade.\n\"I think we're going to see some pretty massive bifurcation in 2026 in the AI trade,\" Sevens Report Research founder Tom Essaye said on Opening Bid .\nAlphabet is Essaye's top AI pick for 2026, though he acknowledges there are likely to be winners and losers from the Magnificent Seven complex next year.\n\"I think companies like Oracle that [are] not overextended financially but are sort of raising eyebrows with a lot of the spending that is tied to open AI, I think that companies like that could struggle,\" Essaye added. \"There's going to be some pretty serious bifurcation. We've seen it in the last, say, two months of 2025. I think that gets worse in 2026.\"\n\nStory Continues\nBrian Sozzi is Yahoo Finance's Executive Editor and a member of Yahoo Finance's editorial leadership team. Follow Sozzi on X @BrianSozzi , Instagram , and LinkedIn . Tips on stories? Email brian.sozzi@yahoofinance.com.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices\nRead the latest financial and business news from Yahoo Finance\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:05:38",
      "Source": "Investing.com",
      "Title": "Can Apple close the AI gap in 2026? Morgan Stanley weighs in",
      "URL": "https://finance.yahoo.com/news/apple-close-ai-gap-2026-140538059.html",
      "Content": "Can Apple close the AI gap in 2026? Morgan Stanley weighs in\n\nSam Boughedda\nWed, December 17, 2025 at 6:05 AM PST 1 min read\n\nIn this article: AAPL\n\nMS\n\nGOOG\n\nInvesting.com -- Morgan Stanley believes Apple could make progress in artificial intelligence distribution in 2026, but warned the company is still likely to lag peers in core AI capabilities despite an anticipated overhaul of Siri.\nIn a note led by analyst Erik Woodring, the bank said Apple “will become a leading distributor of AI technologies with a Siri re-release in spring 2026,” supported by closer collaboration with external partners such as Google’s Gemini.\n\nThe bank added that these partnerships, rather than in-house development, are expected to be the main driver of Apple’s AI strategy next year.\nHowever, Woodring struck a cautious tone on Apple’s competitive position, saying the company “will remain less relevant in the game of AI in the coming year.”\nIt is believed that Apple’s relatively conservative AI investment over the past two to three years means it will take time to catch up with rivals, even if Apple Intelligence improves through third-party large language models.\nWoodring argued that Apple Intelligence has yet to meaningfully accelerate iPhone upgrade cycles.\nDespite strong consumer interest, the firm estimated that replacement cycles lengthened in fiscal 2025, with shipment growth driven more by an ageing installed base than by new AI features.\n\nThat could begin to change with a Siri relaunch expected in spring 2026, when Apple is likely to integrate a customised Gemini model to deliver more advanced functionality.\nThe bank noted that Apple is stepping up AI spending, including higher operating expenses and capital investment, but said execution risks remain.\nMorgan Stanley feels monetisation is likely to come later, with a paid Apple Intelligence tier “as early as 2027,” once adoption and user engagement are established.\nRelated articles\nCan Apple close the AI gap in 2026? Morgan Stanley weighs in\nSilver's Bullish Pattern Points Higher — Keep an Eye on $52 Resistance Zone\nThese Under-$10 Stocks Are Up 100%+ This Quarter - And Some Still Have Room to Run\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "21:08:16",
      "Source": "Reuters",
      "Title": "Electronics firm Jabil forecasts upbeat annual results on booming data center demand",
      "URL": "https://finance.yahoo.com/news/electronics-firm-jabil-forecasts-upbeat-130816437.html",
      "Content": "Electronics firm Jabil forecasts upbeat annual results on booming data center demand\n\nReuters\nWed, December 17, 2025 at 5:08 AM PST 1 min read\n\nIn this article: JBL\n\nLDNXF\n\nAAPL\n\nDec 17 (Reuters) - Jabil forecast annual revenue and profit above Wall ​Street estimates on Wednesday, as ‌the electronic component maker looks to capitalize on ‌artificial intelligence-driven demand for data centers, sending its shares up more than 5.8% in premarket trade.\nIt expects full-year ⁠2026 revenues ‌of $32.4 billion, above analysts' average expectations of $31.52 billion, according to ‍data compiled by LSEG.\n\nOn an adjusted basis, it expects annual profit per share of $11.55, ​versus expectations of $11.11.\nRising investments in ‌data center infrastructure, driven by strong demand for computing capacity to support AI technologies, have aided companies like Jabil.\nThe company, which supplies electronic components ⁠to Apple , also surpassed ​Street expectations for its ​first-quarter results.\nFirst-quarter revenue rose 18.74% to $8.30 billion, surpassing estimates of $8.09 ‍billion, as ⁠per data compiled by LSEG.\nAdjusted profit per share for the quarter ⁠ended November 30 was $2.85, while analysts expected $2.70.\n(Reporting by ‌Anshuman Tripathy in Bengaluru; Editing ‌by Sahal Muhammed)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "20:54:16",
      "Source": "Euronews",
      "Title": "Warner Bros will urge shareholders to reject hostile bid as Trump attacks Paramount",
      "URL": "https://finance.yahoo.com/m/15755d75-82d2-386b-b898-79b7eb69db3a/warner-bros-will-urge.html",
      "Content": "Warner Bros will urge shareholders to reject hostile bid as Trump attacks Paramount\n\nUna Hajdari\nWed, December 17, 2025 at 4:54 AM PST 4 min read\n\nIn this article: AMZN\n\nAAPL\n\nORCL\n\nWarner Bros Discovery is expected to recommend that shareholders vote against a hostile takeover bid from Paramount Global, according to reporting from several news outlets, dealing a blow to Paramount’s massive $108bn (€92.2bn) attempt to take over the rival studio. Euronews has reached out to Warner for further comment.\n\nThis comes after Paramount announced it was planning to go to Warner Bros' shareholders directly in early December with an all-cash $30 per-share offer — bypassing the board after the studio rejected several of its acquisition proposals. Netflix, on the other hand, is proposing $27.75 per share in cash and stock.\nSince the acquisition battle heated up, Warner Bros stock has been trading closer to $30 per share, shooting up from around $24 per share earlier this month.\nWhy is Warner Bros so hot right now? The battle for Warner Bros has become a test of who will dominate the US media industry.\nWhoever acquires the company would gain access to an extensive film and studio content library licensed under Warner Bros, as well as HBO content and the DC Comics franchise, which includes legacy characters such as Batman and Superman.\n\nThe company's share price was widely considered to be undervalued as the company became bogged down by heavy debt and intense competition from Netflix, Amazon, and Apple.\nOn 5 December, Netflix made a formal offer for Warner Bros Discovery, which the company’s board agreed to support and which included HBO Max and HBO, after a high-stakes months-long bidding war.\nIn a statement, the streaming giant confirmed the mammoth $82.7bn (€71bn) deal, which is being framed as a bringing together of \"two of the greatest storytelling companies in the world to bring to even more people the entertainment they love to watch the most,” Warner Bros CEO and president David Zaslav said at the time.\nIf Warner Bros does break its current agreement with Netflix, it will owe the rejected streamer a $2.8bn (€2.4bn) fee.\n\nEven so, Paramount still faces a number of hurdles before it can claim victory over Netflix, with critics notably questioning the financing of the offer.\nRelated\nWarner Bros Discovery weighs sale after 'unsolicited' buyer interest\nParamount goes hostile in bid for Warner Bros, challenging Netflix\nNetflix wins battle for Warner Bros as HBO joins streaming giant’s empire\nIs Trump's son-in-law involved? President Donald Trump weighed in publicly on the Warner Bros sale a week ago, arguing that the news network CNN should be sold as part of any transaction involving its parent company. He criticised the network’s current leadership as “corrupt or incompetent”, insisting CNN be divested to secure broader political balance in their coverage.\n\nStory Continues\nParamount’s acquisition proposal included acquiring cable and broadcast news assets currently owned by Warner Bros. This sparked worries among some lawmakers and observers that editorial coverage could shift, particularly with regard to reporting on the Trump administration.\nBillionaire Oracle co-founder Larry Ellison is one of the principal financial backers of Paramount Skydance’s hostile bid, providing a large portion of the equity that underpins the offer and helping to secure other investors. His son, David Ellison, is chairman and CEO of Paramount Skydance.\n\nThat affiliation — coupled with the Ellisons’ friendship with Donald Trump and their role as major Republican donors — has led some analysts to believe that the Skydance bid is not merely a commercial offer but also a play for political influence.\nJared Kushner, Trump's son-in-law, or more specifically his private equity firm Affinity Partners, was initially listed as a backer of Paramount’s hostile takeover bid. The firm has since pulled out of the financing consortium.\nIn a not-so-atypical turnaround, Trump criticised Paramount on Tuesday evening, claiming that he was not actually as cosy with Paramount as it may have seemed. Paramount owns CBS, a station that ended production of 'The Late Show' earlier this year. When the programme's cancellation was announced, some suggested the decision linked to host Stephen Colbert's criticism of the Trump administration. At the time, CBS said it was \"purely a financial decision\".\n\nThe axing of the 33-year-old show came just days after Colbert publicly criticised Paramount for settling a $16mn (€13.7mn) lawsuit with Donald Trump at a time when the company was seeking regulatory approval for its Skydance merger.\n“For those people that think I am close with the new owners of CBS, please understand that '60 Minutes' has treated me far worse since the so-called 'takeover', than they have ever treated me before,” Trump said in a social media post on Tuesday night. “If they are friends, I’d hate to see my enemies!”\n'60 Minutes' is a news show produced by CBS and was the subject of the $16mn defamation case settled earlier this year. Trump claimed that producers edited an interview with then-vice president Kamala Harris in a way that was deliberately deceptive.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "20:08:31",
      "Source": "Investing.com",
      "Title": "Apple leads Morgan Stanley top IT hardware picks for 2026. Here are 4 more stocks",
      "URL": "https://finance.yahoo.com/news/apple-leads-morgan-stanley-top-120831740.html",
      "Content": "Apple leads Morgan Stanley top IT hardware picks for 2026. Here are 4 more stocks\n\nSam Boughedda\nWed, December 17, 2025 at 4:08 AM PST 2 min read\n\nIn this article: WDC\n\nTDC\n\nAAPL\n\nMS\n\nSTX\n\nInvesting.com -- Apple is among Morgan Stanley’s preferred IT hardware stocks for 2026, as the bank expects leadership in the sector to narrow amid elevated valuations and mounting memory headwinds.\nAnalyst Erik Woodring told investors in a note that “elevated valuations, a still-inconsistent macro, and memory cost inflation are likely to narrow Hardware outperformance breadth in 2026,” with stock selection becoming increasingly important.\n\nAgainst that backdrop, the firm highlighted five core overweight picks: Western Digital, Seagate Technology, Apple , TD Synnex and Teradata.\nApple stands out as a key “product-cycle beneficiary,” Woodring said, adding that it has raised its price target on the stock to $315 from $305 per share.\nWhile the firm cut its FY27 product gross margin assumptions “160bps due to memory headwinds,” it added that “iPhone units/pricing more than offset,” with FY27 EPS now “8% above Street” expectations.\nWestern Digital remains Morgan Stanley’s top pick heading into 2026, with the firm citing pricing strength and margin upside.\nMorgan Stanley has raised its FY27 EPS estimates on Western Digital and Seagate by “30–40% above Street,” reflecting improving fundamentals in cloud-related demand.\n\nThe WDC price target was upped to $228 per share, while Seagate’s target was raised to $337.\nTD Synnex was described as Morgan Stanley’s “most out-of-consensus OW,” while Teradata was also included among the firm’s preferred names as a “unique asset.”\nThe bank lowered SNX’s target to $177 and increased the TDC target to $35 per share.\nIn contrast, Morgan Stanley remains cautious on hardware OEMs Dell Technologies and HP, citing “outsized memory exposure.”\nOverall, Morgan Stanley said 2026 is likely to be “a tougher year for Hardware stocks,” but one still offering “pockets of opportunity” for investors willing to be selective.\nRelated articles\nApple leads Morgan Stanley top IT hardware picks for 2026. Here are 4 more stocks\n17 Undervalued Small-Cap Tech Stocks Primed to Outperform in Q4\nSilver's Bullish Pattern Points Higher — Keep an Eye on $52 Resistance Zone\n\nCondiciones y Política de privacidad\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "19:03:22",
      "Source": "MT Newswires",
      "Title": "Market Chatter: Apple in Talks With Indian Chipmakers to Make iPhone Components",
      "URL": "https://finance.yahoo.com/news/market-chatter-apple-talks-indian-110322243.html",
      "Content": "PREMIUM\nMarket Chatter: Apple in Talks With Indian Chipmakers to Make iPhone Components\n\nMT Newswires\nWed, December 17, 2025 at 3:03 AM PST 1 min read\n\nIn this article: AAPL\n\nApple (AAPL) is in preliminary talks with Indian chipmakers to assemble and package a component for\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "18:50:00",
      "Source": "Motley Fool",
      "Title": "Is Alphabet a Top Artificial Intelligence Stock to Buy for 2026?",
      "URL": "https://finance.yahoo.com/m/bda007aa-6bed-3319-87c9-7f46c4ddcf35/is-alphabet-a-top-artificial.html",
      "Content": "Is Alphabet a Top Artificial Intelligence Stock to Buy for 2026?\n\nKeithen Drury, The Motley Fool\nWed, December 17, 2025 at 2:50 AM PST 5 min read\n\nIn this article: GOOG\n\nAAPL\n\nMSFT\n\nAMZN\n\nNVDA\n\nKey Points Alphabet's rise in 2025 is due to low expectations entering the year.\nAlphabet could open a new business unit in 2026.\n10 stocks we like better than Alphabet ›\nAlphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) has been one of the best big tech stocks to own in 2025. Its stock has risen 65% so far in 2025, outperforming nearly all of its big tech peers, like Apple , Microsoft , Amazon , and even Nvidia . However, after a great 2025, some investors may be a bit more concerned about what 2026 will hold. After all, it isn't easy to follow up a strong year with another.\n\nIf you look into the reasons why Alphabet's stock had a great 2025, it's clear that it frees the stock up to have another strong 2026, although it will be difficult to be as impressive as 2025 was. I think this makes Alphabet a great buy heading into 2026, and I'd expect Alphabet to emerge as the second-largest company in the world, behind Nvidia.\nAlphabet faced several doubts heading into 2025 To understand why Alphabet's 2025 was so successful, we need to rewind the clock to the start of 2025. Then, there were several question marks surrounding Alphabet's business. Alphabet's core business is the Google Search engine, and there were questions about its future in the generative AI (artificial intelligence) world. Many thought that Google's best days were behind it, and slipping market share didn't help that opinion.\n\nFurthermore, there was a pending court case questioning the status of Google as a monopoly. Investors didn't know what Alphabet's business would look like in the future, as it could be broken up. As a further negative mark against Alphabet, it was losing the AI race. Competing models like OpenAI's ChatGPT and other models like Perplexity and Claude far outperformed Gemini.\nInvestors were very skeptical of Alphabet's future, and there was heavy bearish sentiment on the stock. At its low point in April, Alphabet's stock traded for less than 14 times forward earnings . That's value stock territory, and showcased the market's negative outlook on Alphabet's future.\nBut then, everything changed.\nSlowly, all of the question marks surrounding Alphabet's stock were answered, and the results were incredibly positive.\n\nAlphabet received positive news regarding its monopoly court case in September. It wouldn't be broken up, although it did have to make a few minor concessions. The fear that Google Search would be dethroned ended after AI overviews became incorporated into each result. This hybrid approach of traditional search and generative AI turned out to be a great compromise and has maintained Google's place at the top of the search engine market. Google's generative AI model, Gemini, also emerged as a leader in its industry. It was such a threat to OpenAI's dominance that it called a \"code red\" due to Gemini's improvements.\n\nStory Continues\nWith all of those problems being resolved, Alphabet's stock was free to be valued at the same level as its tech peers. Now, it trades for around 30 times forward earnings.\nWhile this isn't necessarily cheap, it places Alphabet on a level playing field and allows its business results to shine in 2026.\nAlphabet's 2026 is shaping up to be a good one On top of those questions being answered, another positive one was asked: What if Alphabet sold its in-house computing unit on the open market? Alphabet has developed a custom AI computing unit known as the tensor processing unit (TPU) with Broadcom . This unit was only sold to Alphabet, and could be rented by other clients through its cloud computing network, Google Cloud. However, Alphabet may consider selling these computing units outright to Meta Platforms . That would open up a new business unit for Alphabet in 2026, leading to further growth.\n\nIf this business unit takes off and Alphabet can continue growing its core business at a strong rate (its revenue rose 16% in Q3, and diluted earnings per share (EPS) increased by 35%), Alphabet will be in store for a great 2026. While returns won't be as explosive due to its higher starting valuation, I think its growth will allow it to be a market-beating stock in 2026.\nShould you buy stock in Alphabet right now? Before you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $505,695 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,080,694 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 962 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nKeithen Drury has positions in Alphabet, Amazon, Broadcom, Meta Platforms, and Nvidia. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, and Nvidia. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nIs Alphabet a Top Artificial Intelligence Stock to Buy for 2026? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "18:30:43",
      "Source": "MT Newswires",
      "Title": "Morgan Stanley Adjusts Price Target on Apple to $315 From $305, Maintains Overweight Rating",
      "URL": "https://finance.yahoo.com/news/morgan-stanley-adjusts-price-target-103043305.html",
      "Content": "PREMIUM\nMorgan Stanley Adjusts Price Target on Apple to $315 From $305, Maintains Overweight Rating\n\nMT Newswires\nWed, December 17, 2025 at 2:30 AM PST\n\nIn this article: AAPL\n\nApple (AAPL) has an average rating of overweight and mean price target of $291.92, according to anal\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "16:50:00",
      "Source": "Motley Fool",
      "Title": "Warren Buffett Sells Apple Stock and Buys a Trillion-Dollar AI Stock Up 12,180% Since Its IPO",
      "URL": "https://finance.yahoo.com/m/548d9062-5289-3add-b1f2-76dfc457ce89/warren-buffett-sells-apple.html",
      "Content": "Warren Buffett Sells Apple Stock and Buys a Trillion-Dollar AI Stock Up 12,180% Since Its IPO\n\nTrevor Jennewine, The Motley Fool\nWed, December 17, 2025 at 12:50 AM PST 5 min read\n\nIn this article: AAPL\n\nBRK.A\n\nGOOG\n\nKey Points During the third quarter, Warren Buffett's Berkshire Hathaway continued to sell Apple stock and started a new position in Alphabet.\nApple is well-positioned to monetize consumer adoption of artificial intelligence, but the stock is expensive at its current price.\nAlphabet has opportunities to monetize artificial intelligence across its digital advertising, cloud computing, and autonomous driving businesses.\n10 stocks we like better than Apple ›\n\nWarren Buffett's Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) had about $267 billion invested across 41 U.S. stocks as of the third quarter. Those totals changed very little from the previous quarter, but Buffett (and his fellow investment managers) made some trades worth exploring:\nBerkshire sold 41.7 million shares of Apple (NASDAQ: AAPL) . it remains the largest holding at 21% of the portfolio, but Buffett has slashed the position by 74% in two years.\nBerkshire bought 17.8 million shares of Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) . It is a relatively small position at 2% of the portfolio, but still noteworthy because Buffett has traditionally avoided technology stocks.\nAlphabet stock has returned 12,180% since its 2004 IPO and its $3.7 trillion market value makes it the third-largest company in the world. That Berkshire only recently started a position teaches a valuable lesson: It's alright to buy a stock that you initially overlooked, even if its share price has increased substantially.\nHere's what investors should know.\n1. Apple Apple reported encouraging financial results in the September quarter, beating estimates on the top and bottom lines. Total revenue increased 8% to $102 billion driven by strong sales growth in the iPhone, Mac, and services segments. Non-GAAP net income increased 13% to $1.85 per diluted share due to modest operating margin expansion and continued share buybacks.\n\nThe investment thesis for Apple centers on its dominance in smartphones and its strong presence in other consumer electronics verticals. Design expertise spanning hardware and software has helped the company build a loyal consumer base willing to pay premium prices. iPhones accounted for 43% of smartphone sales in the September quarter, and Apple's installed base exceeds 2.35 billion devices.\nThat so many people have Apple devices means the company is ideally positioned to monetize consumer adoption of artificial intelligence (AI). Last year, Apple introduced a suite of generative AI capabilities (called Apple Intelligence) for newer devices. They are currently free, but the company plans to introduce paid AI features in the next few years, according to Bloomberg.\n\nStory continues\nNevertheless, Apple has a valuation problem. Wall Street expects the company's earnings to increase at 10% annually in the next three years. That makes the current valuation of 36 times earnings look very expensive. Those values give a price-to-earnings-to-growth (PEG) ratio of 3.6, and readings above 2 are typically considered overvalued. I think Apple is a great company, but the stock is not worth the current price.\n\n2. Alphabet Alphabet reported solid third-quarter financial results that beat estimates on the top and bottom lines. Revenue increased 16% to $102 billion, an acceleration from 15% growth in the same quarter last year. GAAP earnings rose 35% to $2.87 per diluted share. CFO Anat Ashkenazi noted strong demand for AI infrastructure, specifically highlighting the adoption of custom chips and Gemini models.\n\nThe investment thesis for Alphabet centers on dominance in digital advertising, a position the company hopes to reinforce with artificial intelligence. Conversion rates have improved (i.e., more clicks) since Alphabet introduced AI Max for Search Campaigns earlier this year, and query volumes have increased since it added generative AI features to Google Search.\nMeanwhile, industry analysts rank Google Cloud as a leader in large language models, AI application development tools, and conversational AI tools. Google has also developed custom AI chips called Tensor Processing Units (TPUs) that have been adopted by Apple and Anthropic, among other noteworthy clients. Meta Platforms may deploy TPUs in its own data centers in 2027, according to The Information.\n\nFinally, Alphabet's autonomous driving subsidiary Waymo could eventually be a major source of revenue. It already offers commercial robotaxi services in six U.S. cities: Phoenix, Los Angeles, San Francisco, Austin, Atlanta, and Miami. Waymo will launch in four new cities across Texas and Florida in the coming weeks. And the company is testing its vehicles in another dozen cities.\nWall Street expects Alphabet's earnings to increase at 16% annually over the next three years. That makes the current valuation of 30 times earnings look reasonable. Those values give a PEG ratio of 1.9, which is far more attractive than Apple's PEG ratio of 3.6. Investors should consider buying a small position in Alphabet stock today.\nShould you invest $1,000 in Apple right now? Before you buy stock in Apple, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $505,695 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,080,694 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 962 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nTrevor Jennewine has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Apple, Berkshire Hathaway, and Meta Platforms. The Motley Fool has a disclosure policy .\nWarren Buffett Sells Apple Stock and Buys a Trillion-Dollar AI Stock Up 12,180% Since Its IPO was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 34
}