{
  "stock_id": "AAPL",
  "last_updated": "2025-12-17T15:48:40.538Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-17",
      "Time": "23:35:15",
      "Source": "MT Newswires",
      "Title": "Jefferies Adjusts Price Target on Apple to $283.36 From $246.99, Maintains Hold Rating",
      "URL": "https://finance.yahoo.com/news/jefferies-adjusts-price-target-apple-153515499.html",
      "Content": "PREMIUM\nJefferies Adjusts Price Target on Apple to $283.36 From $246.99, Maintains Hold Rating\n\nMT Newswires\nWed, December 17, 2025 at 7:35 AM PST\n\nIn this article: AAPL\n\nApple (AAPL) has an average rating of overweight and mean price target of $291.92, according to anal\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "23:03:39",
      "Source": "24/7 Wall St.",
      "Title": "Why Sam Altman Sees Apple and Not Google as its Top AI Rival",
      "URL": "https://finance.yahoo.com/m/6a2d7130-a8fd-3494-a708-8da1e3ea5b9d/why-sam-altman-sees-apple-and.html",
      "Content": "Why Sam Altman Sees Apple and Not Google as its Top AI Rival\n\nJoey Frenette\nWed, December 17, 2025 at 7:03 AM PST 4 min read\n\nIn this article: GOOG\n\nAAPL\n\nOPAI.PVT\n\nQuick Read Sam Altman views Apple as OpenAI’s top AI rival despite Google’s recent Gemini 3.0 momentum.\nApple pays only $1B annually to use Gemini and plans to integrate it into Siri in 2026.\nApple’s Gemini-powered Siri could become the default iPhone AI option over ChatGPT.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality. Read more here .\n\nOpenAI's top boss, Sam Altman, has been quite busy of late responding to Google Gemini 3.0 with a \"code red\" of sorts. And while the latest ChatGPT 5.2 seems to be a worthy rival, questions linger as to whether OpenAI is about to lose its AI lead to the likes of Google and its parent company, Alphabet ( NASDAQ:GOOG ). Arguably, the torch has already passed after Gemini 3.0 garnered spectacular feedback while powering impressive App Store downloads.\nThough Google has made massive ground over the past year, I still think it's a tad too early in the game to deem Google as the winner of the AI race, even though Gemini 3.0's strong launch has made a case for switched chatbots. While Google is an AI force to be reckoned with, I found it quite interesting that Altman expressed his view that it's Apple ( NASDAQ:AAPL ), a firm it's partnered up with to offer ChatGPT via Apple Intelligence, as opposed to Google, which could be the most significant AI rival, at least over the long term, for the GPT-maker.\n\nSam Altman is right to acknowledge Apple's AI abilities Sure, such a comment seems laughable for now, especially given where Apple Intelligence currently stands in the AI race. However, as we head into 2026, Apple is going to be launching what could be its biggest AI offering to date: Siri with a Gemini boost. Of course, in the longer term, it might be more about Apple's dominance in software and hardware that makes Apple a serious contender in the AI war.\n\nThough it may seem far-fetched to think that the Cupertino giant is a bigger threat than the likes of Google, which has all the right tools in place to extend its lead in the race, I certainly wouldn't doubt Apple CEO Tim Cook and company as they look to learn from the mistakes of other tech titans to offer an AI experience that's simply better than what most other firms are currently offering. In a prior piece, I shone a bright light on the great deal that Apple was getting to use Gemini.\nJust $1 billion per year to use Gemini and add to it seems like a great deal that only Apple has the leverage to make. The most exciting thing, I believe, is what else Apple adds on top of Gemini. As the AI experience becomes more about what's added on top of a large language model (LLM), it will be very interesting to see how Apple's take on AI will be in 2026.\n\nStory Continues\nApple's big AI upgrades are coming. It might be the biggest AI story of 2026 My guess is the Gemini experience will be made that much richer with Apple's polishings added on top. Either way, Apple users are going to get a premium and more exclusive AI product pretty much for free. And that might power a device refresh cycle, the likes of which we may not have witnessed since the COVID lockdown days. Personally, I think Apple's new Gemini-powered Siri could be a hit. And it might cause further competitive pressures for OpenAI.\n\nOf course, ChatGPT is likely to stick around as an option for iPhone users, but if it's not the default option, things could have the potential to get very sticky for OpenAI as it looks to fight off a new threat in Apple, as it continues to do its best to keep up with Google and Gemini. Add the OpenAI device that former Apple CDO Jony Ive has been working on into the equation, and Apple stands out as a top foe in AI consumer hardware.\nAnd with OpenAI also looking to make strides in AI chips, Apple and its M-series chips also stand out as a top rival. If Apple's Siri upgrade goes well, perhaps it's M-series chips in Apple's Private Cloud Compute and A-series chips on the edge that we'll all be using as we stay in that Apple ecosystem.\nData Shows One Habit Doubles American’s Savings And Boosts Retirement Most Americans drastically underestimate how much they need to retire and overestimate how prepared they are. But data shows that people with one habit have more than double the savings of those who don’t.\nAnd no, it’s got nothing to do with increasing your income, savings, clipping coupons, or even cutting back on your lifestyle. It’s much more straightforward (and powerful) than any of that. Frankly, it’s shocking more people don’t adopt the habit given how easy it is .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:47:00",
      "Source": "Yahoo Finance Video",
      "Title": "Memory chip prices could pressure smartphone shipments in 2026: RPT",
      "URL": "https://finance.yahoo.com/video/memory-chip-prices-could-pressure-144700650.html",
      "Content": "Memory chip prices could pressure smartphone shipments in 2026: RPT\n\nYahoo Finance Video and Julie Hyman\nWed, December 17, 2025 at 6:47 AM PST\n\nIn this video: MU\n\nSSNLF\n\nAAPL\n\nCounterpoint Research expects smartphone shipments to fall by 2.1% in 2026 over rising memory chip costs as more companies invest billions into AI infrastructure buildouts.\nCounterpoint Research senior research analyst Yang Wang and Bloomberg Intelligence analyst Mandeep Singh come on Morning Brief to expand on these global tech trends.\nTo watch more expert insights and analysis on the latest market action, check out more Morning Brief .\n\nVideo Transcript\n\n00:00 Speaker A\nLet's talk about the sort of ripple effect of the AI buildout and in sort of Micron being a case study, so to speak. And Yang, you know a lot about this because we have seen memory chip prices go through the roof because a lot of memory is sort of being dedicated and diverted to the AI build out now. You guys have been doing research on that. So what effect has that been having?\n00:30 Yang\nWell, I mean, first of all, I mean, we we will be looking very closely at the Micron earnings, especially because they've announced recently that they will be winding down the crucial business unit which caters to consumer electronic segment and smartphones. Uh will be the first to get hit.\n00:53 Yang\nNow, come, zooming out a bit. You, when we look at the key memory components such as DRAM, prices have gone up 70% in this quarter, and we've we're projecting it to go up another 40% next quarter. So, what that directly means is that the build cost or bill of materials for smartphones, they have already increased 20 to 30% for, you know, the low-end devices below $200.\n01:29 Yang\nBut even for think of the flagship devices from from Apple, from Samsung, even those prices have will be going up 10 to 15 um percent. Now, what is the compounding effect, right? It means that costs are going up. And then, you know, companies have to make a tough decision, will they bite the the bullet and take the um, take take the additional cost or will they choose, which in our opinion is a likely case, pass through the the cost to consumers.\n02:07 Yang\nAnd in an environment where um prices are high, inflation isn't really coming down yet, it's going to be a tough decision for consumers whether they're going to upgrade or whether they're going to postpone. And in our, in our understanding, through our consumer surveys, they're very likely to to postpone and that means it's leads to our our latest forecast that the smartphone shipments for the global market next year is going to be coming down 2.1%.\n02:44 Yang\nAnd that is a big um delta from uh from what has happened in this year, which the market grew 3%. So a a swing of 5% is going to be painful for all industry players in the smartphone industry.\n03:00 Speaker A\nYang, when's the last time there was a decline in shipments year over year?\n03:04 Yang\nWell, I mean, the last time we had a big decline was in 2022, 23, when obviously on the onset of the the Ukraine war, you had inflation and uh central banks hiking rates. So, of course, that, you know, there was also the compounded effect of a massive amount of pent up demand working from home. So there was a lot of um device refreshes ahead of it.\n03:41 Yang\nSo, entering into that cycle, you had a lot of um supply chain pains, but on the demand side, it created. So, luckily, and in looking at what's going to turn out next year, we see demand remaining fairly resilient, and that's mainly because the trading environment has been fairly stable. I mean, the growth engines, emerging markets, you look at big markets like India, Southeast Asia, they're still on a growth trajectory.\n04:16 Yang\nUm the US, you know, China, Europe remaining stable, and let's not forget, um US, China, um the the one year uh trade war or tech war truce. And that kind of paves a stable environment for our industry. So thankfully, we're not get going to get a demand collapse. But yeah, I mean, on the, who knows what happens in a year's time when, you know, we uh we hopefully get out of the memory squeeze cycle, but then geopolitics could rear its ugly tail again.\n05:08 Speaker A\nYes, most definitely. And who knows also the AI build out what other kind of knock on effects it will have. And Mandeep, I want to bring you back to to pose that question to you because we just heard Yang talking about the higher prices of memory chips, um and the effect that could have smartphones, but I'm also curious for the AI build out itself. Um, you know, are we going to see price volatility in all of the things needed to go into that build out and have the major players really insured their supply or are we going to see a lot of volatility there as well?\n06:01 Mandeep\nYeah, I mean, you could see, you know, supply shortages and certain components at a given point of time, but to my mind, you know, the buildout is more or less uh you know, certain in the sense like that three trillion number in aggregate spending through 2030 does sound very plausible given what we have seen in terms of the intent around AI investments and uh frankly speaking, the ROI that people are seeing when it comes to the generative AI use cases, whether it's coding agents or customer service.\n07:00 Mandeep\nSo from that perspective, you know, the buildout will take place. It's just a question of whether, you know, the neo clouds uh aren't able to raise funding at a given point of time because of concerns around excessive leverage or, you know, there could be some component shortages, which is why CoreWeave had to push out its data center going live last quarter. So all those are part of the build out, but there is no doubt that, you know, uh companies are committed when it comes to uh deploying AI and and they do need the compute uh which is pretty much uh a requirement when it comes to uh doing inferencing uh on these large language models.\n07:53 Speaker A\nYeah.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:28:45",
      "Source": "Yahoo Finance",
      "Title": "The stock market is being powered by 10 stocks that are fueling AI bubble fears",
      "URL": "https://finance.yahoo.com/news/the-stock-market-is-being-powered-by-10-stocks-that-are-fueling-ai-bubble-fears-142845016.html",
      "Content": "The stock market is being powered by 10 stocks that are fueling AI bubble fears\n\nBrian Sozzi · Executive Editor\nUpdated Wed, December 17, 2025 at 6:28 AM PST 2 min read\n\nIn this article: ^GSPC\n\n^DJI\n\n^IXIC\n\n^SPX\n\nGOOG\n\nIf you're in the \"stock market is in a bubble\" camp, look no further than the composition of the S&P 500 ( ^GSPC ).\nThe top 10 stocks now account for roughly 32% of S&P 500 earnings and over 41% of total market capitalization — levels not seen since at least 1980, according to new data from Barclays strategist Venu Krishna.\n\nThe \"Magnificent Seven\" stocks have been the primary driver of this market power concentration. Those seven companies — Microsoft ( MSFT ), Amazon ( AMZN ), Alphabet ( GOOGL ), Meta ( META ), Tesla ( TSLA ), Nvidia ( NVDA ), and Apple ( AAPL ) — are essentially powering the artificial intelligence boom.\nThese stocks are up on average 21% this year compared to a 15% gain for the S&P 500, according to Yahoo Finance data. Alphabet is the top performer with an advance of 62% amid optimism on its new Gemini 3 model.\nIn turn, the valuation of the S&P 500 has reached a level even most bulls would agree is on the rich side. Krishna's work reveals the S&P 500 is trading at the 91st percentile relative to its 10-year valuation history.\n\"Complacency\" could ignite an AI bubble, Deutsche Bank strategist Adrian Cox told me on Yahoo Finance's Opening Bid (video above).\nRead more: How AI, unemployment, and interest rates could shape the stock market and your investments next year\nIndeed, complacency appears to have settled in, despite the risks investors had to endure this year.\nRemember the \"Liberation Day\" tariff spectacle in April? The S&P 500 tanked 4.8% the day after President Trump unveiled sweeping tariffs on April 2. The Dow Jones Industrial Average ( ^DJI ) dropped a staggering 1,679 points.\n\nTariffs are now in effect, though they are not as severe as first advertised.\nAnd more recently, disappointments from AI darlings CoreWeave ( CRWV ) and Oracle ( ORCL ) have begun to call into question the near-term outlook for the AI trade.\n\"I think we're going to see some pretty massive bifurcation in 2026 in the AI trade,\" Sevens Report Research founder Tom Essaye said on Opening Bid .\nAlphabet is Essaye's top AI pick for 2026, though he acknowledges there are likely to be winners and losers from the Magnificent Seven complex next year.\n\"I think companies like Oracle that [are] not overextended financially but are sort of raising eyebrows with a lot of the spending that is tied to open AI, I think that companies like that could struggle,\" Essaye added. \"There's going to be some pretty serious bifurcation. We've seen it in the last, say, two months of 2025. I think that gets worse in 2026.\"\n\nStory Continues\nBrian Sozzi is Yahoo Finance's Executive Editor and a member of Yahoo Finance's editorial leadership team. Follow Sozzi on X @BrianSozzi , Instagram , and LinkedIn . Tips on stories? Email brian.sozzi@yahoofinance.com.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices\nRead the latest financial and business news from Yahoo Finance\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:05:38",
      "Source": "Investing.com",
      "Title": "Can Apple close the AI gap in 2026? Morgan Stanley weighs in",
      "URL": "https://finance.yahoo.com/news/apple-close-ai-gap-2026-140538059.html",
      "Content": "Can Apple close the AI gap in 2026? Morgan Stanley weighs in\n\nSam Boughedda\nWed, December 17, 2025 at 6:05 AM PST 1 min read\n\nIn this article: AAPL\n\nMS\n\nGOOG\n\nInvesting.com -- Morgan Stanley believes Apple could make progress in artificial intelligence distribution in 2026, but warned the company is still likely to lag peers in core AI capabilities despite an anticipated overhaul of Siri.\nIn a note led by analyst Erik Woodring, the bank said Apple “will become a leading distributor of AI technologies with a Siri re-release in spring 2026,” supported by closer collaboration with external partners such as Google’s Gemini.\n\nThe bank added that these partnerships, rather than in-house development, are expected to be the main driver of Apple’s AI strategy next year.\nHowever, Woodring struck a cautious tone on Apple’s competitive position, saying the company “will remain less relevant in the game of AI in the coming year.”\nIt is believed that Apple’s relatively conservative AI investment over the past two to three years means it will take time to catch up with rivals, even if Apple Intelligence improves through third-party large language models.\nWoodring argued that Apple Intelligence has yet to meaningfully accelerate iPhone upgrade cycles.\nDespite strong consumer interest, the firm estimated that replacement cycles lengthened in fiscal 2025, with shipment growth driven more by an ageing installed base than by new AI features.\n\nThat could begin to change with a Siri relaunch expected in spring 2026, when Apple is likely to integrate a customised Gemini model to deliver more advanced functionality.\nThe bank noted that Apple is stepping up AI spending, including higher operating expenses and capital investment, but said execution risks remain.\nMorgan Stanley feels monetisation is likely to come later, with a paid Apple Intelligence tier “as early as 2027,” once adoption and user engagement are established.\nRelated articles\nCan Apple close the AI gap in 2026? Morgan Stanley weighs in\nSilver's Bullish Pattern Points Higher — Keep an Eye on $52 Resistance Zone\nThese Under-$10 Stocks Are Up 100%+ This Quarter - And Some Still Have Room to Run\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "21:08:16",
      "Source": "Reuters",
      "Title": "Electronics firm Jabil forecasts upbeat annual results on booming data center demand",
      "URL": "https://finance.yahoo.com/news/electronics-firm-jabil-forecasts-upbeat-130816437.html",
      "Content": "Electronics firm Jabil forecasts upbeat annual results on booming data center demand\n\nReuters\nWed, December 17, 2025 at 5:08 AM PST 1 min read\n\nIn this article: JBL\n\nLDNXF\n\nAAPL\n\nDec 17 (Reuters) - Jabil forecast annual revenue and profit above Wall ​Street estimates on Wednesday, as ‌the electronic component maker looks to capitalize on ‌artificial intelligence-driven demand for data centers, sending its shares up more than 5.8% in premarket trade.\nIt expects full-year ⁠2026 revenues ‌of $32.4 billion, above analysts' average expectations of $31.52 billion, according to ‍data compiled by LSEG.\n\nOn an adjusted basis, it expects annual profit per share of $11.55, ​versus expectations of $11.11.\nRising investments in ‌data center infrastructure, driven by strong demand for computing capacity to support AI technologies, have aided companies like Jabil.\nThe company, which supplies electronic components ⁠to Apple , also surpassed ​Street expectations for its ​first-quarter results.\nFirst-quarter revenue rose 18.74% to $8.30 billion, surpassing estimates of $8.09 ‍billion, as ⁠per data compiled by LSEG.\nAdjusted profit per share for the quarter ⁠ended November 30 was $2.85, while analysts expected $2.70.\n(Reporting by ‌Anshuman Tripathy in Bengaluru; Editing ‌by Sahal Muhammed)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "20:54:16",
      "Source": "Euronews",
      "Title": "Warner Bros will urge shareholders to reject hostile bid as Trump attacks Paramount",
      "URL": "https://finance.yahoo.com/m/15755d75-82d2-386b-b898-79b7eb69db3a/warner-bros-will-urge.html",
      "Content": "Warner Bros will urge shareholders to reject hostile bid as Trump attacks Paramount\n\nUna Hajdari\nWed, December 17, 2025 at 4:54 AM PST 4 min read\n\nIn this article: AMZN\n\nAAPL\n\nORCL\n\nWarner Bros Discovery is expected to recommend that shareholders vote against a hostile takeover bid from Paramount Global, according to reporting from several news outlets, dealing a blow to Paramount’s massive $108bn (€92.2bn) attempt to take over the rival studio. Euronews has reached out to Warner for further comment.\n\nThis comes after Paramount announced it was planning to go to Warner Bros' shareholders directly in early December with an all-cash $30 per-share offer — bypassing the board after the studio rejected several of its acquisition proposals. Netflix, on the other hand, is proposing $27.75 per share in cash and stock.\nSince the acquisition battle heated up, Warner Bros stock has been trading closer to $30 per share, shooting up from around $24 per share earlier this month.\nWhy is Warner Bros so hot right now? The battle for Warner Bros has become a test of who will dominate the US media industry.\nWhoever acquires the company would gain access to an extensive film and studio content library licensed under Warner Bros, as well as HBO content and the DC Comics franchise, which includes legacy characters such as Batman and Superman.\n\nThe company's share price was widely considered to be undervalued as the company became bogged down by heavy debt and intense competition from Netflix, Amazon, and Apple.\nOn 5 December, Netflix made a formal offer for Warner Bros Discovery, which the company’s board agreed to support and which included HBO Max and HBO, after a high-stakes months-long bidding war.\nIn a statement, the streaming giant confirmed the mammoth $82.7bn (€71bn) deal, which is being framed as a bringing together of \"two of the greatest storytelling companies in the world to bring to even more people the entertainment they love to watch the most,” Warner Bros CEO and president David Zaslav said at the time.\nIf Warner Bros does break its current agreement with Netflix, it will owe the rejected streamer a $2.8bn (€2.4bn) fee.\n\nEven so, Paramount still faces a number of hurdles before it can claim victory over Netflix, with critics notably questioning the financing of the offer.\nRelated\nWarner Bros Discovery weighs sale after 'unsolicited' buyer interest\nParamount goes hostile in bid for Warner Bros, challenging Netflix\nNetflix wins battle for Warner Bros as HBO joins streaming giant’s empire\nIs Trump's son-in-law involved? President Donald Trump weighed in publicly on the Warner Bros sale a week ago, arguing that the news network CNN should be sold as part of any transaction involving its parent company. He criticised the network’s current leadership as “corrupt or incompetent”, insisting CNN be divested to secure broader political balance in their coverage.\n\nStory Continues\nParamount’s acquisition proposal included acquiring cable and broadcast news assets currently owned by Warner Bros. This sparked worries among some lawmakers and observers that editorial coverage could shift, particularly with regard to reporting on the Trump administration.\nBillionaire Oracle co-founder Larry Ellison is one of the principal financial backers of Paramount Skydance’s hostile bid, providing a large portion of the equity that underpins the offer and helping to secure other investors. His son, David Ellison, is chairman and CEO of Paramount Skydance.\n\nThat affiliation — coupled with the Ellisons’ friendship with Donald Trump and their role as major Republican donors — has led some analysts to believe that the Skydance bid is not merely a commercial offer but also a play for political influence.\nJared Kushner, Trump's son-in-law, or more specifically his private equity firm Affinity Partners, was initially listed as a backer of Paramount’s hostile takeover bid. The firm has since pulled out of the financing consortium.\nIn a not-so-atypical turnaround, Trump criticised Paramount on Tuesday evening, claiming that he was not actually as cosy with Paramount as it may have seemed. Paramount owns CBS, a station that ended production of 'The Late Show' earlier this year. When the programme's cancellation was announced, some suggested the decision linked to host Stephen Colbert's criticism of the Trump administration. At the time, CBS said it was \"purely a financial decision\".\n\nThe axing of the 33-year-old show came just days after Colbert publicly criticised Paramount for settling a $16mn (€13.7mn) lawsuit with Donald Trump at a time when the company was seeking regulatory approval for its Skydance merger.\n“For those people that think I am close with the new owners of CBS, please understand that '60 Minutes' has treated me far worse since the so-called 'takeover', than they have ever treated me before,” Trump said in a social media post on Tuesday night. “If they are friends, I’d hate to see my enemies!”\n'60 Minutes' is a news show produced by CBS and was the subject of the $16mn defamation case settled earlier this year. Trump claimed that producers edited an interview with then-vice president Kamala Harris in a way that was deliberately deceptive.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "20:08:31",
      "Source": "Investing.com",
      "Title": "Apple leads Morgan Stanley top IT hardware picks for 2026. Here are 4 more stocks",
      "URL": "https://finance.yahoo.com/news/apple-leads-morgan-stanley-top-120831740.html",
      "Content": "Apple leads Morgan Stanley top IT hardware picks for 2026. Here are 4 more stocks\n\nSam Boughedda\nWed, December 17, 2025 at 4:08 AM PST 2 min read\n\nIn this article: WDC\n\nTDC\n\nAAPL\n\nMS\n\nSTX\n\nInvesting.com -- Apple is among Morgan Stanley’s preferred IT hardware stocks for 2026, as the bank expects leadership in the sector to narrow amid elevated valuations and mounting memory headwinds.\nAnalyst Erik Woodring told investors in a note that “elevated valuations, a still-inconsistent macro, and memory cost inflation are likely to narrow Hardware outperformance breadth in 2026,” with stock selection becoming increasingly important.\n\nAgainst that backdrop, the firm highlighted five core overweight picks: Western Digital, Seagate Technology, Apple , TD Synnex and Teradata.\nApple stands out as a key “product-cycle beneficiary,” Woodring said, adding that it has raised its price target on the stock to $315 from $305 per share.\nWhile the firm cut its FY27 product gross margin assumptions “160bps due to memory headwinds,” it added that “iPhone units/pricing more than offset,” with FY27 EPS now “8% above Street” expectations.\nWestern Digital remains Morgan Stanley’s top pick heading into 2026, with the firm citing pricing strength and margin upside.\nMorgan Stanley has raised its FY27 EPS estimates on Western Digital and Seagate by “30–40% above Street,” reflecting improving fundamentals in cloud-related demand.\n\nThe WDC price target was upped to $228 per share, while Seagate’s target was raised to $337.\nTD Synnex was described as Morgan Stanley’s “most out-of-consensus OW,” while Teradata was also included among the firm’s preferred names as a “unique asset.”\nThe bank lowered SNX’s target to $177 and increased the TDC target to $35 per share.\nIn contrast, Morgan Stanley remains cautious on hardware OEMs Dell Technologies and HP, citing “outsized memory exposure.”\nOverall, Morgan Stanley said 2026 is likely to be “a tougher year for Hardware stocks,” but one still offering “pockets of opportunity” for investors willing to be selective.\nRelated articles\nApple leads Morgan Stanley top IT hardware picks for 2026. Here are 4 more stocks\n17 Undervalued Small-Cap Tech Stocks Primed to Outperform in Q4\nSilver's Bullish Pattern Points Higher — Keep an Eye on $52 Resistance Zone\n\nCondiciones y Política de privacidad\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "19:03:22",
      "Source": "MT Newswires",
      "Title": "Market Chatter: Apple in Talks With Indian Chipmakers to Make iPhone Components",
      "URL": "https://finance.yahoo.com/news/market-chatter-apple-talks-indian-110322243.html",
      "Content": "PREMIUM\nMarket Chatter: Apple in Talks With Indian Chipmakers to Make iPhone Components\n\nMT Newswires\nWed, December 17, 2025 at 3:03 AM PST 1 min read\n\nIn this article: AAPL\n\nApple (AAPL) is in preliminary talks with Indian chipmakers to assemble and package a component for\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "18:50:00",
      "Source": "Motley Fool",
      "Title": "Is Alphabet a Top Artificial Intelligence Stock to Buy for 2026?",
      "URL": "https://finance.yahoo.com/m/bda007aa-6bed-3319-87c9-7f46c4ddcf35/is-alphabet-a-top-artificial.html",
      "Content": "Is Alphabet a Top Artificial Intelligence Stock to Buy for 2026?\n\nKeithen Drury, The Motley Fool\nWed, December 17, 2025 at 2:50 AM PST 5 min read\n\nIn this article: GOOG\n\nAAPL\n\nMSFT\n\nAMZN\n\nNVDA\n\nKey Points Alphabet's rise in 2025 is due to low expectations entering the year.\nAlphabet could open a new business unit in 2026.\n10 stocks we like better than Alphabet ›\nAlphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) has been one of the best big tech stocks to own in 2025. Its stock has risen 65% so far in 2025, outperforming nearly all of its big tech peers, like Apple , Microsoft , Amazon , and even Nvidia . However, after a great 2025, some investors may be a bit more concerned about what 2026 will hold. After all, it isn't easy to follow up a strong year with another.\n\nIf you look into the reasons why Alphabet's stock had a great 2025, it's clear that it frees the stock up to have another strong 2026, although it will be difficult to be as impressive as 2025 was. I think this makes Alphabet a great buy heading into 2026, and I'd expect Alphabet to emerge as the second-largest company in the world, behind Nvidia.\nAlphabet faced several doubts heading into 2025 To understand why Alphabet's 2025 was so successful, we need to rewind the clock to the start of 2025. Then, there were several question marks surrounding Alphabet's business. Alphabet's core business is the Google Search engine, and there were questions about its future in the generative AI (artificial intelligence) world. Many thought that Google's best days were behind it, and slipping market share didn't help that opinion.\n\nFurthermore, there was a pending court case questioning the status of Google as a monopoly. Investors didn't know what Alphabet's business would look like in the future, as it could be broken up. As a further negative mark against Alphabet, it was losing the AI race. Competing models like OpenAI's ChatGPT and other models like Perplexity and Claude far outperformed Gemini.\nInvestors were very skeptical of Alphabet's future, and there was heavy bearish sentiment on the stock. At its low point in April, Alphabet's stock traded for less than 14 times forward earnings . That's value stock territory, and showcased the market's negative outlook on Alphabet's future.\nBut then, everything changed.\nSlowly, all of the question marks surrounding Alphabet's stock were answered, and the results were incredibly positive.\n\nAlphabet received positive news regarding its monopoly court case in September. It wouldn't be broken up, although it did have to make a few minor concessions. The fear that Google Search would be dethroned ended after AI overviews became incorporated into each result. This hybrid approach of traditional search and generative AI turned out to be a great compromise and has maintained Google's place at the top of the search engine market. Google's generative AI model, Gemini, also emerged as a leader in its industry. It was such a threat to OpenAI's dominance that it called a \"code red\" due to Gemini's improvements.\n\nStory Continues\nWith all of those problems being resolved, Alphabet's stock was free to be valued at the same level as its tech peers. Now, it trades for around 30 times forward earnings.\nWhile this isn't necessarily cheap, it places Alphabet on a level playing field and allows its business results to shine in 2026.\nAlphabet's 2026 is shaping up to be a good one On top of those questions being answered, another positive one was asked: What if Alphabet sold its in-house computing unit on the open market? Alphabet has developed a custom AI computing unit known as the tensor processing unit (TPU) with Broadcom . This unit was only sold to Alphabet, and could be rented by other clients through its cloud computing network, Google Cloud. However, Alphabet may consider selling these computing units outright to Meta Platforms . That would open up a new business unit for Alphabet in 2026, leading to further growth.\n\nIf this business unit takes off and Alphabet can continue growing its core business at a strong rate (its revenue rose 16% in Q3, and diluted earnings per share (EPS) increased by 35%), Alphabet will be in store for a great 2026. While returns won't be as explosive due to its higher starting valuation, I think its growth will allow it to be a market-beating stock in 2026.\nShould you buy stock in Alphabet right now? Before you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $505,695 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,080,694 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 962 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nKeithen Drury has positions in Alphabet, Amazon, Broadcom, Meta Platforms, and Nvidia. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, and Nvidia. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nIs Alphabet a Top Artificial Intelligence Stock to Buy for 2026? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "18:30:43",
      "Source": "MT Newswires",
      "Title": "Morgan Stanley Adjusts Price Target on Apple to $315 From $305, Maintains Overweight Rating",
      "URL": "https://finance.yahoo.com/news/morgan-stanley-adjusts-price-target-103043305.html",
      "Content": "PREMIUM\nMorgan Stanley Adjusts Price Target on Apple to $315 From $305, Maintains Overweight Rating\n\nMT Newswires\nWed, December 17, 2025 at 2:30 AM PST\n\nIn this article: AAPL\n\nApple (AAPL) has an average rating of overweight and mean price target of $291.92, according to anal\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "16:50:00",
      "Source": "Motley Fool",
      "Title": "Warren Buffett Sells Apple Stock and Buys a Trillion-Dollar AI Stock Up 12,180% Since Its IPO",
      "URL": "https://finance.yahoo.com/m/548d9062-5289-3add-b1f2-76dfc457ce89/warren-buffett-sells-apple.html",
      "Content": "Warren Buffett Sells Apple Stock and Buys a Trillion-Dollar AI Stock Up 12,180% Since Its IPO\n\nTrevor Jennewine, The Motley Fool\nWed, December 17, 2025 at 12:50 AM PST 5 min read\n\nIn this article: AAPL\n\nBRK.A\n\nGOOG\n\nKey Points During the third quarter, Warren Buffett's Berkshire Hathaway continued to sell Apple stock and started a new position in Alphabet.\nApple is well-positioned to monetize consumer adoption of artificial intelligence, but the stock is expensive at its current price.\nAlphabet has opportunities to monetize artificial intelligence across its digital advertising, cloud computing, and autonomous driving businesses.\n10 stocks we like better than Apple ›\n\nWarren Buffett's Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) had about $267 billion invested across 41 U.S. stocks as of the third quarter. Those totals changed very little from the previous quarter, but Buffett (and his fellow investment managers) made some trades worth exploring:\nBerkshire sold 41.7 million shares of Apple (NASDAQ: AAPL) . it remains the largest holding at 21% of the portfolio, but Buffett has slashed the position by 74% in two years.\nBerkshire bought 17.8 million shares of Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) . It is a relatively small position at 2% of the portfolio, but still noteworthy because Buffett has traditionally avoided technology stocks.\nAlphabet stock has returned 12,180% since its 2004 IPO and its $3.7 trillion market value makes it the third-largest company in the world. That Berkshire only recently started a position teaches a valuable lesson: It's alright to buy a stock that you initially overlooked, even if its share price has increased substantially.\nHere's what investors should know.\n1. Apple Apple reported encouraging financial results in the September quarter, beating estimates on the top and bottom lines. Total revenue increased 8% to $102 billion driven by strong sales growth in the iPhone, Mac, and services segments. Non-GAAP net income increased 13% to $1.85 per diluted share due to modest operating margin expansion and continued share buybacks.\n\nThe investment thesis for Apple centers on its dominance in smartphones and its strong presence in other consumer electronics verticals. Design expertise spanning hardware and software has helped the company build a loyal consumer base willing to pay premium prices. iPhones accounted for 43% of smartphone sales in the September quarter, and Apple's installed base exceeds 2.35 billion devices.\nThat so many people have Apple devices means the company is ideally positioned to monetize consumer adoption of artificial intelligence (AI). Last year, Apple introduced a suite of generative AI capabilities (called Apple Intelligence) for newer devices. They are currently free, but the company plans to introduce paid AI features in the next few years, according to Bloomberg.\n\nStory continues\nNevertheless, Apple has a valuation problem. Wall Street expects the company's earnings to increase at 10% annually in the next three years. That makes the current valuation of 36 times earnings look very expensive. Those values give a price-to-earnings-to-growth (PEG) ratio of 3.6, and readings above 2 are typically considered overvalued. I think Apple is a great company, but the stock is not worth the current price.\n\n2. Alphabet Alphabet reported solid third-quarter financial results that beat estimates on the top and bottom lines. Revenue increased 16% to $102 billion, an acceleration from 15% growth in the same quarter last year. GAAP earnings rose 35% to $2.87 per diluted share. CFO Anat Ashkenazi noted strong demand for AI infrastructure, specifically highlighting the adoption of custom chips and Gemini models.\n\nThe investment thesis for Alphabet centers on dominance in digital advertising, a position the company hopes to reinforce with artificial intelligence. Conversion rates have improved (i.e., more clicks) since Alphabet introduced AI Max for Search Campaigns earlier this year, and query volumes have increased since it added generative AI features to Google Search.\nMeanwhile, industry analysts rank Google Cloud as a leader in large language models, AI application development tools, and conversational AI tools. Google has also developed custom AI chips called Tensor Processing Units (TPUs) that have been adopted by Apple and Anthropic, among other noteworthy clients. Meta Platforms may deploy TPUs in its own data centers in 2027, according to The Information.\n\nFinally, Alphabet's autonomous driving subsidiary Waymo could eventually be a major source of revenue. It already offers commercial robotaxi services in six U.S. cities: Phoenix, Los Angeles, San Francisco, Austin, Atlanta, and Miami. Waymo will launch in four new cities across Texas and Florida in the coming weeks. And the company is testing its vehicles in another dozen cities.\nWall Street expects Alphabet's earnings to increase at 16% annually over the next three years. That makes the current valuation of 30 times earnings look reasonable. Those values give a PEG ratio of 1.9, which is far more attractive than Apple's PEG ratio of 3.6. Investors should consider buying a small position in Alphabet stock today.\nShould you invest $1,000 in Apple right now? Before you buy stock in Apple, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $505,695 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,080,694 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 962 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nTrevor Jennewine has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Apple, Berkshire Hathaway, and Meta Platforms. The Motley Fool has a disclosure policy .\nWarren Buffett Sells Apple Stock and Buys a Trillion-Dollar AI Stock Up 12,180% Since Its IPO was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 12
}