{
  "last_updated": "2026-01-04T13:20:35.291Z",
  "total_news_count": 49,
  "news": [
    {
      "Ticker": "NVDA",
      "Date": "2026-01-04",
      "Time": "20:54:16",
      "Source": "Investor's Business Daily",
      "Title": "Dow Jones Futures: How Will Markets React To Trump's Venezuela Action? Nvidia, AMD, Taiwan Semi Due",
      "URL": "https://finance.yahoo.com/m/d3aa3714-1ae7-36bd-90d6-a7ef43eaf2f8/dow-jones-futures%3A-how-will.html",
      "Content": "Dow Jones Futures: How Will Markets React To Trump's Venezuela Action? Nvidia, AMD, Taiwan Semi Due\n\nED CARSON\nSun, January 4, 2026 at 4:54 AM PST 8 min read\n\nIn this article: NVDA\n\n^DJI\n\nAMD\n\nTSM\n\n^GSPC\n\nPresident Trump said the U.S. will \"run\" Venezuela after capturing Nicolas Maduro, but left his regime in charge. Nvidia, AMD CEOs speak at CES Monday.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "NVDA",
      "Date": "2026-01-04",
      "Time": "20:45:44",
      "Source": "Yahoo Finance",
      "Title": "December jobs numbers get data back on track during first full week of trading in 2026: What to watch",
      "URL": "https://finance.yahoo.com/news/december-jobs-numbers-get-data-back-on-track-during-first-full-week-of-trading-in-2026-what-to-watch-124544057.html",
      "Content": "December jobs numbers get data back on track during first full week of trading in 2026: What to watch\n\nJake Conley · Breaking Business News Reporter\nUpdated Sun, January 4, 2026 at 4:45 AM PST 7 min read\n\nIn this article: ^DJI\n\nMSM\n\nJEF\n\n^IXIC\n\nAPLD\n\nStocks finished trading on Friday — the second-to-last session of the \"Santa Claus rally\" period — with the Dow Jones Industrial Average ( ^DJI ) leading the major indexes higher to open the new year as investors began to evaluate the 2026 landscape.\nFor the holiday-abbreviated week, the blue-chip Dow led the way up with a gain of 319 points, or 0.66%. The benchmark S&P 500 ( ^GSPC ) picked up 0.2%, while the tech-heavy Nasdaq Composite ( ^IXIC ) finished just barely below the flatline in a session that saw several of the \"Magnificent 7\" stocks stumble while semiconductor names soared .\n\nIn the week ahead, the first full week of trading in 2026 will see economic data get back on track after last year's multi-month disruption following the 43-day government shutdown that spanned all of October and about half of November.\nOn Friday, the December jobs report is expected to show a slowdown in hiring in the final month of 2025, with economists expecting nonfarm payrolls to grow by 55,000, down from November's job gains of 64,000. The unemployment rate, which hit a four-year high of 4.6% in November, is expected to fall by 0.1%.\n\nElsewhere on the calendar, ADP's monthly private payrolls report, monthly job cuts data from Challenger, Gray & Christmas, and the weekly report on initial jobless claims will round out a heavy focus on the labor market to start the month.\nAll of this jobs data will be closely watched for any impacts on bets that the Federal Reserve cuts rates when it meets later this month, though data from the CME Group as of Friday showed traders pricing in an 85% chance that the Fed keeps rates in their current range of 3.5%-3.75%.\nOn the Federal Reserve front, investors will also be alert to any announcements from President Trump on his nomination to succeed Fed Chair Jay Powell, whose term leading the central bank expires in May. The president said late last month that he expected to name Powell's replacement in early January.\n\nReadings on service sector activity and consumer sentiment will round out the economic data calendar in the coming week, while the earnings calendar will remain light, with Constellation Brands ( STZ ), Albertsons ( ACI ), Jefferies Financial Group ( JEF ), and Applied Digital ( APLD ) the most notable names set to report quarterly results this coming week.\nBig banks are expected to get earnings season underway in earnest in a little less than two weeks.\n'A perennial gale of creative destruction' Despite — or perhaps because of — the year's ups and downs, 2025 was quite good to investors .\n\nStory Continues\nThe benchmark S&P 500 rose over 16% for the year, while the Nasdaq Composite led gains with a more than 20% jump. And this after a sharp downturn in April that threatened to send the markets spiraling into a bear market in a matter of days.\n\"The economy showed remarkable strength by overcoming higher inflation, a slowing labor market, fewer rate cuts than originally expected, and a sharp rise in the effective tariff rate,\" Adam Turnquist, chief technical strategist for LPL Financial, wrote in emailed commentary.\nNvidia ( NVDA ), the dominant chipmaker globally, saw its stock rise more than 30%, while fellow \"Magnificent Seven\" giant Google ( GOOG ) led the group of tech giants, rising more than 60%. Notably, these two stocks were the only members of the Mag 7 to outperform the S&P 500 last year.\n\nGoldman Sachs strategist Peter Oppenheimer argued in the bank's 2026 global outlook report that while valuations are lofty and stock prices have increased sharply, the tech sector's growth isn't solely an AI story with no other legs.\nInstead, the sector's performance has been running since the financial crisis and \"has been supported by superior profit growth.\" Valuations, he wrote, also aren't as extreme as in previous bubbles, such as the heights reached during the dot-com bubble through the turn of the 21st century, and speculation isn't as irrational as it was in those earlier periods.\n\n\"The ascent of technology in terms of size and influence, particularly in the US equity market, has been a function of extraordinary fundamental growth rather than irrational speculation about the future,\" Oppenheimer wrote.\nOverall, Wall Street strategists see the S&P 500 rising 10%, on average, in the year ahead, according to Bank of America.\nThe question for investors in 2026 is whether the tech- and AI-themed upward push we've seen in markets will continue — even with the moves last year showing investors, on a single-stock level, starting to move away from the Mag 7 leadership group.\nHSBC equity strategist Nicole Inui wrote in the firm's 2026 outlook that 2025's stock market strength was \"a concentrated rally, not broad-based.\" Inui noted that the equal-weighted S&P 500 underperformed the market cap-weighted S&P 500 for the third year in a row, with tech accounting for around 90% of returns after the bounce that followed President Trump's \"Liberation Day\" tariff announcements and his subsequent walk-back.\n\nBut this leadership position also doesn't mean the strength of those companies is unsustainable.\nIn a note to clients, Comerica Wealth Management CIO Eric Teal compared today's market to a \"perennial gale,\" a phrase coined by Austrian economist Joseph Schumpeter.\n\"The capitalist economy is often swept by a ' Perennial gale of creative destruction ' — a gale of innovation,\" Teal wrote. \"However, this advancement is a natural process of industrial mutation that leads to dramatic economic changes but also enormous benefits to society and business.\"\nHow that \"perennial gale\" sweeps through the market in 2026, at a moment when the AI trade is already heated and facing real-world stumbling blocks, is likely to be the most closely watched storyline for investors.\nEconomic and earnings calendar Monday Economic data: ISM manufacturing, December (48.4 expected, 48.2 previously)\nEarnings calendar: No notable earnings.\nTuesday Economic data: S&P Global US services PMI, December final reading (52.9 expected, 52.9 previously); S&P Global US composite PMI, December final reading (53.0 previously)\nEarnings calendar: AAR Corp. ( AIR )\nWednesday Economic data: MBA mortgage applications, week ended Jan. 2; ADP employment change, December (+48,000 expected, -32,000 previously); ISM services PMI, December (52.3 expected, 52.6 previously); JOLTS job openings, November (+7.72 million expected, +7.67 million previously); Factory orders, October (-1.1% expected, +0.2% previously); Durable goods orders, October final reading (-2.2% expected, -2.2% previously)\n\nEarnings calendar: Constellation Brands ( STZ ), Jefferies Financial Group ( JEF ), Albertsons Companies ( ACI ), Applied Digital Corporation ( APLD )\nThursday Economic data: Challenger job cuts, year-on-year, December (+23.5% previously); Initial jobless claims, week ended Jan. 3 (215,000 expected, 199,000 previously); Continuing claims, week ended Dec. 27 (1.9 million expected, 1.86 million previously); Trade balance, October (-$58.8 billion expected, -$52.8 billion previously); NY Fed one-year inflation expectations, December (+3.2% previously)\n\nEarnings calendar: RPM International ( RPM ), TD SYNNEX Corporation ( SNX ), Acuity ( AYI ), Commercial Metals Company ( CMC ), WD-40 Company ( WDFC )\nFriday Economic data: Nonfarm payrolls, December (+55,000 expected, +64,000 previously); Change in private payrolls, December (+63,000 expected, +69,000 previously); Average hourly earnings, month-on-month, December (+0.3% expected, +0.1% previously); Average hourly earnings, year-on-year, December (+3.6% expected, +3.5% previously); Unemployment rate, December (4.5% expected, 4.6% previously); Housing starts, October (1.32 million expected); University of Michigan consumer sentiment, January, preliminary reading (53.5 expected, 52.9 previously)\nEarnings calendar: No notable earnings.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices\nRead the latest financial and business news from Yahoo Finance\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "NVDA",
      "Date": "2026-01-04",
      "Time": "20:31:11",
      "Source": "Benzinga",
      "Title": "Michael Saylor Says Bitcoin Makes MSTR 'Interesting,' But Polymarket Aren't So Sure",
      "URL": "https://finance.yahoo.com/news/michael-saylor-says-bitcoin-makes-123111949.html",
      "Content": "Michael Saylor Says Bitcoin Makes MSTR 'Interesting,' But Polymarket Aren't So Sure\n\nParshwa Turakhiya\nSun, January 4, 2026 at 4:31 AM PST 3 min read\n\nIn this article: MSTR\n\nBTC-USD\n\nAMZN\n\nTSLA\n\nMETA\n\nBenzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\nStrategy Inc. (NASDAQ: MSTR ) executive chairman Michael Saylor says Bitcoin (CRYPTO: BTC ) makes the stock “interesting,” but Polymarket traders bet 76% the company gets booted from MSCI by March 31.\nOptions Activity Dwarfs Mega-Cap Peers Saylor on Frida pointed to MSTR’s options interest-to-market cap ratio, which now sits at 86.2%—far exceeding derivatives exposure at Tesla Inc. (NASDAQ: TSLA ) at 22%, Meta Platforms Inc. (NASDAQ: META ) at 10.4%, and Nvidia Corp. (NASDAQ: NVDA ) at 7.2%.\nTech giants like Alphabet Inc. (NASDAQ: GOOGL ), Amazon Inc. (NASDAQ: AMZN ), Apple Inc. (NASDAQ: AAPL ), and Microsoft Corp (NASDAQ: MSFT ) cluster much lower around 3-4%, highlighting how extreme MSTR’s derivatives positioning is relative to its market size.\n\nDon't Miss:\nFast Company Calls It a ‘Groundbreaking Step for the Creator Economy' — Investors Can Still Get In at $0.85/Share\nIf there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it ?\nA large Jan. 2 options expiry could heighten short-term volatility, though MSTR’s returns over the past year have lagged behind its mega-cap peers despite the elevated options activity.\nPolymarket Sees Structural Pressure Building Polymarket traders are positioning for stress around Strategy’s equity narrative as 2026 approaches.\nThe 76% probability of MSCI index removal by March 31 reflects sustained concern over classification and index eligibility rather than a fleeting headline risk.\nAt the same time, confidence in another aggressive Bitcoin disclosure has softened.\n\nThe odds that MicroStrategy announces holdings above 680,000 BTC by Jan. 31 sit at 64%, down from recent highs.\nTogether, the pricing suggests traders expect structural pressure on the stock to materialize sooner than any near-term upside catalyst tied to fresh Bitcoin accumulation.\nTrending: Forget Flipping Houses— This Fund Lets You Invest in Home Equity Like Wall Street Does\nChart Shows $148 Is Last Line Of Defense MSTR Price Action By TradingView\nMSTR is up 3.70% today, but remains in a clear downtrend after the 66% decline from late July’s peak near $460.\nThe 20 EMA at $167.67 represents the nearest overhead resistance, followed by the 50 EMA at $202.78.\nThe Supertrend indicator at $181.47 has flipped bearish, reinforcing the current downtrend.\n\nThe descending trendline from the November peak continues to cap upside attempts.\nSee Also: Wall Street's $12B Real Estate Manager Is Opening Its Doors to Individual Investors — Without the Crowdfunding Middlemen\nRecent price action shows consolidation in the $150-$160 range with diminishing volatility, which could precede a directional move.\n\nStory Continues\nThe overall technical structure remains negative until the stock can reclaim key moving averages.\nKey Levels To Watch Immediate support: $148-$150 (recent lows)\nKey resistance: $167-$170 (20 EMA), $180-$185 (Supertrend + psychological level)\nMajor resistance: $200+ (50 EMA zone)\nA break below $148 opens the door to further downside with no clear support until $120-$130.\nReclaiming $180 and holding it as support would be the first sign of a trend reversal.\nRead Next: Missed the AI Boom's Biggest IPOs? This Platform Lets Everyday Investors Access Private Tech Early\nImage: Shutterstock\nThis article Michael Saylor Says Bitcoin Makes MSTR 'Interesting,' But Polymarket Aren't So Sure originally appeared on Benzinga.com\n© 2026 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "NVDA",
      "Date": "2026-01-04",
      "Time": "20:05:00",
      "Source": "Motley Fool",
      "Title": "3 Artificial Intelligence Stocks to Buy in 2026 That Could Be Better Picks Than Palantir",
      "URL": "https://finance.yahoo.com/m/1d2a515e-dfaf-3051-acb8-d0c53487b442/3-artificial-intelligence.html",
      "Content": "3 Artificial Intelligence Stocks to Buy in 2026 That Could Be Better Picks Than Palantir\n\nKeith Speights, The Motley Fool\nSun, January 4, 2026 at 4:05 AM PST 5 min read\n\nIn this article: PLTR\n\nGOOG\n\nMU\n\nNVDA\n\nKey Points Google parent Alphabet covers nearly all of the bases in AI.\nMicron Technology is dirt-cheap compared to Palantir.\nNvidia is growing at roughly the same rate as Palantir but offers a more attractive risk-reward proposition.\n10 stocks we like better than Nvidia ›\nFew stocks received more buzz in 2025 than Palantir Technologies (NASDAQ: PLTR) . Such attention is to be expected when a stock soars nearly 140% after skyrocketing 340% in the previous year.\n\nPalantir CEO Alex Karp wrote to shareholders in November, \"This remains the beginning, the first moment of a first chapter.\" If he's right, Palantir is undoubtedly one of the best artificial intelligence (AI) stocks to buy as the new year begins. However, I think there are three AI stocks to buy in 2026 that could be better picks than Palantir.\n1. Alphabet Palantir focuses on one area of AI – software. Google parent Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) covers nearly every base. I view that as a major advantage in 2026 and beyond.\nAlphabet's Google Cloud is the fastest-growing of the \"big three\" cloud service providers. It's a top choice for AI start-ups, with nearly all of the AI \" unicorns \" (start-ups that have a market cap of $1 billion or more) using Google Cloud.\n\nGoogle Gemini 3.0 Pro ranks as the top large language model (LLM) currently available, according to LMArena's Leaderboard. Gemini 3.0 Flash is No. 2. Google has also integrated Gemini into its search engine, Workspace productivity suite, Chrome browser, Antigravity platform for developing AI agents, and other applications.\nThe company is making waves in the AI chip market as well. Google's Tensor Processing Units (TPUs). For example, Apple (NASDAQ: AAPL) used TPUs to train the generative AI models for its Apple Intelligence functionality. AI leader Anthropic keeps its costs lower by using TPUs rather than GPUs. Meta Platforms (NASDAQ: META) is reportedly in discussions with Google regarding the use of TPUs in its data centers.\n2. Micron Technology Micron Technology (NASDAQ: MU) is a member of what some refer to as the \"memory oligarchy.\" Only three companies in the world supply high-bandwidth memory (HBM). Micron is one of them – and it's the only HBM manufacturer that's based in the U.S.\nPalantir's AI software wouldn't be able to run without powerful chips. Those chips wouldn't be able to function without high-bandwidth, low-latency memory. You could make a pretty good case that Micron, therefore, is more important to the AI space than Palantir.\n\nStory Continues\nI don't think we have to use that argument to view Micron as the better pick for 2026, though. Instead, we only need to consider the valuations of the two stocks.\nPalantir's forward price-to-earnings multiple is 181.8. Micron's forward earnings multiple is 9.2. Granted, Palantir's earnings are growing at a much faster rate. However, Micron's stock is more attractively valued, even when factoring in five-year earnings growth projections. Its price-to-earnings-to-growth (PEG) ratio is a low 0.5 compared to Palantir's PEG ratio of 2.8.\n\n3. Nvidia Then there's Nvidia (NASDAQ: NVDA) . The company reigns as the king of AI. Its GPUs remain the most popular (and most powerful) chips for AI processing.\nNvidia might be the best stock to go head-to-head with Palantir. The two companies' recent growth rates are almost identical. Palantir reported that its revenue soared 63% year-over-year in the third quarter of 2025. Nvidia's revenue grew by 62% year-over-year.\n\nHowever, Nvidia appears to have an even greater wind at its back than Palantir. The GPU maker's quarter-over-quarter revenue growth in Q3 was 22%, compared to 18% for Palantir. Also, Nvidia's guidance projects revenue will increase by 14% quarter-over-quarter in Q4. Palantir expects revenue will increase by 12.5% in Q4.\nYou might guess that Nvidia's and Palantir's valuations would be similar based on their growth rates. Nope. Nvidia is cheaper using pretty much any valuation metric chosen. Perhaps Palantir will deliver higher gains in 2026, but I think Nvidia offers the better risk-reward proposition.\nShould you buy stock in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $490,703 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,157,689 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 966 % — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of January 4, 2026.\nKeith Speights has positions in Alphabet, Apple, and Meta Platforms. The Motley Fool has positions in and recommends Alphabet, Apple, Meta Platforms, Nvidia, and Palantir Technologies. The Motley Fool has a disclosure policy .\n3 Artificial Intelligence Stocks to Buy in 2026 That Could Be Better Picks Than Palantir was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "NVDA",
      "Date": "2026-01-04",
      "Time": "16:50:00",
      "Source": "Motley Fool",
      "Title": "A Once-in-a-Decade Investment Opportunity: The 3 Best AI Stocks to Buy in January 2026",
      "URL": "https://finance.yahoo.com/m/debb8a92-c4aa-34e8-ab80-57e6aa3a3473/a-once-in-a-decade-investment.html",
      "Content": "A Once-in-a-Decade Investment Opportunity: The 3 Best AI Stocks to Buy in January 2026\n\nTrevor Jennewine, The Motley Fool\nSun, January 4, 2026 at 12:50 AM PST 5 min read\n\nIn this article: NVDA\n\nMETA\n\nPSTG\n\nJPM\n\nKey Points Nvidia's graphics processing units are the industry standard in artificial intelligence infrastructure, but the company is truly formidable due to its full-stack strategy.\nMeta Platforms is using artificial intelligence to improve engagement and advertising conversion rates across its portfolio of industry-leading social media properties.\nPure Storage is a leader in enterprise storage solutions, and its all-flash arrays pack more storage density and greater power efficiency than any competing product.\n10 stocks we like better than Nvidia ›\n\nArtificial intelligence (AI) promises to be the most transformative technology of the decade, if not all of human history. Analysts have compared the AI revolution to other major inflection points, including the advent of the internet, the introduction of the smartphone, and the invention of the microprocessor.\nHowever, AI is being adopted much more quickly than all of those technologies. Indeed, Stephanie Aliaga at JPMorgan Chase writes, \"In the first half of 2025, AI-related capital expenditures contributed 1.1% to GDP growth, outpacing the U.S. consumer as an engine of expansion.\"\nHere's why Nvidia (NASDAQ: NVDA) , Meta Platforms (NASDAQ: META) , and Pure Storage (NYSE: PSTG) are my picks for the three best AI stocks to buy in January 2026.\nNvidia: 32% upside implied by the median target price Nvidia is best known for its graphics processing units (GPUs), chips that speed up compute-intensive data center workloads like analytics and artificial intelligence (AI). But the company is truly formidable because it complements its GPUs with CPUs, networking platforms, and an unparalleled ecosystem of software tools that assist developers with building applications.\n\nConsequently, while custom AI accelerators developed by competitors like Broadcom are generally cheaper, Nvidia systems frequently have a lower total cost of ownership because the company can optimize performance across most facets of the data center computing stack. Additionally, custom chips lack pre-built software tools, which means they must be built from scratch.\nMorningstar analyst Brian Colello says Nvidia's vertically integrated business model that spans data center hardware and software affords the company a wide economic moat. \"In the long run, we expect tech titans to strive to find second sources or in-house solutions to diversify away from Nvidia in AI, but these efforts will, at best, only chip away at Nvidia's AI dominance.\"\n\nNvidia's adjusted earnings increased 60% in the third quarter, and Wall Street estimates earnings will increase at 67% annually through the fiscal year ending in January 2027. That makes the current valuation of 46 times earnings look cheap. Indeed, among 69 analysts, Nvidia has a median target price of $250 per share, implying 32% upside from its current share price of $189.\n\nStory Continues\nMeta Platforms: 29% upside implied by the median target price Meta Platforms is the second-largest ad tech company in the world. The company has an almost unparalleled ability to source consumer data because it owns four of the six most popular social media properties as measured by monthly active users. That data continuously informs content ranking and ad targeting systems to improve the user experience.\n\nMeta has developed several artificial intelligence products, from custom AI chips that reduce dependence on Nvidia GPUs to proprietary machine learning models that optimize the performance of ad impressions. CEO Mark Zuckerberg says \"higher quality and more relevant content\" has led to deeper engagement across Facebook and Instagram.\nMeta's earnings increased 20% in the third quarter (excluding a one-time tax charge) and Wall Street estimates adjusted earnings will increase 21% in 2026. That makes the current valuation of 29 times earnings a fair price for patient investors. Among 71 analysts, Meta has a median target price of $840 per share, implying 29% upside from its current share price of $650.\nPure Storage: 45% upside implied by the median target price Pure Storage builds all-flash storage systems and adjacent software that lets enterprises manage file, block, and object storage across private and public clouds. The company has distinguished itself with DirectFlash technology, which eliminates many inefficiencies and bottlenecks associated with traditional solid-state drives by managing raw flash memory at the array level rather than the device level.\n\n\"Our DirectFlash modules deliver two to three times the storage density and consume from 39% to 54% fewer watts per terabyte than our closest competitors today,\" according to the company. Consultancy Gartner recently recognized Pure Storage as the technology leader in enterprise storage platforms, listing automation features, data management capabilities, and strong customer satisfaction as key strengths.\nThe all-flash array market is forecast to grow at 16% annually through 2033 as the AI boom continues. Pure Storage's adjusted earnings increased 16% during the third quarter, but Wall Street anticipates an acceleration to 23% annually through the fiscal year ending in February 2027. That makes the current valuation of 39 times earnings look reasonable.\n\nIndeed, among 23 Wall Street analysts, Pure Storage has a median target price of $100 per share. That implies 45% upside from its current share price of $69.\nShould you buy stock in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $490,703 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,157,689 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 966 % — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of January 4, 2026.\nJPMorgan Chase is an advertising partner of Motley Fool Money. Trevor Jennewine has positions in Nvidia. The Motley Fool has positions in and recommends JPMorgan Chase, Meta Platforms, Nvidia, and Pure Storage. The Motley Fool recommends Broadcom and Gartner. The Motley Fool has a disclosure policy .\nA Once-in-a-Decade Investment Opportunity: The 3 Best AI Stocks to Buy in January 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-01-04",
      "Time": "11:30:19",
      "Source": "Benzinga",
      "Title": "Perplexity CEO Says On-Device AI Threatens Data Centers As Industry Faces '$10 Trillion Question' — Apple, Qualcomm Positioned To Benefit",
      "URL": "https://finance.yahoo.com/news/perplexity-ceo-says-device-ai-033019227.html",
      "Content": "Perplexity CEO Says On-Device AI Threatens Data Centers As Industry Faces '$10 Trillion Question' — Apple, Qualcomm Positioned To Benefit\n\nMohd Haider\nSat, January 3, 2026 at 7:30 PM PST 3 min read\n\nIn this article: AAPL\n\nQCOM\n\nNVDA\n\nPEAI.PVT\n\nHPQ\n\nAravind Srinivas , CEO of Perplexity AI , which is backed by Jeff Bezos and Nvidia Corp. (NASDAQ: NVDA ), issued a contrarian warning about the future of artificial intelligence, saying on-device intelligence running on personal devices could disrupt the centralized data center model driving massive infrastructure investments.\n\nLocalized AI Could Upend Data Center Industry “The biggest threat to a data center is if the intelligence can be packed locally on a chip that’s running on the device and then there’s no need to inference all of it on like one centralized data center,” Srinivas said in a podcast interview with Prakhar Gupta released last week.\nSrinivas, who has previously worked at OpenAI , Google Brain , and DeepMind , said that AI running directly on personal devices could reduce the need for centralized data centers .\n\nDon't Miss:\nThe AI Marketing Platform Backed by Insiders from Google, Meta, and Amazon — Invest at $0.85/Share\nMissed Tesla? EnergyX Is Tackling the Next $200 Billion Opportunity — Lithium\n“That really disrupts the whole data center industry like it doesn’t make sense to spend all this money $500 billion, $5 trillion whatever on building all the centralized data centers across the world,” he said, calling it a “$10 trillion question, hundred trillion dollar question.”\nHe also highlighted scenarios where AI running locally could learn from repeated tasks on individual devices, adapting over time and automating user activities.\n“It adapts to you and over time starts automating a lot of the things you do. That way you don’t have to repeat it. That’s your intelligence. You own it. It’s your brain,” Srinivas said.\n\nTrending: 7 Million Gamers Already Trust Gameflip With Their Digital Assets — Now You Can Own a Stake in the Platform\nChip Companies and OEMs Positioned to Benefit Apple Inc. (NASDAQ: AAPL ) has “a massive advantage” due to its M1 chips and power-efficient devices, according to Srinivas. Qualcomm Inc. (NASDAQ: QCOM ) and original equipment manufacturers, including Apple, Samsung (OTC: SSNLF ), Lenovo (OTC: LNVGF ), and HP Inc. (NYSE: HPQ ) could also benefit from distributing AI-enabled devices.\n\nHowever, technical barriers remain. Srinivas noted that no AI model has yet been released that can run efficiently on a local chip while completing tasks reliably.\nThe Indian-born entrepreneur expects early adoption on MacBooks or iPads before reaching smartphones.\nImplications For Robotics And Labor He also discussed the potential for AI in the physical world, especially in robotics. Srinivas said AI could transform the labor market by automating many tasks now done by humans, echoing concerns raised by Geoffrey Hinton who is often called the ‘Godfather of AI’.\n\nStory Continues\nSee Also: If there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it ?\nIndustry Risks The U.S. economy is becoming increasingly reliant on AI, raising concerns about a potential AI bubble. If such a bubble bursts, centralized data centers could become a “ single point of failure ,” with widespread economic repercussions.\nSrinivas’s caution highlights a crucial question for the AI and tech industries: will centralized data centers continue to be the foundation of the digital economy as AI becomes more dispersed, or will intelligence on personal devices radically transform the sector?\n\nRead Next: Missed the AI Boom's Biggest IPOs? This Platform Lets Everyday Investors Access Private Tech Early\nPhoto courtesy: Shutterstock\nUp Next: Transform your trading with Benzinga Edge's one-of-a-kind market trade ideas and tools. Click now to access unique insights that can set you ahead in today's competitive market.\nGet the latest stock analysis from Benzinga:\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Perplexity CEO Says On-Device AI Threatens Data Centers As Industry Faces '$10 Trillion Question' — Apple, Qualcomm Positioned To Benefit originally appeared on Benzinga.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-01-04",
      "Time": "08:55:00",
      "Source": "Motley Fool",
      "Title": "The Market May Be Underestimating This AI Trend, and These Stocks Are Set to Benefit",
      "URL": "https://finance.yahoo.com/m/558e3699-036e-35c4-a73d-4b1fd7252f9e/the-market-may-be.html",
      "Content": "The Market May Be Underestimating This AI Trend, and These Stocks Are Set to Benefit\n\nManali Pradhan, CFA, The Motley Fool\nSat, January 3, 2026 at 4:55 PM PST 4 min read\n\nIn this article: AVGO\n\nCOHR\n\nKey Points Broadcom is proving to be a key beneficiary in the AI networking market, with around $20 billion of non-accelerator AI backlog.\nCoherent is also benefiting from the ongoing AI networking upgrade cycle.\nAs AI clusters scale beyond 100,000 compute nodes, demand for high-speed, high-bandwidth, low-latency, reliable networking has soared dramatically.\n10 stocks we like better than Broadcom ›\n\nThe rapid expansion of global artificial intelligence (AI) infrastructure is increasingly constrained not by raw compute but by bandwidth, latency, and reliability of the networking interconnects. Hyperscalers are deploying AI clusters with over 100,000 compute nodes (GPUs, accelerators, CPUs) to support large-scale training and inferencing workloads. These clusters require tens of thousands of optical modules to move data efficiently between GPUs, switches, and racks.\nWith copper-based networking unable to keep pace, hyperscalers are adopting 800-gigabit (800G) optical modules at scale, while 1.6-terabit (1.6T) silicon photonics-based interconnects are already in the advanced qualification and early customer adoption stages.\nDespite the scale of this AI networking opportunity, investors have remained disproportionately focused on the GPUs. Here are two companies that can benefit from this underestimated AI trend in 2026.\n\nBroadcom Broadcom (NASDAQ: AVGO) is increasingly seeing strong demand for its AI networking components, as hyperscalers build data center infrastructure ahead of deploying custom accelerators.\nBroadcom exited its fiscal 2025 with AI switch backlog exceeding $10 billion, driven by record bookings for its 102-terabit-per-second Tomahawk 6 switch. The company has also secured record orders for digital signal processors and optical networking components, such as lasers and PCI Express switches. The company reported $73 billion total AI-related backlog to be delivered in the next 18 months, almost half of the $162 billion consolidated backlog. Since nearly $20 billion of the $73 billion backlog is nonaccelerator content, it is evident that networking and optical components are already becoming a material revenue source.\n\nAt the same time, Broadcom's custom accelerator business is still its primary growth engine. The company's AI semiconductor revenue was up 74% year over year in the quarter to $6.5 billion. Management expects AI revenue to double year over year to $8.2 billion in the current quarter.\nConsidering its strong accelerator and networking portfolio, Broadcom is well positioned to capture a significant share of global AI infrastructure buildout.\n\nStory Continues\nCoherent Coherent (NYSE: COHR) designs and sells lasers, optical transceivers, and photonic components that enable high-speed, high-bandwidth, and low-latency data transmission in AI data centers, cloud networks, and telecommunication infrastructure.\nCoherent is already seeing clear AI-driven traction and is well positioned to benefit from the AI networking upgrade cycle. In the first quarter of fiscal 2026 (ending Sept. 30, 2025), revenue was up 17% year over year to $1.58 billion. Data center revenue was up 23% year over year, driven by strong demand from hyperscalers for its high-speed optical connectivity equipment. Coherent experienced record bookings in the first quarter, with some orders extending more than 12 months into the future. This highlights the company's robust revenue visibility, which can help protect it from near-term macro volatility.\n\nThe company has also demonstrated the capabilities of the 1.6T optical transceivers based on three different technologies: silicon photonics, electro-absorption modulated laser (EML), and vertical-cavity surface-emitting laser (VCSEL). While early ramp-ups are underway, the company expects broader adoption as customers scale their AI networks in calendar year 2026.\nWith accelerating 800G deployments, early 1.6T ramps, and expanding bookings backlog, Coherent could see rapid growth in the coming years.\nShould you buy stock in Broadcom right now? Before you buy stock in Broadcom, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Broadcom wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $490,703 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,157,689 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 966 % — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of January 3, 2026.\nManali Pradhan, CFA has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Coherent. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nThe Market May Be Underestimating This AI Trend, and These Stocks Are Set to Benefit was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "NVDA",
      "Date": "2026-01-04",
      "Time": "07:45:07",
      "Source": "TechCrunch",
      "Title": "Tech billionaires cashed out $16 billion in 2025 as stocks soared",
      "URL": "https://finance.yahoo.com/news/tech-billionaires-cashed-16-billion-234507074.html",
      "Content": "Tech billionaires cashed out $16 billion in 2025 as stocks soared\n\nConnie Loizos\nSat, January 3, 2026 at 3:45 PM PST 1 min read\n\nIn this article: AMZN\n\nNVDA\n\nANET\n\nORCL\n\nWhile tech stocks were busy setting records in 2025, the executives behind those companies were equally busy turning their paper fortunes into actual cash — more than $16 billion worth , according to Bloomberg’s analysis of insider trading data.\nJeff Bezos led the way. The Amazon founder sold 25 million shares for $5.7 billion in June and July, right around the time he was getting hitched to Lauren Sanchez in Venice. Oracle’s former CEO Safra Catz wasn’t far behind at $2.5 billion, followed by Michael Dell at $2.2 billion.\n\nNvidia’s Jensen Huang watched his company become the world’s first $5 trillion business, and sold $1 billion along the way. Arista Networks CEO Jayshree Ullal cashed out nearly $1 billion as demand for the company’s high-speed networking gear soared and her personal net worth crossed $6 billion.\nMost of these sales happened through pre-arranged trading plans that executives file in advance; they weren’t spur-of-the-moment decisions. Meta’s Mark Zuckerberg sold $945 million through his foundation, while Palo Alto Networks CEO Nikesh Arora and Robinhood co-founder Baiju Bhatt each pocketed over $700 million.\nThe common thread was an AI-fueled rally that kept pushing tech stocks higher throughout the year.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "NVDA",
      "Date": "2026-01-04",
      "Time": "05:30:00",
      "Source": "Motley Fool",
      "Title": "Nvidia Just Made a Major Move for 2026. Time to Buy?",
      "URL": "https://finance.yahoo.com/m/9b1324ca-b049-31d4-89f6-1620540ba732/nvidia-just-made-a-major-move.html",
      "Content": "Nvidia Just Made a Major Move for 2026. Time to Buy?\n\nAdria Cimino, The Motley Fool\nSat, January 3, 2026 at 1:30 PM PST 5 min read\n\nIn this article: NVDA\n\nKey Points Nvidia has delivered record earnings in recent years as demand for its AI chips skyrocketed.\nBut recent exclusion from one major market has kept the tech giant from reaching its full potential.\n10 stocks we like better than Nvidia ›\nNvidia (NASDAQ: NVDA) delivered top-notch performance over the past two years, with the stock climbing more than 200% over that time period. This is thanks to the company's position in the artificial intelligence (AI) market, one that's on the road to reach into the trillions of dollars in just a few years. Nvidia's dominance in AI chips and related products and services has helped the company's earnings soar to records.\n\nBut one problem weighed on Nvidia throughout most of 2025, and that was sales of chips to China. The U.S. had tightened export controls on chips to that country, and as a result, Nvidia reported a billion-dollar charge earlier in the year for chips that it couldn't sell. Nvidia chief Jensen Huang says China's AI chip market could represent hundreds of billions of dollars by the end of the decade, so this clearly is a market that chip companies want to access.\nA few weeks ago, President Donald Trump gave Nvidia the OK for sales of its H200 chip to China -- and just recently, Nvidia made a related move that could be big for 2026. Let's check it out and determine if now is a good moment to get in on the stock.\nExport controls on AI chips So, first, a bit more background on the Nvidia-China situation. The U.S. initially placed controls on exports to that country and certain others for security reasons back in 2022. In response to that, Nvidia designed the H20 chip to specifically meet guidelines and was able to sell that product in China. In the fiscal 2025 full year, sales to China represented 13% of Nvidia's overall revenue .\n\nBut last year, as mentioned, the U.S. halted sales of even the H20, leaving Nvidia and other U.S. chip designers excluded from the Chinese market.\nMeanwhile, Nvidia continued to deliver solid growth, suggesting that even without sales to China, the company could score an AI win for investors. In the latest quarter, for example, Nvidia's revenue soared 62% to $57 billion amid solid demand for its Blackwell platform. And Nvidia continued to generate strong profitability on sales, maintaining gross margin above 70%. Still, the picture likely would have been even brighter if Nvidia had been able to serve customers in China.\nTrump's big announcement Several weeks ago, Trump announced that Nvidia may return to the China market -- this time with the H200, which is more powerful than the H20 but less powerful than Nvidia's Blackwell chips. As part of the deal, Nvidia must offer 25% of its China chip sales to the U.S.\n\nStory Continues\nNow, let's consider the move that Nvidia reportedly made recently. Nvidia said it aims to begin shipping H200 chips to China, using existing stock, by the middle of next month, Reuters reported, citing sources familiar with the situation. Nvidia also has asked Taiwan Semiconductor Manufacturing , the producer of its chips, to increase production amid orders for two million H200s for 2026, according to the wire service.\n\nThis is fantastic news, but some elements of risk remain. China hasn't yet officially approved the entrance of H200s into the country -- any delay or setback there could be problematic, especially if Nvidia starts ramping up production. Nvidia also faces the complex task of continuing strong production to meet demand for its newer Blackwell platform in the U.S. and other parts of the world, and at the same time producing enough H200s for Chinese customers.\nReason to be optimistic Still, when Trump announced the loosening of export controls, he also said that China's response was positive -- so there's reason to be optimistic about Nvidia's return to that market. As for production, Nvidia has a track record of successful product launches while managing the manufacturing of earlier systems, too. And it's unlikely Nvidia would make a significant move to ramp up H200 production without confidence that its orders could be shipped.\n\nSo, does this potential business in China make Nvidia a buy today? I wouldn't buy Nvidia uniquely for this reason, but renewed sales in China clearly would be a great step forward in 2026. The reason I would buy the stock is the company's overall potential in the global AI market. Nvidia is the AI chip leader, and this is likely to continue due to its focus on innovation and its financial strength. Finally, demand from AI customers remains strong.\nThese three elements make Nvidia a fantastic buy -- and a potential return to the China market in 2026 is icing on the cake.\nShould you buy stock in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $490,703 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,157,689 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 966 % — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of January 3, 2026.\nAdria Cimino has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy .\nNvidia Just Made a Major Move for 2026. Time to Buy? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "NVDA",
      "Date": "2026-01-04",
      "Time": "03:07:00",
      "Source": "Motley Fool",
      "Title": "IonQ Stock in 5 Years: Moon Shot or Crash Landing?",
      "URL": "https://finance.yahoo.com/m/cf33e733-6ac5-3fda-95d6-5f6f7cc61c81/ionq-stock-in-5-years%3A-moon.html",
      "Content": "IonQ Stock in 5 Years: Moon Shot or Crash Landing?\n\nCatie Hogan, The Motley Fool\nSat, January 3, 2026 at 11:07 AM PST 3 min read\n\nIn this article: IONQ\n\nNVDA\n\n005380.KS\n\nMSFT\n\nGOOG\n\nKey Points The quantum-computing specialist reported a huge increase in revenue last quarter.\nIt already works with large customers such as Hyundai, Microsoft Azure, and Google.\n10 stocks we like better than IonQ ›\nThe discussion surrounding quantum computing and its potential use cases has dominated much of the tech headlines in 2025. One of the up-and-coming players is IonQ (NYSE: IONQ) , which makes a trapped-ion system that seeks to solve complex problems more efficiently. If the demand and applications for its technology live up to the hype, IonQ could potentially be the next Nvidia .\n\nIonQ's ability is promising IonQ is moving in the right direction and recently revised its full-year guidance upward to between $106 million and $110 million. In its latest quarter, the company reported a 222% year-over-year increase in revenue.\nIonQ also set a world record for 2-qubit gate performance in 2025, with fidelity exceeding 99.99%. IonQ is the only quantum computing company in the world to cross the \"four-nines\" benchmark. This is a landmark technical achievement, positioning IonQ well to capture a significant share of the future quantum computing market. It already touts an impressive who's who of customers and partners.\n\nIonQ could be a moonshot if the company can deliver on its technology roadmap. The plan is to deploy the world's most powerful quantum computers by 2030 with 2 million qubits. IonQ anticipates that this will have significant implications for drug discovery, materials science, financial modeling, cybersecurity, and defense.\nHow big is the quantum computing market? Skeptics will tell you that IonQ will crash land because quantum computing isn't as effective or applicable in real life as we'd hoped. Five years from now, we'll likely know if the skeptics were correct or off-base.\nIonQ's shareholders have experienced quite a roller-coaster ride over the past year, as the stock peaked at over $84 but has since returned to more reasonable levels. IonQ is still at a premium valuation, but that won't matter to long-term investors if the company can seize on the opportunity in the next five years. If you're a risk-tolerant investor who believes quantum computing is revolutionary, IonQ looks ready to capitalize.\n\nShould you buy stock in IonQ right now? Before you buy stock in IonQ, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and IonQ wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStory Continues\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $490,703 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,157,689 !*\nNow, it’s worth noting Stock Advisor’s total average return is 966 % — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of January 3, 2026.\nCatie Hogan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends IonQ and Nvidia. The Motley Fool has a disclosure policy .\nIonQ Stock in 5 Years: Moon Shot or Crash Landing? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "NVDA",
      "Date": "2026-01-04",
      "Time": "02:50:03",
      "Source": "Motley Fool",
      "Title": "XLK Offers Broader Tech Diversification, While SOXX Targets Semiconductor Stocks. Which Is the Better Investment?",
      "URL": "https://finance.yahoo.com/m/f3dd1c13-5a65-3039-aef2-8d2c581a1456/xlk-offers-broader-tech.html",
      "Content": "XLK Offers Broader Tech Diversification, While SOXX Targets Semiconductor Stocks. Which Is the Better Investment?\n\nKatie Brockman, The Motley Fool\nSat, January 3, 2026 at 10:50 AM PST 5 min read\n\nIn this article: NVDA\n\nAAPL\n\nMSFT\n\nXLK\n\nKey Points XLK is significantly cheaper to own and far larger than SOXX, but its recent returns have lagged the semiconductor-focused fund.\nSOXX is more volatile and suffered a deeper five-year drawdown, reflecting its narrow chip-sector tilt.\nXLK offers broader tech exposure, with mega-cap holdings like Nvidia, Apple, and Microsoft dominating its portfolio.\nThese 10 stocks could mint the next wave of millionaires ›\n\nBoth the iShares Semiconductor ETF (NASDAQ:SOXX) and the State Street Technology Select Sector SPDR ETF (NYSEMKT:XLK) aim to capture U.S. technology growth, but their approaches differ: SOXX zeroes in on the semiconductor segment , while XLK provides diversified exposure across the entire technology sector.\nFor investors comparing these two, the choice comes down to cost, risk profile, and the breadth of tech exposure each fund delivers.\nSnapshot (cost & size) Metric\nSOXX\nXLK\nIssuer\niShares\nSPDR\nExpense ratio\n0.34%\n0.08%\n1-yr return (as of Jan. 2, 2026)\n45.63%\n24.13%\nDividend yield\n0.55%\n0.53%\nAUM\n$17 billion\n$93 billion\nBeta (5Y monthly)\n1.77\n1.26\n\nBeta measures price volatility relative to the S&P 500. The 1-yr return represents total return over the trailing 12 months.\nXLK offers a substantially lower expense ratio than SOXX, which could appeal to investors looking to minimize fees. Both funds offer similar dividend yields, so income-focused investors won't notice a meaningful difference between the two in this regard.\n\nPerformance & risk comparison Metric\nSOXX\nXLK\nGrowth of $1,000 over 5 years\n$2,483\n$2,220\nMax drawdown (5Y)\n-45.75%\n-33.56%\n\nOver the last five years, SOXX delivered stronger growth than XLK, but it also experienced a much deeper maximum drawdown -- reflecting its higher risk and narrower sector focus compared to XLK’s broader tech approach.\nWhat's inside XLK tracks the performance of the Technology Select Sector Index, offering exposure to 70 leading U.S. technology stocks across hardware, software, IT services, and semiconductors.\nIts top holdings -- Nvidia , Apple , and Microsoft -- collectively make up nearly 40% of assets, highlighting a mega-cap tilt. With 27 years of history and over $90 billion in assets under management (AUM), XLK is among the largest and most liquid sector ETFs available.\n\nSOXX, by contrast, is laser-focused on the semiconductor industry, holding just 30 companies. Its largest positions include Nvidia, Advanced Micro Devices , and Micron Technology .\nFor more guidance on ETF investing, check out the full guide at this link .\nWhat this means for investors XLK and SOXX are both tech-centric funds, but they differ in their approaches and goals.\n\nStory Continues\nXLK is much broader, not only in its portfolio size (containing more than twice the number of stocks as SOXX), but in its diversification, too. It includes stocks from various corners of the technology sector, which can help mitigate its risk during periods of volatility.\nSOXX, on the other hand, is devoted entirely to semiconductor stocks. This targeted approach can be both an advantage and a risk. When semiconductor companies are thriving, this ETF can significantly outperform the market. But when this segment of the market stumbles, investors are likely to see much steeper downturns.\n\nCase in point: SOXX has earned much higher 12-month and five-year total returns compared to XLK, but it's also experienced a much more severe max drawdown in that time. With a higher beta, it's also more susceptible to larger price fluctuations.\nWhen choosing between the two funds, investors will need to consider their goals and risk tolerance. SOXX is a higher-risk fund, but it also offers higher earning potential due to its hyperfocus on the fast-growing semiconductor sector. While XLK is also devoted to tech stocks, it offers more diversification that can better protect your portfolio during periods of volatility.\nGlossary ETF: Exchange-traded fund; a pooled investment fund traded on stock exchanges like a stock.\nExpense ratio: Annual fee, as a percentage of assets, that investors pay to own a fund.\nDividend yield: Annual dividends paid by a fund divided by its share price, shown as a percentage.\nAUM: Assets under management; the total market value of assets a fund manages.\nBeta: A measure of a fund's volatility compared to the overall market, usually the S&P 500.\nMax drawdown: The largest observed percentage drop from a fund's peak value to its lowest point over a period.\nSector ETF: An ETF that invests primarily in companies from a specific industry or sector.\nConcentrated risk: Higher risk due to investing in a small number of companies or a single industry.\nMega-cap: Companies with extremely large market capitalizations, typically over $200 billion.\nLiquidity: How easily an asset or fund can be bought or sold without affecting its price.\nTotal return: Investment return including both price changes and dividends or distributions, assuming reinvestment.\nDrawdown: A decline in investment value from a peak to a trough, before a new peak is achieved.\n\nDon’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $489,825 !*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $51,557 !*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $490,703 !*\nRight now, we’re issuing “Double Down” alerts for three incredible companies , available when you join Stock Advisor , and there may not be another chance like this anytime soon.\nSee the 3 stocks »\n*Stock Advisor returns as of January 2, 2026\nKatie Brockman has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Apple, Microsoft, Nvidia, and iShares Trust - iShares Semiconductor ETF. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nXLK Offers Broader Tech Diversification, While SOXX Targets Semiconductor Stocks. Which Is the Better Investment? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-01-03",
      "Time": "20:00:00",
      "Source": "MarketBeat",
      "Title": "MarketBeat Week in Review – 12/29 - 01/02",
      "URL": "https://finance.yahoo.com/m/55e8a625-63db-39d0-ba35-baf18616ffe8/marketbeat-week-in-review-%E2%80%93.html",
      "Content": "MarketBeat Week in Review – 12/29 - 01/02\n\nMarketBeat Staff\nSat, January 3, 2026 at 4:00 AM PST 7 min read\n\nIn this article: NVDA\n\nAVGO\n\nMSFT\n\nRKLB\n\nTSLA\n\nStocks staged a rally on the first day of trading in 2026. It may not be the Santa Claus rally that many investors hoped for, but it aligns with the general sense that the markets will grind higher, despite many stocks being overvalued by traditional metrics.\nLike many of the market rallies in 2025, this one is being led by technology stocks. This may prompt investors to question whether the sector rotation that began in December can be sustained. Or will 2026 be another year when tech stocks, particularly AI stocks, do most of the market&rsquo;s work?\n\nSome of that will hinge on the Federal Reserve&rsquo;s decision on interest rates, which happens in a few weeks. Before then, investors will receive the December Jobs report next Friday, and the week of Jan. 12 will kick off the fourth-quarter earnings season.\n&rarr; Hi Ho Silver Away! Silver Breaks $80 as Poor Man's Gold Explodes\nThe bottom line for investors is that 2026 is shaping up to be just as volatile as 2025. The MarketBeat analysts will continue to analyze the stocks and themes that can affect your portfolio. Here are some of our most popular articles from this week.\nArticles by Thomas Hughes\n&rarr; D-Wave vs. IonQ vs. IBM vs. Google: Which Quantum Bets Will Win 2026?\nThe calendar now reads 2026, but in terms of the stocks that will post strong gains in January, Thomas Hughes has a list of five stocks that evoke 2025 vibes, as artificial intelligence (AI) will continue to be a dominant theme.\n\nOne of the stocks on that list is Micron Technology Inc. (NASDAQ: MU). In a separate article this week, Hughes wrote why Micron stock&rsquo;s end-of-the-year surge will lead to higher highs in 2026.\n&rarr; MarketBeat Week in Review – 12/29 - 01/02\nNVIDIA Corp. (NASDAQ: NVDA) wasn&rsquo;t on that list. Nevertheless, Hughes explained why the company still has a constructive long-term setup in the AI trade that is making analysts bullish for 2026.\nArticles by Sam Quirke\nInvesting in Tesla Inc. (NASDAQ: TSLA) is never boring. This week, Sam Quirke helped investors understand the reason for the recent multi-day slide in TSLA stock and why the first few sessions of 2026 may have a lot to say about the near-term direction of TSLA stock.\nAmazon.com Inc. (NASDAQ: AMZN) ended 2025 nearly where it started. Quirke pointed out why the stock is in a consolidation phase and what investors need to hear in the company&rsquo;s upcoming earnings report that could spark a strong upside move.\n2025 was another strong year for technology stocks. However, Quirke highlighted several well-known large-cap stocks that are objectively oversold. Investors seeking asymmetric upside might consider these three names as recovery opportunities in 2026.\n\nStory Continues\nArticles by Chris Markoch\nEnergy stocks are likely to have a strong year due to the power needs of data centers. This week, Chris Markoch focused on two under-the-radar energy stocks&ndash;one in natural gas and the other in nuclear&ndash;and explained why each may have a bullish setup in 2026.\nThe next Fed decision on interest rates is still weeks away, but it is likely to move markets. Markoch, however, focused on three financial stocks that are likely to benefit regardless of the direction rates move.\n\nMicrosoft Corp. (NASDAQ: MSFT) stock was a market laggard in 2025. But Markoch explained that despite moderating growth expectations, the company&rsquo;s business model and free cash flow support a buy-and-hold decision.\nArticles by Ryan Hasson\nMany stocks in the S&P 500 outperformed the index in 2025, but there was a much smaller list that crushed the index. This week, Ryan Hasson highlighted the three best-performing stocks in the S&P 500 over the last 12 months and what that could mean for 2026.\nRocket Lab (NASDAQ: RKLB) was a good example of a stock rising to meet the company&rsquo;s story in 2025. RKLB stock was up more than 180% in 2025, and Hasson explained why 2026 could be another breakout year.\nThe biggest market gains have centered on growth stocks, but Hasson reminded investors that there&rsquo;s still room for a disciplined dividend strategy. This week, Hasson pointed investors toward five of MarketBeat&rsquo;s top-rated dividend stocks heading into 2026.\n\nArticles by Leo Miller\nBroadcom Inc. (NASDAQ: AVGO) had a volatile December that put extra attention on some recent insider selling. Leo Miller helped investors understand the reasons behind the sales and why, like with many insider sales, they shouldn&rsquo;t panic.\nAI infrastructure stocks will continue to be top picks in 2026. Savvy investors understand why that category extends beyond chipmakers. This week, Leo Miller analyzed three picks-and-shovels stocks to invest in the AI buildout.\nEli Lilly & Co. (NYSE: LLY) is the dominant name in the GLP-1 weight loss market. However, as Miller noted, the company isn&rsquo;t resting on its laurels. The company is advancing two additional weight loss drugs in 2026, with one up for approval. Positive or negative results will go a long way to charting the near-term course for LLY stock.\n\nArticles by Nathan Reiff\nSmall-cap stocks may benefit from the January effect. This week, Nathan Reiff explained what that means for investors and provided a list of three small-cap exchange-traded funds (ETFs) that can provide broad exposure to this class of stocks.\nQuantum computing stocks will continue to draw investor attention in 2026. However, investor dollars may become more targeted. Reiff analyzed two pure-play names that have a chance to become profitable in the long run and two large-cap tech giants that offer stock pickers a safer way to play the sector.\nArticles by Dan Schmidt\nGold and silver led a strong move in precious metals in 2025. Many of the reasons for that debasement trade remain in place for 2026. For investors who want alternatives to investing in physical metals, Dan Schmidt analyzed three Canadian mining stocks that should do well, particularly if the U.S. dollar strengthens over the Canadian dollar.\n\nArticles by Jeffrey Neal Johnson\nJeffrey Neal Johnson wrote this week about the Application Layer that will be at the forefront of the AI trade. Like the internet buildout, the focus of investors is increasingly turning to the companies that can monetize AI. Johnson explained why three AI pure plays will continue to grow in 2026.\nBefore the ball dropped in 2025, NVIDIA generated its own fireworks with its announcement of its $20 billion acquisition of Groq&rsquo;s assets and leadership. Johnson explained why this marks a key shift in the chip sector as it relates to AI and provided insights into ways to invest in the trend.\nAnother significant announcement to close out 2025 was the Trump administration&rsquo;s executive order to expedite the rescheduling of cannabis. As Johnson noted, this isn&rsquo;t the green light that many investors still hope for, but it does remove some caution flags in terms of cannabis companies and the tax code.\n\nArticles by Jordan Chussler\nMany of the Magnificent Seven stocks were still solid in 2025, but more than half underperformed the S&P 500. However, Jordan Chussler explained why that could be an opportunity for investors. Each one gives investors plenty of reasons to believe they could outperform the index in 2026.\nMuch of the focus on mining stocks centers around gold and silver for good reason. However, one small-cap miner serves as a reminder that investors shouldn&rsquo;t overlook lithium. This week, Chussler explained why this under-the-radar mining stock was up over 1,000% in 2025 and may still have room to run.\nThe article \" MarketBeat Week in Review – 12/29 - 01/02 \" was originally published by MarketBeat.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "2303.TW",
      "Date": "2026-01-03",
      "Time": "09:52:04",
      "Source": "Yahoo奇摩股市",
      "Title": "聯電ADR2日下跌0.02美元跌幅0.25%折台股49.26元",
      "URL": "https://tw.stock.yahoo.com/news/%E8%81%AF%E9%9B%BBadr2%E6%97%A5%E4%B8%8B%E8%B7%8C0-02%E7%BE%8E%E5%85%83%E8%B7%8C%E5%B9%850-25-%E6%8A%98%E5%8F%B0%E8%82%A149-26%E5%85%83-015204367.html",
      "Content": "<table class=\"atom-table w-full mb-module-gap\"><thead><tr><th><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">聯電 ADR 近十個交易日行情</p></th></tr></thead><tbody><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">交易日</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">收盤價</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">漲跌</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">漲跌幅%</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">匯率</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">折台股</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">1/ 2</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">7.84</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-0.02</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-0.25</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.419</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">49.2</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/31</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">7.86</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-0.10</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-1.26</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.438</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">49.4</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/30</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">7.96</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-0.01</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-0.13</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.428</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">50.0</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/29</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">7.97</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-0.05</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-0.62</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.450</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">50.1</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/26</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">8.02</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.02</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.25</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.455</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">50.4</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/24</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">8.00</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.03</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.38</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.480</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">50.3</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/23</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">7.97</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-0.16</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-1.97</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.508</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">50.2</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/22</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">8.13</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.03</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.37</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.523</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">51.2</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/19</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">8.10</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.03</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.37</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.526</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">51.0</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/18</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">8.07</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.07</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.88</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.516</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">50.8</p></td></tr></tbody></table>\n\n(中央社台北2026年 1月 3日電)聯電在NYSE掛牌 ADR以7.84美元作收，下跌0.02美元，跌幅 0.25%。\n\n由於每單位聯電 ADR相當於台股 5股聯電普通股，以 1月 2日新台幣匯市收盤價31.419元計算，相當台股聯電每股為 49.26元。\n\n最近10個交易日行情如下：",
      "Language": "zh"
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-01-03",
      "Time": "08:00:46",
      "Source": "Yahoo Finance Video",
      "Title": "December jobs report, earnings, CES 2026: What to Watch",
      "URL": "https://finance.yahoo.com/video/december-jobs-report-earnings-ces-000046216.html",
      "Content": "December jobs report, earnings, CES 2026: What to Watch\n\nYahoo Finance Video and Jared Blikre\nFri, January 2, 2026 at 4:00 PM PST\n\nIn this video: APLD\n\nPENG\n\nSTZ\n\nAEHR\n\nAMD\n\nMarket Domination Overtime host Jared Blikre previews several of the biggest stories to come next week, including the release of the December jobs report next Friday; earnings results from companies like Constellation Brands ( STZ ), Albertsons ( ACI ), Applied Digital ( APLD ), and Tilray Brands ( TLRY ); and the start of the 2026 Consumer Electronics Show (CES) on Monday with keynotes from Nvidia ( NVDA ) CEO Jensen Huang and Advanced Micro Devices ( AMD ) CEO Lisa Su.\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime .\n\nVideo Transcript\n\n00:03 Speaker A\nTime now for what to watch, starting off on the labor front.\n00:06 Speaker A\nWe're going to be getting a bunch of new jobs data throughout the week, including the December jobs report on Friday. Economists forecasting the US economy to add 55,000 new jobs\n00:15 Speaker A\nwhile unemployment edges down to 4 and a half% and hourly wages tick up to 0.3% on a month-over-month basis.\n00:23 Speaker A\nAhead of the monthly jobs report, we're going to get the ADP reading on private payrolls. That is expected to show growth in December, 48,000 jobs added,\n00:30 Speaker A\nsignaling a rebound in hiring momentum following the longest government shutdown in US history.\n00:37 Speaker A\nAnd we've got some earnings to be tracking. We're going to be hearing from several names in the food and beverage sectors including Albertson's, Calmane and Constellation Brands.\n00:44 Speaker A\nConstellation announcing results for the third quarter on Wednesday. Analysts expecting earnings to fall sharply in Q3, driven by alcoholic beverage company selling off big chunks of its wine and spirits business.\n00:54 Speaker A\nAnd finally, the 2026 Consumer Electronics show, or CES, is kicking off in Las Vegas. Nvidia CEO Jensen Wang giving a presentation on AI on Monday.\n01:04 Speaker A\nAMD CEO Lisa Sue is also giving a keynote address at the conference on Monday, and Yahoo Finance will have coverage from the event throughout the week including an interview with the CFO of Qualcomm.\n01:13 Speaker A\nYou don't want to miss it.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AMD",
      "Date": "2026-01-03",
      "Time": "07:07:00",
      "Source": "TheStreet",
      "Title": "Nvidia, AMD in focus ahead of key event",
      "URL": "https://finance.yahoo.com/m/41695bd7-ee27-36be-a002-40f17e5366a9/nvidia%2C-amd-in-focus-ahead-of.html",
      "Content": "Nvidia, AMD in focus ahead of key event\n\nMoz Farooque\nFri, January 2, 2026 at 3:07 PM PST 4 min read\n\nIn this article: NVDA\n\nAMD\n\n^SOX\n\nAs January gets underway, AI stocks are in for a kicker at the CES event.\nNvidia ( NVDA ) and Advanced Micro Devices ( AMD ) are in the spotlight, with both expected to use the event as a stepping stone to shape the next phase of the AI race.\nHaving covered multiple tech cycles over the past several years, I know that stock markets typically don’t turn on earnings alone.\n\nThey need market-moving catalysts to give the narrative a much-needed kick in the pants.\nAI chip stocks, in particular, have had a rough time of late.\nFor color, the PHLX Semiconductor Index dropped nearly 5% from its December 10 record ( 7,490 ) to its December 31 close ( 7,083 ).\nNevertheless, according to Wedbush Securities , both AI bellwethers are positioned to deliver some of the conference’s most compelling headlines.\nWedbush says Nvidia, AMD expectations at stake for CES 2026 For Nvidia, CEO Jensen Huang will take the stage in his signature leather jacket to reinforce the AI leader's vision around data centers, robotics, and what Wedbush calls the next phase of the AI revolution.\nAMD will have its own moment, with CEO Lisa Su delivering the opening keynote, featuring key updates across PCs, data centers, and edge AI.\n\nWith valuations mostly stretched and expectations running high, the CES event could therefore help set the tone for what’s to come for these AI giants in 2026.\nMore Tech Stocks:\nMorgan Stanley sets jaw-dropping Micron price target after event\nNvidia’s China chip problem isn’t what most investors think\nQuantum Computing makes $110 million move nobody saw coming\nMorgan Stanley drops eye-popping Broadcom price target\nApple analyst sets bold stock target for 2026\nWedbush sees CES as a critical opening act for Nvidia and AMD , as expectations run sky-high.\nWedbush analysts offered further insight.\nAnalysts also expect updates linked to Nvidia’s robust software platforms, including gaming and simulation, underscoring that its AI story extends far beyond hyperscale customers.\n\nFor AMD , Wedbush expects major Ryzen updates and concrete updates around AI PCs, data centers, and edge computing. Moreover, AMD will be looking to build a platform, not just offer alternatives.\nCES 2025 recap: what Nvidia and AMD showed last year That said, here’s the lowdown from last year’s event for both tech giants.\nNvidia showed off its powerful Cosmos platform for “physical AI,” positioning it as a foundation for real-world deployment.\nNvidia introduced Blackwell-based GeForce RTX 50 Series GPUs while highlighting new RTX-PC AI tooling (including NIM microservices/Blueprints).\nAMD rolled out its AI PC portfolio, covering Ryzen AI Max/Max PRO , and expanded Ryzen AI 300 chips tailored to Copilot+ PCs.\nAMD leaned into gaming/graphics with Ryzen X3D desktop chips and Ryzen Z2 handheld processors. Also, it offered previews of the Radeon RX 9070- series (RDNA 4) GPUs and FSR 4.\n\nStory Continues\nAt CES 2026, the real fight is over AI CES 2026 runs January 6 to 9 in Las Vegas , and though it has historically been more of a gadget showcase, this year it’s shaping up to be the year’s first high-stakes tech meeting.\nInvestors expect a needle-moving event, spearheaded by concrete roadmaps, partnerships, and major commitments.\nFor the biggest chipmakers, CES will be all about owning the AI conversation early . Nvidia will seek to reinforce its dominance by rallying partners with demos, keynotes, and industry-wide signaling.\n\nRelated: Cathie Wood shells out $1.3 million on biotech stock\nAMD will look to rain on Nvidia’s parade.\nBy spotlighting new PC platforms and capitalizing on a larger OEM market share , AMD will aim to carve out its own lane for AI-driven growth.\nFor perspective, the AI trade has lost its luster lately, and big-name skepticism targets are growing louder.\nFront and center is the “Big Short” Michael Burry , who is openly comparing the current AI frenzy to past manias.\nBurry delivered a scathing takedown of Nvidia.\nThat’s exactly why Nvidia and AMD will be looking for a strong start to set the tone early in 2026.\nBig banks reset targets on Nvidia and AMD Nvidia and AMD both had a solid outing at the stock market last year.\nFor perspective, Nvidia stock ended 2025 up 41% , while AMD posted an 83% gain .\nNow, Wall Street is recalibrating its expectations for 2026, with investors in “show-me” mode when it comes to AI.\nBank of America : Nvidia buy, $275 price target; AMD buy, $300 price target\nSource: Investing.com\nMorgan Stanley : Nvidia overweight, $250 price target; AMD equal weight, $260 price target\nUBS : Nvidia buy, $235 price target; AMD buy, $300 price target\nGoldman Sachs : Nvidia buy , $250 price target; AMD neutral, $210 price target\nSource: Investing.com\nJPMorgan : Nvidia overweight , $250 price target; AMD neutral, $270 price target\nSource: Barron's\nRelated: Veteran analyst resets AI stock buy list for 2026\nThis story was originally published by TheStreet on Jan 2, 2026, where it first appeared in the Technology section. Add TheStreet as a Preferred Source by clicking here.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "ADI",
      "Date": "2026-01-03",
      "Time": "05:10:16",
      "Source": "Insider Monkey",
      "Title": "Analog Devices, Inc. (ADI) Balances Analyst Optimism With Insider Share Sale",
      "URL": "https://finance.yahoo.com/news/analog-devices-inc-adi-balances-211016300.html",
      "Content": "Analog Devices, Inc. (ADI) Balances Analyst Optimism With Insider Share Sale\n\nLaiba Immad\nFri, January 2, 2026 at 1:10 PM PST 1 min read\n\nIn this article: ADI\n\nWe recently compiled a list of the 10 Best Long-Term Investments for Kids . Analog Devices, Inc. stands third among the best long-term investments.\nTheFly reported on December 19 that Truist Securities analyst William Stein maintained a Hold rating on ADI while raising the price target to $291 from $258. The update reflects the firm’s latest assessment of the company’s valuation outlook, though the Hold rating indicates a cautious stance on near-term stock movement.\nAdditionally, on December 18, a Form 4 filing with the SEC revealed that Martin Cotter, Senior Vice President of Vertical Business Units at Analog Devices, Inc. (NASDAQ:ADI), sold 5,000 shares of common stock on December 17. The transaction was executed at an average price of $271.19, totaling approximately $1.36 million. Following this sale, Cotter retains direct ownership of 59,664 shares, valued at roughly $16.18 million.\n\nAnalog Devices, Inc. (NASDAQ:ADI) is a global semiconductor leader headquartered in Wilmington, Massachusetts, that designs, manufactures, tests, and markets analog, mixed-signal, and digital signal processing integrated circuits (ICs), software, and subsystems used to bridge the physical and digital worlds.\nWhile we acknowledge the potential of ADI as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now . Disclosure: None.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-01-03",
      "Time": "05:02:24",
      "Source": "Yahoo Finance Video",
      "Title": "CES 2026: Nvidia, AMD, Intel, & more to make announcements",
      "URL": "https://finance.yahoo.com/video/ces-2026-nvidia-amd-intel-210224074.html",
      "Content": "CES 2026: Nvidia, AMD, Intel, & more to make announcements\n\nYahoo Finance Video\nFri, January 2, 2026 at 1:02 PM PST\n\nIn this video: AMD\n\n005380.KS\n\n005385.KS\n\n005387.KS\n\n005389.KS\n\nThe 2026 Consumer Electronics Show (CES) is coming up next week in Las Vegas.\nYahoo Finance Technology Editor Dan Howley sits down with Yahoo Finance Markets and Data Editor Jared Blikre on Market Domination to explain what investors should expect from the event and from key names like Nvidia ( NVDA ) and AMD ( AMD ).\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination .\n\nVideo Transcript\n\n00:00 Speaker A\nIt is a new year and to kick it off in style, the Consumer Electronics show will be one of the biggest tech conferences. CES is kicking off on January 6th under the bright lights of Las Vegas, and tech editor Dan Howley is here with what to expect. Dan, tell us.\n00:15 Dan Howley\nYeah, Jared, there's going to be a number of big announcements at this year's show. The the first obviously, will probably, and biggest, be out of Nvidia. They're hosting their own press event on January 5th. CEO Jensen Wong will take the stage. He did it last year as well. They announced a number of new products, a new chip for a smaller bitesize desktop AI computer, as well as a number of different software innovations that they've really been pushing as of late. They also brought out their kind of digital army of robots. It was basically a a a video recording uh and then a little tiny robot uh care of Star Wars uh took the stage alongside of him.\n00:54 Dan Howley\nUh outside of Nvidia, we're also expecting to see AMD host their own press event with CEO Lisa Sue. Uh we'll see Intel and Qualcomm both host press events as well related to their respective chips. Uh and then overall, we should see a ton of AI. I mean, you know, the chips themselves are are, you know, obviously enough to say that AI is going to dominate, but uh you can expect to see a lot of robots, uh a lot of smart home devices. You can even see some wearables that are AI powered. And those usually, you know, so far we haven't seen anything too interesting as far as AI powered wearables outside of maybe, you know, the intelligence built into smart glasses or smart watches. There's never been a dedicated device that's really taken off. Open AI is supposedly working on one, don't expect it at CES. Uh and then finally, uh Autos. Autos have been a big part of CES as of late.\n01:54 Dan Howley\nUh they continue to do so and we'll likely see things ranging from flying cars to uh different types of boats. Uh we know that there'll be some major automakers like Hyundai on hand, uh Sony and Honda, their uh Afeela vehicle will be there as well. Uh and so it's going to be a jam-packed show, but again, I think the big takeaway is going to be from Nvidia. They're the the hottest uh company on the market right now and what they're doing in AI as well as AI from the the rest of the companies at the show.\n02:18 Speaker A\nDan, we got about 30 seconds. So I'm just going to ask you real quickly, any surprises over the last few weeks that have jumped into your attention span uh that might kind of give us a hint of what 2026 has in store for us in tech?\n02:32 Dan Howley\nYeah, I mean the the Nvidia Groc uh kind of licensing deal, non-exclusive licensing deal. Uh I think it was estimated $20 billion. That was really interesting and it just kind of shows where Nvidia sees its its future at this point, you know, making these kinds of investments and new types of chip technologies or different types of chip tech chip technologies to really hold on to the lead that it has.\n03:00 Dan Howley\nUh you know, I I think we're going to continue to see these kinds of not necessarily acquisitions, but you know, licensing agreements will hire some executives from a company, uh things along those lines. Uh they really kind of became popular in 2025 and I think we'll continue to see them through 2026. It's a a way for companies to kind of avoid the scrutiny of acquiring a company, taking it over entirely, while still getting some of that knowhow and IP.\n03:22 Speaker A\nAll right, Dan, appreciate it. We'll see you soon.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AMD",
      "Date": "2026-01-03",
      "Time": "05:00:33",
      "Source": "Yahoo Finance",
      "Title": "Stock market today: Dow, S&P 500 edge higher to kick off 2026, semiconductor stocks rally",
      "URL": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-edge-higher-to-kick-off-2026-semiconductor-stocks-rally-210033381.html",
      "Content": "Stock market today: Dow, S&P 500 edge higher to kick off 2026, semiconductor stocks rally\n\nBrett LoGiurato and Jake Conley\nFri, January 2, 2026 at 1:00 PM PST 2 min read\n\nIn this article: ^GSPC\n\n^DJI\n\n^IXIC\n\nTSLA\n\nGC=F\n\nUS stocks mostly edged higher on Friday as Wall Street kicked off trading in 2026 after its third consecutive year of double-digit percentage gains .\nThe Dow Jones Industrial Average ( ^DJI ) gained about 0.6%, while the S&P 500 ( ^GSPC ) increased 0.2%.\nThe tech-heavy Nasdaq Composite ( ^IXIC ) fell below the flat line, despite gains in semiconductor giants Nvidia ( NVDA ), AMD ( AMD ), and Micron ( MU ).\n\nShares of Tesla ( TSLA ) fell after the EV maker's deliveries missed expectations.\nMarkets are coming off a sputtering end to a roller-coaster 2025 that nevertheless ended with sizable gains for the major indexes. The benchmark S&P 500 rose over 16% for the year, while the Nasdaq Composite led gains with a more-than 20% jump.\n\nNow the focus turns to 2026, though the year will likely begin in earnest come Monday. For stocks, the outlook calls for more optimism. Every Wall Street forecaster tracked by Bloomberg is predicting that stocks will rally for a fourth consecutive year . But plenty of risks remain: The AI boom could falter, the US economy could surprise, and President Trump, of course, remains a wild card as the fate of his most sweeping tariffs could become clearer this month.\nGold ( GC=F ) and silver ( SI=F ) advanced to open the 2026 trading year, with the precious metals building on their best annual performances since 1979, and aluminum ( ALI=F ) crossed $3,000 per ton for the first time since 2022.\n\nWall Street's bid for a \"Santa Claus rally\" — during the last five trading days of December and first two of January — has so far sputtered. The S&P 500 is down nearly 1% in the period, with investors looking at a third consecutive down \"Santa\" period.\nAmong the top items on Wall Street's 2026 list is the Federal Reserve, where the divisions that have gripped the central bank in 2025 look likely to continue this year. President Trump has promised this month to appoint a new chair to replace Jerome Powell. For now, most traders expect the central bank to hold steady on interest rates later this month, though bets are more split for March's meeting.\nLIVE COVERAGE IS OVER 19 updates\nFri, January 2, 2026 at 9:01 PM UTC Ines Ferré\n\nDow, S&P 500 kick off the first day of trading with gains Stocks kicked off the first day of trading with modest gains as semiconductor stocks lifted the S&P 500 ( ^GSPC ).\nThe broad-based index gained nearl 0.2%, while the Dow Jones Industrial Average ( ^DJI ) rose 0.6%. The tech-heavy Nasdaq Composite ( ^IXIC ) fell just below the flatline.\nTech giant Microsoft ( MSFT ) fell 2% while Tesla ( TSLA ) declined more than 2% on the heels of disappointing deliveries.\n\nInvestors await Jan. 6 when the Consumer Electronics Show in Las Vegas kicks off, featuring Nvidia ( NVDA ) CEO Jensen Huang and AMD ( AMD ) CEO Lisa Su. Artificial intelligence will be front and center at the trade show.\n\nFri, January 2, 2026 at 8:15 PM UTC Ines Ferré\n\nCES 2026: What to expect from the tech industry’s biggest show of the year Inbox Yahoo Finance's Dan Howely reports:",
      "Language": "en"
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-01-03",
      "Time": "05:00:06",
      "Source": "Investor's Business Daily",
      "Title": "Funds Plow Money Into AppLovin, Broadcom, Google — And This Top 100 Stock",
      "URL": "https://finance.yahoo.com/m/27ad62cb-8474-3e41-b47b-5d23f46f707e/funds-plow-money-into.html",
      "Content": "Funds Plow Money Into AppLovin, Broadcom, Google — And This Top 100 Stock\n\nMATTHEW GALGANI\nFri, January 2, 2026 at 1:00 PM PST 2 min read\n\nIn this article: AEIS\n\nAPP\n\nAVGO\n\nGOOG\n\nOne of the best stocks of 2025 and in demand among the best mutual funds, Advanced Energy looks to power a new breakout.\n\nContinue Reading\n\nAGB und Datenschutzerklärung\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AMD",
      "Date": "2026-01-03",
      "Time": "03:34:30",
      "Source": "GuruFocus.com",
      "Title": "AMD Shares Are Climbing -- AI Memory Demand Fuels Analyst Optimism",
      "URL": "https://finance.yahoo.com/news/amd-shares-climbing-ai-memory-193430129.html",
      "Content": "AMD Shares Are Climbing -- AI Memory Demand Fuels Analyst Optimism\n\nNauman Khan\nFri, January 2, 2026 at 11:34 AM PST 1 min read\n\nIn this article: AMD\n\nThis article first appeared on GuruFocus .\nAdvanced Micro Devices ( NASDAQ:AMD ) shares climbed about 5% on Friday as analysts grew more upbeat about the company's earnings power.\nWarning! GuruFocus has detected 5 Warning Signs with AMD.\nIs AMD fairly valued? Test your thesis with our free DCF calculator.\n\nWall Street sees booming AI-related demand for high-performance computing and data-center memory as a key growth driver. New Ryzen and EPYC processors, along with refreshed AI accelerators, are strengthening AMD's product mix.\nTighter graphics-memory supply has supported higher GPU prices, helping margins, analysts say. Several brokerages have fine-tuned price targets and lifted estimates in recent sessions.\nTrading activity and technical signals point to strong buy sentiment, while AMD's market cap tops hundreds of billions, reflecting investor optimism.\nMany analysts expect memory revenue to remain strong into early 2026 as data centers shift from hard drives to faster SSDs, supporting long-term demand.\nAnalysts and investors will watch upcoming earnings, product rollouts and chip supply dynamics for signs that AI demand is sustainable into 2026.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AMD",
      "Date": "2026-01-03",
      "Time": "03:34:26",
      "Source": "GuruFocus.com",
      "Title": "Intel Stock Rises as Panther Lake Launch and Foundry Ambitions Drive Optimism",
      "URL": "https://finance.yahoo.com/news/intel-stock-rises-panther-lake-193426097.html",
      "Content": "Intel Stock Rises as Panther Lake Launch and Foundry Ambitions Drive Optimism\n\nNauman Khan\nFri, January 2, 2026 at 11:34 AM PST 1 min read\n\nIn this article: INTC\n\nNVDA\n\nAMD\n\nTSM\n\nThis article first appeared on GuruFocus .\nIntel Corp ( NASDAQ:INTC ) shares rose about 5% on Friday as U.S. stocks are firmer to start 2026, as heavyweight chip names stabilized after late-2025 declines.\nInvestors are probing Intel's ( NASDAQ:INTC ) manufacturing roadmap and its ability to translate process gains into steadier earnings and foundry wins.\n\nA key focus is Panther Lake, Intel's next laptop processor on the 18A node, which is central to rebuilding its manufacturing edge.\nWarning! GuruFocus has detected 5 Warning Signs with AMD.\nIs AMD fairly valued? Test your thesis with our free DCF calculator.\nThe foundry narrative is mixed. Reuters reported Nvidia tested Intel's 18A process but did not proceed, while Intel said 18A work is progressing and seeing interest in its 14A technologies.\nNvidia's ( NASDAQ:NVDA ) $5 billion purchase of Intel shares underscores high-profile partnerships that may bolster confidence.\nTraders will watch Intel's quarterly update and data on manufacturing yields, with estimating earnings date of Jan. 29.\nCompetition from Advanced Micro Devices ( NASDAQ:AMD ) and Taiwan Semiconductor Manufacturing ( NYSE:TSM ) is a benchmark for Intel's progress.\nNear-term moves in Intel stock are likely to track chip-sector sentiment and macro data that shifts rate-cut expectations.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-01-03",
      "Time": "02:45:00",
      "Source": "MarketBeat",
      "Title": "3 Cash-Flow Machines Investors May Want Heading Into 2026",
      "URL": "https://finance.yahoo.com/m/dd82047c-0306-3d5b-806e-1d4f7a5101d2/3-cash-flow-machines.html",
      "Content": "3 Cash-Flow Machines Investors May Want Heading Into 2026\n\nNathan Reiff, MarketBeat\nFri, January 2, 2026 at 10:45 AM PST 4 min read\n\nIn this article: QCOM\n\nXOM\n\nGILD\n\nKey Points Strong cash flow is a crucial indicator of a company's healthy operations, enabling it to pay down debt, enhance shareholder value, and sustain long-term growth.\nSemiconductor firm Qualcomm stands out for its 15% year-over-year cash flow growth in the last quarter.\nGilead Sciences and Exxon Mobil both have healthy cash flows, allowing for attractive dividend distributions.\nInterested in QUALCOMM Incorporated? Here are five stocks we like better.\n\nOf the host of financial metrics investors might consider when deciding whether to buy shares of a target company, cash flow is among the most important. Operating cash flow is a reflection of how a firm actually functions on a day-to-day basis and demonstrates the company's ability to bring in money from sales or other sources and to adequately pay salaries, taxes, and other expenses. Free cash flow, on the other hand, shows what is left over to the company after accounting for operating expenses and capital expenditures (CapEx)—this is the discretionary cash available for things like expansion, shareholder returns, mergers and acquisitions, and more.\nA company's cash flow keeps it operating, supports the possibility of growth and expansion, and lowers the risk of bankruptcy. Many investors also find it a metric that is more difficult to manipulate in a financial report than net income, which may look better or worse depending upon accounting methods. Heading into the new year, investors looking for strong cash flow might start with some of the firms below.\n\n→ Hi Ho Silver Away! Silver Breaks $80 as Poor Man's Gold Explodes\nRecord Free Cash Flow for a Growing Semiconductor Firm Qualcomm Inc. (NASDAQ: QCOM) is a major provider of semiconductors for use in phones, vehicles, and various smart devices. Shares displayed fairly steady momentum in the last two-thirds of 2025, trending upward from April through the end of the year, but Qualcomm's rally has still brought it short of the astronomical valuations of some of its semiconductor rivals.\n\nFor investors looking for cash-generating potential, though, Qualcomm may stand out thanks to its $12.8 billion in free cash flow in the most recently reported quarter, up 15% year-over-year (YOY) and a quarterly record for the company. Operating cash flow also increased significantly as well, thanks to particularly strong sales growth in both Qualcomm's handset and automotive divisions. This means that, despite significant capital spending, Qualcomm ended the quarter with about $7.8 billion in cash reserves—this is mostly unchanged YOY, but indicates a strong financial position heading into the next quarter.\n\nStory Continues\n→ D-Wave vs. IonQ vs. IBM vs. Google: Which Quantum Bets Will Win 2026?\nQualcomm's healthy cash flow should allow it to continue its efforts to expand into high-demand data centers in 2026, while simultaneously keeping up its commitment to strong shareholder returns—the company's dividend yield is an attractive 2.08%.\n\nHigh Margins and Growing Sales Drive Continued Cash Flow Success Biopharma giant Gilead Sciences Inc. (NASDAQ: GILD), known for its antiviral therapies for HIV, hepatitis, and more, benefits from climbing sales and strong margins. In the latest quarter, for instance, its HIV medication Descovy saw sales surge by 20% YOY. Gilead also does not rely on a single product or even a particular medical focus, with a broad portfolio covering liver disease, oncology applications, and more.\n\n→ MarketBeat Week in Review – 12/29 - 01/02\nFree cash flow for the last quarter was almost $4 billion alongside noteworthy operating cash flow of $4.1 billion. Cash flow is especially important for a biopharmaceutical company because the industry requires massive continual investment in R&D. Gilead is in a healthy position to keep developing its pipeline thanks to its cash reserves and flow.\nHaving cash on hand also allows the company to pay out a compelling dividend ahead of many of its healthcare sector peers, with a dividend yield of 2.57% and a payout ratio of just under 49%. Shares of GILD climbed by more than a third in 2025, but analysts still see room for further growth in the new year.\nHuge Oil and Gas Operation Still Maintains Strong Cash Flow The second-largest oil and gas company globally by market capitalization, Exxon Mobil Corp. (NYSE: XOM) is valued at more than half a trillion dollars, with cash flow in line with that scale as well as the company's large upstream and refining business.\nOperating cash flow was $14.8 billion in the latest quarter, and free cash flow came in at $6.3 billion despite fairly high CapEx.\n\nThis is to be expected from the oil and gas industry, which is significantly capital-intensive.\nDespite its massive size, Exxon maintains healthy liquidity and cash flow.\nNot only is this key to its continued operational success and potential expansion, but it has also allowed the company to be a major dividend player, with a yield of 3.42% and more than four decades of consistent increases.\nThe article \" 3 Cash-Flow Machines Investors May Want Heading Into 2026 \" was originally published by MarketBeat.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-01-03",
      "Time": "01:43:00",
      "Source": "Motley Fool",
      "Title": "Is Broadcom Stock a Buy After the Dip?",
      "URL": "https://finance.yahoo.com/m/3825e3e6-af22-399b-8c46-a5407401e8f1/is-broadcom-stock-a-buy-after.html",
      "Content": "Is Broadcom Stock a Buy After the Dip?\n\nWill Ebiefung, The Motley Fool\nFri, January 2, 2026 at 9:43 AM PST 5 min read\n\nIn this article: AVGO\n\nOPAI.PVT\n\nKey Points Some investors are feeling skittish about the high levels of capital spending on AI.\nOne important player, Broadcom, has a big opportunity in custom chip production.\n10 stocks we like better than Broadcom ›\nSemiconductor giant Broadcom (NASDAQ: AVGO) is one of the big winners in the recent generative artificial intelligence (AI) boom that started with the launch of OpenAI's ChatGPT in 2022. Shares have soared by roughly 350% in three years as investors bet on its ability to capitalize on the soaring demand for advanced computing hardware.\n\nThat said, some market participants feel that the AI boom might be getting ahead of itself as companies overspend on data centers without a meaningful guarantee of future returns. This uncertainty has sent Broadcom's stock down by around 15% from its all-time high of $412.\nLet's dig deeper into the pros and cons of the stock to see if this dip is a buying opportunity or a signal for investors to stay far away.\nWhy are investors getting nervous? The stock's recent slide came after Broadcom's fourth-quarter earnings report in mid-December. On the surface, the numbers were fantastic.\nRevenue jumped 28% year over year to a record of $18 billion, driven by soaring demand for AI semiconductor revenue, which rose 74% in the period. This operating segment reflects sales of Broadcom's advanced computer hardware to AI data centers, and management expects the momentum to continue into 2026 as demand for these products continues to surge.\n\nBroadcom's bottom line is also looking great, with net income doubling to $8.5 billion. With numbers like these, it's hard to believe shares are on a two-week downtrend. However, the correction makes more sense when you look at some of the uncomfortable dynamics of the AI industry itself.\nAccording to analysts at Goldman Sachs , hyperscalers are on track to spend an eye-popping $527 billion on AI-related capital expenditures (capex) , with some of this going to hardware produced by companies like Broadcom. The problem is that the scale of the spending doesn't really match up with the profits generated by AI-related software services.\nDeutsche Bank expects ChatGPT creator OpenAI to lose $140 billion by 2029. And despite being one of the top hardware spenders (with roughly $125 billion in capex for 2025), Amazon saw its cloud computing revenue rise by a relatively modest $5.6 billion compared to the prior-year period. The fear is that eventually shareholders will start to push back on all the AI spending. After all, this is money that could be going to buybacks or dividends.\n\nStory Continues\nBroadcom might be better positioned than Nvidia It is fair to assume that AI-related capex spending could soon drop to reasonable levels, which could reduce the growth potential of infrastructure providers like Broadcom. That said, the company is better positioned to weather a potential fallout than the industry leader, Nvidia. To understand why, we must first look at the reasons why AI development is so expensive and generally unprofitable right now.\n\nRunning and training large language models like ChatGPT requires thousands of expensive AI accelerators (such as Nvidia's Blackwell series), which consume significant amounts of energy. Broadcom's semiconductor business actually helps solve this problem by helping its clients develop appl ication-specific integrated circui ts (ASICs). These are custom chips designed to do a specific workload, making them cheaper and easier to run than Nvidia's large, general-purpose chips.\nObviously, ASICs won't be the magic bullet that makes AI companies stop burning through money. But they are the natural first step as companies seek to reduce their reliance on expensive third-party hardware. In October, cloud giant Google selected Broadcom to build its first in-house AI processor chips. This development follows a deal with OpenAI to co-develop AI accelerators and Ethernet solutions.\n\nIs Broadcom stock a buy? Broadcom's ability to benefit from the transition to custom chips makes it a strong bet in the generative AI opportunity. That said, the AI boom is getting long in the tooth, and investors may want to wait until there is more clarity about the sustainability of current industry hardware spending before taking a position in such a highly exposed stock.\n\nShould you invest $1,000 in Broadcom right now? Before you buy stock in Broadcom, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Broadcom wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $505,641 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,143,283 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 974 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 29, 2025\nWill Ebiefung has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Goldman Sachs Group, and Nvidia. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nIs Broadcom Stock a Buy After the Dip? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-01-03",
      "Time": "00:16:55",
      "Source": "CoinDesk",
      "Title": "Bitcoin pushes above $90,000 as traders eye change in pattern",
      "URL": "https://finance.yahoo.com/m/025312aa-14f2-3003-b5e8-830e3a59b063/bitcoin-pushes-above-%2490%2C000.html",
      "Content": "Bitcoin pushes above $90,000 as traders eye change in pattern\n\nStephen Alpher\nFri, January 2, 2026 at 8:16 AM PST 1 min read\n\nIn this article: BTC-USD\n\nXRP-USD\n\nETH-USD\n\nGC=F\n\nHG=F\n\nLast year in crypto will be remembered for many things, but one notable trend — particularly late in the year — was the selloffs that occurred nearly every day during U.S. trading hours.\nIt&#x27;s not much to go on just yet, but on 2026&#x27;s first official trading day, a change could be afoot as crypto prices are actually rising while American markets are open.\n\nThe action has pushed bitcoin (BTC) above $90,000, up 2.5% over the past 24 hours. Ether (ETH), solana (SOL) and XRP (XRP) are seeing advances closer to 4%.\nAssets in general are on the rise in the year&#x27;s first session, with the Nasdaq higher by 0.6%, led by AI-related chipmakers like Nvidia, Broadcom, Micron and Intel posting 3%-6% gains. Favored commodity play of late, silver has added 3%. Gold and copper are each modestly higher.\nBitcoin miners turned AI infrastructure firms are sharply higher across the board, with Hut 8 (HUT), CleanSpark (CLSK), TeraWulf (WULF) sporting 10% gains, and Cipher Mining (CIFR) and IREN (IREN) each higher by 8%.\nStrategy (MSTR) and Coinbase (COIN) are each ahead more than 3%, Galaxy Digital (GLXY) by 7% and Circle Financial (CRCL) by 4.5%.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AMD",
      "Date": "2026-01-03",
      "Time": "00:08:01",
      "Source": "Barchart",
      "Title": "Dear AMD Stock Fans, Mark Your Calendars for January 5",
      "URL": "https://finance.yahoo.com/m/5baf4bb2-4f60-384f-ae36-408d075d8ac9/dear-amd-stock-fans%2C-mark.html",
      "Content": "Dear AMD Stock Fans, Mark Your Calendars for January 5\n\nChris MacDonald\nFri, January 2, 2026 at 8:08 AM PST 3 min read\n\nIn this article: AMD\n\nNVDA\n\nAmong the world's largest semiconductor makers, Nvidia (NVDA) remains the go-to choice for investors. And rightfully so—looking at this stock's long-term chart, investors who have stuck with this name have outperformed the market by an incredible margin in recent decades.\nOf course, it's not just a one-horse race, regardless of what the media tries to tell you. Rival Advanced Micro Devices (AMD) is another top name worth considering, and one that's actually outperformed Nvidia on a year-to-date basis (YTD). Surging 77% to end 2025, AMD roughly doubled Nvidia's performance this year (the world's largest chipmaker still surged 39% higher in 2025, so not bad). Thus, there are plenty of eyeballs already on AMD as 2026 kicks off.\n\nMore News from Barchart NVDA, NKE, and CM: Bet on These 3 Stocks With Surging Unusual Options Activity for 2026 Gains\nAfter Record Runs for Western Digital and Sandisk in 2025, Consider This 1 Data Center Storage Stock for 2026\nCrowdStrike Insiders Are Offloading CRWD Stock. Should You?\nStop Missing Market Moves: Get the FREE Barchart Brief – your midday dose of stock movers, trending sectors, and actionable trade ideas, delivered right to your inbox. Sign Up Now!\nAs it turns out, there's another major catalyst on the horizon investors are watching when it comes to both companies. Analysts at Wedbush have pointed out that AMD's CEO, Lisa Su, is expected to make the keynote address at the upcoming Consumer Electronics Show (CES) in Las Vegas on this date, with the potential for a big announcement to come.\n\nWhy Is This Catalyst So Important for AMD? I think the key announcements for AMD for this coming year are indeed likely to come at this event. CES is the biggest show in the world when it comes to anything tied to consumer electronics and is honestly one of the key shows I've always wanted to attend, for this reason. Many CEOs are expected to make big product announcements, from technological upgrades to next-generation technology expected to be released over the course of the year.\n\nI'd expect to see a strong narrative from Lisa Su around the company's roadmap moving forward, and Wedbush analysts tend to agree. They think that some “significant” technological improvements to AMD's core Ryzen chips could be announced at this conference. Doing so may propel a range of mega-cap tech companies who are looking for reasons to buy AMD chips (at a lower price point) to do so. Especially if the output differential between these Ryzen chips and Nvidia's new Blackwell and Rubin chips isn't as wide as it appears now.\n\nStory Continues\nWe'll have to see, of course, what is ultimately announced. But any sort of meaningful improvements in AMD's core CPU chip technology could spur greater investor interest in 2026 and take this stock's recent momentum to new levels. It does appear that AMD has retained strong pricing power, reflected in the company's margins above. If these margins expand further in the coming quarters, and AMD can show a cash flow growth profile that's above Wall Street estimates, I certainly think this is a stock that could be off to the races.\n\nSo, What Does Wall Street Think? As it turns out, Wedbush is just one of 44 analysts currently covering AMD stock. With a consensus price target of $285.05 per share on AMD stock, analysts believe that this chipmaker could have roughly 33% upside from current levels.\nThat's a healthy potential gain for investors looking to add some momentum to their portfolios in 2026. Indeed, momentum-driven growth stocks have provided most of the gains in the markets over the course of the past decade and a half. Thus, for those who think this trend is likely to continue and risk-on sentiment will remain in the coming year, AMD's fundamentals do point in a very positive direction right now.\nOn the date of publication, Chris MacDonald did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AMD",
      "Date": "2026-01-03",
      "Time": "00:01:04",
      "Source": "StockStory",
      "Title": "Why Are AMD (AMD) Shares Soaring Today",
      "URL": "https://finance.yahoo.com/news/why-amd-amd-shares-soaring-160104506.html",
      "Content": "Why Are AMD (AMD) Shares Soaring Today\n\nAnthony Lee\nFri, January 2, 2026 at 8:01 AM PST 2 min read\n\nIn this article: AMD\n\n^IXIC\n\nNVDA\n\nAVGO\n\nWhat Happened? Shares of computer processor maker AMD (NASDAQ:AMD) jumped 5.3% in the morning session after investor optimism grew following favorable analyst predictions for 2026 and anticipation of new product announcements.\nThe move came as top Wall Street analysts predicted a potential 32% jump in the stock's value for 2026, building on significant gains from the previous year. This positive outlook was tied to AMD's role in the artificial intelligence sector, driven by demand for high-performance computing and data centers. Adding to the excitement were rumors that the company planned to reveal a new, faster Ryzen chip and a new generation of processors at the upcoming CES 2026 conference. AMD's stock also benefited from a broader rally in tech stocks, as fresh excitement surrounding the prospects of AI lifted the sector.\n\nAfter the initial pop the shares cooled down to $220.34, up 2.9% from previous close.\nIs now the time to buy AMD? Access our full analysis report here .\nWhat Is The Market Telling Us AMD’s shares are extremely volatile and have had 30 moves greater than 5% over the last year. In that context, today’s move indicates the market considers this news meaningful but not something that would fundamentally change its perception of the business.\nThe previous big move we wrote about was 14 days ago when the stock gained 6.8% on the news that investor optimism around artificial intelligence fueled broad market gains. Technology stocks with a focus on artificial intelligence once again led the market higher, boosting the Nasdaq and S&P 500. Companies at the forefront of the AI boom, such as Nvidia and Broadcom, saw significant jumps in their share prices. The rally reflects a renewed belief among investors in the transformative potential of AI technology to drive future growth and productivity. The rally was further supported by a surprise cooling in the November consumer price index (CPI) report, which triggered market pricing for additional rate cuts in the coming year. This created a more favorable environment for growth-oriented companies.\nInvestors who bought $1,000 worth of AMD’s shares 5 years ago would now be looking at an investment worth $2,387.\nThe 1999 book Gorilla Game predicted Microsoft and Apple would dominate tech before it happened. Its thesis? Identify the platform winners early. Today, enterprise software companies embedding generative AI are becoming the new gorillas. Click here for access to our special report that reveals one profitable leader already riding this wave .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AMD",
      "Date": "2026-01-02",
      "Time": "23:36:41",
      "Source": "Yahoo Finance Video",
      "Title": "CES 2026 on deck: 3 things to keep an eye on",
      "URL": "https://finance.yahoo.com/video/ces-2026-deck-3-things-153641474.html",
      "Content": "CES 2026 on deck: 3 things to keep an eye on\n\nYahoo Finance Video\nFri, January 2, 2026 at 7:36 AM PST\n\nIn this video: AMD\n\nNVDA\n\nThe 2026 Consumer Electronics Show (CES) is coming up next week in Las Vegas.\nYahoo Finance Technology Editor Dan Howley sits down with Yahoo Finance Markets and Data Editor Jared Blikre on Market Catalysts to explain what investors should expect from the event and from key names like Nvidia ( NVDA ) and AMD ( AMD ).\nTo watch more expert insights and analysis on the latest market action, check out more Market Catalysts .\n\nVideo Transcript\n\n00:00 Jared\nCES is set to kick off in Las Vegas. Investors will be watching and listening closely to commentary from top CEOs. Last year's CES featured a flashy robot filled speech from Nvidia CEO Jensen Wang, who is scheduled to deliver a January 5th keynote. Here with the top three things to watch at the conference this year is Yahoo Finance Tech editor Dan Howley. Dan, great to see you here. What should investors keep in mind?\n00:27 Dan Howley\nYeah, Jaren, as you kind of pointed out, the the first things are going to be uh Jensen's keynote, uh as well as rival AMD CEO Lisa Sue's keynote. Uh both of them will be speaking on January 5th about their various offerings. This is the Consumer Electronics show. So, naturally, you can expect a number of consumer announcements, consumer focused announcements. That could be things like new graphics cards for gamers, uh new partnerships, things along those lines, but they've also expanded out\n01:00 Dan Howley\nto try to push more of their AI side uh of the business. So, you know, last year we saw Jensen talk about the robots as you kind of mentioned, uh their software offerings through Nvidia, as well as some of their future plans for smaller uh form factor devices which they released this year, uh a desktop kind of AI server that individuals can use on their own. Uh AMD did the same thing basically uh with their own event. And we're also going to be seeing some some announcements from Intel and Qualcomm. So, it really is going to focus primarily\n01:39 Dan Howley\nout of the gate on Nvidia uh and AMD. And then, you know, AI hardware is going to be another large part of the show. We've had uh, you know, companies like Microsoft, HP, Dell, uh any computer maker kind of discussing this idea of AI hardware when it comes to AI PCs. Not just that though. You could see some wearables that are AI focused, maybe some pendants, you know, things along those lines. Um, there's sure to be some vaporware mixed in there. Uh, you know, just products that get announced and then\n02:20 Dan Howley\nnever really see the light of day or they're just kind of looking for acquisitions down the line. Uh and so that those are some of the the other products. And then, you know, I think one of the other things that people really have uh kind of noticed over the years is the change for a lot of CES towards kind of an auto show uh motif where, you know, an entire hall is dedicated to automotives. and not just cars though, there's uh flying car concepts, uh different types of drones.\n02:56 Dan Howley\nLast year or the year before, there was a uh multi-ton uh Caterpillar dump truck that was supposed to have autonomous capabilities. John Deere uh is there. Uh there's a bunch of different boating companies. So transportation in general gets a lot of love uh at CES and we're expected to see more of that this year. Of course, AI will be a big part of that. Uh self-driving is a huge push, uh seeing a huge push. It's it's been kind of, you know, what one of the biggest announcements that we see at CES every year or\n03:33 Dan Howley\nkind of the prediction of when we'll get actual full self-driving. You know, there's still a bunch of kings to be worked out if you've seen any of the latest news out of Weimo. But uh it is much better than it was. Um but yeah, I mean it it it does seem as though this year is going to just be completely dominated by AI.\n03:55 Jared\nYou know, I love that we're still trying to make flying cars a thing. It's only been about 70 years. Maybe it's going to happen this year. But I want to talk to you about AI and the broad picture for 2026 because AI is appearing in everything right now and we're used to talking about large language models or LLM's. Now I've been talking about small language models or SLM slim with a number of guests and that is you you can put these these language models in a device and it can compute its own\n04:29 Jared\nAI. That's one trend, but uh what are some of the others or any comments on what I've said here?\n04:36 Dan Howley\nYeah, I mean, the those smaller language models, you'll see on uh things like those uh AIPCs, you know, uh Microsoft's been making a huge push with that. Uh as I said, along those, along uh the partner manufacturers, the HPs, uh Dells, things along those lines. Uh smartphone makers also lean heavily on those. But I think we'll just continue to see these kind of questions circle around the the eventual payoff with AI. Where where this actually does go. And you know, there's been survey after survey saying, oh, some companies are\n05:17 Dan Howley\nare doing great when it comes to AI, when it comes to getting a return or seeing improved uh uh efficiencies. Others times we've seen things where it says, well, companies aren't really seeing a return. I think that's going to continue to be a big part of this conversation with regards to AI. Uh also, how much money is going to be funneled into it uh is going to continue to be a big part of the conversation. You know, the the hyperscalers, hundreds of billions of dollars are being pumped in through uh data center build out. Uh that's going to\n05:54 Dan Howley\nbe a big topic of conversation, whether or not there'll be a pull back on spending, if Nvidia can keep it up. But, you know, I I think really it's going to be that kind of up and down that we saw over the last year where, you know, there was this sense of everything's great, you know, euphoria reigns, and then kind of the the storm clouds come in when there's any hint of bad news. Uh I think it's going to continue to kind of be that way in this year.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-01-02",
      "Time": "23:05:00",
      "Source": "Barrons.com",
      "Title": "Nvidia, AMD, and Broadcom Are Facing Off. How the 2026 AI Chips Battle Is Shaping Up.",
      "URL": "https://finance.yahoo.com/m/addd5bdc-4a61-3d4e-868b-6eded84848ed/nvidia%2C-amd%2C-and-broadcom-are.html",
      "Content": "Nvidia, AMD, and Broadcom Are Facing Off. How the 2026 AI Chips Battle Is Shaping Up.\n\nAdam Clark\nFri, January 2, 2026 at 7:05 AM PST 5 min read\n\nIn this article: INTC\n\nAMD\n\nAVGO\n\nNVDA\n\nNvidia, AMD and Broadcom are planning big things this year year. These are the biggest developments to watch in the AI chip sector in 2026.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-01-02",
      "Time": "22:10:34",
      "Source": "Insider Monkey",
      "Title": "Benchmark Boosts Broadcom’s (AVGO) Price Target Amid AI Chip Growth",
      "URL": "https://finance.yahoo.com/news/benchmark-boosts-broadcom-avgo-price-141034796.html",
      "Content": "Benchmark Boosts Broadcom’s (AVGO) Price Target Amid AI Chip Growth\n\nSheryar Siddiq\nFri, January 2, 2026 at 6:10 AM PST 2 min read\n\nIn this article: AVGO\n\nANTH.PVT\n\nMETA\n\nGOOG\n\nOPAI.PVT\n\nBroadcom Inc. (NASDAQ: AVGO ) ranks among the best AI stocks to buy according to analysts . Citing robust development in the AI semiconductor industry, Benchmark increased its price target for Broadcom Inc. (NASDAQ:AVGO) from $385 to $485 on December 12, retaining a Buy rating on the company’s shares. According to Broadcom Inc. (NASDAQ:AVGO), its AI semiconductor division achieved $6.5 billion in Q4, improving 76% year-over-year and 25% sequentially.\nThe company reported $21 billion in orders from Anthropic over the last two quarters, while its six-quarter AI order backlog climbed to $73 billion. Broadcom’s list of clients now includes giants like Meta, ByteDance, and Google, as well as an additional contract with OpenAI to supply $1 billion in chips by late 2026.\n\nAccording to Reuters, while Broadcom’s backlog is scheduled to ship over the next 18 months, CFO Kirsten Spears warned that margins could fall. She stated that the Q1 consolidated gross margin is likely to fall roughly 100 basis points sequentially, owing to a higher percentage of AI revenue.\nAnalysts quoted by Reuters emphasize two main risks for the company, including its excessive concentration on just five AI customers, and weaker margins on AI systems, which are likely to account for a greater share of the total revenue in coming quarters, notably in the second half of fiscal year 2026.\nBroadcom Inc. (NASDAQ:AVGO) designs, develops, and supplies various semiconductor devices and infrastructure software solutions worldwide. The company operates in two segments: Semiconductor Solutions and Infrastructure Software.\n\nWhile we acknowledge the potential of AVGO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 10 Best Magic Formula Stocks for 2025 and 10 Best Retirement Stocks to Buy According to Hedge Funds .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-01-02",
      "Time": "22:07:34",
      "Source": "24/7 Wall St.",
      "Title": "Is Capital Group Dividend Value ETF Good For Retirees? | CGDV",
      "URL": "https://finance.yahoo.com/m/3ccff36c-6165-3b66-83d2-b0d539a14741/is-capital-group-dividend.html",
      "Content": "Is Capital Group Dividend Value ETF Good For Retirees? | CGDV\n\nMichael Williams\nFri, January 2, 2026 at 6:07 AM PST 3 min read\n\nIn this article: CGDV\n\nSCHD\n\nMSFT\n\nAVGO\n\nNVDA\n\nQuick Read CGDV delivers only 1.4% yield despite 24% annual returns. Its tech-heavy allocation prioritizes growth over immediate income.\nThe fund generated $1,400 annually on $100K invested versus $3,800 from a 3.8% yielding alternative like SCHD.\nTech concentration at 24.5% creates volatility uncommon in dividend funds. Top three holdings are Microsoft, Broadcom and NVIDIA.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-01-02",
      "Time": "22:05:52",
      "Source": "Yahoo Finance",
      "Title": "CES 2026: What to expect from the tech industry’s biggest show of the year",
      "URL": "https://finance.yahoo.com/news/ces-2026-what-to-expect-from-the-tech-industrys-biggest-show-of-the-year-140552142.html",
      "Content": "CES 2026: What to expect from the tech industry’s biggest show of the year\n\nDaniel Howley · Technology Editor\nFri, January 2, 2026 at 6:05 AM PST 4 min read\n\nIn this article: NVDA\n\nAMD\n\nGOOG\n\nAAPL\n\nINTC\n\nWelcome to 2026. Now rinse out that champagne glass and pop some Advil because the tech industry’s biggest show of the year, CES, kicks off on Jan. 6 under the bright lights of Las Vegas.\nCompanies big and small will take over the famed Strip and Las Vegas Convention Center, debuting their latest and greatest offerings, and a good helping of fly-by-night products that’ll never see the light of day.\n\nWhile the show officially begins on Jan. 6, the festivities start a few days earlier with events like CES Unveiled and press conferences featuring Nvidia ( NVDA ) CEO Jensen Huang and AMD ( AMD ) CEO Lisa Su. And that means you can expect artificial intelligence to be front and center at the trade show.\nThat will include everything from AI-focused PCs to new chips. But robots are looking like they’ll steal the spotlight in 2026.\n“​Every year CES has a theme. And sometimes you don't know what it is until you get to the show, and everybody's talking about it” explained Kinsey Fabrizio, president of the Consumer Technology Association trade organization, which runs CES.\n“But we can tell you right now, robotics is going to be talked about … big time at CES.”\n\nYahoo Finance will be live and in person in Vegas bringing you all of the latest news and announcements. Here’s what we’re anticipating at CES 2026.\nWhat to expect at CES CES has become a kind of battleground for chipmakers and designers to show off their wares to the world right alongside their biggest rivals.\nLast year, Nvidia was the talk of Las Vegas when Huang held a keynote in front of a massive audience at the Michelob Ultra Arena, debuting the company's newest lineup of gaming chips, a desktop-sized AI rig, and a variety of AI software services and platforms.\nThis year, you can expect even more from the company that closed out 2025 with a $4.5 trillion market cap. Huang, who is scheduled to take the stage at 1:00 p.m. PT on Jan. 5 will likely unveil new gaming offerings, as well as a host of AI apps and capabilities.\nAMD’s Su will then host her own keynote a few hours later at 6:30 p.m. PT, giving that company’s rebuttal to Nvidia’s announcements and providing updates on its own gaming and AI products.\n\nJim Johnson, Senior vice president and GM of Intel's ( INTC ) Client Computing Group, which covers sales of the company’s chips for consumer and enterprise PCs, will also hold a keynote at CES 2026 where he’s expected to provide updates on Intel’s Core Ultra Series 3, codenamed Panther Lake, chips.\nThe processors, which Intel initially revealed in October, are the first to use the company’s highly anticipated 18A chip technology, and are a key part of its broader turnaround effort.\n\nStory Continues\nQualcomm ( QCOM ) will also be on hand at CES, with CEO Cristiano Amon set to participate in a fireside chat with Fortune’s Andrew Nusca. Qualcomm launched its Snapdragon X-series processors for Windows PCs during CES 2025 and will likely build on that momentum at this year’s event.\nEach of the chipmakers will likely provide insights into their plans to power physical AI systems, a technical term for robots, during the show.\nExpect to see humanoid robots on display, as well as a number of robotic arms, AI-powered drones, and self-driving cars scattered across Las Vegas this year, as the industry looks to rapidly advance the technology.\nSpeaking of cars, CES has become a major showcase for the auto industry’s tech ambitions, and this year will be no different. The show will likely include flying car concepts, a mainstay in recent years, as well as a variety of ways car companies are looking to capitalize on the AI trend by incorporating the technology into their vehicles’ dashboards.\n\nAI-powered wearables and fitness trackers could also make their debut at CES 2026. Those can come in the form of smart rings, glasses, or pins. The smart glasses space in particular has gained plenty of attention with the launch of Meta’s ( META ) Ray-Ban Display glasses in September, and Google ( GOOG , GOOGL ) and Samsung planning their own smart glasses.\nApple ( AAPL ) is also reportedly looking to get into the smart glasses game, though the company eschews making an appearance at CES in favor of hosting its own highly polished events at its headquarters in Cupertino, Calif., throughout the year.\nNaturally, there are sure to be some outlandish products at CES 2026. Over the years, we’ve seen everything from smart toilets to forks designed to help you eat healthier foods.\nIt’s sure to be an interesting show, and Yahoo Finance will bring you all of the biggest announcements as they happen.\nEmail Daniel Howley at dhowley@yahoofinance.com. Follow him on Twitter at @DanielHowley .\nFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here\nRead the latest financial and business news from Yahoo Finan ce.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "AVGO",
      "Date": "2026-01-02",
      "Time": "21:57:00",
      "Source": "Zacks",
      "Title": "MRVL's Custom Silicon Business Scales Up: What's Coming Next?",
      "URL": "https://finance.yahoo.com/news/mrvls-custom-silicon-business-scales-135700350.html",
      "Content": "MRVL's Custom Silicon Business Scales Up: What's Coming Next?\n\nSubham Roy\nFri, January 2, 2026 at 5:57 AM PST 3 min read\n\nIn this article: MRVL\n\nAVGO\n\nAMD\n\nMarvell Technology 's MRVL AI XPU offerings are experiencing massive traction among hyperscalers, AI data centers and high-performance computing workloads. In the third quarter of fiscal 2026, Marvell Technology’s data center segment posted revenues of $1.52 billion, growing 37.8% year over year, led by strong traction in custom XPU silicon products.\n\nMarvell Technology expects its custom silicon business to roughly contribute to one-fourth of its overall data center revenues and grow at least 20% next year. The company recently unveiled 18 XPU and XPU-attach socket design wins, among which many are already in volume production.\nThese design wins include full custom XPU programs, XPU-attached silicon, electrical I/O chiplets integrated inside multi-die XPU packages and other products, contributing to a pipeline of more than 10% of a $75 billion lifetime revenue funnel. MRVL’s custom silicon strategy has evolved from a niche application-specific integrated circuit (ASIC) offering into a deeply embedded, multi-year hyperscaler partnership model.\nNow, Marvell Technology develops custom ASIC designs for AI, cloud data center and OEM customers using its advanced 5nm and 3nm processes like 112G XSR serializer/de-serializer (SerDes), Long Reach SerDes, PCIe Gen 6 SerDes. These capabilities enable MRVL to stay ahead of its competitors in the custom AI silicon space.\n\nHow Competitors Fare Against MRVL Broadcom AVGO is one of the leading suppliers of custom silicon solutions for data center, service provider and enterprise networking customers. Broadcom’s advanced 3.5D XDSiP packaging platform is specifically designed to enhance the performance and efficiency of custom AI XPUs.\nAdvanced Micro Devices AMD is another player in the custom silicon solutions and AI accelerator space with its semi-custom SoC offerings and Instinct Accelerators that power numerous data centers. Advanced Micro Devices’ reconfigurable Alveo Adaptable Accelerator Cards are used to speed up compute-intensive applications in data centers.\n\nWhile Broadcom and Advanced Micro Devices are formidable players in the custom silicon space for AI acceleration, Marvell Technology’s deep partnership with NVIDIA provides MRVL necessary support to sustain in this space.\nMRVL's Price Performance, Valuation and Estimates Shares of Marvell Technology have gained 13.1% in the past six months compared with the Electronics - Semiconductors industry’s growth of 22.3%.\nMRVL 6-Month Performance Chart\nImage Source: Zacks Investment Research\nFrom a valuation standpoint, Marvell Technology is trading at a forward price-to-sales ratio of 7.31X, lower than the industry’s average of 8.46X.\n\nStory Continues\nMRVL Forward 12-Month (P/S) Valuation Chart\nImage Source: Zacks Investment Research\nThe Zacks Consensus Estimate for MRVL’s fiscal 2026 and 2027 earnings implies year-over-year growth of 81% and 26%, respectively. The estimates for fiscal 2026 and fiscal 2027 have been revised upward in the past 30 days.\n\nImage Source: Zacks Investment Research\nMarvell Technology currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nMarvell Technology, Inc. (MRVL) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "ADI",
      "Date": "2026-01-02",
      "Time": "20:00:19",
      "Source": "Simply Wall St.",
      "Title": "Those who invested in Analog Devices (NASDAQ:ADI) five years ago are up 89%",
      "URL": "https://finance.yahoo.com/news/those-invested-analog-devices-nasdaq-120019019.html",
      "Content": "Those who invested in Analog Devices (NASDAQ:ADI) five years ago are up 89%\n\nSimply Wall St\nFri, January 2, 2026 at 4:00 AM PST 3 min read\n\nIn this article: ADI\n\nGenerally speaking the aim of active stock picking is to find companies that provide returns that are superior to the market average. And in our experience, buying the right stocks can give your wealth a significant boost. For example, long term Analog Devices, Inc. ( NASDAQ:ADI ) shareholders have enjoyed a 73% share price rise over the last half decade, well in excess of the market return of around 59% (not including dividends). On the other hand, the more recent gains haven't been so impressive, with shareholders gaining just 28%, including dividends.\n\nSo let's investigate and see if the longer term performance of the company has been in line with the underlying business' progress.\nTrump has pledged to \"unleash\" American oil and gas and these 15 US stocks have developments that are poised to benefit.\nThere is no denying that markets are sometimes efficient, but prices do not always reflect underlying business performance. One way to examine how market sentiment has changed over time is to look at the interaction between a company's share price and its earnings per share (EPS).\nDuring five years of share price growth, Analog Devices achieved compound earnings per share (EPS) growth of 6.9% per year. This EPS growth is lower than the 12% average annual increase in the share price. So it's fair to assume the market has a higher opinion of the business than it did five years ago. That's not necessarily surprising considering the five-year track record of earnings growth. This optimism is visible in its fairly high P/E ratio of 58.57.\nThe graphic below depicts how EPS has changed over time (unveil the exact values by clicking on the image).\nWe know that Analog Devices has improved its bottom line lately, but is it going to grow revenue? Check if analysts think Analog Devices will grow revenue in the future.\nWhat About Dividends? When looking at investment returns, it is important to consider the difference between total shareholder return (TSR) and share price return . Whereas the share price return only reflects the change in the share price, the TSR includes the value of dividends (assuming they were reinvested) and the benefit of any discounted capital raising or spin-off. So for companies that pay a generous dividend, the TSR is often a lot higher than the share price return. As it happens, Analog Devices' TSR for the last 5 years was 89%, which exceeds the share price return mentioned earlier. This is largely a result of its dividend payments!\n\nA Different Perspective It's nice to see that Analog Devices shareholders have received a total shareholder return of 28% over the last year. Of course, that includes the dividend. That gain is better than the annual TSR over five years, which is 14%. Therefore it seems like sentiment around the company has been positive lately. In the best case scenario, this may hint at some real business momentum, implying that now could be a great time to delve deeper. It's always interesting to track share price performance over the longer term. But to understand Analog Devices better, we need to consider many other factors. Take risks, for example - Analog Devices has 1 warning sign we think you should be aware of.\n\nStory Continues\nOf course Analog Devices may not be the best stock to buy . So you may wish to see this free collection of growth stocks.\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-01-02",
      "Time": "12:04:57",
      "Source": "StockStory",
      "Title": "2 Reasons to Like QCOM (and 1 Not So Much)",
      "URL": "https://finance.yahoo.com/news/2-reasons-qcom-1-not-040457796.html",
      "Content": "2 Reasons to Like QCOM (and 1 Not So Much)\n\nKayode Omotosho\nThu, January 1, 2026 at 8:04 PM PST 3 min read\n\nIn this article: QCOM\n\n^GSPC\n\nQualcomm trades at $171.30 per share and has stayed right on track with the overall market, gaining 5.5% over the last six months. At the same time, the S&P 500 has returned 9.9%.\nIs now the time to buy QCOM? Find out in our full research report, it’s free for active Edge members .\nWhy Does QCOM Stock Spark Debate? Having been at the forefront of developing the standards for cellular connectivity for over four decades, Qualcomm (NASDAQ:QCOM) is a leading innovator and a fabless manufacturer of wireless technology chips used in smartphones, autos and internet of things appliances.\nTwo Positive Attributes: 1. Skyrocketing Revenue Shows Strong Momentum A company’s long-term sales performance can indicate its overall quality. Any business can put up a good quarter or two, but the best consistently grow over the long haul. Luckily, Qualcomm’s sales grew at an impressive 15.3% compounded annual growth rate over the last five years. Its growth beat the average semiconductor company and shows its offerings resonate with customers. Semiconductors are a cyclical industry, and long-term investors should be prepared for periods of high growth followed by periods of revenue contractions.\n2. Stellar ROIC Showcases Lucrative Growth Opportunities Growth gives us insight into a company’s long-term potential, but how capital-efficient was that growth? A company’s ROIC explains this by showing how much operating profit it makes compared to the money it has raised (debt and equity).\nQualcomm’s five-year average ROIC was 47%, placing it among the best semiconductor companies. This illustrates its management team’s ability to invest in highly profitable ventures and produce tangible results for shareholders.\nOne Reason to be Careful: Projected Revenue Growth Is Slim Forecasted revenues by Wall Street analysts signal a company’s potential. Predictions may not always be accurate, but accelerating growth typically boosts valuation multiples and stock prices while slowing growth does the opposite.\nOver the next 12 months, sell-side analysts expect Qualcomm’s revenue to rise by 3%, a deceleration versus its 15.3% annualized growth for the past five years. This projection is underwhelming and indicates its products and services will see some demand headwinds. At least the company is tracking well in other measures of financial health.\n\nFinal Judgment Qualcomm’s merits more than compensate for its flaws, but at $171.30 per share (or 14.2× forward P/E), is now the time to initiate a position? See for yourself in our comprehensive research report, it’s free for active Edge members .\n\nStory Continues\nHigh-Quality Stocks for All Market Conditions If your portfolio success hinges on just 4 stocks, your wealth is built on fragile ground. You have a small window to secure high-quality assets before the market widens and these prices disappear.\nDon’t wait for the next volatility shock. Check out our Top 5 Growth Stocks for this month . This is a curated list of our High Quality stocks that have generated a market-beating return of 244% over the last five years (as of June 30, 2025).\nStocks that have made our list include now familiar names such as Nvidia (+1,326% between June 2020 and June 2025) as well as under-the-radar businesses like the once-small-cap company Exlservice (+354% five-year return). Find your next big winner with StockStory today .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-01-02",
      "Time": "03:38:00",
      "Source": "MarketBeat",
      "Title": "The Last Time This Happened, Qualcomm Fell 10%",
      "URL": "https://finance.yahoo.com/m/2e02f3ec-97f8-3e4a-bb3f-bd387133b0ba/the-last-time-this-happened%2C.html",
      "Content": "The Last Time This Happened, Qualcomm Fell 10%\n\nSam Quirke, MarketBeat\nThu, January 1, 2026 at 11:38 AM PST 5 min read\n\nIn this article: QCOM\n\nKey Points Qualcomm’s MACD just flipped bearish again, and the stock is already slipping after a strong run from April.\nA similar signal in early November was followed by a fast, double-digit drop, making this setup hard to ignore.\nThe near-term “tell” is whether buyers defend the low-$170s, or whether the stock breaks down ahead of February earnings.\nInterested in QUALCOMM Incorporated? Here are five stocks we like better.\n\nAfter showing many promising signs over the past quarter, shares of Qualcomm Inc. (NASDAQ: QCOM) are flashing a sudden warning signal as the new year begins. Just before Christmas, the stock’s Moving Average Convergence Divergence (MACD) chart logged a bearish crossover, confirming a momentum shift that has continued into this week. The mega-cap tech stock closed just below $174 on Dec. 30, still up roughly 40% since April, but also down about 15% from the late-October surge that briefly reignited bullish enthusiasm.\nSince then, however, Qualcomm has been narrowing into a tight range, and while its long-term fundamentals remain supportive, its short-term technicals are flashing caution. What makes it all the more noteworthy is that the last time this exact setup appeared, the outcome was not kind to the bulls. Could history be about to repeat itself? Let’s jump in and take a closer look.\n\n→ Hi Ho Silver Away! Silver Breaks $80 as Poor Man's Gold Explodes\nWhat Qualcomm’s Bearish MACD Crossover Signals Now The MACD is a momentum indicator that tracks the relationship between two moving averages. When the shorter-term average crosses below the longer-term one, it’s regarded as a reliable signal that upside momentum is fading and that sellers are beginning to gain the upper hand. Importantly, this is not just an intraday wobble. The crossover that appeared just before Christmas has now continued and picked up pace into this week.\n\nThat matters because MACD signals tend to be more reliable when they appear after extended rallies. Qualcomm’s run since April has been one of its most sustained in years, and so this sudden divergence could be an early warning that buyers are starting to step back, rather than to continue building positions.\n→ D-Wave vs. IonQ vs. IBM vs. Google: Which Quantum Bets Will Win 2026?\nNow, it doesn’t mean a breakdown from here is inevitable. But it does suggest that the stock is vulnerable if bulls fail to step in soon, especially given how the stock behaved the last time this happened.\nThe Last Time QCOM Flashed This Signal, Shares Dropped 10% The most recent comparison point came less than two months ago in early November. At the time, Qualcomm had also printed a bearish MACD crossover after a strong move to multi-year highs. In a move that surprised us all, what followed was a swift decline of more than 10% over the following two weeks.\n\nStory Continues\n→ MarketBeat Week in Review – 12/29 - 01/02\nThe setup then shares several similarities with today. The stock had been moving higher into the middle of December since bottoming out from November’s correction, but in the face of increased selling pressure over the past fortnight, the bulls have been nowhere to be seen.\n\nHistory might not repeat perfectly when it comes to stocks, but it often rhymes. The point isn’t so much that Qualcomm is definitely going to fall another 10% from here; it’s that, at the very least, the stock is flashing a warning signal that is worth noting.\nWhy This Qualcomm Setup Could Play Out Differently There are also reasons not to be overly negative. Unlike early November, Qualcomm hasn’t just retreated from a multi-year high, and is actually starting to trade within a tightening range. With the longer-term uptrend still intact, it could be said to have been coiling into a pre-breakout setup over the past week, more so than starting to break down.\n\nIts fundamentals also look as strong as they have all year, with expectations building for Qualcomm to once again top the consensus in their first earnings report of 2026, due in early February. As we’ve highlighted in recent weeks, too, investor perception has been improving as the company’s diversification efforts continue to build momentum.\nEspecially when the broader equity market is in risk-on mode, this underlying narrative supports higher prices over time, even if the near-term path is choppy. That longer-term view is supported by TradeSmith’s Health Indicator, a volatility-based metric that has consistently ranked Qualcomm in the green zone for six consecutive months.\n\nWhat Bulls Must Do for Qualcomm to Start 2026 Strong Still, for Qualcomm to start 2026 on the right foot, the bulls need to reassert control soon. If the stock continues to drift lower below $172, it would significantly increase the odds of another leg down similar to November’s move.\nConversely, if buyers step in and momentum begins to turn back up, this crossover could prove to be a false alarm within a broader uptrend. Having worked hard to shake off its reputation for exasperating investors with multiple false promises, Qualcomm has earned some benefit of the doubt after its strong performance since April, but that goodwill is not unlimited.\nThe next week or two will tell a lot. A stock can coil only for so long before it has to choose a direction, one way or the other. With its fundamentals pointing higher and technicals pulling in the opposite direction, Qualcomm is approaching a moment of decision.\nThe article \" The Last Time This Happened, Qualcomm Fell 10% \" was originally published by MarketBeat.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "2303.TW",
      "Date": "2026-01-01",
      "Time": "21:42:52",
      "Source": "Yahoo奇摩股市",
      "Title": "元月上半旬有利多 春節上看30K",
      "URL": "https://tw.stock.yahoo.com/news/%E5%85%83%E6%9C%88%E4%B8%8A%E5%8D%8A%E6%97%AC%E6%9C%89%E5%88%A9%E5%A4%9A-%E6%98%A5%E7%AF%80%E4%B8%8A%E7%9C%8B30k-134252506.html",
      "Content": "台股31日盤中以29,009點創下新高，加權指數全年上漲5,928點，自4月股災低點以來，更是上漲了11,703點，帶來一個豐收好年。專家預估，元月上半旬有眾多利多消息，將帶動行情不僅創新高，在外資歸隊後啟動台積電（2330）補漲行情，3萬點就近在咫尺。\n\n儘管過去3年台股走勢都是隨著AI大潮而起，但是當中還是有不少變化。2024年市值上兆元的有台積電、鴻海、聯發科及廣達等7檔，但是2025年擴大到10檔，新上榜的包括日月光投控、中華電、中信金。顯示資金除了集中AI大廠外，也拓展到金融、電信。\n\n其中，最值得驕傲的莫過於護國神山台積電，31日股價以1,550元創下新高，市值突破40.2兆元，2025年台積電市值增加12.32兆元，成長44.18％，台股無人能敵。\n\n展望新春元月行情，台新投顧副總黃文清自2025年底大盤震盪時，就看好馬年春節前台股有望攻上3萬點，這個觀察至此不變。黃文清表示，2025年台股受到AI投資的大幅影響，不管是飆股還是市值大幅成長股，幾乎都跟AI伺服器，或是次族群PCB、記憶體、晶片及電源等有關。\n\n黃文清預計，元月因美股科技股財報、1月15日台積電法說會釋出第四季財報與展望，勢必帶來正向樂觀願景，加上許多公司的法說會帶來「作夢行情」，過年前台股就會上3萬點。他也預測，2026年在AI應用帶動下，企業獲利將有所成長，AI相關股票也將水漲船高。\n\n第一金投顧董事長黃詣庭評估，2026年元月外資歸隊、CES展、台積電法說等諸多利多因素，因此元月上旬股市不會差，有望創新高，更可能上3萬點；下半年則因為美國變數多，市場可能轉為觀望或震盪。\n\n黃詣庭提醒指出，2025年台股表現很強，但卻有超過12,00檔上市公司股價低於年線，漲價族群集中在AI陣營，傳產2026年是否能重振雄風，要看中國反內卷和內需回溫等因素而定。\n\n更多中時新聞網報導《台北股市》處置股：29日17檔「1出1待退」 環宇-KY被銬1表比》南亞科、華邦電、群聯等6檔 龍頭投顧最新記憶體報告來了 最推「這3家」目標價、EPS一次看不用再靠ASML？陸首台EUV原型機現身 美媒揭量產時間",
      "Language": "zh"
    },
    {
      "Ticker": "ADI",
      "Date": "2026-01-01",
      "Time": "12:39:24",
      "Source": "StockStory",
      "Title": "3 Semiconductor Stocks with Open Questions",
      "URL": "https://finance.yahoo.com/news/3-semiconductor-stocks-open-questions-043924204.html",
      "Content": "3 Semiconductor Stocks with Open Questions\n\nPetr Huřťák\nWed, December 31, 2025 at 8:39 PM PST 3 min read\n\nIn this article: ADI\n\nASYS\n\nFORM\n\n^GSPC\n\nSemiconductors are the picks and shovels of modern technology. The amount of data we ingest is also increasing exponentially, leading to elevated demand for chips with more processing power. This secular trend bodes well for the industry, which has posted a six-month gain of 32.6% and beat the S&P 500 by 21.3 percentage points.\n\nAlthough these businesses have produced results lately, investors should tread carefully as not all companies are equipped for the next technological innovation. With that said, here are three semiconductor stocks that may face trouble.\nAnalog Devices (ADI) Market Cap: $132.8 billion\nFounded by two MIT graduates, Ray Stata and Matthew Lorber in 1965, Analog Devices (NASDAQ:ADI) is one of the largest providers of high performance analog integrated circuits used mainly in industrial end markets, along with communications, autos, and consumer devices.\nWhy Is ADI Not Exciting?\n\nSales tumbled by 5.4% annually over the last two years, showing market trends are working against its favor during this cycle\nUnderwhelming 5.9% return on capital reflects management’s difficulties in finding profitable growth opportunities\nAnalog Devices is trading at $271.51 per share, or 27.8x forward P/E. Read our free research report to see why you should think twice about including ADI in your portfolio, it’s free for active Edge members .\nAmtech (ASYS) Market Cap: $180.2 million\nFocusing on the silicon carbide and power semiconductor sectors, Amtech Systems (NASDAQ:ASYS) produces the machinery and related chemicals needed for manufacturing semiconductors.\nWhy Are We Cautious About ASYS?\nCustomers postponed purchases of its products and services this cycle as its revenue declined by 16.3% annually over the last two years\nAbility to fund investments or reward shareholders with increased buybacks or dividends is restricted by its weak free cash flow margin of 6.6% for the last two years\nPush for growth has led to negative returns on capital, signaling value destruction, and its falling returns suggest its earlier profit pools are drying up\n\nAmtech’s stock price of $12.54 implies a valuation ratio of 32.4x forward P/E. If you’re considering ASYS for your portfolio, see our FREE research report to learn more .\nFormFactor (FORM) Market Cap: $4.32 billion\nWith customers across the foundry and fabless markets, FormFactor (NASDAQ:FORM) is a US-based provider of test and measurement technologies for semiconductors.\nWhy Do We Steer Clear of FORM?\n2.4% annual revenue growth over the last five years was slower than its semiconductor peers\nIncremental sales over the last five years were much less profitable as its earnings per share fell by 5.5% annually while its revenue grew\nWeak free cash flow margin of 3.7% has deteriorated further over the last five years as its investments increased\n\nStory continues\nAt $55.75 per share, FormFactor trades at 39.7x forward P/E. To fully understand why you should be careful with FORM, check out our full research report (it’s free for active Edge members) .\nHigh-Quality Stocks for All Market Conditions Your portfolio can’t afford to be based on yesterday’s story. The risk in a handful of heavily crowded stocks is rising daily.\nThe names generating the next wave of massive growth are right here in our Top 5 Strong Momentum Stocks for this week . This is a curated list of our High Quality stocks that have generated a market-beating return of 244% over the last five years (as of June 30, 2025).\nStocks that made our list in 2020 include now familiar names such as Nvidia (+1,326% between June 2020 and June 2025) as well as under-the-radar businesses like the once-small-cap company Exlservice (+354% five-year return). Find your next big winner with StockStory today for free . Find your next big winner with StockStory today . Find your next big winner with StockStory today .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "2303.TW",
      "Date": "2026-01-01",
      "Time": "07:06:39",
      "Source": "Yahoo奇摩股市",
      "Title": "聯電ADR31日下跌0.10美元跌幅1.26%折台股49.42元",
      "URL": "https://tw.stock.yahoo.com/news/%E8%81%AF%E9%9B%BBadr31%E6%97%A5%E4%B8%8B%E8%B7%8C0-10%E7%BE%8E%E5%85%83%E8%B7%8C%E5%B9%851-26-%E6%8A%98%E5%8F%B0%E8%82%A149-42%E5%85%83-230639439.html",
      "Content": "<table class=\"atom-table w-full mb-module-gap\"><thead><tr><th><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">聯電 ADR 近十個交易日行情</p></th></tr></thead><tbody><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">交易日</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">收盤價</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">漲跌</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">漲跌幅%</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">匯率</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">折台股</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/31</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">7.86</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-0.10</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-1.26</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.438</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">49.4</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/30</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">7.96</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-0.01</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-0.13</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.428</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">50.0</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/29</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">7.97</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-0.05</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-0.62</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.450</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">50.1</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/26</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">8.02</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.02</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.25</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.455</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">50.4</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/24</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">8.00</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.03</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.38</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.480</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">50.3</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/23</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">7.97</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-0.16</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-1.97</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.508</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">50.2</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/22</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">8.13</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.03</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.37</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.523</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">51.2</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/19</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">8.10</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.03</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.37</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.526</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">51.0</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/18</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">8.07</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.07</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.88</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.516</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">50.8</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/17</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">8.00</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.11</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">1.39</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.526</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">50.4</p></td></tr></tbody></table>\n\n(中央社台北2026年 1月 1日電)聯電在NYSE掛牌 ADR以7.86美元作收，下跌0.10美元，跌幅 1.26%。\n\n由於每單位聯電 ADR相當於台股 5股聯電普通股，以12月31日新台幣匯市收盤價31.438元計算，相當台股聯電每股為 49.42元。\n\n最近10個交易日行情如下：",
      "Language": "zh"
    },
    {
      "Ticker": "ADI",
      "Date": "2026-01-01",
      "Time": "07:00:02",
      "Source": "Zacks",
      "Title": "Analog Devices (ADI) Registers a Bigger Fall Than the Market: Important Facts to Note",
      "URL": "https://finance.yahoo.com/news/analog-devices-adi-registers-bigger-230002969.html",
      "Content": "Analog Devices (ADI) Registers a Bigger Fall Than the Market: Important Facts to Note\n\nZacks Equity Research\nWed, December 31, 2025 at 3:00 PM PST 3 min read\n\nIn this article: ADI\n\n^GSPC\n\n^DJI\n\n^IXIC\n\nIn the latest trading session, Analog Devices (ADI) closed at $271.20, marking a -1.32% move from the previous day. The stock's change was less than the S&P 500's daily loss of 0.74%. Meanwhile, the Dow lost 0.63%, and the Nasdaq, a tech-heavy index, lost 0.76%.\nComing into today, shares of the semiconductor maker had gained 0.68% in the past month. In that same time, the Computer and Technology sector gained 0.14%, while the S&P 500 gained 0.79%.\n\nThe investment community will be closely monitoring the performance of Analog Devices in its forthcoming earnings report. The company is forecasted to report an EPS of $2.28, showcasing a 39.88% upward movement from the corresponding quarter of the prior year. Meanwhile, our latest consensus estimate is calling for revenue of $3.11 billion, up 28.21% from the prior-year quarter.\nFor the annual period, the Zacks Consensus Estimates anticipate earnings of $9.79 per share and a revenue of $12.82 billion, signifying shifts of +25.67% and +16.36%, respectively, from the last year.\nIt is also important to note the recent changes to analyst estimates for Analog Devices. Recent revisions tend to reflect the latest near-term business trends. As such, positive estimate revisions reflect analyst optimism about the business and profitability.\n\nEmpirical research indicates that these revisions in estimates have a direct correlation with impending stock price performance. To take advantage of this, we've established the Zacks Rank, an exclusive model that considers these estimated changes and delivers an operational rating system.\nThe Zacks Rank system, spanning from #1 (Strong Buy) to #5 (Strong Sell), boasts an impressive track record of outperformance, audited externally, with #1 ranked stocks yielding an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has moved 0.52% higher. Analog Devices is holding a Zacks Rank of #2 (Buy) right now.\nIn terms of valuation, Analog Devices is currently trading at a Forward P/E ratio of 28.07. This expresses a discount compared to the average Forward P/E of 44.32 of its industry.\n\nMeanwhile, ADI's PEG ratio is currently 1.52. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. As the market closed yesterday, the Semiconductor - Analog and Mixed industry was having an average PEG ratio of 2.47.\nThe Semiconductor - Analog and Mixed industry is part of the Computer and Technology sector. This industry currently has a Zacks Industry Rank of 31, which puts it in the top 13% of all 250+ industries.\n\nStory Continues\nThe Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nRemember to apply Zacks.com to follow these and more stock-moving metrics during the upcoming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAnalog Devices, Inc. (ADI) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-01-01",
      "Time": "06:45:07",
      "Source": "Zacks",
      "Title": "Why Qualcomm (QCOM) Dipped More Than Broader Market Today",
      "URL": "https://finance.yahoo.com/news/why-qualcomm-qcom-dipped-more-224507296.html",
      "Content": "Why Qualcomm (QCOM) Dipped More Than Broader Market Today\n\nZacks Equity Research\nWed, December 31, 2025 at 2:45 PM PST 3 min read\n\nIn this article: QCOM\n\n^GSPC\n\n^DJI\n\n^IXIC\n\nQualcomm (QCOM) closed at $171.05 in the latest trading session, marking a -1.5% move from the prior day. This change lagged the S&P 500's daily loss of 0.74%. At the same time, the Dow lost 0.63%, and the tech-heavy Nasdaq lost 0.76%.\nComing into today, shares of the chipmaker had gained 1.73% in the past month. In that same time, the Computer and Technology sector gained 0.14%, while the S&P 500 gained 0.79%.\n\nInvestors will be eagerly watching for the performance of Qualcomm in its upcoming earnings disclosure. The company is forecasted to report an EPS of $3.38, showcasing a 0.88% downward movement from the corresponding quarter of the prior year. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $12.25 billion, up 4.99% from the year-ago period.\nFor the full year, the Zacks Consensus Estimates are projecting earnings of $12.15 per share and revenue of $45.69 billion, which would represent changes of +1% and +3.52%, respectively, from the prior year.\nIt is also important to note the recent changes to analyst estimates for Qualcomm. These latest adjustments often mirror the shifting dynamics of short-term business patterns. Therefore, positive revisions in estimates convey analysts' confidence in the business performance and profit potential.\n\nBased on our research, we believe these estimate revisions are directly related to near-term stock moves. To utilize this, we have created the Zacks Rank, a proprietary model that integrates these estimate changes and provides a functional rating system.\nThe Zacks Rank system, stretching from #1 (Strong Buy) to #5 (Strong Sell), has a noteworthy track record of outperforming, validated by third-party audits, with stocks rated #1 producing an average annual return of +25% since the year 1988. Over the past month, the Zacks Consensus EPS estimate has shifted 0.02% downward. Qualcomm is holding a Zacks Rank of #3 (Hold) right now.\nIn the context of valuation, Qualcomm is at present trading with a Forward P/E ratio of 14.29. This denotes a discount relative to the industry average Forward P/E of 35.99.\n\nInvestors should also note that QCOM has a PEG ratio of 3.11 right now. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. By the end of yesterday's trading, the Electronics - Semiconductors industry had an average PEG ratio of 2.04.\nThe Electronics - Semiconductors industry is part of the Computer and Technology sector. This group has a Zacks Industry Rank of 96, putting it in the top 39% of all 250+ industries.\n\nStory Continues\nThe Zacks Industry Rank assesses the vigor of our specific industry groups by computing the average Zacks Rank of the individual stocks incorporated in the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nRemember to apply Zacks.com to follow these and more stock-moving metrics during the upcoming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "QCOM",
      "Date": "2026-01-01",
      "Time": "00:14:22",
      "Source": "Reuters",
      "Title": "China AI chip firm Biren raises $717 million in Hong Kong IPO",
      "URL": "https://finance.yahoo.com/news/china-ai-chip-firm-biren-161422448.html",
      "Content": "China AI chip firm Biren raises $717 million in Hong Kong IPO\n\nReuters\nWed, December 31, 2025 at 8:14 AM PST 1 min read\n\nIn this article: 688795.SS\n\n688802.SS\n\nQCOM\n\nDec 31 (Reuters) - Chinese AI chip startup Shanghai Biren Technology has raised HK$5.58 billion ($716.85 million) in ​its Hong Kong initial public offering, according to ‌an exchange filing on Wednesday.\nThe semiconductor designer set the offer price ‌at HK$19.60 apiece, the top end of the marketed range. It offered 284.8 million shares in the IPO.\n\nInstitutional investor demand for Biren's IPO was nearly 26 times the shares ⁠on offer, while ‌the retail tranche was oversubscribed about 2,348 times, the filing showed.\nShanghai-based Biren's IPO follows successful ‍offerings from industry peers Moore Threads and MetaX as China seeks to develop domestic alternatives to U.S. semiconductors amid stringent ​export restrictions by Washington on advanced chips.\nFounded in 2019, ‌Biren's co-founders include Zhang Wen, formerly the president of AI face-recognition company SenseTime, and Jiao Guofang, who previously worked at Qualcomm and Huawei.\nThe company initially drew attention in 2022 when it unveiled its first batch of products, ⁠including its BR100 chip, which ​it claimed could match the performance ​of Nvidia 's advanced H100 AI processor.\nHong Kong has raised $36.5 billion from 114 new listings in ‍2025, marking its ⁠strongest year since 2021 and more than triple the roughly $11.3 billion raised in 2024, according to ⁠data compiled by LSEG.\nBiren shares are expected to debut on Friday.\n($1 = ‌7.7841 Hong Kong dollars)\n(Reporting by Himanshi Akhand in ‌Bengaluru; Editing by Shilpi Majumdar)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "ADI",
      "Date": "2025-12-31",
      "Time": "23:10:00",
      "Source": "Zacks",
      "Title": "Buy 5 Solid Semiconductor Stocks of 2025 With Room for Growth in 2026",
      "URL": "https://finance.yahoo.com/news/buy-5-solid-semiconductor-stocks-151000764.html",
      "Content": "Buy 5 Solid Semiconductor Stocks of 2025 With Room for Growth in 2026\n\nRitujay Ghosh\nWed, December 31, 2025 at 7:10 AM PST 4 min read\n\nIn this article: NVDA\n\nMTSI\n\nSLAB\n\nThe semiconductor market had a remarkable year, with more room to grow in 2026, thanks to robust demand from various industries and the ongoing enthusiasm surrounding artificial intelligence (AI). Semiconductor stocks, especially those focused on AI, have been responsible for the broader tech rally this year.\n\nA steady surge in sales throughout the year, along with hefty investment in AI, is fueling optimism that the semiconductor market could be poised for a strong run in 2026.\nGiven this scenario, it would be ideal to invest in semiconductor stocks, such as Analog Devices ADI, MACOM Technology Solutions Holdings, Inc. MTSI, Silicon Laboratories Inc. SLAB and NVIDIA Corporation NVDA. Each of these stocks carries a Zacks Rank #2 (Buy). You can see the complete list of today&rsquo;s Zacks #1 Rank (Strong Buy) stocks here .\nSemiconductor Sales Witness Steady Growth Global semiconductor sales totaled $208.4 billion in the third quarter of 2025, increasing 15.8% from the second quarter, according to the Semiconductor Industry Association (SIA). Also, the final quarter of the year started on a high, with sales totaling $72.7 billion in October, increasing 4.7% sequentially and 27.2% year over year from October 2024&rsquo;s total of $57.2 billion.\n\nThe surge comes after a solid first and second quarter. Chip sales totaled $179.7 billion in the second quarter, a 7.8% rise from the first quarter. This follows a robust 2024, during which chip sales totaled $627.6 billion, representing a 19.1% increase from $526.8 billion in 2023.\nSemiconductor sales declined after the COVID-19 pandemic in 2020, and the market remained stagnant till 2022. However, the sudden enthusiasm surrounding AI since the second half of 2023 saw semiconductor sales rebound.\nThis year has been impressive for microchips, with enthusiasm surrounding AI fueling demand. The AI sector remains vast and largely untapped, and major tech companies are pumping in billions of dollars while increasingly crediting AI-driven demand for their revenue growth.\n\nIndustry heavyweights, such as Amazon.com Inc. AMZN, Microsoft Corporation MSFT and NVIDIA Corporation, have recently signed major AI deals that are widely expected to drive higher demand for semiconductors.\nSemiconductor Equipment and Materials International (SEMI), in its Year-End Total Semiconductor Equipment Forecast&mdash;OEM Perspective report, has forecast global sales of semiconductor manufacturing equipment by OEMs to hit a record $133 billion, as reported by BISinfotech. The report also forecasts sales to reach $145 billion in 2026 and $156 billion in 2027.\n\nStory Continues\n4 Semiconductor Stocks With Growth Potential Analog Devices Analog Devices is an original equipment manufacturer of semiconductor devices, specifically, analog, mixed-signal and digital signal processing (&ldquo;DSP&rdquo;) integrated circuits. ADI&rsquo;s product line comprises amplifiers and comparators; analog to digital converters; digital to analog converters; video encoders and decoders; embedded processing products and DSPs; MEMS and temperature sensors; RF/IF components and converters; power and thermal management ICs, audio/video converters, amplifiers, CODECs, filters and processors. Analog Devices also offers analog, digital and RF switches and multiplexers; analog microcontrollers; clock and timing products.\n\nAnalog Devices&rsquo; expected earnings growth rate for next year is 12%. The Zacks Consensus Estimate for current-year earnings has improved 5.3% over the past 60 days. ADI carries a Zacks Rank #2.\nMACOM Technology Solutions Holdings, Inc. MACOM Technology Solutions Holdings, Inc. is a provider of power analog semiconductor solutions to varied markets. MTSI develops and produces analog radio frequency, microwave and millimeter wave semiconductor devices, and components for applications in optical, wireless and satellite networks. MACOM Technology Solutions Holdings primarily serves three markets, namely, data center, industrial & defense and telecom.\n\nMACOM Technology&rsquo;s expected earnings growth rate for next year is 16.5%. The Zacks Consensus Estimate for current-year earnings has improved 3.7% over the past 60 days. MTSI has a Zacks Rank #2.\nSilicon Laboratories Silicon Laboratories Inc. is a leading provider of silicon, software and solutions for the Internet of Things, Internet infrastructure, industrial automation, consumer and automotive markets. SLAB solves the electronics industry's toughest problems, providing customers with significant advantages in performance, energy savings, connectivity and design simplicity.\n\nSilicon Laboratories&rsquo; expected earnings growth rate for next year is more than 100%. The Zacks Consensus Estimate for current-year earnings has improved 28.6% over the past 60 days. SLAB currently has a Zacks Rank #2.\nNVIDIA Corporation NVIDIA Corporation is the worldwide leader in visual computing technologies and the inventor of the graphic processing unit, or GPU. Over the years, NVDA&rsquo;s focus has evolved from PC graphics to AI-based solutions that now support high-performance computing, gaming and virtual reality platforms.\n\nNVIDIA has an expected earnings growth rate of 55.2% for the current year. The Zacks Consensus Estimate for current-year earnings has improved 4.5% over the last 60 days. NVDA presently has a Zacks Rank #2.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\nAnalog Devices, Inc. (ADI) : Free Stock Analysis Report\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nSilicon Laboratories, Inc. (SLAB) : Free Stock Analysis Report\nMACOM Technology Solutions Holdings, Inc. (MTSI) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "ADI",
      "Date": "2025-12-31",
      "Time": "22:30:03",
      "Source": "Zacks",
      "Title": "Brokers Suggest Investing in Analog Devices (ADI): Read This Before Placing a Bet",
      "URL": "https://finance.yahoo.com/news/brokers-suggest-investing-analog-devices-143003563.html",
      "Content": "Brokers Suggest Investing in Analog Devices (ADI): Read This Before Placing a Bet\n\nZacks Equity Research\nWed, December 31, 2025 at 6:30 AM PST 4 min read\n\nIn this article: ADI\n\nInvestors often turn to recommendations made by Wall Street analysts before making a Buy, Sell, or Hold decision about a stock. While media reports about rating changes by these brokerage-firm employed (or sell-side) analysts often affect a stock's price, do they really matter?\nLet's take a look at what these Wall Street heavyweights have to say about Analog Devices (ADI) before we discuss the reliability of brokerage recommendations and how to use them to your advantage.\n\nAnalog Devices currently has an average brokerage recommendation (ABR) of 1.70, on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell, etc.) made by 33 brokerage firms. An ABR of 1.70 approximates between Strong Buy and Buy.\nOf the 33 recommendations that derive the current ABR, 20 are Strong Buy and three are Buy. Strong Buy and Buy respectively account for 60.6% and 9.1% of all recommendations.\nBrokerage Recommendation Trends for ADI Check price target & stock forecast for Analog Devices here>>>\nThe ABR suggests buying Analog Devices, but making an investment decision solely on the basis of this information might not be a good idea. According to several studies, brokerage recommendations have little to no success guiding investors to choose stocks with the most potential for price appreciation.\n\nDo you wonder why? As a result of the vested interest of brokerage firms in a stock they cover, their analysts tend to rate it with a strong positive bias. According to our research, brokerage firms assign five \"Strong Buy\" recommendations for every \"Strong Sell\" recommendation.\nIn other words, their interests aren't always aligned with retail investors, rarely indicating where the price of a stock could actually be heading. Therefore, the best use of this information could be validating your own research or an indicator that has proven to be highly successful in predicting a stock's price movement.\nWith an impressive externally audited track record, our proprietary stock rating tool, the Zacks Rank, which classifies stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), is a reliable indicator of a stock's near-term price performance. So, validating the Zacks Rank with ABR could go a long way in making a profitable investment decision.\n\nZacks Rank Should Not Be Confused With ABR Although both Zacks Rank and ABR are displayed in a range of 1--5, they are different measures altogether.\nThe ABR is calculated solely based on brokerage recommendations and is typically displayed with decimals (example: 1.28). In contrast, the Zacks Rank is a quantitative model allowing investors to harness the power of earnings estimate revisions. It is displayed in whole numbers -- 1 to 5.\n\nStory Continues\nAnalysts employed by brokerage firms have been and continue to be overly optimistic with their recommendations. Since the ratings issued by these analysts are more favorable than their research would support because of the vested interest of their employers, they mislead investors far more often than they guide.\n\nIn contrast, the Zacks Rank is driven by earnings estimate revisions. And near-term stock price movements are strongly correlated with trends in earnings estimate revisions, according to empirical research.\nFurthermore, the different grades of the Zacks Rank are applied proportionately across all stocks for which brokerage analysts provide earnings estimates for the current year. In other words, at all times, this tool maintains a balance among the five ranks it assigns.\nThere is also a key difference between the ABR and Zacks Rank when it comes to freshness. When you look at the ABR, it may not be up-to-date. Nonetheless, since brokerage analysts constantly revise their earnings estimates to reflect changing business trends, and their actions get reflected in the Zacks Rank quickly enough, it is always timely in predicting future stock prices.\n\nIs ADI Worth Investing In? Looking at the earnings estimate revisions for Analog Devices, the Zacks Consensus Estimate for the current year has increased 0.5% over the past month to $9.79.\nAnalysts' growing optimism over the company's earnings prospects, as indicated by strong agreement among them in revising EPS estimates higher, could be a legitimate reason for the stock to soar in the near term.\n\nThe size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #2 (Buy) for Analog Devices. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>>\nTherefore, the Buy-equivalent ABR for Analog Devices may serve as a useful guide for investors.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAnalog Devices, Inc. (ADI) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "QCOM",
      "Date": "2025-12-31",
      "Time": "21:23:00",
      "Source": "Zacks",
      "Title": "Can Qualcomm Stock Benefit From a Foray Into Mid-Range AI Chips?",
      "URL": "https://finance.yahoo.com/news/qualcomm-stock-benefit-foray-mid-132300566.html",
      "Content": "Can Qualcomm Stock Benefit From a Foray Into Mid-Range AI Chips?\n\nSupriyo Bose\nWed, December 31, 2025 at 5:23 AM PST 3 min read\n\nIn this article: QCOM\n\nMSFT\n\nARM\n\nQualcomm Incorporated QCOM has forayed into mid-range AI desktops and laptops with its Snapdragon X chip. This SoC is the fourth such product in the Snapdragon X processor line, following the successful launch of the Snapdragon X Plus 8-core, Snapdragon X Plus and Snapdragon X Elite series. Based on a 4-nanometer process, the Snapdragon X chip comprises an 8-core Oryon central processor, a graphics component and a neural processing unit (NPU). The NPU accelerates AI workloads, offering 45 TOPS (trillions of operations per second), making it an ideal platform to power Copilot+PCs – Microsoft’s vision of AI-first, flagship Windows hardware.\n\nAI PCs incorporate an additional processor designed specifically to accelerate AI capabilities. This specialized hardware enhances features like personal assistants and task automation. One of the significant selling points of AI PCs is their enhanced battery life. Qualcomm's chips, which are based on Arm Holdings Plc designs, promise extended use without frequent charging.\n\nLeveraging processors with multi-core CPUs with cutting-edge features, amazing graphics and worldwide network connectivity, Qualcomm Snapdragon mobile platforms are fast and have superb power efficiency. Smartphones and mobile devices built with Snapdragon mobile platforms enable immersive augmented reality and virtual reality experiences, brilliant camera capabilities, superior 4G LTE and 5G connectivity with state-of-the-art security solutions.\n\nTech Firms Focusing on AI NVIDIA Corporation NVDA is rapidly gaining traction in enterprise AI, expanding its market beyond cloud providers. Major companies across industries are integrating NVIDIA’s AI platforms to automate workflows, enhance productivity and improve decision-making. The company’s DGX Cloud AI infrastructure, which allows enterprises to train and deploy AI models at scale, has seen increased adoption. The expansion of CUDA software and AI frameworks strengthens NVIDIA’s ecosystem, making it the preferred choice for enterprises developing AI applications. With AI adoption expected to accelerate in 2025 and beyond, NVIDIA’s software and AI cloud solutions are a significant revenue driver.\n\nIntel Corporation INTC is investing to expand its manufacturing capacity to accelerate its IDM 2.0 (Integrated Device Manufacturing) strategy. The company is taking various decisions to gain a firmer footing in the expansive AI sector. Its Xeon 6 processors with Performance-cores (P-Cores) can support large AI workloads across diverse sectors. With industry-leading capabilities in AI processing, the Xeon 6 family delivers the industry’s best CPU for AI at a lower total cost of ownership. Intel's innovative AI solutions are likely to benefit the broader semiconductor ecosystem by driving down costs, improving performance and fostering an open, scalable AI environment.\n\nStory Continues\nQCOM’s Price Performance, Valuation and Estimates Qualcomm’s shares have gained 13% over the past year compared with the industry’s growth of 41%.\n\nImage Source: Zacks Investment Research\nGoing by the price/earnings ratio, the company's shares currently trade at 14.16 forward earnings, lower than 34.14 for the industry.\n\nImage Source: Zacks Investment Research\nEarnings estimates for fiscal 2026 have increased 2% to $12.15 per share over the past 60 days, while the same for fiscal 2027 are up 3.4% to $12.6.\n\nImage Source: Zacks Investment Research\nQualcomm currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "2303.TW",
      "Date": "2025-12-31",
      "Time": "15:44:00",
      "Source": "Yahoo奇摩股市",
      "Title": "12/31上市投信賣超排行前20名",
      "URL": "https://tw.stock.yahoo.com/news/12-31%E4%B8%8A%E5%B8%82%E6%8A%95%E4%BF%A1%E8%B3%A3%E8%B6%85%E6%8E%92%E8%A1%8C%E5%89%8D20%E5%90%8D-074400566.html",
      "Content": "<table class=\"atom-table w-full mb-module-gap\"><tbody><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">證券代號</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">證券名稱</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">買進張數</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">賣出張數</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">買賣超張數</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>2885</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">元大金</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>82</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>42,083</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>-42,001</span></p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>2449</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">京元電子</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>1,599</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>16,259</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>-14,660</span></p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>2801</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">彰銀</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>57</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>10,071</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>-10,014</span></p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>5871</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">中租-KY</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>98</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>9,737</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>-9,639</span></p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>9945</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">潤泰新</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>0</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>8,460</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>-8,460</span></p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>2303</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">聯電</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>75</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>8,105</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>-8,030</span></p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>2317</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">鴻海</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>52</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>6,987</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>-6,935</span></p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>4938</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">和碩</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>213</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>7,054</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>-6,841</span></p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>9904</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">寶成</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>199</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>7,038</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>-6,839</span></p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>8422</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">可寧衛*</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>6,062</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>12,060</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>-5,998</span></p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>2301</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">光寶科</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>11</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>5,198</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>-5,187</span></p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>2881</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">富邦金</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>66</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>5,178</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>-5,112</span></p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>6176</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">瑞儀</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>332</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>5,144</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>-4,812</span></p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>2347</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">聯強</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>118</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>4,879</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>-4,761</span></p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>3034</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">聯詠</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>179</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>3,919</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>-3,740</span></p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>2883</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">凱基金</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>794</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>4,299</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>-3,505</span></p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>1319</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">東陽</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>379</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>3,766</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>-3,387</span></p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>2610</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">華航</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>508</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>3,820</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>-3,312</span></p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>2915</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">潤泰全</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>0</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>2,992</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>-2,992</span></p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>6005</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">群益證</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>0</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>2,942</span></p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\"><span>-2,942</span></p></td></tr></tbody></table>\n\n資料來源-MoneyDJ理財網",
      "Language": "zh"
    },
    {
      "Ticker": "2303.TW",
      "Date": "2025-12-31",
      "Time": "07:06:14",
      "Source": "Yahoo奇摩股市",
      "Title": "聯電ADR30日下跌0.01美元跌幅0.13%折台股50.03元",
      "URL": "https://tw.stock.yahoo.com/news/%E8%81%AF%E9%9B%BBadr30%E6%97%A5%E4%B8%8B%E8%B7%8C0-01%E7%BE%8E%E5%85%83%E8%B7%8C%E5%B9%850-13-%E6%8A%98%E5%8F%B0%E8%82%A150-03%E5%85%83-230614175.html",
      "Content": "<table class=\"atom-table w-full mb-module-gap\"><thead><tr><th><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">聯電 ADR 近十個交易日行情</p></th></tr></thead><tbody><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">交易日</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">收盤價</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">漲跌</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">漲跌幅%</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">匯率</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">折台股</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/30</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">7.96</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-0.01</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-0.13</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.428</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">50.0</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/29</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">7.97</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-0.05</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-0.62</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.450</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">50.1</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/26</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">8.02</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.02</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.25</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.455</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">50.4</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/24</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">8.00</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.03</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.38</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.480</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">50.3</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/23</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">7.97</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-0.16</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">-1.97</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.508</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">50.2</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/22</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">8.13</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.03</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.37</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.523</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">51.2</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/19</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">8.10</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.03</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.37</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.526</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">51.0</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/18</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">8.07</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.07</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.88</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.516</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">50.8</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/17</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">8.00</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.11</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">1.39</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.526</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">50.4</p></td></tr><tr><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">12/16</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">7.89</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.05</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">0.64</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">31.475</p></td><td><p class=\"break-words leading-[1.63] text-px16 lg:leading-[1.8] lg:text-px18 text-batcave\">49.6</p></td></tr></tbody></table>\n\n(中央社台北2025年12月31日電)聯電在NYSE掛牌 ADR以7.96美元作收，下跌0.01美元，跌幅 0.13%。\n\n由於每單位聯電 ADR相當於台股 5股聯電普通股，以12月30日新台幣匯市收盤價31.428元計算，相當台股聯電每股為 50.03元。\n\n最近10個交易日行情如下：",
      "Language": "zh"
    },
    {
      "Ticker": "ADI",
      "Date": "2025-12-30",
      "Time": "19:14:00",
      "Source": "Zacks",
      "Title": "The Zacks Analyst Blog Highlights International Business Machines, Analog Devices, Johnson & Johnson's, The Gap and Hewlett Packard Enterprise",
      "URL": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-international-111400655.html",
      "Content": "The Zacks Analyst Blog Highlights International Business Machines, Analog Devices, Johnson & Johnson's, The Gap and Hewlett Packard Enterprise\n\nZacks Equity Research\nTue, December 30, 2025 at 3:14 AM PST 9 min read\n\nIn this article: IBM\n\nJNJ\n\nHPE\n\nADI\n\nGAP\n\nFor Immediate Release Chicago, IL &ndash; December 30, 2025 &ndash; Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: International Business Machines Corp. IBM, Analog Devices, Inc. ADI, Johnson & Johnson&rsquo;s JNJ, The Gap, Inc. GAP and Hewlett Packard Enterprise HPE.\n\nHere are highlights from Monday&rsquo;s Analyst Blog:\nTop 5 High-Yield S&P 500 Stock to Buy for 2026\nThe U.S. stock market has experienced significant volatility at the beginning of 2025 owing to a multitude of factors. The trade policy framework undertaken in the new Trump administration has reshaped market sentiment. The aggressive tariff measures imposed by Washington on its major trading partners have left several businesses in a state of uncertainty. The growing Sino-U.S. trade tension was a concerning factor for investors. The U.S. government aims to limit Beijing&rsquo;s access to high-end technologies. It has imposed restrictions on the export of advanced semiconductor tech to China.\nThe tariff-related uncertainties have significantly affected companies with a strong presence in the emerging markets of Asia and Latin America. Moreover, the war in Europe and the Middle East has further aggravated the market uncertainty. These developments have led to rising manufacturing costs and supply chain issues, putting pressure on margins. However, there were some positive macroeconomic developments as well in 2025. The federal reserve rate cuts have lowered borrowing costs and improved corporate profitability.\n\nTrade-related risks and changes in monetary policy led to frequent stock price fluctuations. However, broader market momentum remained positive with tech stocks largely leading the bull run. Growing spending on AI infrastructure and digital transformation is driving growth in the tech sector. Despite a hike in energy prices, the overall annual inflation rate was lower than expected in 2025.\nKey Growth Drivers for 2026\nRapid AI buildouts are expected to be a key driver for businesses in 2026. Businesses in several industries such as manufacturing, healthcare, energy, social ecommerce, telecom and others are rapidly incorporating AI across the portfolio to gain a competitive edge. However, this rapid AI build-out requires substantial computing infrastructure, data centers to support these AI workloads, as well as energy optimization and cooling technologies.\n\nStory Continues\nAI integration has become capex-heavy. There is a gap between investing in AI infrastructure and realizing gains from this investment. The growth in AI capex is expected to put pressure on the balance sheet and can create margin pressure in the short term. The companies with stable earnings and robust cash flow are expected to be the gainers amid such emerging market trends.\n\nChina is a major supplier of rare earth materials that many major tech companies rely on. This can force the United States to avoid imposing high tariffs and maintain a cordial relationship with the Communist nation, at least in the near term. However, the U.S. government&rsquo;s effort to reduce the widening trade deficit with other nations indicates that tariff-related uncertainties will remain a concern for investors in the upcoming quarters. After three rate cuts in 2025, the chances of another rate cut remain low, at least at the beginning of 2026.\nAmid such macroeconomic uncertainties and persistent geopolitical volatility, there is a growing interest in S&P 500 stocks with high dividend yield. So far in 2025, the average dividend yield of S&P 500 stocks stands at 1.07%. Based on above average dividend yields, strong fundamentals and growing AI-related investment, we have shortlisted five stocks that have strong growth potential in 2026.\n\nKey Picks\nInternational Business Machines Corp. : Headquartered in Armonk, NY, IBM is a leading provider of cloud and data platforms. In addition, the company provides advanced information technology solutions, computer systems, quantum computing and supercomputing solutions, enterprise software, storage systems and microelectronics.\nThe company has positioned itself as a major player in the expanding AI landscape worldwide. Its breakthrough innovations, hybrid cloud and AI are utilized by clients across 175 countries to streamline business processes, optimize cost and gain a competitive edge. The company boasts a vast client base across multiple industries, including financial services, telecommunications, healthcare, retail and more. In the third quarter, IBM&rsquo;s free cash flow improved to $2.37 billion, up from $2.06 billion a year ago.\n\nIBM pays out a quarterly dividend of $1.68 per share ($6.72 annualized), with a 2.2% yield at the current stock price. IBM&rsquo;s payout ratio is 61%, with a five-year dividend growth rate of 0.62%. The company currently carries a Zacks Rank #2 (Buy). (Check IBM&rsquo;s dividend history here). You can see the complete list of today&rsquo;s Zacks #1 Rank (Strong Buy) stocks here .\nAnalog Devices, Inc. : Headquartered in Norwood, MA, Analog Devices is an original equipment manufacturer of semiconductor devices, specifically, analog, mixed signal and digital signal processing (DSP) integrated circuits. The company&rsquo;s top line is benefiting from strong growth in its industrial, aerospace and defense businesses, fueled by demand for AI chip infrastructure buildout, automated test equipment, and a rebound in automation and healthcare markets.\n\nAnalog Devices&rsquo; strong operating cash flow has helped it return cash through regular quarterly dividend payments and share repurchases. In fiscal 2025, the company generated operating cash flow of $4.81 billion and free cash flow of $4.28 billion.\nADI pays out a quarterly dividend of 99 cents per share ($3.96 annualized), with a 1.43% yield at the current stock price. ADI&rsquo;s payout ratio is 51%, with a five-year dividend growth rate of 10.31%. The company currently carries a Zacks Rank #2. (Check ADI&rsquo;s dividend history here)\nJohnson & Johnson&rsquo;s : Headquartered in New Brunswick, NJ, Johnson & Johnson is a leading provider of pharmaceuticals and medical devices worldwide. With more than 275 subsidiaries, its business model is extremely well diversified. Its diversification helps it to withstand economic cycles more effectively.\n\nIn 2026, J&J expects accelerated growth in the Innovative Medicine segment to be driven by its key products, such as Darzalex, Tremfya, Spravato and Erleada, as well as new drugs like Carvykti, Tecvayli and Talvey, and recently launched products, including Tremfya in inflammatory bowel disease, Rybrevant plus Lazcluze in non-small cell lung cancer and the newly approved drug, Inlexzo in bladder cancer. The company reported a $17.22 billion in cash from operating activities.\nJNJ pays out a quarterly dividend of $1.3 per share ($5.2 annualized), with a 2.5% yield at the current stock price. JNJ&rsquo;s payout ratio is 50%, with a five-year dividend growth rate of 5.39%. The company currently carries a Zacks Rank #2. (Check JNJ&rsquo;s dividend history here)\n\nThe Gap, Inc. : With roughly 3,500 stores worldwide, The Gap, Inc. is a premier international specialty retailer offering a diverse range of clothing, accessories, and personal care products. Gap continues to benefit from strong brand performance and rising market share across its largest banners, supported by consistent progress on its brand reinvigoration strategy. Management remains focused on its four strategic priorities: driving financial and operational rigor, reinvigorating its brands, reinforcing its operating platform and supply chain, and energizing its internal culture.\nThe company reported net cash from operating activities of $607 million, with free cash flow of $280 million, underscoring its disciplined approach to business management. Gap pays out a quarterly dividend of 16 cents (66 cents annualized), with a 2.52% yield at the current stock price. GAP&rsquo;s payout ratio is 29%, with a five-year dividend growth rate of 1.49%. The company currently carries a Zacks Rank of 2. (Check GAP&rsquo;s dividend history here)\n\nHewlett Packard Enterprise : Headquartered in Spring, TX, Hewlett Packard Enterprise is a leading provider of essential enterprise technology. The company&rsquo;s top line is benefiting from solid traction in the AI networking market. The acquisition of Juniper Networks underlines Hewlett Packard Enterprise&rsquo;s relentless focus on fortifying its networking business, aligning with the burgeoning demand for high-growth solutions in the evolving tech landscape.\nIn the fourth quarter, HPE generated $2.5 billion in cash from operating activities and produced $1.9 billion in free cash flow, both increasing meaningfully from the prior-year period. HPE pays out a quarterly dividend of 14 cents (57 cents annualized), with a 2.33% yield at the current stock price. HPE&rsquo;s payout ratio is 33%, with a five-year dividend growth rate of 2.21%. The company currently carries a Zacks Rank #3 (Hold). (Check HPE&rsquo;s dividend history here).\n\nWhy Haven't You Looked at Zacks' Top Stocks?\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss . This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAnalog Devices, Inc. (ADI) : Free Stock Analysis Report\nInternational Business Machines Corporation (IBM) : Free Stock Analysis Report\nJohnson & Johnson (JNJ) : Free Stock Analysis Report\nThe Gap, Inc. (GAP) : Free Stock Analysis Report\nHewlett Packard Enterprise Company (HPE) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "ADI",
      "Date": "2025-12-29",
      "Time": "23:48:09",
      "Source": "Yahoo Finance Video",
      "Title": "Chip sales could top $1T in 2026. Is Nvidia still top AI play?",
      "URL": "https://finance.yahoo.com/video/chip-sales-could-top-1t-154809053.html",
      "Content": "Chip sales could top $1T in 2026. Is Nvidia still top AI play?\n\nYahoo Finance Video and Brian Sozzi\nMon, December 29, 2025 at 7:48 AM PST\n\nIn this video: NVDA\n\nMSFT\n\nADI\n\nKLAC\n\nAMZN\n\nWhile Nvidia ( NVDA ) was one of the standout winners of the AI trade in 2025, will the chipmaker remain a tried-and-true stock pick in 2026?\nWinthrop Capital Chief Investment Officer Adam Coons weighs in on the importance of diversification in the artificial intelligence ecosystem, especially as Bank of America analysts forecast semiconductor sales to top $1 trillion next year. Yahoo Finance senior reporter Brooke DiPalma also joins the discussion.\nTo watch more expert insights and analysis on the latest market action, check out more Opening Bid .\n\nVideo Transcript\n\n00:00 Speaker A\nAdam, what's the the best course of action for the average investor? Do they waste a whole day trying to find the next big play in AI or do they just say, you know what? Nvidia's going to win this whole damn thing? I'm just going to bet on them again next year.\n00:15 Adam\nYeah, I definitely wouldn't uh just bet on Nvidia. I I think you do need to do your homework if you want to buy specific names. I think probably the general investor is probably better finding some sort of basket to kind of play the overall space. Uh but we're very early innings in this and\n00:41 Adam\nobviously Nvidia is the winner right now, but uh to say, you know, in five years that we look back that they're going to be the dominant player still, very, very unlikely. Like I said, this is really an evolving space. So I I would be careful with something that's so specific as Nvidia. Uh we kind of like to barbell this with, you know, something like the the big hyperscaler like a like an Alphabet Google, uh because that's really the type of name that uh you could probably have a little bit more comfort in because they just\n01:14 Adam\noverall, the AI story is just benefiting an already existing business model that was doing well. So, I think you would just want to be careful with what we're calling kind of the one trick ponies, like a Nvidia, uh a Core Weve or a Patier right now.\n01:31 Speaker A\nUh, Brooke, let me get over to you because I think what you're seeing in industrial metals and some of the things that Adam's talking about fits nicely with what we heard from Ed Yardini this morning that he might see it is likely to see we are likely to see a broadening out in this rally. Investors doing their homework, trying to get outside of the tried and true Mag 7.\n01:53 Brooke\nYeah, Brian, what we did hear from Ed Danny over the weekend was really ongoing momentum in this market in 2026. He maintained that year end target for the S&P 500 of 7,700 and he said largely it won't be really led by uh the Mag 7, but also what he called the impressive 493 of the S&P 500 as really this broadening out, this boost in productivity growth really leads to overall returns for the\n02:26 Brooke\nS&P 500 in 2026. Specifically, you know, he went on to say that that is really where exactly investors should be thinking about this mindset. You know, not really overweight technology, but more so thinking about the other users of AI as opposed to just the producers of AI. And so certainly he's not alone in this uh momentum that he thinks will exist within 2026 ongoing from what we've seen so far in the returns in 2025.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Ticker": "ADI",
      "Date": "2025-12-29",
      "Time": "20:00:35",
      "Source": "Simply Wall St.",
      "Title": "These 4 Measures Indicate That Analog Devices (NASDAQ:ADI) Is Using Debt Safely",
      "URL": "https://finance.yahoo.com/news/4-measures-indicate-analog-devices-120035386.html",
      "Content": "These 4 Measures Indicate That Analog Devices (NASDAQ:ADI) Is Using Debt Safely\n\nSimply Wall St\nMon, December 29, 2025 at 4:00 AM PST 4 min read\n\nIn this article: ADI\n\nDavid Iben put it well when he said, 'Volatility is not a risk we care about. What we care about is avoiding the permanent loss of capital.' So it seems the smart money knows that debt - which is usually involved in bankruptcies - is a very important factor, when you assess how risky a company is. We can see that Analog Devices, Inc. ( NASDAQ:ADI ) does use debt in its business. But the more important question is: how much risk is that debt creating?\n\nThis technology could replace computers: discover the 20 stocks are working to make quantum computing a reality.\nWhen Is Debt A Problem? Debt and other liabilities become risky for a business when it cannot easily fulfill those obligations, either with free cash flow or by raising capital at an attractive price. Part and parcel of capitalism is the process of 'creative destruction' where failed businesses are mercilessly liquidated by their bankers. However, a more usual (but still expensive) situation is where a company must dilute shareholders at a cheap share price simply to get debt under control. Of course, debt can be an important tool in businesses, particularly capital heavy businesses. When we examine debt levels, we first consider both cash and debt levels, together.\n\nHow Much Debt Does Analog Devices Carry? The image below, which you can click on for greater detail, shows that at November 2025 Analog Devices had debt of US$8.60b, up from US$7.62b in one year. However, it also had US$3.65b in cash, and so its net debt is US$4.95b.\nHow Strong Is Analog Devices' Balance Sheet? According to the last reported balance sheet, Analog Devices had liabilities of US$3.25b due within 12 months, and liabilities of US$10.9b due beyond 12 months. Offsetting this, it had US$3.65b in cash and US$1.44b in receivables that were due within 12 months. So its liabilities outweigh the sum of its cash and (near-term) receivables by US$9.09b.\n\nOf course, Analog Devices has a titanic market capitalization of US$135.6b, so these liabilities are probably manageable. But there are sufficient liabilities that we would certainly recommend shareholders continue to monitor the balance sheet, going forward.\nCheck out our latest analysis for Analog Devices\nWe measure a company's debt load relative to its earnings power by looking at its net debt divided by its earnings before interest, tax, depreciation, and amortization (EBITDA) and by calculating how easily its earnings before interest and tax (EBIT) cover its interest expense (interest cover). The advantage of this approach is that we take into account both the absolute quantum of debt (with net debt to EBITDA) and the actual interest expenses associated with that debt (with its interest cover ratio).\n\nStory Continues\nAnalog Devices's net debt is only 0.99 times its EBITDA. And its EBIT easily covers its interest expense, being 14.1 times the size. So we're pretty relaxed about its super-conservative use of debt. On top of that, Analog Devices grew its EBIT by 45% over the last twelve months, and that growth will make it easier to handle its debt. There's no doubt that we learn most about debt from the balance sheet. But ultimately the future profitability of the business will decide if Analog Devices can strengthen its balance sheet over time. So if you want to see what the professionals think, you might find this free report on analyst profit forecasts to be interesting.\n\nFinally, a business needs free cash flow to pay off debt; accounting profits just don't cut it. So we always check how much of that EBIT is translated into free cash flow. Happily for any shareholders, Analog Devices actually produced more free cash flow than EBIT over the last three years. That sort of strong cash generation warms our hearts like a puppy in a bumblebee suit.\nOur View The good news is that Analog Devices's demonstrated ability to cover its interest expense with its EBIT delights us like a fluffy puppy does a toddler. And that's just the beginning of the good news since its conversion of EBIT to free cash flow is also very heartening. It looks Analog Devices has no trouble standing on its own two feet, and it has no reason to fear its lenders. For investing nerds like us its balance sheet is almost charming. When analysing debt levels, the balance sheet is the obvious place to start. But ultimately, every company can contain risks that exist outside of the balance sheet. These risks can be hard to spot. Every company has them, and we've spotted 1 warning sign for Analog Devices you should know about.\n\nAt the end of the day, it's often better to focus on companies that are free from net debt. You can access our special list of such companies (all with a track record of profit growth). It's free.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ]
}