{
  "stock_id": "AMD",
  "last_updated": "2025-12-30T17:11:16.848Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-31",
      "Time": "00:11:14",
      "Source": "GuruFocus.com",
      "Title": "AMD Seen Rebounding in China AI Sales on $675 Million Alibaba Order",
      "URL": "https://finance.yahoo.com/news/amd-seen-rebounding-china-ai-161114669.html",
      "Content": "AMD Seen Rebounding in China AI Sales on $675 Million Alibaba Order\n\nFaizan Farooque\nTue, December 30, 2025 at 8:11 AM PST 1 min read\n\nIn this article: AMD\n\nOPAI.PVT\n\nBABA\n\nThis article first appeared on GuruFocus .\nAdvanced Micro Devices Inc. ( AMD , Financials ) is about to see a big rebound in its AI business after news that GPU shipments to China are starting up again, driven by a possible $675 million purchase from Alibaba Group.The agreement would be a big step forward for AMD's MI308 chips, which are designed to fulfill U.S. export rules while still addressing the high demand for AI acceleration technology in China. Analysts think this is an indication that AMD is getting back some of the market share it lost to Chinese chipmakers when trade restrictions were put in place.At AMD's 2025 Financial Analyst Day, the firm said that profits per share might rise from less than $4 in 2025 to more than $24 by 2030. This is because demand for data centers and AI infrastructure is growing. Management also said that possible agreements with OpenAI and big cloud clients might help the company thrive in the long run.The chipmaker's ability to get back into the Chinese AI industry while following U.S. export rules might provide it a big boost in sales going into 2026. Analysts think that AMD's high-performance computing sector might benefit a lot from additional GPU sales to China. This supports the company's long-term price objective of $600.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "23:45:00",
      "Source": "Zacks",
      "Title": "Can Intel's Investment-Driven Strategy Regain Its Competitive Edge?",
      "URL": "https://finance.yahoo.com/news/intels-investment-driven-strategy-regain-154500874.html",
      "Content": "Can Intel's Investment-Driven Strategy Regain Its Competitive Edge?\n\nZacks Equity Research\nTue, December 30, 2025 at 7:45 AM PST 3 min read\n\nIn this article: INTC\n\nQCOM\n\nAMD\n\nNVDA\n\nSFTBF\n\nIntel Corporation ( INTC ) has completed a previously announced $5 billion investment from NVIDIA Corporation ( NVDA ), under which the latter purchased around 214.7 million shares of the former at $23.28 per share. Earlier in December, this transaction received U.S. antitrust approval from the Federal Trade Commission. This purchase gives NVIDIA roughly a 4% equity stake in Intel through a private placement of shares.\n\nThe partnership aims to tightly combine Intel’s custom-designed x86 CPUs with NVIDIA’s AI GPUs and NVLink interconnect technology to create faster, more efficient AI systems and next-generation PCs with stronger AI and graphics performance. This could help Intel remain competitive in the AI era.\nIntel had also secured $8.9 billion in funds from the U.S. government to support semiconductor manufacturing and packaging projects in Arizona, New Mexico, Ohio and Oregon in order to boost the domestic chip industry. SoftBank has also invested $2 billion, providing funds to support Intel’s restructuring and AI projects.\nIntel is constantly making efforts to bring huge investments to strengthen its balance sheet, supporting heavy spending on new factories and R&D, boosting market confidence and enabling deeper technology collaboration with firms like NVIDIA.\n\nHow Are Rivals Performing? Intel faces competition from Qualcomm Incorporated ( QCOM ) and Advanced Micro Devices ( AMD ). Qualcomm recently completed its $2.4 billion acquisition of British semiconductor company Alphawave Semi to strengthen its AI, data center and high-speed connectivity technologies, boosting its competitiveness beyond smartphones. By strengthening its PC chip offerings through programs like Snapdragon X, Qualcomm can expand into new markets such as AI infrastructure, edge computing and personal computers. Qualcomm entered the AI infrastructure space by developing AI accelerators like AI200 & AI250.\n\nAMD is set to launch high-performance AI GPUs, EPYC server CPUs and full AI systems like Helios to compete with NVIDIA and provide faster, more efficient solutions for data centers and enterprises. AMD is partnering with companies like OpenAI and Oracle to expand across gaming, PCs and servers to increase revenues and stay competitive. The company continues to improve its ROCm open software stack and open hardware standards.\nINTC’s Price Performance, Valuation & Estimates Shares of Intel have surged 85% over the past year compared with the industry ’s growth of 34.1%.\n\nImage Source: Zacks Investment Research\nGoing by the price/book ratio, the company's shares currently trade at 1.5 book value, lower than 32.5 of the industry average.\n\nStory Continues\n\nImage Source: Zacks Investment Research\nINTC’s earnings estimates for 2025 have increased 6.3% to 34 cents per share, while those for 2026 have declined 6.5% to 58 cents over the past 60 days.\n\nImage Source: Zacks Investment Research\nIntel stock currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "23:14:22",
      "Source": "Investor's Business Daily",
      "Title": "CES 2026: AI, Robots, Wearables, Industrial Machines In Focus",
      "URL": "https://finance.yahoo.com/m/c30e2b90-b519-39f1-b2be-cb2d29297bf2/ces-2026%3A-ai%2C-robots%2C.html",
      "Content": "CES 2026: AI, Robots, Wearables, Industrial Machines In Focus\n\nPATRICK SEITZ\nTue, December 30, 2025 at 7:14 AM PST 6 min read\n\nIn this article: DE\n\nNVDA\n\nCAT\n\nAMD\n\nThe CES 2026 technology trade show in Las Vegas promises to shine a spotlight on the physical embodiment of AI.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "23:14:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock and the Bright Side of the Groq Deal",
      "URL": "https://finance.yahoo.com/m/a84f7af6-04aa-3bb9-8440-10aa23d41301/nvidia-stock-and-the-bright.html",
      "Content": "Nvidia Stock and the Bright Side of the Groq Deal\n\nAdam Clark\nTue, December 30, 2025 at 7:14 AM PST 2 min read\n\nIn this article: NVDA\n\nAMD\n\nAVGO\n\nGROQ.PVT\n\nNvidia is paying $20 billion for Groq’s technology, including compensation packages for many of the company’s employees who will join Nvidia, The Wall Street Journal reported.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "22:25:00",
      "Source": "Motley Fool",
      "Title": "This Could Derail Intel's Comeback in 2026",
      "URL": "https://finance.yahoo.com/m/a3c3c0b1-515e-3b98-985f-d19243c24d76/this-could-derail-intel%27s.html",
      "Content": "This Could Derail Intel's Comeback in 2026\n\nTimothy Green, The Motley Fool\nTue, December 30, 2025 at 6:25 AM PST 5 min read\n\nIn this article: INTC\n\nAMD\n\nTSM\n\nKey Points Intel has a strong PC roadmap for 2026, including Panther Lake and Nova Lake.\nBoth CPU families will use the cutting-edge Intel 18A manufacturing process.\nSoaring memory chip prices could force PC price hikes and limit Intel's comeback in the PC market.\n10 stocks we like better than Intel ›\nOne of the issues plaguing Intel (NASDAQ: INTC) over the past few years has been an erosion of its PC CPU market share. Past manufacturing delays forced the company to use aging process nodes while rival AMD tapped TSMC 's top-tier manufacturing technology. Intel later outsourced manufacturing for its Lunar Lake and Arrow Lake chips, but the latter was a mixed bag that rubbed reviewers and consumers the wrong way.\nAgainst this backdrop, Intel's share of the desktop and laptop CPU market has tumbled. Intel remains the market leader, but AMD controlled approximately one-third of the desktop CPU market and more than one-fifth of the laptop CPU market in the third quarter. A decade ago, this kind of progress from AMD would have been unthinkable.\n\nIn 2026, Intel could regain some of the lost market share. Panther Lake for laptops and Nova Lake for desktops look promising, and both will be built on the new Intel 18A process node. However, soaring memory chip prices will likely increase PC prices and potentially dampen demand.\nIntel's 2026 roadmap shows promise Panther Lake will be the first mass-produced chip to be manufactured using the Intel 18A process, and it is expected to begin shipping in volume in early 2026. Intel 18A moves Intel to a new type of transistor and introduces backside power delivery, a technology that can boost efficiency by moving power circuitry to the back of the chip. The Intel 18A process is the first in the industry to implement backside power delivery.\n\nNova Lake will come later in 2026 for desktops, succeeding the troubled Arrow Lake family. In the meantime, the company is rumored to be launching a refresh of Arrow Lake, although the core problems with Arrow Lake are likely to remain unresolved until Nova Lake arrives. While Nova Lake's specifications are still unclear, rumors suggest high core counts and large amounts of cache for some models, which could better compete with AMD's 3D V-Cache chips.\nLaunching a new architecture on a new process node is always a challenge, but if Panther Lake and Nova Lake deliver solid improvements in performance and efficiency, they could be big winners for Intel.\nMemory prices could be a major problem Unfortunately for Intel, its Panther Lake and Nova Lake launches coincide with a severe and escalating shortage of DRAM memory. AI data centers need both high-bandwidth memory and standard DRAM memory in copious quantities. Memory chip manufacturers have been shifting production to HBM chips while being cautious about expanding overall production, creating a shortage of DRAM chips.\n\nStory Continues\nPC prices are almost certain to rise in 2026 as OEMs grapple with rising component costs. Dell is reportedly raising commercial PC prices by 10% to 30% in response to the memory chip crisis, a move that will likely be followed by other OEMs. Businesses could slow down upgrade plans in response. On the consumer side, higher prices and configurations with less memory are likely to be the prevailing themes in 2026.\n\nBeyond the potential for higher prices to hurt overall demand for PCs, lower memory configurations could hurt Intel's AI PC push. Panther Lake laptops will feature greater AI processing power than their predecessors, but a lack of memory could hinder usability. Microsoft requires at least 16 GB of RAM for a laptop to be labeled a Copilot+ PC, for example, because AI applications require significant amounts of memory.\nSoaring memory chip prices put Intel in a tough spot. Even if Panther Lake and Nova Lake are home runs, delivering performance and efficiency that top AMD, high PC prices could spoil the party. AMD is also impacted, so Intel won't be at a relative disadvantage and could still win market share. However, the size of the market could temporarily shrink as businesses and consumers resist price increases.\n\nWith memory chip production unlikely to increase meaningfully anytime soon, and with the AI boom still going strong, Intel's PC comeback in 2026 may be weaker than it could have otherwise been.\nShould you buy stock in Intel right now? Before you buy stock in Intel, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Intel wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $507,744 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,153,827 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 984 % — a market-crushing outperformance compared to 195% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 29, 2025\nTimothy Green has positions in Intel. The Motley Fool has positions in and recommends Advanced Micro Devices, Intel, Microsoft, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nThis Could Derail Intel's Comeback in 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "21:33:00",
      "Source": "Barrons.com",
      "Title": "Cathie Wood’s ARK Funds Have Crushed the Market This Year. What’s She’s Buying Now.",
      "URL": "https://finance.yahoo.com/m/45ada057-0d95-3e92-9afc-b859282038f2/cathie-wood%E2%80%99s-ark-funds-have.html",
      "Content": "Cathie Wood’s ARK Funds Have Crushed the Market This Year. What’s She’s Buying Now.\n\nCallum Keown\nTue, December 30, 2025 at 5:33 AM PST 2 min read\n\nIn this article: TSLA\n\nAMD\n\nHOOD\n\nCOIN\n\nBABA\n\nCathie Wood’s ARK funds are on track to beat the market in 2025. She's already looking ahead to next year.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "20:45:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Gains. How Groq Can Help Defend Its AI Chip Dominance.",
      "URL": "https://finance.yahoo.com/m/a84f7af6-04aa-3bb9-8440-10aa23d41301/nvidia-stock-gains.-how-groq.html",
      "Content": "Nvidia Stock Gains. How Groq Can Help Defend Its AI Chip Dominance.\n\nAdam Clark\nTue, December 30, 2025 at 4:45 AM PST 2 min read\n\nIn this article: NVDA\n\nGROQ.PVT\n\nAMD\n\nAVGO\n\nNvidia is paying $20 billion for Groq’s technology, including compensation packages for many of the company’s key employees who will join Nvidia, The Wall Street Journal reported.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "20:25:26",
      "Source": "GuruFocus.com",
      "Title": "Micron Stock Climbs to Record High as AI Drives Memory Chip Demand",
      "URL": "https://finance.yahoo.com/news/micron-stock-climbs-record-high-122526887.html",
      "Content": "Micron Stock Climbs to Record High as AI Drives Memory Chip Demand\n\nNauman Khan\nTue, December 30, 2025 at 4:25 AM PST 1 min read\n\nIn this article: MU\n\n^GSPC\n\nNVDA\n\nAMD\n\nThis article first appeared on GuruFocus .\nMicron ( NASDAQ:MU ) stock climbed more than 3% on Monday, hitting a new all-time intraday high of $294.3, fueled by surging demand for memory used in artificial intelligence applications.\nThe rally pushed the stock past its previous record of $290.87 set just days earlier, highlighting investor enthusiasm for AI-focused chipmakers.\n\nWarning! GuruFocus has detected 6 Warning Sign with MU.\nList of 52-Week Lows\nList of 3-Year Lows\nList of 5-Year Lows\nIs MU fairly valued? Test your thesis with our free DCF calculator.\nThe gains came even as the broader market dipped, with the S&P 500 and Dow Jones moving lower, showing that Micron's momentum is largely sector-driven. Recent earnings reinforced the bullish case: the company posted $13.64 billion in revenue and adjusted EPS of $4.78, propelled by high-bandwidth memory (HBM) used in Nvidia ( NASDAQ:NVDA ) and AMD ( NASDAQ:AMD ) AI chips.\nLooking ahead, management expects the HBM market to grow from $35 billion in 2025 to nearly $100 billion by 2028, roughly 40% annual growth. Analysts, including Rosenblatt Securities, have raised price targets in response to the strong outlook.\nCompetition is still something to monitor. Samsung and SK Hynix are increasing the production of HBM and that could drive the prices down in case of a supply and demand mismatch. Micron 2026 depends on stable AI orders, no change in price and the speed with which the competition will equip the AI order.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "19:36:52",
      "Source": "MT Newswires",
      "Title": "Social Buzz: Wallstreetbets Stocks Mostly Advancing Premarket Tuesday; Rocket Lab, D-Wave to Rise",
      "URL": "https://finance.yahoo.com/news/social-buzz-wallstreetbets-stocks-mostly-113652488.html",
      "Content": "PREMIUM\nSocial Buzz: Wallstreetbets Stocks Mostly Advancing Premarket Tuesday; Rocket Lab, D-Wave to Rise\n\nMT Newswires\nTue, December 30, 2025 at 3:36 AM PST 1 min read\n\nIn this article: QBTS\n\nMU\n\nAMD\n\nTSLA\n\nNVDA\n\nThe most-talked-about stocks in the Reddit subforum Wallstreetbets were mostly higher hours before T\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "19:14:31",
      "Source": "GuruFocus.com",
      "Title": "Nvidia Shares Slide on Rumors of Next-Year GPU Price Jumps",
      "URL": "https://finance.yahoo.com/news/nvidia-shares-slide-rumors-next-111431550.html",
      "Content": "Nvidia Shares Slide on Rumors of Next-Year GPU Price Jumps\n\nNauman Khan\nTue, December 30, 2025 at 3:14 AM PST 1 min read\n\nIn this article: NVDA\n\nAMD\n\nThis article first appeared on GuruFocus .\nShares of Nvidia ( NASDAQ:NVDA ) slipped on Monday after reports said multiple semiconductor companies plan GPU price increases in early 2026.\nMultiple outlets reported AMD would raise prices next month, followed by Nvidia a month later. Reports suggested AMD may add roughly $10 for each 8GB of VRAM, meaning cards with 8GB to 24GB could see increases of about $10 to $30. Nvidia's timing and magnitude remain unclear.\n\nWarning! GuruFocus has detected 5 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nInvestors sold into the headlines. NVDA shares slid about 1.2%.\nAnalysts said the moves reflect cost pressures from rising memory prices as AI data-center demand lifts component demand. Modest price lifts could help protect supplier margins, they said, but significant pass-through risks that would dent demand appear limited for now.\nTraders will be watching company statements, channel inventories and guidance in coming weeks to gauge whether the reported increases are real or just preliminary vendor pricing plans. Market reaction could shift once firms confirm.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "18:33:00",
      "Source": "Motley Fool",
      "Title": "Nvidia, AMD, and Micron Technology Could Help This Unstoppable ETF Turn $250,000 Into $1 Million in 10 Years",
      "URL": "https://finance.yahoo.com/m/1940fe67-84ae-370a-9f71-4eaa4c092627/nvidia%2C-amd%2C-and-micron.html",
      "Content": "Nvidia, AMD, and Micron Technology Could Help This Unstoppable ETF Turn $250,000 Into $1 Million in 10 Years\n\nAnthony Di Pizio, The Motley Fool\nTue, December 30, 2025 at 2:33 AM PST 6 min read\n\nIn this article: NVDA\n\nMU\n\nAMD\n\n^GSPC\n\nOPAI.PVT\n\nKey Points The artificial intelligence (AI) revolution would be at a standstill without advanced chips and components.\nNvidia, Advanced Micro Devices, and Micron supply some of that critical hardware, and their shares are up by an average of 119% in 2025.\nThe iShares Semiconductor ETF exclusively invests in semiconductor companies that stand to benefit from megatrends like AI.\n10 stocks we like better than iShares Trust - iShares Semiconductor ETF ›\n\nTop artificial intelligence (AI) developers like OpenAI and Anthropic continue to launch new models, with each one being \"smarter\" and more capable than the last. However, every new model also soaks up more computing power than its predecessors, so it requires significantly more data center capacity.\nSome of the biggest suppliers of AI infrastructure, chips, and components include Nvidia (NASDAQ: NVDA) , Advanced Micro Devices (NASDAQ: AMD) , and Micron Technology (NASDAQ: MU) . Shares in those three companies have surged by an average of 119% in 2025 alone, crushing the S&P 500 index, which is up just 18%.\nIn other words, investors who had little or no exposure to the AI semiconductor space this year probably underperformed the broader market.\nFortunately, there's a simple way to buy a slice of this hypergrowth industry without having to pick winners and losers. The iShares Semiconductor ETF (NASDAQ: SOXX) is an exchange-traded fund (ETF) that exclusively invests in companies like Nvidia, AMD, Micron, and many of their peers. Here's how it could turn an investment of $250,000 into $1 million over the next 10 years.\nThe best AI hardware stocks packed into one ETF The iShares Semiconductor ETF solely invests in American companies that design, distribute, and manufacture chips and components, but primarily those benefiting from opportunities like AI . Its narrow focus is the reason its portfolio only includes 30 stocks. The fund is also quite top heavy, with its three largest holdings sporting a combined weighting of 22.7%:\nStock\niShares ETF Portfolio Weighting\n1. Nvidia\n8.22%\n2. Advanced Micro Devices (AMD)\n7.62%\n3. Micron Technology\n6.88%\n\nData source: iShares. Portfolio weightings are accurate as of Dec. 24, 2025, and are subject to change.\nNvidia's graphics processing units (GPUs) are the best chips on the market for developing AI models. Its current Blackwell Ultra lineup was designed to deliver sufficient computing power for the industry's latest reasoning models, like OpenAI's GPT 5.2, Anthropic's Claude 4.5, and Alphabet 's Gemini 3. I think Nvidia stock is still cheap despite its 41% gain in 2025, which leaves plenty of room for more upside from here.\n\nStory Continues\nAMD is chasing Nvidia in the market for data center chips. The company's latest MI350 Series GPUs have captured some of its key rival's top customers, but they still fall modestly short in terms of performance. Next year, AMD plans to launch its new MI400 GPUs as part of a fully integrated data center rack called Helios, which could deliver 10 times more performance than its MI350 GPUs. This company might be a real threat to Nvidia at that point.\n\nThen there is Micron Technology, which is one of the world's leading suppliers of memory and storage chips. Both Nvidia and AMD have integrated Micron's HBM3E (high-bandwidth memory) solutions into their data center GPUs to unlock their maximum processing speeds. Micron is already sold out of its entire 2026 supply of data center memory, including its upcoming HBM4E solution, which is poised to deliver improvements in both capacity and energy efficiency.\nOutside of its top three positions, the iShares ETF holds several other top AI semiconductor stocks like Broadcom , Texas Instruments , and Taiwan Semiconductor Manufacturing .\nTurning $250,000 into $1 million over the next decade The iShares Semiconductor ETF is on track to end 2025 with an eye-popping 43% return. That isn't sustainable over the long run, but the ETF has delivered a compound annual return of 27.2% over the past decade, so it's no stranger to high growth. Even its more modest average annual gain of 11.8% since its inception in 2001 is still better than the performance of the S&P 500 over the same period.\nHere's how long it might take for the iShares ETF to turn an investment of $250,000 into $1 million, based on three different average annual returns:\nInitial Investment\nCompound Annual Return\nTime to Reach $1 Million\n$250,000\n11.8%\n13 Years\n$250,000\n19.5% (midpoint)\n8 Years\n$250,000\n27.2%\n6 Years\n\nCalculations by author.\nAccording to Nvidia CEO Jensen Huang, annual spending on AI data center infrastructure and chips could reach $4 trillion by 2030. If that happens, the iShares ETF is likely to deliver compound annual returns in excess of 20% for the foreseeable future. But to be perfectly clear, that wouldn't be sustainable under normal circumstances because of the law of large numbers.\n\nFor example, Nvidia is already a $4.6 trillion company. If its market cap grew by 27.2% annually for the next decade, it would be worth almost $50 trillion. The output of the entire U.S. economy was less than $30 trillion in 2024, so although AI is a revolutionary technology, it's important for investors to temper their expectations.\nFortunately, the iShares ETF can still turn $250,000 into $1 million over the next 10 years even if its annual returns moderate to slightly below 20%. Per the above table, if investors are a little more patient, the ETF could also help them join the million-dollar club in 13 years even if its returns suffer a significant reversion back to their long-term average of 11.8%.\nBut I think its returns are likely to remain elevated for now, considering practically every chipmaker is experiencing more demand than it can possibly supply.\n\nShould you invest $1,000 in iShares Trust - iShares Semiconductor ETF right now? Before you buy stock in iShares Trust - iShares Semiconductor ETF, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and iShares Trust - iShares Semiconductor ETF wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 29, 2025\nAnthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Nvidia, Taiwan Semiconductor Manufacturing, Texas Instruments, and iShares Trust-iShares Semiconductor ETF. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nNvidia, AMD, and Micron Technology Could Help This Unstoppable ETF Turn $250,000 Into $1 Million in 10 Years was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "13:00:24",
      "Source": "Insider Monkey",
      "Title": "Wall Street Bullish on Advanced Micro Devices (AMD), Here’s Why",
      "URL": "https://finance.yahoo.com/news/wall-street-bullish-advanced-micro-050024487.html",
      "Content": "Wall Street Bullish on Advanced Micro Devices (AMD), Here’s Why\n\nTalha Qureshi\nMon, December 29, 2025 at 9:00 PM PST 2 min read\n\nIn this article: AMD\n\nTFC\n\nAdvanced Micro Devices, Inc. (NASDAQ: AMD ) is among the Stocks That Will Make You Rich in 2026 . Wall Street has a bullish outlook on Advanced Micro Devices, Inc. (NASDAQ:AMD) with analysts 12 month price target reflecting more than 34% upside from the current level. The bullish sentiment is mainly based on the upcoming Helios rack and the overall positive outlook on the AI trade.\nRecently, on December 19, William Stein from Truist Financial reiterated a Buy rating on the stock with a price target of $201.06. Earlier, on December 15, Harsh Kumar from Piper Sandler reiterated a Buy rating on the stock with a $280 price target.\nWilliam Stein of Truist noted that the AI sector faces major challenges related to the power constraints and the investment to build the power infrastructure. However, the analyst believes that the semiconductor stocks still remain relatively cheap considering their growth potential. Moreover, Stein also sees upside for the sector heading into 2026, driven by increased capital expenditure.\n\nSimilarly, Piper Sandler also remains bullish on Advanced Micro Devices, Inc. (NASDAQ:AMD). The firm noted several catalysts for the company, including the company’s ability to ramp up its MI300 series ramp and technical traction for the upcoming MI400 series launch. The firm also expects significant near-term upside from the upcoming Helios rack, expected to launch by mid 2026.\nAdvanced Micro Devices, Inc. (NASDAQ:AMD) is a global semiconductor company that manufactures GPUs, microprocessors, and high-performance computing solutions and serves a number of high-growth industries like gaming, data centers, and AI.\nWhile we acknowledge the potential of AMD as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "12:32:25",
      "Source": "StockStory",
      "Title": "2 Volatile Stocks with Promising Prospects and 1 Facing Challenges",
      "URL": "https://finance.yahoo.com/news/2-volatile-stocks-promising-prospects-043225330.html",
      "Content": "2 Volatile Stocks with Promising Prospects and 1 Facing Challenges\n\nJabin Bastian\nMon, December 29, 2025 at 8:32 PM PST 4 min read\n\nIn this article: FITB\n\nAMD\n\nFITBP\n\nAMZN\n\nMarket swings can be tough to stomach, and volatile stocks often experience exaggerated moves in both directions. While many thrive during risk-on environments, many also struggle to maintain investor confidence when the ride gets bumpy.\nNavigating these stocks isn’t easy, which is why StockStory helps you find Comfort In Chaos . Keeping that in mind, here are two volatile stocks that could deliver huge gains and one that could just as easily collapse.\n\nOne Stock to Sell: Fifth Third Bancorp (FITB) Rolling One-Year Beta: 1.24\nNamed after the merger of Third National Bank and Fifth National Bank in 1908, Fifth Third Bancorp (NASDAQ:FITB) is a financial services company that provides banking, lending, wealth management, and investment services to individuals and businesses across the Midwest and Southeast.\n\nWhy Do We Think Twice About FITB?\n4.1% annual net interest income growth over the last five years was slower than its banking peers\nPerformance over the past two years shows each sale was less profitable, as its earnings per share fell by 2.8% annually\nLoan losses and capital returns have eroded its tangible book value per share this cycle as its tangible book value per share declined by 1.2% annually over the last five years\nAt $47.82 per share, Fifth Third Bancorp trades at 1.6x forward P/B. Check out our free in-depth research report to learn more about why FITB doesn’t pass our bar .\nTwo Stocks to Watch: Amazon (AMZN) Rolling One-Year Beta: 1.41\nFounded by Jeff Bezos after quitting his stock-picking job at D.E. Shaw, Amazon (NASDAQ:AMZN) is the world’s largest online retailer and provider of cloud computing services.\nWhy Are We Positive On AMZN?\nAmazon revolutionized the way consumers shop. This isn’t the only tailwind to its impressive revenue growth, as its highly profitable AWS segment has also driven top-line momentum.\nThe company's best-in-class revenue growth coupled with modest operating leverage on its past infrastructure investments has led to elite EPS growth over a multi-year period.\nThough dominant, Amazon's capital-intensive e-commerce business means its profitability is structurally lower than its pure-play tech peers. Can the company pull it up, or are we reaching a ceiling?\n\nAmazon is trading at $231.66 per share, or 31.3x forward price-to-earnings. Is now the time to initiate a position? See for yourself in our in-depth research report, it’s free for active Edge members .\nAMD (AMD) Rolling One-Year Beta: 1.71\nFounded in 1969 by a group of former Fairchild semiconductor executives led by Jerry Sanders, Advanced Micro Devices (NASDAQ:AMD) is one of the leading designers of computer processors and graphics chips used in PCs and data centers.\n\nStory Continues\nWhy Are We Bullish on AMD?\nImpressive 29.9% annual revenue growth over the last five years indicates it’s winning market share this cycle\nProjected revenue growth of 27.1% for the next 12 months is above its two-year trend, pointing to accelerating demand\nEarnings per share grew by 27.9% annually over the last five years and trumped its peers\n\nAMD’s stock price of $215.23 implies a valuation ratio of 38.8x forward P/E. Is now a good time to buy? Find out in our full research report, it’s free for active Edge members .\nStocks We Like Even More Your portfolio can’t afford to be based on yesterday’s story. The risk in a handful of heavily crowded stocks is rising daily.\nThe names generating the next wave of massive growth are right here in our Top 5 Growth Stocks for this month . This is a curated list of our High Quality stocks that have generated a market-beating return of 244% over the last five years (as of June 30, 2025).\nStocks that made our list in 2020 include now familiar names such as Nvidia (+1,326% between June 2020 and June 2025) as well as under-the-radar businesses like the once-micro-cap company Kadant (+351% five-year return). Find your next big winner with StockStory today for free . Find your next big winner with StockStory today . Find your next big winner with StockStory today .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "03:53:16",
      "Source": "Barchart",
      "Title": "Intel Stock Had a Banner Year But Is Still 50% Off Its Record Highs. Are More Gains in Store for 2026?",
      "URL": "https://finance.yahoo.com/m/a8b42796-9593-3d38-85b1-72805ec62ca2/intel-stock-had-a-banner-year.html",
      "Content": "Intel Stock Had a Banner Year But Is Still 50% Off Its Record Highs. Are More Gains in Store for 2026?\n\nWajeeh Khan\nMon, December 29, 2025 at 11:53 AM PST 2 min read\n\nIn this article: INTC\n\nAMD\n\nQCOM\n\nTSM\n\nAAPL\n\nIntel (INTC) stock has been a major outperformer this year as CEO Lip-Bu Tan’ strategic vision renewed investor confidence in the company’s ability to compete in the global AI arms race.\nUnder his leadership, the company secured billions in private and federal investments, paving the way to advance its foundry ambitions.\n\nMore News from Barchart Micron Technology Bear Put Spread Could Return 197% in this Down Move\nSanta Claus Rally, Fed Minutes and Other Can't Miss Items this Week\nMP Materials Gained 230% in 2025. Should You Buy, Sell, or Hold MP Stock for 2026?\nTired of missing midday reversals? The FREE Barchart Brief newsletter keeps you in the know. Sign up now!\nVersus their pandemic high, however, Intel shares remain down some 50%, suggesting persistent structural and executions risks continue to weigh on sentiment.\nWhat to Expect From Intel Stock in 2026 The latest setback for INTC stock came from Nvidia (NVDA) that’s reportedly scrapped plans of producing its advanced chips using Intel’s 18A node.\nStill, Daniel Newman – the chief executive of Futurum Group – believes the longer term bull case remains intact for one simple reason: Taiwan Semi (TSM) just “can’t produce enough chips.”\n\nThe unprecedented AI-driven demand is making big names like Apple (AAPL), Qualcomm (QCOM), and even AMD (AMD) explore alternatives, reinforcing Intel’s role as an auxiliary capacity provider.\nAnd since demand is truly explosive, being only an adjunct resource for the semiconductor space may prove sufficient in driving Intel stock higher in 2026, he told CNBC in a recent interview.\nINTC Shares Remain Inexpensive to Own Newman doesn’t see NVDA news as a major setback for Intel shares since Lip-Bu Tan had already broadcast that the initial ramp-up of the firm’s 18A node is optimized for and dedicated to its own internal products.\nAccording to him, the real inflection point for Intel will be its upcoming “14A” process, expected to enter volume production in 2028.\n\n“This is the one where rubber meets the road for companies like Nvidia, Apple, and others.”\nFrom a valuation perspective, INTC shares are just as attractive. Despite an explosive year-to-date rally, they’re going for just over 3x sales at the time of writing, versus more than 35x for Nvidia.\nWall Street Disagrees with Newman on Intel Wall Street analysts do not entirely agree with Newman’s constructive view on Intel stock, though.\nThe consensus rating on INTC shares remains at “Hold” only with the mean target of nearly $37 already in line with the price at which they are trading currently.\n\nStory Continues\nThis article was created with the support of automated content tools from our partners at Sigma.AI. Together, our financial data and AI solutions help us to deliver more informed market headline analysis to readers faster than ever.\nOn the date of publication, Wajeeh Khan did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "03:42:16",
      "Source": "Barchart",
      "Title": "AMD Stock Is Up 78% in 2025. What to Expect for Shares in 2026... and Beyond",
      "URL": "https://finance.yahoo.com/m/40346e70-f917-3f2b-b2fb-752bbbcf55a0/amd-stock-is-up-78%25-in-2025..html",
      "Content": "AMD Stock Is Up 78% in 2025. What to Expect for Shares in 2026... and Beyond\n\nWajeeh Khan\nMon, December 29, 2025 at 11:42 AM PST 2 min read\n\nIn this article: AMD\n\nINTC\n\nNVDA\n\nAdvanced Micro Devices (AMD) shares had a blockbuster 2025 as the company succeeded in positioning itself as the price-to-performance leader in artificial intelligence (AI) chips.\nStill, a senior Mizuho analyst, Vijay Rakesh, believes the semiconductor titan remains undervalued and poised to push higher on continued AI spending in 2026.\n\nMore News from Barchart Micron Technology Bear Put Spread Could Return 197% in this Down Move\nSanta Claus Rally, Fed Minutes and Other Can't Miss Items this Week\nMP Materials Gained 230% in 2025. Should You Buy, Sell, or Hold MP Stock for 2026?\nMarkets move fast. Keep up by reading our FREE midday Barchart Brief newsletter for exclusive charts, analysis, and headlines.\nAt the time of writing, AMD shares are trading at nearly 3x their price in the first week of April.\nAMD Stock Seen Rallying Another 30% Mizuho believes AMD has successfully pivoted to a yearly hardware update cycle, which keeps it competitive with Nvidia’s (NVDA) Blackwell architecture.\nAdvanced Micro Devices has been dismantling Intel’s (INTC) once-untouchable lead in server CPUs as well, with its share of that market expected to surpass 50% next year.\n\nMoreover, the company’s multi-year OpenAI deal is nothing short of a “game-changer,” set to add another $22 billion to its annual revenue by the end of this decade, according to Vijay Rakesh.\nIn his research note, he dubbed these tailwinds sufficient to drive AMD stock to $277 or up nearly 30% from here in 2026.\nHow Do AMD Shares Compare to NVDA? Advanced Micro Devices is worth owning also because recent reports suggest it will soon resume chip shipments to China, releasing an estimated $500 million (at least) in additional revenue for 2026.\nAMD shares outperformed Nvidia by a significant margin this year – yet, they remain cheaper to own on a price-sales (P/S) basis.\n\nMore importantly, even after a meteoric rally in 2025, the AI stock has its 100-day relative strength index (RSI) set at 54 only, indicating the upward momentum is far from exhaustion.\nAll in all, AMD is an early stage story with much more room for future growth than NVDA, and that alone is a strong enough reason to stay invested.\nWhat’s the Consensus Rating on Advanced Micro Devices? Other Wall Street analysts seem to agree with Mizuho’s bullish view on Advanced Micro Devices.\nAccording to Barchart, the consensus rating on AMD stock remains at “Moderate Buy” with price targets going as high as $380, indicating potential upside of a whopping 75% from here.\nOn the date of publication, Wajeeh Khan did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "03:30:00",
      "Source": "Yahoo Finance Video",
      "Title": "AI chipmakers that could steal some of Nvidia's spotlight in 2026",
      "URL": "https://finance.yahoo.com/video/ai-chipmakers-could-steal-nvidias-193000972.html",
      "Content": "AI chipmakers that could steal some of Nvidia's spotlight in 2026\n\nYahoo Finance Video and Jared Blikre\nMon, December 29, 2025 at 11:30 AM PST\n\nIn this video: NVDA\n\nAMD\n\nAVGO\n\nARM\n\nNvidia ( NVDA ) announced a deal to acquire AI hardware and software designer Groq ( GROQ.PVT ) for $20 billion last week. While the semiconductor manufacturer remained a major AI player in 2025, who could be some of Nvida's biggest competition in the fast-approaching 2026?\nTECHnalysis Research, LLC President Bob O'Donnell sits down with Yahoo Finance markets and data editor Jared Blikre on Market Catalysts to discuss which chipmaker could gain more prominence next year.\nAlso catch Bob O'Donnell's predictions for agentic AI in 2026 as it relates to cybersecurity usage.\nTo watch more expert insights and analysis on the latest market action, check out more Market Catalysts .\n\nVideo Transcript\n\n00:00 Jared\nAnd another thing people have been uh some of the critics have been pouuncing on is all the spending, the capital expenditures, so-called CAPEX. Uh we saw that it's been exploding over the last few years. It's set to continue next year. But uh we've seen in the Mag 5, for instance, we used to kind of talk about them or the Mag 7 uh as a whole. It's really only Alphabet and Nvidia, maybe Tesla as a come behind story that have really surged this year. So is it a game of have and have nots or how do you see this playing out?\n00:32 Bob\nNo, it's a great question. I mean, look, I think Nvidia obviously continues to do well, but I also am certain that Nvidia is going to heck get a heck of a lot more competition in 2026. AMD is, you know, an obvious one, but there's a lot of other little players. I mean, you know, Nvidia's uh deal with Grock recently to bring more of their technology in is a reflection of the fact that we're seeing more specialized types of models being developed. We're we're going from the days of big general purpose LLMs that you can use for everything to much more specialized areas. And each of those are going to require different types of hardware and I think in turn that's going to create additional opportunities, but it's going to create more diversity, which is going to be a little harder to figure out. But obviously I think, you know, you're going to continue to see folks like Nvidia and AMD do well. I do, as I said, I think you're going to start to see uh some of the smaller the cloud guys who are doing custom chips often through Broadcom will also start to benefit. We've seen already, you know, Google's been doing more with TPUs, uh Amazon has their Graviton chips. Um, we've got a a bunch of other companies. Microsoft is doing custom chips. A lot of these are arm-based. So arm is another company, you know, we haven't been talking about them a lot lately, but arm's helping drive some of this innovation. Intel, as you've talked about, you know, is doing well. They continue to plug away. Obviously, they had their challenges last year, but things are looking better in 2026. So, I think we're going to see a lot of different players uh from different areas uh all start to come together. And we'll see some smaller companies. Uh there's a little company called SiTime that does uh timing chips and all these networks have to be completely aligned from a timing perspective. They're doing some interesting stuff. So, I think there's a lot of different opportunities in different areas. Um but we're going to have a lot of the bears on the side just again, waiting to pounce on these oper these concerns that get raised, I think around a gentic AI.\n02:29 Jared\nAnd we'll have to see if those are dips worth buying or not. And Bob, what I'm realizing is we got to do another podcast real soon. So thank you for showing up.\n02:39 Bob\nYeah, man, I'd love to.\n02:40 Jared\nIt was great seeing you here.\n02:41 Bob\nThanks, Jared.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "01:56:17",
      "Source": "GuruFocus.com",
      "Title": "S&P 500 Slips From Record High as Tech Stocks Fall Ahead of Year-End",
      "URL": "https://finance.yahoo.com/news/p-500-slips-record-high-175617005.html",
      "Content": "S&P 500 Slips From Record High as Tech Stocks Fall Ahead of Year-End\n\nNauman Khan\nMon, December 29, 2025 at 9:56 AM PST 1 min read\n\nIn this article: ORCL\n\nNVDA\n\nPLTR\n\nAMD\n\nMETA\n\nThis article first appeared on GuruFocus .\nU.S. stocks fell on Monday as technology shares gave back recent gains, following a strong run in late 2025.\nThe S&P 500 slid 0.5%, while the Nasdaq Composite lost 0.7%. The Dow Jones Industrial Average dropped 277 points, or 0.6%. Nvidia ( NASDAQ:NVDA ) led tech losses, falling nearly 2%, with Palantir Technologies ( NASDAQ:PLTR ) and Meta Platforms (META) also retreating. Oracle (ORCL) and Advanced Micro Devices ( NASDAQ:AMD ) saw declines.\n\nWarning! GuruFocus has detected 5 Warning Signs with AMD.\nList of 52-Week Lows\nList of 3-Year Lows\nList of 5-Year Lows\nIs AMD fairly valued? Test your thesis with our free DCF calculator.\nMarket observers noted that with a light economic calendar, internal momentum may guide the market this week. \"Tech performance will be key to sustaining year-end gains,\" said Chris Larkin, head of trading and investing at E-Trade from Morgan Stanley.\nSilver reversed earlier gains after topping $80 an ounce for the first time, falling more than 7%. The precious metal surged nearly 150% in 2025, making it one of the year's strongest performers.\nMeanwhile, small-cap stocks lagged broader indexes. The Russell 2000 rose around 13% in 2025, underperforming the S&P 500's 17% gain. Analysts also caution political polarization could weigh on equities as 2026 begins.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "01:32:45",
      "Source": "24/7 Wall St.",
      "Title": "Nvidia’s Stock Is Cheaper Than Intel’s and AMD’s. Here’s Where I See It in 2026",
      "URL": "https://finance.yahoo.com/m/af12dfbd-3380-3d94-bd9e-e1d7362611d3/nvidia%E2%80%99s-stock-is-cheaper.html",
      "Content": "Nvidia’s Stock Is Cheaper Than Intel’s and AMD’s. Here’s Where I See It in 2026\n\nOmor Ibne Ehsan\nMon, December 29, 2025 at 9:32 AM PST 5 min read\n\nIn this article: NVDA\n\nINTC\n\nAMD\n\nQuick Read Nvidia trades at 25x forward earnings compared to Intel at 61x and AMD at 33x despite superior margins and growth.\nThe company reports $275B in backlog for 2026 with analysts expecting up to $412.5B in FY 2027 revenue.\nBear case valuation suggests $178 per share in 2026 while bull case projects $373 based on $330B revenue at 55% margins.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "01:23:41",
      "Source": "24/7 Wall St.",
      "Title": "Opinion: AMD Will Be the Semi Play to Beat in 2026",
      "URL": "https://finance.yahoo.com/m/fb6cd04e-652a-39ae-b3f9-5988869584c5/opinion%3A-amd-will-be-the-semi.html",
      "Content": "Business\nOpinion: AMD Will Be the Semi Play to Beat in 2026\n\nJoey Frenette\nMon, December 29, 2025 at 9:23 AM PST 4 min read\n\nIn this article: AMD\n\nNVDA\n\nSMH\n\nQuick Read AMD shares climbed nearly 80% in 2025 before a recent 19% pullback tied to broader AI sentiment.\nAMD’s positioning as a value alternative could benefit if investors push AI spenders toward cost discipline.\nThe VanEck Semiconductor ETF gained close to 50% in 2025 despite elevated volatility.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "01:03:00",
      "Source": "TheStreet",
      "Title": "AMD stock faces its next big test in 2026",
      "URL": "https://finance.yahoo.com/m/88c984ab-ac66-367d-82a9-bdec075b88c7/amd-stock-faces-its-next-big.html",
      "Content": "AMD stock faces its next big test in 2026\n\nMoz Farooque\nMon, December 29, 2025 at 9:03 AM PST 6 min read\n\nIn this article: AMD\n\nNVDA\n\nFor the better part of the last decade, Advanced Micro Devices ( AMD ) lived in Nvidia ’s shadow. In 2025, that changed.\nAMD stock took off handsomely ( up 78% year-to-date ), as Mr. Market stopped calling it “the alternative.”\nThe tech giant landed major AI deals in proving its mettle as more than just a CPU turnaround story.\n\nDespite Nvidia’s dominance in the AI chip space, the narrative has shifted to how much market share AMD can realistically capture.\nThat matters a great deal because breakthrough years, such as 2025, raise expectations much more quickly than earnings can keep pace.\nNevertheless, AMD enters 2026 with solid momentum, real long-term customers, and a fast-growing AI revenue base, but also with a stock price that reflects plenty of that optimism.\nHence, 2026 might not just be a victory lap but a proving ground.\nAMD proved it can compete in AI 2025 was clearly the year when AMD began to land real wins in the AI space.\nThe turning point came in October, when AMD announced marquee AI partnerships with the likes of OpenAI and Oracle, sending its stock up 34% in a single day , according to Reuters .\nRelated: CoreWeave CEO delivers blunt 5-word take on AI debate\n\nOpenAI selected AMD as its go-to GPU supplier , looking to deploy 6 gigawatts of AMD Instinct accelerators for its next-generation AI infrastructure plans.\nOracle followed suit by showing off its first public AI supercluster built around AMD’s new Helios rack design , covering 50,000 MI450 GPUs slated for release in Q3 2026.\nHere are some of AMD's biggest deals in 2025: OpenAI : Multiyear deal to deploy 6 gigawatts of AMD Instinct GPUs; the first 1 gigawatt of MI450 is expected for deployment in the second half of 2026.\nOracle : Expanded partnership; Oracle plans a publicly available AI supercluster with 50,000 MI450 GPUs starting Q3 2026.\nDOE/ORNL : $1 billion partnership with ORNL, HPE , and Oracle Cloud to build Lux and Discovery supercomputers.\nSanmina : Agreement up to $3 billion to buy ZT Systems manufacturing .\nCisco + G42 : UAE secure AI cluster built and secured by Cisco for G42, featuring Instinct MI350X GPUs.\n\nMoreover, CEO Lisa Su outlined a solid path to double-digit AI share , spearheaded by MI300 chips, which are forecasted to generate over $2 billion in sales and memory advantages favoring large AI models.\nThe financial proof behind AMD’s AI push The bull case for AMD is now clearly showing up in the numbers.\nEarnings snapshot over the past four quarters:\nFQ3 2025 (Sept. 2025): EPS 1.20 , beat by 0.03 ; revenue 9.25 billion , up 35.59% year over year , beat by 487.48 million.\nFQ2 2025 (June 2025): EPS 0.48 , in line; revenue 7.69 billion , up 31.71% year over year , beat by 255.65 million.\nFQ1 2025 (March 2025): EPS 0.96 , beat by 0.03 ; revenue 7.44 billion , up 35.90% year over year , beat by 318.31 million.\nFQ4 2024 (Dec. 2024): EPS 1.09 , in line; revenue 7.66 billion , up 24.16% year over year , beat by 132.12 million.\n\nStory Continues\nAMD’s stellar results were capped off by a standout Q3 2025 .\nRevenue hit a record $9.25 billion , up 36% year over year , Investing.com reported , as GAAP net income surged 61% to $1.24 billion .\nAt the same time, margins moved higher, as AMD’s gross margins skyrocketed 52% , up from 50% a year earlier, while its operating income climbed another 75% year over year .\n\nOn top of that, AMD generated record free cash flow , underscoring how growth is translating into cash.\nGrowth was broad-based:\nData Center: Revenue reached $4.3 billion , up 22% year over year , led by stellar demand for EPYC server CPUs and Instinct MI250 and MI300 accelerators (despite the $1.5 billion revenue headwind linked to China).\nClient and Gaming: Combined sales skyrocketed to $4 billion , up 73% year over year . PC sales reached a record $2.8 billion (up 46%), while gaming revenue was up a whopping 181% to $1.3 billion.\nEmbedded: Revenue dropped 8% year over year to $857 million , a modest drag linked to tougher comparisons following the Xilinx acquisition.\nFor perspective, AI-related products accounted for roughly 21% of AMD’s total sales, pushing expected full-year 2025 sales around $33 billion mark .\n\nGuidance shows momentum isn’t slowing In addition to that, AMD guided Q4 2025 sales to be at $9.6 billion (±$300 million), with the midpoint implying a sizeable 25% increase year over year.\nAdditionally, AMD’s management guided for non-GAAP gross margin to be at around 54.5% and operational expenses near $2.8 billion.\nOn the call, CEO Lisa Su said demand looks remarkably durable heading into next year.\n\nWhere AMD stock could trade in 2026 Wall Street is optimistic about AMD heading into 2026.\nThe bulls see substantial upside if execution holds up. On the other hand, skeptics view a stock that’s already pricing in a lot of good news.\nHere’s how the big firms are lining up:\nGoldman Sachs — $210 (Neutral): Goldman is still cautious, warning that AMD’s outlook is linked to flawless execution of its big AI deals and margin expansion, leaving virtually little room for error.\nBank of America — $300 (Buy): BofA expects AMD to effectively capture a double-digit share of a trillion-dollar AI market by 2030.\nHSBC — $310 (Buy): HSBC points to AMD’s incredible OpenAI win and expects a significant ramp-up in earnings growth as those deals scale.\nWells Fargo — $345 (Overweight): Perhaps the Street’s most bullish calls, spearheaded by healthy data-center momentum and AI product traction.\nMelius Research — $380 (Buy): The most aggressive target, which assumes AMD securing 10%+ AI chip share while sustaining its top- and bottom-line growth numbers.\nAcross roughly 51 analysts in the past three months, AMD stock’s consensus 12-month target sits near $282.82 (32% upside from current levels), underscoring superb confidence.\n\nAMD’s 2026 test: big AI upside, bigger expectations Heading into 2026, AMD’s not exactly easing into the hotly competitive AI race.\nAt its late-2025 Analyst Day , the management laid out some remarkably aggressive goals:\nRevenue growth: Targets 35%+ compound annual revenue growth over the next several years.\nData center engine: Expects 60%+ annual growth in data-center sales as the key driver.\nAI kicker: Projects 80%+ annual growth in AI revenue , implying a growing mix shift toward AI.\n\nMoreover, AMD will be rolling out its MI450 AI accelerators and Helios rack-scale systems in the back half of 2026, with early deployments linked to OpenAI and Oracle .\nWhether it can result in repeatable share gains remains a significant question mark.\nThat’s exactly why Bernstein’s Stacy Rasgon framed it as follows, according to Reuters .\nThe risks are real.\nNvidia still commands 80-90% of AI accelerators ; this, along with a misstep in AMD’s ROCm ecosystem, may slow adoption.\nExecution matters too, with delays in MI450 production, customer concentration around OpenAI, or tighter export controls impacting results. Throw in a rich valuation at over 54 times 2026 earnings , and the upcoming year becomes a not-so-simple test.\nRelated: Cathie Wood drops $1.3 million on healthcare stock\nThis story was originally published by TheStreet on Dec 29, 2025, where it first appeared in the Investing section. Add TheStreet as a Preferred Source by clicking here.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "23:55:43",
      "Source": "StockStory",
      "Title": "Why BellRing Brands (BRBR) Shares Are Falling Today",
      "URL": "https://finance.yahoo.com/news/why-bellring-brands-brbr-shares-155543285.html",
      "Content": "Why BellRing Brands (BRBR) Shares Are Falling Today\n\nAnthony Lee\nMon, December 29, 2025 at 7:55 AM PST 2 min read\n\nIn this article: BRBR\n\n^GSPC\n\n^IXIC\n\nNVDA\n\nAMD\n\nWhat Happened? Shares of nutrition products company Bellring Brands (NYSE:BRBR) fell 10.5% in the morning session after analysts highlighted a murky near-term outlook and rising volatility expected for the company.\nThe shifting views prompted a wave of revised forecasts, adding to the uncertainty around BellRing's performance. This cautious stance from Wall Street helped drive the sharp selloff.\n\nContributing to the weakness, major indices pulled back from record highs reached the previous week. The S&P 500 and Nasdaq were under pressure in the morning as the dominant artificial intelligence trade cools off. Market leaders like Nvidia and AMD saw significant losses as traders locked in profits following a banner year where the Nasdaq surged over 21%. With the S&P 500 recently hitting intraday highs near 6,945, this dip reflected a shift in internal momentum rather than a response to major economic news.\nThe stock market overreacts to news, and big price drops can present good opportunties to buy high-quality stocks. Is now the time to buy BellRing Brands? Access our full analysis report here .\nWhat Is The Market Telling Us BellRing Brands’s shares are quite volatile and have had 17 moves greater than 5% over the last year. But moves this big are rare even for BellRing Brands and indicate this news significantly impacted the market’s perception of the business.\nThe previous big move we wrote about was 14 days ago when the stock gained 2.5% on the news that investors flocked to defensive sectors, including consumer staples, amidst the broader tech sell-off.\n\nAs capital fled high-beta AI and tech names (like Broadcom and Oracle) due to margin concerns, investors reallocated into cash-generative, defensive growth stocks. Adding to the momentum, the company's recently authorized $600 million share repurchase program raised market optimism, signaling management's confidence in the stock's value.\nBellRing Brands is down 63.9% since the beginning of the year, and at $26.96 per share, it is trading 66% below its 52-week high of $79.39 from January 2025. Investors who bought $1,000 worth of BellRing Brands’s shares 5 years ago would now be looking at an investment worth $1,143.\nMicrosoft, Alphabet, Coca-Cola, Monster Beverage—all began as under-the-radar growth stories riding a massive trend. We’ve identified the next one: a profitable AI semiconductor play Wall Street is still overlooking. Go here for access to our full report .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "23:01:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Slips as Groq Deal Raises Questions",
      "URL": "https://finance.yahoo.com/m/95a0cad5-3b27-3e4d-87f7-d72c690058be/nvidia-stock-slips-as-groq.html",
      "Content": "Nvidia Stock Slips as Groq Deal Raises Questions\n\nAdam Clark\nMon, December 29, 2025 at 7:01 AM PST 3 min read\n\nIn this article: NVDA\n\nGROQ.PVT\n\nAMD\n\nAVGO\n\nNvidia was dropping early on Monday. Broader jitters about the technology sector looked to be hurting the stock, while Wall Street assessed the reported $20 billion price tag put on Nvidia’s agreement to license technology from artificial intelligence chip start-up Groq. Nvidia shares were down 1.6% at $187.45 in early trading, while the technology-heavy Nasdaq Composite lost 0.4%.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "22:00:04",
      "Source": "Zacks",
      "Title": "Advanced Micro Devices, Inc. (AMD) is Attracting Investor Attention: Here is What You Should Know",
      "URL": "https://finance.yahoo.com/news/advanced-micro-devices-inc-amd-140004060.html",
      "Content": "Advanced Micro Devices, Inc. (AMD) is Attracting Investor Attention: Here is What You Should Know\n\nZacks Equity Research\nMon, December 29, 2025 at 6:00 AM PST 5 min read\n\nIn this article: AMD\n\n^GSPC\n\nAdvanced Micro Devices (AMD) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock.\nShares of this chipmaker have returned -1.2% over the past month versus the Zacks S&P 500 composite's +2.6% change. The Zacks Computer - Integrated Systems industry, to which Advanced Micro belongs, has gained 7.1% over this period. Now the key question is: Where could the stock be headed in the near term?\n\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nEarnings Estimate Revisions Rather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nFor the current quarter, Advanced Micro is expected to post earnings of $1.31 per share, indicating a change of +20.2% from the year-ago quarter. The Zacks Consensus Estimate remained unchanged over the last 30 days.\nFor the current fiscal year, the consensus earnings estimate of $3.96 points to a change of +19.6% from the prior year. Over the last 30 days, this estimate has remained unchanged.\nFor the next fiscal year, the consensus earnings estimate of $6.26 indicates a change of +58% from what Advanced Micro is expected to report a year ago. Over the past month, the estimate has changed +0.1%.\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #3 (Hold) for Advanced Micro.\n\nStory Continues\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS Projected Revenue Growth Even though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\n\nFor Advanced Micro, the consensus sales estimate for the current quarter of $9.64 billion indicates a year-over-year change of +25.9%. For the current and next fiscal years, $33.94 billion and $43.05 billion estimates indicate +31.6% and +26.9% changes, respectively.\nLast Reported Results and Surprise History Advanced Micro reported revenues of $9.25 billion in the last reported quarter, representing a year-over-year change of +35.6%. EPS of $1.2 for the same period compares with $0.92 a year ago.\nCompared to the Zacks Consensus Estimate of $8.72 billion, the reported revenues represent a surprise of +6%. The EPS surprise was +2.56%.\n\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\nValuation Without considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects.\n\nWhile comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\n\nAdvanced Micro is graded F on this front, indicating that it is trading at a premium to its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nBottom Line The facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Advanced Micro. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "21:52:49",
      "Source": "MT Newswires",
      "Title": "Nvidia AI Strategy to be Key Investor Focus at CES Tech Show, Wedbush Says",
      "URL": "https://finance.yahoo.com/news/nvidia-ai-strategy-key-investor-135249599.html",
      "Content": "PREMIUM\nNvidia AI Strategy to be Key Investor Focus at CES Tech Show, Wedbush Says\n\nMT Newswires\nMon, December 29, 2025 at 5:52 AM PST 2 min read\n\nIn this article: NVDA\n\nNvidia (NVDA) Chief Executive Jensen Huang is expected to outline the chipmaker's artificial intelli\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "21:19:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Slips. Why Its Groq Deal Raises Questions.",
      "URL": "https://finance.yahoo.com/m/95a0cad5-3b27-3e4d-87f7-d72c690058be/nvidia-stock-slips.-why-its.html",
      "Content": "Nvidia Stock Slips. Why Its Groq Deal Raises Questions.\n\nAdam Clark\nMon, December 29, 2025 at 5:19 AM PST 2 min read\n\nIn this article: NVDA\n\nGROQ.PVT\n\nAMD\n\nAVGO\n\nNvidia was edging down early on Monday. Broader jitters about the technology sector looked to be hurting the stock, while Wall Street assessed the reported $20 billion price tag put on Nvidia’s agreement to license technology from artificial intelligence chip start-up Groq. Nvidia shares were down 1.1% at $188.49 in premarket trading.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "21:00:09",
      "Source": "Bloomberg",
      "Title": "Nvidia, Lenovo and Samsung to Test Consumer Appetite for AI at CES",
      "URL": "https://finance.yahoo.com/news/nvidia-lenovo-samsung-test-consumer-130009757.html",
      "Content": "Nvidia, Lenovo and Samsung to Test Consumer Appetite for AI at CES\n\nSamantha Kelly and Chris Welch\nMon, December 29, 2025 at 5:00 AM PST 5 min read\n\nIn this article: NVDA\n\nLNVGF\n\nSSNLF\n\nAMD\n\n(Bloomberg) -- At CES, the annual consumer technology conference happening in Las Vegas next week, the biggest names in tech, including Nvidia Corp., Advanced Micro Devices Inc., Samsung Electronics Co. and Lenovo Group Ltd., will make the case for artificial intelligence. Their target audience those few days: investors, corporate clients and — perhaps just as importantly — ordinary shoppers who have yet to be fully sold on the idea of AI-infused gadgets.\n\nCES, which runs from Jan. 6-9, is where many tech companies unveil their wares for the year. That includes a mix of products that are imminently available for purchase, and concept devices that may or may not go to market — and could be half-baked if they do. While Nvidia Chief Executive Officer Jensen Huang is likely to be the most charismatic showman in Vegas hyping AI’s underlying technologies, he’ll be surrounded by a slew of players that are testing consumers’ appetite for gadgets where AI isn’t just a nice-to-have feature, but the main selling point.\nMost Read from Bloomberg\nLondon’s Love of Wood-Burning Stoves Sparks a Pollution Debate\nThe show floor this year will be particularly populated with AI-powered hardware, including the sort of smart glasses popularized by Meta Platforms Inc. and that Snap Inc. and Apple Inc. are planning to launch by the end of 2026. While Meta and Snap will both have a presence at CES, the bulk of the news in this space is likely to come from smaller brands, such as Xreal Inc., Vuzix Corp., Halliday Global Ltd., Rokid and Even Realities.\n\nMeta isn’t expected to unveil new hardware at this time, having recently debuted its first smart glasses with a built-in screen. It is possible, however, that the social media giant is ready to show off some new or improved software features. It’s a similar story for Snap, which isn’t likely to choose this venue to announce pricing and availability for its forthcoming “Specs” glasses. The Specs will be on display for attendees who haven’t had a chance to see them in person, which has so far mostly included select media outlets.\nIn addition to eyewear, such as glasses and goggles, some of these gadgets will take the form of a ring or something else entirely — underscoring that startups and Big Tech alike remain bullish on AI-first hardware that lets people tap into intelligent assistants without necessarily taking out their smartphone. Previous offerings, including the Humane AI Pin and the Rabbit R1, were commercial failures after being panned by tech reviewers.\n\nStory Continues\nRobots Everywhere\nMany companies will also be testing consumers' readiness to accept AI-powered humanoid robots. There will be so many players, in fact, that the Consumer Technology Association, or CTA, which organizes CES, has set aside an entire hall of the convention space for robotics. While some of these robots are intended for the home, many of the models on display will be designed for enterprise uses such as manufacturing, logistics and food service. Firms such as Artly Coffee and VenHub Global will show off technology for AI-powered robotic cafés and convenience stores.\nCompanion robots will be a common sight as well, including products like the Jennie robot dog from Tombot Inc., a California-based startup focused on developing products for aging adults and people living with dementia.\nIf 2026 is similar to previous shows, there’s likely to be a sizeable gap between what many of these human-inspired bots are capable of in controlled demos versus what their makers promise they’ll eventually be able to do.\nStill, there are signs of progress. Many humanoid makers this year are shifting from single-task demonstrations to more complex, multi-step tricks, such as both sorting and folding laundry. Larger players, including LG, are expected to tease their own humanoid concepts, but the companies will need to convince attendees that these machines are commercially viable amid ongoing challenges around battery life, mobility, cost and safety.\n\nEverything Else\nAbove all other categories, televisions have traditionally been the centerpiece of CES, with Samsung, LG, and ascendant Chinese competitors TCL and Hisense showing off their brightest, biggest sets for the new year. Sony Group Corp., once a cornerstone of the convention show floor, has moved its TV product announcements to spring in recent years and pared back its booth as a result.\nIn 2026, with high-end TVs now delivering more than enough brightness and resolution for most consumers, manufacturers are likely to focus on wider color reproduction and other improvements that result in a more vivid, lifelike picture. Aesthetically pleasing models like Samsung’s The Frame line have inspired a wave of clones from other TV makers, a trend that’s likely to continue in Vegas.\nCES typically isn’t a venue for major smartphone news, but Motorola could be an exception this year. Its parent company, Lenovo, is headlining one of the show’s evening keynotes for the first time, and Motorola mailed a teaser package to media that strongly hints at a book-style foldable. Such a device would be its first of that form factor after years of releasing Razr-branded folding handsets.\n\nMeanwhile, wearables will continue to evolve beyond basic fitness tracking, blurring the lines with medical-grade devices. The show will feature products such as a smart night guard that not only protects against teeth grinding but also claims to monitor sleep apnea events, heart rate, respiration and sleep cycles. Wearables in general are expected to offer a greater focus on women’s health, continuous glucose monitoring, advanced cardiovascular tracking, longevity and chronic-condition management.\nMost Read from Bloomberg Businessweek\nErasing the Verdict: The Ongoing Shock of Trump’s Cocaine Kingpin Pardon\nJapan’s Viral Horse-Racing Video Game Has Players Flocking to Real-Life Stables\nChina’s EV Battery Giant Is Trying to Find a New Road\nThat Time I Tried to Buy OpenAI\nThe United States of Klarna\n©2025 Bloomberg L.P.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "19:50:00",
      "Source": "Motley Fool",
      "Title": "Will AMD Be a Must-Own AI Stock in 2026?",
      "URL": "https://finance.yahoo.com/m/0d2e016c-9e7e-367d-bec4-4d60d8972d5f/will-amd-be-a-must-own-ai.html",
      "Content": "Will AMD Be a Must-Own AI Stock in 2026?\n\nKeithen Drury, The Motley Fool\nMon, December 29, 2025 at 3:50 AM PST 4 min read\n\nIn this article: AMD\n\nNVDA\n\nKey Points AMD is starting to make a comeback in the AI revolution.\nAMD's management believes it can deliver 60% data center growth through 2030.\nThe stock has a premium price tag over its chief rival.\n10 stocks we like better than Advanced Micro Devices ›\nAMD (NASDAQ: AMD) has spent most of the artificial intelligence (AI) buildout in second place to Nvidia (NASDAQ: NVDA) . This has caused AMD's stock to dramatically underperform Nvidia since 2023, with AMD rising aboiut 230% while Nvidia is up around 1,160%. However, AMD flipped the script in 2025, as it outperformed Nvidia stock significantly. AMD is up nearly 80% while Nvidia rose around 35%.\nThat's strong performance from both stocks, but AMD's 2025 comeback made it a must-own stock this year. The question is, will AMD be a must-own stock in 2026? Let's find out.\nAMD's comeback is real Nvidia was, and still is, the preferred graphics processing unit (GPU) vendor for the AI hyperscalers. Its GPUs and technology stack truly lead the industry, with AMD serving as a viable alternative. However, AMD has started to close the gap, particularly with controlling software.\nNvidia's CUDA software was one of the major differentiators between the two offerings, as AMD's wasn't nearly as good. However, thanks to various acquisitions and partnerships, AMD's ROCm software has dramatically improved. In fact, AMD reported that downloads for ROCm software increased 10 times year over year as of November 2025. This shows AMD is gaining ground, and there's another important consideration as well.\n\nDuring Nvidia's Q3 FY 2026 results, its CEO, Jensen Huang, noted that the company was \"sold out\" of cloud GPUs. This is a huge deal, as its cloud clients aren't going to sit around idle while Nvidia fulfills demand. Instead, they're going to go looking for alternative computing providers, and AMD is near the top of the list. This could allow AMD to build a strong position in the computing hardware industry. If AI clients find out that AMD's hardware offers similar performance at a much lower price point, you could see more clients begin to use AMD's hardware stack instead of Nvidia's. This would be a huge shift for AMD, making it one of the best AI stocks to own in 2026 and beyond.\nAMD's internal projections reflect this, as management believes the data center division can achieve a 60% compounded annual growth rate (CAGR) through 2030. In Q3, its data center growth rate was a mere 22%. This is a lofty goal AMD set for itself, but if it can achieve it, AMD will become a top artificial intelligence stock to own for the next few years.\n\nStory Continues\nCompanywide, AMD expects its CAGR to come in around 35%, because its consumer hardware and embedded processor divisions are only expected to grow at around a 10% CAGR over the next five years. Still, a 35% growth rate is nothing to be disappointed with, and if AMD's growth starts to accelerate in 2026, the stock could go on an incredible run. But there's one factor holding it back.\n\nSome of AMD's comeback is already priced in The market is well aware of the situation laid out above, which is why AMD's stock has done so well in 2025. Part of that success is already priced into its stock, as it trades for a significant premium over rival Nvidia when next year's earnings are used as the forward earnings valuation metric.\nInvestors must pay nearly 50% more to own AMD's stock versus Nvidia's. That's a hefty premium to place on a company that hasn't started its comeback yet; it's only talked about it. That's concerning to me, as I want to see some progress before I'm willing to say that AMD is the better stock to own for 2026. However, I still think that AMD will be successful, but just maybe not as successful as Nvidia will be in 2026.\n\nShould you invest $1,000 in Advanced Micro Devices right now? Before you buy stock in Advanced Micro Devices, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Advanced Micro Devices wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nKeithen Drury has positions in Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices and Nvidia. The Motley Fool has a disclosure policy .\nWill AMD Be a Must-Own AI Stock in 2026? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "19:38:00",
      "Source": "Zacks",
      "Title": "The Zacks Analyst Blog Highlights Advanced Micro Devices, Goldman Sachs, Lam Research, AstroNova and Blue Dolphin",
      "URL": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-advanced-113800201.html",
      "Content": "The Zacks Analyst Blog Highlights Advanced Micro Devices, Goldman Sachs, Lam Research, AstroNova and Blue Dolphin\n\nZacks Equity Research\nMon, December 29, 2025 at 3:38 AM PST 6 min read\n\nIn this article: AMD\n\nGS\n\nLRCX\n\nALOT\n\nBDCO\n\nFor Immediate Release Chicago, IL &ndash; December 29, 2025 &ndash; Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Advanced Micro Devices, Inc. AMD, The Goldman Sachs Group, Inc. GS, Lam Research Corp. LRCX, AstroNova, Inc. ALOT and Blue Dolphin Energy Co. BDCO.\n\nHere are highlights from Friday&rsquo;s Analyst Blog:\nTop Analyst Reports for AMD, Goldman Sachs and Lam Research\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Advanced Micro Devices, Inc., The Goldman Sachs Group, Inc. and Lam Research Corp., as well as two micro-cap stocks, AstroNova, Inc. and Blue Dolphin Energy Co. These research reports have been hand-picked from roughly 70 reports published by our analyst team today.\n\nYou can see all of today&rsquo;s research reports here >>>\nAhead of Wall Street\nThe daily 'Ahead of Wall Street' article is a must-read for all investors who would like to be ready for that day's trading action. The article comes out before the market opens, attempting to make sense of that morning's economic releases and how they will affect that day's market action. You can read this article for free on our home page and can actually sign up there to get an email notification as this article comes out each morning.\n\nYou can read today's AWS here >>> Full-Day in the Markets on a Recently Declared Federal Holiday\nToday's Featured Research Reports\nAdvanced Micro Devices&rsquo; shares have outperformed the Zacks Computer &ndash; Integrated Systems industry over the last six months (+49.5% vs. +47.0%). The Zacks analyst believes AMD is benefiting from rising demand for EPYC processors as cloud, enterprise and AI-driven workloads expand. Growing adoption by major hyperscalers, increased use of Instinct accelerators and the launch of the MI350 series have strengthened AMD&rsquo;s system-level capabilities, supported by a broad ecosystem of cloud and AI partners.\nHowever, the company faces intense competition from NVIDIA in AI accelerators and from Intel in CPUs, whose entrenched ecosystems and strong market positions continue to pressure its growth prospects.\n\n(You can read the full research report on Advanced Micro Devices here >>>)\nGoldman Sachs&rsquo; shares have outperformed the Zacks Financial &ndash; Investment Bank industry over the past year (+58.1% vs. +39.2%). The Zacks analyst believes that the company has shown solid momentum, supported by strong execution in investment banking and trading. The firm is refocusing on its core businesses, scaling back consumer banking, and expanding through strategic acquisitions in private equity credit and global alternatives, which should strengthen its global presence and revenue mix.\n\nStory Continues\nYet heavy reliance on overseas markets raises concerns amid geopolitical uncertainty. Rising expenses from ongoing technology investments and higher transaction-related costs during periods of strong client activity also remain key challenges.\n(You can read the full research report on Goldman Sachs here >>>)\n\nLam Research&rsquo; s shares have outperformed the Zacks Electronics &ndash; Semiconductors industry over the past six months (+82.5% vs. +25.3%). The Zacks analyst believes that the company is benefiting from its strength in 3D DRAM and advanced packaging, with rising etch and deposition intensity driven by more complex 3D architectures. Improving memory spending, solid demand for high-bandwidth memory and continued investments in research and development position the company well to capitalize on higher wafer fab equipment demand.\nHowever, spending on mature semiconductor nodes is likely to remain weak in the near term. Ongoing trade and tariff tensions between the United States and China also remain a key risk to its outlook.\n(You can read the full research report on Lam Research here >>>)\n\nAstroNova&rsquo; s shares have underperformed the Zacks Technology Services industry over the past year (-34.2% vs. +22.0%). The Zacks analyst believes that execution challenges persist for the company, including margin pressure from inventory buildup, volatility in the Product ID segment, sluggish Aerospace OEM demand and weak cash conversion, despite the stock trading well below peer valuations.\nYet AstroNova is repositioning for margin expansion by shifting toward higher-margin ToughWriter 640 printers, supported by cost reductions, lower debt and proprietary printhead technology that enables vertical integration and recurring revenue.\n(You can read the full research report on AstroNova here >>>)\nBlue Dolphin Energy&rsquo; s shares have underperformed the Zacks Oil and Gas &ndash; Exploration and Production &ndash; United States industry over the last six months (-24.0% vs. -12.5%). The Zacks analyst believes severe liquidity stress, weakening profitability, refinancing risk and governance concerns tied to affiliate dependence weigh heavily on the company. Exposure to demand softness, crude price volatility, inventory risks and limited capital access further threaten its long-term viability.\n\nHowever, the company continues to operate its refining business with support from affiliated entities, which has helped sustain operations in a difficult industry environment.\n(You can read the full research report on Blue Dolphin here >>>)\nFree: Instant Access to Zacks' Market-Crushing Strategies\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\nToday you can tap into those powerful strategies &ndash; and the high-potential stocks they uncover &ndash; free. No strings attached.\nGet all the details here >>\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss . This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nThe Goldman Sachs Group, Inc. (GS) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nLam Research Corporation (LRCX) : Free Stock Analysis Report\nAstroNova, Inc. (ALOT) : Free Stock Analysis Report\nBlue Dolphin Energy Co. (BDCO): Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "19:37:05",
      "Source": "Simply Wall St.",
      "Title": "AI Chips Today - Synopsys Faces Challenges Amid Market Turbulence And Legal Issues",
      "URL": "https://finance.yahoo.com/news/ai-chips-today-synopsys-faces-113705960.html",
      "Content": "AI Chips Today - Synopsys Faces Challenges Amid Market Turbulence And Legal Issues\n\nSimply Wall St\nMon, December 29, 2025 at 3:37 AM PST 1 min read\n\nIn this article: SNPS\n\nNVDA\n\nAMD\n\nMU\n\nRecent developments in the AI chips sector spotlight Synopsys, Inc., a provider of design automation software for integrated circuits, which has been impacted by significant financial turbulence. Synopsys disclosed a downturn in its Design IP segment, which experienced a 7.7% revenue decline and a substantial 43% drop in net income year-over-year, largely due to increased customization demands from clients. This underperformance has led to a class action lawsuit alleging securities fraud against Synopsys, underscoring the challenges the company faces in adapting its business model to evolving market demands within the AI chips industry.\n\nIn other market news, Kioxia Holdings was a notable mover up 5.7% and ending the day at ¥11,415. At the same time, Credo Technology Group Holding lagged, down 3.6% to close at $144.83.\nProjected 33.8% annual revenue growth hinges on sustaining profit margins amid competition. Explore the detailed narrative on Credo Technology Group Holding's potential and challenges.\nFor a deep exploration of the implications of AI companies flooding the bond market and its impact on the tech sector, revisit our Market Insights article titled \"AI Companies Hit The Bond Market\" before opportunities narrow.\nBest AI Chip Stocks NVIDIA finished trading at $190.53 up 1%.\nAdvanced Micro Devices finished flat at, $214.99.\nMicron Technology closed at $284.79 down 0.7%, near its 52-week high.\nWhere To Now? Reveal the 83 hidden gems, such as Moore Threads Technology , MACOM Technology Solutions Holdings and ASM International , among our AI Chip Stocks screener with a single click here.\nContemplating Other Strategies? The best AI stocks today may lie beyond giants like Nvidia and Microsoft. Find the next big opportunity with these 24 smaller AI-focused companies with strong growth potential through early-stage innovation in machine learning, automation, and data intelligence that could fund your retirement.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nSources:\nSimply Wall St\n\"SNPS STOCK NOTICE: Synopsys, Inc. IP Underperformance Leads to Securities Class Action – Contact BFA Law before Tuesday’s December 30 Legal Deadline\" from Bleichmar Fonti & Auld on GlobeNewswire (published 27 December 2025)\n\nStory Continues\nCompanies discussed in this article include TSE:285A NasdaqGS:NVDA NasdaqGS:AMD NasdaqGS:MU and NasdaqGS:CRDO .\nThis article was originally published by Simply Wall St .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "18:30:00",
      "Source": "Barrons.com",
      "Title": "Cathie Wood’s ARK Funds Have Crushed the Market This Year. What She’s Betting On for 2026.",
      "URL": "https://finance.yahoo.com/m/45ada057-0d95-3e92-9afc-b859282038f2/cathie-wood%E2%80%99s-ark-funds-have.html",
      "Content": "Cathie Wood’s ARK Funds Have Crushed the Market This Year. What She’s Betting On for 2026.\n\nCallum Keown\nMon, December 29, 2025 at 2:30 AM PST 2 min read\n\nIn this article: TSLA\n\nROKU\n\nAMD\n\nSHOP\n\nHOOD\n\nCathie Wood’s ARK funds are on track to beat the market in 2025. She's already looking ahead to next year.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "00:36:00",
      "Source": "Motley Fool",
      "Title": "What Is the Best Artificial Intelligence (AI) Stock to Hold for the Next 10 Years?",
      "URL": "https://finance.yahoo.com/m/92e033bd-467e-3790-a963-523cff98bcb6/what-is-the-best-artificial.html",
      "Content": "What Is the Best Artificial Intelligence (AI) Stock to Hold for the Next 10 Years?\n\nAdam Spatacco, The Motley Fool\nSun, December 28, 2025 at 8:36 AM PST 5 min read\n\nIn this article: TSM\n\nNVDA\n\nAMD\n\nAVGO\n\nMU\n\nKey Points Chip designers such as Nvidia, Advanced Micro Devices, and Broadcom serve as the backbone of generative AI development.\nWhile chip designers steal the spotlight, Taiwan Semiconductor Manufacturing is playing a hugely important supporting role in the background.\nAs demand for AI chips and data centers accelerates, Taiwan Semi is poised for explosive long-term growth.\n10 stocks we like better than Taiwan Semiconductor Manufacturing ›\n\nFor the last three years, investing in semiconductor stocks has proven to be a profitable decision given the critical role chips play in the development of generative artificial intelligence (AI). Companies such as Nvidia , Advanced Micro Devices , Broadcom , and Micron Technology have been some of the biggest contributors to the semiconductor industry throughout the artificial intelligence (AI) revolution.\nFlying under the radar is another chip company whose storyline seems muted compared to its peers. That's Taiwan Semiconductor Manufacturing (NYSE: TSM) , the pick-and-shovel specialist of the chip realm.\nLet's dive into Taiwan Semi's increasingly important role for the future of AI and assess why the stock looks like a no-brainer buying opportunity for investors with a long-term horizon.\nHow does Taiwan Semiconductor benefit from AI? Throughout the AI revolution, hyperscalers such as Microsoft , Alphabet , Amazon , Meta Platforms , and OpenAI have collectively poured hundreds of billions of dollars into AI-related capital expenditures (capex) -- namely, chips and networking gear for data centers.\nOn the surface, this is great news for the likes of Nvidia, AMD, and Broadcom. But underneath the surface, it's even better news for Taiwan Semi. Why is that?\n\nTSMC is the largest chip manufacturer in the world in terms of revenue. While Nvidia, AMD, and Broadcom design the most-in demand GPUs and custom application-specific integrated circuits (ASICs) on the planet, each of these giants relies heavily on Taiwan Semi's cutting-edge fabrication processes.\nIn other words, if Nvidia and its competitors represent the body of the car moving the AI narrative forward, TSMC holds the keys to the ignition.\nTSMC's growth is off the charts Over the last year, Taiwan Semi's revenue has been growing strongly thanks to ongoing demand for AI accelerators. What's interesting to point out is that the company's revenue trajectory is actually steepening. This is largely driven by rising demand for Nvidia's and AMD's next-generation Rubin and MI400 Series chips, as well as increasing investment in custom hardware from cloud infrastructure providers.\n\nStory Continues\nThe more subtle aspect from the financial picture above is Taiwan Semi's expanding profitability profile. Given its near-70% market share, TSMC is able to command enormous pricing power relative to competitors like Intel or Samsung .\nAgainst this backdrop, Taiwan Semi's gross margin is widening -- with excess cash flowing straight to the bottom line. The company is making the most of this new wave of capital by expanding its geographic footprint -- building additional foundries in Arizona, Germany, and Japan.\n\nIs Taiwan Semi stock a good buy right now? At the moment, TSMC boasts a forward price-to-earnings (P/E) multiple of 28.4 -- hovering near its highest level during the AI revolution. If you were to base your investment decision purely off of this metric, you may think Taiwan Semi is overvalued.\nSmart investors understand that TSMC's premium valuation could be warranted, though. McKinsey & Company is forecasting AI infrastructure to be a $7 trillion market through 2030 -- with the majority of spend allocated toward refining AI workloads.\nIn essence, building out AI-equipped data centers is expected to accelerate throughout the rest of the decade as training and inferencing models becomes more sophisticated and demanding. This is great news for TSMC as it paves the way for long-run visibility across the business.\n\nThe AI infrastructure chapter is still in its early innings. Over the course of the next several years, Taiwan Semi is positioned to benefit from the secular tailwind of rising investment in infrastructure both domestically and abroad.\nTaking this one step further, physical applications such as autonomous systems and robotics are yet to be deployed in a commercial sense. Looking beyond into the 2030s, these use cases are expected to drive additional trillions in economic value.\nShould they achieve some form of adoption and set the stage for the next wave of AI, Taiwan Semi has the potential to benefit immensely beyond where AI stands today -- building large language models (LLMs) and other software-based applications.\nWhen you consider the bigger picture and begin to think longer-term, TSMC's growth potential relative to its valuation looks compelling. So while the stock may not appear dirt cheap at first glance, I think there is ample room for meaningful valuation expansion over the course of the next decade -- making the stock a no-brainer buy right now in my eyes.\n\nShould you invest $1,000 in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nAdam Spatacco has positions in Alphabet, Amazon, Meta Platforms, Microsoft, and Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Intel, Meta Platforms, Microsoft, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nWhat Is the Best Artificial Intelligence (AI) Stock to Hold for the Next 10 Years? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-28",
      "Time": "23:58:56",
      "Source": "Insider Monkey",
      "Title": "Advanced Micro Devices (AMD) up More Than 76% YTD, Is it Still a Buy?",
      "URL": "https://finance.yahoo.com/news/advanced-micro-devices-amd-more-155856137.html",
      "Content": "Advanced Micro Devices (AMD) up More Than 76% YTD, Is it Still a Buy?\n\nTalha Qureshi\nSun, December 28, 2025 at 7:58 AM PST 2 min read\n\nIn this article: AMD\n\nNVDA\n\nINTC\n\n​Advanced Micro Devices, Inc. (NASDAQ: AMD ) is one of the Best Quality Stocks to Buy Before 2026 . Advanced Micro Devices, Inc. (NASDAQ:AMD) has risen more than 76.9% year-to-date. The share price moved further up on December 17, after South China Morning Post reported the company’s chair and CEO, Lisa SU met with the Chinese minister of industry and information technology.\nAccording to the report, Lisa Su affirmed the commitment to deepen its investment in China. The chief executive also noted that China will offer greater corporate opportunities for foreign enterprises, including Advanced Micro Devices.\n​This report comes as President Trump released a statement suggesting eased export control on Nvidia’s H200 chips and also indicated potential relaxation for Intel and Advanced Micro Devices. This is an important update for the company as during fiscal 2024, China and Hong Kong combined generated roughly $6.2 billion in revenue for the company, thereby making it the second largest market for AMD.\n\n​That said, Wall Street also maintains a positive outlook on the stock. On December 19, Vijay Rakesh from Mizuho Securities reiterated a Buy rating on the stock but slightly lowered the price target from $279 to $277. On the same day, William Stein from Truist Financial also reiterated a Buy rating on the stock with a $201.06 price target.\n​Advanced Micro Devices, Inc. (NASDAQ:AMD) is a global semiconductor company that manufactures GPUs, microprocessors, and high-performance computing solutions and serves a number of high-growth industries like gaming, data centers, and AI.​\nWhile we acknowledge the potential of AMD as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-28",
      "Time": "07:30:00",
      "Source": "Motley Fool",
      "Title": "Prediction: AMD Stock Will Jump 60% in 2026, Thanks to President Donald Trump",
      "URL": "https://finance.yahoo.com/m/815df209-08d0-3554-9dfd-ea97a351a4ad/prediction%3A-amd-stock-will.html",
      "Content": "Prediction: AMD Stock Will Jump 60% in 2026, Thanks to President Donald Trump\n\nHarsh Chauhan, The Motley Fool\nSat, December 27, 2025 at 3:30 PM PST 5 min read\n\nIn this article: AMD\n\nNVDA\n\nINTC\n\nKey Points AMD was getting a nice chunk of its revenue from the Chinese market before the U.S. government's export controls took effect in April 2025.\nAMD will soon be allowed to sell advanced AI chips to Chinese customers, which should benefit AMD's business in 2026.\nThis could help AMD exceed Wall Street's growth expectations next year, which could send the stock soaring.\n10 stocks we like better than Advanced Micro Devices ›\n\nAdvanced Micro Devices (NASDAQ: AMD) stock clocked stellar gains in 2025, rising 78% this year as of this writing. However, recent trading suggests that some investors are booking profits. AMD stock is down 19% since hitting a 52-week high on Oct. 29.\nThis pullback could be a buying opportunity for investors looking to add a fast-growing company that's benefiting from the adoption of artificial intelligence (AI) . Additionally, a recent announcement by President Donald Trump, which will allow companies like Nvidia (NASDAQ: NVDA) , AMD, and Intel to sell their advanced AI chips to Chinese customers, is going to give AMD an additional boost in 2026.\nLet's take a closer look at AMD's catalysts for the new year and see why this stock has the potential to soar once again.\nThe Trump administration's announcement could give AMD a big shot in the arm AMD's business grew at a nice clip in 2025. It is on track to deliver $34 billion in revenue for the year, up 31% over 2024 revenue. It might have been even better, but AMD hasn't been able to sell its chips into the Chinese market since April, when the Trump administration imposed export controls on sales of advanced AI data center chips to that country.\n\nAs a result, AMD incurred an $800 million inventory charge in the second quarter. Moreover, the company lost a significant chunk of its revenue stream thanks to the Trump administration's move. That's because China accounted for nearly a quarter of AMD's 2024 revenue of $25.8 billion, or almost $6.2 billion.\nDespite the headwind, analysts expect a 20% increase in the company's earnings for 2025 to $3.97 per share. Consensus estimates suggest that AMD's earnings could jump 62% next year to $6.46 per share. I think it could end up doing much better than that.\nTake Nvidia, for example. The Trump administration now allows Nvidia to sell its advanced H200 chips to Chinese customers. Nvidia was previously only selling its downsized H20 chips in China to comply with export regulations. Those chips were significantly cheaper and less powerful than Nvidia's flagship Hopper processor, the H200.\n\nStory Continues\nWith the change, Nvidia will likely see a significant bump in its revenue next year, even after paying the 25% tax that the administration plans to charge on sales to China. President Trump pointed out in his Truth Social post that the \"same approach will apply to AMD,\" suggesting that the company may be able to sell its high-end chips to Chinese customers.\n\nIt was earlier selling the downgraded MI308 processor to Chinese customers. It may now be able to ship its more powerful chips into that market, just like Nvidia has been allowed to. So, there is a possibility of AMD regaining the lost Chinese revenue in 2026, even with the 25% export fee.\nThat's because a full-fledged AMD data center graphics processing unit (GPU) will carry a significant premium over the nerfed MI308. This is why AMD's sales next year could turn out to be much higher than expected.\nThe stock could skyrocket in 2026 Analysts anticipate AMD's revenue to jump by 31% in 2026 to $44.6 billion. Assuming its revenue from China next year lands at 2024 levels of $6.2 billion, its top line could be somewhere around $51 billion. What's worth noting is that analysts haven't adjusted their 2026 revenue expectations for AMD following the Trump administration's rule change, suggesting that the company's potential gains from China aren't baked in just yet.\nAssuming AMD does achieve $51 billion in revenue next year and maintains its price-to-sales ratio of 11 at that time, its market cap could jump to $561 billion. That points toward a potential jump of 60% from its current market cap. So, now it would be a good time to buy this semiconductor stock following its recent pullback, as it has the potential to soar impressively in the new year.\n\nShould you invest $1,000 in Advanced Micro Devices right now? Before you buy stock in Advanced Micro Devices, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Advanced Micro Devices wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nHarsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Intel, and Nvidia. The Motley Fool has a disclosure policy .\nPrediction: AMD Stock Will Jump 60% in 2026, Thanks to President Donald Trump was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "20:50:00",
      "Source": "Motley Fool",
      "Title": "Prediction: This Artificial Intelligence (AI) Stock Could 5X by 2030",
      "URL": "https://finance.yahoo.com/m/026c927d-39d1-34aa-87ab-758c28d5d7c3/prediction%3A-this-artificial.html",
      "Content": "Prediction: This Artificial Intelligence (AI) Stock Could 5X by 2030\n\nKeithen Drury, The Motley Fool\nSat, December 27, 2025 at 4:50 AM PST 5 min read\n\nIn this article: AMD\n\nNVDA\n\nKey Points AMD's technology stack is improving.\nAMD's margins could expand to deliver outsized profit growth.\n10 stocks we like better than Advanced Micro Devices ›\nFinding stocks that can increase in value 5 times within five years is a lofty goal. That requires serious stock performance, and few companies can deliver that. To achieve 5 times returns in five years, a company must grow at a 38% compounded annual growth rate (CAGR) . A 38% CAGR isn't an easy return to achieve, and it requires a massive market opportunity.\n\nWhat's a bigger opportunity than artificial intelligence (AI) ? There are several names in this industry, including AMD (NASDAQ: AMD) . AMD has outperformed rival Nvidia in 2025, rising around 80% versus Nvidia's 35%. Furthermore, AMD gave an incredible growth projection set to come about over the next five years, so it's the perfect candidate to see if it could return 5 times in five years. Management's numbers line up with the 38% CAGR laid out above, giving AMD a real shot at delivering this incredible return.\nAMD's management is bullish on its five-year outlook Frankly, AMD has not done well in the AI revolution. Its hardware isn't as good as Nvidia's, and its software was well behind. However, AMD has made various acquisitions and partnerships to improve its controlling software, ROCm. It noted that downloads for ROCm were up 10 times year over year as of November 2025, so there is a possibility that AMD could start gaining some ground on Nvidia once AI clients realize that AMD's technology stack could compete with Nvidia's.\n\nNvidia has controlled the data center computing market with an iron fist, and this dominance shows up in each company's results. In Q3 2025, AMD's data center revenue rose 22% year over year to $4.3 billion. During Nvidia's Q3 FY 2026 (ending Oct. 26, 2025), its data center revenue totaled $51.2 billion, up 66% year over year. AMD is clearly getting smoked here, but the tides could be changing.\nIn Nvidia's release, they noted that they are \"sold out\" of cloud GPUs. This could be a concern for Nvidia, as clients will now likely search for alternative computing providers to fulfill their massive computing power needs. AMD could emerge as a top option to provide this power, and once they realize how far AMD's technology has come, they could become greater clients of AMD's because of its lower price point. That could increase AMD's business in the future, and so could a return to selling in the Chinese market.\n\nStory continues\nCurrently, neither AMD nor Nvidia is allowed to sell in China. However, they recently made a deal with the U.S. government to give up 15% of revenue for the right to export these GPUs to China. These GPUs aren't the cutting-edge ones used in the U.S. and are specifically downgraded to meet export restrictions. But if this sales channel returns, it could be a huge boost to AMD over the long run.\n\nWhile these are positive catalysts, are they enough to provide the 38% CAGR necessary to return 5 times in five years?\nAMD's guidance is slightly lower than a 38% CAGR Over the next five years, AMD believes it can deliver a 60% CAGR in its data center division. That clears the 38% threshold by a wide margin, but that's not the only part of AMD's business. AMD also has a consumer hardware and embedded processor division, and each of those is expected to grow at a 10% CAGR over the next five years. That brings AMD's total CAGR to 35%, slightly less than the 38% needed.\nHowever, revenue growth isn't the only thing the market looks at. If AMD can achieve outsized profit growth as well, it may be able to surpass the 38% CAGR in profit growth. After all, AMD's margins are far slimmer than Nvidia's.\nIf AMD can improve its profit margin to the 15% to 20% range, that will double the profits it generates from its revenue, providing another growth lever. If AMD can improve its margins and grow at the expected growth rate, I do not doubt that the stock could return 5 times in five years. If it does this, AMD will be a top stock to buy and hold.\n\nShould you buy stock in Advanced Micro Devices right now? Before you buy stock in Advanced Micro Devices, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Advanced Micro Devices wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $504,994 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,156,218 !*\nNow, it’s worth noting Stock Advisor’s total average return is 986 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nKeithen Drury has positions in Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices and Nvidia. The Motley Fool has a disclosure policy .\nPrediction: This Artificial Intelligence (AI) Stock Could 5X by 2030 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "15:44:40",
      "Source": "Insider Monkey",
      "Title": "Analysts Maintain Positive Outlook on AMD With China Demand as a Catalyst",
      "URL": "https://finance.yahoo.com/news/analysts-maintain-positive-outlook-amd-074440489.html",
      "Content": "Analysts Maintain Positive Outlook on AMD With China Demand as a Catalyst\n\nGhazal Ahmed\nFri, December 26, 2025 at 11:44 PM PST 1 min read\n\nIn this article: AMD\n\nNVDA\n\nAdvanced Micro Devices, Inc. (NASDAQ: AMD ) is one of the AI Stocks Investors Are Watching. On December 23, Raymond James reiterated the stock as “Outperform,” noting that it has upside following reports that Nvidia plans to resume chip shipments to China. The firm believes that Nvidia and AMD could both see moderate upside from US export approvals.\nUS President Donald Trump has recently approved the sale of Nvidia's H200 GPUs to China, albeit only to “approved customers.”\nAnalysts on Wall Street currently have a consensus “Buy” rating on the stock. The average price target of $289.00 implies a 34.87% upside; however, the Street-high target of $380 implies an upside of 77.34%.\nWhile we acknowledge the potential of AMD as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 10 Trending AI Stocks on Wall Street and 10 AI Stocks on Market Radar\nDisclosure: None.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "07:12:27",
      "Source": "Motley Fool",
      "Title": "Stock Market Today, Dec. 26: Nvidia Rises on $20 Billion Groq Licensing Deal",
      "URL": "https://finance.yahoo.com/m/f6afe948-841c-30a8-a506-425b598d4b1d/stock-market-today%2C-dec.-26%3A.html",
      "Content": "Stock Market Today, Dec. 26: Nvidia Rises on $20 Billion Groq Licensing Deal\n\nHoward Smith, The Motley Fool\nFri, December 26, 2025 at 3:12 PM PST 2 min read\n\nIn this article: NVDA\n\nGROQ.PVT\n\nAMD\n\nINTC\n\n^GSPC\n\nNvidia (NASDAQ:NVDA) , a leading GPU and AI platform developer, closed Friday at $190.53, up 1.02%. Nvidia IPO'd in 1999 and has grown 464,416% since going public. Trading volume only reached 136.8 million shares, coming in about 27% below versus its three-month average of 188.5 million shares.\n\nFriday's action centered on Nvidia's $20 billion Groq licensing deal and analyst commentary framing it as a strategic AI and data center win that investors are watching for implications on future chip demand.\n\nHow the markets moved today The S&P 500 (SNPINDEX:^GSPC) slipped 0.02% to 6,931, while the Nasdaq Composite (NASDAQINDEX:^IXIC) eased 0.09% to 23,593. In Semiconductors, industry peers Advanced Micro Devices (NASDAQ:AMD) fell 0.02% and Intel (NASDAQ:INTC) edged up 0.11%, as traders weighed Nvidia-driven AI server momentum.\n\nWhat this means for investors Nvidia acquired assets from chip start-up Groq for about $20 billion. Groq was founded in 2016 by the developers of Alphabet 's (NASDAQ:GOOG) (NASDAQ:GOOGL) tensor processing unit (TPU), which competes with Nvidia in the field of artificial intelligence workloads.\nThe deal also brought Groq executives, including its CEO, under Nvidia's umbrella. Investors see the move as a way to integrate Groq's AI inference technology, expanding Nvidia's leadership in the sector.\n\nToday's move higher extended Nvidia's recent winning streak with the stock up over 11% in just the past six days.\nDon’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $489,202 !*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $52,090 !*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $504,994 !*\nRight now, we’re issuing “Double Down” alerts for three incredible companies , available when you join Stock Advisor , and there may not be another chance like this anytime soon.\nSee the 3 stocks »\n*Stock Advisor returns as of December 22, 2025\nHoward Smith has positions in Alphabet, Intel, and Nvidia and has the following options: short February 2026 $170 calls on Nvidia and short January 2026 $26 calls on Intel. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Intel, and Nvidia. The Motley Fool has a disclosure policy .\nStock Market Today, Dec. 26: Nvidia Rises on $20 Billion Groq Licensing Deal was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "05:45:00",
      "Source": "MarketBeat",
      "Title": "Is MetaX a NVIDIA Threat—or Just Another DeepSeek Market Scare?",
      "URL": "https://finance.yahoo.com/m/3b623837-8336-3b6e-a7c4-3b3574bb3e98/is-metax-a-nvidia-threat%E2%80%94or.html",
      "Content": "Is MetaX a NVIDIA Threat—or Just Another DeepSeek Market Scare?\n\nJordan Chussler, MarketBeat\nFri, December 26, 2025 at 1:45 PM PST 4 min read\n\nIn this article: NVDA\n\n688802.SS\n\nAMD\n\nOPAI.PVT\n\nMETA\n\nKey Points After China-based GPU manufacturer MetaX recently debuted on the Shanghai market, the stock gained 700%.\nWith investors rotating out of U.S.-listed AI stocks, the news was reminiscent of January 2025’s DeepSeek market scare.\nBut NVIDIA’s central role in the AI landscape and its strategic partnerships with companies like OpenAI nearly assures its long-term success.\nInterested in NVIDIA Corporation? Here are five stocks we like better.\n\nOn Dec. 17, news broke about China-based MetaX Integrated Circuits making its public debut on the Shanghai Stock Exchange and subsequently surging by around 700%.\nThe company—not to be confused with Mark Zuckerberg-led Meta Platforms (NASDAQ: META)—was founded by former Advanced Micro Devices (NASDAQ: AMD) executives and develops general-purpose graphics processing units, or GPUs, for applications in artificial intelligence.\n→ Why Kratos and AeroVironment Are Suddenly Moving Like Tech Stocks\nBecause of the AI-focus of its microchips, the company has drawn comparisons to NVIDIA (NASDAQ: NVDA), the largest publicly traded company by market cap at $4.58 trillion.\nAs an increasing level of global competition comes to the forefront, should shareholders be concerned about threats to NVIDIA’s dominance?\n\n→ These 3 Household Names Are Flashing Rare Oversold Signals\nMetaX Is the Latest Example of a DeepSeek Market Scare On Dec. 21, CNBC reported that AI-linked IPOs in China are undergoing rapid growth, with some of the listings “delivering eye-popping gains.” One week before MetaX made its debut, another GPU designer—Moore Threads Technology—also had its IPO, with its shares gaining approximately 400% thereafter.\nAt the same time, investors continued to rotate out of U.S.-listed tech stocks as concerns about elevated valuations, market concentration, and the specter of an AI bubble looms over the S&P 500.\n\n→ MarketBeat Week in Review – 12/22 - 12/26\nThe MetaX news accelerated selling of NVDA, which, after hitting its all-time high in late October 2025, had fallen by more than 17% by Dec. 17 before finding its footing.\nFor analysts and pundits, there was no shortage of correlations being drawn between MetaX’s market disruption and the one investors grappled with on Jan. 27, 2025, when news of DeepSeek—a generative AI company based in China—would present an alternative to OpenAI at comparatively attractive prices.\nIn turn, a majority of large and mega-cap U.S. equities with any exposure to AI underwent a short-term sell-off. Within days, hundreds of billions of dollars in Magnificent Seven market cap was wiped out.\n\nStory Continues\nBut it turned out that DeepSeek, despite its low-cost models that could run training models at a fraction of the compute power as OpenAI, was a flash in the pan. Numerous issues—from government censorship and a notable security breach to slowdowns in updates and uninspiring subsequent models—saw the company’s hype die down as quickly as it arrived.\n\nNow, nearly 12 months later, the market could be seeing another iteration of that with MetaX.\nWhy MetaX Isn’t the Market Threat It’s Made out to Be NVIDIA’s dominance in the broad AI landscape, and in the GPU industry in particular, is unquestioned. But importantly, when the market overreacts to newcomers—as it is prone to do—oftentimes the investors who panic-sell are the ones who suffer long term.\nOver the last three years, NVIDIA has delivered 11 earnings beats in the past 12 quarters. Over the same period, the company has beat on revenue estimates 12 out of 12 times.\n\nMetaX, on the other hand, continues to operate at a loss. Analysts have determined that the company’s technology lags that of mainstream competitors by two to three years.\nAdditionally, being based in China, the company relies heavily on domestic, state-sanctioned investments, which put into question the viability of its long-term success.\nCompounding matters, as CNBC reported, it isn’t easy for overseas investors to partake in these rallies. According to the outlet, “foreign retail investors in particular are shut out of mainland China IPOs.”\nFund manager Yang Tingwu of Tongheng Investment told Reuters that the surge in these China-based AI companies’ stock prices is very likely a run-up that will result in the markets “witnessing the stock's peak level for the next five years.”\n\nNVIDIA and Its Shareholders Will Be Fine Meanwhile, NVIDIA is less than 9% removed from its all-time high, has gained nearly 1,352% over the past five years, and finds itself at the center of a circular financing network that is worth hundreds of billions of dollars.\nNVIDIA and its ilk are nearly cemented in strategic partnerships with other AI companies, including OpenAI—a role that the Santa Clara, Calif.-based fabless GPU company is unlikely to relinquish any time soon.\n\nThe stock maintains a consensus Buy rating based on 53 analysts that cover it, with its average 12-month price target of $262.14 representing potential upside of more than 39%.\nOver the past year, institutional owners have been pouring money into the company to the tune of $339.17 billion compared to outflows of $116.47 billion. Another strong indication of health is that current short interest stands at just 1.13% of the float.\nThe article \" Is MetaX a NVIDIA Threat—or Just Another DeepSeek Market Scare? \" was originally published by MarketBeat.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "04:12:00",
      "Source": "MarketBeat",
      "Title": "NVIDIA’s $20B Groq Deal Is a Warning Shot to AI Rivals",
      "URL": "https://finance.yahoo.com/m/f8743b3c-e946-3fbe-83db-a6ab453a642f/nvidia%E2%80%99s-%2420b-groq-deal-is-a.html",
      "Content": "NVIDIA’s $20B Groq Deal Is a Warning Shot to AI Rivals\n\nJeffrey Neal Johnson, MarketBeat\nFri, December 26, 2025 at 12:12 PM PST 6 min read\n\nIn this article: NVDA\n\nAMD\n\nGOOG\n\nMSFT\n\nAMZN\n\nKey Points NVIDIA has solidified its leadership position by securing the industry's fastest inference technology to power real-time artificial intelligence applications.\nThe company used its substantial free cash flow to fund this strategic expansion while also returning capital to investors through a cash dividend.\nThis strategic move effectively neutralizes potential competition by integrating top engineering talent and proprietary technology into the NVIDIA ecosystem.\nInterested in NVIDIA Corporation? Here are five stocks we like better.\n\nWhile the markets were quiet for the post-Christmas trading session, NVIDIA (NASDAQ: NVDA) made a noise that will echo for years. The company announced a definitive agreement to pay approximately $20 billion in cash to license the technology and hire the core engineering team of AI chip startup Groq.\nThe timing of this announcement is poetic. On the very day NVIDIA is distributing its quarterly dividend of $0.01 per share to loyal shareholders, it is aggressively reinvesting its massive cash pile to secure its future dominance. The market reaction has been swift and bullish. NVIDIA shares climbed roughly 1.5% following the news, trading in the $188 to $191 range. This move pushes the company’s market capitalization firmly past the $4.6 trillion milestone.\n\n→ Why Kratos and AeroVironment Are Suddenly Moving Like Tech Stocks\nWall Street’s reaction reflects a clear consensus: this is not just a purchase; it is a fortification. By securing the fastest chip technology in the market, NVIDIA is widening its competitive moat against rivals like Alphabet (NASDAQ: GOOGL) and AMD (NASDAQ: AMD). This deal helps ensure that NVIDIA remains the only game in town for the next phase of the artificial intelligence (AI) boom.\nHow Groq Solves NVIDIA’s Speed Limit To understand why NVIDIA would spend $20 billion on a startup, investors must first understand how the AI market changed in 2025. For the last three years, the industry focused on Training. This is the process of teaching an AI model, which requires massive amounts of raw computing power to crunch data. NVIDIA’s Blackwell and Hopper GPUs were perfect for this heavy lifting.\n\n→ These 3 Household Names Are Flashing Rare Oversold Signals\nHowever, late in 2025, the market reached a tipping point known as the Inference Flip. Global revenue from using AI models (Inference) officially surpassed the revenue from building them (Training). While training is a one-time event, inference is a continuous, 24/7 utility, much like electricity. Every time a user asks a chatbot a question or a robot moves, that is an inference event.\n\nStory Continues\nThe Speed Problem As AI moves into real-time applications like voice assistants and humanoid robotics, speed becomes the critical metric. This created a vulnerability for NVIDIA because its chips were designed for size rather than speed.\n→ MarketBeat Week in Review – 12/22 - 12/26\nThe Freight Train: NVIDIA’s GPUs are like massive freight trains. They have an incredible capacity to haul data, but they take time to get up to speed. They are optimized for throughput (volume), not instant speed.\nThe Formula 1 Car: Groq’s technology, known as the Language Processing Unit (LPU), is built differently. It is like a Formula 1 car, lightweight and capable of instant acceleration.\n\nThe Benchmark Gap Data shows that Groq’s LPUs can process between 300 and 500 tokens per second on standard models like Llama 2. In comparison, a standard GPU setup typically manages around 100 tokens per second. By absorbing this technology, NVIDIA ensures it owns the fastest solution for the fastest-growing segment of the market. This also addresses a total cost of ownership risk; because Groq chips are faster, they use less energy per task, which appeals to cost-conscious data centers.\n\nThe Smartest Deal in Tech: How NVIDIA Avoided the FTC In today's strict regulatory environment, a standard merger between a $4.6 trillion giant and a rising competitor would likely be blocked by the Federal Trade Commission (FTC). Regulators are wary of monopolies buying up their rivals. NVIDIA’s management navigated this risk by structuring the deal as a reverse acqui-hire and a non-exclusive licensing agreement rather than a traditional corporate acquisition.\n\nHow the Deal Works: Licensing: NVIDIA pays for the right to use Groq’s intellectual property in perpetuity, but Groq retains theoretical ownership.\nHiring: NVIDIA hires the majority of Groq’s engineering staff and leadership.\nIndependence: The Groq corporate entity technically remains independent, avoiding the mandatory antitrust waiting periods required by the Hart-Scott-Rodino (HSR) Act.\n\nThis structure mirrors successful strategies recently employed by Microsoft (NASDAQ: MSFT) and Amazon (NASDAQ: AMZN). It allows NVIDIA to integrate the technology immediately without getting bogged down in 18 to 24 months of litigation. This speed of execution is a major bullish signal for the stock, as it prevents competitors from catching up while the deal is stuck in court.\nA Blow to Rivals Perhaps the most valuable asset in this deal is the human capital. NVIDIA has hired Jonathan Ross, the founder of Groq. Before starting Groq, Ross invented the Tensor Processing Unit (TPU) at Google. By bringing Ross into the fold, NVIDIA has effectively neutralized a key competitor and deprived Google, its biggest rival in custom silicon, of the talent that built its foundation.\n\nThe Buy vs. Build Calculation: Why This Deal Was Cheap A $20 billion price tag is massive for most companies, but for NVIDIA, it represents a highly efficient use of capital. Investors should view this through the lens of buy vs. build. Could NVIDIA have built this technology itself? Likely yes. But it would have taken three to four years of research and development. In the fast-moving world of AI, three years is an eternity. By spending cash now, NVIDIA buys time.\n\nBy the Numbers: Free Cash Flow: In the third quarter alone, NVIDIA generated $22.1 billion in free cash flow. Effectively, the company paid for this entire strategic expansion with just three months of cash generation.\nShareholder Rewards: As a testament to this financial strength, NVIDIA is paying out its quarterly cash dividend of $0.01 per share today , Dec. 26. This proves that the company can fund massive growth while rewarding shareholders simultaneously.\n\nValuation Perspective Despite the stock trading near all-time highs, analysts argue that the valuation is reasonable given the growth potential. The stock currently trades at a forward price-to-earnings ratio (P/E) of approximately 23x. This is significantly lower than its trailing P/E of around 52x, suggesting that earnings are growing fast enough to justify NVIDIA’s current stock price. By securing the Groq technology, NVIDIA protects these future earnings from competitive erosion.\n\nNVIDIA’s Evolution Into the OS of AI This transaction serves as a powerful reminder that NVIDIA is evolving. It is no longer just a hardware vendor; it is becoming the inevitable operating system for the entire AI economy.\nLooking ahead, investors can expect NVIDIA to integrate Groq’s low-latency technology into its upcoming Rubin architecture and its robotics initiative, Project GR00T . With fourth-quarter r evenue guidance projected at $65 billion , the company’s fundamentals remain flawless. This deal silences the bear case that competitors would eventually catch up in speed. For investors, the thesis remains intact: NVIDIA is building the foundation for the future of artificial intelligence.\nThe article \" NVIDIA’s $20B Groq Deal Is a Warning Shot to AI Rivals \" was originally published by MarketBeat.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "02:19:00",
      "Source": "Zacks",
      "Title": "Top Analyst Reports for Advanced Micro Devices, Goldman Sachs and Lam Research",
      "URL": "https://finance.yahoo.com/news/top-analyst-reports-advanced-micro-181900325.html",
      "Content": "Top Analyst Reports for Advanced Micro Devices, Goldman Sachs and Lam Research\n\nMark Vickery\nFri, December 26, 2025 at 10:19 AM PST 7 min read\n\nIn this article: AMD\n\nCB\n\nPH\n\nGS\n\nLRCX\n\nFriday, December 26, 2025\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Advanced Micro Devices, Inc. (AMD), The Goldman Sachs Group, Inc. (GS) and Lam Research Corp. (LRCX), as well as two micro-cap stocks, AstroNova, Inc. (ALOT) and Blue Dolphin Energy Co. (BDCO). These research reports have been hand-picked from roughly 70 reports published by our analyst team today.\n\nYou can see all of today&rsquo;s research reports here >>>\n\nAhead of Wall Street\nThe daily 'Ahead of Wall Street' article is a must-read for all investors who would like to be ready for that day's trading action. The article comes out before the market opens, attempting to make sense of that morning's economic releases and how they will affect that day's market action. You can read this article for free on our home page and can actually sign up there to get an email notification as this article comes out each morning.\nYou can read today's AWS here >>> Full-Day in the Markets on a Recently Declared Federal Holiday\nToday's Featured Research Reports\nAdvanced Micro Devices&rsquo; shares have outperformed the Zacks Computer &ndash; Integrated Systems industry over the last six months (+49.5% vs. +47.0%). The Zacks analyst believes AMD is benefiting from rising demand for EPYC processors as cloud, enterprise and AI-driven workloads expand. Growing adoption by major hyperscalers, increased use of Instinct accelerators and the launch of the MI350 series have strengthened AMD&rsquo;s system-level capabilities, supported by a broad ecosystem of cloud and AI partners.\n\nHowever, the company faces intense competition from NVIDIA in AI accelerators and from Intel in CPUs, whose entrenched ecosystems and strong market positions continue to pressure its growth prospects.\n(You can read the full research report on Advanced Micro Devices here >>>)\nGoldman Sachs&rsquo; shares have outperformed the Zacks Financial &ndash; Investment Bank industry over the past year (+58.1% vs. +39.2%). The Zacks analyst believes that the company has shown solid momentum, supported by strong execution in investment banking and trading. The firm is refocusing on its core businesses, scaling back consumer banking, and expanding through strategic acquisitions in private equity credit and global alternatives, which should strengthen its global presence and revenue mix.\nYet heavy reliance on overseas markets raises concerns amid geopolitical uncertainty. Rising expenses from ongoing technology investments and higher transaction-related costs during periods of strong client activity also remain key challenges.\n\nStory Continues\n(You can read the full research report on Goldman Sachs here >>>)\nLam Research &rsquo; s shares have outperformed the Zacks Electronics &ndash; Semiconductors industry over the past six months (+82.5% vs. +25.3%). The Zacks analyst believes that the company is benefiting from its strength in 3D DRAM and advanced packaging, with rising etch and deposition intensity driven by more complex 3D architectures. Improving memory spending, solid demand for high-bandwidth memory and continued investments in research and development position the company well to capitalize on higher wafer fab equipment demand.\n\nHowever, spending on mature semiconductor nodes is likely to remain weak in the near term. Ongoing trade and tariff tensions between the United States and China also remain a key risk to its outlook.\n(You can read the full research report on Lam Research here >>>)\nAstroNova&rsquo; s shares have underperformed the Zacks Technology Services industry over the past year (-34.2% vs. +22.0%). The Zacks analyst believes that execution challenges persist for the company, including margin pressure from inventory buildup, volatility in the Product ID segment, sluggish Aerospace OEM demand and weak cash conversion, despite the stock trading well below peer valuations.\nYet AstroNova is repositioning for margin expansion by shifting toward higher-margin ToughWriter 640 printers, supported by cost reductions, lower debt and proprietary printhead technology that enables vertical integration and recurring revenue.\n\n(You can read the full research report on AstroNova here >>>)\nBlue Dolphin Energy&rsquo; s shares have underperformed the Zacks Oil and Gas &ndash; Exploration and Production &ndash; United States industry over the last six months (-24.0% vs. -12.5%). The Zacks analyst believes severe liquidity stress, weakening profitability, refinancing risk and governance concerns tied to affiliate dependence weigh heavily on the company. Exposure to demand softness, crude price volatility, inventory risks and limited capital access further threaten its long-term viability.\nHowever, the company continues to operate its refining business with support from affiliated entities, which has helped sustain operations in a difficult industry environment.\n\n(You can read the full research report on Blue Dolphin here >>>)\nOther noteworthy reports we are featuring today include Intuitive Surgical, Inc. (ISRG), Chubb Ltd. (CB) and Parker-Hannifin Corp. (PH).\n\nMark Vickery\nSenior Editor\n\nNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\nToday's Must Read\nStrong Product Portfolio and Partner Base Aid AMD's Prospects\n\nLam Research (LRCX) Benefits From Etch and Deposition Strength\n\nFocus on Core Business, Buyouts Aid Goldman (GS) Amid Expense Pressure\n\nFeatured Reports\nBetter Pricing, New Business Growth Drive Chubb Limited (CB)\nPer the Zacks analyst, Chubb is set to grow on better pricing, new business growth and high renewal rates. Yet, exposure to cat loss induces underwriting volatility while costs pressurize margin.\nHalozyme's (HALO) ENHANZE Drug Delivery Technology Aid Growth\nPer the Zacks Analyst, Halozyme's collaboration deals with large pharma companies related to ENHANZE technology, drives revenue growth. Over dependence on partners for revenues remains a woe.\nDefense and Cybersecurity Strength Boosts Northrop Grumman (NOC)\nAccording to the Zacks analyst, Northrop Grumman's strong positioning in high-priority defense, space, and cyber programs and its $91.45B backlog support steady growth and rising revenues.\n\nAerospace Unit Aids Parker-Hannifin (PH), High Debt Ails\nPer the Zacks analyst, Parker-Hannifin will benefit from strength in Aerospace Systems segment, led by robust OEM and aftermarket demand. However, its high debt profile remains concerning.\nIntuitive Surgical's (ISRG) da Vinci System Helps Offset Risks\nPer the Zacks analyst, growing adoption of Intuitive Surgical's da Vinci system is driving its revenues as well as helping offsetting risks like supply-chain issues and rising costs.\nCVS Health (CVS) Pharmacy Arm, Digital Capabilities Expand\nThe Zacks analyst is impressed with CVS Health's stronger-than-expected pharmacy growth and its $20 billion, decade-long tech investment to streamline operations and boost customer engagement.\n\nAon's (AON) Strategic Acquisitions Aid, Expenses Woes Linger\nPer the Zacks analyst, several acquisitions and collaborations are helping AON enhance its capabilities and driving its profit growth. However, rising expenses remain a concern.\nNew Upgrades\nCelestica (CLS) Rides on Healthy Demand for Networking Products\nPer the Zacks analyst, strong demand for networking products, including 400G switches and 800G switches, will likely drive Celestica's top line. Its focus on AI integration is positive.\nCommScope (COMM) Rides on Solid Demand in ANS Segment\nPer the Zacks analyst, growing deployments of DOCSIS 4.0 amplifier and node products are expected to drive CommScope's top line. Strong focus on innovation is a tailwind.\nCrocs (CROX) Stays on Track to Deliver Long-Term Growth\nPer the Zacks analyst, Crocs is advancing its long-term growth plan through iconic products, global expansion and portfolio diversification, driving revenue growth, margin gains and cash flow.\n\nNew Downgrades\nPembina (PBA) Debt Load Raises Concerns Over Financial Health\nThe Zacks analyst believes that Pembina Pipeline's significant C$12.6 billion debt and short-term asset challenges may hinder its ability to sustain growth and financial stability.\nRising Competition and Declining RPE Hurt Robert Half (RHI)\nPer the Zacks analyst, heightened competition makes it difficult for Robert Half to balance growth and profitability. Declining revenues per employee (RPE) is a red flag for investors.\nDismal Comps and High Costs Hurt Jack in the Box's (JACK) Prospects\nPer the Zacks analyst, Jack in the Box's performance is being hurt by dismal comps stemming from negative traffic trends. Also, high debt levels and costs are a concern.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nThe Goldman Sachs Group, Inc. (GS) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nParker-Hannifin Corporation (PH) : Free Stock Analysis Report\nIntuitive Surgical, Inc. (ISRG) : Free Stock Analysis Report\nChubb Limited (CB) : Free Stock Analysis Report\nLam Research Corporation (LRCX) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "23:10:39",
      "Source": "Investor's Business Daily",
      "Title": "Stock Market Hits Record Highs On Nvidia, Google, GDP Data: Weekly Review",
      "URL": "https://finance.yahoo.com/m/981624e7-b136-3579-a856-a931906fd2bf/stock-market-hits-record.html",
      "Content": "Stock Market Hits Record Highs On Nvidia, Google, GDP Data: Weekly Review\n\nIBD STAFF\nFri, December 26, 2025 at 7:10 AM PST 4 min read\n\nIn this article: NVDA\n\nAMD\n\nNONOF\n\nNVO\n\n^GSPC\n\nIn a holiday-shortened market week, the S&P 500 and Dow Jones hit new highs, buoyed by Nvidia, Google and strong economic data.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "22:30:02",
      "Source": "Zacks",
      "Title": "Advanced Micro (AMD) Is Considered a Good Investment by Brokers: Is That True?",
      "URL": "https://finance.yahoo.com/news/advanced-micro-amd-considered-good-143002761.html",
      "Content": "Advanced Micro (AMD) Is Considered a Good Investment by Brokers: Is That True?\n\nZacks Equity Research\nFri, December 26, 2025 at 6:30 AM PST 4 min read\n\nIn this article: AMD\n\nInvestors often turn to recommendations made by Wall Street analysts before making a Buy, Sell, or Hold decision about a stock. While media reports about rating changes by these brokerage-firm employed (or sell-side) analysts often affect a stock's price, do they really matter?\nLet's take a look at what these Wall Street heavyweights have to say about Advanced Micro Devices (AMD) before we discuss the reliability of brokerage recommendations and how to use them to your advantage.\n\nAdvanced Micro currently has an average brokerage recommendation (ABR) of 1.61, on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell, etc.) made by 44 brokerage firms. An ABR of 1.61 approximates between Strong Buy and Buy.\nOf the 44 recommendations that derive the current ABR, 29 are Strong Buy and three are Buy. Strong Buy and Buy respectively account for 65.9% and 6.8% of all recommendations.\nBrokerage Recommendation Trends for AMD Check price target & stock forecast for Advanced Micro here>>>\nThe ABR suggests buying Advanced Micro, but making an investment decision solely on the basis of this information might not be a good idea. According to several studies, brokerage recommendations have little to no success guiding investors to choose stocks with the most potential for price appreciation.\n\nDo you wonder why? As a result of the vested interest of brokerage firms in a stock they cover, their analysts tend to rate it with a strong positive bias. According to our research, brokerage firms assign five \"Strong Buy\" recommendations for every \"Strong Sell\" recommendation.\nIn other words, their interests aren't always aligned with retail investors, rarely indicating where the price of a stock could actually be heading. Therefore, the best use of this information could be validating your own research or an indicator that has proven to be highly successful in predicting a stock's price movement.\nZacks Rank, our proprietary stock rating tool with an impressive externally audited track record, categorizes stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), and is an effective indicator of a stock's price performance in the near future. Therefore, using the ABR to validate the Zacks Rank could be an efficient way of making a profitable investment decision.\n\nABR Should Not Be Confused With Zacks Rank Although both Zacks Rank and ABR are displayed in a range of 1--5, they are different measures altogether.\n\nStory Continues\nThe ABR is calculated solely based on brokerage recommendations and is typically displayed with decimals (example: 1.28). In contrast, the Zacks Rank is a quantitative model allowing investors to harness the power of earnings estimate revisions. It is displayed in whole numbers -- 1 to 5.\nAnalysts employed by brokerage firms have been and continue to be overly optimistic with their recommendations. Since the ratings issued by these analysts are more favorable than their research would support because of the vested interest of their employers, they mislead investors far more often than they guide.\n\nIn contrast, the Zacks Rank is driven by earnings estimate revisions. And near-term stock price movements are strongly correlated with trends in earnings estimate revisions, according to empirical research.\nIn addition, the different Zacks Rank grades are applied proportionately to all stocks for which brokerage analysts provide current-year earnings estimates. In other words, this tool always maintains a balance among its five ranks.\nAnother key difference between the ABR and Zacks Rank is freshness. The ABR is not necessarily up-to-date when you look at it. But, since brokerage analysts keep revising their earnings estimates to account for a company's changing business trends, and their actions get reflected in the Zacks Rank quickly enough, it is always timely in indicating future price movements.\n\nIs AMD a Good Investment? Looking at the earnings estimate revisions for Advanced Micro, the Zacks Consensus Estimate for the current year has remained unchanged over the past month at $3.96.\nAnalysts' steady views regarding the company's earnings prospects, as indicated by an unchanged consensus estimate, could be a legitimate reason for the stock to perform in line with the broader market in the near term.\n\nThe size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #3 (Hold) for Advanced Micro. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>>\nIt may therefore be prudent to be a little cautious with the Buy-equivalent ABR for Advanced Micro.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "20:14:48",
      "Source": "GuruFocus.com",
      "Title": "Intel Stock Surges 80% in 2025, but Analysts Stay Cautious",
      "URL": "https://finance.yahoo.com/news/intel-stock-surges-80-2025-121448905.html",
      "Content": "Intel Stock Surges 80% in 2025, but Analysts Stay Cautious\n\nFaizan Farooque\nFri, December 26, 2025 at 4:14 AM PST 1 min read\n\nIn this article: INTC\n\nNVDA\n\nAMD\n\nThis article first appeared on GuruFocus .\nIntel ( INTC , Financials ) has staged one of its strongest rallies in years, gaining 80.3% in 2025 as investors grow more confident in its restructuring and manufacturing ambitions. The chipmaker's comeback is being fueled by major capital investments in new U.S. and European plants and momentum across the artificial intelligence sector.\n\nWarning! GuruFocus has detected 5 Warning Signs with INTC.\nIs INTC fairly valued? Test your thesis with our free DCF calculator.\nDespite the gains, Wall Street remains cautious. Analysts see roughly 5% upside from current levels, with most rating the stock as Hold. Concerns center on Intel's heavy spending on new fabrication plants and its slower adoption rate for AI-focused chips compared with Nvidia and Advanced Micro Devices.\nIntel's third quarter report showed better cost control and improving free cash flow, but analysts warn that profits could remain under pressure until its foundry strategy begins to deliver consistent returns.\nAnalyst data show five Buys, 20 Holds, and six Sells on Intel shares, with an average price target of $38.20. Investors are watching for signs that the company's turnaround can sustain momentum heading into 2026.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "19:37:10",
      "Source": "Simply Wall St.",
      "Title": "AI Chips Today - NVIDIA AI Chips Power Next-Gen Industrial Robotics",
      "URL": "https://finance.yahoo.com/news/ai-chips-today-nvidia-ai-113710313.html",
      "Content": "AI Chips Today - NVIDIA AI Chips Power Next-Gen Industrial Robotics\n\nSimply Wall St\nFri, December 26, 2025 at 3:37 AM PST 1 min read\n\nIn this article: NVDA\n\nMU\n\nAMD\n\nRR\n\nIn a recent development in the AI chips sector, Richtech Robotics showcased its mobile humanoid robot, Dex, at CES 2026. Dex features advanced operational capabilities powered by NVIDIA's Jetson Thor, enabling it to adapt to dynamic environments with real-time reasoning and precision. The robot has undergone training through NVIDIA’s open-source frameworks, Isaac Sim and Isaac Lab, emphasizing its capability in performing complex tasks. This demonstration highlights the integration of sophisticated AI chips within industrial robotics to drive productivity and efficiency in commercial and industrial settings.\n\nNVIDIA last closed at $188.61 down 0.3%.\nIn other market news, Kioxia Holdings was trading firmly up 5.7% and finishing the session at ¥11,415. In the meantime, MetaX Integrated Circuits (Shanghai) lagged, down 3.6% to end trading at CN¥619.70, hovering around its 52-week low.\nNVIDIA stands to significantly benefit from AI-driven infrastructure demand with innovation enhancing its market position. Click here to explore the compelling narrative behind NVIDIA's growth potential.\nFor an in-depth analysis on AI Chips, read our Market Insights article, which highlights Q3's AI-driven S&P gains and their implications. Get in fast before trends shift.\nBest AI Chip Stocks Micron Technology ended the day at $286.68 up 3.8%, close to the 52-week high.\nBroadcom closed at $350.22 up 0.3%.\nAdvanced Micro Devices closed flat at $215.04.\nWhere To Now? Get an in-depth perspective on all 82 AI Chip Stocks , including OmniVision Integrated Circuits Group , United Microelectronics and STMicroelectronics , by using our screener here.\nReady To Venture Into Other Investment Styles? The end of cancer? These 29 emerging AI stocks are developing tech that will allow early idenification of life changing disesaes like cancer and Alzheimer's.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nSources:\nSimply Wall St\n\"Richtech Robotics Debuts Mobile Humanoid Robot Dex at CES 2026\" from Richtech Robotics Inc. on GlobeNewswire (published 24 December 2025)\n\nStory Continues\nCompanies discussed in this article include TSE:285A NasdaqGS:MU NasdaqGS:AVGO NasdaqGS:AMD NasdaqGS:NVDA and SHSE:688802.\nThis article was originally published by Simply Wall St .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "23:43:32",
      "Source": "Insider Monkey",
      "Title": "Harbor Capital Appreciation Fund Added Advanced Micro Devices (AMD) in Q3",
      "URL": "https://finance.yahoo.com/news/harbor-capital-appreciation-fund-added-154332308.html",
      "Content": "Harbor Capital Appreciation Fund Added Advanced Micro Devices (AMD) in Q3\n\nSoumya Eswaran\nThu, December 25, 2025 at 7:43 AM PST 3 min read\n\nIn this article: AMD\n\n^GSPC\n\nHarbor Capital Appreciation Fund, an investment management company, released its Q3 2025 investor letter. A copy of the same can be downloaded here . The Harbor Capital Appreciation Fund primarily focuses on investing in equity securities, targeting U.S. companies that have a market capitalization of at least $1 billion at the time of investment. US equities delivered solid results in the third quarter, driven by continued momentum in AI and strong corporate earnings. The Federal Reserve’s interest rate cut also supported the market at the end of the quarter. The fund returned 5.11% in the quarter compared to 10.51% for the Russell 1000® Growth Index and 8.12% for the S&P 500 Index. In addition, please check the fund’s top five holdings to know its best picks in 2025.\n\nIn its third-quarter 2025 investor letter, Harbor Capital Appreciation Fund highlighted stocks such as Advanced Micro Devices, Inc. (NASDAQ: AMD ). Advanced Micro Devices, Inc. (NASDAQ:AMD) is a semiconductor company that operates through Data Center, Client, Gaming, and Embedded segments. The one-month return of Advanced Micro Devices, Inc. (NASDAQ:AMD) was 0.37%, and its shares gained 70.27% of their value over the last 52 weeks. On December 24, 2025, Advanced Micro Devices, Inc. (NASDAQ:AMD) stock closed at $215.04 per share, with a market capitalization of $350.094 billion.\nHarbor Capital Appreciation Fund stated the following regarding Advanced Micro Devices, Inc. (NASDAQ:AMD) in its third quarter 2025 investor letter:\nAdvanced Micro Devices, Inc. (NASDAQ:AMD) is in 19th position on our list of 30 Most Popular Stocks Among Hedge Funds . According to our database, 115 hedge fund portfolios held Advanced Micro Devices, Inc. (NASDAQ:AMD) at the end of the third quarter, up from 113 in the previous quarter. While we acknowledge the potential of Advanced Micro Devices, Inc. (NASDAQ:AMD) as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\n\nStory Continues\nIn another article , we covered Advanced Micro Devices, Inc. (NASDAQ:AMD) and shared the list of best growth stocks to buy in 2026. In addition, please check out our hedge fund investor letters Q3 2025 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "22:57:05",
      "Source": "GOBankingRates",
      "Title": "I Asked ChatGPT What Will Happen To the Stock Market If the AI Bubble Bursts",
      "URL": "https://finance.yahoo.com/news/asked-chatgpt-happen-stock-market-145705424.html",
      "Content": "I Asked ChatGPT What Will Happen To the Stock Market If the AI Bubble Bursts\n\nJordan Rosenfeld\nThu, December 25, 2025 at 6:57 AM PST 4 min read\n\nIn this article: ^GSPC\n\nNVDA\n\nAMD\n\nMSFT\n\nGOOG\n\nArtificial intelligence (AI) is not just infiltrating everyday lives; it has been the driving force behind stock market gains for the past two years. From chipmakers to software, anything tied to AI has surged. But investors are starting to wonder what happens if the momentum slows and the market decides AI valuations have gone too far. While no one can predict the future, I asked ChatGPT to look more deeply into the history of stock market bubbles and what might happen if the AI bubble were to burst.\n\nHere are its predictions.\nA Sharp Repricing of AI Stocks A correction in AI stocks would not just be another bad day for tech, ChatGPT warned. Because a handful of companies, including Nvidia, AMD, Microsoft, Alphabet and Meta, now make up such a large percentage of the S&P 500, their movements shape the entire market.\nIf the market decides these large AI players are overvalued, those big company stocks will be the first to see a rapid decline as well as any company heavily tied to AI infrastructure, ChatGPT said.\n\nBecause these companies now make up a huge share of the market, a correction in even a handful of them could lead to a fall in both the S&P 500 and Nasdaq. This could lead to an environment similar to the dot-com bubble burst of the early 2000s.\nLearn More: I Asked ChatGPT What Would Happen If Billionaires Paid Taxes at the Same Rate as the Middle Class\nRead Next: 9 Low-Effort Ways To Make Passive Income (You Can Start This Week)\nA Broader Market Correction If the AI market trend reverses, the entire stock market index would likely follow, ChatGPT said. We could be looking at a broad correction of 10% to 20% if sentiment turns and investors begin to question AI revenue projections.\nNot all sectors would be hit equally, however. What tends to happen during sector slowdowns is that investors rotate their money into other areas like utilities, healthcare and consumer staples, ChatGPT noted. That means companies with steady earnings and predictable cash flows tend to look attractive. Thus, investors with diversified portfolios would be less affected than those concentrated in a single theme.\n\nStartup Valuations Could Cool Fast The ripple effects of an AI market correction would also have an impact on startups. Venture funding has been pouring into AI startups with the assumption that adoption will keep accelerating, ChatGPT said. If the market “gets skittish,” these valuations could fall as quickly as public tech stocks. That means less hiring, more consolidation and a good chance that many AI startups might fail.\n\nStory Continues\nLarger companies with strong balance sheets would likely scoop up talent or intellectual property, however, again similar to what happened after the dot-com bust. For workers and entrepreneurs, this could hit hard.\nWill an Economic Crisis Be Coming? The good news for investors is that a complete collapse similar to 2000 or 2008 is much less likely. Many AI companies today generate revenue that’s grounded in other profitable business products or services outside of AI. Nvidia, Microsoft and Amazon have the funds and the services to withstand a downturn . In the dot-com era, many companies going public had no profits or even customers. ChatGPT said “the fundamentals today are stronger.”\n\nHow Likely Is an AI Bubble To Burst? While an economic crisis is not likely coming, a sharp correction in AI stocks is more likely than not, ChatGPT said. It pointed out that “high-growth sectors tend to overshoot,” and the enthusiasm around AI has created valuations that may be more speculative than accurate in certain areas. A moderate pullback of 15% to 30% in leading AI names would not be surprising.\n\nIt did say that a complete bubble collapse is less likely, however. AI already has real commercial value, and early gains are showing up across industries. Just like the early days of the smartphone, there may be volatility, but the long-term trajectory remains positive.\nWhat Investors Should Focus On Now Everyday investors should expect volatility. The smartest bet is to keep a diversified portfolio , balanced allocation and long-term time horizon to have the best protections.\nMore From GOBankingRates\n10 Kirkland Products Costco Quietly Raised Prices on -- and Where To Buy Instead\n5 Reliable Cars That Will Have Massive Price Drops in Winter 2025\n9 Low-Effort Ways To Make Passive Income (You Can Start This Week)\n6 Safe Accounts Proven to Grow Your Money Up to 13x Faster\nThis article originally appeared on GOBankingRates.com : I Asked ChatGPT What Will Happen To the Stock Market If the AI Bubble Bursts\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "19:03:13",
      "Source": "The Columbus Dispatch",
      "Title": "How a Silicon Valley dealmaker charmed Trump, giving Intel a lifeline",
      "URL": "https://finance.yahoo.com/m/26a2f875-52a2-39b8-a1d7-390d8c011929/how-a-silicon-valley.html",
      "Content": "How a Silicon Valley dealmaker charmed Trump, giving Intel a lifeline\n\nMax A. Cherney and Jeffrey Dastin, Reuters\nThu, December 25, 2025 at 3:03 AM PST 11 min read\n\nIn this article: INTC\n\nPLTR\n\nNVDA\n\nAMD\n\nOPAI.PVT\n\nSAN FRANCISCO (Reuters) - It was a Thursday before dawn in Silicon Valley when Intel CEO Lip-Bu Tan found himself under attack by the president of the United States.\n“The CEO of INTEL is highly CONFLICTED and must resign, immediately,” U.S. President Donald Trump wrote on his Truth Social platform at 4:39 a.m. Pacific Time on Aug. 7. Before he was Intel CEO, Tan had been a prolific investor in companies in China.\nTrump and Tan had not met. While technology leaders from Nvidia, AMD, OpenAI, Amazon, Google and Palantir had all recently traveled to see Trump, the head of America’s most storied chipmaker had not spent time with the president since joining Intel in March.\nPolitics was not Tan’s top priority. It had been more than 20 years since Tan, 66, had donated to a presidential election campaign. Though he spoke with a handful of U.S. government leaders, including Commerce Secretary Howard Lutnick in April, the Intel CEO did not fill the company’s top policy job in Washington for months after its prior holder, a Democrat, resigned.\n\nAlmost immediately after Trump’s attack, Intel scrambled to lock down time with the president, two people with knowledge of the situation said. That culminated in the most pivotal, roughly 40-minute meeting of Tan’s decades-long career.\nPreviously unreported details about Tan and Intel show how a man Trump had accused of supporting China’s interests came away from the meeting with a commitment from the U.S. government to invest billions of dollars for a nearly 10% stake in the company.\nThe deal gave Intel a too-strategic-to-fail aura and opened doors to potential partners who might want to win the president’s favor. It also may pave the way for the government to take more equity stakes in businesses the administration deems strategic, in what some investors previously described to Reuters as ushering in a new era of U.S. industrial policy.\n\nIntel’s share price has risen around 80% since Tan’s appointment, outpacing the percentage gains of the S&P 500 and Nvidia in that time.\nReuters spoke with around 20 people who are current and former Intel employees, government advisers, and Tan’s industry contacts. Some of them questioned whether Tan has the technical acumen to restore Intel’s lead in chip manufacturing and find a winning artificial intelligence strategy, even as his skills as a dealmaker served him well in the Oval Office and elsewhere.\nThe transition to Tan comes as Intel is in the middle of an announced $28 billion project to construct microchip production facilities in the Licking County portion of New Albany . While the factories were originally slated to begin operations this year, that has been delayed to 2030 at the earliest as Intel seeks buyers for the chips those factories are to produce .\n\nStory Continues\nThough Intel’s chips powered some of the first mass-produced PCs, years of dysfunction had allowed foreign competitors such as TSMC to eclipse Intel in high-end chip production.\nIn statements, an Intel spokesperson said Tan needed no persuading to engage with the Trump administration. Early on, he elevated government affairs, among other functions, to report to him. Intel announced in December that a Trump economic adviser would helm the unit.\n\n“Lip-Bu Tan has a long, and well-established history of engagement in Washington, both before and after joining Intel,” the spokesperson said. Intel declined to make Tan available for an interview.\nA White House spokesperson said President Trump was using his executive power to get “the best bargain for the American taxpayer” and safeguard U.S. security.\n“The Administration’s historic deal with Intel is one of many initiatives to reshore semiconductor and other critical manufacturing back to the United States,” the White House spokesperson said.\n40 minutes in the Oval Office Before heading into the White House, Tan called on his own allies who had forged relationships with the president, including Microsoft CEO Satya Nadella and Nvidia CEO Jensen Huang, to vouch for him, said two people familiar with the discussions.\nTan “spoke, as he does often, with confidantes who would have relevant insight and perspective ahead of his meeting with President Trump,” the Intel spokesperson said. Nvidia and Microsoft did not comment for this story.\n\nPrior to the meeting, Tan strategized with his advisors on how to convince Trump he was an American patriot by discussing his personal story and his commitment to the United States, the two people said. He also prepared to discuss his China holdings, the people said.\nTan has made some 600 investments in China, some linked to the country’s military, according to Reuters reporting. Those connections to China are what ultimately landed him in the crosshairs of the president. Two of Tan's investment firms - Walden International and Walden Catalyst - did not answer requests for comment. A third, Celesta Capital, said it had made one China investment that it exited in 2020.\nHis dealmaking acumen, Celesta Capital said, is a key reason Tan “is so well suited to lead Intel’s current moment.”\n\nJust two cabinet members joined the meeting between Trump and Tan in the Oval Office: Lutnick and Treasury Secretary Scott Bessent, one of the people said. Trump questioned the Intel CEO about how he planned to turn the company around, the person said.\nTan had already told Lutnick in a prior meeting that he did not want billions in handouts that the U.S. owed Intel as part of the CHIPS Act, the Commerce Secretary said in a video on X in August. Neither Lutnick nor Tan said why. The grant money had been offered to companies under the 2022 CHIPS Act in exchange for reviving domestic manufacturing so the U.S. could reduce its reliance on foreign semiconductor production.\nThe administration of former President Joe Biden had announced dozens of these awards to various chip-related companies, including coming to Intel's formal groundbreaking ceremony in Licking County in 2022 .\n\nSo when Trump proposed that the U.S. receive equity in exchange for giving Intel more CHIPS Act money - an idea that two sources said Lutnick had talked about for weeks with government staff - Tan struck a deal. Intel declined to comment on the specifics of the private conversation, but Lutnick later said in the video that equity made the exchange “fair.”\nThe deal gave Intel a $5.7 billion cash infusion and set up the U.S. government to be its largest shareholder. After the initial meeting, Tan pledged to “make Intel great again” in the video that Lutnick posted on social media, with the caption, “The Art of the Deal: Intel.”\nWithin weeks of his White House coup, Tan finalized a partnership with Nvidia, securing $5 billion from its CEO Huang who called Tan his “long-time friend.” Unlike Intel, known for manufacturing chips called central processing units, Nvidia designs the world’s top chips for AI.\n\nTrump celebrated the deal on social media, posting an AI-generated image of himself staring at a chart of Intel’s stock and showing how the value of the U.S. stake had risen by 50% after Nvidia’s investment.\nIntel's venture capitalist CEO Born in Malaysia to a Chinese-language journalist and a teacher, Tan started out in the hard sciences and had plans to become a nuclear engineer, but he ultimately went to business school and in or around 1983 got his first job in venture capital in California.\nDuring his career, Tan established himself as a man with a golden touch with startups that successfully were sold to other companies or went public. He amassed an estimated personal fortune well above $500 million.\n\nTan’s dealmaking savvy is helping Intel only to a point, three people with knowledge of the company said. For instance, Tan’s bid to buy SambaNova was the subject of internal debate given how the startup makes application-specific AI chips while the market favored general-purpose ones.\nAdditionally, these people said, chipmaking requires more engineering expertise than a typical tech business. Factories that make advanced chips rely on tools so precise they could pinpoint a U.S. quarter-dollar coin as far away as the moon. Some of its most successful executives, like Nvidia’s Huang, are electrical engineers by training.\nStill, some Wall Street analysts say Tan is an excellent choice for Intel CEO, with decades of chip-industry experience and a track record of delivering returns to shareholders.\n\n“Lip-Bu is deeply involved in technical decisions, including product roadmaps,” the Intel spokesperson said. “These are technical, hands-on changes that highlight the depth of his technical leadership.”\nTan was also “keenly aware” of Intel’s challenges when he took the CEO job, the Intel spokesperson said, because he had served on its board from 2022 until 2024.\nBut once inside Intel – which had around 100,000 staff when he joined - the complexity of the chip manufacturer was unlike anything Tan had faced as a CEO before, said two of the sources, who worked at Intel.\nThe company was bleeding cash to build factories for chip manufacturing, an effort begun under his predecessor Pat Gelsinger , and it needed an estimated $20 billion or more to have a shot at winning customers.\n\nTan called on top executives in his network and asked how they did things, one of the sources said. He likewise called on big customers – cloud providers like Amazon and Google – and asked what they wanted, said two people familiar with the matter.\nTan shook up Intel’s management team, similar to when he led the chip design company Cadence. There, he had worked with a deputy to draft a list of executives to fire, a person familiar with his Cadence days said. Cadence declined to comment.\nTan is cutting deeper still: laying off around 15% of Intel employees per securities filings, many of them managers.\nHe bypassed middle managers to have technical talent brief him directly, two of the people said. Tan named Intel engineering veteran Pushkar Ranade as his chief of staff and in December elevated him to interim chief technology officer.\n\nDespite the intensity of his task at Intel, Tan has split his time with his myriad other commitments, which include his investment firms. When evaluating potential deals for Intel’s venture arm, Tan would also ask his investment firms for their opinion, one of the former Intel employees said.\nAn alleged conflict of interest with his venture portfolio prompted Intel’s board to push back on Tan over an acquisition this year, Reuters reported this month.\nHis Intel employment requires that he spend “such time as is necessary” to perform his duties as CEO, a change from the prior Intel chief’s contract that had required “full business efforts and time to Intel.”\nCelesta Capital said Tan's time commitment to the firm is now minimal, and its team has received no request to review deals for Intel Capital. Walden International and Walden Catalyst did not answer requests for comment.\n\nIntel said Tan is working daily on transforming the company and “acted decisively” to flatten its structure, adding he is a “highly engaged CEO” who is “helping to restore speed, accountability, and create an engineering-centric, customer-focused culture.”\nA 'lifeline' for Intel So far, the U.S. investment has been a catalyst for Intel. Its Corporate Vice President John Pitzer said in a September interview that President Trump had just hosted top technology CEOs for dinner to discuss AI, and that their companies were potential Intel customers.\nThe deal was a “lifeline” for Intel, said technology lobbyist and Chamber of Progress CEO Adam Kovacevich. Without it, Intel could have been out a CEO if it had succumbed to Trump’s pressure, he said.\n\nThe same week as the White House deal, Intel announced a $2 billion investment from Masayoshi Son’s SoftBank, where Tan once was a board member.\nLutnick, who previously had no vested interest in phone calls to his office from business or government leaders about Intel’s manufacturing, now has an incentive to jump at them, said one of the sources, who is familiar with the administration. Lutnick has indicated that Americans have skin in the game for Intel to land a foundry deal that could bolster U.S. chip production, the person said.\nForeign chip manufacturers operating in the U.S. are concerned that government officials will tip the scales for customers to manufacture with Intel instead of with them, according to two sources familiar with these worries.\n\nA Commerce Department official said the U.S. stake gives Intel a shot at success but not a leg up, and Intel is not “too strategic to fail.” The official said further that Secretary Lutnick talks to all parties rather than prioritizing calls for Intel’s sake.\nWhile Intel is picking up steam on the deals front, its manufacturing unit has struggled to produce quality in-house chips.\nNvidia recently tested out whether it would manufacture its chips using Intel’s production process known as 18A but stopped moving forward, two people familiar with the matter said. Nvidia did not answer a request for comment.\nAn Intel spokesperson said the company’s 18A manufacturing technologies that make advanced chips are “progressing well,” and it “continues to see strong interest” for its next-generation production process, called 14A, which is expected to produce chips that are more powerful and efficient.\nNvidia made no commitment to manufacture with Intel in September when investing $5 billion in the chipmaker. “Right now we are focused on collaborations,” Tan told reporters while announcing the deal with Nvidia’s Huang.\n(Reporting by Max A. Cherney and Jeffrey Dastin in San Francisco; editing by Kenneth Li and Michael Learmonth)\nThis article originally appeared on The Columbus Dispatch: How Intel CEO Lip-Bu Tan charmed Trump to provide relief to chipmaker\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "14:32:41",
      "Source": "Simply Wall St.",
      "Title": "Is AMD’s Soaring AI Fueled Share Price Still Justified in 2025?",
      "URL": "https://finance.yahoo.com/news/amd-soaring-ai-fueled-share-063241187.html",
      "Content": "Is AMD’s Soaring AI Fueled Share Price Still Justified in 2025?\n\nSimply Wall St\nWed, December 24, 2025 at 10:32 PM PST 6 min read\n\nIn this article: AMD\n\nNVDA\n\nIf you are wondering whether Advanced Micro Devices at around $215 a share is still a smart buy or if the big gains are largely behind it, you are not alone. This is exactly the question we are going to unpack.\nThe stock is up 8.5% over the last week and 78.3% year to date, building on a 70.3% gain over the past year and a 243.7% return over three years that has reset expectations and risk perceptions for investors.\nRecent headlines have focused on AMD expanding its presence in artificial intelligence and data center chips, including aggressive pushes to challenge Nvidia in AI accelerators and deepen partnerships with major cloud providers. At the same time, ongoing coverage around chip supply chains, US semiconductor policy, and competitive dynamics in GPUs and CPUs has kept AMD firmly in the spotlight and helped fuel the latest moves.\nOn our checklist of undervaluation signals, AMD currently scores a 3/6 valuation score . This means half of the tests suggest the market may be underpricing some aspects of its fundamentals. Next we will break down how different valuation methods look at those signals before circling back to a more nuanced way of thinking about what AMD is really worth.\n\nAdvanced Micro Devices delivered 70.3% returns over the last year. See how this stacks up to the rest of the Semiconductor industry.\nApproach 1: Advanced Micro Devices Discounted Cash Flow (DCF) Analysis A Discounted Cash Flow model estimates what a company is worth today by projecting the cash it can generate in the future and then discounting those amounts back to a present value.\nFor Advanced Micro Devices, the latest twelve month free cash flow is about $5.6 billion. Analysts see that rising sharply, with projections stepping up to roughly $7.2 billion in 2026 and $12.4 billion in 2027, before extrapolated estimates climb further to around $27.9 billion by 2029 and over $59 billion by 2035. Simply Wall St uses a 2 Stage Free Cash Flow to Equity model, combining these analyst forecasts with longer term growth assumptions to map out the next decade of cash flows.\n\nWhen those projected cash flows are discounted back to today, the model arrives at an intrinsic value of roughly $302 per share. Compared with a current price near $215, this implies AMD trades at about a 28.8% discount to its DCF based fair value. This suggests potential upside if the projected cash flow path occurs as modeled.\nResult: UNDERVALUED\nOur Discounted Cash Flow (DCF) analysis suggests Advanced Micro Devices is undervalued by 28.8%. Track this in your watchlist or portfolio , or discover 904 more undervalued stocks based on cash flows .\n\nStory Continues\nHead to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for Advanced Micro Devices.\nApproach 2: Advanced Micro Devices Price vs Earnings For profitable companies like Advanced Micro Devices, the Price to Earnings ratio is a useful way to think about valuation because it directly links what investors pay for each share to the profits the business is currently generating. In general, faster growth and lower risk justify a higher PE, while slower growth and higher uncertainty should command a lower, more conservative multiple.\n\nAMD currently trades at around 111.8x earnings, well above the broader semiconductor industry average of about 36.5x and also richer than its peer group average near 58.8x. Simply Wall St goes a step further with its Fair Ratio, an estimate of what a normal PE should be for AMD given its earnings growth outlook, profitability, size, industry and risk profile. For AMD, that Fair Ratio sits at roughly 64.8x, which is already demanding but still meaningfully below the current market multiple.\nThis suggests that, even after accounting for AMD short term growth potential and competitive position, the stock trades at a premium to what its fundamentals justify on an earnings basis.\nResult: OVERVALUED\nPE ratios tell one story, but what if the real opportunity lies elsewhere? Discover 1460 companies where insiders are betting big on explosive growth .\nUpgrade Your Decision Making: Choose your Advanced Micro Devices Narrative Earlier we mentioned that there is an even better way to understand valuation, so let us introduce you to Narratives, a simple framework that lets you turn your view of Advanced Micro Devices into a clear story behind the numbers by connecting your assumptions about future revenue, earnings and margins to a specific fair value estimate.\n\nA Narrative starts with the company story you believe, links that story to a financial forecast, and then translates the forecast into a fair value you can compare with today’s share price to consider whether AMD looks like a buy, a hold, or a sell.\nOn Simply Wall St, Narratives are an easy, accessible tool inside the Community page, where millions of investors share different AMD outlooks that update automatically as new news, earnings and guidance come in, so the stories and the numbers stay current without you having to rebuild your model.\nFor example, one bullish AMD Narrative on the platform assumes rapid AI data center adoption and arrives at a fair value near $362 per share, while a more cautious Narrative, focused on export controls and margin pressure, lands closer to $137, showing how the same company can justify very different decisions depending on the story you believe.\n\nFor Advanced Micro Devices however we will make it really easy for you with previews of two leading Advanced Micro Devices Narratives:\n🐂 Advanced Micro Devices Bull Case\nFair value estimate: $283.57 per share\nImplied undervaluation vs current price: 23.9%\nAssumed annual revenue growth: 34.73%\nFrames AMD as a long term AI and data center winner, with multiyear accelerator and CPU ramps driving sustained double digit revenue and margin expansion.\nBuilds in rising profitability, with margins moving above 20% as AI, data center, and adaptive computing scale, while operating leverage improves over time.\nSees recent AI supercomputer and hyperscaler agreements as catalysts that justify a premium multiple and a fair value well above the current share price.\n\n🐻 Advanced Micro Devices Bear Case\nFair value estimate: $193.68 per share\nImplied overvaluation vs current price: 11.0%\nAssumed annual revenue growth: 18.84%\nHighlights intense competition from Nvidia, Intel, ARM based designs, and custom silicon, which could limit AMD AI share gains and pressure pricing.\nStresses execution, supply chain, and geopolitical risks, including reliance on TSMC and export restrictions, as potential brakes on growth and margins.\nArgues that while AMD has strong long term AI and data center potential, today’s valuation already prices in much of that upside, leaving less room for error.\nDo you think there's more to the story for Advanced Micro Devices? Head over to our Community to see what others are saying!\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include AMD .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "05:06:34",
      "Source": "Reuters",
      "Title": "Nvidia, joining Big Tech deal spree, to license Groq technology, hire executives",
      "URL": "https://finance.yahoo.com/news/nvidia-buy-ai-chip-startup-210634730.html",
      "Content": "Nvidia, joining Big Tech deal spree, to license Groq technology, hire executives\n\nStephen Nellis\nWed, December 24, 2025 at 1:06 PM PST 3 min read\n\nIn this article: GROQ.PVT\n\nNVDA\n\nGOOG\n\nAMD\n\nCESY.PVT\n\nBy Stephen Nellis\nDec 24 (Reuters) - Nvidia has agreed to license chip technology from startup Groq and hire away its CEO, a veteran of Alphabet's Google, Groq said in a blog post on Wednesday.\nThe deal follows a familiar pattern ​in recent years where the world's biggest technology firms pay large sums in deals with promising startups to take their ‌technology and talent but stop short of formally acquiring the target.\n\nGroq specializes in what is known as inference, where artificial intelligence models that have already been trained respond ‌to requests from users. While Nvidia dominates the market for training AI models, it faces much more competition in inference, where traditional rivals such as Advanced Micro Devices have aimed to challenge it as well as startups such as Groq and Cerebras Systems.\nNvidia has agreed to a \"non-exclusive\" license to Groq's technology, Groq said. It said its founder Jonathan Ross, who helped Google start its AI chip program, as well as Groq ⁠President Sunny Madra and other members of its ‌engineering team, will join Nvidia.\nA person close to Nvidia confirmed the licensing agreement.\nGroq did not disclose financial details of the deal. CNBC reported that Nvidia had agreed to acquire Groq for $20 billion in cash, but neither ‍Nvidia nor Groq commented on the report. Groq said in its blog post that it will continue to operate as an independent company with Simon Edwards as CEO and that its cloud business will continue operating.\n\nIn similar recent deals, Microsoft 's top AI executive came through a $650 million deal with a startup that ​was billed as a licensing fee, and Meta spent $15 billion to hire Scale AI's CEO without acquiring the entire firm. Amazon ‌hired away founders from Adept AI, and Nvidia did a similar deal this year. The deals have faced scrutiny by regulators, though none has yet been unwound.\n\"Antitrust would seem to be the primary risk here, though structuring the deal as a non-exclusive license may keep the fiction of competition alive (even as Groq’s leadership and, we would presume, technical talent move over to Nvidia),\" Bernstein analyst Stacy Rasgon wrote in a note to clients on Wednesday after Groq's announcement. And Nvidia CEO Jensen Huang's \"relationship with the Trump administration appears among the strongest of ⁠the key US tech companies.\"\n\nGroq more than doubled its valuation to $6.9 billion from $2.8 ​billion in August last year, following a $750 million funding round in September.\nGroq is ​one of a number of upstarts that do not use external high-bandwidth memory chips, freeing them from the memory crunch affecting the global chip industry. The approach, which uses a form of on-chip memory called SRAM, helps ‍speed up interactions with chatbots and ⁠other AI models but also limits the size of the model that can be served.\n\nStory Continues\nGroq's primary rival in the approach is Cerebras Systems, which Reuters this month reported plans to go public as soon as next year. Groq and Cerebras have ⁠signed large deals in the Middle East.\nNvidia's Huang spent much of his biggest keynote speech of 2025 arguing that Nvidia would be able to maintain its lead as ‌AI markets shift from training to inference.\n(Reporting by Stephen Nellis in San Francisco; Additional reporting by Harshita Mary Varghese ‌in Bengaluru; Editing by Shailesh Kuber, Matthew Lewis and William Mallard)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "05:06:34",
      "Source": "Reuters",
      "Title": "Nvidia to license Groq technology, hire executives",
      "URL": "https://finance.yahoo.com/news/nvidia-buy-ai-chip-startup-210634730.html",
      "Content": "Nvidia to license Groq technology, hire executives\n\nStephen Nellis\nWed, December 24, 2025 at 1:06 PM PST 2 min read\n\nIn this article: GROQ.PVT\n\nNVDA\n\nGOOG\n\nAMD\n\nCESY.PVT\n\nBy Stephen Nellis\nDec 24 (Reuters) - Nvidia has agreed to license chip technology from startup Groq and hire away its CEO, a veteran of Alphabet's Google, Groq said ​in a blog post on Wednesday.\nGroq specializes in what is known as inference, ‌where artificial intelligence models that have already been trained respond to requests from users. While Nvidia dominates the market for ‌training AI models, it faces much more competition in inference, where traditional rivals such as Advanced Micro Devices have aimed to challenge it as well as startups such as Groq and Cerebras Systems.\n\nGroq said that Nvidia had agreed to a \"non-exclusive\" license to Groq's technology. Groq said that its founder ⁠Jonathan Ross, who helped Google ‌start its AI chip program, as well as Groq President Sunny Madra and other members of its engineering team will join Nvidia.\nA person close to ‍Nvidia confirmed the licensing agreement.\nGroq did not disclose financial details of the deal. CNBC earlier reported that Nvidia had agreed to acquire Groq for $20 billion in cash, but neither Nvidia nor Groq commented on the ​report. Groq said in its blog post that it will continue to operate as an ‌independent company with Simon Edwards as CEO and that its cloud business will continue operating.\nGroq more than doubled its valuation to $6.9 billion, from $2.8 billion in August last year, following a $750 million funding round in September.\n\nGroq is one of a number of upstarts that do not use external high-bandwidth memory chips, which free them from the memory crunch affecting the global chip industry. The approach, ⁠which uses a form of on-chip memory called SRAM, ​helps speed up interactions with chatbots and other AI ​models but also limits the size of the model that can be served.\nGroq's primary rival in the approach is Cerebras Systems, which Reuters earlier this month ‍reported plans to go ⁠public as soon as next year. Both Groq and Cerebras have signed large deals in the Middle East.\nNvidia CEO Jensen Huang spent much of his biggest keynote speech of ⁠2025 arguing that Nvidia would be able to maintain its lead as AI markets shift from training to inference.\n(Reporting ‌by Stephen Nellis in San Francisco; Additional reporting by Harshita Mary Varghese in ‌Bengaluru; Editing by Shailesh Kuber and Matthew Lewis)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "03:42:36",
      "Source": "Barchart",
      "Title": "A Big China Catalyst Could Be Coming for AMD Stock in 2026. Should You Buy Shares Now?",
      "URL": "https://finance.yahoo.com/m/16d90456-3323-311e-b6a0-95c523f0bcfe/a-big-china-catalyst-could-be.html",
      "Content": "A Big China Catalyst Could Be Coming for AMD Stock in 2026. Should You Buy Shares Now?\n\nPathikrit Bose\nWed, December 24, 2025 at 11:42 AM PST 5 min read\n\nIn this article: AMD\n\nBABA\n\nNVDA\n\nIt looks like after Nvidia (NVDA), Advanced Micro Devices (AMD) is next in line to rehash a deal to resume the sales of its chips to China. After CEO Lisa Su had a meeting with China's Commerce Minister Wang Wentao in Beijing last week, reports have emerged that the country's tech giant Alibaba (BABA) is mulling ordering some of AMD's MI308 GPUs. According to this report, Alibaba could order between 40,000 and 50,000 of these GPUs. This could imply a revenue windfall in the range of $600 million to $1.25 billion for AMD.\n\nBut, before one jumps the gun over here, there are some unpleasant facts that one must consider. Firstly, though the U.S. has approved the sale of Nvidia's H200 chips to China, the Chinese regulators have not yet given their approval. So, the chances of AMD getting approval are also low at this point. Secondly, Alibaba is itself a chipmaker, although its chips are more of the ASIC kind rather than AMD's general-purpose chips. This means the latter has broader use cases than Alibaba's chips, which are optimized for its native cloud ecosystems and inference workloads.\nMore News from Barchart 2 Dividend Kings Quietly Beating the Market This Year\n$800 for Tesla Stock Could Be Reality in 2026. Here’s Why.\nApple Just Released a New AI Model. Should You Buy AAPL Stock Here?\nGet exclusive insights with the FREE Barchart Brief newsletter. Subscribe now for quick, incisive midday market analysis you won't find anywhere else.\n\nHowever, amid this development, where does AMD stand as an investment option now? It should be pretty high. Let's find out why.\nAMD's Robust Financials With a market cap of about $350 billion, AMD seems like a minnow in front of its larger peer, Nvidia. However, on the basis of share price performance, the AMD stock, with a rally of nearly 78%, has outperformed Nvidia's uptick of 37.1% this year by a considerable margin. But AMD is not just a short-term phenomenon; the company has been growing its revenue and earnings at a healthy clip for a while now.\nAMD has strung together a good five-year run, pushing revenue and earnings higher at compound rates of 29.94% and 28.93%. Notably, the most recent quarter fit right into that pattern, coming in stronger than Wall Street figures.\nQ3 sales hit $9.25 billion, 36% above the year-earlier mark. The core data center segment reported sales of $4.3 billion, implying a 22% growth from last year. Client and gaming put up the biggest jump, however, rising 73% on an annual basis to $4 billion.\nMeanwhile, EPS moved up by 30% in the same period to $1.20, outpacing the $1.17 consensus and stretching the company's run of beats to four quarters straight.\n\nStory Continues\nCash flow stood out as well. Operating cash flow shot up to $1.8 billion, almost three times the $628 million posted in the same quarter last year. Overall, AMD wrapped up September with $4.81 billion in cash, easily topping the $873 million in short-term debt and $2.35 billion in longer-term debt.\nHowever, AMD continues to trade at heady valuations when compared to the industry averages. Its forward P/E, P/S, and P/CF of 54.21, 10.30, and 54.12 are all higher than the sector medians of 24.37, 3.40, and 20.36, respectively.\n\nOptimism Abounds Since my previous analysis on AMD, previewing the company's Financial Analyst Day event on Nov. 11, the company's stock is down 10.3%. However, the case for investing in it may have only gotten stronger amid all the ambitious targets the management aims to hit in the coming years. First up is CEO Lisa Su's assertion that the data center market is set to reach a trillion dollars by 2030, an increase from her earlier projection of a $500 billion market by 2028.\n\nMeanwhile, on a company-specific basis, AMD has targeted a revenue CAGR of >35%, operating margins of >35%, and an annual EPS of $20 in the next 3-5 years, with data center AI revenue exceeding 80% CAGR in the same period. The targets may seem a bit steep, but Lisa Su has walked the walk on many occasions for more than a decade now, with the share price jumping by more than 80 times in her tenure, creating enormous wealth for shareholders.\nMoreover, AMD's GPUs aren't the only thing picking up speed; the full stack around them is growing fast, heading toward complete rack-level setups like Helios, MI400, and MI450. Software is keeping pace, too, with ROCm 7 making it easier to move workloads between systems. Notably, the MI500 lineup is already slated for 2027, so the roadmap looks loaded for years.\n\nOutside pure accelerators, the upcoming “Venice” CPUs and AMD's networking gear open up fresh growth lanes inside data centers.\nIn the bigger picture, what really matters is how AMD has spread its bets across platforms. CPUs, GPUs, adaptive chips, and networking all connect like parts of one machine, where nothing stands alone. That setup cuts the risk from any single trend swinging and lets the company shift gears quickly as AI designs change.\nAnalyst Opinion on AMD Stock Thus, analysts have deemed the stock to be a consensus “Moderate Buy,” with a mean target price of $288.87. This indicates an upside potential of about 34.2% from current levels. Out of 43 analysts covering the stock, 28 have a “Strong Buy” rating, three have a “Moderate Buy” rating, and 12 have a “Hold” rating.\nOn the date of publication, Pathikrit Bose did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "02:35:00",
      "Source": "MarketBeat",
      "Title": "Forget The Chips: Oracle Wins Phase 2 of AI",
      "URL": "https://finance.yahoo.com/m/b89fe9fa-4b6d-30ca-937c-52a45addfd07/forget-the-chips%3A-oracle-wins.html",
      "Content": "Forget The Chips: Oracle Wins Phase 2 of AI\n\nJeffrey Neal Johnson, MarketBeat\nWed, December 24, 2025 at 10:35 AM PST 6 min read\n\nIn this article: ORCL\n\nNVDA\n\nOWL\n\nAMD\n\nKey Points Oracle is transitioning from legacy software to become the essential utility provider for running powerful artificial intelligence chips.\nThe acquisition of a stake in TikTok validates the sovereign cloud strategy by demonstrating that Oracle can meet the immense national security requirements.\nA massive backlog of signed contracts provides strong revenue visibility and supports the aggressive expansion of data center capacity to meet demand.\nInterested in Oracle Corporation? Here are five stocks we like better.\n\nInvestors watched Oracle Corporation (NYSE: ORCL) surge to a closing price of $198.38 on Dec. 22, marking a gain of over 3% on heavy trading volume. While the broader technology sector has spent the last two years obsessing over which company manufactures the best artificial intelligence (AI) chips, the market is beginning to shift its focus.\nTwo developments—a massive U.S. joint venture and a critical infrastructure project in Michigan—suggest that the AI trade is moving into a new phase.\n→ Tesla Is Knocking on $500 Again—Here’s What It Means For January\nPhase one of the AI boom was about hardware procurement. During this time, companies spent billions buying processors from designers like NVIDIA (NASDAQ: NVDA). Phase two, however, is all about deployment.\n\nThese powerful chips require a place to live—massive, secure data centers with immense power capacity.\n→ Micron Just Changed the AI Cycle—and the Market Knows It\nBased on recent strategic moves, Oracle has emerged not as a competitor to the chipmakers but as the essential utility provider required to run them.\nFor investors, this distinction is critical: Oracle doesn't need to win the chip war; it just needs to rent the space where the winner lives.\n→ Why 2026 Could Be the Year D-Wave Breaks Out\nThe Infrastructure Engine: Building the AI Factory Oracle’s transition from a legacy software company to a cloud infrastructure giant is no longer a projection; it is evident in the hard numbers. In the second quarter of fiscal year 2026, the company reported growth metrics that outpaced many of its hyperscale competitors.\nCloud Infrastructure Growth: Oracle Cloud Infrastructure (OCI) revenue grew by 68% year-over-year.\nAI Demand: Revenue specifically related to graphics processing units (GPUs), the chips that power AI, jumped 177%.\nCapacity Delivery: The company delivered nearly 400 megawatts of capacity in the quarter to meet this surging demand.\n\nA key driver of this success is the company’s strategic pivot to Chip Neutrality. Oracle recently sold its stake in Ampere, a proprietary chipmaker, netting a $2.7 billion pre-tax gain. This move signals that Oracle is no longer interested in fighting a hardware war. Instead, it is deepening partnerships with Nvidia and AMD (NASDAQ: AMD) to become the most flexible distributor of computing power. By focusing on infrastructure rather than silicon, Oracle reduces manufacturing risk while still capturing the upside of the AI boom.\n\nStory Continues\nThis strategy faced a real-world test recently regarding a planned $10 billion AI supercluster in Michigan. Last week, financing partner Blue Owl Capital (NYSE: OWL) withdrew from the project, raising fears that Oracle might struggle to fund its ambitious buildout. However, on Dec. 22, Oracle confirmed that the project is proceeding \"on schedule,\" and the developer said it has chosen a new equity partner, though the firm was not named. This rapid resolution demonstrates that capital markets remain eager to fund Oracle's expansion, effectively removing an execution risk for the company.\n\nSecurity as a Strategy: Validating the Sovereign Cloud The most headline-grabbing news of the day is the confirmation of the TikTok U.S. joint venture. A consortium led by Oracle, Silver Lake, and investment firm MGX has agreed to acquire a 45% stake in TikTok’s U.S. operations. While the headlines focus on the app, the deal's details reveal a much bigger story for Oracle shareholders.\n\nThe deal structure breaks down as follows:\nOracle: 15% Ownership Stake.\nSilver Lake: 15% Ownership Stake.\nMGX: 15% Ownership Stake.\nOperational Role: Oracle will serve as the platform's exclusive cloud provider.\nFor investors, the value of this deal goes far beyond owning a piece of a popular social media app. This transaction validates Oracle’s Sovereign Cloud strategy. Sovereign cloud involves physically separating and ring-fencing data so that it remains within a specific national jurisdiction and adheres to strict security protocols.\nBy meeting the U.S. government's demanding national security requirements for TikTok, Oracle is demonstrating its capabilities to the rest of the market. If Oracle is trusted to secure the data for one of the most scrutinized apps in the world, it becomes a logical default choice for other highly regulated sectors. Industries such as defense, healthcare, and finance often cannot use public clouds due to privacy concerns. The TikTok deal acts as a proof of concept that Oracle can deliver the Sovereign AI security these industries require.\n\nRevenue Visibility: The $523 Billion Safety Net To support these massive contracts, Oracle is spending heavily. Capital expenditures (CapEx) hit $12 billion in the second quarter, and the company raised its full-year spending forecast by approximately $15 billion. Typically, such high spending might worry investors about cash flow and debt levels. However, this spending is backed by a massive safety net that changes the investment calculus.\n\nOracle reported Remaining Performance Obligations (RPO) of $523.3 billion, an increase of 438% year-over-year.\nIn plain English, RPO represents a backlog of signed contracts that have not yet been fulfilled. Customers have already committed to paying this money; Oracle just needs to build the data centers to service them. This creates a unique dynamic for the stock:\nSuccess-Based Capital: Oracle is not building data centers on speculation or hype. It is deploying capital to fulfill invoices that are already waiting.\nRevenue Visibility: This level of backlog provides a floor for the stock price. Even if the economy slows, Oracle has half a trillion dollars' worth of work to do.\nFuture Growth: Management raised its fiscal year 2027 revenue outlook by roughly $4 billion, signaling that it expects to convert this backlog into cash faster than anticipated.\n\nThe Value Play in a Hype Market As the artificial intelligence market matures, capital is rotating. Investors are moving funds from companies that build the hardware to those that provide the critical infrastructure. Oracle successfully transitioned from a traditional database firm to a modern cloud leader, and the market is rewarding that shift.\n\nTrading at a price-to-earnings ratio (P/E) of approximately 37x, Oracle offers exposure to the AI sector at a valuation that is often more reasonable than pure-play hardware manufacturers.\nWith the TikTok deal securing a massive anchor tenant and the Michigan project back on track, the company has cleared significant hurdles that were previously holding the stock back.\nFurthermore, Oracle is looking ahead to Phase Three of AI: Reasoning.\nThe company recently launched its AI Data Platform, which allows customers to use models like GPT-5 to reason across data stored in Oracle and non-Oracle databases alike.\nAs the demand for data security and capacity increases, Oracle’s unique combination of physical infrastructure, sovereign security, and enterprise software positions it to capture long-term value.\nFor investors seeking the next logical step in the AI trade, Oracle presents a compelling case for growth, backed by hundreds of billions in committed revenue.\nThe article \" Forget The Chips: Oracle Wins Phase 2 of AI \" was originally published by MarketBeat.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "01:47:45",
      "Source": "GuruFocus.com",
      "Title": "Leak Hints at First Intel Nvidia Chip After $5 Billion Partnership",
      "URL": "https://finance.yahoo.com/news/leak-hints-first-intel-nvidia-174745114.html",
      "Content": "Leak Hints at First Intel Nvidia Chip After $5 Billion Partnership\n\nMoz Farooque ACCA\nWed, December 24, 2025 at 9:47 AM PST 1 min read\n\nIn this article: INTC\n\nNVDA\n\nAMD\n\nTSM\n\nThis article first appeared on GuruFocus .\nIntel ( INTC , Financials ) and Nvidia ( NVDA , Financials ) may be preparing to ship their first jointly developed chip , according to leaked details about a laptop processor called Serpent Lake. The leak, shared by YouTube channel RedGamingTec, suggests the chip will combine Intel CPUs with Nvidia RTX graphics in a single design.\n\nWarning! GuruFocus has detected 5 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nSerpent Lake is expected to pair Intel's upcoming Titan Lake CPU architecture with Nvidia's RTX Rubin graphics, manufactured on TSMC's 3-nanometer process. The chip is reportedly aimed at competing with AMD's Strix Halo by delivering stronger graphics performance in high-end laptops.\nOne notable feature is memory bandwidth. The design is said to support up to 16 channels of LPDDR6 memory, a move intended to avoid bottlenecks that have limited graphics performance in competing processors.\nThe leak appears to offer the first real glimpse of what Intel and Nvidia's $5 billion partnership could produce. While Intel says it remains committed to its own Arc graphics roadmap, Serpent Lake points to deeper collaboration between the two companies, with a potential launch in late 2025 or early 2026.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "01:37:07",
      "Source": "GuruFocus.com",
      "Title": "Raymond James Sees Potential China Upside for Nvidia and AMD",
      "URL": "https://finance.yahoo.com/news/raymond-james-sees-potential-china-173707739.html",
      "Content": "Raymond James Sees Potential China Upside for Nvidia and AMD\n\nMoz Farooque ACCA\nWed, December 24, 2025 at 9:37 AM PST 1 min read\n\nIn this article: NVDA\n\nAMD\n\nThis article first appeared on GuruFocus .\nRaymond James analysts say that Nvidia ( NVDA , Financials ) and AMD ( AMD , Financials ) might experience small gains related to China, even if there is still uncertainty over trade policies and export limits .In a best-case scenario, the company thinks that AMD might make an extra $500 million to $800 million in sales from demand in China. Nvidia might also gain, although it's tough to say how much because of the rules that are still in place.Raymond James said that the scenario is still changing and that there are a lot of moving factors that make it hard to forecast what will happen. But if limitations are eased or policies are made clearer, Chinese buyers may finally be able to buy what they want.The essential point for investors is that even though everyone knows about the hazards of investing in China, things may become better for both chipmakers.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "00:14:00",
      "Source": "Zacks",
      "Title": "Intel Rides on Strong Gross Margin Expansion: Will it Sustain?",
      "URL": "https://finance.yahoo.com/news/intel-rides-strong-gross-margin-161400268.html",
      "Content": "Intel Rides on Strong Gross Margin Expansion: Will it Sustain?\n\nZacks Equity Research\nWed, December 24, 2025 at 8:14 AM PST 2 min read\n\nIn this article: INTC\n\nAMD\n\nNVDA\n\nASUUY\n\n2353.TW\n\nIntel Corporation INTC reported a non-GAAP gross profit of $5.45 billion during the third quarter of 2025, up from $2.39 billion a year ago. Non-GAAP operating margin improves to 40% from 18% a year ago. The figure exceeded management guidance by 4%. The uptick was driven by multiple factors such as higher revenues, a favorable product mix and lower inventory reserves.\n\nIt is witnessing solid traction in the Client Computing Group. In the third quarter, the company reported revenues of $8.53 billion from this segment, up from $8.16 billion in the year-ago quarter. A rebounding PC market backed by growing adoption of Windows 11 PCs is a major growth driver.\n\nMoreover, it has also gained solid market traction in the growing AI PC market. Major PC manufacturers such as HP, Dell, ASUS, Acer and Samsung are collaborating with Intel to develop next-gen AI PCs. This is driving growth in the Client Computing Group and boosting gross margin.\n\nIntel has made significant developments in its cost discipline initiatives and streamlined its portfolio to enhance efficiency across its operations. In the third quarter, the company’s cost of sales decreased to $8.43 billion, down from $11.28 billion in the year-ago quarter.\n\nHow Are Competitors Faring? Intel faces competition from Advanced Micro Devices AMD and NVIDIA Corporation NVDA in the semiconductor space. In the third quarter, AMD reported a non-GAAP gross profit of $4.99 billion, up from $3.65 billion. Non-GAAP gross margin was 54%, up 40 basis points year over year, while it improved from 43.3% reported in Q2. Revenue growth and a healthy product mix are propelling the gross margin.\n\nNVIDIA reported a Non-GAAP gross profit of $41.9 billion, up from $26.3 billion a year ago, with respective margins of 73.6% and 75%. The ongoing transition from offering Hopper HGX systems to Blackwell full-scale data center solutions is affecting gross margin. Sequentially, NVIDIA’s non-GAAP gross margin improved 90 basis points as Blackwell ramped with an improved mix and cost structure.\n\nINTC’s Price Performance, Valuation and Estimates Intel has rallied 78.2% over the past year compared with the industry’s growth of 28.5%.\n\nImage Source: Zacks Investment Research\nGoing by the price/book ratio, the company's shares currently trade at 1.48 book value, lower than 32.65 of the industry average.\n\nImage Source: Zacks Investment Research\nEarnings estimates for 2025 have increased 13.33% to 34 cents, while those for 2026 have declined 9.38% to 58 cents over the past 58 days.\n\nImage Source: Zacks Investment Research\n\nStory Continues\nIntel stock currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "22:42:00",
      "Source": "Zacks",
      "Title": "The Zacks Analyst Blog Highlights NVIDIA, Advanced Micro Devices, Intel, Micron Technology and BigBear.ai",
      "URL": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-nvidia-144200337.html",
      "Content": "The Zacks Analyst Blog Highlights NVIDIA, Advanced Micro Devices, Intel, Micron Technology and BigBear.ai\n\nZacks Equity Research\nWed, December 24, 2025 at 6:42 AM PST 5 min read\n\nIn this article: NVDA\n\nAMD\n\nINTC\n\nBBAI\n\nMU\n\nFor Immediate Release Chicago, IL &ndash; December 24, 2025 &ndash; Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: NVIDIA Corp. NVDA, Advanced Micro Devices, Inc. AMD, Intel Corp. INTC, Micron Technology, Inc. MU and BigBear.ai Holdings, Inc. BBAI.\n\nHere are highlights from Tuesday&rsquo;s Analyst Blog:\nForget NVIDIA: 2 AI Stocks Crushing It in 2025 with More Upside Ahead Shares of the most sought-after tech stock on Wall Street, NVIDIA Corp. , have surged 36.6% this year amid the artificial intelligence (AI) boom. Ongoing demand for NVIDIA's CUDA software platform, along with its competitive advantage in the AI hardware market, fueled growth. Demand for NVIDIA's Blackwell chips remains strong, and the company plans to ship H200 AI chips to China ahead of the Lunar New Year holiday.\n\nHowever, escalating U.S.-China trade tensions remain a risk and could pose a meaningful threat to NVIDIA's future growth trajectory. NVIDIA also faces intensifying competition from rivals, including Advanced Micro Devices, Inc . and Intel Corp. , as data center capital expenditures continue to rise.\nTherefore, investors may look beyond NVIDIA at stocks that have outperformed it this year and still offer upside as the AI boom continues. Notable among them are Micron Technology, Inc . and BigBear.ai Holdings, Inc . whose shares have gained 228.8% and 43.6%, respectively, this year. Let's take a closer look at why these stocks are compelling buys.\nReasons to Be Bullish on Micron Strong demand for Micron's high-bandwidth memory (HBM) chips is expected to help the company deliver strong quarterly results. These chips have the inherent capacity to reduce power consumption and process large volumes of data. With AI infrastructure rapidly expanding, demand for HBM chips has accelerated.\n\nBanking on rising AI-led demand for HBM chips, Micron expects its revenues for the second quarter of fiscal 2026 to come in between $18.3 billion and $19.1 billion. The company reported revenues of $13.64 billion for the fiscal first quarter, up 56.8% year over year, according to investors.micron.com. Analysts had projected revenues of around $12.88 billion.\nMicron expects earnings per share (EPS) of $8.22 to $8.62 for the fiscal second quarter, with its cloud memory business unit expected to perform particularly well. Micron's expected earnings growth rate for the next year is a solid 23.5%.\n\nStory Continues\nReasons to Be Bullish on BigBear.ai BigBear.ai's shares were adversely impacted at the beginning of the year due to the Trump administration's move to curb federal spending. Reduced funding may have affected BigBear.ai's sales, but its top-line performance is expected to improve going forward, supported by the definitive $250 million agreement to acquire Ask Sage.\n\nAsk Sage is a fast-growing generative AI platform that has seen broad adoption, with users including the U.S. Space Force and the Defense Health Agency. It is designed for secure AI deployment in restricted fields such as defense and national security, according to ir.bigbear.ai. Ask Sage serves 100,000 users across 16,000 government teams, and with its acquisition, BigBear.ai expects full-year sales to reach $125 million to $140 million.\nMoreover, Trump's \"big, beautiful bill\" could drive future growth for BigBear.ai, while the company's robust cash position provides ample resources to support its expansion. The company reached a significant milestone toward profitability in the third quarter, and its expected earnings growth rate for the next year is a stellar 73.1%.\n\nWhile BigBear.ai has a Zacks Rank #2 (Buy), Micron sports a Zacks Rank #1 (Strong Buy). You can see the complete list of today's Zacks Rank #1 stocks here.\nWhy Haven't You Looked at Zacks' Top Stocks?\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss . This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nMicron Technology, Inc. (MU) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nBigBear.ai Holdings, Inc. (BBAI) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "19:55:00",
      "Source": "Barrons.com",
      "Title": "S&P 500 Record Sets Up a Santa Rally. This Could Be the Stock Market’s Scrooge and 4 Other Things to Know Today.",
      "URL": "https://finance.yahoo.com/m/3be575b5-eae7-3e5c-9fc9-48f7e1b8f8ac/s%26p-500-record-sets-up-a.html",
      "Content": "S&P 500 Record Sets Up a Santa Rally. This Could Be the Stock Market’s Scrooge and 4 Other Things to Know Today.\n\nBarrons.com\nWed, December 24, 2025 at 3:55 AM PST\n\nIn this article: NVDA\n\nCRWD\n\nWBD\n\nNFLX\n\nAMD\n\nA hot economy and cooling jobs leave the Fed in a bind, Alibaba shows China may be the next frontier for Nvidia and AMD, more news to start your day.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "19:37:25",
      "Source": "Simply Wall St.",
      "Title": "AI Chips Today - EdgeMode Secures Power for Major AI Data Center Expansion",
      "URL": "https://finance.yahoo.com/news/ai-chips-today-edgemode-secures-113725046.html",
      "Content": "AI Chips Today - EdgeMode Secures Power for Major AI Data Center Expansion\n\nSimply Wall St\nWed, December 24, 2025 at 3:37 AM PST 1 min read\n\nIn this article: EDGM\n\nMU\n\nAMD\n\nNVDA\n\nEdgeMode Inc., in partnership with Blackberry Alternative Investment Fund, has reached a pivotal milestone in the development of Europe's largest AI data center pipeline by securing the necessary power supply for their ambitious project in Spain. This development advances five campus-style AI and high-performance computing data centers with a combined capacity of over 1.5 GW of IT power. In addition to power, land rights, dark fiber connectivity, and construction permits have been secured, reflecting significant progress in realizing this large-scale digital infrastructure project. The milestone allows the joint venture to transition discussions from potential capacity to scalable, deliverable solutions in the rapidly evolving AI infrastructure landscape.\n\nIn other trading, Nanya Technology was trading firmly up 6.8% and finishing the session at NT$188.50, close to the 52-week high. In the meantime, MetaX Integrated Circuits (Shanghai) lagged, down 7.0% to end the day at CN¥620.66, near its 52-week low.\nNanya Technology's self-developed 1B semiconductor and advanced 10-nanometer processes are expected to enhance profitability in the evolving AI market. Click here to explore Nanya Technology's growth narrative and market strategy.\nDon't miss our 'Market Insights' article on AI companies flooding bond markets to fuel growth, offering vital investor implications.\nBest AI Chip Stocks NVIDIA ended the day at $189.21 up 3%.\nAdvanced Micro Devices settled with no change at, $214.90.\nMicron Technology closed at $276.27 down 0.1%, not far from its 52-week high.\nTurning Ideas Into Actions Unlock more gems! Our AI Chip Stocks screener has unearthed 75 more companies like Teradyne , Lam Research and NXP Semiconductors for you to explore.\nWant Some Alternatives? Uncover 12 companies that survived and thrived after COVID and have the right ingredients to survive Trump's tariffs.\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nSources:\nSimply Wall St\n\"EdgeMode Secure Strategic Power Milestone for Europe’s Largest AI Data Center Pipeline\" from EdgeMode Inc. on GlobeNewswire (published 22 December 2025)\n\nStory Continues\nCompanies discussed in this article include TWSE:2408 NasdaqGS:NVDA NasdaqGS:AMD NasdaqGS:MU and SHSE:688802.\nThis article was originally published by Simply Wall St .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "19:20:00",
      "Source": "Motley Fool",
      "Title": "Prediction: These 3 Artificial Intelligence (AI) Stocks Will Be Big Winners Again in 2026",
      "URL": "https://finance.yahoo.com/m/0b954eed-e4d9-39b2-b35e-1eb8792e4ded/prediction%3A-these-3.html",
      "Content": "Prediction: These 3 Artificial Intelligence (AI) Stocks Will Be Big Winners Again in 2026\n\nBeth McKenna, The Motley Fool\nWed, December 24, 2025 at 3:20 AM PST 5 min read\n\nIn this article: NVDA\n\nTSM\n\nAVGO\n\n^GSPC\n\nOPAI.PVT\n\nKey Points Nvidia stock is a top buy for tech investors, as the company's AI-enabling GPUs are largely powering the AI revolution.\nBroadcom stock is a top buy, thanks largely to the strong demand for the company's custom AI chips.\nTaiwan Semiconductor Manufacturing stock is a top buy because the world's largest chip foundry is profiting significantly from the powerful demand for AI chips, both GPUs and custom chips.\n10 stocks we like better than Nvidia ›\n\nArtificial intelligence (AI) stocks, as a group, have been among the best-performing groups in 2025, just as they were in 2024.\nThree AI stocks that were big winners in 2025, as of Dec. 23, and that I believe will be big winners again in 2026, are Nvidia (NASDAQ: NVDA) , Broadcom (NASDAQ: AVGO) , and Taiwan Semiconductor Manufacturing , or TSM (NYSE: TSM) .\n3 Top AI stocks to buy for 2026 Stocks are listed in order of 5-year return.\nCompany\nMarket Cap\nForward P/E\nWall Street's Estimated Annualized 5-Year EPS Growth\nYear-to-Date 2025 Stock Return\n5-Year Stock Return\nNvidia\n$4.8 trillion\n24.0\n48.5%\n40.9%\n1,359%\nBroadcom\n$1.7 trillion\n34.4\n35.9%\n52%\n813%\nTaiwan Semiconductor Manufacturing\n$1.2 trillion\n24.5\n30.4%\n52.4%\n211%\nS&P 500 Index\n--\n--\n--\n19%\n102%\n\nData sources: Yahoo! Finance and YCharts. P/E = price-to-earnings ratio . EPS = earnings per share. Data as of Dec. 23, 2025.\nNvidia: The dominant maker of AI chips and related tech Nvidia's graphics processing units (GPUs), its flagship semiconductors, are considered the gold standard for training artificial intelligence (AI) models and deploying AI applications.\nThe company's data center platform had been performing well for quite some time. But demand began skyrocketing for its AI-enabling products -- its GPUs and high-performance networking products -- soon after OpenAI released its ChatGPT chatbot in late 2022. This event demonstrated to company leaders and the general public the phenomenal capabilities of generative AI.\n\nIn late October at the company's GTC (GPU Technology Conference) in Washington, D.C., CEO Jensen Huang said that management has \"visibility\" into $500 billion of demand for its key data center technology over the next five quarters . This demand of $100 billion per quarter, on average, is truly mind-blowing. As context, in its fiscal third quarter (ended late October), Nvidia's total revenue was $57.0 billion, of which $51.2 billion was from the data center platform.\nBroadcom: The leading maker of custom AI chips Broadcom develops semiconductors for various end markets and also develops infrastructure software.\n\nStory Continues\nThe company's robust growth is being drven by strong demand for its custom AI-enabling application-specific integrated circuits (ASICs) and Ethernet networking products, both for data centers. Its acquisition of software maker VMware in late 2023 is proving to be a shrewd move, as this business is also growing nicely.\n\nBroadcom is the top partner for big tech companies seeking custom ASICs. As the name suggests, these chips are designed for specific applications. These include internal uses and, in some cases, for availability in their cloud computing services. By contrast, Nvidia's GPUs can be considered more general-purpose AI chips. There is a need for both GPUs and ASICs, so investors shouldn't be concerned that one of these types of chips will fully win out over the other.\nTSM: The world's largest chip foundry Taiwan Semiconductor Manufacturing is the world's largest chip foundry. That means it produces chips of various types for companies that contract out all or some of the manufacturing of chips they design.\nTSM is the largest producer of AI chips worldwide, which has led to significant financial growth in recent years, driven by surging demand for these chips.\n\nTSM's customers include nearly every major chip company, such as Nvidia, Broadcom, and Advanced Micro Devices (AMD), which is Nvidia's main rival in the AI-enabling GPU market. Moreover, it also manufactures chips, including AI chips, for major tech companies that have designed their own chips. This includes Apple , widely considered the company's largest customer, though some Wall Street analysts expect Nvidia to soon overtake Apple as TSM's top customer.\nAn added benefit for some investors is that TSM pays a decent dividend for a tech company. The dividend yield was 1.13%, as of the close of the market on Dec. 23.\nShould you buy stock in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $502,783 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,126,057 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 975 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nBeth McKenna has positions in Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Apple, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nPrediction: These 3 Artificial Intelligence (AI) Stocks Will Be Big Winners Again in 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "19:18:08",
      "Source": "GuruFocus.com",
      "Title": "Nvidia and AMD Eye China AI Chip Boost",
      "URL": "https://finance.yahoo.com/news/nvidia-amd-eye-china-ai-111808308.html",
      "Content": "Nvidia and AMD Eye China AI Chip Boost\n\nFaizan Farooque\nWed, December 24, 2025 at 3:18 AM PST 1 min read\n\nIn this article: NVDA\n\nAMD\n\nBABA\n\nThis article first appeared on GuruFocus .\nNvidia ( NVDA , Financials ) and Advanced Micro Devices ( AMD , Financials ) could see billions in new revenue if the U.S. allows renewed sales of AI chips to China , according to Raymond James.\nWarning! GuruFocus has detected 4 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\n\nThe firm said Nvidia stands to benefit the most, with potential revenue gains of $7 billion to $12.5 billion in 2026 from limited GPU shipments to Chinese cloud and internet companies.\nAMD's upside is smaller. Analysts estimate $500 million to $800 million in additional sales, or about $0.10 to $0.20 in non-GAAP EPS, if orders from firms such as Alibaba are approved.\nEven with new approvals, Nvidia's China exposure remains modest compared with its U.S. data center business, which continues to drive most of its growth. Both chipmakers hold Strong Buy ratings from Wall Street, though analysts see slightly higher upside for Nvidia shares.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "19:05:28",
      "Source": "Reuters",
      "Title": "How a Silicon Valley dealmaker charmed Trump and gave Intel a lifeline",
      "URL": "https://finance.yahoo.com/news/silicon-valley-dealmaker-charmed-trump-110528784.html",
      "Content": "How a Silicon Valley dealmaker charmed Trump and gave Intel a lifeline\n\nMax A. Cherney and Jeffrey Dastin\nWed, December 24, 2025 at 3:05 AM PST 11 min read\n\nIn this article: INTC\n\nPLTR\n\nNVDA\n\nAMD\n\nOPAI.PVT\n\nBy Max A. Cherney and Jeffrey Dastin\nSAN FRANCISCO, Dec 24 (Reuters) - It was a Thursday before dawn in Silicon Valley when Intel CEO Lip-Bu Tan found himself under attack by the president of the United States.\n“The CEO of INTEL is highly CONFLICTED and must resign, immediately,” U.S. President Donald Trump wrote on his Truth Social platform at 4:39 AM Pacific Time on August 7. Before he was Intel CEO, Tan had been a prolific investor in companies in China.\n\nTrump and Tan had not met. While technology leaders from Nvidia , AMD, OpenAI , Amazon, Google and Palantir had all recently traveled to see Trump, the head of America’s most storied chipmaker had not spent time with the president since joining Intel in March.\nPolitics was not Tan’s top priority. It had been more than 20 years since Tan, 66, had donated to a presidential election campaign. Though ​he spoke with a handful of U.S. government leaders, including Commerce Secretary Howard Lutnick in April, the Intel CEO did not fill the company’s top policy job in Washington for months after its prior holder, a Democrat, resigned.\nAlmost immediately after Trump’s attack, Intel scrambled to lock down time with the president, two people with knowledge of the situation said. That culminated in the most pivotal, roughly 40-minute meeting of Tan’s decades-long career.\n\nPreviously unreported details about Tan and Intel show ‌how a man Trump had accused of supporting China’s interests came away from the meeting with a commitment from the U.S. government to invest billions of dollars for a nearly 10% stake in the company.\nThe deal gave Intel a too-strategic-to-fail aura and opened doors to potential partners who might want to win the president’s favor. It also may pave the way for the government to take more equity stakes in businesses the administration deems strategic, in what some investors previously described to Reuters as ushering in a new era of U.S. industrial policy.\nIntel’s share price has risen around 80% since Tan’s appointment, outpacing the percentage gains of the ‌S&P 500 and Nvidia in that time.\n\nReuters spoke with around 20 people who are current and former Intel employees, government advisers, and Tan’s industry contacts. Some of them questioned whether Tan has the technical acumen to restore Intel’s lead in chip manufacturing and find a winning artificial intelligence strategy, even as his skills as a dealmaker served him well in the Oval Office and elsewhere.\nThough Intel’s chips powered some of the first mass-produced PCs, years of dysfunction had allowed foreign competitors such as TSMC to eclipse Intel in high-end chip production.\n\nStory Continues\nIn statements, an Intel spokesperson said Tan needed no persuading to engage with the Trump administration. Early on, he elevated government affairs, among other functions, to report to him. Intel announced in December that a Trump economic adviser would helm the unit.\n“Lip-Bu Tan has a long, and well-established history of engagement in Washington, both before and after joining Intel,” the spokesperson said. Intel declined to make Tan available for an interview.\n\nA White House spokesperson said President Trump was using his executive power to get “the best bargain for the American taxpayer” and safeguard U.S. security.\n“The Administration’s historic deal with Intel is one of many initiatives to reshore semiconductor and other critical manufacturing back to the United States,” the White House spokesperson said.\n40 MINUTES IN THE OVAL OFFICE\nBefore heading into the White House, Tan called on his own allies who had forged relationships with the president, including Microsoft CEO Satya Nadella and Nvidia CEO Jensen Huang, to vouch for him, said two people familiar with the discussions.\nTan “spoke, as he does often, with confidantes who would have relevant insight and perspective ahead of his meeting with President Trump,” the Intel spokesperson said. Nvidia and Microsoft did ⁠not comment for this story.\n\nPrior to the meeting, Tan strategized with his advisors on how to convince Trump he was an American patriot by discussing his personal story and his ‌commitment to the United States, the two people said. He also prepared to discuss his China holdings, the people said.\nTan has made some 600 investments in China, some linked to the country’s military, according to Reuters reporting. Those connections to China are what ultimately landed him in the crosshairs of the president. Two of Tan's investment firms -- Walden International and Walden Catalyst -- did not answer requests for comment. A third, Celesta Capital, said it had made one China investment that it exited in 2020.\nHis dealmaking acumen, Celesta Capital said, is a key reason Tan “is so well suited to lead Intel’s current moment.”\n\nJust two cabinet members joined the meeting between Trump and Tan in the Oval Office: Lutnick and Treasury Secretary Scott Bessent, one of the people said. Trump questioned the Intel CEO about how he planned to ‍turn the company around, the person said.\nTan had already told Lutnick in a prior meeting that he did not want billions in handouts that the U.S. owed Intel as part of the CHIPS Act, the Commerce Secretary said in a video on X in August. Neither Lutnick nor Tan said why. The grant money had been offered to companies under the 2022 CHIPS Act in exchange for reviving domestic manufacturing so the U.S. could reduce its reliance on foreign semiconductor production.\nThe administration of former President Joe Biden had announced dozens of these awards to various chip-related companies.\n\nSo when Trump proposed that the U.S. receive equity in exchange for giving Intel more CHIPS Act money - an idea that two sources said Lutnick had talked about for weeks with government staff - Tan struck a deal. Intel declined to comment on the specifics of the private conversation, but Lutnick later said in the video that equity made the exchange “fair.”\nThe deal gave Intel a $5.7 billion cash infusion and set up the U.S. government to be its largest shareholder. After the initial meeting, Tan pledged to “make Intel great again” in the video that Lutnick posted on social media, with the caption, “The Art ​of the Deal: Intel.”\nWithin weeks of his White House coup, Tan finalized a partnership with Nvidia, securing $5 billion from its CEO Huang who called Tan his “long-time friend.” Unlike Intel, known for manufacturing chips called central processing units, Nvidia designs the world’s top chips for AI.\n\nTrump celebrated the deal on social media, posting an AI-generated image of himself staring at a chart of Intel’s stock and showing how the value of the U.S. stake had risen by 50% after Nvidia’s investment.\nINTEL’S VENTURE CAPITALIST CEO\nBorn in Malaysia ‌to a Chinese-language journalist and a teacher, Tan started out in the hard sciences and had plans to become a nuclear engineer, but he ultimately went to business school and in or around 1983 got his first job in venture capital in California.\nDuring his career, Tan established himself as a man with a golden touch with startups that successfully were sold to other companies or went public. He amassed an estimated personal fortune well above $500 million.\nTan’s dealmaking savvy is helping Intel only to a point, three people with knowledge of the company said. For instance, Tan’s bid to buy SambaNova was the subject of internal debate given how the startup makes application-specific AI chips while the market favored general-purpose ones.\n\nAdditionally, these people said, chipmaking requires more engineering expertise than a typical tech business. Factories that make advanced chips rely on tools so precise they could pinpoint a U.S. quarter-dollar coin as far away as the moon. Some of its most successful executives, like Nvidia’s Huang, are electrical engineers by training.\nStill, some Wall Street analysts say Tan is an excellent choice for Intel CEO, with decades of chip-industry experience and a track record of delivering returns to shareholders.\n“Lip-Bu is deeply involved in technical decisions, including product roadmaps,” the Intel spokesperson said. “These are technical, hands-on changes that highlight the depth of his technical leadership.”\nTan was also “keenly aware” of Intel’s challenges when he took the CEO job, the Intel spokesperson said, because he had served on its board from 2022 until 2024.\n\nBut once inside Intel – which had around 100,000 staff when he joined - the complexity of the chip manufacturer was unlike anything Tan had faced as a CEO before, said two of the sources, who worked at Intel.\nThe company was bleeding cash to build factories for chip manufacturing, an effort begun under his predecessor Pat Gelsinger, and it needed an estimated $20 billion or more to have a shot at winning customers.\nTan called on top executives in his network and asked how they did things, one of the sources said. He likewise called on big customers – cloud providers like Amazon and Google – and asked what they wanted, said two people familiar ⁠with the matter.\nTan shook up Intel’s management team, similar to when he led the chip design company Cadence. There, he had worked with a deputy to draft a list of executives to fire, a person familiar with his Cadence days said. Cadence declined to comment.\n\nTan is cutting deeper still: ​laying off around 15% of Intel employees per securities filings, many of them managers.\nHe bypassed middle managers to have technical talent brief him directly, two of the people said. Tan named Intel engineering veteran Pushkar Ranade as his chief of staff and in December elevated him to interim chief technology officer.\nDespite the ​intensity of his task at Intel, Tan has split his time with his myriad other commitments, which include his investment firms. When evaluating potential deals for Intel’s venture arm, Tan would also ask his investment firms for their opinion, one of the former Intel employees said.\nAn alleged conflict of interest with his venture portfolio prompted Intel’s board to push back on Tan over an acquisition this year, Reuters reported this month.\n\nHis Intel employment requires that he spend “such time as is necessary” to perform his duties as CEO, a change from the prior Intel chief’s contract that had required “full business efforts and time to Intel.”\nCelesta Capital said Tan's time commitment to the firm is now minimal, and its team has received no request to review deals for Intel Capital. Walden International and Walden Catalyst did not answer requests for comment.\nIntel said Tan ‍is working daily on transforming the company and “acted decisively” to flatten its structure, adding he is a “highly engaged CEO” who is “helping to restore ⁠speed, accountability, and create an engineering-centric, customer-focused culture.”\nA ‘LIFELINE’ FOR INTEL\nSo far, the U.S. investment has been a catalyst for Intel. Its Corporate Vice President John Pitzer said in a September interview that President Trump had just hosted top technology CEOs for dinner to discuss AI, and that their companies were potential Intel customers.\n\nThe deal was a “lifeline” for Intel, said technology lobbyist and Chamber of Progress CEO Adam Kovacevich. Without it, Intel could have been out a CEO if it had succumbed to Trump’s pressure, he said.\nThe same week as the White House deal, Intel announced a $2 billion investment from Masayoshi Son’s SoftBank, where Tan once was a board member.\nLutnick, who previously had no vested interest in phone calls to his office from business or government leaders about Intel’s manufacturing, now has an incentive to jump at them, said one of the sources, who is familiar with the administration. Lutnick has indicated that Americans have skin in the game for Intel ⁠to land a foundry deal that could bolster U.S. chip production, the person said.\nForeign chip manufacturers operating in the U.S. are concerned that government officials will tip the scales for customers to manufacture with Intel instead of with them, according to two sources familiar with these worries.\n\nA Commerce Department official said the U.S. stake gives Intel a shot at success but not a leg up, and Intel is not “too strategic to fail.” The official said further that Secretary Lutnick talks to all parties rather than prioritizing calls for Intel’s sake.\nWhile Intel is picking up steam on the deals front, its manufacturing unit has struggled to produce ‌quality in-house chips.\nNvidia recently tested out whether it would manufacture its chips using Intel’s production process known as 18A but stopped moving forward, two people familiar with the matter said. Nvidia did not answer a request for comment.\nAn Intel spokesperson said the company’s 18A manufacturing technologies that make advanced chips are “progressing well,” and it “continues to see strong interest” for its next-generation production process, called 14A, which is expected to produce chips that are more ‌powerful and efficient.\nNvidia made no commitment to manufacture with Intel in September when investing $5 billion in the chipmaker. “Right now we are focused on collaborations,” Tan told reporters while announcing the deal with Nvidia’s Huang.\n(Reporting by Max A. Cherney and Jeffrey Dastin in San Francisco)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "04:05:00",
      "Source": "Zacks",
      "Title": "Forget NVDA: 2 AI Stocks Crushing it in 2025 With More Upside Ahead",
      "URL": "https://finance.yahoo.com/news/forget-nvda-2-ai-stocks-200500174.html",
      "Content": "Forget NVDA: 2 AI Stocks Crushing it in 2025 With More Upside Ahead\n\nTirthankar Chakraborty\nTue, December 23, 2025 at 12:05 PM PST 3 min read\n\nIn this article: NVDA\n\nAMD\n\nINTC\n\nMU\n\nBBAI\n\nShares of the most sought-after tech stock on Wall Street, NVIDIA Corporation NVDA, have surged 36.6% this year amid the artificial intelligence (AI) boom. Ongoing demand for NVIDIA’s CUDA software platform, along with its competitive advantage in the AI hardware market, fueled growth. Demand for NVIDIA’s Blackwell chips remains strong, and the company plans to ship H200 AI chips to China ahead of the Lunar New Year holiday.\n\nHowever, escalating U.S.-China trade tensions remain a risk and could pose a meaningful threat to NVIDIA’s future growth trajectory. NVIDIA also faces intensifying competition from rivals, including Advanced Micro Devices, Inc . AMD and Intel Corporation INTC, as data center capital expenditures continue to rise.\nTherefore, investors may look beyond NVIDIA at stocks that have outperformed it this year and still offer upside as the AI boom continues. Notable among them are Micron Technology, Inc . MU and BigBear.ai Holdings, Inc . BBAI, whose shares have gained 228.8% and 43.6%, respectively, this year. Let’s take a closer look at why these stocks are compelling buys.\n\nImage Source: Zacks Investment Research\nReasons to Be Bullish on Micron Strong demand for Micron’s high-bandwidth memory (HBM) chips is expected to help the company deliver strong quarterly results. These chips have the inherent capacity to reduce power consumption and process large volumes of data. With AI infrastructure rapidly expanding, demand for HBM chips has accelerated.\n\nBanking on rising AI-led demand for HBM chips, Micron expects its revenues for the second quarter of fiscal 2026 to come in between $18.3 billion and $19.1 billion. The company reported revenues of $13.64 billion for the fiscal first quarter, up 56.8% year over year, according to investors.micron.com. Analysts had projected revenues of around $12.88 billion.\nMicron expects earnings per share (EPS) of $8.22 to $8.62 for the fiscal second quarter, with its cloud memory business unit expected to perform particularly well. Micron’s expected earnings growth rate for the next year is a solid 23.5%.\nReasons to Be Bullish on BigBear.ai BigBear.ai’s shares were adversely impacted at the beginning of the year due to the Trump administration’s move to curb federal spending. Reduced funding may have affected BigBear.ai’s sales, but its top-line performance is expected to improve going forward, supported by the definitive $250 million agreement to acquire Ask Sage.\n\nAsk Sage is a fast-growing generative AI platform that has seen broad adoption, with users including the U.S. Space Force and the Defense Health Agency. It is designed for secure AI deployment in restricted fields such as defense and national security, according to ir.bigbear.ai. Ask Sage serves 100,000 users across 16,000 government teams, and with its acquisition, BigBear.ai expects full-year sales to reach $125 million to $140 million.\n\nStory Continues\nMoreover, Trump’s “big, beautiful bill” could drive future growth for BigBear.ai, while the company’s robust cash position provides ample resources to support its expansion. The company reached a significant milestone toward profitability in the third quarter, and its expected earnings growth rate for the next year is a stellar 73.1%.\n\nWhile BigBear.ai has a Zacks Rank #2 (Buy), Micron sports a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks Rank #1 stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nMicron Technology, Inc. (MU) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nBigBear.ai Holdings, Inc. (BBAI) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "03:26:52",
      "Source": "24/7 Wall St.",
      "Title": "What Is One of the Best Chip Stocks to Hold for the Next 10 Years?",
      "URL": "https://finance.yahoo.com/m/f401a88d-c2b6-397e-ae69-2df233ed9f72/what-is-one-of-the-best-chip.html",
      "Content": "What Is One of the Best Chip Stocks to Hold for the Next 10 Years?\n\nDavid Moadel\nTue, December 23, 2025 at 11:26 AM PST 5 min read\n\nIn this article: AMD\n\nBABAF\n\nBABA\n\nNVDA\n\nQuick Read Alibaba (BABA) is considering purchasing 40,000 to 50,000 of Advanced Micro Devices’ (AMD) MI308 AI accelerators.\nAMD stock looks compelling as Advanced Micro Devices recently demonstrated 35.6% year-over-year revenue growth and 61.2% income growth.\nIf you’re thinking about retiring or know someone who is, there are three quick questions causing many Americans to realize they can retire earlier than expected. take 5 minutes to learn more here\n\nOver the next decade, you'll surely want to own at least one artificial intelligence (AI) chip stock. You might assume that all you need is NVIDIA ( NASDAQ:NVDA ) stock and nothing else. However, even though NVIDIA is the market's darling, your best pick could actually be Advanced Micro Devices ( NASDAQ:AMD ) stock.\nEven though it's a giant company, Advanced Micro Devices is an underdog in some respects. Unlike NVIDIA, Advanced Micro Devices isn't a member of the Magnificent Seven group of highly favored U.S. mega-cap stocks.\nThis isn't to suggest that buying and holding AMD stock for 10 years is a risk-free investment. Right now, we'll tackle the red flags that must be acknowledged for long-term Advanced Micro Devices shareholders. In the end, though, you may be open to a buy-and-hold share position as Advanced Micro Devices is a chipmaking challenger with hyper-scaling potential.\n\nIssues With AMD Stock One possible deal-breaker for income investors is that AMD stock doesn't pay a dividend. Consequently, you'll need the share price to rise in order to make a profit.\nMeanwhile, value investors might take issue with Advanced Micro Devices' valuation. Specifically, the company has a trailing 12-month price-to-earnings (P/E) ratio of around 113x .\n\nIn addition, AMD stock is already up 135% over the past five years. Given the triple-digit P/E ratio and the stock's price action, some value investors may not be willing to take a chance on Advanced Micro Devices.\nThose are valid objections, but to be fair, Advanced Micro Devices stock just pulled back nearly 20% from $167. Since the stock has a good track record of recovering from drawdowns, there appears to be a dip-buying opportunity here.\nBesides, if Advanced Micro Devices is a robust revenue and earnings grower, then the high P/E ratio don't have to be a deal-breaker. With that in mind, let's perform a thorough checkup on Advanced Micro Devices' financial health.\nBooming Sales, Zooming Profits Advanced Micro Devices' high P/E ratio and lack of a dividend are legitimate reasons to reduce your position size in AMD stock. Nevertheless, you'll probably leave a lot of money on the table if you don't own some shares of Advanced Micro Devices during the next 10 years.\n\nStory Continues\nAll in all, Advanced Micro Devices is an undeniable sales and income grower. To prove this point, we can observe the company's results from the quarter ended September 27, 2025.\nImpressively, Advanced Micro Devices' net revenue grew 35.6% year over year, from $6.819 billion in the year-earlier quarter to $9.246 billion. Nearly half of that revenue stemmed from Advanced Micro Devices' Data Center segment; this suggests that the company continues to benefit from AI-associated sales.\n\nTurning to the bottom-line results, Advanced Micro Devices' net income surged 61.2%, from $771 in the year-earlier quarter to $1.243 billion. Also during that time frame, the company's cash and cash equivalents increased 27%, from $3.787 billion to $4.808 billion. So evidently, Advanced Micro Devices remains a cash-rich chipmaker that's on a powerful growth trajectory.\nMaking Headway in China While U.S. chip sales are crucial to Advanced Micro Devices' business model, it definitely appears that the company is making headway in China's chip market. To be more specific, Alibaba ( NASDAQ:BABA ) is considering purchasing 40,000 to 50,000 of Advanced Micro Devices' MI308 AI accelerators.\n\nThis is important because investors need to think globally, not just locally, over the next 10 years. China is a major chip market, and Advanced Micro Devices has a long-term growth opportunity there.\nAdvanced Micro Devices made a savvy move in designing its MI308 chips to be compatible with export restrictions. Furthermore, the company has secured export licenses for these chips and is prepared to pay a 15% fee to the U.S. on approved sales in China.\nAlso, it's a positive sign that Advanced Micro Devices CEO Lisa Su recently met with Chinese Commerce ​Minister Wang ‌Wentao in Beijing. They \"exchanged views on the company's business ⁠development in ​China and ​strengthening cooperation with China,\" according to the ‍ministry.\n\nSure, NVIDIA is also making headway into China's chip market. At the same time, however, NVDA stock may have already priced in the company's progress in this region.\nIn contrast, Advanced Micro Devices' growth story in China is still developing and the market needs time to recognize this. Give it a few years, and you should see AMD stock reflect strong chip sales in both the U.S. and China.\nGive AMD Stock a Chance In the final analysis, there's no need to overload your portfolio with AMD stock. Just holding a moderately sized share position for 10 years will, most likely, put you in a profitable position without undue risk.\nWhile Advanced Micro Devices doesn't pay a dividend and appears overvalued at first glance, I still encourage you to give the company a chance. If AI chip sales remain strong and Advanced Micro Devices keeps on growing its sales and profits, there's an attractive reward-to-risk profile here for buy-and-hold investors.\nThe New Report Shaking Up Retirement Plans You may think retirement is about picking the best stocks or ETFs, but you’d be wrong. Even great investments can be a liability in retirement. It’s a simple difference between accumulating vs distributing, and it makes all the difference.\nThe good news? After answering three quick questions many Americans are reworking their portfolios and finding they can retire earlier than expected. If you’re thinking about retiring or know someone who is, take 5 minutes to learn more here .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "02:29:42",
      "Source": "GuruFocus.com",
      "Title": "Nvidia, AMD Could See Billions in Revenue from Soaring China AI Demand in 2026",
      "URL": "https://finance.yahoo.com/news/nvidia-amd-could-see-billions-182942697.html",
      "Content": "Nvidia, AMD Could See Billions in Revenue from Soaring China AI Demand in 2026\n\nNauman Khan\nTue, December 23, 2025 at 10:29 AM PST 1 min read\n\nIn this article: NVDA\n\nAMD\n\nBABA\n\nThis article first appeared on GuruFocus .\nShares of Nvidia ( NASDAQ:NVDA ) and AMD ( NASDAQ:AMD ) inched up about 0.5% on Tuesday as analysts highlighted potential revenue growth from China.\nRaymond James said both companies could see moderate upside if recent U.S. export approvals lead to significant orders.\n\nWarning! GuruFocus has detected 5 Warning Signs with AMD.\nIs AMD fairly valued? Test your thesis with our free DCF calculator.\nAnalyst Simon Leopold wrote in a note to clients that AMD might generate $500 million to $800 million in additional revenue in 2026, translating to $0.10 to $0.20 in non-GAAP EPS.\nNvidia could see $7 billion to $12.5 billion in extra revenue, or $0.15 to $0.30 in non-GAAP EPS.\nEarlier this month, President Trump approved the sale of Nvidia's H200 GPUs to China. Reports also suggest Alibaba (BABA) could buy 40,000 to 50,000 of AMD's MI308 AI accelerators. Leopold estimated the potential Alibaba deal could generate around $675 million for AMD over several quarters.\nAnalysts cautioned that uncertainties remain, including regulatory approvals and geopolitical risks, which could affect the final outcome.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 63
}