{
  "stock_id": "AMD",
  "last_updated": "2025-12-17T14:25:13.148Z",
  "source": "Yahoo Finance Only",
  "news": [
    {
      "Date": "2025-12-17",
      "Time": "21:04:34",
      "Source": "Yahoo Finance",
      "Title": "OpenAI In Talks To Get $10 Billion Amazon Investment, Use Its Chips: The Information",
      "URL": "https://finance.yahoo.com/m/2726b9b8-789b-3d00-8ef3-494b9b80d8bf/openai-in-talks-to-get-%2410.html?.tsrc=rss",
      "Content": "OpenAI In Talks To Get $10 Billion Amazon Investment, Use Its Chips: The Information\n\nED CARSON\nWed, December 17, 2025 at 5:04 AM PST 1 min read\n\nIn this article: AMZN\n\nNVDA\n\nAVGO\n\nAMD\n\nORCL\n\nAmazon is in talks to invest at least $10 billion in OpenAI, which would use the e-commerce giant's in-house AI chips.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "21:00:00",
      "Source": "Yahoo Finance",
      "Title": "2025 in Review: South Korea's Leading AI Innovator Marks Breakout Year After U.S. Launch",
      "URL": "https://finance.yahoo.com/news/2025-review-south-koreas-leading-130000831.html?.tsrc=rss",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\n2025 in Review: South Korea's Leading AI Innovator Marks Breakout Year After U.S. Launch\n\nPR Newswire\nWed, December 17, 2025 at 5:00 AM PST 5 min read\n\nIn this article: AMD\n\nUpstage AI is Transforming the Insurance and Financial Services Industries as it Leads Fortune 500 Companies to Operational Transformation\nSAN JOSE, Calif. , Dec. 17, 2025 /PRNewswire/ -- Following its landmark debut in the U.S. market, Upstage AI, a global AI company, is celebrating a year of explosive growth and strategic accomplishments. Its intelligent solutions–Generative Intelligence (Solar LLM) and Document Intelligence for extraction on any document–are transforming workflows for some of the world's largest enterprises, optimizing repetitive tasks while preserving human oversight and complex decision making.\nUpstage raised $45 million earlier this year in a Series B bridge round, bringing total funding to $157 million, to expand its growth in the U.S. Notably, the AI company secured funding from Amazon Web Services (AWS) and AMD in August, becoming a minority investor in Upstage.\nSince the company's U.S. launch, Upstage landed on three CB Insights' industry lists, AI 100 , InsurTech 50 , and FinTech 100 , and showcased its leadership as subject matter experts at five major insurance industry events. The company has quickly established its presence in the InsurTech ecosystem with appearances at ITC Vegas, InsurTech Insights, and InsurTech NY. Additionally, Upstage's U.S. CEO, Kasey Roh, was a featured speaker at this year's AWS re:Invent Conference where she shared her insights on scaling real-world AI on a panel with AMD .\n\n\"Upstage's first year in North America has brought our transformative AI solutions to the U.S. insurance and financial services industries,\" said Kasey Roh, U.S. CEO of Upstage . \"Our technology is particularly advantageous for these legacy industries that still rely heavily on manual document processing. Upstage's superpower is that our technology hinges on human decision making, forging a symbiotic relationship between AI and people. This crucial distinction is what sets Upstage apart from other AI companies.\"\nUpstage's domain-specific models distinguish it from an industry flooded with newcomers, many of whom have yet to show tangible results. The company has spent half of the last decade building its proprietary model stack, giving them a distinct edge and headstart from companies modifying third-party or open-source foundation models.\n\nTheir technology's ability to turn any type of unstructured document into structured data is unique and essential for insurance companies handling large amounts of manual document processing. It adapts in real time while automatically flagging uncertain extractions while keeping humans in the loop. This feature is unique and critical, significantly reducing AI hallucinations that put companies at extreme risk. These human corrections are part of an automatic feedback loop for the model, learning from human validation to improve its accuracy over time. The technology provides companies with a zero-training, high-accuracy solution with no setup, templates, or retraining.\n\nStory Continues\nThe proof of the company's success is in the numbers, its technology has a 95%+ accuracy across complex document types and formats. Upstage has served Fortune 500 companies in Korea, including Samsung, and now provides their solutions in the U.S. to enterprise and mid-market companies processing millions of pages every day.\n\nWhat Upstage's customers have to say about the company\nfurther highlights its success:\n\"Once Upstage's solution was in our underwriters' hands, there was no taking it away. The tool landed at exactly the right moment—as our team was working to keep up with 30% volume growth without additional headcount. Our VP of Underwriting made it clear: she wasn't giving up the invoice extraction tool 'over her dead body.' Within days, all 18 underwriters were benefiting from the solution.\"\n— Steven Beauchem , VP of Digital Strategy at Amwins, a leading global specialty insurance distributor.\n\"We've been able to achieve 95%+ accuracy on data [extraction] as well as other unstructured data in the underwriting process. Before, it took our team 30 minutes to an hour to review an application [whereas] today it could take us less than 10 minutes. This has been extremely impactful to our ability to manage a larger volume of submissions without sacrificing the depth of our analysis or the nuance that we gain from that information.\"\n— Gabriel Mayer , Founder of Tricura Insurance Group, an InsurTech MGU focused on providing liability coverage and technology to Senior Living Communities across the US.\n\n\"We built the MVP using a random GitHub parser, DocuClipper, and ChatGPT just to make it work. When I discovered Upstage, we realized we could replace the entire patchwork with a single, clean API. That decision changed everything — faster results, higher accuracy, zero maintenance.\"\n— Michael Rodriguez , Founder, Best Option Co., a software development company that brings AI solutions to help small businesses streamline operations and drive revenue.\nUpstage AI is poised to make an even bigger impact in North America in the coming year as it continues to partner with top companies in the insurance and financial services industries. The company is expected to bridge the gap between AI and human interaction to transform operations for legacy carriers and startups alike.\n\nAbout Upstage\nUpstage is building the future of enterprise AI through domain-specific language models and intelligent tools designed for high-impact business use. With deep expertise in LLM development, document AI, and agentic workflows, the company enables regulated industries and global enterprises to unlock the full potential of generative AI — securely, efficiently, and at scale. For more information visit https://www.upstage.ai or contact them here .\nMedia Contact\nBlaire Swayze\nDirector of InsurTech Comms & PR\nT Palmer Agency\nblaire@tpalmeragency.com\nView original content to download multimedia: https://www.prnewswire.com/news-releases/2025-in-review-south-koreas-leading-ai-innovator-marks-breakout-year-after-us-launch-302644098.html\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "19:55:00",
      "Source": "Yahoo Finance",
      "Title": "Nvidia Stock Gains. This China Chip Company Jumps 700% as It Takes Aim at AI Leader.",
      "URL": "https://finance.yahoo.com/m/c8918d1e-b965-3ed0-a51c-bdab0cb06008/nvidia-stock-gains.-this.html?.tsrc=rss",
      "Content": "Nvidia Stock Gains. This China Chip Company Jumps 700% as It Takes Aim at AI Leader.\n\nAdam Clark\nWed, December 17, 2025 at 3:55 AM PST 2 min read\n\nIn this article: NVDA\n\n688795.SS\n\nAMZN\n\n688256.SS\n\nGOOG\n\nNvidia stock rises Wednesday. But the chip maker faces an increasing number of rivals in the U.S. and China.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "19:37:35",
      "Source": "Yahoo Finance",
      "Title": "AI Chips Update - AlphaTON Capital Expands AI Capabilities With NVIDIA B300 Integration",
      "URL": "https://finance.yahoo.com/news/ai-chips-alphaton-capital-expands-113735902.html?.tsrc=rss",
      "Content": "AI Chips Update - AlphaTON Capital Expands AI Capabilities With NVIDIA B300 Integration\n\nSimply Wall St\nWed, December 17, 2025 at 3:37 AM PST 1 min read\n\nIn this article: ATON\n\nMU\n\nAMD\n\nNVDA\n\nSMCI\n\nAlphaTON Capital has announced the acquisition of its first NVIDIA B300 GPUs, integrated into Supermicro's advanced HGX systems, through a partnership with Atlantic AI. This deployment aims to enhance the Cocoon AI Network by leveraging advanced compute power, thereby offering enterprise-level artificial intelligence capabilities with military-grade privacy protection to users worldwide. The NVIDIA B300 chips, renowned for their high-performance processing suitable for complex AI tasks, mark a significant advancement in delivering democratized AI infrastructure that prioritizes user privacy. This initiative underscores AlphaTON Capital's commitment to providing robust, privacy-focused AI solutions within the decentralized computing sector.\n\nNVIDIA last closed at $177.72 up 0.8%.\nIn other market news, Nexchip Semiconductor was trading firmly up 7.6% and closing at CN¥36.13. On Monday, the company was added to the SSE 180 Index. At the same time, Amkor Technology lagged, down 8.3% to close at $40.28.\nNVIDIA's AI-driven innovation and revenue growth forecast demand immediate investor attention. Click to explore the detailed narrative on the company's potential.\nCheck out our Market Insights article titled \"AI Companies Hit The Bond Market,\" where we examined AI companies' increasing reliance on bond markets for growth funding—move fast before opportunities shift.\nBest AI Chip Stocks Advanced Micro Devices closed at $209.17 up 0.8%. On Monday, December 15, 2025, AMD appointed Emily Ellis as their new Corporate Vice President and Chief Accounting Officer.\nBroadcom closed at $341.30 up 0.4%.\nMicron Technology ended the day at $232.51 down 2.1%.\nSeize The Opportunity Unlock our comprehensive list of 76 AI Chip Stocks like China Resources Microelectronics , Lattice Semiconductor and Entegris by clicking here.\nInterested In Other Possibilities? These 10 companies survived and thrived after COVID and have the right ingredients to survive Trump's tariffs. Discover why before your portfolio feels the trade war pinch.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nStory Continues\nSources:\nSimply Wall St\n\"AlphaTON Capital Secures First NVIDIA B300 Chips with Supermicro HGX Systems\" from AlphaTON Capital on GlobeNewswire (published 15 December 2025)\nCompanies discussed in this article include SHSE:688249 NasdaqGS:NVDA NasdaqGS:AMD NasdaqGS:AVGO NasdaqGS:MU and NasdaqGS:AMKR .\nThis article was originally published by Simply Wall St .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "10:19:11",
      "Source": "Yahoo Finance",
      "Title": "MetaX soars 700% in debut as China AI chips push lures investors",
      "URL": "https://finance.yahoo.com/news/chinese-ai-chipmaker-metax-shares-021911316.html?.tsrc=rss",
      "Content": "MetaX soars 700% in debut as China AI chips push lures investors\n\nReuters\nTue, December 16, 2025 at 6:19 PM PST 4 min read\n\nIn this article: AMD\n\nNVDA\n\nSHANGHAI, Dec 17 (Reuters) - MetaX Integrated Circuits jumped 700% in its Shanghai market debut as the Chinese AI chipmaker tapped into strong momentum triggered by Beijing's push to reduce reliance on chips from U.S. firms Nvidia ( NVDA ) and Advanced Micro Devices ( AMD ).\nFounded by former AMD executives, MetaX raised roughly $600 million in an initial public ​offering last week, days after larger rival Moore Threads debuted with a 400% pop.\n\nMetaX opened at 700 yuan a share in Shanghai versus an IPO price of ‌104.66 yuan, before surging as high as 895 yuan, defying persistent AI bubble concerns in other markets. The stock ended the trading session at 829.9 yuan, up 693%.\n\"It's another IPO tale in China that turns a crow into ‌a phoenix,\" said fund manager Yang Tingwu at Tongheng Investment.\nThe price surge \"creates huge arbitrage opportunities\" for pre-IPO investors, Yang said, and \"we're likely witnessing the stock's peak level for the next five years\".\nMakers of artificial intelligence (AI) chips are rushing to sell shares in China to capitalise on interest generated by a government drive to boost local production in competition with the U.S.\n\n\"AI and semiconductors are key areas of competition in the Sino-U.S. tech rivalry,\" Guotai Haitong Securities said in a report ahead of MetaX's listing. \"Against the backdrop of geopolitical tension, AI chipmaking has huge growth potential,\" as China seeks to achieve self-sufficiency.\nResearcher ⁠Frost & Sullivan forecast China AI chip sales to top $189 billion ‌by 2029 versus $54 billion in 2026.\nPOLICYMAKERS PUSH AI SELF-SUFFICIENCY MetaX, which makes graphics processing units (GPUs), raised 4.2 billion yuan ($596 million) last week in a share sale that was more than 4,000 times oversubscribed by retail investors.\nThe IPO - China's sixth biggest so far this year, according to KPMG - priced the money-losing ‍startup at 50 times its 2024 sales. That compared with a multiple of 34 for Nvidia and 14 for AMD, MetaX said in a pre-listing statement.\n\nMetaX's debut catapulted the value of the five-year-old startup to more than 300 billion yuan ($42.58 billion) and boosted the wealth of founder and major shareholder Chen Weiliang, 49.\nAfter working for AMD Shanghai for 13 years, Chen founded MetaX with a mission to \"contribute to China's rejuvenation ​and national prosperity.\" The founding team also included Peng Li and Yang Jian, both former AMD engineers.\n\"The company is a leading GPU maker in China thanks to its AMD gene,\" ‌Li Hui, analyst at Huajin Securities, said in a report ahead of MetaX's listing.\n\nStory Continues\n\"It will likely benefit from China's continuous push to replace foreign suppliers using indigenous technology.\"\nMetaX, which controls 1% of China's AI chip market, projects the company's sales to more than double this year due to the tech self-reliance drive, and expects to break even as early as next year.\n\nCHINESE AI CHIPMAKERS RUSH FOR IPOS MetaX's market debut comes after Moore Threads ( 688795.SS ), dubbed by analysts as \"China's Nvidia\", raised $1.1 billion in its Shanghai IPO in late November.\n\nOn Monday, AI chip startup Biren Technology won regulatory approval to sell shares publicly in Hong Kong, while rival Kunlunxin also plans an IPO in the city. Another AI chipmaker, Enflame, has hired Citic Securities to prepare for a flotation.\n\"Chinese ⁠policymakers are greenlighting IPOs for AI chipmakers to support home-grown advanced technology,\" said fund manager Yuan Yuwei ​at Trinity Synergy Investments in Hong Kong.\n\n\"Domestic chipmakers lag U.S. rivals, but if they can raise tens or hundreds ​of billions to spend on talent, you cannot rule out their breakthrough.\"\nIPO fundraising in China jumped 23% in 2025 from a year earlier to exceed 160 billion yuan, according to KPMG, with 23% of the proceeds going to the technology, media and telecom sector.\nSIGNIFICANT TECHNOLOGY GAP MetaX flagged a number of ‍risk factors in its IPO prospectus, including supply ⁠chain disruption from U.S. technology restrictions as well as its significant technology gap with Nvidia and AMD.\nNvidia is considering adding production capacity for its H200 AI chips due to strong orders from Chinese clients, after U.S. President Donald Trump this month greenlighted export of Nvidia's second-fastest AI chips to China.\n\nIn the home GPU market, MetaX competes with ⁠Moore Threads as well as Hygon Information Technology and Biren.\nIn the so-called ASIC chip business, it competes with Cambricon, Huawei Technologies' HiSilicon, Baidu's Kunlunxin and Alibaba Group's T-Head.\n\"MetaX's technology lags Moore Threads, and it faces stiff competition ‌from Huawei and Alibaba,\" said Yuan of Trinity Synergy Investments.\nThere will be room to improve, \"but under the current circumstances, there's definitely froth in its share price.\"\n($1 = ‌7.0458 Chinese yuan renminbi)\n(Reporting by Shanghai Newsroom; Editing by Sumeet Chatterjee, Christopher Cushing and Thomas Derpinghaus)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "05:36:00",
      "Source": "Yahoo Finance",
      "Title": "Nvidia Stock Walks the Fine Line of AI Bubble Fears",
      "URL": "https://finance.yahoo.com/m/1faa0046-68c0-3276-a2c6-059babb8ea11/nvidia-stock-walks-the-fine.html?.tsrc=rss",
      "Content": "Nvidia Stock Walks the Fine Line of AI Bubble Fears\n\nAdam Clark\nTue, December 16, 2025 at 1:36 PM PST 1 min read\n\nIn this article: NVDA\n\nAVGO\n\nAMD\n\nNvidia stock has been hit by worries over an artificial-intelligence bubble but UBS analysts think the concerns are overblown.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "03:59:20",
      "Source": "Yahoo Finance",
      "Title": "AMD Shares Dip as Analyst Initiates Neutral View Amid Shifts in China Chip Rules",
      "URL": "https://finance.yahoo.com/news/amd-shares-dip-analyst-initiates-195920283.html?.tsrc=rss",
      "Content": "AMD Shares Dip as Analyst Initiates Neutral View Amid Shifts in China Chip Rules\n\nFaizan Farooque\nTue, December 16, 2025 at 11:59 AM PST 2 min read\n\nIn this article: AMD\n\nThis article first appeared on GuruFocus .\nAdvanced Micro Devices ( AMD , Financials ) fell on after Bernstein analyst Stacy Rasgon started covering the stock with a Hold rating and a $200 price target. She said there wasn't much room for growth in the near future after a big spike caused by demand for AI. The aim means that prices might drop by around 10% from where they are now.\n\nWarning! GuruFocus has detected 5 Warning Signs with AMD.\nIs AMD fairly valued? Test your thesis with our free DCF calculator.\nRasgon added that the stock price already reflects expectations for AI-driven growth. This means that there is less room for growth in the near future following a solid run due to high demand for data centers.\nThe grade came out at the same time as a heightened focus on U.S. trade strategy with China. During the Biden administration, Washington made it harder to export advanced AI chips, which meant that only Chinese buyers could buy high-end CPUs. Under a new export framework that requires corporations to pay 25% of their associated earnings to the U.S. government, the Trump administration recently let Nvidia start shipping its H200 AI processors to China again. President Donald Trump suggested that the same rules would apply to AMD and Intel ( INTC , Financials ).\n\nThe change in policy relieved worries that AMD could have to deal with harsher export limits than its competitors, lowering the danger of losing access to a crucial growth market. At the same time, it opens up competition with Nvidia in China, where there is still a lot of demand for AI accelerators.\nEven though the stock market has pulled back, AMD shares are still up a lot this year because of ongoing investment in data center CPUs and GPUs linked to AI infrastructure investments.\nMost Wall Street analysts still think the stock is a solid buy. The consensus rating is Moderate Buy, which shows that people believe AMD has good long-term chances in server acceleration and AI training hardware. Investors are now looking forward to the company's next earnings report to learn more about how demand is changing and how well margins are doing.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "03:37:01",
      "Source": "Yahoo Finance",
      "Title": "Analyst Says AMD's Next Big AI Push Will Center on New Helios System",
      "URL": "https://finance.yahoo.com/news/analyst-says-amds-next-big-193701049.html?.tsrc=rss",
      "Content": "Analyst Says AMD's Next Big AI Push Will Center on New Helios System\n\nMoz Farooque ACCA\nTue, December 16, 2025 at 11:37 AM PST 1 min read\n\nIn this article: AMD\n\nThis article first appeared on GuruFocus .\nAdvanced Micro Devices ( AMD , Financials ) is gearing up for its next phase of AI expansion , and one top analyst says the company is heading in the right direction. Piper Sandler's Harsh Kumar reiterated his Overweight rating and $280 price target after a recent call with AMD leadership, saying the discussion left him more confident about the company's product roadmap and execution.\n\nWarning! GuruFocus has detected 5 Warning Signs with AMD.\nIs AMD fairly valued? Test your thesis with our free DCF calculator.\nKumar pointed to Helios as AMD's next major bet in AI. The rack-scale system, expected around mid-2026, is designed to handle large training and inference workloads across data centers. He noted that AMD is devoting significant resources to the project, signaling how central Helios is to its long-term strategy.\nAt the same time, AMD continues to ramp its MI300 accelerators and early work on the MI400 series. Both chip families are expected to play a major role in the company's AI momentum over the next several years. Management said demand is broadening beyond early showcase customers, with interests spanning cloud providers and enterprises.\nKumar also highlighted AMD's commitment to open software and networking standards a stance he believes will help the company win more customers as AI infrastructure diversifies.\nWith AI investment accelerating across the industry, investors will be watching how Helios and AMD's accelerator roadmap translate into market share gains heading into 2026.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "02:46:00",
      "Source": "Yahoo Finance",
      "Title": "Chip Stocks Are In a Bubble. Here’s More Good News.",
      "URL": "https://finance.yahoo.com/m/1be6f617-c2a5-3cf9-bdb6-04657db83573/chip-stocks-are-in-a-bubble..html?.tsrc=rss",
      "Content": "Chip Stocks Are In a Bubble. Here’s More Good News.\n\nTeresa Rivas\nTue, December 16, 2025 at 10:46 AM PST 3 min read\n\nIn this article: AVGO\n\nLRCX\n\nMU\n\nAMD\n\nNVDA\n\nSemiconductors have accounted for three of the nine industry groups that met the bubble criteria going back to 1991, according to Ned Davis Research Chief Thematic Strategist Pat Tschosik.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "00:38:58",
      "Source": "Yahoo Finance",
      "Title": "Nvidia and Broadcom Are Wall Street's Top Chip Picks for 2026",
      "URL": "https://finance.yahoo.com/news/nvidia-broadcom-lead-bank-americas-161455468.html?.tsrc=rss",
      "Content": "Nvidia and Broadcom Are Wall Street's Top Chip Picks for 2026\n\nNauman Khan\nTue, December 16, 2025 at 8:38 AM PST 1 min read\n\nIn this article: NVDA\n\nAVGO\n\nLRCX\n\nKLAC\n\nADI\n\nThis article first appeared on GuruFocus .\nNvidia ( NASDAQ:NVDA ), Broadcom ( NASDAQ:AVGO ) and Lam Research ( NASDAQ:LRCX ) are highlighted by Bank of America as top semiconductor stocks for 2026, amid ongoing growth in AI-related spending.\nAnalysts see next year as a midpoint in an extended cycle of IT infrastructure upgrades driven by AI and accelerated workloads. They noted some short-term volatility could persist as investors weigh returns, but demand from enterprise, hyperscale, and government customers is expected to provide steady support.\n\nWarning! GuruFocus has detected 4 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nOther favored large-cap names include KLA Corp. (KLAC), Analog Devices ( NASDAQ:ADI ) and Cadence Design Systems (CDNS). Small- and mid-cap picks include Credo Technology ( NASDAQ:CRDO ), MKS (MKSI), Macom Technology Solutions (MTSI), Teradyne (TER) and Advanced Energy Industries ( NASDAQ:AEIS ).\nBank of America projects another year of strong AI semiconductor growth, backed by tight supply and high data center usage. Advanced Micro Devices (AMD) also stands out in the AI chip space.\nThe firm cautioned that analog chips may face pressure from softer industrial activity and rising competition. Emerging trends in 2026 include co-packaged optics, robotics and quantum, with Lumentum ( NASDAQ:LITE ) and Coherent (COHR) positioned as potential leaders.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "00:31:00",
      "Source": "Yahoo Finance",
      "Title": "Can Intel's AI Focus Restore Its Competitive Edge & Boost Shares?",
      "URL": "https://finance.yahoo.com/news/intels-ai-focus-restore-competitive-163100510.html?.tsrc=rss",
      "Content": "Can Intel's AI Focus Restore Its Competitive Edge & Boost Shares?\n\nZacks Equity Research\nTue, December 16, 2025 at 8:31 AM PST 3 min read\n\nIn this article: INTC\n\nSANS.PVT\n\nPer a Bloomberg news report , Intel Corporation ( INTC ) is in advanced talks to acquire AI start-up SambaNova Systems for about $1.6 billion. SambaNova is known for designing custom AI chips and systems. Acquiring an AI-focused company facilitates Intel with a ready-made AI architecture, software stacks and engineering talent, minimizing years of internal development time and speeding up its AI development plans.\n\nIf the deal materializes, it will help Intel to modernize its CPUs with AI chips and software, providing cloud and enterprise customers with a complete AI system. By using AI chip technology, Intel can make chips in its own factories, increasing its manufacturing strength and allowing it to attract more foundry customers.\nIntel has launched new AI-powered chips that are faster and more energy-efficient, helping the company compete better in the growing AI market. It is gaining traction in AI infrastructure as Super Micro Computer has chosen Intel’s Xeon 6 processors for its high-performance enterprise servers.\nThe company has collaborated with Cisco to build a new integrated platform that supports distributed AI workloads. NVIDIA will invest $5 billion in Intel to build advanced technologies that will shape the future of AI infrastructure. Intel is actively investing in AI and is serious about competing in the fast-growing semiconductor market, signaling a credible comeback.\n\nHow Are Competitors Faring? Intel faces competition from Advanced Micro Devices ( AMD ) and Qualcomm Incorporated ( QCOM ). Qualcomm focuses on making advanced chips for AI-powered PCs. Qualcomm launched the AI 200 and AI 250 chips to meet rising AI processing needs in data centers. HUMAIN has chosen Qualcomm’s AI200 and AI250 chips to provide high-performance AI services in Saudi Arabia and worldwide.\n\nAMD is growing its AI business by launching new MI350 series accelerators and working with major partners like Amazon, Microsoft, Meta and Oracle to deliver faster and more powerful AI systems. AMD has entered into a long-term deal with OpenAI to power large AI systems using AMD’s Instinct GPUs starting in 2026. IBM and AMD are working with Zyphra to provide powerful AI infrastructure on IBM Cloud using AMD Instinct MI300X GPUs to train advanced AI models.\nINTC’s Price Performance, Valuation and Estimates Intel has rallied 79.3% over the past year compared with the industry ’s growth of 31.1%.\n\nImage Source: Zacks Investment Research\nGoing by the price/book ratio, the company's shares currently trade at 1.53 book value, lower than 30.63 of the industry average.\n\nStory Continues\n\nImage Source: Zacks Investment Research\nEarnings estimates for 2025 have increased 128.6% to 32 cents, while those for 2026 have declined 10.7% to 59 cents over the past 60 days.\n\nImage Source: Zacks Investment Research\nIntel stock currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "23:36:00",
      "Source": "Yahoo Finance",
      "Title": "Seagate Outpaces Industry in 6 Months: How to Play the Stock",
      "URL": "https://finance.yahoo.com/news/seagate-outpaces-industry-6-months-153600245.html?.tsrc=rss",
      "Content": "Seagate Outpaces Industry in 6 Months: How to Play the Stock\n\nShreya Majumder\nTue, December 16, 2025 at 7:36 AM PST 6 min read\n\nIn this article: STX\n\n^GSPC\n\nSeagate Technology Holdings plc ’s STX shares have climbed 118.3% in the past six months, outperforming the Zacks Computer-Integrated Systems industry’s growth of 48.4%. The stock has also outpaced the Zacks Computer & Technology sector and the S&P 500’s growth of 23.3% and 16.7%, respectively.\n\nImage Source: Zacks Investment Research\nBetter-than-expected results, aggressive capital returns, and advancements in hard-disk technology drive the surge. In November, Seagate rolled out its new Exos 4U100 and 4U74 JBOD systems, advancing enterprise storage ahead of the SC25 conference. Designed for data-heavy workloads in both data centers and edge environments, these top-tier systems offer as much as 3.2 petabytes of capacity in one of the densest single-enclosure designs available.\n\nThe company has successfully surpassed its industry peers like Micron Technology MU and Advanced Micro Devices AMD, which have risen 97.4% and 63.4%, respectively, over the six months. At the same time, its cut-throat rival in the HDD space, Western Digital Corporation WDC, has outrun STX, growing 193.8%.\n\nImage Source: Zacks Investment Research\nWestern Digital is a diversified storage company offering a broad portfolio of HDD and NAND-based SSD solutions used across desktop PCs, servers, NAS devices, gaming consoles, DVRs and other consumer electronics. Micron manufactures and markets high-performance memory and storage technologies, including DRAM, NAND flash memory, NOR Flash, 3D XPoint memory and other technologies. AMD delivers industry-leading total cost of ownership, efficiency, and advanced AI capabilities, enabling high performance, reliability, and scalability across data centers, the edge, and end-user environments.\n\nSecular Drivers Behind STX’s Strong Fundamentals Seagate’s latest quarterly results showed healthy revenues and strong EPS, and management has guided toward continued demand for high-capacity drives in data centers. It is benefiting from strong data center demand driven by global cloud customers and accelerating AI workloads. Data center revenues now represent the majority of sales, supported by higher nearline drive capacities and long-term production visibility into 2026. On the technology front, Seagate continues to scale its HAMR roadmap, with broad customer qualification progress and rising shipments, positioning the company to support next-generation cloud and edge storage needs with higher-capacity, more efficient solutions.\n\nAI is transforming hard drive demand by increasing the economic value of data and storage. This is leading to higher demand for STX’s high-capacity nearline drives as customers expand their investments in AI. The rapid growth in AI inferencing further boosts data creation, as large volumes of multimodal data are stored, analyzed, and reintegrated into ongoing training cycles. The effect is already evident as global cloud service providers deploy large-scale inferencing applications across text, audio, and video workloads.\n\nStory Continues\nImproving aerial density remains a core strength for Seagate and a main driver of industry advancement, providing a durable TCO benefit over other storage options. Demand for high-capacity HAMR drives is increasing as customers seek efficient solutions for AI-driven data growth. Its HAMR-based Mozaic 3+ platform allows for denser storage and is gaining strong traction, with five global CSPs qualified on 36TB offerings. Production is progressing smoothly, with HAMR drives expected to reach a 50% exabyte share by the second half of 2026. Seagate is also developing Mozaic 4+ drives with capacities up to 44TB, aiming for volume ramp-up in early 2026, while moving toward 5TB-per-disk technology for launch around 2028.\n\nSTX Executes Financial Framework With Cash Flow Upside Seagate’s business transformation and strong product pipeline position it well for long-term growth. Since the first quarter of fiscal 2026, the company has streamlined its operations around two core markets - Data Center, serving cloud, enterprise, and VIA customers with nearline drives and systems, and Edge IoT, which includes consumer and client segments, such as network-attached storage. Demand from global cloud customers continues to accelerate, alongside a recovery in enterprise OEM markets, with cloud growth outpacing enterprise demand.\n\nAs AI shifts from training to large-scale inferencing, requirements for checkpointing and massive data retention are driving rapid growth in high-capacity storage demand. Amid tight supply, Seagate is working closely with data center customers to speed qualification of its high-capacity HAMR-based Mozaic drives, with most major cloud providers already qualified and production ramping to meet strong demand. Robust data center growth offset sequential softness in Edge IoT, with seasonal improvement expected in the December quarter. Long-term customer agreements provide strong demand visibility into 2027.\nMoreover, its business model overhaul and product pipeline support continued margin expansion and cash flow growth in fiscal 2026. Strong cash flow and an explicit capital-return program can increase shareholder value. Management has leaned on buybacks and dividends to promote a disciplined capital allocation method. During the fiscal first quarter, it returned capital to shareholders through dividends of $153 million and the repurchase of 153,000 shares for $29 million at an average price of $187 per share. It is dedicated to returning a minimum of 75% of its free cash flow to shareholders over the long term and anticipates stronger free cash flow generation in the December quarter.\n\nImage Source: Zacks Investment Research\nGoing ahead, management projects higher revenue and margin expansion as customers adopt its next-generation storage solutions. For the fiscal second quarter, it expects revenues to be $2.7 billion (+/- $100 million). At the midpoint, this indicates a 16% year-over-year improvement. At the midpoint of revenue guidance, non-GAAP operating margin is projected to increase to approximately 30%. For fiscal 2026, STX expects capital spending to remain within its targeted 4-6% of revenue range while maintaining strict capital discipline.\n\nHowever, Seagate is plagued by potential headwinds, including heightened forex volatility, intense competitive pressure across the data storage market, and ongoing macroeconomic and supply-chain uncertainty. Its high debt load further elevates financial risk, restricting flexibility for dividends, share repurchases, and strategic acquisitions. These challenges could significantly limit growth and undermine long-term performance.\nEstimate Revision Trend of STX STX is currently witnessing an uptrend in estimate revisions. Earnings estimates for fiscal 2026 have increased 7% to $11.26 over the past 60 days, while the same for fiscal 2027 has gone up 8.6% to $14.88.\n\nImage Source: Zacks Investment Research\nKey Valuation Metric of STX Going by the price/earnings ratio, the company’s shares currently trade at 23.34 forward earnings compared with 22.12 for the industry.\n\nImage Source: Zacks Investment Research\nEnd Note Seagate is supported by powerful multi-year growth drivers, including rapid AI-led data expansion, increasing cloud storage requirements, and rising demand across edge and video applications. Its next-generation HAMR-based hard drives are fueling market share gains, reinforced by a solid outlook and a differentiated technology roadmap, positioning the company for both near-term momentum and long-term value creation.\n\nStrong cloud demand and accelerating HAMR adoption enabled Seagate to begin fiscal 2026 with solid results, delivering robust performance and record margin expansion. Boasting a Zacks Rank #1 (Strong Buy) at present, STX seems to be a good fit for your portfolio. You can see the complete list of today’s Zacks #1 Rank stocks here.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nWestern Digital Corporation (WDC) : Free Stock Analysis Report\nSeagate Technology Holdings PLC (STX) : Free Stock Analysis Report\nMicron Technology, Inc. (MU) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "23:00:00",
      "Source": "Yahoo Finance",
      "Title": "ClearML Enhances AMD Instinct GPU Partitioning to Maximize Utilization, Centralize Management, and Accelerate Enterprise AI Adoption",
      "URL": "https://finance.yahoo.com/news/clearml-enhances-amd-instinct-gpu-150000403.html?.tsrc=rss",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nClearML Enhances AMD Instinct GPU Partitioning to Maximize Utilization, Centralize Management, and Accelerate Enterprise AI Adoption\n\nClearML, Inc.\nTue, December 16, 2025 at 7:00 AM PST 4 min read\n\nIn this article: AMD\n\nClearML now provides native fractional GPU support for AMD Instinct GPUs, enabling teams to run training, fine-tuning, and inference workloads simultaneously on a single GPU\nSAN FRANCISCO, CA / ACCESS Newswire / December 16, 2025 / ClearML , the leading end-to-end solution for GPU management and unleashing AI in the enterprise, today announced extended support for the fractional GPU capabilities now available for AMD Instinct™ GPUs, including the AMD Instinct MI300X GPU and newer GPUs. With partitioned AMD GPUs, enterprises can run multiple concurrent AI workloads with improved throughput and resource efficiency, maximizing infrastructure ROI while accelerating AI at every phase of production. ClearML's silicon-agnostic solution gives enterprises the freedom to scale their infrastructure when and how they choose, while keeping their AI Infrastructure investments future-ready.\n\nOrganizations are increasingly looking to identify opportunities to enhance GPU utilization across their AI infrastructure. Diverse AI workload types create a resource mismatch: lightweight tasks often claim entire GPUs while compute-intensive training jobs wait in queue. Dynamic workload orchestration is critical for organizations seeking to scale AI capabilities without expanding infrastructure budgets.\nA Complete Solution for GPU Management and Utilization\nAMD Instinct™ MI300X GPUs deliver the hardware flexibility to partition each single GPU into 8 independent compute slices, each with hardware isolated resources and optimized memory locality. ClearML provides a turnkey solution for enterprise teams by automatically detecting available partitions, dynamically allocating resources based on workload requirements, and delivering unified visibility across all resources through a single control plane.\n\nTogether, high-performance, cost-effective AMD hardware and ClearML's vendor-agnostic AI infrastructure platform deliver effortless management and optimal GPU utilization across any heterogeneous GPU clusters.\nMaximizing GPU utilization is a top infrastructure priority for global enterprises and organizations. According to ClearML's latest State of AI Infrastructure at Scale 2025-2026 annual report, ( https://go.clear.ml/state-of-ai-infrastructure-report-25-26 ), and based on our survey, almost half (49.2%) of IT leaders at leading F1000 companies identified maximizing GPU efficiency across existing hardware, including shared compute and fractional GPUs, as their top priority for expanding AI infrastructure over the next 12-18 months. ClearML's native support for AMD Instinct partitioned GPUs unites AMD partitioning technology with intelligent orchestration, empowering AI teams to scale infrastructure more cost-effectively.\n\nStory Continues\n\"The latest AMD Instinct GPUs deliver comprehensive performance, and now with fractional GPU capabilities, organizations can get even more value from these investments,\" says Moses Guttmann, CEO and Co-founder of ClearML. \"By supporting fractional GPUs across multiple hardware vendors, we're reinforcing our commitment to true hardware-agnostic solution. Whether you're running AMD Instinct GPUs, or a heterogeneous mix of infrastructure, ClearML maximizes your AI infrastructure investment. This gives teams the flexibility to choose the best solution for their needs while ensuring maximum utilization across their entire IT organization.\"\n\n\"AMD Instinct GPUs deliver leadership performance with an exceptional TCO profile. By supporting fractional GPU capabilities leveraging Instinct GPU partitioning, ClearML makes it simple for customers to run diverse workloads efficiently, driving better ROI and delivering more AI outcomes from the same infrastructure.\" - Marilyn Basanta, Sr. Director Product Management, AMD\nUnified AMD GPU Resource Management Across ClearML's AI Infrastructure Platform\nClearML automatically leverages fractional AMD GPU support across the entire platform, enabling teams to build, train, and deploy AI models without any additional configuration or effort:\nInfrastructure Control Plane : Centralized visibility and governance across all resources, including partitioned AMD Instinct GPUs. Administrators can set resource quotas, monitor real-time utilization across every partition, seamlessly orchestrate jobs on a per-partition level and track what workloads are running on each node from a single dashboard. Dynamic workload orchestration ensures optimal utilization across the entire GPU cluster.\nAI Development Center : AI builders can deploy, build, and train AI through an intuitive interface, with fractional GPUs accelerating time to production by providing more compute options for workloads.\nGenAI App Engine : Launch models on AMD GPU partitions with a single click, complete with a full UI and management dashboard. Deploy both off-the-shelf and custom AI while maintaining cost efficiency.\n\nEnterprise IT teams and AI builders gain consistent, governed access to partitioned AMD Instinct GPU resources from early-stage research through scaled production workloads, managed through a single control plane without switching tools or sacrificing control.\nAvailability\nSupport for AMD Instinct MI300X and newer GPUs is available now for ClearML Enterprise customers. Organizations interested in maximizing their AMD GPU utilization can contact ClearML to learn more.\nGetting Started\nOrganizations using AMD Instinct MI300X GPUs and newer accelerators with GPU partitioning enabled can integrate with ClearML through simple setup commands. Once configured, ClearML automatically detects and manages the partitioned GPUs, intelligently allocating resources based on workload requirements.\n\nFor complete setup instructions, architecture diagrams, and best practices, visit ClearML's technical blog post on AMD fractional GPUs: https://clear.ml/blog/inside-clearmls-amd-instinct-gpu-partitioning-integration\nAbout ClearML\nAs the leading infrastructure platform for unleashing AI in organizations worldwide, ClearML is used by more than 2,100 customers to manage GPU clusters and optimize utilization, streamline AI/ML workflows, and deploy GenAI models effortlessly. ClearML is trusted by more than 300,000 forward-thinking AI builders and IT teams at leading Fortune 500 companies, enterprises, academia, public sector agencies, and innovative start-ups worldwide. To learn more, visit the company's website at https://clear.ml .\nMedia Contact\nNoam Harel\nChief Marketing Officer\nClearML\nnoamh@clearml.ai\nSOURCE: ClearML, Inc.\n\nView the original press release on ACCESS Newswire\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "22:57:00",
      "Source": "Yahoo Finance",
      "Title": "Will ANET's Growing Prowess in AI Networking Continue to Drive Growth?",
      "URL": "https://finance.yahoo.com/news/anets-growing-prowess-ai-networking-145700153.html?.tsrc=rss",
      "Content": "Will ANET's Growing Prowess in AI Networking Continue to Drive Growth?\n\nZacks Equity Research\nTue, December 16, 2025 at 6:57 AM PST 3 min read\n\nIn this article: ANET\n\nHPE\n\nNVDA\n\nAMD\n\nANTH.PVT\n\nArista Networks, Inc. ANET is witnessing solid market traction across its comprehensive data-driven network platforms. The company’s innovation strategy is focused on improving compute capabilities and GPU utilization through improved Etherlink architecture. Its solution combines zero-touch automation, trusted security, traffic engineering and telemetry to a single point of network control.\n\nIn this domain, Arista is actively collaborating with the worldwide market leader in GPU, NVIDIA. By combining Arista’s network platforms with NVIDIA’s compute platforms, the collaboration aims to develop a streamlined AI data center ecosystem that delivers effective coordination between AI networking and AI compute infrastructure.\n\nHowever, Arista has emphasized creating a broad and open ecosystem which will include other major players in this domain, such as AMD, Anthropic, Arm, Broadcom, OpenAI, Pure Storage and VAST Data. AI networking has shifted from 400G to 800G and is expected to shift from 800G to 1.6G going forward. Surging AI workloads in data centers are driving this movement.\n\nPer a Precedence Research report, the AI in networks market size is projected to grow from $15.28 billion in 2025 to $192.42 billion in 2034, with a compound annual growth rate of 32.51%. The company has reaffirmed its $1.5 billion in revenues from AI for 2025 and $2.75 billion in 2026. Solid traction among cloud and AI titans, neocloud providers and the campus enterprise will likely drive this growth.\n\nHow Are Competitors Faring? In the AI networking space, Arista faces competition from Hewlett Packard Enterprise Company HPE and Cisco Systems, Inc. CSCO. Cisco is utilizing its vast partner base to expand into the AI networking vertical. The company has been actively collaborating with NVIDIA. Cisco Secure AI Factory with NVIDIA is founded on the NVIDIA Spectrum-X Ethernet networking platform. The company’s data center switching orders surged double digits year over year in the fiscal third quarter.\n\nHewlett Packard Enterprise is also witnessing solid momentum in its Networking division with a 150% year-over-year surge in net sales in this segment in the fiscal fourth quarter. The integration of Juniper’s deep expertise in AI networking has significantly strengthened HPE's networking arm. Recently, the company added new AIOps capabilities and unified hardware across Aruba and Juniper platforms to advance self-driving network operations. Such innovation will further strengthen its competitive edge in AI networking.\n\nANET’s Price Performance, Valuation & Estimates Shares of Arista have risen 8% over the past year compared with the industry’s growth of 0.8%.\n\nStory Continues\n\nImage Source: Zacks Investment Research\nFrom a valuation standpoint, Arista trades at a forward price-to-sales ratio of 14.88, above the industry average of 4.75.\n\nImage Source: Zacks Investment Research\nEarnings estimates for 2025 have increased 3.23% to $2.88 over the past 60 days, while the same for 2026 have increased 3.44% to $3.31.\n\nImage Source: Zacks Investment Research\nArista currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nCisco Systems, Inc. (CSCO) : Free Stock Analysis Report\nArista Networks, Inc. (ANET) : Free Stock Analysis Report\nHewlett Packard Enterprise Company (HPE) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "22:50:40",
      "Source": "Yahoo Finance",
      "Title": "Constructing the AI Landscape: OpenAI Coordinates with Advanced Micro Devices (AMD)",
      "URL": "https://finance.yahoo.com/news/constructing-ai-landscape-openai-coordinates-145040802.html?.tsrc=rss",
      "Content": "Constructing the AI Landscape: OpenAI Coordinates with Advanced Micro Devices (AMD)\n\nSoumya Eswaran\nTue, December 16, 2025 at 6:50 AM PST 3 min read\n\nIn this article: AMD\n\nBrasada Capital Management , an investment management company, released its Q3 2025 investor letter. A copy of the letter can be downloaded here . In the letter, the firm noted that the market entered the fourth quarter with equities near all-time highs and monetary policy easing. The firm also believes that this momentum could persist even though there are indications that a capital expenditure bubble exists. Further, the firm continues to invest selectively in companies with solid moats and cash flows, while steering clear of balance-sheet risks. In addition, you can check the fund’s top 5 holdings to know its best picks in 2025.\n\nIn its third-quarter 2025 investor letter, Brasada Capital Management highlighted stocks such as Advanced Micro Devices, Inc. (NASDAQ: AMD ). Advanced Micro Devices, Inc. (NASDAQ:AMD) is a semiconductor company that operates through Data Center, Client, Gaming, and Embedded segments. The one-month return of Advanced Micro Devices, Inc. (NASDAQ:AMD) was -9.69%, and its shares gained 66.36% of their value over the last 52 weeks. On December 15, 2025, Advanced Micro Devices, Inc. (NASDAQ:AMD) stock closed at $207.58 per share, with a market capitalization of $338.486 billion.\nBrasada Capital Management stated the following regarding Advanced Micro Devices, Inc. (NASDAQ:AMD) in its third quarter 2025 investor letter:\nAdvanced Micro Devices, Inc. (NASDAQ:AMD) is in 19th position on our list of 30 Most Popular Stocks Among Hedge Funds . According to our database, 115 hedge fund portfolios held Advanced Micro Devices, Inc. (NASDAQ:AMD) at the end of the third quarter, up from 113 in the previous quarter. While we acknowledge the potential of Advanced Micro Devices, Inc. (NASDAQ:AMD) as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\n\nStory Continues\nIn another article , we covered Advanced Micro Devices, Inc. (NASDAQ:AMD) and shared the list of fastest-growing semiconductor stocks to buy. In addition, please check out our hedge fund investor letters Q3 2025 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "22:12:09",
      "Source": "Yahoo Finance",
      "Title": "AMD Gears Up for AI Breakthrough With Helios -- -- Is It Time to Buy This Stock?",
      "URL": "https://finance.yahoo.com/news/amd-gears-ai-breakthrough-helios-122111265.html?.tsrc=rss",
      "Content": "AMD Gears Up for AI Breakthrough With Helios -- -- Is It Time to Buy This Stock?\n\nNauman Khan\nTue, December 16, 2025 at 6:12 AM PST 2 min read\n\nIn this article: AMD\n\nThis article first appeared on GuruFocus .\nPiper Sandler reiterated an \"Overweight\" rating on Advanced Micro Devices ( NASDAQ:AMD ) and held a $280 price target in a recent investor note.\nHarsh Kumar, a top Piper Sandler analyst, said the recent management call left him confident about AMD's roadmap and execution.\n\nWarning! GuruFocus has detected 5 Warning Signs with AMD.\nIs AMD fairly valued? Test your thesis with our free DCF calculator.\nA central focus is Helios, a rack-scale AI system management expects to launch around mid-2026. Helios is being positioned to handle large AI workloads in data centers, signaling a move beyond standalone chips to full system solutions.\nKumar also pointed to the ongoing ramp of the MI300 series and early progress on the MI400 series, which he sees as core to AMD's multi-year AI growth case.\nManagement told analysts it plans to serve a broad customer base and not rely solely on any single partner, though Kumar expects some near-term demand from the OpenAI relationship.\nPiper Sandler said Helios could be a key differentiator, but execution and customer traction will determine upside. Kumar kept his $280 target unchanged.\n\nShares of Advanced Micro Devices ( NASDAQ:AMD ) slid about 0.5% in early trading, but investors will see how the stock responds in regular trading on Wednesday.\nIs AMD Stock a Buy? Based on the one year price targets offered by 44 analysts, the average target price for Advanced Micro Devices Inc is $273.97 with a high estimate of $377.00 and a low estimate of $134.20. The average target implies a upside of +31.98% from the current price of $207.58.\nBased on GuruFocus estimates, the estimated GF Value for Advanced Micro Devices Inc in one year is $230.08, suggesting a upside of +10.84% from the current price of $207.58. gf value is gurufocus' estimate of the fair value that the stock should be traded at. it is calculated based on the historical multiples the stock has traded at previously, as well as past business growth and the future estimates of the business' performance. For deeper insights, visit the forecast page.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "22:00:03",
      "Source": "Yahoo Finance",
      "Title": "Advanced Micro Devices, Inc. (AMD) Is a Trending Stock: Facts to Know Before Betting on It",
      "URL": "https://finance.yahoo.com/news/advanced-micro-devices-inc-amd-140003921.html?.tsrc=rss",
      "Content": "Advanced Micro Devices, Inc. (AMD) Is a Trending Stock: Facts to Know Before Betting on It\n\nZacks Equity Research\nTue, December 16, 2025 at 6:00 AM PST 5 min read\n\nIn this article: AMD\n\n^GSPC\n\nAdvanced Micro Devices (AMD) has been one of the most searched-for stocks on Zacks.com lately. So, you might want to look at some of the facts that could shape the stock's performance in the near term.\nShares of this chipmaker have returned -13.7% over the past month versus the Zacks S&P 500 composite's +1.3% change. The Zacks Computer - Integrated Systems industry, to which Advanced Micro belongs, has lost 6% over this period. Now the key question is: Where could the stock be headed in the near term?\n\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nEarnings Estimate Revisions Rather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\n\nFor the current quarter, Advanced Micro is expected to post earnings of $1.31 per share, indicating a change of +20.2% from the year-ago quarter. The Zacks Consensus Estimate has changed -0.4% over the last 30 days.\nFor the current fiscal year, the consensus earnings estimate of $3.96 points to a change of +19.6% from the prior year. Over the last 30 days, this estimate has changed -0.1%.\nFor the next fiscal year, the consensus earnings estimate of $6.25 indicates a change of +57.8% from what Advanced Micro is expected to report a year ago. Over the past month, the estimate has remained unchanged.\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #3 (Hold) for Advanced Micro.\n\nStory Continues\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS Revenue Growth Forecast Even though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\n\nIn the case of Advanced Micro, the consensus sales estimate of $9.64 billion for the current quarter points to a year-over-year change of +25.9%. The $33.94 billion and $43.01 billion estimates for the current and next fiscal years indicate changes of +31.6% and +26.7%, respectively.\nLast Reported Results and Surprise History Advanced Micro reported revenues of $9.25 billion in the last reported quarter, representing a year-over-year change of +35.6%. EPS of $1.2 for the same period compares with $0.92 a year ago.\nCompared to the Zacks Consensus Estimate of $8.72 billion, the reported revenues represent a surprise of +6%. The EPS surprise was +2.56%.\n\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\nValuation No investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nWhile comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.\n\nThe Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an A is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nAdvanced Micro is graded F on this front, indicating that it is trading at a premium to its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nBottom Line The facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Advanced Micro. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 17
}