{
  "stock_id": "AMD",
  "last_updated": "2026-01-03T08:10:40.542Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2026-01-03",
      "Time": "08:00:46",
      "Source": "Yahoo Finance Video",
      "Title": "December jobs report, earnings, CES 2026: What to Watch",
      "URL": "https://finance.yahoo.com/video/december-jobs-report-earnings-ces-000046216.html",
      "Content": "December jobs report, earnings, CES 2026: What to Watch\n\nYahoo Finance Video and Jared Blikre\nFri, January 2, 2026 at 4:00 PM PST\n\nIn this video: APLD\n\nPENG\n\nSTZ\n\nAEHR\n\nAMD\n\nMarket Domination Overtime host Jared Blikre previews several of the biggest stories to come next week, including the release of the December jobs report next Friday; earnings results from companies like Constellation Brands ( STZ ), Albertsons ( ACI ), Applied Digital ( APLD ), and Tilray Brands ( TLRY ); and the start of the 2026 Consumer Electronics Show (CES) on Monday with keynotes from Nvidia ( NVDA ) CEO Jensen Huang and Advanced Micro Devices ( AMD ) CEO Lisa Su.\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime .\n\nVideo Transcript\n\n00:03 Speaker A\nTime now for what to watch, starting off on the labor front.\n00:06 Speaker A\nWe're going to be getting a bunch of new jobs data throughout the week, including the December jobs report on Friday. Economists forecasting the US economy to add 55,000 new jobs\n00:15 Speaker A\nwhile unemployment edges down to 4 and a half% and hourly wages tick up to 0.3% on a month-over-month basis.\n00:23 Speaker A\nAhead of the monthly jobs report, we're going to get the ADP reading on private payrolls. That is expected to show growth in December, 48,000 jobs added,\n00:30 Speaker A\nsignaling a rebound in hiring momentum following the longest government shutdown in US history.\n00:37 Speaker A\nAnd we've got some earnings to be tracking. We're going to be hearing from several names in the food and beverage sectors including Albertson's, Calmane and Constellation Brands.\n00:44 Speaker A\nConstellation announcing results for the third quarter on Wednesday. Analysts expecting earnings to fall sharply in Q3, driven by alcoholic beverage company selling off big chunks of its wine and spirits business.\n00:54 Speaker A\nAnd finally, the 2026 Consumer Electronics show, or CES, is kicking off in Las Vegas. Nvidia CEO Jensen Wang giving a presentation on AI on Monday.\n01:04 Speaker A\nAMD CEO Lisa Sue is also giving a keynote address at the conference on Monday, and Yahoo Finance will have coverage from the event throughout the week including an interview with the CFO of Qualcomm.\n01:13 Speaker A\nYou don't want to miss it.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-03",
      "Time": "07:07:00",
      "Source": "TheStreet",
      "Title": "Nvidia, AMD in focus ahead of key event",
      "URL": "https://finance.yahoo.com/m/41695bd7-ee27-36be-a002-40f17e5366a9/nvidia%2C-amd-in-focus-ahead-of.html",
      "Content": "Nvidia, AMD in focus ahead of key event\n\nMoz Farooque\nFri, January 2, 2026 at 3:07 PM PST 4 min read\n\nIn this article: NVDA\n\nAMD\n\n^SOX\n\nAs January gets underway, AI stocks are in for a kicker at the CES event.\nNvidia ( NVDA ) and Advanced Micro Devices ( AMD ) are in the spotlight, with both expected to use the event as a stepping stone to shape the next phase of the AI race.\nHaving covered multiple tech cycles over the past several years, I know that stock markets typically don’t turn on earnings alone.\n\nThey need market-moving catalysts to give the narrative a much-needed kick in the pants.\nAI chip stocks, in particular, have had a rough time of late.\nFor color, the PHLX Semiconductor Index dropped nearly 5% from its December 10 record ( 7,490 ) to its December 31 close ( 7,083 ).\nNevertheless, according to Wedbush Securities , both AI bellwethers are positioned to deliver some of the conference’s most compelling headlines.\nWedbush says Nvidia, AMD expectations at stake for CES 2026 For Nvidia, CEO Jensen Huang will take the stage in his signature leather jacket to reinforce the AI leader's vision around data centers, robotics, and what Wedbush calls the next phase of the AI revolution.\nAMD will have its own moment, with CEO Lisa Su delivering the opening keynote, featuring key updates across PCs, data centers, and edge AI.\n\nWith valuations mostly stretched and expectations running high, the CES event could therefore help set the tone for what’s to come for these AI giants in 2026.\nMore Tech Stocks:\nMorgan Stanley sets jaw-dropping Micron price target after event\nNvidia’s China chip problem isn’t what most investors think\nQuantum Computing makes $110 million move nobody saw coming\nMorgan Stanley drops eye-popping Broadcom price target\nApple analyst sets bold stock target for 2026\nWedbush sees CES as a critical opening act for Nvidia and AMD , as expectations run sky-high.\nWedbush analysts offered further insight.\nAnalysts also expect updates linked to Nvidia’s robust software platforms, including gaming and simulation, underscoring that its AI story extends far beyond hyperscale customers.\n\nFor AMD , Wedbush expects major Ryzen updates and concrete updates around AI PCs, data centers, and edge computing. Moreover, AMD will be looking to build a platform, not just offer alternatives.\nCES 2025 recap: what Nvidia and AMD showed last year That said, here’s the lowdown from last year’s event for both tech giants.\nNvidia showed off its powerful Cosmos platform for “physical AI,” positioning it as a foundation for real-world deployment.\nNvidia introduced Blackwell-based GeForce RTX 50 Series GPUs while highlighting new RTX-PC AI tooling (including NIM microservices/Blueprints).\nAMD rolled out its AI PC portfolio, covering Ryzen AI Max/Max PRO , and expanded Ryzen AI 300 chips tailored to Copilot+ PCs.\nAMD leaned into gaming/graphics with Ryzen X3D desktop chips and Ryzen Z2 handheld processors. Also, it offered previews of the Radeon RX 9070- series (RDNA 4) GPUs and FSR 4.\n\nStory Continues\nAt CES 2026, the real fight is over AI CES 2026 runs January 6 to 9 in Las Vegas , and though it has historically been more of a gadget showcase, this year it’s shaping up to be the year’s first high-stakes tech meeting.\nInvestors expect a needle-moving event, spearheaded by concrete roadmaps, partnerships, and major commitments.\nFor the biggest chipmakers, CES will be all about owning the AI conversation early . Nvidia will seek to reinforce its dominance by rallying partners with demos, keynotes, and industry-wide signaling.\n\nRelated: Cathie Wood shells out $1.3 million on biotech stock\nAMD will look to rain on Nvidia’s parade.\nBy spotlighting new PC platforms and capitalizing on a larger OEM market share , AMD will aim to carve out its own lane for AI-driven growth.\nFor perspective, the AI trade has lost its luster lately, and big-name skepticism targets are growing louder.\nFront and center is the “Big Short” Michael Burry , who is openly comparing the current AI frenzy to past manias.\nBurry delivered a scathing takedown of Nvidia.\nThat’s exactly why Nvidia and AMD will be looking for a strong start to set the tone early in 2026.\nBig banks reset targets on Nvidia and AMD Nvidia and AMD both had a solid outing at the stock market last year.\nFor perspective, Nvidia stock ended 2025 up 41% , while AMD posted an 83% gain .\nNow, Wall Street is recalibrating its expectations for 2026, with investors in “show-me” mode when it comes to AI.\nBank of America : Nvidia buy, $275 price target; AMD buy, $300 price target\nSource: Investing.com\nMorgan Stanley : Nvidia overweight, $250 price target; AMD equal weight, $260 price target\nUBS : Nvidia buy, $235 price target; AMD buy, $300 price target\nGoldman Sachs : Nvidia buy , $250 price target; AMD neutral, $210 price target\nSource: Investing.com\nJPMorgan : Nvidia overweight , $250 price target; AMD neutral, $270 price target\nSource: Barron's\nRelated: Veteran analyst resets AI stock buy list for 2026\nThis story was originally published by TheStreet on Jan 2, 2026, where it first appeared in the Technology section. Add TheStreet as a Preferred Source by clicking here.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-03",
      "Time": "05:36:30",
      "Source": "Investor's Business Daily",
      "Title": "Dow Jones Futures: Nvidia, AMD, Taiwan Semi Due After Tesla, Palantir, AppLovin Trigger Sell Signals",
      "URL": "https://finance.yahoo.com/m/d3aa3714-1ae7-36bd-90d6-a7ef43eaf2f8/dow-jones-futures%3A-nvidia%2C.html",
      "Content": "Dow Jones Futures: Nvidia, AMD, Taiwan Semi Due After Tesla, Palantir, AppLovin Trigger Sell Signals\n\nED CARSON\nFri, January 2, 2026 at 1:36 PM PST 7 min read\n\nIn this article: TSLA\n\nGEV\n\nPLTR\n\nNVDA\n\nAPP\n\nThe stock market fell last week, with Nasdaq just below a critical level. Tesla, Palantir, AppLovin triggered sell signals. Nvidia and AMD are CES headliners.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-03",
      "Time": "05:02:24",
      "Source": "Yahoo Finance Video",
      "Title": "CES 2026: Nvidia, AMD, Intel, & more to make announcements",
      "URL": "https://finance.yahoo.com/video/ces-2026-nvidia-amd-intel-210224074.html",
      "Content": "CES 2026: Nvidia, AMD, Intel, & more to make announcements\n\nYahoo Finance Video\nFri, January 2, 2026 at 1:02 PM PST\n\nIn this video: AMD\n\n005380.KS\n\n005385.KS\n\n005387.KS\n\n005389.KS\n\nThe 2026 Consumer Electronics Show (CES) is coming up next week in Las Vegas.\nYahoo Finance Technology Editor Dan Howley sits down with Yahoo Finance Markets and Data Editor Jared Blikre on Market Domination to explain what investors should expect from the event and from key names like Nvidia ( NVDA ) and AMD ( AMD ).\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination .\n\nVideo Transcript\n\n00:00 Speaker A\nIt is a new year and to kick it off in style, the Consumer Electronics show will be one of the biggest tech conferences. CES is kicking off on January 6th under the bright lights of Las Vegas, and tech editor Dan Howley is here with what to expect. Dan, tell us.\n00:15 Dan Howley\nYeah, Jared, there's going to be a number of big announcements at this year's show. The the first obviously, will probably, and biggest, be out of Nvidia. They're hosting their own press event on January 5th. CEO Jensen Wong will take the stage. He did it last year as well. They announced a number of new products, a new chip for a smaller bitesize desktop AI computer, as well as a number of different software innovations that they've really been pushing as of late. They also brought out their kind of digital army of robots. It was basically a a a video recording uh and then a little tiny robot uh care of Star Wars uh took the stage alongside of him.\n00:54 Dan Howley\nUh outside of Nvidia, we're also expecting to see AMD host their own press event with CEO Lisa Sue. Uh we'll see Intel and Qualcomm both host press events as well related to their respective chips. Uh and then overall, we should see a ton of AI. I mean, you know, the chips themselves are are, you know, obviously enough to say that AI is going to dominate, but uh you can expect to see a lot of robots, uh a lot of smart home devices. You can even see some wearables that are AI powered. And those usually, you know, so far we haven't seen anything too interesting as far as AI powered wearables outside of maybe, you know, the intelligence built into smart glasses or smart watches. There's never been a dedicated device that's really taken off. Open AI is supposedly working on one, don't expect it at CES. Uh and then finally, uh Autos. Autos have been a big part of CES as of late.\n01:54 Dan Howley\nUh they continue to do so and we'll likely see things ranging from flying cars to uh different types of boats. Uh we know that there'll be some major automakers like Hyundai on hand, uh Sony and Honda, their uh Afeela vehicle will be there as well. Uh and so it's going to be a jam-packed show, but again, I think the big takeaway is going to be from Nvidia. They're the the hottest uh company on the market right now and what they're doing in AI as well as AI from the the rest of the companies at the show.\n02:18 Speaker A\nDan, we got about 30 seconds. So I'm just going to ask you real quickly, any surprises over the last few weeks that have jumped into your attention span uh that might kind of give us a hint of what 2026 has in store for us in tech?\n02:32 Dan Howley\nYeah, I mean the the Nvidia Groc uh kind of licensing deal, non-exclusive licensing deal. Uh I think it was estimated $20 billion. That was really interesting and it just kind of shows where Nvidia sees its its future at this point, you know, making these kinds of investments and new types of chip technologies or different types of chip tech chip technologies to really hold on to the lead that it has.\n03:00 Dan Howley\nUh you know, I I think we're going to continue to see these kinds of not necessarily acquisitions, but you know, licensing agreements will hire some executives from a company, uh things along those lines. Uh they really kind of became popular in 2025 and I think we'll continue to see them through 2026. It's a a way for companies to kind of avoid the scrutiny of acquiring a company, taking it over entirely, while still getting some of that knowhow and IP.\n03:22 Speaker A\nAll right, Dan, appreciate it. We'll see you soon.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-03",
      "Time": "05:00:33",
      "Source": "Yahoo Finance",
      "Title": "Stock market today: Dow, S&P 500 edge higher to kick off 2026, semiconductor stocks rally",
      "URL": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-edge-higher-to-kick-off-2026-semiconductor-stocks-rally-210033381.html",
      "Content": "LIVE\n\nStock market today: Dow, S&P 500 edge higher to kick off 2026, semiconductor stocks rally\n\nBrett LoGiurato and Jake Conley\nFri, January 2, 2026 at 1:00 PM PST 2 min read\n\nIn this article: ^GSPC\n\n^DJI\n\n^IXIC\n\nTSLA\n\nGC=F\n\nUS stocks mostly edged higher on Friday as Wall Street kicked off trading in 2026 after its third consecutive year of double-digit percentage gains .\nThe Dow Jones Industrial Average ( ^DJI ) gained about 0.6%, while the S&P 500 ( ^GSPC ) increased 0.2%.\nThe tech-heavy Nasdaq Composite ( ^IXIC ) fell below the flat line, despite gains in semiconductor giants Nvidia ( NVDA ), AMD ( AMD ), and Micron ( MU ).\n\nShares of Tesla ( TSLA ) fell after the EV maker's deliveries missed expectations.\nMarkets are coming off a sputtering end to a roller-coaster 2025 that nevertheless ended with sizable gains for the major indexes. The benchmark S&P 500 rose over 16% for the year, while the Nasdaq Composite led gains with a more-than 20% jump.\n\nNow the focus turns to 2026, though the year will likely begin in earnest come Monday. For stocks, the outlook calls for more optimism. Every Wall Street forecaster tracked by Bloomberg is predicting that stocks will rally for a fourth consecutive year . But plenty of risks remain: The AI boom could falter, the US economy could surprise, and President Trump, of course, remains a wild card as the fate of his most sweeping tariffs could become clearer this month.\nGold ( GC=F ) and silver ( SI=F ) advanced to open the 2026 trading year, with the precious metals building on their best annual performances since 1979, and aluminum ( ALI=F ) crossed $3,000 per ton for the first time since 2022.\n\nWall Street's bid for a \"Santa Claus rally\" — during the last five trading days of December and first two of January — has so far sputtered. The S&P 500 is down nearly 1% in the period, with investors looking at a third consecutive down \"Santa\" period.\nAmong the top items on Wall Street's 2026 list is the Federal Reserve, where the divisions that have gripped the central bank in 2025 look likely to continue this year. President Trump has promised this month to appoint a new chair to replace Jerome Powell. For now, most traders expect the central bank to hold steady on interest rates later this month, though bets are more split for March's meeting.\nLIVE 19 updates\n10 mins ago Ines Ferré\n\nDow, S&P 500 kick off the first day of trading with gains Stocks kicked off the first day of trading with modest gains as semiconductor stocks lifted the S&P 500 ( ^GSPC ).\nThe broad-based index gained nearl 0.2%, while the Dow Jones Industrial Average ( ^DJI ) rose 0.6%. The tech-heavy Nasdaq Composite ( ^IXIC ) fell just below the flatline.\nTech giant Microsoft ( MSFT ) fell 2% while Tesla ( TSLA ) declined more than 2% on the heels of disappointing deliveries.\n\nInvestors await Jan. 6 when the Consumer Electronics Show in Las Vegas kicks off, featuring Nvidia ( NVDA ) CEO Jensen Huang and AMD ( AMD ) CEO Lisa Su. Artificial intelligence will be front and center at the trade show.\n\n55 mins ago Ines Ferré\n\nCES 2026: What to expect from the tech industry’s biggest show of the year Inbox Yahoo Finance's Dan Howely reports:",
      "Language": "en"
    },
    {
      "Date": "2026-01-03",
      "Time": "03:34:30",
      "Source": "GuruFocus.com",
      "Title": "AMD Shares Are Climbing -- AI Memory Demand Fuels Analyst Optimism",
      "URL": "https://finance.yahoo.com/news/amd-shares-climbing-ai-memory-193430129.html",
      "Content": "AMD Shares Are Climbing -- AI Memory Demand Fuels Analyst Optimism\n\nNauman Khan\nFri, January 2, 2026 at 11:34 AM PST 1 min read\n\nIn this article: AMD\n\nThis article first appeared on GuruFocus .\nAdvanced Micro Devices ( NASDAQ:AMD ) shares climbed about 5% on Friday as analysts grew more upbeat about the company's earnings power.\nWarning! GuruFocus has detected 5 Warning Signs with AMD.\nIs AMD fairly valued? Test your thesis with our free DCF calculator.\n\nWall Street sees booming AI-related demand for high-performance computing and data-center memory as a key growth driver. New Ryzen and EPYC processors, along with refreshed AI accelerators, are strengthening AMD's product mix.\nTighter graphics-memory supply has supported higher GPU prices, helping margins, analysts say. Several brokerages have fine-tuned price targets and lifted estimates in recent sessions.\nTrading activity and technical signals point to strong buy sentiment, while AMD's market cap tops hundreds of billions, reflecting investor optimism.\nMany analysts expect memory revenue to remain strong into early 2026 as data centers shift from hard drives to faster SSDs, supporting long-term demand.\nAnalysts and investors will watch upcoming earnings, product rollouts and chip supply dynamics for signs that AI demand is sustainable into 2026.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-03",
      "Time": "03:34:26",
      "Source": "GuruFocus.com",
      "Title": "Intel Stock Rises as Panther Lake Launch and Foundry Ambitions Drive Optimism",
      "URL": "https://finance.yahoo.com/news/intel-stock-rises-panther-lake-193426097.html",
      "Content": "Intel Stock Rises as Panther Lake Launch and Foundry Ambitions Drive Optimism\n\nNauman Khan\nFri, January 2, 2026 at 11:34 AM PST 1 min read\n\nIn this article: INTC\n\nNVDA\n\nAMD\n\nTSM\n\nThis article first appeared on GuruFocus .\nIntel Corp ( NASDAQ:INTC ) shares rose about 5% on Friday as U.S. stocks are firmer to start 2026, as heavyweight chip names stabilized after late-2025 declines.\nInvestors are probing Intel's ( NASDAQ:INTC ) manufacturing roadmap and its ability to translate process gains into steadier earnings and foundry wins.\n\nA key focus is Panther Lake, Intel's next laptop processor on the 18A node, which is central to rebuilding its manufacturing edge.\nWarning! GuruFocus has detected 5 Warning Signs with AMD.\nIs AMD fairly valued? Test your thesis with our free DCF calculator.\nThe foundry narrative is mixed. Reuters reported Nvidia tested Intel's 18A process but did not proceed, while Intel said 18A work is progressing and seeing interest in its 14A technologies.\nNvidia's ( NASDAQ:NVDA ) $5 billion purchase of Intel shares underscores high-profile partnerships that may bolster confidence.\nTraders will watch Intel's quarterly update and data on manufacturing yields, with estimating earnings date of Jan. 29.\nCompetition from Advanced Micro Devices ( NASDAQ:AMD ) and Taiwan Semiconductor Manufacturing ( NYSE:TSM ) is a benchmark for Intel's progress.\nNear-term moves in Intel stock are likely to track chip-sector sentiment and macro data that shifts rate-cut expectations.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-03",
      "Time": "00:08:01",
      "Source": "Barchart",
      "Title": "Dear AMD Stock Fans, Mark Your Calendars for January 5",
      "URL": "https://finance.yahoo.com/m/5baf4bb2-4f60-384f-ae36-408d075d8ac9/dear-amd-stock-fans%2C-mark.html",
      "Content": "Dear AMD Stock Fans, Mark Your Calendars for January 5\n\nChris MacDonald\nFri, January 2, 2026 at 8:08 AM PST 3 min read\n\nIn this article: AMD\n\nNVDA\n\nAmong the world's largest semiconductor makers, Nvidia (NVDA) remains the go-to choice for investors. And rightfully so—looking at this stock's long-term chart, investors who have stuck with this name have outperformed the market by an incredible margin in recent decades.\nOf course, it's not just a one-horse race, regardless of what the media tries to tell you. Rival Advanced Micro Devices (AMD) is another top name worth considering, and one that's actually outperformed Nvidia on a year-to-date basis (YTD). Surging 77% to end 2025, AMD roughly doubled Nvidia's performance this year (the world's largest chipmaker still surged 39% higher in 2025, so not bad). Thus, there are plenty of eyeballs already on AMD as 2026 kicks off.\n\nMore News from Barchart NVDA, NKE, and CM: Bet on These 3 Stocks With Surging Unusual Options Activity for 2026 Gains\nAfter Record Runs for Western Digital and Sandisk in 2025, Consider This 1 Data Center Storage Stock for 2026\nCrowdStrike Insiders Are Offloading CRWD Stock. Should You?\nStop Missing Market Moves: Get the FREE Barchart Brief – your midday dose of stock movers, trending sectors, and actionable trade ideas, delivered right to your inbox. Sign Up Now!\nAs it turns out, there's another major catalyst on the horizon investors are watching when it comes to both companies. Analysts at Wedbush have pointed out that AMD's CEO, Lisa Su, is expected to make the keynote address at the upcoming Consumer Electronics Show (CES) in Las Vegas on this date, with the potential for a big announcement to come.\n\nWhy Is This Catalyst So Important for AMD? I think the key announcements for AMD for this coming year are indeed likely to come at this event. CES is the biggest show in the world when it comes to anything tied to consumer electronics and is honestly one of the key shows I've always wanted to attend, for this reason. Many CEOs are expected to make big product announcements, from technological upgrades to next-generation technology expected to be released over the course of the year.\n\nI'd expect to see a strong narrative from Lisa Su around the company's roadmap moving forward, and Wedbush analysts tend to agree. They think that some “significant” technological improvements to AMD's core Ryzen chips could be announced at this conference. Doing so may propel a range of mega-cap tech companies who are looking for reasons to buy AMD chips (at a lower price point) to do so. Especially if the output differential between these Ryzen chips and Nvidia's new Blackwell and Rubin chips isn't as wide as it appears now.\n\nStory Continues\nWe'll have to see, of course, what is ultimately announced. But any sort of meaningful improvements in AMD's core CPU chip technology could spur greater investor interest in 2026 and take this stock's recent momentum to new levels. It does appear that AMD has retained strong pricing power, reflected in the company's margins above. If these margins expand further in the coming quarters, and AMD can show a cash flow growth profile that's above Wall Street estimates, I certainly think this is a stock that could be off to the races.\n\nSo, What Does Wall Street Think? As it turns out, Wedbush is just one of 44 analysts currently covering AMD stock. With a consensus price target of $285.05 per share on AMD stock, analysts believe that this chipmaker could have roughly 33% upside from current levels.\nThat's a healthy potential gain for investors looking to add some momentum to their portfolios in 2026. Indeed, momentum-driven growth stocks have provided most of the gains in the markets over the course of the past decade and a half. Thus, for those who think this trend is likely to continue and risk-on sentiment will remain in the coming year, AMD's fundamentals do point in a very positive direction right now.\nOn the date of publication, Chris MacDonald did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-03",
      "Time": "00:01:04",
      "Source": "StockStory",
      "Title": "Why Are AMD (AMD) Shares Soaring Today",
      "URL": "https://finance.yahoo.com/news/why-amd-amd-shares-soaring-160104506.html",
      "Content": "Why Are AMD (AMD) Shares Soaring Today\n\nAnthony Lee\nFri, January 2, 2026 at 8:01 AM PST 2 min read\n\nIn this article: AMD\n\nWhat Happened? Shares of computer processor maker AMD (NASDAQ:AMD) jumped 5.3% in the morning session after investor optimism grew following favorable analyst predictions for 2026 and anticipation of new product announcements.\nThe move came as top Wall Street analysts predicted a potential 32% jump in the stock's value for 2026, building on significant gains from the previous year. This positive outlook was tied to AMD's role in the artificial intelligence sector, driven by demand for high-performance computing and data centers. Adding to the excitement were rumors that the company planned to reveal a new, faster Ryzen chip and a new generation of processors at the upcoming CES 2026 conference. AMD's stock also benefited from a broader rally in tech stocks, as fresh excitement surrounding the prospects of AI lifted the sector.\n\nAfter the initial pop the shares cooled down to $220.34, up 2.9% from previous close.\nIs now the time to buy AMD? Access our full analysis report here .\nWhat Is The Market Telling Us AMD’s shares are extremely volatile and have had 30 moves greater than 5% over the last year. In that context, today’s move indicates the market considers this news meaningful but not something that would fundamentally change its perception of the business.\nThe previous big move we wrote about was 14 days ago when the stock gained 6.8% on the news that investor optimism around artificial intelligence fueled broad market gains. Technology stocks with a focus on artificial intelligence once again led the market higher, boosting the Nasdaq and S&P 500. Companies at the forefront of the AI boom, such as Nvidia and Broadcom, saw significant jumps in their share prices. The rally reflects a renewed belief among investors in the transformative potential of AI technology to drive future growth and productivity. The rally was further supported by a surprise cooling in the November consumer price index (CPI) report, which triggered market pricing for additional rate cuts in the coming year. This created a more favorable environment for growth-oriented companies.\nInvestors who bought $1,000 worth of AMD’s shares 5 years ago would now be looking at an investment worth $2,387.\nThe 1999 book Gorilla Game predicted Microsoft and Apple would dominate tech before it happened. Its thesis? Identify the platform winners early. Today, enterprise software companies embedding generative AI are becoming the new gorillas. Click here for access to our special report that reveals one profitable leader already riding this wave .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-02",
      "Time": "23:36:41",
      "Source": "Yahoo Finance Video",
      "Title": "CES 2026 on deck: 3 things to keep an eye on",
      "URL": "https://finance.yahoo.com/video/ces-2026-deck-3-things-153641474.html",
      "Content": "CES 2026 on deck: 3 things to keep an eye on\n\nYahoo Finance Video\nFri, January 2, 2026 at 7:36 AM PST\n\nIn this video: AMD\n\nNVDA\n\nThe 2026 Consumer Electronics Show (CES) is coming up next week in Las Vegas.\nYahoo Finance Technology Editor Dan Howley sits down with Yahoo Finance Markets and Data Editor Jared Blikre on Market Catalysts to explain what investors should expect from the event and from key names like Nvidia ( NVDA ) and AMD ( AMD ).\nTo watch more expert insights and analysis on the latest market action, check out more Market Catalysts .\n\nVideo Transcript\n\n00:00 Jared\nCES is set to kick off in Las Vegas. Investors will be watching and listening closely to commentary from top CEOs. Last year's CES featured a flashy robot filled speech from Nvidia CEO Jensen Wang, who is scheduled to deliver a January 5th keynote. Here with the top three things to watch at the conference this year is Yahoo Finance Tech editor Dan Howley. Dan, great to see you here. What should investors keep in mind?\n00:27 Dan Howley\nYeah, Jaren, as you kind of pointed out, the the first things are going to be uh Jensen's keynote, uh as well as rival AMD CEO Lisa Sue's keynote. Uh both of them will be speaking on January 5th about their various offerings. This is the Consumer Electronics show. So, naturally, you can expect a number of consumer announcements, consumer focused announcements. That could be things like new graphics cards for gamers, uh new partnerships, things along those lines, but they've also expanded out\n01:00 Dan Howley\nto try to push more of their AI side uh of the business. So, you know, last year we saw Jensen talk about the robots as you kind of mentioned, uh their software offerings through Nvidia, as well as some of their future plans for smaller uh form factor devices which they released this year, uh a desktop kind of AI server that individuals can use on their own. Uh AMD did the same thing basically uh with their own event. And we're also going to be seeing some some announcements from Intel and Qualcomm. So, it really is going to focus primarily\n01:39 Dan Howley\nout of the gate on Nvidia uh and AMD. And then, you know, AI hardware is going to be another large part of the show. We've had uh, you know, companies like Microsoft, HP, Dell, uh any computer maker kind of discussing this idea of AI hardware when it comes to AI PCs. Not just that though. You could see some wearables that are AI focused, maybe some pendants, you know, things along those lines. Um, there's sure to be some vaporware mixed in there. Uh, you know, just products that get announced and then\n02:20 Dan Howley\nnever really see the light of day or they're just kind of looking for acquisitions down the line. Uh and so that those are some of the the other products. And then, you know, I think one of the other things that people really have uh kind of noticed over the years is the change for a lot of CES towards kind of an auto show uh motif where, you know, an entire hall is dedicated to automotives. and not just cars though, there's uh flying car concepts, uh different types of drones.\n02:56 Dan Howley\nLast year or the year before, there was a uh multi-ton uh Caterpillar dump truck that was supposed to have autonomous capabilities. John Deere uh is there. Uh there's a bunch of different boating companies. So transportation in general gets a lot of love uh at CES and we're expected to see more of that this year. Of course, AI will be a big part of that. Uh self-driving is a huge push, uh seeing a huge push. It's it's been kind of, you know, what one of the biggest announcements that we see at CES every year or\n03:33 Dan Howley\nkind of the prediction of when we'll get actual full self-driving. You know, there's still a bunch of kings to be worked out if you've seen any of the latest news out of Weimo. But uh it is much better than it was. Um but yeah, I mean it it it does seem as though this year is going to just be completely dominated by AI.\n03:55 Jared\nYou know, I love that we're still trying to make flying cars a thing. It's only been about 70 years. Maybe it's going to happen this year. But I want to talk to you about AI and the broad picture for 2026 because AI is appearing in everything right now and we're used to talking about large language models or LLM's. Now I've been talking about small language models or SLM slim with a number of guests and that is you you can put these these language models in a device and it can compute its own\n04:29 Jared\nAI. That's one trend, but uh what are some of the others or any comments on what I've said here?\n04:36 Dan Howley\nYeah, I mean, the those smaller language models, you'll see on uh things like those uh AIPCs, you know, uh Microsoft's been making a huge push with that. Uh as I said, along those, along uh the partner manufacturers, the HPs, uh Dells, things along those lines. Uh smartphone makers also lean heavily on those. But I think we'll just continue to see these kind of questions circle around the the eventual payoff with AI. Where where this actually does go. And you know, there's been survey after survey saying, oh, some companies are\n05:17 Dan Howley\nare doing great when it comes to AI, when it comes to getting a return or seeing improved uh uh efficiencies. Others times we've seen things where it says, well, companies aren't really seeing a return. I think that's going to continue to be a big part of this conversation with regards to AI. Uh also, how much money is going to be funneled into it uh is going to continue to be a big part of the conversation. You know, the the hyperscalers, hundreds of billions of dollars are being pumped in through uh data center build out. Uh that's going to\n05:54 Dan Howley\nbe a big topic of conversation, whether or not there'll be a pull back on spending, if Nvidia can keep it up. But, you know, I I think really it's going to be that kind of up and down that we saw over the last year where, you know, there was this sense of everything's great, you know, euphoria reigns, and then kind of the the storm clouds come in when there's any hint of bad news. Uh I think it's going to continue to kind of be that way in this year.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-02",
      "Time": "23:20:00",
      "Source": "Motley Fool",
      "Title": "Is This Fund the Ultimate Buy and Hold Investment for the Age of AI?",
      "URL": "https://finance.yahoo.com/m/13835878-457c-3088-9bc6-11367b48e840/is-this-fund-the-ultimate-buy.html",
      "Content": "Is This Fund the Ultimate Buy and Hold Investment for the Age of AI?\n\nWilliam Dahl, The Motley Fool\nFri, January 2, 2026 at 7:20 AM PST 5 min read\n\nIn this article: NVDA\n\nGOOG\n\nAMD\n\nKey Points Analysts are hotly debating whether Nvidia's position in the age of AI is unassailable.\nYet, it's impossible to know which winners will emerge in a few years' time.\nOne diversified fund with low fees and stellar performance offers a potential solution.\n10 stocks we like better than VanEck ETF Trust - VanEck Semiconductor ETF ›\n\nSome analysts say that semiconductor giant Nvidia (NASDAQ: NVDA) , whose chips have formed the backbone of the AI revolution so far, should be worried about Alphabet 's (NASDAQ: GOOGL) $900 billion project around tensor processing unit chips.\nOthers say that the OpenAI partnership with Advanced Micro Devices (NASDAQ: AMD) is suddenly threatening Nvidia's 90% market share for graphics processing units. Still others view Nvidia's position as unassailable, with Bank of America analyst Vivek Arya stating the company operates in a \"different galaxy\" than its competitors.\nYet many of us are old enough to remember when Nvidia stock lost a sixth of its value in January 2025, as China's AI chatbot DeepSeek rattled markets, with Wall Street terrified that an AI app made at a fraction of the cost of U.S. rivals could upend the industry.\nThis will be another year of record-breaking AI infrastructure spending, with the \"hyperscalers\" (companies building AI data centers at massive scale) forecast to spend $452.7 billion, according to Morningstar. Their combined capital expenditures will be four times greater than what the publicly traded U.S. energy sector spends to drill oil, refine and transport gasoline, and run large chemical plants.\n\nAnd here's one stunning fact: In the age of AI, Amazon 's capital expenditures are greater than that of America's entire energy sector combined.\nWith multi-trillion-dollar companies sparing no expense to win the AI boom, it's impossible to know which will rise or stumble in the looming wave of disruption. And apart from being unknowable, the question of who wins the battle for market share may be the wrong question to ask. At the end of the day, the AI revolution and the $15.7 trillion in wealth it could create may be big enough for everyone.\nA catch-all fund to play the $15.7 trillion wealth wave For investors seeking exposure to some of the most entrenched leaders of the AI revolution, the VanEck Semiconductor ETF (NASDAQ: SMH) is a straightforward play.\nThe exchange-traded fund, with its $37.6 billion in total net assets, is designed to track the returns, as closely as possible before fees and expenses, of the 25 largest and most liquid semiconductor firms. And since ChatGPT ushered in the age of AI in late 2022, its returns have been impressive.\n\nStory Continues\nOver the last three years, the fund has achieved an average annual return of 46.83%. This return leaves the tech-heavy Nasdaq Composite , with its three-year average annual gain of 31.12%, in the dust.\nAlas, these gains are in the past, and aren't reliable indicators of how the fund could perform going forward. But there are three reasons I like the VanEck Semiconductor ETF as a catch-all play to tap into the wave of AI-driven wealth creation without betting everything on one or two volatile stocks.\n\nFirst, the fund is diversified, with its largest holding, Nvidia, making up 21% of its portfolio. Its next largest holding, Taiwan Semiconductor Manufacturing , makes up just over 10% of the portfolio, while none of its other top 10 holdings crack double digits.\nBecause its methodology allows portfolio selection for both domestic and U.S.-listed foreign companies, the fund is geographically diversified as well. However, it is oriented toward large-cap companies, as it seeks to mirror the returns of the largest and most established semiconductor firms. This doesn't bother me, as I'm more interested in deep-pocketed firms that can spare no expense in protecting their industry leadership and even gain footholds in new markets.\nSecond, the fund offers at least a partial solution to investors who fear overvaluation in AI companies. The average price-to-earnings (P/E) ratio of its holdings, weighted as a percentage of its portfolio, amounts to 41.3. That means its shares trade at a premium relative to the broader market, but when you consider how fast its top holdings are growing earnings (at 65% year-over-year in Nvidia's case) it's far from the \"nosebleed valuation\" P/E ratios of around 200 seen at the eve of the dot.com bubble collapse.\n\nThirdly, the fund carries a modest expense ratio of just 0.35%, compared to the industry average of 0.56%. The below-average fee means that for every $10,000 invested, just $35 goes toward management fees.\nGiven the fund's stellar performance, both over the last three years and since its 2011 inception, in which shares have returned 26.8% on average each year, this management fee seems reasonable, to say the least. For investors who prioritize capital appreciation, diversification, and a simple and effective way to play the ongoing AI boom, the VanEck Semiconductor ETF is worthy of consideration.\nShould you buy stock in VanEck ETF Trust - VanEck Semiconductor ETF right now? Before you buy stock in VanEck ETF Trust - VanEck Semiconductor ETF, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and VanEck ETF Trust - VanEck Semiconductor ETF wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $505,641 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,143,283 !*\nNow, it’s worth noting Stock Advisor’s total average return is 974 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 29, 2025\nBank of America is an advertising partner of Motley Fool Money. William Dahl has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy .\nIs This Fund the Ultimate Buy and Hold Investment for the Age of AI? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-02",
      "Time": "23:05:00",
      "Source": "Barrons.com",
      "Title": "Nvidia, AMD, and Broadcom Are Facing Off. How the 2026 AI Chips Battle Is Shaping Up.",
      "URL": "https://finance.yahoo.com/m/addd5bdc-4a61-3d4e-868b-6eded84848ed/nvidia%2C-amd%2C-and-broadcom-are.html",
      "Content": "Nvidia, AMD, and Broadcom Are Facing Off. How the 2026 AI Chips Battle Is Shaping Up.\n\nAdam Clark\nFri, January 2, 2026 at 7:05 AM PST 5 min read\n\nIn this article: INTC\n\nAMD\n\nAVGO\n\nNVDA\n\nNvidia, AMD and Broadcom are planning big things this year year. These are the biggest developments to watch in the AI chip sector in 2026.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-02",
      "Time": "22:10:33",
      "Source": "Insider Monkey",
      "Title": "TD Cowen Names Advanced Micro Devices (AMD) One of its Best Ideas for 2026",
      "URL": "https://finance.yahoo.com/news/td-cowen-names-advanced-micro-141033407.html",
      "Content": "TD Cowen Names Advanced Micro Devices (AMD) One of its Best Ideas for 2026\n\nSheryar Siddiq\nFri, January 2, 2026 at 6:10 AM PST 2 min read\n\nIn this article: AMD\n\nAdvanced Micro Devices, Inc. (NASDAQ: AMD ) ranks among the best AI stocks to buy according to analysts . On December 2, TD Cowen restated its Buy rating and $290 price target for Advanced Micro Devices, Inc. (NASDAQ:AMD), naming it one of its “Best Ideas 2026” as the company prepares to unveil its Helios AI platform. Despite recent share price decline, the firm expressed optimism about AMD’s position in the artificial intelligence computing industry, stating that the current prices offer “an attractive entry point” for investors ahead of key product launches.\nWhile acknowledging the potential of instability in the AI industry, TD Cowen highlighted AMD’s hardware roadmap, advancements in building its ROCm software ecosystem, and client successes as factors supporting its optimistic view of the company’s AI computing approach.\nThe firm particularly emphasized that the future Helios rack and MI450 products represent “a key inflection in AMD’s story beginning in mid-2026,” and it advised investors to buy the stock before this expected period of growth.\n\nAt the same time, AMD is intensifying its MI300 accelerators and preliminary work on the MI400 line. Over the coming years, both chip families are anticipated to be crucial to the company’s AI progress. Demand, according to management, is expanding beyond early showcase clients, with interests ranging from cloud providers to businesses.\nAdvanced Micro Devices, Inc. (NASDAQ:AMD) designs and builds high-performance computing, graphics, and AI technologies used across data centers, PCs, and emerging AI workloads.\nWhile we acknowledge the potential of AMD as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 10 Best Magic Formula Stocks for 2025 and 10 Best Retirement Stocks to Buy According to Hedge Funds .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-02",
      "Time": "22:05:52",
      "Source": "Yahoo Finance",
      "Title": "CES 2026: What to expect from the tech industry’s biggest show of the year",
      "URL": "https://finance.yahoo.com/news/ces-2026-what-to-expect-from-the-tech-industrys-biggest-show-of-the-year-140552142.html",
      "Content": "CES 2026: What to expect from the tech industry’s biggest show of the year\n\nDaniel Howley · Technology Editor\nFri, January 2, 2026 at 6:05 AM PST 4 min read\n\nIn this article: NVDA\n\nAMD\n\nINTC\n\nQCOM\n\nMETA\n\nWelcome to 2026. Now rinse out that champagne glass and pop some Advil because the tech industry’s biggest show of the year, CES, kicks off on Jan. 6 under the bright lights of Las Vegas.\nCompanies big and small will take over the famed Strip and Las Vegas Convention Center, debuting their latest and greatest offerings, and a good helping of fly-by-night products that’ll never see the light of day.\n\nWhile the show officially begins on Jan. 6, the festivities start a few days earlier with events like CES Unveiled and press conferences featuring Nvidia ( NVDA ) CEO Jensen Huang and AMD ( AMD ) CEO Lisa Su. And that means you can expect artificial intelligence to be front and center at the trade show.\nThat will include everything from AI-focused PCs to new chips. But robots are looking like they’ll steal the spotlight in 2026.\n“​Every year CES has a theme. And sometimes you don't know what it is until you get to the show, and everybody's talking about it” explained Kinsey Fabrizio, president of the Consumer Technology Association trade organization, which runs CES.\n“But we can tell you right now, robotics is going to be talked about … big time at CES.”\n\nYahoo Finance will be live and in person in Vegas bringing you all of the latest news and announcements. Here’s what we’re anticipating at CES 2026.\nWhat to expect at CES CES has become a kind of battleground for chipmakers and designers to show off their wares to the world right alongside their biggest rivals.\nLast year, Nvidia was the talk of Las Vegas when Huang held a keynote in front of a massive audience at the Michelob Ultra Arena, debuting the company's newest lineup of gaming chips, a desktop-sized AI rig, and a variety of AI software services and platforms.\nThis year, you can expect even more from the company that closed out 2025 with a $4.5 trillion market cap. Huang, who is scheduled to take the stage at 1:00 p.m. PT on Jan. 5 will likely unveil new gaming offerings, as well as a host of AI apps and capabilities.\nAMD’s Su will then host her own keynote a few hours later at 6:30 p.m. PT, giving that company’s rebuttal to Nvidia’s announcements and providing updates on its own gaming and AI products.\n\nJim Johnson, Senior vice president and GM of Intel's ( INTC ) Client Computing Group, which covers sales of the company’s chips for consumer and enterprise PCs, will also hold a keynote at CES 2026 where he’s expected to provide updates on Intel’s Core Ultra Series 3, codenamed Panther Lake, chips.\nThe processors, which Intel initially revealed in October, are the first to use the company’s highly anticipated 18A chip technology, and are a key part of its broader turnaround effort.\n\nStory Continues\nQualcomm ( QCOM ) will also be on hand at CES, with CEO Cristiano Amon set to participate in a fireside chat with Fortune’s Andrew Nusca. Qualcomm launched its Snapdragon X-series processors for Windows PCs during CES 2025 and will likely build on that momentum at this year’s event.\nEach of the chipmakers will likely provide insights into their plans to power physical AI systems, a technical term for robots, during the show.\nExpect to see humanoid robots on display, as well as a number of robotic arms, AI-powered drones, and self-driving cars scattered across Las Vegas this year, as the industry looks to rapidly advance the technology.\nSpeaking of cars, CES has become a major showcase for the auto industry’s tech ambitions, and this year will be no different. The show will likely include flying car concepts, a mainstay in recent years, as well as a variety of ways car companies are looking to capitalize on the AI trend by incorporating the technology into their vehicles’ dashboards.\n\nAI-powered wearables and fitness trackers could also make their debut at CES 2026. Those can come in the form of smart rings, glasses, or pins. The smart glasses space in particular has gained plenty of attention with the launch of Meta’s ( META ) Ray-Ban Display glasses in September, and Google ( GOOG , GOOGL ) and Samsung planning their own smart glasses.\nApple ( AAPL ) is also reportedly looking to get into the smart glasses game, though the company eschews making an appearance at CES in favor of hosting its own highly polished events at its headquarters in Cupertino, Calif., throughout the year.\nNaturally, there are sure to be some outlandish products at CES 2026. Over the years, we’ve seen everything from smart toilets to forks designed to help you eat healthier foods.\nIt’s sure to be an interesting show, and Yahoo Finance will bring you all of the biggest announcements as they happen.\nEmail Daniel Howley at dhowley@yahoofinance.com. Follow him on Twitter at @DanielHowley .\nFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here\nRead the latest financial and business news from Yahoo Finan ce.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-02",
      "Time": "21:58:00",
      "Source": "Zacks",
      "Title": "Can Intel Stock Replicate Its Stellar 2025 Performance This Year?",
      "URL": "https://finance.yahoo.com/news/intel-stock-replicate-stellar-2025-135800134.html",
      "Content": "Can Intel Stock Replicate Its Stellar 2025 Performance This Year?\n\nSupriyo Bose\nFri, January 2, 2026 at 5:58 AM PST 6 min read\n\nIn this article: INTC\n\nNVDA\n\nAMD\n\nDespite a lackluster performance in the first half of 2025, Intel Corporation INTC stock hit a purple patch in the later stages of the year to script a remarkable turnaround. It gained 84.1% in 2025 compared with the industry’s growth of 35.9%, outperforming peers Advanced Micro Devices, Inc. AMD and NVIDIA Corporation NVDA. While NVIDIA stock was up 38.8%, Advanced Micro gained 77.3% over the year.\nINTC Stock Price Performance in 2025\n\nImage Source: Zacks Investment Research\nINTC Rides on AI PC Gamble Intel is witnessing healthy traction in artificial intelligence (AI) PCs that have taken the market by storm. The company has previewed Intel Core Ultra series 3 processor (code-named Panther Lake) and Xeon 6+ (code-named Clearwater Forest) in third-quarter 2025. Manufactured in a new, state-of-the-art factory in Chandler, AZ, both products are built on Intel 18A, the most advanced semiconductor process in the United States. Panther Lake is designed to power a broad spectrum of consumer and commercial AI PCs, gaming devices and edge solutions. Clearwater Forest is an E-core server processor that enables business enterprises to scale workloads, reduce energy costs and power more intelligent services. While Panther Lake will be available in the broad market from January, Clearwater Forest is slated to be launched in the first half of 2026.\n\nThe company has introduced Intel Core Ultra, which features a neural processing unit that enables power-efficient AI acceleration with 2.5x better power efficiency than the previous generation. With superior GPU and CPU capabilities, it can speed up AI solutions. The company also launched the new vPro platform with an Intel Core Ultra processor that delivers enhanced power efficiency. With dedicated AI acceleration capability spread across the CPU, GPU and the new neural processing unit, it will unlock an endless new wave of AI experiences across all apps. This is likely to give healthy competition to NVIDIA and Advanced Micro’s new GPU lineups for PC gaming.\n\nCapital Infusion Spurs Growth Engine Intel has secured a $5 billion investment from NVIDIA to jointly develop cutting-edge solutions that are likely to play an integral role in the evolution of the AI infrastructure ecosystem. Leveraging the core strengths of both firms, namely NVIDIA’s AI and accelerated computing and Intel’s CPU technologies and x86 ecosystem, the collaboration is expected to sow the seeds of innovation through the development of state-of-the-art custom data center and PC products.\n\nIn August 2025, Softbank invested $2 billion in Intel to propel AI research and development initiatives that support digital transformation, cloud computing and next-generation infrastructure. The investment enabled Softbank to gain about 2% ownership in Intel, with the former paying $23 per share. This followed $7.86 billion in direct funding from the U.S. Department of Commerce under the U.S. CHIPS and Science Act to advance critical semiconductor manufacturing and advanced packaging projects in Arizona, New Mexico, Ohio and Oregon. The significant capital infusions have enabled Intel to expand its manufacturing capacity to accelerate its IDM 2.0 (Integrated Device Manufacturing) strategy.\n\nLire la suite\nINTC Hurt by Persistence With Legacy Products Despite the uptrend, it appears that Intel has a lot of work to do to catch up with its rivals. While most competitors evolved with changing demand patterns, Intel fell behind others as it clung to its legacy products. For example, despite making significant inroads in AI chips, Intel lagged NVIDIA on the innovation front with the latter’s H100 and Blackwell GPUs being runaway successes. This offered a competitive advantage to NVIDIA, with leading technology companies reportedly piling up NVIDIA’s GPUs to build clusters of computers for their AI work.\n\nMoreover, Intel has been facing challenges due to the disruptive rise of over-the-top service providers in this dynamic industry. This has affected its margins. Price-sensitive competition for customer retention in the core business is expected to intensify in the coming days. An accelerated ramp-up of AI PCs has significantly affected Intel’s short-term margins, as it shifted production to its high-volume facility in Ireland, where wafer costs are typically higher. Margins were also adversely impacted by higher charges related to non-core businesses, charges associated with unused capacity and an unfavorable product mix. Competitive pricing pressure from rivals has further dented its profitability.\n\nImage Source: Zacks Investment Research\nU.S.-China Trade Skirmishes Impair INTC Growth Prospects China accounted for more than 29% of Intel's total revenues in 2024, making it the single largest market for the company. However, the communist nation's purported move to replace U.S.-made chips with domestic alternatives significantly affected INTC’s revenue prospects. The directive to phase out foreign chips from key telecom networks by 2027 underscores Beijing's accelerating efforts to reduce reliance on Western technology amid escalating U.S.-China trade and tariff tensions.\n\nAs Washington tightens restrictions on high-tech exports to China, Beijing has intensified its push for self-sufficiency in critical industries. This shift poses a dual challenge for Intel, as it faces potential market restrictions and increased competition from domestic chipmakers. In addition, weaker spending across consumer and enterprise markets, especially in China, resulted in elevated customer inventory levels.\n\nEstimate Revision Trend for INTC Earnings estimates for Intel for 2025 have moved down 63% to 34 cents over the past year, while the same for 2026 has declined 63.8% to 58 cents. The negative estimate revision depicts bearish sentiments for the stock.\n\nImage Source: Zacks Investment Research\nEnd Note Intel's innovative AI solutions hold immense promise for the broader semiconductor ecosystem. By addressing the challenges of scalability, performance and interoperability, the company is paving the way for widespread AI adoption across enterprises worldwide. Management is focusing on simplifying parts of its portfolio to unlock efficiencies and create value. Significant capital infusion to revive its lost glory is likely to spur growth. All these efforts appear to resonate well, as exhibited by an uptrend in the stock price performance.\n\nHowever, the recent product launches appear “too little too late” for Intel. In addition, margin woes amid strict export restrictions, unfavorable product mix and elevated customer inventory levels weigh on its bottom line. Declining earnings estimates remain an overhang. With a Zacks Rank #3 (Hold), Intel appears to be treading in the middle of the road, and investors could be better off if they exercise caution. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nCGU et Politique de confidentialité\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-02",
      "Time": "21:57:00",
      "Source": "Zacks",
      "Title": "MRVL's Custom Silicon Business Scales Up: What's Coming Next?",
      "URL": "https://finance.yahoo.com/news/mrvls-custom-silicon-business-scales-135700350.html",
      "Content": "MRVL's Custom Silicon Business Scales Up: What's Coming Next?\n\nSubham Roy\nFri, January 2, 2026 at 5:57 AM PST 3 min read\n\nIn this article: MRVL\n\nAVGO\n\nAMD\n\nMarvell Technology 's MRVL AI XPU offerings are experiencing massive traction among hyperscalers, AI data centers and high-performance computing workloads. In the third quarter of fiscal 2026, Marvell Technology’s data center segment posted revenues of $1.52 billion, growing 37.8% year over year, led by strong traction in custom XPU silicon products.\n\nMarvell Technology expects its custom silicon business to roughly contribute to one-fourth of its overall data center revenues and grow at least 20% next year. The company recently unveiled 18 XPU and XPU-attach socket design wins, among which many are already in volume production.\nThese design wins include full custom XPU programs, XPU-attached silicon, electrical I/O chiplets integrated inside multi-die XPU packages and other products, contributing to a pipeline of more than 10% of a $75 billion lifetime revenue funnel. MRVL’s custom silicon strategy has evolved from a niche application-specific integrated circuit (ASIC) offering into a deeply embedded, multi-year hyperscaler partnership model.\nNow, Marvell Technology develops custom ASIC designs for AI, cloud data center and OEM customers using its advanced 5nm and 3nm processes like 112G XSR serializer/de-serializer (SerDes), Long Reach SerDes, PCIe Gen 6 SerDes. These capabilities enable MRVL to stay ahead of its competitors in the custom AI silicon space.\n\nHow Competitors Fare Against MRVL Broadcom AVGO is one of the leading suppliers of custom silicon solutions for data center, service provider and enterprise networking customers. Broadcom’s advanced 3.5D XDSiP packaging platform is specifically designed to enhance the performance and efficiency of custom AI XPUs.\nAdvanced Micro Devices AMD is another player in the custom silicon solutions and AI accelerator space with its semi-custom SoC offerings and Instinct Accelerators that power numerous data centers. Advanced Micro Devices’ reconfigurable Alveo Adaptable Accelerator Cards are used to speed up compute-intensive applications in data centers.\n\nWhile Broadcom and Advanced Micro Devices are formidable players in the custom silicon space for AI acceleration, Marvell Technology’s deep partnership with NVIDIA provides MRVL necessary support to sustain in this space.\nMRVL's Price Performance, Valuation and Estimates Shares of Marvell Technology have gained 13.1% in the past six months compared with the Electronics - Semiconductors industry’s growth of 22.3%.\nMRVL 6-Month Performance Chart\nImage Source: Zacks Investment Research\nFrom a valuation standpoint, Marvell Technology is trading at a forward price-to-sales ratio of 7.31X, lower than the industry’s average of 8.46X.\n\nStory Continues\nMRVL Forward 12-Month (P/S) Valuation Chart\nImage Source: Zacks Investment Research\nThe Zacks Consensus Estimate for MRVL’s fiscal 2026 and 2027 earnings implies year-over-year growth of 81% and 26%, respectively. The estimates for fiscal 2026 and fiscal 2027 have been revised upward in the past 30 days.\n\nImage Source: Zacks Investment Research\nMarvell Technology currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nMarvell Technology, Inc. (MRVL) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-02",
      "Time": "21:49:27",
      "Source": "GOBankingRates",
      "Title": "We Asked ChatGPT What the Top-Performing Stocks of 2026 Will Be: Do Investing Experts Agree?",
      "URL": "https://finance.yahoo.com/news/asked-chatgpt-top-performing-stocks-134927621.html",
      "Content": "We Asked ChatGPT What the Top-Performing Stocks of 2026 Will Be: Do Investing Experts Agree?\n\nVance Cariaga\nFri, January 2, 2026 at 5:49 AM PST 4 min read\n\nIn this article: NVDA\n\nMSFT\n\n^GSPC\n\n^IXIC\n\nGOOG\n\nThe stock markets have a hard act to follow in 2026 after setting record highs in 2025. As of the market close on Dec. 30, 2025, the S&P 500 was up by about 17.5% for the year, while the Nasdaq had gained 21.5% and the Dow was up 14.1%.\nWhile it’s hard to predict what’s in store for 2026, some stocks seem poised to keep pushing higher. Which ones will be the top performers in 2026? GOBankingRates asked ChatGPT — and the stocks it picked include some of the hottest names on Wall Street.\n\nHere are the top four stocks picked by ChatGPT, along with its key points about the picks and what other experts have to say .\nNvidia (NVDA) The first stock pick on ChatGPT’s list was Nvidia. Here were its strengths, risks and what to keep an eye on, per ChatGPT.\nStrengths: It’s considered a “top growth stock” thanks to its leadership in graphics processing units (GPUs) for artificial intelligence (AI) data centers. “As long as data center build-out and AI compute demand continue, NVDA could benefit,” ChatGPT said.\nRisks: It has a very high valuation, and there’s also supply chain/export/competitive risk. “If AI hype slows, the multiple could contract,” ChatGPT explained.\nWhat to keep an eye on in 2026: Earnings growth, new GPU launches, data center contract pipeline and margin trends.\n\nNot everyone believes Nvidia’s momentum is sustainable. Among the skeptics is Chad Cummings, an attorney and CPA at Cummings & Cummings Law who previously worked in finance and tax with American Airlines, PwC and JPMorgan Chase.\n“The Nvidia train is running out of steam,” he told GOBankingRates. “We are advising clients to exit their positions before year-end. Its growth depends on hyperscalers continuing unsustainable data center expansion. One slowdown or energy bottleneck unravels the narrative.”\nRead More: Self-Made Millionaires Suggest 5 Stocks You Should Never Sell\nCheck Out: 9 Low-Effort Ways To Make Passive Income (You Can Start This Week)\nMicrosoft (MSFT) Next up on ChatGPT’s list was Microsoft, and it cited these strengths, weaknesses and key factors to keep an eye on.\nStrengths: It’s considered a leading AI infrastructure/cloud play moving into 2026 with a “strong recurring revenue base” and “large market share in cloud, enterprise and AI tools,” per ChatGPT.\nRisks: Its stock growth could decelerate due to “valuation crowding,” meaning shares might soon be seen as overvalued.\nWhat to keep an eye on in 2026: Growth in Microsoft’s cloud computing service business, as well as continued AI product launches.\nDespite Microsoft’s robust growth and strong AI position, Cummings called the company “particularly worrisome” because of potential legal and performance problems.\n\nStory Continues\n“Embedding AI in core enterprise tools without clear indemnity invites securities fraud, employment discrimination and professional malpractice claims,” he said. “Several memes have been making the rounds on finance blogs … showing that Microsoft’s integration of AI into Excel produces comedically false mathematical results.”\n\nAlphabet (GOOGL) The parent company of Google also made ChatGPT’s list. Here are some key things to note.\nStrengths: Growth in its ad/search business, along with potentially lucrative AI investments , are key strengths.\nRisks: Ad revenue could slow, while the company’s ambitious, innovation-focused Moonshot Factory business “might not pay off” in 2026.\nWhat to keep an eye on in 2026: Ad revenue trends, cloud growth and new product/AI service announcements.\n\nMany analysts remain bullish on Alphabet’s prospects. In November, Loop Capital analyst Rob Sanderson changed his rating from a “Hold” to a “Buy” on the stock, per TheStreet .\nHis reasoning for the upgrade was that Google has proved that its dominance isn’t going anywhere, as reported by TheStreet.\nAdvanced Micro Devices (AMD) Last on the list for ChatGPT was Advanced Micro Devices. Here are some of its key strengths and risks, as well as what investors should eye in 2026.\nStrengths: It’s seen AI/data center revenue growth and recent large contract wins.\nRisks: It faces competition from companies such as Nvidia and Intel, along with “margin pressure” and “execution risk,” per ChatGPT.\nWhat to keep an eye on in 2026: Data-center GPU revenue growth and contract announcements.\n\nIn a recent analysis, The Motley Fool predicted that Advanced Micro Devices will become a trillion-dollar company by 2030. To get there, its market cap (currently about $350 billion) will have to rise by around 185% over the next four years.\nTo back up its claim, The Motley Fool pointed to a deal the company recently signed with OpenAI to deploy six gigawatts of AMD data center chips by 2030. It also praised AMD’s CPU/GPU business for PCs, which has “steadily gained market share over the past decade.”\nMore From GOBankingRates\nNearly 1 in 3 Americans Hit by a Costly Holiday Scam, Norton Survey Shows -- How To Avoid This\nHere's What Retirees Wasted the Most Money On in 2025 -- and How To Avoid It in 2026\nHow Middle-Class Earners Are Quietly Becoming Millionaires -- and How You Can, Too\n6 Safe Accounts Proven to Grow Your Money Up to 13x Faster\nThis article originally appeared on GOBankingRates.com : We Asked ChatGPT What the Top-Performing Stocks of 2026 Will Be: Do Investing Experts Agree?\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-02",
      "Time": "20:54:43",
      "Source": "Insider Monkey",
      "Title": "Advanced Micro Devices (AMD) is Gaining on Several Fronts",
      "URL": "https://finance.yahoo.com/news/advanced-micro-devices-amd-gaining-125443388.html",
      "Content": "Advanced Micro Devices (AMD) is Gaining on Several Fronts\n\nSoumya Eswaran\nFri, January 2, 2026 at 4:54 AM PST 3 min read\n\nIn this article: AMD\n\nAlpha Wealth Funds, LLC, an investment management company, released its Q3 2025 letter for the “Insiders Fund”. A copy of the letter can be downloaded here . The fund returned 4.96% in September, bringing the YTD returns to 21.37%. This compares to the benchmark, S&P 500 September return of 3.65% and the year-to-date return through September 30, 2025, of 14.83%. In addition, please check the fund’s top five holdings to know its best picks in 2025.\n\nIn its third-quarter 2025 investor letter, Alpha Wealth Insiders Fund highlighted stocks such as Advanced Micro Devices, Inc. (NASDAQ: AMD ). Advanced Micro Devices, Inc. (NASDAQ:AMD) is a semiconductor company that operates through Data Center, Client, Gaming, and Embedded segments. The one-month return of Advanced Micro Devices, Inc. (NASDAQ:AMD) was -0.84%, and its shares gained 77.53% of their value over the last 52 weeks. On December 31, 2025, Advanced Micro Devices, Inc. (NASDAQ:AMD) stock closed at $214.16 per share, with a market capitalization of $348.661 billion.\nAlpha Wealth Insiders Fund stated the following regarding Advanced Micro Devices, Inc. (NASDAQ:AMD) in its third quarter 2025 investor letter:\nAdvanced Micro Devices, Inc. (NASDAQ:AMD) is in 19th position on our list of 30 Most Popular Stocks Among Hedge Funds . According to our database, 115 hedge fund portfolios held Advanced Micro Devices, Inc. (NASDAQ:AMD) at the end of the third quarter, up from 113 in the previous quarter. While we acknowledge the potential of Advanced Micro Devices, Inc. (NASDAQ:AMD) as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\n\nStory Continues\nIn another article , we covered Advanced Micro Devices, Inc. (NASDAQ:AMD) and shared the list of new stocks in David Tepper’s portfolio. In addition, please check out our hedge fund investor letters Q3 2025 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-02",
      "Time": "20:14:00",
      "Source": "Barrons.com",
      "Title": "Nvidia, AMD and Broadcom Are Facing Off. How the 2026 AI Chips Battle Is Shaping Up.",
      "URL": "https://finance.yahoo.com/m/addd5bdc-4a61-3d4e-868b-6eded84848ed/nvidia%2C-amd-and-broadcom-are.html",
      "Content": "Nvidia, AMD and Broadcom Are Facing Off. How the 2026 AI Chips Battle Is Shaping Up.\n\nAdam Clark\nFri, January 2, 2026 at 4:14 AM PST 5 min read\n\nIn this article: NVDA\n\nINTC\n\nAMD\n\nAVGO\n\nNvidia, AMD and Broadcom are planning big things this year year. These are the biggest developments to watch in the AI chip sector in 2026.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-02",
      "Time": "19:37:08",
      "Source": "Simply Wall St.",
      "Title": "AI Chips Update - EdgeMode Expands AI Infrastructure With Strategic Spanish Developments",
      "URL": "https://finance.yahoo.com/news/ai-chips-edgemode-expands-ai-113708853.html",
      "Content": "AI Chips Update - EdgeMode Expands AI Infrastructure With Strategic Spanish Developments\n\nSimply Wall St\nFri, January 2, 2026 at 3:37 AM PST 2 min read\n\nIn this article: EDGM\n\nMU\n\nAMD\n\nNVDA\n\nRecent developments in the AI chip sector have been highlighted by EdgeMode Inc.'s year-end shareholder letter, detailing significant advancements in their AI data center portfolio in Spain. The company has secured a 1.5GW capacity through definitive agreements, aiming to position itself as a major AI infrastructure developer in Europe. Key initiatives include transitioning the Spanish sites towards construction readiness and integrating Battery Energy Storage Systems (BESS) to enhance recurring revenues through margin trading with the Spanish grid. Additionally, EdgeMode is focused on reducing shareholder dilution and expanding its business model internationally, indicating strategic growth plans as they move into 2026.\n\nIn other trading, Winbond Electronics was a notable mover up 9.9% and ending trading at NT$90.80, close to the 52-week high. In the meantime, Jentech Precision Industrial trailed, down 5.6% to close at NT$2,590.00.\nMicron Technology is strategically poised to capitalize on rising demand for advanced AI memory solutions. Discover more about Micron's innovative strides and market potential by clicking here.\nMake sure to revisit our Market Insights article on AI Chips, where we explored the critical role of AI companies in the bond market and the potential risks and opportunities therein. Get in fast to understand the full implications on your investments.\nBest AI Chip Stocks Advanced Micro Devices settled at $214.16 down 0.5%.\nNVIDIA closed at $186.50 down 0.6%. This week, NVIDIA is in advanced talks to acquire AI21 Labs for up to $3 billion, with a focus on expanding its AI expertise and presence in Israel.\nMicron Technology closed at $285.41 down 2.5%, near its 52-week high.\n\nWhere To Now? Dive into all 87 of the AI Chip Stocks we have identified, like Semiconductor Manufacturing International , ON Semiconductor and Nova , right here.\nReady To Venture Into Other Investment Styles? Rare earth metals are an input to most high-tech devices, military and defence systems and electric vehicles. The global race is on to secure supply of these critical minerals. Beat the pack to uncover the 38 best rare earth metal stocks of the very few that mine this essential strategic resource.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nStory Continues\nSources:\nSimply Wall St\n\"EdgeMode Issues Year-End Shareholder Letter Reflecting on 2025 Milestones and Momentum Heading Into 2026\" from EdgeMode Inc. on GlobeNewswire (published 31 December 2025)\nCompanies discussed in this article include TWSE:2344 NasdaqGS:AMD NasdaqGS:NVDA NasdaqGS:MU and TWSE:3653.\nThis article was originally published by Simply Wall St .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "20:50:00",
      "Source": "Motley Fool",
      "Title": "3 High-Conviction AI Stocks With 10x Potential by 2036",
      "URL": "https://finance.yahoo.com/m/9c29f981-93c8-38d2-ba0f-1ab380466f89/3-high-conviction-ai-stocks.html",
      "Content": "3 High-Conviction AI Stocks With 10x Potential by 2036\n\nWill Healy, The Motley Fool\nThu, January 1, 2026 at 4:50 AM PST 5 min read\n\nIn this article: UPST\n\nAMD\n\nCRWV\n\nNVDA\n\nPLTR\n\nKey Points AMD is on track to become a growing competitive threat to Nvidia.\nCoreWeave's artificial intelligence (AI)-specific cloud ecosystem is benefiting from rapidly rising demand.\nUpstart could disrupt the loan evaluation market with its AI-driven tool.\n10 stocks we like better than Advanced Micro Devices ›\n\nArtificial intelligence (AI) stocks have sent the market higher, as some stocks in this part of the tech industry have brought outsized gains to numerous investors. Palantir 's gain of more than 32-fold from its low in 2022 is one notable example.\nThe best part of the AI story is that it has probably just begun. Grand View Research forecasts a compound annual growth rate (CAGR) of 31% through 2033.\nThat probably means other stocks hold the potential for 10-fold gains by 2036. While a lot can happen in 10 years, these stocks are on track to make such gains as they help advance AI.\n1. AMD Advanced Micro Devices (NASDAQ: AMD) may seem like a strange choice. For one, it lags market leader Nvidia in the AI chip industry, and it's up more than 13,000% from its 2015 lows.\nStill, AMD is on track to become the first company with the potential to match or possibly catch up to Nvidia in the AI accelerator market. The company has made the claim that its upcoming MI450 accelerator will accomplish that goal, and it will probably be onward and upward if it can meet that expectation.\n\nAdditionally, AMD's CPUs still make it a force in the PC market, and its gaming and embedded segments will also benefit from the technology it has developed.\nMoreover, AMD forecasts a 30% CAGR for revenue over the long term, with that rising to a 60% revenue CAGR for the data center segment that designs its AI accelerators.\nInvestors may have already begun to take notice, as AMD stock is up over 70% over the last year. Also, while its 105 P/E ratio could deter some investors, it's probable that others will buy shares at its current forward P/E ratio of 53. Such levels make it easier to take a chance on this increasingly influential AI giant.\n2. CoreWeave CoreWeave (NASDAQ: CRWV) has begun to emerge as a leading AI cloud platform.\nIndeed, tech giants like Amazon 's AWS and Microsoft 's Azure lead the overall cloud market. Still, CoreWeave has built a competitive advantage with a cloud specifically tailored for AI workloads, particularly when its ecosystem works with Nvidia's GPUs.\nAdditionally, CoreWeave takes on a task most companies don't want to do themselves, namely building and maintaining data centers. This means more organizations will probably turn to CoreWeave rather than taking on this task in-house.\n\nStory continues\nThat demand is so strong that in the first nine months of 2025, revenue rose by 204% yearly to almost $3.6 billion. Still, costs and expenses surged 263% over the same period due to the cost of meeting that fast-growing demand.\nConsequently, interest expenses nearly quadrupled to $841 million during that time. Despite that increase, the net loss in the first three quarters of 2025 was $771 million, down from the loss of $857 million in the same year-ago period.\n\nAdmittedly, those losses and a sell-off in AI stocks in recent months may partially explain why CoreWeave stock sells at around a 60% discount from its 52-week-high. Still, with a price-to-sales (P/S) ratio of just above 7, that bargain valuation and its rapid growth potentially set the stock up for massive gains.\n3. Upstart Holdings Upstart (NASDAQ: UPST) has drawn attention for its AI-driven loan evaluation tool. Fair Isaac 's FICO score has dominated this market since 1989. However, that model has not significantly changed over the years. This creates the potential opportunity for Upstart to disrupt the market and capitalize on the \"$1 trillion opportunity\" in its industry.\n\nUpstart's model utilizes more than 2,500 variables, applying AI to make its assessments. Moreover, its model now makes 91% of these assessments without human intervention. Also, in 2024, it's estimated that it could approve 101% more applicants than traditional tools due to its model's risk separation abilities.\nLike numerous tech stocks, Upstart tumbled earlier in the decade amid rising interest rates. Now, with interest rates falling again, revenue in the first nine months of 2025 was $685 million, a 57% rise from year-ago levels. With that, it has returned to profitability, earning $35 million during the same period.\nDespite those improvements, macroeconomic worries have weighed on Upstart this year, and the stock is still down 88% from its post-pandemic high.\n\nNonetheless, at a P/S ratio of about 5, investors can buy Upstart stock at a relatively low price. Considering the company's disruptive potential in the loan evaluation market, an eventual recovery is well within the realm of possibility.\nShould you invest $1,000 in Advanced Micro Devices right now? Before you buy stock in Advanced Micro Devices, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Advanced Micro Devices wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $505,749 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,149,658 !*\nNow, it’s worth noting Stock Advisor’s total average return is 979 % — a market-crushing outperformance compared to 195% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 29, 2025\nWill Healy has positions in Advanced Micro Devices, CoreWeave, and Upstart. The Motley Fool has positions in and recommends Advanced Micro Devices, Amazon, Microsoft, Nvidia, Palantir Technologies, and Upstart. The Motley Fool recommends Fair Isaac and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\n3 High-Conviction AI Stocks With 10x Potential by 2036 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "02:16:00",
      "Source": "MarketBeat",
      "Title": "Advanced Micro Devices Is the Most Compelling AI Trade for 2026",
      "URL": "https://finance.yahoo.com/m/89c85186-033a-3db5-a1ec-bc9ea96ae894/advanced-micro-devices-is-the.html",
      "Content": "Advanced Micro Devices Is the Most Compelling AI Trade for 2026\n\nThomas Hughes, MarketBeat\nWed, December 31, 2025 at 10:16 AM PST 4 min read\n\nIn this article: AMD\n\nNVDA\n\nKey Points Advanced Micro Devices is the most compelling AI trade for 2026 because of its MI450 product launch.\nRevenue and earnings will surge dramatically as soon as the first quarter of availability, and analysts underestimate the strength.\nA robustly bullish analyst sentiment trend underpins an equally robust stock price outlook.\nInterested in Advanced Micro Devices, Inc.? Here are five stocks we like better.\n\nAdvanced Micro Devices (NASDAQ: AMD) appears to be one of the most compelling AI setups for 2026, due to the company's position in the GPU market and the expected launch of its MI450 line, which has the potential to impact revenue and earnings.\nAMD is planning to launch its MI450 lineup of AI chips in 2026, which could put it on par with NVIDIA (NASDAQ: NVDA) in terms of appeal to hyperscalers.\n→ The Application-Layer Rotation: 3 AI Pure Plays Poised to Win in 2026\nCurrently a niche player due to its rack-scale capability (which has been lacking), the MI450 could make AMD a direct competitor in a market experiencing such wicked hot demand that capacity could be tight for years to come. There are reports that some shops are rationing supply; AI trainers, model builders, and inference engines can’t get enough.\n\nAn AMD Revenue Surge Is Coming, and It Isn’t Priced In After MI450 chips enter production, AMD products are likely to see an immediate spike in demand, which will be reflected in second-half 2026 earnings reports. Some analysts' supply-demand estimates quote demand for NVIDIA chips at 10 GPUs per 1 available.\n→ The Lazy Way to Play NVIDIA’s $20B Groq Deal\n\nIf AMD saw that level of demand for its products, the revenue spike could be astronomical—$50 billion quarterly in the second half of 2026. That would be more than 400% year-over-year (YOY) growth compared to Q3 and Q4 2025, growth that is not currently priced in.\nThis is highly speculative, but it highlights how a stronger-than-expected MI450 ramp could drive meaningful year-over-year growth in Q3 and Q4 2026 that isn’t reflected in today’s consensus forecasts.\n→ Why NVIDIA’s AI Power-Play Could Drive the Next Major Rally in 2026\nAnalysts have been hesitant to lift their forward outlook for AMD revenue and earnings, setting the market up for a robustly bullish upgrade cycle in 2026. As of the end of 2025, the consensus for Q3 2026 is a mere $11.55 billion and $13.4 billion for Q4, suggesting significant outperformance is possible, even if high-end targets are not reached.\nThe longer-term forecasts are equally tepid, so not only is AMD’s revenue likely to surge, driving the bullish revision cycle, but growth will probably accelerate before leveling out in late 2027 or early 2028.\n\nStory Continues\nAnalysts have not been shy about their stock price forecasts. Uncertainty aside, the trends in 2025 provide support and incentive: coverage increased by 30% to 42 analysts, sentiment firmed to Moderate Buy, verging on Strong Buy, and the consensus stock price target rose by 42%.\nIt implies a 30% upside in 2026, and the high-end range, likely to increase as the year progresses, adds nearly 40% in potential upside. The consensus target of $277 would be sufficient to set a new all-time high, breaking the market out of its consolidation.\nInstitutional trends also point to a continuation of the stock price trend. The group owns approximately 72% of the stock and has been accumulating all year. The only downside is that selling activity is also elevated, aiding the volatility experienced in the second half of 2025. The question is whether the group will continue to accumulate in 2026, and the answer is probably, given the stock price discount and valuation outlook.\n\nValuation and Technical Targets Suggest 50% or More Upside in 2026 Advanced Micro Devices is not cheap in 2025, trading at 55X its current-year earnings; however, the valuation prices in a robust growth outlook that has been demonstrated to be overly cautious. The outlook, as is, implies this stock trades at only 9X its 2030 valuation, and the bull-case scenario, as described, puts it below 5X, suggesting massive upside in the coming years just to align with the broad market S&P 500. Assuming this stock retains its premium, upside could run in the 500% range or greater.\n\nThe technical outlook is mixed, with AMD stock surging in 2025 and then pulling back sharply. However, as bearish as it seems, the surge was only the initial wave in a much larger movement tied to GPU sales. In this scenario, AMD stock can begin rebounding in early 2026 as market dynamics shift from caution and profit-taking to accumulation and position-building.\nInvestors should note the price action at the $200 level. This level aligns with prior resistance and the top of an open price window, which now provides support for the market .\nIt is a critical pivot and breakout point that brings robust targets into play. AMD stock traded in a range that was approximately $115 from top to bottom. If it replicated that price action and rose $115 from its current support, that would equal more than 50% upside.\nThe article \" Advanced Micro Devices Is the Most Compelling AI Trade for 2026 \" was originally published by MarketBeat.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "23:36:52",
      "Source": "The Wall Street Journal",
      "Title": "Micron, Trade Desk, Western Digital: 2025's Big Stock Movers",
      "URL": "https://finance.yahoo.com/m/b7987c0b-92d7-33d0-bf38-0ce29b32d164/micron%2C-trade-desk%2C-western.html",
      "Content": "Micron, Trade Desk, Western Digital: 2025's Big Stock Movers\n\nRebecca Feng\nWed, December 31, 2025 at 7:36 AM PST 1 min read\n\nIn this article: MU\n\nSMEGF\n\nSMNEY\n\n^GSPC\n\nWDC\n\n↘️ Trade Desk (TTD): The advertising-technology company is poised to be the S&P 500's biggest loser in 2025. Shares have slid around two-thirds so far, their worst year on record. The company missed revenue estimates in February, and the stock was downgraded by analysts in August.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "22:51:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Has Barely Budged Since the End of July. What Gets It Going Again.",
      "URL": "https://finance.yahoo.com/m/586cab0b-f177-3383-83f7-a7f71f2dd3c2/nvidia-stock-has-barely.html",
      "Content": "Nvidia Stock Has Barely Budged Since the End of July. What Gets It Going Again.\n\nAdam Clark\nWed, December 31, 2025 at 6:51 AM PST 2 min read\n\nIn this article: NVDA\n\nAMD\n\nAVGO\n\nTSM\n\nTSMWF\n\nNvidia shares are drifting but reports of strong demand for its artificial-intelligence processors in China could point the way to future gains.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "21:06:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Is Drifting. This Could Get It Going Again.",
      "URL": "https://finance.yahoo.com/m/586cab0b-f177-3383-83f7-a7f71f2dd3c2/nvidia-stock-is-drifting..html",
      "Content": "Nvidia Stock Is Drifting. This Could Get It Going Again.\n\nAdam Clark\nWed, December 31, 2025 at 5:06 AM PST 2 min read\n\nIn this article: NVDA\n\nAMD\n\nAVGO\n\nTSM\n\nTSMWF\n\nNvidia shares are drifting but reports of strong demand for its artificial-intelligence processors in China could point the way to future gains.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "19:37:19",
      "Source": "Simply Wall St.",
      "Title": "AI Chips Today - AI Infrastructure Surge Driving Market Growth",
      "URL": "https://finance.yahoo.com/news/ai-chips-today-ai-infrastructure-113719440.html",
      "Content": "AI Chips Today - AI Infrastructure Surge Driving Market Growth\n\nSimply Wall St\nWed, December 31, 2025 at 3:37 AM PST 2 min read\n\nIn this article: NVDA\n\nAMD\n\nMU\n\nThe AI data center industry is rapidly expanding from niche buildouts into a highly capital-intensive sector, driven by the need for advanced infrastructure to support macro model training and inference. This shift is characterized by competition for GPUs, energy capacity, cooling systems, and long-term power contracts, as these requirements push AI infrastructure spending to new heights. With an investment prediction reaching up to $5.2 trillion by 2030, according to McKinsey & Co., public markets are increasingly focused on the physical infrastructure that underpins AI technologies. The emergence of \"neoclouds\" and infrastructure-adjacent platforms highlights the ongoing transformation as companies adapt to meet the demand for scalable AI environments. As investors show increased interest, valuation multiples in AI infrastructure reflect confidence in long-term growth potential within this evolving landscape.\n\nElsewhere in the market, Xi'an ESWIN Material Technology was a standout up 3.2% and ending trading at CN¥23.80. At the same time, MetaX Integrated Circuits (Shanghai) softened, down 4.7% to end trading at CN¥580.10, not far from its 52-week low.\nNVIDIA's innovation in AI platforms could drive substantial growth amid high demand. Discover more about this potential game-changer by clicking here for the full narrative.\nFor a deeper understanding, explore our Market Insights article \"Markets Break Records: Q3 2025 in Review,\" focusing on AI chips' pivotal role in S&P gains. Get in fast to see how it shapes market forecasts!\nBest AI Chip Stocks Advanced Micro Devices finished trading at $215.34 down 0.1%.\nNVIDIA closed at $187.54 down 0.4%. On Tuesday, NVIDIA was reported to be in advanced talks to acquire AI startup AI21 Labs for up to $3 billion.\nMicron Technology closed at $292.63 down 0.6%, not far from its 52-week high.\nMake It Happen Click here to access our complete index of 86 AI Chip Stocks , which features GlobalFoundries , InnoScience (Suzhou) Technology Holding and NAURA Technology Group .\nContemplating Other Strategies? We've found 13 US stocks that are forecast to pay a dividend yeild of over 6% next year. See the full list for free.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nStory Continues\nSources:\nSimply Wall St\n\"The AI Data Center Boom Goes Public: From “Neoclouds” to Power, Cooling, and the Grid\" from Microcaps on GlobeNewswire (published 29 December 2025)\nCompanies discussed in this article include SHSE:688783 NasdaqGS:AMD NasdaqGS:NVDA NasdaqGS:MU and SHSE:688802.\nThis article was originally published by Simply Wall St .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "18:30:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Is in a Rut. This Could Get It Going Again.",
      "URL": "https://finance.yahoo.com/m/586cab0b-f177-3383-83f7-a7f71f2dd3c2/nvidia-stock-is-in-a-rut..html",
      "Content": "Nvidia Stock Is in a Rut. This Could Get It Going Again.\n\nAdam Clark\nWed, December 31, 2025 at 2:30 AM PST 2 min read\n\nIn this article: NVDA\n\nAMD\n\nAVGO\n\nTSM\n\nTSMWF\n\nNvidia shares are drifting but reports of strong demand for its artificial-intelligence processors in China could point the way to future gains.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "18:25:40",
      "Source": "Insider Monkey",
      "Title": "Is Advanced Micro Devices (AMD) the Best New Stock from David Tepper’s Portfolio?",
      "URL": "https://finance.yahoo.com/news/advanced-micro-devices-amd-best-102540614.html",
      "Content": "Is Advanced Micro Devices (AMD) the Best New Stock from David Tepper’s Portfolio?\n\nHamna Asim\nWed, December 31, 2025 at 2:25 AM PST 2 min read\n\nIn this article: AMD\n\nSSNLF\n\nTSM\n\nAdvanced Micro Devices, Inc. (NASDAQ:AMD) is one of the new stocks David Tepper has bought . As of December 29, the average price target for AMD suggests an upside of 34%; however, the Street high indicates an upside of 77%. In Q3 2025, David Tepper purchased 950,000 shares of AMD valued at $153.70 million, making it the billionaire’s largest new position during Q3. Since December 15, the market has been abuzz with speculation that Samsung could potentially strike a deal with AMD to provide 2nm AI chips. This comes in light of the N-2 rule likely hindering Taiwan Semiconductor from manufacturing its most complicated nodes abroad. Reports suggest that Samsung’s Executive Chairman, Lee Jae-yong, had a meeting with AMD CEO Lisa Su as well as other Big Tech executives, to discuss the company’s foundry business and consequent business arrangements. The 2nm chipsets could power AMD's CPUs in the future, and a deal with Samsung could be closed in January 2026.\nPhoto by JESHOOTS.COM on Unsplash Separately, Piper Sandler maintained an Overweight rating on Advanced Micro Devices on December 15, with a $280 price target, representing 33% upside from current levels. Overall, Wall Street analysts had a consensus Strong Buy rating on the stock. Piper remained optimistic about AMD’s short- and mid-term drivers, particularly noting the company’s ability to meet technical targets such as the MI300 series ramp and technical progress for the MI400 series rollout. Analysts also expect further sales growth this year. The firm also told investors that AMD is putting notable resources into the Helios rack, which is slated for release in mid-2026. The company intends to widen its clientele beyond OpenAI, even though part of its new business is expected from that partnership. Piper Sandler noted that AMD’s finances seem to be sorted, and it can fund its development plans. While we acknowledge the potential of AMD as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: Dow 20 Stocks List: Ranked By Hedge Fund Bullishness Index and 10 Unstoppable Dividend Stocks to Buy Now . Disclosure. None.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "10:31:06",
      "Source": "Benzinga",
      "Title": "AMD's Lisa Su Pays Tribute To Former IBM CEO Lou Gerstner: An 'Amazingly Curious' Leader Who Shaped Her Early Career",
      "URL": "https://finance.yahoo.com/news/amds-lisa-su-pays-tribute-023106844.html",
      "Content": "AMD's Lisa Su Pays Tribute To Former IBM CEO Lou Gerstner: An 'Amazingly Curious' Leader Who Shaped Her Early Career\n\nVishaal Sanjay\nTue, December 30, 2025 at 6:31 PM PST 3 min read\n\nIn this article: IBM\n\nAMD\n\nChipmaker Advanced Micro Devices Inc.’s (NASDAQ: AMD ) CEO, Lisa Su , reflected on the influence of former IBM (NYSE: IBM ) CEO Lou Gerstner on her early career, after the former tech executive died on Saturday, aged 83.\nAn ‘Amazingly Curious’ Leader On Sunday, in a post on X, Su described Gerstner as a leader who was “amazingly curious and insightful” about technology, while noting that she was privileged to learn and work under his leadership early in her career.\nSu said she was “so honored to have had a chance to work with him,” adding that her “condolences are with Lou's family and the extended IBM family.”\nDon't Miss:\nThese five entrepreneurs are worth $223 billion – they all believe in one platform that offers a 7-9% target yield with monthly dividends\nAn EA Co-Founder Shapes This VC Backed Marketplace— Now You Can Invest in Gaming's Next Big Platform\nIBM CEO Arvind Krishna announced Gerstner’s death to the company’s 293,000 global employees on Sunday, without specifying any cause.\n\nGerstner, who served as IBM's CEO from 1993 to 2002, is widely credited with orchestrating the company's turnaround from the brink of collapse, overseeing a period in which the stock rose more than 800%.\nAfter retiring, Gerstner remained closely connected to the company, providing “generous advice” to the CEOs and senior executives who followed him, including Arvind Krishna, who assumed leadership nearly two decades after he stepped down.\nSee Also: Deloitte's #1 Fastest-Growing Software Company Lets Users Earn Money Just by Scrolling — Accredited Investors Can Still Get In at $0.50/Share.\nLasting Influence For Generations Su's tribute underscores Gerstner's lasting influence on multiple generations of technology executives, having orchestrated a similar revival at AMD since taking over as its CEO in 2014.\nSince retiring, Gerstner also penned a best-selling book named “Who Says Elephants Can’t Dance?” which chronicles his efforts in turning IBM around.\n\nShares of IBM were up 0.17% on Friday, closing at $305.09, and are down 0.07% overnight. The stock scores high on Momentum and Quality in Benzinga’s Edge Stock Rankings , with a favorable price trend in the short, medium and long terms. Click here for deeper insights into the stock, its peers and competitors.\n\nStory Continues\nRead Next:\nMissed Tesla? EnergyX Is Tackling the Next $200 Billion Opportunity — Lithium\nHave $100k+ to invest? Charlie Munger says that's the toughest milestone — don't stall now. Get matched with a fiduciary advisor and keep building\nPhoto Courtesy: jamesonwu1972 On Shutterstock.com\nUNLOCKED: 5 NEW TRADES EVERY WEEK. Click now to get top trade ideas daily , plus unlimited access to cutting-edge tools and strategies to gain an edge in the markets.\nGet the latest stock analysis from Benzinga:\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article AMD's Lisa Su Pays Tribute To Former IBM CEO Lou Gerstner: An 'Amazingly Curious' Leader Who Shaped Her Early Career originally appeared on Benzinga.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "07:27:00",
      "Source": "Motley Fool",
      "Title": "2 Surefire Chip Stocks to Buy and Hold for the Next Decade",
      "URL": "https://finance.yahoo.com/m/140924c7-060d-3e5c-93c9-dfca9208d8d1/2-surefire-chip-stocks-to-buy.html",
      "Content": "2 Surefire Chip Stocks to Buy and Hold for the Next Decade\n\nRachel Warren, The Motley Fool\nTue, December 30, 2025 at 3:27 PM PST 6 min read\n\nIn this article: AMD\n\nASML\n\nKey Points There are a variety of ways to invest in the chip boom.\nAdvanced Micro Devices is a leading global chip designer.\nASML plays an integral role in the advancement of chip technology.\n10 stocks we like better than Advanced Micro Devices ›\nThe chip sector has performed exceptionally well in recent years, and that growth continues to be fueled by massive spending on AI infrastructure, which makes chips a fundamental commodity of the digital era. Chips are essential for everything from data centers and AI accelerators to electric vehicles, industrial equipment, and consumer electronics.\n\nCompanies leading in advanced chip manufacturing and AI-specific hardware design are securing wide moats against their competitors. While this sector can be volatile, strong demand provides a solid underlying tailwind and investors with the risk tolerance to put cash into this space could benefit from robust returns over the long run.\nOn that note, here are two fantastic chip stocks to buy and hold for at least the next decade.\n1. Advanced Micro Devices Advanced Micro Devices (NASDAQ: AMD) is a semiconductor company that designs and develops computer processors and graphics technologies. AMD is a fabless semiconductor company, which means it designs its chips internally but outsources physical manufacturing to third-party foundries like Taiwan Semiconductor Manufacturing .\n\nIts major product lines include central processing units (CPUs) under the Ryzen brand for consumer personal computers and the brand EPYC for enterprise servers, where it has consistently gained market share from key competitors including the likes of Intel . AMD sells graphics processing units (GPUs) under its Radeon line for gaming and professional visualization purposes.\nFor example, AMD provides custom hardware for major gaming consoles including the Sony PlayStation 5 and Microsof t Xbox Series X/S. Its GPUs are also becoming increasingly important for data center growth.\nAMD expects its data center business to grow at a greater than 60% compound annual growth rate (CAGR) over the next few years. Thanks to its 2022 acquisition of Xilinx, AMD is also now a leader in Field-Programmable Gate Arrays (FPGAs). FPGAs enable highly optimized hardware designs for specific AI algorithms and their reconfigurable hardware offers unique flexibility, low latency, and power efficiency.\n\nIn terms of AMD's financial growth, the company reported total revenue of about $26 billion in fiscal year 2024. Of that total, about $13 billion (49% of total revenue) was attributable its data center business. Those top line figures represented respective increases of 14% and 94% from the prior year. The company's full-year 2024 GAAP (generally accepted accounting principles) net income was approximately $1.64 billion, a 92% increase from 2023.\n\nStory Continues\nAMD launched its next-generation GPUS, the Instinct MI350 Series, in 2025. These are advanced processors for data centers designed specifically to power demanding AI and high-performance computing (HPC) tasks such as training massive AI models and running complex scientific simulations. The company is emerging as a serious competitor to Nvidia in the AI GPU space as it witnesses growing adoption of its Instinct MI300 series accelerators by major cloud providers like Microsoft, Oracle , and Meta Platforms .\n\nThese chips also offer significant performance gains, huge memory capacity, and flexible integration options compared to predecessor chip solutions. If you want to invest in a cutting-edge chip stock that is playing an integral role in the AI revolution, AMD looks like a no-brainer buy.\n2. ASML Holding ASML Holding (NASDAQ: ASML) (short for Advanced Semiconductor Materials Lithography) is a Dutch technology company that holds a global monopoly on the machines required to manufacture the world's most advanced microchips. ASML does not manufacture chips itself. Instead, it builds the lithography machines that chipmakers use to print intricate patterns onto silicon wafers.\n\nThese machines use light to etch tiny transistors onto silicon. To be more specific, these machines project deep ultraviolet (DUV) or extreme ultraviolet (EUV) light through a blueprint of the chip's circuit design. This light is focused onto a silicon wafer coated with light-sensitive material, and the process is repeated to build up complex layers as well as the billions of transistors on a chip.\nThe smaller these patterns are, the more powerful and energy-efficient the resulting chips become. ASML is currently the only company in the world capable of producing EUV lithography machines. These machines are essential for making the cutting-edge chips found in high-end smartphones, AI hardware (like Nvidia's GPUs), and military equipment.\n\nASML's technology is the foundation of the modern digital economy and its primary customers include the world's leading chip manufacturers such as TSMC, Samsung , and Intel. System sales are the largest revenue component for ASML from its DUV and EUV systems.\nA single EUV machine can cost upwards of $200 million, while the newer systems are over $400 million. ASML also generates significant recurring revenue from ongoing support, maintenance, and performance upgrades for the machines installed at customer sites. This service segment benefits from the long, 20-year plus operational lifetime of its systems and a robust global support network.\nThe rapid expansion of AI and cloud computing markets is fueling demand for high-performance chips which means the major chip manufacturers it counts as its customers are ramping up orders for ASML's equipment. In 2024, ASML achieved record total net sales of 28.3 billion euros, with net income of 7.6 billion euros. The company also reported operating cash flow of more than 11 billion euros in the 12-month time frame. If you want to invest in a quintessential pick-and-shovel play in the semiconductor space, ASML looks like a no-brainer buy.\n\nShould you buy stock in Advanced Micro Devices right now? Before you buy stock in Advanced Micro Devices, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Advanced Micro Devices wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $507,744 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,153,827 !*\nNow, it’s worth noting Stock Advisor’s total average return is 983 % — a market-crushing outperformance compared to 195% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 29, 2025\nRachel Warren has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends ASML, Advanced Micro Devices, Intel, Meta Platforms, Microsoft, Nvidia, Oracle, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\n2 Surefire Chip Stocks to Buy and Hold for the Next Decade was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "05:54:00",
      "Source": "The Wall Street Journal",
      "Title": "U.S. Stocks Defy ‘Sell America’ Warnings and Are Ending 2025 Near Record Highs",
      "URL": "https://finance.yahoo.com/m/c583ffa2-a670-30a0-a641-1553afe4de48/u.s.-stocks-defy-%E2%80%98sell.html",
      "Content": "U.S. Stocks Defy ‘Sell America’ Warnings and Are Ending 2025 Near Record Highs\n\nDavid Uberti\nTue, December 30, 2025 at 1:54 PM PST 5 min read\n\nIn this article: AMD\n\nPLTR\n\nAVGO\n\nGOOG\n\n^GSPC\n\nTrump’s tariff policies didn’t raise prices as much as feared, while an AI arms race powered growth—and the shares of the largest tech companies.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "03:01:13",
      "Source": "Barchart",
      "Title": "Wall Street’s Not Sure What to Think About Nvidia’s Deal for Groq, But Mizuho Says You Should Keep Buying NVDA Stock",
      "URL": "https://finance.yahoo.com/m/e21c4703-577f-3f32-9c08-e729cd95a766/wall-street%E2%80%99s-not-sure-what.html",
      "Content": "Wall Street’s Not Sure What to Think About Nvidia’s Deal for Groq, But Mizuho Says You Should Keep Buying NVDA Stock\n\nWajeeh Khan\nTue, December 30, 2025 at 11:01 AM PST 2 min read\n\nIn this article: NVDA\n\nAMD\n\nINTC\n\nGROQ.PVT\n\nNvidia (NVDA) shares remain in focus this week after the semiconductor behemoth confirmed it’s spending $20 billion to acquire Groq’s assets and talents.\nFounded in 2016, this artificial intelligence (AI) startup based out of Mountain View, California specialize in high-bandwidth, low-latency architectures.\n\nMore News from Barchart Micron Technology Bear Put Spread Could Return 197% in this Down Move\nMicron Stock Stole the Show in 2025. Options Data Says It Will Trade at These Levels in 2026.\nQuantumScape Gained 100% in 2025 and Is Set to Generate Revenue for the First Time in 2025. Options Data Suggests You Should Play QS Stock Like This for 2026.\nTired of missing midday reversals? The FREE Barchart Brief newsletter keeps you in the know. Sign up now!\nAt the time of writing, Nvidia stock is up roughly 120% versus its year-to-date low set in early April.\nMizuho Explains Why Groq Deal Is Bullish for Nvidia Stock According to Vijay Rakesh – a senior Mizuho analyst – the non-exclusive licensing deal with Groq will prove a meaningful “benefit for NVDA shares in the long run.”\nThe transaction enables Nvidia to assert its prowess in AI inference, which is expected to make up as much as 80% of workloads over time.\n\nOn Monday, Rakesh maintained an “Outperform” rating on the Nasdaq-listed giant. His $245 price target indicates potential for another 32% upside from here.\nFrom a technical perspective, the AI stock is currently trading decisively above its major moving averages (MAs), reinforcing that the bullish momentum will likely sustain in 2026.\nWhy Groq Deal May Unlock Further Upside in NVDA Shares What’s also worth mentioning is that the $20 billion price tag on the Groq deal, while huge on the surface, is peanuts compared to Nvidia’s market cap.\nThis means the associated risk – both executional and to the giant’s balance sheet – is rather small.\nFor NVDA, it’s more like a “bolt-on” acquisition that strengthens its footprint in AI inference at a minimal financial risk. As Bernstein analyst Stacy Rasgon put it in a recent CNBC interview:\n\n“They can do a $20 billion deal on Christmas Eve with no press release, and nobody bats an eye.”\nAll in all, acquiring Groq’s assets and talent positions Nvidia shares to widen the gap with rivals, including Advanced Micro Devices (AMD) and Intel (INTC).\nWhat’s the Consensus Rating on Nvidia? Note that Mizuho isn’t the only Wall Street firm that’s recommending sticking with NVDA stock heading into 2026.\nIn fact, the consensus rating on Nvidia shares remains at “Strong Buy” with the mean target of $256 indicating potential upside of more than 35% from current levels.\n\nStory Continues\nOn the date of publication, Wajeeh Khan did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "01:27:07",
      "Source": "Insider Monkey",
      "Title": "Analysts Call NVIDIA Corporation (NVDA) Groq Deal a ‘Tech and Talent Grab’",
      "URL": "https://finance.yahoo.com/news/analysts-call-nvidia-corporation-nvda-172707231.html",
      "Content": "Analysts Call NVIDIA Corporation (NVDA) Groq Deal a ‘Tech and Talent Grab’\n\nLaiba Immad\nTue, December 30, 2025 at 9:27 AM PST 1 min read\n\nIn this article: NVDA\n\nGROQ.PVT\n\nAMD\n\nWe recently compiled a list of the 7 Most Promising Robotics Stocks According to Wall Street Analysts . NVIDIA Corporation is one of the most promising stocks .\nTheFly reported on December 26 that NVDA announced a non-exclusive licensing agreement with AI chip startup Groq. The deal includes bringing Groq’s founder and CEO, Jonathan Ross, President Sunny Madra, and other key engineers to NVDA to integrate Groq’s low-latency inference technology into NVDA’s “AI factory” architecture.\nAnalysts, including Bernstein’s Stacy Rasgon, described the move as a “tech and talent grab” rather than a traditional acquisition. By structuring the transaction as a license instead of a full buyout, NVIDIA Corporation (NASDAQ:NVDA) may reduce antitrust scrutiny. While media reports suggest a transaction value of around $20 billion, neither NVDA nor Groq has confirmed the exact financial terms. The deal strengthens the business’s position in AI inference technology amid increasing competition from startups and rivals like AMD.\n\nNVIDIA Corporation (NASDAQ:NVDA) is a global leader in accelerated computing and AI technologies, headquartered in Santa Clara, California. Best known for its high‑performance GPUs and AI platforms, NVDA’s technology underpins a wide range of applications from data centers and gaming to autonomous machines and robotics.\nWhile we acknowledge the potential of NVDA as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "01:10:24",
      "Source": "GuruFocus.com",
      "Title": "S&P 500 and Nasdaq Trades Near Flat As Investors Awaiting Fed Guidance",
      "URL": "https://finance.yahoo.com/news/p-500-nasdaq-trades-near-171024974.html",
      "Content": "S&P 500 and Nasdaq Trades Near Flat As Investors Awaiting Fed Guidance\n\nNauman Khan\nTue, December 30, 2025 at 9:10 AM PST 1 min read\n\nIn this article: ^GSPC\n\nPLTR\n\nNVDA\n\n^DJI\n\nAMD\n\nThis article first appeared on GuruFocus .\nThe S&P 500 held steady on Tuesday as investors tried to avoid a three-day losing streak, according to a Tuesday market update.\nThe Nasdaq Composite remained near the flatline, while the Dow Jones Industrial Average fell 87 points, or about 0.2%.\nIs SPY fairly valued? Test your thesis with our free DCF calculator.\n\nTech shares led recent volatility, with Nvidia ( NASDAQ:NVDA ) down more than 1% and Palantir Technologies ( NASDAQ:PLTR ) sliding 2.4% in the prior session.\nDespite these dips, the stocks have posted strong gains this year, with Nvidia up 39% and Palantir and Advanced Micro Devices ( NASDAQ:AMD ) climbing 142% and 78%, respectively.\nAnalysts expect AI-related demand to continue benefiting semiconductors and data center suppliers in 2026. Bill Northey of U.S. Bank Asset Management noted potential productivity gains for companies applying AI, which may accelerate corporate earnings.\nInvestors also await the Federal Reserve's December meeting minutes, due Tuesday afternoon, for insight on recent rate cuts.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "01:07:55",
      "Source": "GuruFocus.com",
      "Title": "Nvidia, AMD Set CES 2026 Agenda",
      "URL": "https://finance.yahoo.com/news/nvidia-amd-set-ces-2026-170755919.html",
      "Content": "Nvidia, AMD Set CES 2026 Agenda\n\nMoz Farooque ACCA\nTue, December 30, 2025 at 9:07 AM PST 1 min read\n\nIn this article: NVDA\n\nAMD\n\nThis article first appeared on GuruFocus .\nNvidia ( NASDAQ:NVDA ) and Advanced Micro Devices ( NASDAQ:AMD ) are opening CES 2026 next week with CEO keynotes that aim to set the tone for where artificial intelligence is headed in the year ahead.\nThe Las Vegas event runs January 69, with Nvidia CEO Jensen Huang and AMD CEO Lisa Su both taking the stage on Monday, January 5. Wedbush analysts led by Dan Ives expect Huang to focus heavily on data centers, physical AI, robotics, and autonomous technology, calling 2026 a critical year for Nvidia's AI strategy. The firm also expects discussion around Nvidia's Cosmos foundation model platform, which is designed to speed up how AI systems are built and deployed.\n\nWarning! GuruFocus has detected 5 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nSu's keynote is expected to balance consumer and enterprise themes, with updates on Ryzen CPUs and Radeon graphics for AI PCs and gaming, alongside EPYC processors and Instinct GPUs for cloud workloads. Su has called CES the premier place to showcase breakthrough technology.\nWedbush believes CES 2026 could mark a shift toward consumer AI, highlighting robotics, wearables, and smart home devices. Investors will be watching closely for signs that AI demand is expanding beyond data centers in 2026.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "00:11:14",
      "Source": "GuruFocus.com",
      "Title": "AMD Seen Rebounding in China AI Sales on $675 Million Alibaba Order",
      "URL": "https://finance.yahoo.com/news/amd-seen-rebounding-china-ai-161114669.html",
      "Content": "AMD Seen Rebounding in China AI Sales on $675 Million Alibaba Order\n\nFaizan Farooque\nTue, December 30, 2025 at 8:11 AM PST 1 min read\n\nIn this article: AMD\n\nOPAI.PVT\n\nBABA\n\nThis article first appeared on GuruFocus .\nAdvanced Micro Devices Inc. ( AMD , Financials ) is about to see a big rebound in its AI business after news that GPU shipments to China are starting up again, driven by a possible $675 million purchase from Alibaba Group.The agreement would be a big step forward for AMD's MI308 chips, which are designed to fulfill U.S. export rules while still addressing the high demand for AI acceleration technology in China. Analysts think this is an indication that AMD is getting back some of the market share it lost to Chinese chipmakers when trade restrictions were put in place.At AMD's 2025 Financial Analyst Day, the firm said that profits per share might rise from less than $4 in 2025 to more than $24 by 2030. This is because demand for data centers and AI infrastructure is growing. Management also said that possible agreements with OpenAI and big cloud clients might help the company thrive in the long run.The chipmaker's ability to get back into the Chinese AI industry while following U.S. export rules might provide it a big boost in sales going into 2026. Analysts think that AMD's high-performance computing sector might benefit a lot from additional GPU sales to China. This supports the company's long-term price objective of $600.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "23:45:00",
      "Source": "Zacks",
      "Title": "Can Intel's Investment-Driven Strategy Regain Its Competitive Edge?",
      "URL": "https://finance.yahoo.com/news/intels-investment-driven-strategy-regain-154500874.html",
      "Content": "Can Intel's Investment-Driven Strategy Regain Its Competitive Edge?\n\nZacks Equity Research\nTue, December 30, 2025 at 7:45 AM PST 3 min read\n\nIn this article: INTC\n\nQCOM\n\nAMD\n\nNVDA\n\nSFTBF\n\nIntel Corporation ( INTC ) has completed a previously announced $5 billion investment from NVIDIA Corporation ( NVDA ), under which the latter purchased around 214.7 million shares of the former at $23.28 per share. Earlier in December, this transaction received U.S. antitrust approval from the Federal Trade Commission. This purchase gives NVIDIA roughly a 4% equity stake in Intel through a private placement of shares.\n\nThe partnership aims to tightly combine Intel’s custom-designed x86 CPUs with NVIDIA’s AI GPUs and NVLink interconnect technology to create faster, more efficient AI systems and next-generation PCs with stronger AI and graphics performance. This could help Intel remain competitive in the AI era.\nIntel had also secured $8.9 billion in funds from the U.S. government to support semiconductor manufacturing and packaging projects in Arizona, New Mexico, Ohio and Oregon in order to boost the domestic chip industry. SoftBank has also invested $2 billion, providing funds to support Intel’s restructuring and AI projects.\nIntel is constantly making efforts to bring huge investments to strengthen its balance sheet, supporting heavy spending on new factories and R&D, boosting market confidence and enabling deeper technology collaboration with firms like NVIDIA.\n\nHow Are Rivals Performing? Intel faces competition from Qualcomm Incorporated ( QCOM ) and Advanced Micro Devices ( AMD ). Qualcomm recently completed its $2.4 billion acquisition of British semiconductor company Alphawave Semi to strengthen its AI, data center and high-speed connectivity technologies, boosting its competitiveness beyond smartphones. By strengthening its PC chip offerings through programs like Snapdragon X, Qualcomm can expand into new markets such as AI infrastructure, edge computing and personal computers. Qualcomm entered the AI infrastructure space by developing AI accelerators like AI200 & AI250.\n\nAMD is set to launch high-performance AI GPUs, EPYC server CPUs and full AI systems like Helios to compete with NVIDIA and provide faster, more efficient solutions for data centers and enterprises. AMD is partnering with companies like OpenAI and Oracle to expand across gaming, PCs and servers to increase revenues and stay competitive. The company continues to improve its ROCm open software stack and open hardware standards.\nINTC’s Price Performance, Valuation & Estimates Shares of Intel have surged 85% over the past year compared with the industry ’s growth of 34.1%.\n\nImage Source: Zacks Investment Research\nGoing by the price/book ratio, the company's shares currently trade at 1.5 book value, lower than 32.5 of the industry average.\n\nStory Continues\n\nImage Source: Zacks Investment Research\nINTC’s earnings estimates for 2025 have increased 6.3% to 34 cents per share, while those for 2026 have declined 6.5% to 58 cents over the past 60 days.\n\nImage Source: Zacks Investment Research\nIntel stock currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "23:14:22",
      "Source": "Investor's Business Daily",
      "Title": "CES 2026: AI, Robots, Wearables, Industrial Machines In Focus",
      "URL": "https://finance.yahoo.com/m/c30e2b90-b519-39f1-b2be-cb2d29297bf2/ces-2026%3A-ai%2C-robots%2C.html",
      "Content": "CES 2026: AI, Robots, Wearables, Industrial Machines In Focus\n\nPATRICK SEITZ\nTue, December 30, 2025 at 7:14 AM PST 6 min read\n\nIn this article: DE\n\nNVDA\n\nCAT\n\nAMD\n\nThe CES 2026 technology trade show in Las Vegas promises to shine a spotlight on the physical embodiment of AI.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "23:14:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock and the Bright Side of the Groq Deal",
      "URL": "https://finance.yahoo.com/m/a84f7af6-04aa-3bb9-8440-10aa23d41301/nvidia-stock-and-the-bright.html",
      "Content": "Nvidia Stock and the Bright Side of the Groq Deal\n\nAdam Clark\nTue, December 30, 2025 at 7:14 AM PST 2 min read\n\nIn this article: NVDA\n\nAMD\n\nAVGO\n\nGROQ.PVT\n\nNvidia is paying $20 billion for Groq’s technology, including compensation packages for many of the company’s employees who will join Nvidia, The Wall Street Journal reported.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "22:25:00",
      "Source": "Motley Fool",
      "Title": "This Could Derail Intel's Comeback in 2026",
      "URL": "https://finance.yahoo.com/m/a3c3c0b1-515e-3b98-985f-d19243c24d76/this-could-derail-intel%27s.html",
      "Content": "This Could Derail Intel's Comeback in 2026\n\nTimothy Green, The Motley Fool\nTue, December 30, 2025 at 6:25 AM PST 5 min read\n\nIn this article: INTC\n\nAMD\n\nTSM\n\nKey Points Intel has a strong PC roadmap for 2026, including Panther Lake and Nova Lake.\nBoth CPU families will use the cutting-edge Intel 18A manufacturing process.\nSoaring memory chip prices could force PC price hikes and limit Intel's comeback in the PC market.\n10 stocks we like better than Intel ›\nOne of the issues plaguing Intel (NASDAQ: INTC) over the past few years has been an erosion of its PC CPU market share. Past manufacturing delays forced the company to use aging process nodes while rival AMD tapped TSMC 's top-tier manufacturing technology. Intel later outsourced manufacturing for its Lunar Lake and Arrow Lake chips, but the latter was a mixed bag that rubbed reviewers and consumers the wrong way.\nAgainst this backdrop, Intel's share of the desktop and laptop CPU market has tumbled. Intel remains the market leader, but AMD controlled approximately one-third of the desktop CPU market and more than one-fifth of the laptop CPU market in the third quarter. A decade ago, this kind of progress from AMD would have been unthinkable.\n\nIn 2026, Intel could regain some of the lost market share. Panther Lake for laptops and Nova Lake for desktops look promising, and both will be built on the new Intel 18A process node. However, soaring memory chip prices will likely increase PC prices and potentially dampen demand.\nIntel's 2026 roadmap shows promise Panther Lake will be the first mass-produced chip to be manufactured using the Intel 18A process, and it is expected to begin shipping in volume in early 2026. Intel 18A moves Intel to a new type of transistor and introduces backside power delivery, a technology that can boost efficiency by moving power circuitry to the back of the chip. The Intel 18A process is the first in the industry to implement backside power delivery.\n\nNova Lake will come later in 2026 for desktops, succeeding the troubled Arrow Lake family. In the meantime, the company is rumored to be launching a refresh of Arrow Lake, although the core problems with Arrow Lake are likely to remain unresolved until Nova Lake arrives. While Nova Lake's specifications are still unclear, rumors suggest high core counts and large amounts of cache for some models, which could better compete with AMD's 3D V-Cache chips.\nLaunching a new architecture on a new process node is always a challenge, but if Panther Lake and Nova Lake deliver solid improvements in performance and efficiency, they could be big winners for Intel.\nMemory prices could be a major problem Unfortunately for Intel, its Panther Lake and Nova Lake launches coincide with a severe and escalating shortage of DRAM memory. AI data centers need both high-bandwidth memory and standard DRAM memory in copious quantities. Memory chip manufacturers have been shifting production to HBM chips while being cautious about expanding overall production, creating a shortage of DRAM chips.\n\nStory Continues\nPC prices are almost certain to rise in 2026 as OEMs grapple with rising component costs. Dell is reportedly raising commercial PC prices by 10% to 30% in response to the memory chip crisis, a move that will likely be followed by other OEMs. Businesses could slow down upgrade plans in response. On the consumer side, higher prices and configurations with less memory are likely to be the prevailing themes in 2026.\n\nBeyond the potential for higher prices to hurt overall demand for PCs, lower memory configurations could hurt Intel's AI PC push. Panther Lake laptops will feature greater AI processing power than their predecessors, but a lack of memory could hinder usability. Microsoft requires at least 16 GB of RAM for a laptop to be labeled a Copilot+ PC, for example, because AI applications require significant amounts of memory.\nSoaring memory chip prices put Intel in a tough spot. Even if Panther Lake and Nova Lake are home runs, delivering performance and efficiency that top AMD, high PC prices could spoil the party. AMD is also impacted, so Intel won't be at a relative disadvantage and could still win market share. However, the size of the market could temporarily shrink as businesses and consumers resist price increases.\n\nWith memory chip production unlikely to increase meaningfully anytime soon, and with the AI boom still going strong, Intel's PC comeback in 2026 may be weaker than it could have otherwise been.\nShould you buy stock in Intel right now? Before you buy stock in Intel, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Intel wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $507,744 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,153,827 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 984 % — a market-crushing outperformance compared to 195% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 29, 2025\nTimothy Green has positions in Intel. The Motley Fool has positions in and recommends Advanced Micro Devices, Intel, Microsoft, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nThis Could Derail Intel's Comeback in 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "21:33:00",
      "Source": "Barrons.com",
      "Title": "Cathie Wood’s ARK Funds Have Crushed the Market This Year. What’s She’s Buying Now.",
      "URL": "https://finance.yahoo.com/m/45ada057-0d95-3e92-9afc-b859282038f2/cathie-wood%E2%80%99s-ark-funds-have.html",
      "Content": "Cathie Wood’s ARK Funds Have Crushed the Market This Year. What’s She’s Buying Now.\n\nCallum Keown\nTue, December 30, 2025 at 5:33 AM PST 2 min read\n\nIn this article: TSLA\n\nAMD\n\nHOOD\n\nCOIN\n\nBABA\n\nCathie Wood’s ARK funds are on track to beat the market in 2025. She's already looking ahead to next year.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "20:45:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Gains. How Groq Can Help Defend Its AI Chip Dominance.",
      "URL": "https://finance.yahoo.com/m/a84f7af6-04aa-3bb9-8440-10aa23d41301/nvidia-stock-gains.-how-groq.html",
      "Content": "Nvidia Stock Gains. How Groq Can Help Defend Its AI Chip Dominance.\n\nAdam Clark\nTue, December 30, 2025 at 4:45 AM PST 2 min read\n\nIn this article: NVDA\n\nGROQ.PVT\n\nAMD\n\nAVGO\n\nNvidia is paying $20 billion for Groq’s technology, including compensation packages for many of the company’s key employees who will join Nvidia, The Wall Street Journal reported.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "20:25:26",
      "Source": "GuruFocus.com",
      "Title": "Micron Stock Climbs to Record High as AI Drives Memory Chip Demand",
      "URL": "https://finance.yahoo.com/news/micron-stock-climbs-record-high-122526887.html",
      "Content": "Micron Stock Climbs to Record High as AI Drives Memory Chip Demand\n\nNauman Khan\nTue, December 30, 2025 at 4:25 AM PST 1 min read\n\nIn this article: MU\n\n^GSPC\n\nNVDA\n\nAMD\n\nThis article first appeared on GuruFocus .\nMicron ( NASDAQ:MU ) stock climbed more than 3% on Monday, hitting a new all-time intraday high of $294.3, fueled by surging demand for memory used in artificial intelligence applications.\nThe rally pushed the stock past its previous record of $290.87 set just days earlier, highlighting investor enthusiasm for AI-focused chipmakers.\n\nWarning! GuruFocus has detected 6 Warning Sign with MU.\nList of 52-Week Lows\nList of 3-Year Lows\nList of 5-Year Lows\nIs MU fairly valued? Test your thesis with our free DCF calculator.\nThe gains came even as the broader market dipped, with the S&P 500 and Dow Jones moving lower, showing that Micron's momentum is largely sector-driven. Recent earnings reinforced the bullish case: the company posted $13.64 billion in revenue and adjusted EPS of $4.78, propelled by high-bandwidth memory (HBM) used in Nvidia ( NASDAQ:NVDA ) and AMD ( NASDAQ:AMD ) AI chips.\nLooking ahead, management expects the HBM market to grow from $35 billion in 2025 to nearly $100 billion by 2028, roughly 40% annual growth. Analysts, including Rosenblatt Securities, have raised price targets in response to the strong outlook.\nCompetition is still something to monitor. Samsung and SK Hynix are increasing the production of HBM and that could drive the prices down in case of a supply and demand mismatch. Micron 2026 depends on stable AI orders, no change in price and the speed with which the competition will equip the AI order.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "19:36:52",
      "Source": "MT Newswires",
      "Title": "Social Buzz: Wallstreetbets Stocks Mostly Advancing Premarket Tuesday; Rocket Lab, D-Wave to Rise",
      "URL": "https://finance.yahoo.com/news/social-buzz-wallstreetbets-stocks-mostly-113652488.html",
      "Content": "PREMIUM\nSocial Buzz: Wallstreetbets Stocks Mostly Advancing Premarket Tuesday; Rocket Lab, D-Wave to Rise\n\nMT Newswires\nTue, December 30, 2025 at 3:36 AM PST 1 min read\n\nIn this article: QBTS\n\nMU\n\nAMD\n\nTSLA\n\nNVDA\n\nThe most-talked-about stocks in the Reddit subforum Wallstreetbets were mostly higher hours before T\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "19:14:31",
      "Source": "GuruFocus.com",
      "Title": "Nvidia Shares Slide on Rumors of Next-Year GPU Price Jumps",
      "URL": "https://finance.yahoo.com/news/nvidia-shares-slide-rumors-next-111431550.html",
      "Content": "Nvidia Shares Slide on Rumors of Next-Year GPU Price Jumps\n\nNauman Khan\nTue, December 30, 2025 at 3:14 AM PST 1 min read\n\nIn this article: NVDA\n\nAMD\n\nThis article first appeared on GuruFocus .\nShares of Nvidia ( NASDAQ:NVDA ) slipped on Monday after reports said multiple semiconductor companies plan GPU price increases in early 2026.\nMultiple outlets reported AMD would raise prices next month, followed by Nvidia a month later. Reports suggested AMD may add roughly $10 for each 8GB of VRAM, meaning cards with 8GB to 24GB could see increases of about $10 to $30. Nvidia's timing and magnitude remain unclear.\n\nWarning! GuruFocus has detected 5 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nInvestors sold into the headlines. NVDA shares slid about 1.2%.\nAnalysts said the moves reflect cost pressures from rising memory prices as AI data-center demand lifts component demand. Modest price lifts could help protect supplier margins, they said, but significant pass-through risks that would dent demand appear limited for now.\nTraders will be watching company statements, channel inventories and guidance in coming weeks to gauge whether the reported increases are real or just preliminary vendor pricing plans. Market reaction could shift once firms confirm.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "18:33:00",
      "Source": "Motley Fool",
      "Title": "Nvidia, AMD, and Micron Technology Could Help This Unstoppable ETF Turn $250,000 Into $1 Million in 10 Years",
      "URL": "https://finance.yahoo.com/m/1940fe67-84ae-370a-9f71-4eaa4c092627/nvidia%2C-amd%2C-and-micron.html",
      "Content": "Nvidia, AMD, and Micron Technology Could Help This Unstoppable ETF Turn $250,000 Into $1 Million in 10 Years\n\nAnthony Di Pizio, The Motley Fool\nTue, December 30, 2025 at 2:33 AM PST 6 min read\n\nIn this article: NVDA\n\nMU\n\nAMD\n\n^GSPC\n\nOPAI.PVT\n\nKey Points The artificial intelligence (AI) revolution would be at a standstill without advanced chips and components.\nNvidia, Advanced Micro Devices, and Micron supply some of that critical hardware, and their shares are up by an average of 119% in 2025.\nThe iShares Semiconductor ETF exclusively invests in semiconductor companies that stand to benefit from megatrends like AI.\n10 stocks we like better than iShares Trust - iShares Semiconductor ETF ›\n\nTop artificial intelligence (AI) developers like OpenAI and Anthropic continue to launch new models, with each one being \"smarter\" and more capable than the last. However, every new model also soaks up more computing power than its predecessors, so it requires significantly more data center capacity.\nSome of the biggest suppliers of AI infrastructure, chips, and components include Nvidia (NASDAQ: NVDA) , Advanced Micro Devices (NASDAQ: AMD) , and Micron Technology (NASDAQ: MU) . Shares in those three companies have surged by an average of 119% in 2025 alone, crushing the S&P 500 index, which is up just 18%.\nIn other words, investors who had little or no exposure to the AI semiconductor space this year probably underperformed the broader market.\nFortunately, there's a simple way to buy a slice of this hypergrowth industry without having to pick winners and losers. The iShares Semiconductor ETF (NASDAQ: SOXX) is an exchange-traded fund (ETF) that exclusively invests in companies like Nvidia, AMD, Micron, and many of their peers. Here's how it could turn an investment of $250,000 into $1 million over the next 10 years.\nThe best AI hardware stocks packed into one ETF The iShares Semiconductor ETF solely invests in American companies that design, distribute, and manufacture chips and components, but primarily those benefiting from opportunities like AI . Its narrow focus is the reason its portfolio only includes 30 stocks. The fund is also quite top heavy, with its three largest holdings sporting a combined weighting of 22.7%:\nStock\niShares ETF Portfolio Weighting\n1. Nvidia\n8.22%\n2. Advanced Micro Devices (AMD)\n7.62%\n3. Micron Technology\n6.88%\n\nData source: iShares. Portfolio weightings are accurate as of Dec. 24, 2025, and are subject to change.\nNvidia's graphics processing units (GPUs) are the best chips on the market for developing AI models. Its current Blackwell Ultra lineup was designed to deliver sufficient computing power for the industry's latest reasoning models, like OpenAI's GPT 5.2, Anthropic's Claude 4.5, and Alphabet 's Gemini 3. I think Nvidia stock is still cheap despite its 41% gain in 2025, which leaves plenty of room for more upside from here.\n\nStory Continues\nAMD is chasing Nvidia in the market for data center chips. The company's latest MI350 Series GPUs have captured some of its key rival's top customers, but they still fall modestly short in terms of performance. Next year, AMD plans to launch its new MI400 GPUs as part of a fully integrated data center rack called Helios, which could deliver 10 times more performance than its MI350 GPUs. This company might be a real threat to Nvidia at that point.\n\nThen there is Micron Technology, which is one of the world's leading suppliers of memory and storage chips. Both Nvidia and AMD have integrated Micron's HBM3E (high-bandwidth memory) solutions into their data center GPUs to unlock their maximum processing speeds. Micron is already sold out of its entire 2026 supply of data center memory, including its upcoming HBM4E solution, which is poised to deliver improvements in both capacity and energy efficiency.\nOutside of its top three positions, the iShares ETF holds several other top AI semiconductor stocks like Broadcom , Texas Instruments , and Taiwan Semiconductor Manufacturing .\nTurning $250,000 into $1 million over the next decade The iShares Semiconductor ETF is on track to end 2025 with an eye-popping 43% return. That isn't sustainable over the long run, but the ETF has delivered a compound annual return of 27.2% over the past decade, so it's no stranger to high growth. Even its more modest average annual gain of 11.8% since its inception in 2001 is still better than the performance of the S&P 500 over the same period.\nHere's how long it might take for the iShares ETF to turn an investment of $250,000 into $1 million, based on three different average annual returns:\nInitial Investment\nCompound Annual Return\nTime to Reach $1 Million\n$250,000\n11.8%\n13 Years\n$250,000\n19.5% (midpoint)\n8 Years\n$250,000\n27.2%\n6 Years\n\nCalculations by author.\nAccording to Nvidia CEO Jensen Huang, annual spending on AI data center infrastructure and chips could reach $4 trillion by 2030. If that happens, the iShares ETF is likely to deliver compound annual returns in excess of 20% for the foreseeable future. But to be perfectly clear, that wouldn't be sustainable under normal circumstances because of the law of large numbers.\n\nFor example, Nvidia is already a $4.6 trillion company. If its market cap grew by 27.2% annually for the next decade, it would be worth almost $50 trillion. The output of the entire U.S. economy was less than $30 trillion in 2024, so although AI is a revolutionary technology, it's important for investors to temper their expectations.\nFortunately, the iShares ETF can still turn $250,000 into $1 million over the next 10 years even if its annual returns moderate to slightly below 20%. Per the above table, if investors are a little more patient, the ETF could also help them join the million-dollar club in 13 years even if its returns suffer a significant reversion back to their long-term average of 11.8%.\nBut I think its returns are likely to remain elevated for now, considering practically every chipmaker is experiencing more demand than it can possibly supply.\n\nShould you invest $1,000 in iShares Trust - iShares Semiconductor ETF right now? Before you buy stock in iShares Trust - iShares Semiconductor ETF, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and iShares Trust - iShares Semiconductor ETF wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 29, 2025\nAnthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Nvidia, Taiwan Semiconductor Manufacturing, Texas Instruments, and iShares Trust-iShares Semiconductor ETF. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nNvidia, AMD, and Micron Technology Could Help This Unstoppable ETF Turn $250,000 Into $1 Million in 10 Years was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "13:00:24",
      "Source": "Insider Monkey",
      "Title": "Wall Street Bullish on Advanced Micro Devices (AMD), Here’s Why",
      "URL": "https://finance.yahoo.com/news/wall-street-bullish-advanced-micro-050024487.html",
      "Content": "Wall Street Bullish on Advanced Micro Devices (AMD), Here’s Why\n\nTalha Qureshi\nMon, December 29, 2025 at 9:00 PM PST 2 min read\n\nIn this article: AMD\n\nTFC\n\nAdvanced Micro Devices, Inc. (NASDAQ: AMD ) is among the Stocks That Will Make You Rich in 2026 . Wall Street has a bullish outlook on Advanced Micro Devices, Inc. (NASDAQ:AMD) with analysts 12 month price target reflecting more than 34% upside from the current level. The bullish sentiment is mainly based on the upcoming Helios rack and the overall positive outlook on the AI trade.\nRecently, on December 19, William Stein from Truist Financial reiterated a Buy rating on the stock with a price target of $201.06. Earlier, on December 15, Harsh Kumar from Piper Sandler reiterated a Buy rating on the stock with a $280 price target.\nWilliam Stein of Truist noted that the AI sector faces major challenges related to the power constraints and the investment to build the power infrastructure. However, the analyst believes that the semiconductor stocks still remain relatively cheap considering their growth potential. Moreover, Stein also sees upside for the sector heading into 2026, driven by increased capital expenditure.\n\nSimilarly, Piper Sandler also remains bullish on Advanced Micro Devices, Inc. (NASDAQ:AMD). The firm noted several catalysts for the company, including the company’s ability to ramp up its MI300 series ramp and technical traction for the upcoming MI400 series launch. The firm also expects significant near-term upside from the upcoming Helios rack, expected to launch by mid 2026.\nAdvanced Micro Devices, Inc. (NASDAQ:AMD) is a global semiconductor company that manufactures GPUs, microprocessors, and high-performance computing solutions and serves a number of high-growth industries like gaming, data centers, and AI.\nWhile we acknowledge the potential of AMD as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "12:32:25",
      "Source": "StockStory",
      "Title": "2 Volatile Stocks with Promising Prospects and 1 Facing Challenges",
      "URL": "https://finance.yahoo.com/news/2-volatile-stocks-promising-prospects-043225330.html",
      "Content": "2 Volatile Stocks with Promising Prospects and 1 Facing Challenges\n\nJabin Bastian\nMon, December 29, 2025 at 8:32 PM PST 4 min read\n\nIn this article: FITB\n\nAMD\n\nFITBP\n\nAMZN\n\nMarket swings can be tough to stomach, and volatile stocks often experience exaggerated moves in both directions. While many thrive during risk-on environments, many also struggle to maintain investor confidence when the ride gets bumpy.\nNavigating these stocks isn’t easy, which is why StockStory helps you find Comfort In Chaos . Keeping that in mind, here are two volatile stocks that could deliver huge gains and one that could just as easily collapse.\n\nOne Stock to Sell: Fifth Third Bancorp (FITB) Rolling One-Year Beta: 1.24\nNamed after the merger of Third National Bank and Fifth National Bank in 1908, Fifth Third Bancorp (NASDAQ:FITB) is a financial services company that provides banking, lending, wealth management, and investment services to individuals and businesses across the Midwest and Southeast.\n\nWhy Do We Think Twice About FITB?\n4.1% annual net interest income growth over the last five years was slower than its banking peers\nPerformance over the past two years shows each sale was less profitable, as its earnings per share fell by 2.8% annually\nLoan losses and capital returns have eroded its tangible book value per share this cycle as its tangible book value per share declined by 1.2% annually over the last five years\nAt $47.82 per share, Fifth Third Bancorp trades at 1.6x forward P/B. Check out our free in-depth research report to learn more about why FITB doesn’t pass our bar .\nTwo Stocks to Watch: Amazon (AMZN) Rolling One-Year Beta: 1.41\nFounded by Jeff Bezos after quitting his stock-picking job at D.E. Shaw, Amazon (NASDAQ:AMZN) is the world’s largest online retailer and provider of cloud computing services.\nWhy Are We Positive On AMZN?\nAmazon revolutionized the way consumers shop. This isn’t the only tailwind to its impressive revenue growth, as its highly profitable AWS segment has also driven top-line momentum.\nThe company's best-in-class revenue growth coupled with modest operating leverage on its past infrastructure investments has led to elite EPS growth over a multi-year period.\nThough dominant, Amazon's capital-intensive e-commerce business means its profitability is structurally lower than its pure-play tech peers. Can the company pull it up, or are we reaching a ceiling?\n\nAmazon is trading at $231.66 per share, or 31.3x forward price-to-earnings. Is now the time to initiate a position? See for yourself in our in-depth research report, it’s free for active Edge members .\nAMD (AMD) Rolling One-Year Beta: 1.71\nFounded in 1969 by a group of former Fairchild semiconductor executives led by Jerry Sanders, Advanced Micro Devices (NASDAQ:AMD) is one of the leading designers of computer processors and graphics chips used in PCs and data centers.\n\nStory Continues\nWhy Are We Bullish on AMD?\nImpressive 29.9% annual revenue growth over the last five years indicates it’s winning market share this cycle\nProjected revenue growth of 27.1% for the next 12 months is above its two-year trend, pointing to accelerating demand\nEarnings per share grew by 27.9% annually over the last five years and trumped its peers\n\nAMD’s stock price of $215.23 implies a valuation ratio of 38.8x forward P/E. Is now a good time to buy? Find out in our full research report, it’s free for active Edge members .\nStocks We Like Even More Your portfolio can’t afford to be based on yesterday’s story. The risk in a handful of heavily crowded stocks is rising daily.\nThe names generating the next wave of massive growth are right here in our Top 5 Growth Stocks for this month . This is a curated list of our High Quality stocks that have generated a market-beating return of 244% over the last five years (as of June 30, 2025).\nStocks that made our list in 2020 include now familiar names such as Nvidia (+1,326% between June 2020 and June 2025) as well as under-the-radar businesses like the once-micro-cap company Kadant (+351% five-year return). Find your next big winner with StockStory today for free . Find your next big winner with StockStory today . Find your next big winner with StockStory today .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "03:53:16",
      "Source": "Barchart",
      "Title": "Intel Stock Had a Banner Year But Is Still 50% Off Its Record Highs. Are More Gains in Store for 2026?",
      "URL": "https://finance.yahoo.com/m/a8b42796-9593-3d38-85b1-72805ec62ca2/intel-stock-had-a-banner-year.html",
      "Content": "Intel Stock Had a Banner Year But Is Still 50% Off Its Record Highs. Are More Gains in Store for 2026?\n\nWajeeh Khan\nMon, December 29, 2025 at 11:53 AM PST 2 min read\n\nIn this article: INTC\n\nAMD\n\nQCOM\n\nTSM\n\nAAPL\n\nIntel (INTC) stock has been a major outperformer this year as CEO Lip-Bu Tan’ strategic vision renewed investor confidence in the company’s ability to compete in the global AI arms race.\nUnder his leadership, the company secured billions in private and federal investments, paving the way to advance its foundry ambitions.\n\nMore News from Barchart Micron Technology Bear Put Spread Could Return 197% in this Down Move\nSanta Claus Rally, Fed Minutes and Other Can't Miss Items this Week\nMP Materials Gained 230% in 2025. Should You Buy, Sell, or Hold MP Stock for 2026?\nTired of missing midday reversals? The FREE Barchart Brief newsletter keeps you in the know. Sign up now!\nVersus their pandemic high, however, Intel shares remain down some 50%, suggesting persistent structural and executions risks continue to weigh on sentiment.\nWhat to Expect From Intel Stock in 2026 The latest setback for INTC stock came from Nvidia (NVDA) that’s reportedly scrapped plans of producing its advanced chips using Intel’s 18A node.\nStill, Daniel Newman – the chief executive of Futurum Group – believes the longer term bull case remains intact for one simple reason: Taiwan Semi (TSM) just “can’t produce enough chips.”\n\nThe unprecedented AI-driven demand is making big names like Apple (AAPL), Qualcomm (QCOM), and even AMD (AMD) explore alternatives, reinforcing Intel’s role as an auxiliary capacity provider.\nAnd since demand is truly explosive, being only an adjunct resource for the semiconductor space may prove sufficient in driving Intel stock higher in 2026, he told CNBC in a recent interview.\nINTC Shares Remain Inexpensive to Own Newman doesn’t see NVDA news as a major setback for Intel shares since Lip-Bu Tan had already broadcast that the initial ramp-up of the firm’s 18A node is optimized for and dedicated to its own internal products.\nAccording to him, the real inflection point for Intel will be its upcoming “14A” process, expected to enter volume production in 2028.\n\n“This is the one where rubber meets the road for companies like Nvidia, Apple, and others.”\nFrom a valuation perspective, INTC shares are just as attractive. Despite an explosive year-to-date rally, they’re going for just over 3x sales at the time of writing, versus more than 35x for Nvidia.\nWall Street Disagrees with Newman on Intel Wall Street analysts do not entirely agree with Newman’s constructive view on Intel stock, though.\nThe consensus rating on INTC shares remains at “Hold” only with the mean target of nearly $37 already in line with the price at which they are trading currently.\n\nStory Continues\nThis article was created with the support of automated content tools from our partners at Sigma.AI. Together, our financial data and AI solutions help us to deliver more informed market headline analysis to readers faster than ever.\nOn the date of publication, Wajeeh Khan did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "03:42:16",
      "Source": "Barchart",
      "Title": "AMD Stock Is Up 78% in 2025. What to Expect for Shares in 2026... and Beyond",
      "URL": "https://finance.yahoo.com/m/40346e70-f917-3f2b-b2fb-752bbbcf55a0/amd-stock-is-up-78%25-in-2025..html",
      "Content": "AMD Stock Is Up 78% in 2025. What to Expect for Shares in 2026... and Beyond\n\nWajeeh Khan\nMon, December 29, 2025 at 11:42 AM PST 2 min read\n\nIn this article: AMD\n\nINTC\n\nNVDA\n\nAdvanced Micro Devices (AMD) shares had a blockbuster 2025 as the company succeeded in positioning itself as the price-to-performance leader in artificial intelligence (AI) chips.\nStill, a senior Mizuho analyst, Vijay Rakesh, believes the semiconductor titan remains undervalued and poised to push higher on continued AI spending in 2026.\n\nMore News from Barchart Micron Technology Bear Put Spread Could Return 197% in this Down Move\nSanta Claus Rally, Fed Minutes and Other Can't Miss Items this Week\nMP Materials Gained 230% in 2025. Should You Buy, Sell, or Hold MP Stock for 2026?\nMarkets move fast. Keep up by reading our FREE midday Barchart Brief newsletter for exclusive charts, analysis, and headlines.\nAt the time of writing, AMD shares are trading at nearly 3x their price in the first week of April.\nAMD Stock Seen Rallying Another 30% Mizuho believes AMD has successfully pivoted to a yearly hardware update cycle, which keeps it competitive with Nvidia’s (NVDA) Blackwell architecture.\nAdvanced Micro Devices has been dismantling Intel’s (INTC) once-untouchable lead in server CPUs as well, with its share of that market expected to surpass 50% next year.\n\nMoreover, the company’s multi-year OpenAI deal is nothing short of a “game-changer,” set to add another $22 billion to its annual revenue by the end of this decade, according to Vijay Rakesh.\nIn his research note, he dubbed these tailwinds sufficient to drive AMD stock to $277 or up nearly 30% from here in 2026.\nHow Do AMD Shares Compare to NVDA? Advanced Micro Devices is worth owning also because recent reports suggest it will soon resume chip shipments to China, releasing an estimated $500 million (at least) in additional revenue for 2026.\nAMD shares outperformed Nvidia by a significant margin this year – yet, they remain cheaper to own on a price-sales (P/S) basis.\n\nMore importantly, even after a meteoric rally in 2025, the AI stock has its 100-day relative strength index (RSI) set at 54 only, indicating the upward momentum is far from exhaustion.\nAll in all, AMD is an early stage story with much more room for future growth than NVDA, and that alone is a strong enough reason to stay invested.\nWhat’s the Consensus Rating on Advanced Micro Devices? Other Wall Street analysts seem to agree with Mizuho’s bullish view on Advanced Micro Devices.\nAccording to Barchart, the consensus rating on AMD stock remains at “Moderate Buy” with price targets going as high as $380, indicating potential upside of a whopping 75% from here.\nOn the date of publication, Wajeeh Khan did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "03:30:00",
      "Source": "Yahoo Finance Video",
      "Title": "AI chipmakers that could steal some of Nvidia's spotlight in 2026",
      "URL": "https://finance.yahoo.com/video/ai-chipmakers-could-steal-nvidias-193000972.html",
      "Content": "AI chipmakers that could steal some of Nvidia's spotlight in 2026\n\nYahoo Finance Video and Jared Blikre\nMon, December 29, 2025 at 11:30 AM PST\n\nIn this video: NVDA\n\nAMD\n\nAVGO\n\nARM\n\nNvidia ( NVDA ) announced a deal to acquire AI hardware and software designer Groq ( GROQ.PVT ) for $20 billion last week. While the semiconductor manufacturer remained a major AI player in 2025, who could be some of Nvida's biggest competition in the fast-approaching 2026?\nTECHnalysis Research, LLC President Bob O'Donnell sits down with Yahoo Finance markets and data editor Jared Blikre on Market Catalysts to discuss which chipmaker could gain more prominence next year.\nAlso catch Bob O'Donnell's predictions for agentic AI in 2026 as it relates to cybersecurity usage.\nTo watch more expert insights and analysis on the latest market action, check out more Market Catalysts .\n\nVideo Transcript\n\n00:00 Jared\nAnd another thing people have been uh some of the critics have been pouuncing on is all the spending, the capital expenditures, so-called CAPEX. Uh we saw that it's been exploding over the last few years. It's set to continue next year. But uh we've seen in the Mag 5, for instance, we used to kind of talk about them or the Mag 7 uh as a whole. It's really only Alphabet and Nvidia, maybe Tesla as a come behind story that have really surged this year. So is it a game of have and have nots or how do you see this playing out?\n00:32 Bob\nNo, it's a great question. I mean, look, I think Nvidia obviously continues to do well, but I also am certain that Nvidia is going to heck get a heck of a lot more competition in 2026. AMD is, you know, an obvious one, but there's a lot of other little players. I mean, you know, Nvidia's uh deal with Grock recently to bring more of their technology in is a reflection of the fact that we're seeing more specialized types of models being developed. We're we're going from the days of big general purpose LLMs that you can use for everything to much more specialized areas. And each of those are going to require different types of hardware and I think in turn that's going to create additional opportunities, but it's going to create more diversity, which is going to be a little harder to figure out. But obviously I think, you know, you're going to continue to see folks like Nvidia and AMD do well. I do, as I said, I think you're going to start to see uh some of the smaller the cloud guys who are doing custom chips often through Broadcom will also start to benefit. We've seen already, you know, Google's been doing more with TPUs, uh Amazon has their Graviton chips. Um, we've got a a bunch of other companies. Microsoft is doing custom chips. A lot of these are arm-based. So arm is another company, you know, we haven't been talking about them a lot lately, but arm's helping drive some of this innovation. Intel, as you've talked about, you know, is doing well. They continue to plug away. Obviously, they had their challenges last year, but things are looking better in 2026. So, I think we're going to see a lot of different players uh from different areas uh all start to come together. And we'll see some smaller companies. Uh there's a little company called SiTime that does uh timing chips and all these networks have to be completely aligned from a timing perspective. They're doing some interesting stuff. So, I think there's a lot of different opportunities in different areas. Um but we're going to have a lot of the bears on the side just again, waiting to pounce on these oper these concerns that get raised, I think around a gentic AI.\n02:29 Jared\nAnd we'll have to see if those are dips worth buying or not. And Bob, what I'm realizing is we got to do another podcast real soon. So thank you for showing up.\n02:39 Bob\nYeah, man, I'd love to.\n02:40 Jared\nIt was great seeing you here.\n02:41 Bob\nThanks, Jared.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "01:56:17",
      "Source": "GuruFocus.com",
      "Title": "S&P 500 Slips From Record High as Tech Stocks Fall Ahead of Year-End",
      "URL": "https://finance.yahoo.com/news/p-500-slips-record-high-175617005.html",
      "Content": "S&P 500 Slips From Record High as Tech Stocks Fall Ahead of Year-End\n\nNauman Khan\nMon, December 29, 2025 at 9:56 AM PST 1 min read\n\nIn this article: ORCL\n\nNVDA\n\nPLTR\n\nAMD\n\nMETA\n\nThis article first appeared on GuruFocus .\nU.S. stocks fell on Monday as technology shares gave back recent gains, following a strong run in late 2025.\nThe S&P 500 slid 0.5%, while the Nasdaq Composite lost 0.7%. The Dow Jones Industrial Average dropped 277 points, or 0.6%. Nvidia ( NASDAQ:NVDA ) led tech losses, falling nearly 2%, with Palantir Technologies ( NASDAQ:PLTR ) and Meta Platforms (META) also retreating. Oracle (ORCL) and Advanced Micro Devices ( NASDAQ:AMD ) saw declines.\n\nWarning! GuruFocus has detected 5 Warning Signs with AMD.\nList of 52-Week Lows\nList of 3-Year Lows\nList of 5-Year Lows\nIs AMD fairly valued? Test your thesis with our free DCF calculator.\nMarket observers noted that with a light economic calendar, internal momentum may guide the market this week. \"Tech performance will be key to sustaining year-end gains,\" said Chris Larkin, head of trading and investing at E-Trade from Morgan Stanley.\nSilver reversed earlier gains after topping $80 an ounce for the first time, falling more than 7%. The precious metal surged nearly 150% in 2025, making it one of the year's strongest performers.\nMeanwhile, small-cap stocks lagged broader indexes. The Russell 2000 rose around 13% in 2025, underperforming the S&P 500's 17% gain. Analysts also caution political polarization could weigh on equities as 2026 begins.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "01:32:45",
      "Source": "24/7 Wall St.",
      "Title": "Nvidia’s Stock Is Cheaper Than Intel’s and AMD’s. Here’s Where I See It in 2026",
      "URL": "https://finance.yahoo.com/m/af12dfbd-3380-3d94-bd9e-e1d7362611d3/nvidia%E2%80%99s-stock-is-cheaper.html",
      "Content": "Nvidia’s Stock Is Cheaper Than Intel’s and AMD’s. Here’s Where I See It in 2026\n\nOmor Ibne Ehsan\nMon, December 29, 2025 at 9:32 AM PST 5 min read\n\nIn this article: NVDA\n\nINTC\n\nAMD\n\nQuick Read Nvidia trades at 25x forward earnings compared to Intel at 61x and AMD at 33x despite superior margins and growth.\nThe company reports $275B in backlog for 2026 with analysts expecting up to $412.5B in FY 2027 revenue.\nBear case valuation suggests $178 per share in 2026 while bull case projects $373 based on $330B revenue at 55% margins.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "01:23:41",
      "Source": "24/7 Wall St.",
      "Title": "Opinion: AMD Will Be the Semi Play to Beat in 2026",
      "URL": "https://finance.yahoo.com/m/fb6cd04e-652a-39ae-b3f9-5988869584c5/opinion%3A-amd-will-be-the-semi.html",
      "Content": "Business\nOpinion: AMD Will Be the Semi Play to Beat in 2026\n\nJoey Frenette\nMon, December 29, 2025 at 9:23 AM PST 4 min read\n\nIn this article: AMD\n\nNVDA\n\nSMH\n\nQuick Read AMD shares climbed nearly 80% in 2025 before a recent 19% pullback tied to broader AI sentiment.\nAMD’s positioning as a value alternative could benefit if investors push AI spenders toward cost discipline.\nThe VanEck Semiconductor ETF gained close to 50% in 2025 despite elevated volatility.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "01:03:00",
      "Source": "TheStreet",
      "Title": "AMD stock faces its next big test in 2026",
      "URL": "https://finance.yahoo.com/m/88c984ab-ac66-367d-82a9-bdec075b88c7/amd-stock-faces-its-next-big.html",
      "Content": "AMD stock faces its next big test in 2026\n\nMoz Farooque\nMon, December 29, 2025 at 9:03 AM PST 6 min read\n\nIn this article: AMD\n\nNVDA\n\nFor the better part of the last decade, Advanced Micro Devices ( AMD ) lived in Nvidia ’s shadow. In 2025, that changed.\nAMD stock took off handsomely ( up 78% year-to-date ), as Mr. Market stopped calling it “the alternative.”\nThe tech giant landed major AI deals in proving its mettle as more than just a CPU turnaround story.\n\nDespite Nvidia’s dominance in the AI chip space, the narrative has shifted to how much market share AMD can realistically capture.\nThat matters a great deal because breakthrough years, such as 2025, raise expectations much more quickly than earnings can keep pace.\nNevertheless, AMD enters 2026 with solid momentum, real long-term customers, and a fast-growing AI revenue base, but also with a stock price that reflects plenty of that optimism.\nHence, 2026 might not just be a victory lap but a proving ground.\nAMD proved it can compete in AI 2025 was clearly the year when AMD began to land real wins in the AI space.\nThe turning point came in October, when AMD announced marquee AI partnerships with the likes of OpenAI and Oracle, sending its stock up 34% in a single day , according to Reuters .\nRelated: CoreWeave CEO delivers blunt 5-word take on AI debate\n\nOpenAI selected AMD as its go-to GPU supplier , looking to deploy 6 gigawatts of AMD Instinct accelerators for its next-generation AI infrastructure plans.\nOracle followed suit by showing off its first public AI supercluster built around AMD’s new Helios rack design , covering 50,000 MI450 GPUs slated for release in Q3 2026.\nHere are some of AMD's biggest deals in 2025: OpenAI : Multiyear deal to deploy 6 gigawatts of AMD Instinct GPUs; the first 1 gigawatt of MI450 is expected for deployment in the second half of 2026.\nOracle : Expanded partnership; Oracle plans a publicly available AI supercluster with 50,000 MI450 GPUs starting Q3 2026.\nDOE/ORNL : $1 billion partnership with ORNL, HPE , and Oracle Cloud to build Lux and Discovery supercomputers.\nSanmina : Agreement up to $3 billion to buy ZT Systems manufacturing .\nCisco + G42 : UAE secure AI cluster built and secured by Cisco for G42, featuring Instinct MI350X GPUs.\n\nMoreover, CEO Lisa Su outlined a solid path to double-digit AI share , spearheaded by MI300 chips, which are forecasted to generate over $2 billion in sales and memory advantages favoring large AI models.\nThe financial proof behind AMD’s AI push The bull case for AMD is now clearly showing up in the numbers.\nEarnings snapshot over the past four quarters:\nFQ3 2025 (Sept. 2025): EPS 1.20 , beat by 0.03 ; revenue 9.25 billion , up 35.59% year over year , beat by 487.48 million.\nFQ2 2025 (June 2025): EPS 0.48 , in line; revenue 7.69 billion , up 31.71% year over year , beat by 255.65 million.\nFQ1 2025 (March 2025): EPS 0.96 , beat by 0.03 ; revenue 7.44 billion , up 35.90% year over year , beat by 318.31 million.\nFQ4 2024 (Dec. 2024): EPS 1.09 , in line; revenue 7.66 billion , up 24.16% year over year , beat by 132.12 million.\n\nStory Continues\nAMD’s stellar results were capped off by a standout Q3 2025 .\nRevenue hit a record $9.25 billion , up 36% year over year , Investing.com reported , as GAAP net income surged 61% to $1.24 billion .\nAt the same time, margins moved higher, as AMD’s gross margins skyrocketed 52% , up from 50% a year earlier, while its operating income climbed another 75% year over year .\n\nOn top of that, AMD generated record free cash flow , underscoring how growth is translating into cash.\nGrowth was broad-based:\nData Center: Revenue reached $4.3 billion , up 22% year over year , led by stellar demand for EPYC server CPUs and Instinct MI250 and MI300 accelerators (despite the $1.5 billion revenue headwind linked to China).\nClient and Gaming: Combined sales skyrocketed to $4 billion , up 73% year over year . PC sales reached a record $2.8 billion (up 46%), while gaming revenue was up a whopping 181% to $1.3 billion.\nEmbedded: Revenue dropped 8% year over year to $857 million , a modest drag linked to tougher comparisons following the Xilinx acquisition.\nFor perspective, AI-related products accounted for roughly 21% of AMD’s total sales, pushing expected full-year 2025 sales around $33 billion mark .\n\nGuidance shows momentum isn’t slowing In addition to that, AMD guided Q4 2025 sales to be at $9.6 billion (±$300 million), with the midpoint implying a sizeable 25% increase year over year.\nAdditionally, AMD’s management guided for non-GAAP gross margin to be at around 54.5% and operational expenses near $2.8 billion.\nOn the call, CEO Lisa Su said demand looks remarkably durable heading into next year.\n\nWhere AMD stock could trade in 2026 Wall Street is optimistic about AMD heading into 2026.\nThe bulls see substantial upside if execution holds up. On the other hand, skeptics view a stock that’s already pricing in a lot of good news.\nHere’s how the big firms are lining up:\nGoldman Sachs — $210 (Neutral): Goldman is still cautious, warning that AMD’s outlook is linked to flawless execution of its big AI deals and margin expansion, leaving virtually little room for error.\nBank of America — $300 (Buy): BofA expects AMD to effectively capture a double-digit share of a trillion-dollar AI market by 2030.\nHSBC — $310 (Buy): HSBC points to AMD’s incredible OpenAI win and expects a significant ramp-up in earnings growth as those deals scale.\nWells Fargo — $345 (Overweight): Perhaps the Street’s most bullish calls, spearheaded by healthy data-center momentum and AI product traction.\nMelius Research — $380 (Buy): The most aggressive target, which assumes AMD securing 10%+ AI chip share while sustaining its top- and bottom-line growth numbers.\nAcross roughly 51 analysts in the past three months, AMD stock’s consensus 12-month target sits near $282.82 (32% upside from current levels), underscoring superb confidence.\n\nAMD’s 2026 test: big AI upside, bigger expectations Heading into 2026, AMD’s not exactly easing into the hotly competitive AI race.\nAt its late-2025 Analyst Day , the management laid out some remarkably aggressive goals:\nRevenue growth: Targets 35%+ compound annual revenue growth over the next several years.\nData center engine: Expects 60%+ annual growth in data-center sales as the key driver.\nAI kicker: Projects 80%+ annual growth in AI revenue , implying a growing mix shift toward AI.\n\nMoreover, AMD will be rolling out its MI450 AI accelerators and Helios rack-scale systems in the back half of 2026, with early deployments linked to OpenAI and Oracle .\nWhether it can result in repeatable share gains remains a significant question mark.\nThat’s exactly why Bernstein’s Stacy Rasgon framed it as follows, according to Reuters .\nThe risks are real.\nNvidia still commands 80-90% of AI accelerators ; this, along with a misstep in AMD’s ROCm ecosystem, may slow adoption.\nExecution matters too, with delays in MI450 production, customer concentration around OpenAI, or tighter export controls impacting results. Throw in a rich valuation at over 54 times 2026 earnings , and the upcoming year becomes a not-so-simple test.\nRelated: Cathie Wood drops $1.3 million on healthcare stock\nThis story was originally published by TheStreet on Dec 29, 2025, where it first appeared in the Investing section. Add TheStreet as a Preferred Source by clicking here.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "23:55:43",
      "Source": "StockStory",
      "Title": "Why BellRing Brands (BRBR) Shares Are Falling Today",
      "URL": "https://finance.yahoo.com/news/why-bellring-brands-brbr-shares-155543285.html",
      "Content": "Why BellRing Brands (BRBR) Shares Are Falling Today\n\nAnthony Lee\nMon, December 29, 2025 at 7:55 AM PST 2 min read\n\nIn this article: BRBR\n\n^GSPC\n\n^IXIC\n\nNVDA\n\nAMD\n\nWhat Happened? Shares of nutrition products company Bellring Brands (NYSE:BRBR) fell 10.5% in the morning session after analysts highlighted a murky near-term outlook and rising volatility expected for the company.\nThe shifting views prompted a wave of revised forecasts, adding to the uncertainty around BellRing's performance. This cautious stance from Wall Street helped drive the sharp selloff.\n\nContributing to the weakness, major indices pulled back from record highs reached the previous week. The S&P 500 and Nasdaq were under pressure in the morning as the dominant artificial intelligence trade cools off. Market leaders like Nvidia and AMD saw significant losses as traders locked in profits following a banner year where the Nasdaq surged over 21%. With the S&P 500 recently hitting intraday highs near 6,945, this dip reflected a shift in internal momentum rather than a response to major economic news.\nThe stock market overreacts to news, and big price drops can present good opportunties to buy high-quality stocks. Is now the time to buy BellRing Brands? Access our full analysis report here .\nWhat Is The Market Telling Us BellRing Brands’s shares are quite volatile and have had 17 moves greater than 5% over the last year. But moves this big are rare even for BellRing Brands and indicate this news significantly impacted the market’s perception of the business.\nThe previous big move we wrote about was 14 days ago when the stock gained 2.5% on the news that investors flocked to defensive sectors, including consumer staples, amidst the broader tech sell-off.\n\nAs capital fled high-beta AI and tech names (like Broadcom and Oracle) due to margin concerns, investors reallocated into cash-generative, defensive growth stocks. Adding to the momentum, the company's recently authorized $600 million share repurchase program raised market optimism, signaling management's confidence in the stock's value.\nBellRing Brands is down 63.9% since the beginning of the year, and at $26.96 per share, it is trading 66% below its 52-week high of $79.39 from January 2025. Investors who bought $1,000 worth of BellRing Brands’s shares 5 years ago would now be looking at an investment worth $1,143.\nMicrosoft, Alphabet, Coca-Cola, Monster Beverage—all began as under-the-radar growth stories riding a massive trend. We’ve identified the next one: a profitable AI semiconductor play Wall Street is still overlooking. Go here for access to our full report .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "23:01:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Slips as Groq Deal Raises Questions",
      "URL": "https://finance.yahoo.com/m/95a0cad5-3b27-3e4d-87f7-d72c690058be/nvidia-stock-slips-as-groq.html",
      "Content": "Nvidia Stock Slips as Groq Deal Raises Questions\n\nAdam Clark\nMon, December 29, 2025 at 7:01 AM PST 3 min read\n\nIn this article: NVDA\n\nGROQ.PVT\n\nAMD\n\nAVGO\n\nNvidia was dropping early on Monday. Broader jitters about the technology sector looked to be hurting the stock, while Wall Street assessed the reported $20 billion price tag put on Nvidia’s agreement to license technology from artificial intelligence chip start-up Groq. Nvidia shares were down 1.6% at $187.45 in early trading, while the technology-heavy Nasdaq Composite lost 0.4%.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "22:00:04",
      "Source": "Zacks",
      "Title": "Advanced Micro Devices, Inc. (AMD) is Attracting Investor Attention: Here is What You Should Know",
      "URL": "https://finance.yahoo.com/news/advanced-micro-devices-inc-amd-140004060.html",
      "Content": "Advanced Micro Devices, Inc. (AMD) is Attracting Investor Attention: Here is What You Should Know\n\nZacks Equity Research\nMon, December 29, 2025 at 6:00 AM PST 5 min read\n\nIn this article: AMD\n\n^GSPC\n\nAdvanced Micro Devices (AMD) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock.\nShares of this chipmaker have returned -1.2% over the past month versus the Zacks S&P 500 composite's +2.6% change. The Zacks Computer - Integrated Systems industry, to which Advanced Micro belongs, has gained 7.1% over this period. Now the key question is: Where could the stock be headed in the near term?\n\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nEarnings Estimate Revisions Rather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nFor the current quarter, Advanced Micro is expected to post earnings of $1.31 per share, indicating a change of +20.2% from the year-ago quarter. The Zacks Consensus Estimate remained unchanged over the last 30 days.\nFor the current fiscal year, the consensus earnings estimate of $3.96 points to a change of +19.6% from the prior year. Over the last 30 days, this estimate has remained unchanged.\nFor the next fiscal year, the consensus earnings estimate of $6.26 indicates a change of +58% from what Advanced Micro is expected to report a year ago. Over the past month, the estimate has changed +0.1%.\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #3 (Hold) for Advanced Micro.\n\nStory Continues\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS Projected Revenue Growth Even though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\n\nFor Advanced Micro, the consensus sales estimate for the current quarter of $9.64 billion indicates a year-over-year change of +25.9%. For the current and next fiscal years, $33.94 billion and $43.05 billion estimates indicate +31.6% and +26.9% changes, respectively.\nLast Reported Results and Surprise History Advanced Micro reported revenues of $9.25 billion in the last reported quarter, representing a year-over-year change of +35.6%. EPS of $1.2 for the same period compares with $0.92 a year ago.\nCompared to the Zacks Consensus Estimate of $8.72 billion, the reported revenues represent a surprise of +6%. The EPS surprise was +2.56%.\n\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\nValuation Without considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects.\n\nWhile comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\n\nAdvanced Micro is graded F on this front, indicating that it is trading at a premium to its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nBottom Line The facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Advanced Micro. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "21:52:49",
      "Source": "MT Newswires",
      "Title": "Nvidia AI Strategy to be Key Investor Focus at CES Tech Show, Wedbush Says",
      "URL": "https://finance.yahoo.com/news/nvidia-ai-strategy-key-investor-135249599.html",
      "Content": "PREMIUM\nNvidia AI Strategy to be Key Investor Focus at CES Tech Show, Wedbush Says\n\nMT Newswires\nMon, December 29, 2025 at 5:52 AM PST 2 min read\n\nIn this article: NVDA\n\nNvidia (NVDA) Chief Executive Jensen Huang is expected to outline the chipmaker's artificial intelli\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "21:19:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Slips. Why Its Groq Deal Raises Questions.",
      "URL": "https://finance.yahoo.com/m/95a0cad5-3b27-3e4d-87f7-d72c690058be/nvidia-stock-slips.-why-its.html",
      "Content": "Nvidia Stock Slips. Why Its Groq Deal Raises Questions.\n\nAdam Clark\nMon, December 29, 2025 at 5:19 AM PST 2 min read\n\nIn this article: NVDA\n\nGROQ.PVT\n\nAMD\n\nAVGO\n\nNvidia was edging down early on Monday. Broader jitters about the technology sector looked to be hurting the stock, while Wall Street assessed the reported $20 billion price tag put on Nvidia’s agreement to license technology from artificial intelligence chip start-up Groq. Nvidia shares were down 1.1% at $188.49 in premarket trading.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "21:00:09",
      "Source": "Bloomberg",
      "Title": "Nvidia, Lenovo and Samsung to Test Consumer Appetite for AI at CES",
      "URL": "https://finance.yahoo.com/news/nvidia-lenovo-samsung-test-consumer-130009757.html",
      "Content": "Nvidia, Lenovo and Samsung to Test Consumer Appetite for AI at CES\n\nSamantha Kelly and Chris Welch\nMon, December 29, 2025 at 5:00 AM PST 5 min read\n\nIn this article: NVDA\n\nLNVGF\n\nSSNLF\n\nAMD\n\n(Bloomberg) -- At CES, the annual consumer technology conference happening in Las Vegas next week, the biggest names in tech, including Nvidia Corp., Advanced Micro Devices Inc., Samsung Electronics Co. and Lenovo Group Ltd., will make the case for artificial intelligence. Their target audience those few days: investors, corporate clients and — perhaps just as importantly — ordinary shoppers who have yet to be fully sold on the idea of AI-infused gadgets.\n\nCES, which runs from Jan. 6-9, is where many tech companies unveil their wares for the year. That includes a mix of products that are imminently available for purchase, and concept devices that may or may not go to market — and could be half-baked if they do. While Nvidia Chief Executive Officer Jensen Huang is likely to be the most charismatic showman in Vegas hyping AI’s underlying technologies, he’ll be surrounded by a slew of players that are testing consumers’ appetite for gadgets where AI isn’t just a nice-to-have feature, but the main selling point.\nMost Read from Bloomberg\nLondon’s Love of Wood-Burning Stoves Sparks a Pollution Debate\nThe show floor this year will be particularly populated with AI-powered hardware, including the sort of smart glasses popularized by Meta Platforms Inc. and that Snap Inc. and Apple Inc. are planning to launch by the end of 2026. While Meta and Snap will both have a presence at CES, the bulk of the news in this space is likely to come from smaller brands, such as Xreal Inc., Vuzix Corp., Halliday Global Ltd., Rokid and Even Realities.\n\nMeta isn’t expected to unveil new hardware at this time, having recently debuted its first smart glasses with a built-in screen. It is possible, however, that the social media giant is ready to show off some new or improved software features. It’s a similar story for Snap, which isn’t likely to choose this venue to announce pricing and availability for its forthcoming “Specs” glasses. The Specs will be on display for attendees who haven’t had a chance to see them in person, which has so far mostly included select media outlets.\nIn addition to eyewear, such as glasses and goggles, some of these gadgets will take the form of a ring or something else entirely — underscoring that startups and Big Tech alike remain bullish on AI-first hardware that lets people tap into intelligent assistants without necessarily taking out their smartphone. Previous offerings, including the Humane AI Pin and the Rabbit R1, were commercial failures after being panned by tech reviewers.\n\nStory Continues\nRobots Everywhere\nMany companies will also be testing consumers' readiness to accept AI-powered humanoid robots. There will be so many players, in fact, that the Consumer Technology Association, or CTA, which organizes CES, has set aside an entire hall of the convention space for robotics. While some of these robots are intended for the home, many of the models on display will be designed for enterprise uses such as manufacturing, logistics and food service. Firms such as Artly Coffee and VenHub Global will show off technology for AI-powered robotic cafés and convenience stores.\nCompanion robots will be a common sight as well, including products like the Jennie robot dog from Tombot Inc., a California-based startup focused on developing products for aging adults and people living with dementia.\nIf 2026 is similar to previous shows, there’s likely to be a sizeable gap between what many of these human-inspired bots are capable of in controlled demos versus what their makers promise they’ll eventually be able to do.\nStill, there are signs of progress. Many humanoid makers this year are shifting from single-task demonstrations to more complex, multi-step tricks, such as both sorting and folding laundry. Larger players, including LG, are expected to tease their own humanoid concepts, but the companies will need to convince attendees that these machines are commercially viable amid ongoing challenges around battery life, mobility, cost and safety.\n\nEverything Else\nAbove all other categories, televisions have traditionally been the centerpiece of CES, with Samsung, LG, and ascendant Chinese competitors TCL and Hisense showing off their brightest, biggest sets for the new year. Sony Group Corp., once a cornerstone of the convention show floor, has moved its TV product announcements to spring in recent years and pared back its booth as a result.\nIn 2026, with high-end TVs now delivering more than enough brightness and resolution for most consumers, manufacturers are likely to focus on wider color reproduction and other improvements that result in a more vivid, lifelike picture. Aesthetically pleasing models like Samsung’s The Frame line have inspired a wave of clones from other TV makers, a trend that’s likely to continue in Vegas.\nCES typically isn’t a venue for major smartphone news, but Motorola could be an exception this year. Its parent company, Lenovo, is headlining one of the show’s evening keynotes for the first time, and Motorola mailed a teaser package to media that strongly hints at a book-style foldable. Such a device would be its first of that form factor after years of releasing Razr-branded folding handsets.\n\nMeanwhile, wearables will continue to evolve beyond basic fitness tracking, blurring the lines with medical-grade devices. The show will feature products such as a smart night guard that not only protects against teeth grinding but also claims to monitor sleep apnea events, heart rate, respiration and sleep cycles. Wearables in general are expected to offer a greater focus on women’s health, continuous glucose monitoring, advanced cardiovascular tracking, longevity and chronic-condition management.\nMost Read from Bloomberg Businessweek\nErasing the Verdict: The Ongoing Shock of Trump’s Cocaine Kingpin Pardon\nJapan’s Viral Horse-Racing Video Game Has Players Flocking to Real-Life Stables\nChina’s EV Battery Giant Is Trying to Find a New Road\nThat Time I Tried to Buy OpenAI\nThe United States of Klarna\n©2025 Bloomberg L.P.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "19:50:00",
      "Source": "Motley Fool",
      "Title": "Will AMD Be a Must-Own AI Stock in 2026?",
      "URL": "https://finance.yahoo.com/m/0d2e016c-9e7e-367d-bec4-4d60d8972d5f/will-amd-be-a-must-own-ai.html",
      "Content": "Will AMD Be a Must-Own AI Stock in 2026?\n\nKeithen Drury, The Motley Fool\nMon, December 29, 2025 at 3:50 AM PST 4 min read\n\nIn this article: AMD\n\nNVDA\n\nKey Points AMD is starting to make a comeback in the AI revolution.\nAMD's management believes it can deliver 60% data center growth through 2030.\nThe stock has a premium price tag over its chief rival.\n10 stocks we like better than Advanced Micro Devices ›\nAMD (NASDAQ: AMD) has spent most of the artificial intelligence (AI) buildout in second place to Nvidia (NASDAQ: NVDA) . This has caused AMD's stock to dramatically underperform Nvidia since 2023, with AMD rising aboiut 230% while Nvidia is up around 1,160%. However, AMD flipped the script in 2025, as it outperformed Nvidia stock significantly. AMD is up nearly 80% while Nvidia rose around 35%.\nThat's strong performance from both stocks, but AMD's 2025 comeback made it a must-own stock this year. The question is, will AMD be a must-own stock in 2026? Let's find out.\nAMD's comeback is real Nvidia was, and still is, the preferred graphics processing unit (GPU) vendor for the AI hyperscalers. Its GPUs and technology stack truly lead the industry, with AMD serving as a viable alternative. However, AMD has started to close the gap, particularly with controlling software.\nNvidia's CUDA software was one of the major differentiators between the two offerings, as AMD's wasn't nearly as good. However, thanks to various acquisitions and partnerships, AMD's ROCm software has dramatically improved. In fact, AMD reported that downloads for ROCm software increased 10 times year over year as of November 2025. This shows AMD is gaining ground, and there's another important consideration as well.\n\nDuring Nvidia's Q3 FY 2026 results, its CEO, Jensen Huang, noted that the company was \"sold out\" of cloud GPUs. This is a huge deal, as its cloud clients aren't going to sit around idle while Nvidia fulfills demand. Instead, they're going to go looking for alternative computing providers, and AMD is near the top of the list. This could allow AMD to build a strong position in the computing hardware industry. If AI clients find out that AMD's hardware offers similar performance at a much lower price point, you could see more clients begin to use AMD's hardware stack instead of Nvidia's. This would be a huge shift for AMD, making it one of the best AI stocks to own in 2026 and beyond.\nAMD's internal projections reflect this, as management believes the data center division can achieve a 60% compounded annual growth rate (CAGR) through 2030. In Q3, its data center growth rate was a mere 22%. This is a lofty goal AMD set for itself, but if it can achieve it, AMD will become a top artificial intelligence stock to own for the next few years.\n\nStory Continues\nCompanywide, AMD expects its CAGR to come in around 35%, because its consumer hardware and embedded processor divisions are only expected to grow at around a 10% CAGR over the next five years. Still, a 35% growth rate is nothing to be disappointed with, and if AMD's growth starts to accelerate in 2026, the stock could go on an incredible run. But there's one factor holding it back.\n\nSome of AMD's comeback is already priced in The market is well aware of the situation laid out above, which is why AMD's stock has done so well in 2025. Part of that success is already priced into its stock, as it trades for a significant premium over rival Nvidia when next year's earnings are used as the forward earnings valuation metric.\nInvestors must pay nearly 50% more to own AMD's stock versus Nvidia's. That's a hefty premium to place on a company that hasn't started its comeback yet; it's only talked about it. That's concerning to me, as I want to see some progress before I'm willing to say that AMD is the better stock to own for 2026. However, I still think that AMD will be successful, but just maybe not as successful as Nvidia will be in 2026.\n\nShould you invest $1,000 in Advanced Micro Devices right now? Before you buy stock in Advanced Micro Devices, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Advanced Micro Devices wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nKeithen Drury has positions in Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices and Nvidia. The Motley Fool has a disclosure policy .\nWill AMD Be a Must-Own AI Stock in 2026? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "19:38:00",
      "Source": "Zacks",
      "Title": "The Zacks Analyst Blog Highlights Advanced Micro Devices, Goldman Sachs, Lam Research, AstroNova and Blue Dolphin",
      "URL": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-advanced-113800201.html",
      "Content": "The Zacks Analyst Blog Highlights Advanced Micro Devices, Goldman Sachs, Lam Research, AstroNova and Blue Dolphin\n\nZacks Equity Research\nMon, December 29, 2025 at 3:38 AM PST 6 min read\n\nIn this article: AMD\n\nGS\n\nLRCX\n\nALOT\n\nBDCO\n\nFor Immediate Release Chicago, IL &ndash; December 29, 2025 &ndash; Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Advanced Micro Devices, Inc. AMD, The Goldman Sachs Group, Inc. GS, Lam Research Corp. LRCX, AstroNova, Inc. ALOT and Blue Dolphin Energy Co. BDCO.\n\nHere are highlights from Friday&rsquo;s Analyst Blog:\nTop Analyst Reports for AMD, Goldman Sachs and Lam Research\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Advanced Micro Devices, Inc., The Goldman Sachs Group, Inc. and Lam Research Corp., as well as two micro-cap stocks, AstroNova, Inc. and Blue Dolphin Energy Co. These research reports have been hand-picked from roughly 70 reports published by our analyst team today.\n\nYou can see all of today&rsquo;s research reports here >>>\nAhead of Wall Street\nThe daily 'Ahead of Wall Street' article is a must-read for all investors who would like to be ready for that day's trading action. The article comes out before the market opens, attempting to make sense of that morning's economic releases and how they will affect that day's market action. You can read this article for free on our home page and can actually sign up there to get an email notification as this article comes out each morning.\n\nYou can read today's AWS here >>> Full-Day in the Markets on a Recently Declared Federal Holiday\nToday's Featured Research Reports\nAdvanced Micro Devices&rsquo; shares have outperformed the Zacks Computer &ndash; Integrated Systems industry over the last six months (+49.5% vs. +47.0%). The Zacks analyst believes AMD is benefiting from rising demand for EPYC processors as cloud, enterprise and AI-driven workloads expand. Growing adoption by major hyperscalers, increased use of Instinct accelerators and the launch of the MI350 series have strengthened AMD&rsquo;s system-level capabilities, supported by a broad ecosystem of cloud and AI partners.\nHowever, the company faces intense competition from NVIDIA in AI accelerators and from Intel in CPUs, whose entrenched ecosystems and strong market positions continue to pressure its growth prospects.\n\n(You can read the full research report on Advanced Micro Devices here >>>)\nGoldman Sachs&rsquo; shares have outperformed the Zacks Financial &ndash; Investment Bank industry over the past year (+58.1% vs. +39.2%). The Zacks analyst believes that the company has shown solid momentum, supported by strong execution in investment banking and trading. The firm is refocusing on its core businesses, scaling back consumer banking, and expanding through strategic acquisitions in private equity credit and global alternatives, which should strengthen its global presence and revenue mix.\n\nStory Continues\nYet heavy reliance on overseas markets raises concerns amid geopolitical uncertainty. Rising expenses from ongoing technology investments and higher transaction-related costs during periods of strong client activity also remain key challenges.\n(You can read the full research report on Goldman Sachs here >>>)\n\nLam Research&rsquo; s shares have outperformed the Zacks Electronics &ndash; Semiconductors industry over the past six months (+82.5% vs. +25.3%). The Zacks analyst believes that the company is benefiting from its strength in 3D DRAM and advanced packaging, with rising etch and deposition intensity driven by more complex 3D architectures. Improving memory spending, solid demand for high-bandwidth memory and continued investments in research and development position the company well to capitalize on higher wafer fab equipment demand.\nHowever, spending on mature semiconductor nodes is likely to remain weak in the near term. Ongoing trade and tariff tensions between the United States and China also remain a key risk to its outlook.\n(You can read the full research report on Lam Research here >>>)\n\nAstroNova&rsquo; s shares have underperformed the Zacks Technology Services industry over the past year (-34.2% vs. +22.0%). The Zacks analyst believes that execution challenges persist for the company, including margin pressure from inventory buildup, volatility in the Product ID segment, sluggish Aerospace OEM demand and weak cash conversion, despite the stock trading well below peer valuations.\nYet AstroNova is repositioning for margin expansion by shifting toward higher-margin ToughWriter 640 printers, supported by cost reductions, lower debt and proprietary printhead technology that enables vertical integration and recurring revenue.\n(You can read the full research report on AstroNova here >>>)\nBlue Dolphin Energy&rsquo; s shares have underperformed the Zacks Oil and Gas &ndash; Exploration and Production &ndash; United States industry over the last six months (-24.0% vs. -12.5%). The Zacks analyst believes severe liquidity stress, weakening profitability, refinancing risk and governance concerns tied to affiliate dependence weigh heavily on the company. Exposure to demand softness, crude price volatility, inventory risks and limited capital access further threaten its long-term viability.\n\nHowever, the company continues to operate its refining business with support from affiliated entities, which has helped sustain operations in a difficult industry environment.\n(You can read the full research report on Blue Dolphin here >>>)\nFree: Instant Access to Zacks' Market-Crushing Strategies\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\nToday you can tap into those powerful strategies &ndash; and the high-potential stocks they uncover &ndash; free. No strings attached.\nGet all the details here >>\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss . This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nThe Goldman Sachs Group, Inc. (GS) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nLam Research Corporation (LRCX) : Free Stock Analysis Report\nAstroNova, Inc. (ALOT) : Free Stock Analysis Report\nBlue Dolphin Energy Co. (BDCO): Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "19:37:05",
      "Source": "Simply Wall St.",
      "Title": "AI Chips Today - Synopsys Faces Challenges Amid Market Turbulence And Legal Issues",
      "URL": "https://finance.yahoo.com/news/ai-chips-today-synopsys-faces-113705960.html",
      "Content": "AI Chips Today - Synopsys Faces Challenges Amid Market Turbulence And Legal Issues\n\nSimply Wall St\nMon, December 29, 2025 at 3:37 AM PST 1 min read\n\nIn this article: SNPS\n\nNVDA\n\nAMD\n\nMU\n\nRecent developments in the AI chips sector spotlight Synopsys, Inc., a provider of design automation software for integrated circuits, which has been impacted by significant financial turbulence. Synopsys disclosed a downturn in its Design IP segment, which experienced a 7.7% revenue decline and a substantial 43% drop in net income year-over-year, largely due to increased customization demands from clients. This underperformance has led to a class action lawsuit alleging securities fraud against Synopsys, underscoring the challenges the company faces in adapting its business model to evolving market demands within the AI chips industry.\n\nIn other market news, Kioxia Holdings was a notable mover up 5.7% and ending the day at ¥11,415. At the same time, Credo Technology Group Holding lagged, down 3.6% to close at $144.83.\nProjected 33.8% annual revenue growth hinges on sustaining profit margins amid competition. Explore the detailed narrative on Credo Technology Group Holding's potential and challenges.\nFor a deep exploration of the implications of AI companies flooding the bond market and its impact on the tech sector, revisit our Market Insights article titled \"AI Companies Hit The Bond Market\" before opportunities narrow.\nBest AI Chip Stocks NVIDIA finished trading at $190.53 up 1%.\nAdvanced Micro Devices finished flat at, $214.99.\nMicron Technology closed at $284.79 down 0.7%, near its 52-week high.\nWhere To Now? Reveal the 83 hidden gems, such as Moore Threads Technology , MACOM Technology Solutions Holdings and ASM International , among our AI Chip Stocks screener with a single click here.\nContemplating Other Strategies? The best AI stocks today may lie beyond giants like Nvidia and Microsoft. Find the next big opportunity with these 24 smaller AI-focused companies with strong growth potential through early-stage innovation in machine learning, automation, and data intelligence that could fund your retirement.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nSources:\nSimply Wall St\n\"SNPS STOCK NOTICE: Synopsys, Inc. IP Underperformance Leads to Securities Class Action – Contact BFA Law before Tuesday’s December 30 Legal Deadline\" from Bleichmar Fonti & Auld on GlobeNewswire (published 27 December 2025)\n\nStory Continues\nCompanies discussed in this article include TSE:285A NasdaqGS:NVDA NasdaqGS:AMD NasdaqGS:MU and NasdaqGS:CRDO .\nThis article was originally published by Simply Wall St .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "18:30:00",
      "Source": "Barrons.com",
      "Title": "Cathie Wood’s ARK Funds Have Crushed the Market This Year. What She’s Betting On for 2026.",
      "URL": "https://finance.yahoo.com/m/45ada057-0d95-3e92-9afc-b859282038f2/cathie-wood%E2%80%99s-ark-funds-have.html",
      "Content": "Cathie Wood’s ARK Funds Have Crushed the Market This Year. What She’s Betting On for 2026.\n\nCallum Keown\nMon, December 29, 2025 at 2:30 AM PST 2 min read\n\nIn this article: TSLA\n\nROKU\n\nAMD\n\nSHOP\n\nHOOD\n\nCathie Wood’s ARK funds are on track to beat the market in 2025. She's already looking ahead to next year.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "00:36:00",
      "Source": "Motley Fool",
      "Title": "What Is the Best Artificial Intelligence (AI) Stock to Hold for the Next 10 Years?",
      "URL": "https://finance.yahoo.com/m/92e033bd-467e-3790-a963-523cff98bcb6/what-is-the-best-artificial.html",
      "Content": "What Is the Best Artificial Intelligence (AI) Stock to Hold for the Next 10 Years?\n\nAdam Spatacco, The Motley Fool\nSun, December 28, 2025 at 8:36 AM PST 5 min read\n\nIn this article: TSM\n\nNVDA\n\nAMD\n\nAVGO\n\nMU\n\nKey Points Chip designers such as Nvidia, Advanced Micro Devices, and Broadcom serve as the backbone of generative AI development.\nWhile chip designers steal the spotlight, Taiwan Semiconductor Manufacturing is playing a hugely important supporting role in the background.\nAs demand for AI chips and data centers accelerates, Taiwan Semi is poised for explosive long-term growth.\n10 stocks we like better than Taiwan Semiconductor Manufacturing ›\n\nFor the last three years, investing in semiconductor stocks has proven to be a profitable decision given the critical role chips play in the development of generative artificial intelligence (AI). Companies such as Nvidia , Advanced Micro Devices , Broadcom , and Micron Technology have been some of the biggest contributors to the semiconductor industry throughout the artificial intelligence (AI) revolution.\nFlying under the radar is another chip company whose storyline seems muted compared to its peers. That's Taiwan Semiconductor Manufacturing (NYSE: TSM) , the pick-and-shovel specialist of the chip realm.\nLet's dive into Taiwan Semi's increasingly important role for the future of AI and assess why the stock looks like a no-brainer buying opportunity for investors with a long-term horizon.\nHow does Taiwan Semiconductor benefit from AI? Throughout the AI revolution, hyperscalers such as Microsoft , Alphabet , Amazon , Meta Platforms , and OpenAI have collectively poured hundreds of billions of dollars into AI-related capital expenditures (capex) -- namely, chips and networking gear for data centers.\nOn the surface, this is great news for the likes of Nvidia, AMD, and Broadcom. But underneath the surface, it's even better news for Taiwan Semi. Why is that?\n\nTSMC is the largest chip manufacturer in the world in terms of revenue. While Nvidia, AMD, and Broadcom design the most-in demand GPUs and custom application-specific integrated circuits (ASICs) on the planet, each of these giants relies heavily on Taiwan Semi's cutting-edge fabrication processes.\nIn other words, if Nvidia and its competitors represent the body of the car moving the AI narrative forward, TSMC holds the keys to the ignition.\nTSMC's growth is off the charts Over the last year, Taiwan Semi's revenue has been growing strongly thanks to ongoing demand for AI accelerators. What's interesting to point out is that the company's revenue trajectory is actually steepening. This is largely driven by rising demand for Nvidia's and AMD's next-generation Rubin and MI400 Series chips, as well as increasing investment in custom hardware from cloud infrastructure providers.\n\nStory Continues\nThe more subtle aspect from the financial picture above is Taiwan Semi's expanding profitability profile. Given its near-70% market share, TSMC is able to command enormous pricing power relative to competitors like Intel or Samsung .\nAgainst this backdrop, Taiwan Semi's gross margin is widening -- with excess cash flowing straight to the bottom line. The company is making the most of this new wave of capital by expanding its geographic footprint -- building additional foundries in Arizona, Germany, and Japan.\n\nIs Taiwan Semi stock a good buy right now? At the moment, TSMC boasts a forward price-to-earnings (P/E) multiple of 28.4 -- hovering near its highest level during the AI revolution. If you were to base your investment decision purely off of this metric, you may think Taiwan Semi is overvalued.\nSmart investors understand that TSMC's premium valuation could be warranted, though. McKinsey & Company is forecasting AI infrastructure to be a $7 trillion market through 2030 -- with the majority of spend allocated toward refining AI workloads.\nIn essence, building out AI-equipped data centers is expected to accelerate throughout the rest of the decade as training and inferencing models becomes more sophisticated and demanding. This is great news for TSMC as it paves the way for long-run visibility across the business.\n\nThe AI infrastructure chapter is still in its early innings. Over the course of the next several years, Taiwan Semi is positioned to benefit from the secular tailwind of rising investment in infrastructure both domestically and abroad.\nTaking this one step further, physical applications such as autonomous systems and robotics are yet to be deployed in a commercial sense. Looking beyond into the 2030s, these use cases are expected to drive additional trillions in economic value.\nShould they achieve some form of adoption and set the stage for the next wave of AI, Taiwan Semi has the potential to benefit immensely beyond where AI stands today -- building large language models (LLMs) and other software-based applications.\nWhen you consider the bigger picture and begin to think longer-term, TSMC's growth potential relative to its valuation looks compelling. So while the stock may not appear dirt cheap at first glance, I think there is ample room for meaningful valuation expansion over the course of the next decade -- making the stock a no-brainer buy right now in my eyes.\n\nShould you invest $1,000 in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nAdam Spatacco has positions in Alphabet, Amazon, Meta Platforms, Microsoft, and Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Intel, Meta Platforms, Microsoft, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nWhat Is the Best Artificial Intelligence (AI) Stock to Hold for the Next 10 Years? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-28",
      "Time": "23:58:56",
      "Source": "Insider Monkey",
      "Title": "Advanced Micro Devices (AMD) up More Than 76% YTD, Is it Still a Buy?",
      "URL": "https://finance.yahoo.com/news/advanced-micro-devices-amd-more-155856137.html",
      "Content": "Advanced Micro Devices (AMD) up More Than 76% YTD, Is it Still a Buy?\n\nTalha Qureshi\nSun, December 28, 2025 at 7:58 AM PST 2 min read\n\nIn this article: AMD\n\nNVDA\n\nINTC\n\n​Advanced Micro Devices, Inc. (NASDAQ: AMD ) is one of the Best Quality Stocks to Buy Before 2026 . Advanced Micro Devices, Inc. (NASDAQ:AMD) has risen more than 76.9% year-to-date. The share price moved further up on December 17, after South China Morning Post reported the company’s chair and CEO, Lisa SU met with the Chinese minister of industry and information technology.\nAccording to the report, Lisa Su affirmed the commitment to deepen its investment in China. The chief executive also noted that China will offer greater corporate opportunities for foreign enterprises, including Advanced Micro Devices.\n​This report comes as President Trump released a statement suggesting eased export control on Nvidia’s H200 chips and also indicated potential relaxation for Intel and Advanced Micro Devices. This is an important update for the company as during fiscal 2024, China and Hong Kong combined generated roughly $6.2 billion in revenue for the company, thereby making it the second largest market for AMD.\n\n​That said, Wall Street also maintains a positive outlook on the stock. On December 19, Vijay Rakesh from Mizuho Securities reiterated a Buy rating on the stock but slightly lowered the price target from $279 to $277. On the same day, William Stein from Truist Financial also reiterated a Buy rating on the stock with a $201.06 price target.\n​Advanced Micro Devices, Inc. (NASDAQ:AMD) is a global semiconductor company that manufactures GPUs, microprocessors, and high-performance computing solutions and serves a number of high-growth industries like gaming, data centers, and AI.​\nWhile we acknowledge the potential of AMD as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-28",
      "Time": "07:30:00",
      "Source": "Motley Fool",
      "Title": "Prediction: AMD Stock Will Jump 60% in 2026, Thanks to President Donald Trump",
      "URL": "https://finance.yahoo.com/m/815df209-08d0-3554-9dfd-ea97a351a4ad/prediction%3A-amd-stock-will.html",
      "Content": "Prediction: AMD Stock Will Jump 60% in 2026, Thanks to President Donald Trump\n\nHarsh Chauhan, The Motley Fool\nSat, December 27, 2025 at 3:30 PM PST 5 min read\n\nIn this article: AMD\n\nNVDA\n\nINTC\n\nKey Points AMD was getting a nice chunk of its revenue from the Chinese market before the U.S. government's export controls took effect in April 2025.\nAMD will soon be allowed to sell advanced AI chips to Chinese customers, which should benefit AMD's business in 2026.\nThis could help AMD exceed Wall Street's growth expectations next year, which could send the stock soaring.\n10 stocks we like better than Advanced Micro Devices ›\n\nAdvanced Micro Devices (NASDAQ: AMD) stock clocked stellar gains in 2025, rising 78% this year as of this writing. However, recent trading suggests that some investors are booking profits. AMD stock is down 19% since hitting a 52-week high on Oct. 29.\nThis pullback could be a buying opportunity for investors looking to add a fast-growing company that's benefiting from the adoption of artificial intelligence (AI) . Additionally, a recent announcement by President Donald Trump, which will allow companies like Nvidia (NASDAQ: NVDA) , AMD, and Intel to sell their advanced AI chips to Chinese customers, is going to give AMD an additional boost in 2026.\nLet's take a closer look at AMD's catalysts for the new year and see why this stock has the potential to soar once again.\nThe Trump administration's announcement could give AMD a big shot in the arm AMD's business grew at a nice clip in 2025. It is on track to deliver $34 billion in revenue for the year, up 31% over 2024 revenue. It might have been even better, but AMD hasn't been able to sell its chips into the Chinese market since April, when the Trump administration imposed export controls on sales of advanced AI data center chips to that country.\n\nAs a result, AMD incurred an $800 million inventory charge in the second quarter. Moreover, the company lost a significant chunk of its revenue stream thanks to the Trump administration's move. That's because China accounted for nearly a quarter of AMD's 2024 revenue of $25.8 billion, or almost $6.2 billion.\nDespite the headwind, analysts expect a 20% increase in the company's earnings for 2025 to $3.97 per share. Consensus estimates suggest that AMD's earnings could jump 62% next year to $6.46 per share. I think it could end up doing much better than that.\nTake Nvidia, for example. The Trump administration now allows Nvidia to sell its advanced H200 chips to Chinese customers. Nvidia was previously only selling its downsized H20 chips in China to comply with export regulations. Those chips were significantly cheaper and less powerful than Nvidia's flagship Hopper processor, the H200.\n\nStory Continues\nWith the change, Nvidia will likely see a significant bump in its revenue next year, even after paying the 25% tax that the administration plans to charge on sales to China. President Trump pointed out in his Truth Social post that the \"same approach will apply to AMD,\" suggesting that the company may be able to sell its high-end chips to Chinese customers.\n\nIt was earlier selling the downgraded MI308 processor to Chinese customers. It may now be able to ship its more powerful chips into that market, just like Nvidia has been allowed to. So, there is a possibility of AMD regaining the lost Chinese revenue in 2026, even with the 25% export fee.\nThat's because a full-fledged AMD data center graphics processing unit (GPU) will carry a significant premium over the nerfed MI308. This is why AMD's sales next year could turn out to be much higher than expected.\nThe stock could skyrocket in 2026 Analysts anticipate AMD's revenue to jump by 31% in 2026 to $44.6 billion. Assuming its revenue from China next year lands at 2024 levels of $6.2 billion, its top line could be somewhere around $51 billion. What's worth noting is that analysts haven't adjusted their 2026 revenue expectations for AMD following the Trump administration's rule change, suggesting that the company's potential gains from China aren't baked in just yet.\nAssuming AMD does achieve $51 billion in revenue next year and maintains its price-to-sales ratio of 11 at that time, its market cap could jump to $561 billion. That points toward a potential jump of 60% from its current market cap. So, now it would be a good time to buy this semiconductor stock following its recent pullback, as it has the potential to soar impressively in the new year.\n\nShould you invest $1,000 in Advanced Micro Devices right now? Before you buy stock in Advanced Micro Devices, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Advanced Micro Devices wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nHarsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Intel, and Nvidia. The Motley Fool has a disclosure policy .\nPrediction: AMD Stock Will Jump 60% in 2026, Thanks to President Donald Trump was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "20:50:00",
      "Source": "Motley Fool",
      "Title": "Prediction: This Artificial Intelligence (AI) Stock Could 5X by 2030",
      "URL": "https://finance.yahoo.com/m/026c927d-39d1-34aa-87ab-758c28d5d7c3/prediction%3A-this-artificial.html",
      "Content": "Prediction: This Artificial Intelligence (AI) Stock Could 5X by 2030\n\nKeithen Drury, The Motley Fool\nSat, December 27, 2025 at 4:50 AM PST 5 min read\n\nIn this article: AMD\n\nNVDA\n\nKey Points AMD's technology stack is improving.\nAMD's margins could expand to deliver outsized profit growth.\n10 stocks we like better than Advanced Micro Devices ›\nFinding stocks that can increase in value 5 times within five years is a lofty goal. That requires serious stock performance, and few companies can deliver that. To achieve 5 times returns in five years, a company must grow at a 38% compounded annual growth rate (CAGR) . A 38% CAGR isn't an easy return to achieve, and it requires a massive market opportunity.\n\nWhat's a bigger opportunity than artificial intelligence (AI) ? There are several names in this industry, including AMD (NASDAQ: AMD) . AMD has outperformed rival Nvidia in 2025, rising around 80% versus Nvidia's 35%. Furthermore, AMD gave an incredible growth projection set to come about over the next five years, so it's the perfect candidate to see if it could return 5 times in five years. Management's numbers line up with the 38% CAGR laid out above, giving AMD a real shot at delivering this incredible return.\nAMD's management is bullish on its five-year outlook Frankly, AMD has not done well in the AI revolution. Its hardware isn't as good as Nvidia's, and its software was well behind. However, AMD has made various acquisitions and partnerships to improve its controlling software, ROCm. It noted that downloads for ROCm were up 10 times year over year as of November 2025, so there is a possibility that AMD could start gaining some ground on Nvidia once AI clients realize that AMD's technology stack could compete with Nvidia's.\n\nNvidia has controlled the data center computing market with an iron fist, and this dominance shows up in each company's results. In Q3 2025, AMD's data center revenue rose 22% year over year to $4.3 billion. During Nvidia's Q3 FY 2026 (ending Oct. 26, 2025), its data center revenue totaled $51.2 billion, up 66% year over year. AMD is clearly getting smoked here, but the tides could be changing.\nIn Nvidia's release, they noted that they are \"sold out\" of cloud GPUs. This could be a concern for Nvidia, as clients will now likely search for alternative computing providers to fulfill their massive computing power needs. AMD could emerge as a top option to provide this power, and once they realize how far AMD's technology has come, they could become greater clients of AMD's because of its lower price point. That could increase AMD's business in the future, and so could a return to selling in the Chinese market.\n\nStory continues\nCurrently, neither AMD nor Nvidia is allowed to sell in China. However, they recently made a deal with the U.S. government to give up 15% of revenue for the right to export these GPUs to China. These GPUs aren't the cutting-edge ones used in the U.S. and are specifically downgraded to meet export restrictions. But if this sales channel returns, it could be a huge boost to AMD over the long run.\n\nWhile these are positive catalysts, are they enough to provide the 38% CAGR necessary to return 5 times in five years?\nAMD's guidance is slightly lower than a 38% CAGR Over the next five years, AMD believes it can deliver a 60% CAGR in its data center division. That clears the 38% threshold by a wide margin, but that's not the only part of AMD's business. AMD also has a consumer hardware and embedded processor division, and each of those is expected to grow at a 10% CAGR over the next five years. That brings AMD's total CAGR to 35%, slightly less than the 38% needed.\nHowever, revenue growth isn't the only thing the market looks at. If AMD can achieve outsized profit growth as well, it may be able to surpass the 38% CAGR in profit growth. After all, AMD's margins are far slimmer than Nvidia's.\nIf AMD can improve its profit margin to the 15% to 20% range, that will double the profits it generates from its revenue, providing another growth lever. If AMD can improve its margins and grow at the expected growth rate, I do not doubt that the stock could return 5 times in five years. If it does this, AMD will be a top stock to buy and hold.\n\nShould you buy stock in Advanced Micro Devices right now? Before you buy stock in Advanced Micro Devices, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Advanced Micro Devices wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $504,994 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,156,218 !*\nNow, it’s worth noting Stock Advisor’s total average return is 986 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nKeithen Drury has positions in Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices and Nvidia. The Motley Fool has a disclosure policy .\nPrediction: This Artificial Intelligence (AI) Stock Could 5X by 2030 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 69
}