{
  "stock_id": "AMZN",
  "last_updated": "2025-12-18T16:13:35.344Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-18",
      "Time": "23:52:13",
      "Source": "Benzinga",
      "Title": "Charlie Munger Said, 'Find A Way To Get Your Hands On $100,000' Even If It Means Walking Everywhere — The Magic Number If You Want To Be Rich",
      "URL": "https://finance.yahoo.com/news/charlie-munger-said-way-hands-155213794.html",
      "Content": "Charlie Munger Said, 'Find A Way To Get Your Hands On $100,000' Even If It Means Walking Everywhere — The Magic Number If You Want To Be Rich\n\nJeannine Mancini\nThu, December 18, 2025 at 7:52 AM PST 4 min read\n\nIn this article: GOOG\n\nMETA\n\nAMZN\n\nBRK.A\n\nCharlie Munger didn't believe in shortcuts — but he did believe in thresholds. And if you ever asked how to get rich , he had a number ready: $100,000. Hit that, he said, and you'll have the momentum to keep going. Fail to hit it, and you'll spin your wheels forever.\nMunger, who died in 2023 just weeks shy of his 100th birthday, was best known as Warren Buffett's blunt, brilliant right hand — but he built a billion-dollar fortune of his own by focusing on what worked and ignoring what didn't.\n\nOne piece of wisdom that resonates with investors is his take on building wealth. In the late 1990s, during a shareholder meeting, Munger said, “The first $100,000 is a b****, but you gotta do it.”\nDon't Miss:\nThe AI Marketing Platform Backed by Insiders from Google, Meta, and Amazon — Invest at $0.85/Share\nAmericans With a Financial Plan Can 4X Their Wealth — Get Your Personalized Plan from a CFP Pro\nThis statement emphasizes the initial hurdle many face in accumulating savings. Munger’s bluntness highlights the challenge of reaching that critical first $100,000.\n“I don’t care what you have to do,\" he said. \"If it means walking everywhere and not eating anything that wasn’t purchased with a coupon, find a way to get your hands on $100,000.\"\n\nThe reason behind Munger’s focus on this initial amount? The power of compounding. Once you have that base, the path to greater wealth becomes smoother. With compounding returns, $100,000 can grow significantly over time, providing a strong foundation for long-term financial goals.\n“After that, you can ease off the gas a little bit,” he said.\nTrending: $100k+ in investable assets? Match with a fiduciary advisor for free to learn how you can maximize your retirement and save on taxes – no cost, no obligation.\nMunger made this statement in the mid-1990s, and when adjusted for inflation, $100,000 at the time is roughly equivalent to about $200,000 in 2025 dollars, based on U.S. consumer price index data. The number itself has shifted with time, but the idea behind it has not. The first meaningful pool of capital is still the hardest to assemble, and everything that follows depends on clearing that initial hurdle.\n\nThat belief stayed with Munger until the end of his life. In 2023, during one of his final long-form interviews discussed on the \" Acquired\" podcast, he summed up the payoff of that early grind in a single line: \"You only have to get rich once .\" The remark reflected a theme he returned to repeatedly over decades — build a durable financial base one time, and the rest of your decisions become less constrained.\n\nStory Continues\nThat perspective also helps explain why Munger's career did not begin with stocks. Before becoming Buffett's longtime partner at Berkshire Hathaway, Munger was a real estate attorney. He understood early on how property, cash flow, and patience could work together over long periods. Real estate was not a side note in his thinking. It was foundational.\n\nFor people trying to apply that lesson today, real estate remains one of the most common ways to build toward that first six-figure milestone. Rental income, equity growth, and long holding periods can create momentum that wages alone often struggle to provide. While not everyone can buy an entire property outright, access to real estate no longer requires that level of capital.\nSee Also: An EA Co-Founder Shapes This VC Backed Marketplace— Now You Can Invest in Gaming's Next Big Platform\nPlatforms like Arrived offer one example. Arrived allows investors to buy fractional shares of rental home s, giving them exposure to rental income and property appreciation without owning or managing a full property themselves. The best part? All you need is $100 to get started.\n\nFor people working toward their first $100,000, or its inflation-adjusted equivalent, steady real estate income can complement traditional saving and investing strategies.\nMunger never argued that the process was easy. He argued that it was worth it. The discipline required to build that first base — whether through work, saving, investing, or real estate — is the same discipline that keeps wealth intact later on. Once that base exists, compounding has room to operate, and the pressure to constantly scramble begins to fade.\nA financial adviser can help translate those principles into a plan that fits real life, weighing income, risk tolerance, time horizon, and how assets like stocks and real estate should work together. The goal is not to replicate Munger's fortune. It is to apply his logic: reach a solid foundation once, and let time do the rest.\n\nSome elements of this story were previously reported by Benzinga and it has been updated.\nRead Next: Buffett's Secret to Wealth? Private Real Estate— Get Institutional Access Yourself\nImage: Shutterstock\nUp Next: Transform your trading with Benzinga Edge's one-of-a-kind market trade ideas and tools. Click now to access unique insights that can set you ahead in today's competitive market.\nGet the latest stock analysis from Benzinga:\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Charlie Munger Said, 'Find A Way To Get Your Hands On $100,000' Even If It Means Walking Everywhere — The Magic Number If You Want To Be Rich originally appeared on Benzinga.com\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:50:26",
      "Source": "24/7 Wall St.",
      "Title": "OpenAI Could Start Using Amazon Chips. Time to Buy Amazon?",
      "URL": "https://finance.yahoo.com/m/662682fb-4f43-31a5-b44c-842665a8c227/openai-could-start-using.html",
      "Content": "OpenAI Could Start Using Amazon Chips. Time to Buy Amazon?\n\nJoey Frenette\nThu, December 18, 2025 at 7:50 AM PST 4 min read\n\nIn this article: AMZN\n\nQuick Read Amazon is in talks with OpenAI for a $10B investment and a deal for OpenAI to use Amazon’s Trainium chips.\nAmazon stock trades at 31.4x trailing P/E despite AI chip development and ties to Anthropic and potentially OpenAI.\nThe deal could reveal how Amazon’s custom Trainium chips compare to Google TPUs and Nvidia GPUs in real workloads.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:35:00",
      "Source": "Motley Fool",
      "Title": "3 Warren Buffett Stocks to Hold Forever",
      "URL": "https://finance.yahoo.com/m/3eaaa0a2-6db9-3faf-88be-3117e4313d8a/3-warren-buffett-stocks-to.html",
      "Content": "3 Warren Buffett Stocks to Hold Forever\n\nJames Brumley, The Motley Fool\nThu, December 18, 2025 at 7:35 AM PST 7 min read\n\nIn this article: BRK.A\n\nKO\n\nAMZN\n\nGOOG\n\nKey Points Beverage behemoth Coca-Cola is one of Berkshire Hathaway’s longest-held and biggest positions.\nYou know Amazon as an e-commerce powerhouse, but that’s not quite what makes it such a promising long-term prospect.\nGoogle’s parent Alphabet has proven it’s willing and able to successfully build or acquire businesses that expand its digital consumer-facing ecosystem.\n10 stocks we like better than Amazon ›\n\nThe end of an era is almost upon us. After 55 years at the helm, at the end of this year, Warren Buffett will be stepping down as Berkshire Hathaway 's (NYSE: BRK.A) (NYSE: BRK.B) CEO and chief stock-picker.\nAnd when he goes, many members of the investment community could find themselves at a loss. Although Berkshire isn't just a mutual fund, plenty of investors took Buffett's lead by copying Berkshire's trades; now the conglomerate's stock picks won't necessarily be Buffett-approved holdings. So, if you want to know for sure that you're following in his footsteps, you'd better act soon.\nTo this end, here's a rundown of three names currently in Berkshire Hathaway's portfolio that you not only know the Oracle of Omaha likes well enough to own them, but each of which could safely be bought and held forever.\n1. Coca-Cola Coca-Cola (NYSE: KO) isn't just one of Berkshire's longest-held positions at 19 years. It's also become the conglomerate's third-biggest holding, currently worth $28 billion. That's 10% of Berkshire's entire publicly traded portfolio.\nIt's not hard to see why Buffett's been such a long-term fan of the beverage giant, either. Not only is it the biggest and best-known name in the business, but it's a dividend machine! In addition to paying a dividend like clockwork for decades, The Coca-Cola Company has raised its per-share dividend payment for 63 consecutive years (and counting). This year, Berkshire's 400 million shares of KO will provide Buffett and his lieutenants with more than $200 million in cash. Never even mind the near-200% gain this stock's price alone has produced since Buffett first bought it back in late 2006.\n\nIt's also a great \"forever\" stock for two other reasons. One of these is simply that the world will always need something to drink. With brands like Gold Peak tea, Powerade sports drinks, Minute Maid juices, Dasani water, and, of course, its namesake cola, The Coca-Cola Company has something to offer everyone.\nAnd the other reason this name's got staying power worth buying into? Its sheer size (read \"deep pockets\") -- the drinks giant can afford to outspend its competitors. For perspective, Coca-Cola spent more than $5 billion on advertising last year alone.\n\nStory Continues\nNo, it may not be fair. Investors don't want a fair fight, however. They want the companies they own to have an unfair advantage over their competition.\n2. Amazon Yes, Berkshire Hathaway holds a stake in Amazon (NASDAQ: AMZN) . It's not a big stake, mind you -- just 10 million shares currently worth about $2.2 billion. That's less than 1% of the conglomerate's total stock holdings.\nStill, the fact that he's willing to let Berkshire hold any Amazon at all is noteworthy just because Buffett has typically eschewed such flashy technology stocks, explaining that he doesn't always fully understand their business models. And to be sure, the pick was likely encouraged by Todd Combs and/or Ted Weschler, who help oversee the conglomerate's equity holdings.\n\nThe pick also makes much more sense to Buffett now, however, than it would have several years ago.\nWhile Amazon may have been something of an unknown in its infancy (when the internet itself was still young and evolving, and when Buffett was forming his previous opinion on most technology stocks), even he would have to agree that uncertainty no longer applies. E-commerce is clearly here to stay, and Amazon clearly leads at least the U.S. e-commerce market; it isn't doing too badly overseas either. All told, despite its already-massive size, this company's product sales are up more than 8% through the first three quarters of this year. This growth rate accelerated last quarter, too, despite the lethargic economy here and abroad.\nAmazon isn't just e-commerce anymore, either. Although it only accounts for a minority of its revenue, its cloud computing arm, Amazon Web Services, contributes roughly 60% of the company's total operating income. And the cloud computing industry is here to stay as well. Indeed, Straits Research expects the worldwide cloud computing industry to grow from less than $1 trillion this year to nearly $3.7 trillion per year by 2033.\n\nWhat makes this name such a great forever holding, however, is that -- not unlike Berkshire Hathaway itself -- Amazon has proven that it's willing and able to adapt to an ever-changing marketplace of opportunities.\n3. Alphabet Finally, add Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) to your list of Warren Buffett stocks to buy and hold forever for yourself.\nThere are actually several clear parallels between Berkshire's positions in Amazon and Alphabet. Both are holdings that wouldn't have likely even been considered as potential picks a few years ago, for instance, yet both businesses have clearly solidified in the meantime. Both companies are also flexible; Amazon added cloud computing to its repertoire several years ago and is now turning its online shopping platform into an advertising medium, while Alphabet has moved well beyond its Google search engine with profit centers like YouTube and its own cloud computing service. Berkshire doesn't exactly have a huge stake in either outfit, only holding 17.8 million shares currently worth about $5.5 billion. That's less than 2% of the conglomerate's total stock holdings.\n\nIt's also a pretty safe bet that this position is the result of prodding from Todd Combs or Ted Weschler.\nWhatever the case, Buffett's pseudo-endorsement of Alphabet serves as a green light of sorts for you, plugging you into the company that still handles 90% of the world's web searches (according to Statcounter).\nThat's not the chief reason Alphabet is such a great long-term bet, though. The biggest and best bullish argument here is a more philosophical one. That's Alphabet's willingness and ability to build or buy a business, anything that allows it to expand its digital ecosystem.\nYouTube is one example; Google acquired it back in 2006. Alphabet's chat-based artificial intelligence platform Gemini is another example, as is 2004's launch of Gmail and 2005's acquisition of mobile operating system Android, which Statcounter says is installed on 72% of the world's mobile devices.\n\nMeanwhile, Alphabet's \"Other Bets\" arm is home to developing self-driving taxi service Waymo and life-science outfit Verily.\nSome of these projects pan out. Others don't. There's a reason, however, that Alphabet has only failed to produce year-over-year quarterly revenue growth once in the past 10 years. That's the beginning of the COVID-19 pandemic in early 2020 -- and that was a short-lived headwind. Its profit growth has been almost as persistent. There's no end in sight to this growth streak, either. There's just too much worldwide dependence on Alphabet's offerings.\nShould you invest $1,000 in Amazon right now? Before you buy stock in Amazon, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Amazon wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $511,196 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,047,897 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 954 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nJames Brumley has positions in Alphabet and Coca-Cola. The Motley Fool has positions in and recommends Alphabet, Amazon, and Berkshire Hathaway. The Motley Fool has a disclosure policy .\n3 Warren Buffett Stocks to Hold Forever was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:28:01",
      "Source": "MT Newswires",
      "Title": "United Rentals Scales AI Tool With Amazon Web Services",
      "URL": "https://finance.yahoo.com/news/united-rentals-scales-ai-tool-152801817.html",
      "Content": "PREMIUM\nUnited Rentals Scales AI Tool With Amazon Web Services\n\nMT Newswires\nThu, December 18, 2025 at 7:28 AM PST\n\nIn this article: URI\n\nAMZN\n\nAmazon (AMZN) Web Services has collaborated with United Rentals (URI) to scale the enterprise-wide a\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:24:16",
      "Source": "Motley Fool",
      "Title": "Virtu Financial Loads Up NuScale Power Stock After Its Big Price Drop. Should You Too?",
      "URL": "https://finance.yahoo.com/m/c292f2d4-995d-3396-bdc5-7aaa2317f98c/virtu-financial-loads-up.html",
      "Content": "Virtu Financial Loads Up NuScale Power Stock After Its Big Price Drop. Should You Too?\n\nNeha Chamaria, The Motley Fool\nThu, December 18, 2025 at 7:24 AM PST 4 min read\n\nIn this article: VIRT\n\nSMR\n\nAMZN\n\nUNH\n\nKey Points Virtu Financial bought 579,353 shares of NuScale Power valued at nearly $21 million.\nThe new stake represents 1.16% of 13F reportable assets under management.\nThis is Virtu Financial's first SMR purchase, signaling its bullishness on the stock.\nThese 10 stocks could mint the next wave of millionaires ›\n\nWhat happened According to a filing with the Securities and Exchange Commission dated Nov. 14, 2025, Virtu Financial LLC established a new position in NuScale Power (NYSE:SMR) . The fund reported holding 579,353 shares valued at $20.86 million at the end of the third quarter, representing its first disclosed stake in the company for the period ending Sept. 30, 2025.\n\nWhat else to know This new position in SMR represents 1.16% of Virtu Financial LLC’s $1.79 billion in reportable U.S. equity assets.\nTop holdings after the filing:\nNYSE: BRK-A : $224.00 million (12.5% of AUM)\nNASDAQ: AMZN : $42.50 million (2.4% of AUM)\nNYSE: UNH : $38.63 million (2.2% of AUM)\nNASDAQ: LLYVA : $33.61 million (1.9% of AUM)\nNASDAQ: FOX : $32.42 million (1.8% of AUM)\nAs of Nov. 14, 2025, shares of NuScale Power were priced at $22.45, down 9% over the past year, underperforming the S&P 500 by 22.6 percentage points. Shares have fallen further by nearly 30% since.\n\nCompany Overview Metric\nValue\nPrice (as of market close 11/14/25)\n$22.45\nMarket Capitalization\n$6.69 billion\nRevenue (TTM)\n$63.90 million\nNet Income (TTM)\n$-379.94 million\n\nCompany Snapshot NuScale Power is developing modular, light-water reactor nuclear power plants called VOYGR built on NuScale Power Modules. Each module can generate 77 megawatts of electricity, scalable up to 924 megawatt electric capacity.\nThe company generates revenue by designing, developing, and selling modular nuclear reactors and related energy solutions for electricity generation and industrial applications.\n\nNuScale Power develops and sells modular nuclear energy technology, offering scalable reactor solutions designed for electricity generation, district heating, and process heat applications.\nFoolish take It's been a wild ride for NuScale Power stock so far in 2025. Nuclear energy stocks surged after President Donald Trump signed executive orders in the middle of the year, outlining ambitious plans to boost the nuclear energy industry. Plans include support for SMRs, which is also NuScale's specialization.\n\nAlthough NuScale Power is still developing modules, it has an exclusive commercial partnership with ENTRA1 Energy. With ENTRA1 Energy recently securing some contracts, including a contract to deploy up to six gigawatts of nuclear power capacity to the Tennessee Valley Authority across seven states in the U.S., NuScale Power is already locking in some sales.\n\nStory Continues\nNuScale stock, however, has come under selling pressure in recent weeks, mainly on profit-booking across the board. NuScale's large shareholder, Fluor (NYSE:FLR) is also selling its stake in the nuclear energy company to cash in on its investment. That has also contributed to NuScale Power's stock fall. Investors like Virtu Financial, however, saw an opportunity in the dip to buy shares of a company building SMRs amid Trump's aggressive push for nuclear energy.\n\nGlossary 13F reportable assets: Assets that institutional investment managers must disclose quarterly to the SEC, showing their equity holdings.\nAUM (Assets Under Management): The total market value of investments managed by a fund or financial institution.\nPosition: The amount of a particular security or asset held by an investor or fund.\nStake: The ownership interest or share held in a company by an investor or fund.\nQuarterly average pricing: The average price of a security over a specific quarter, used for valuation purposes.\nModular light water reactor: A type of nuclear reactor designed in small, standardized units using ordinary water as coolant and moderator.\nMegawatt: A unit of power equal to one million watts, commonly used to measure electricity generation capacity.\nProcess heat: Heat energy produced for industrial or commercial processes, not just electricity generation.\nVOYGR plant configurations: NuScale's branded modular nuclear power plant setups, offering scalable electricity generation solutions.\nTTM: The 12-month period ending with the most recent quarterly report.\n\nDon’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $443,371 !*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $51,715 !*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $511,196 !*\nRight now, we’re issuing “Double Down” alerts for three incredible companies , available when you join Stock Advisor , and there may not be another chance like this anytime soon.\nSee the 3 stocks »\n*Stock Advisor returns as of December 15, 2025\nNeha Chamaria has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon. The Motley Fool recommends NuScale Power and UnitedHealth Group. The Motley Fool has a disclosure policy .\nVirtu Financial Loads Up NuScale Power Stock After Its Big Price Drop. Should You Too? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:18:07",
      "Source": "MT Newswires",
      "Title": "Amazon Expands Business Prime Benefits With Intuit, CrowdStrike Collaboration",
      "URL": "https://finance.yahoo.com/news/amazon-expands-business-prime-benefits-151807425.html",
      "Content": "PREMIUM\nAmazon Expands Business Prime Benefits With Intuit, CrowdStrike Collaboration\n\nMT Newswires\nThu, December 18, 2025 at 7:18 AM PST 1 min read\n\nIn this article: INTU\n\nAMZN\n\nCRWD\n\nAmazon.com (AMZN) said Thursday it has added new Business Prime benefits through partnerships with I\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:00:00",
      "Source": "GlobeNewswire",
      "Title": "U.S. Men’s Denim 2026 Outlook: Fit wins attention, but sizing trust decides loyalty",
      "URL": "https://finance.yahoo.com/news/u-men-denim-2026-outlook-150000325.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nU.S. Men’s Denim 2026 Outlook: Fit wins attention, but sizing trust decides loyalty\n\nClootrack\nThu, December 18, 2025 at 7:00 AM PST 5 min read\n\nIn this article: AMZN\n\nTGT\n\nM\n\nWhy are customers switching men’s denim brands—even when prices and styles look similar? In this video, we break down key findings from Clootrack’s 2026 U.S. Men’s Denim Brand Switching Study, based on Voice-of-Customer (VoC) analysis of 55,287 customer reviews and discussions across major retailers and brand channels.\n\nNEW YORK, Dec. 18, 2025 (GLOBE NEWSWIRE) -- Based on a new Voice of the Customer (VoC) analysis of 55,287 U.S. men’s denim reviews and discussions across Amazon, Target, Walmart, Macy’s and official brand stores (Q4 2022 - Q4 2025), the category appears to be settling around a familiar trio - fit, style and comfort - while loyalty is increasingly decided by something less glamorous: predictability . As brands plan 2026 assortments amid higher return sensitivity and “not as described” frustration, the strongest signal is clear: shoppers reward brands that reduce risk at the moment of purchase.\n\nThe study, conducted by Clootrack , introduces a directional switching momentum view called Net Flux (incoming minus outgoing brand switches expressed in customer language). Net Flux indicates directional movement in preference, not audited sales or market share. In the dataset, American Eagle, Gap and Old Navy showed the strongest net gains.\nFour signals that matter heading into 2026\nFigure 1: U.S. Men’s Denim VoC Theme Map (Category-Level).\nIn figure 1, the bubble chart shows the category’s key experience themes by positivity (%) and volume of opinions .\nClootrack applies a four-level unsupervised theme hierarchy to drill from broad drivers to specific, actionable fixes.\n1) Fit is the top driver - but loyalty is won by predictability.\nFit leads the category conversation (~ 21.8% share) with strong positivity (~ 80.7% ). Customers describe “good fit” in precise terms: leg silhouette control, thigh/seat room, reliable waist fit, more rise/inseam options, and stretch that flexes without losing shape.\n\n2) The loyalty breaker is sizing predictability (not comfort).\nSizing sentiment is low (~ 43.6% positive) and waist fit is similarly low (~ 42.7% ) with growing attention. Shoppers consistently cite the same risk factors: variation across washes/colors, measurement guides that don’t match delivered product, and inconsistent online sizing. In practice, this shows up as churn and returns when shoppers can’t trust what will arrive.\n3) “Trust triggers” are emerging right before checkout.\nTwo smaller themes show outsized impact because they introduce doubt at purchase:\nOdor & Chemical Safety: doubled in prevalence ( +100% ) with very low fulfillment ( 1.19/5 ).\nSustainability & Ethical Considerations: up 150% with low fulfillment ( 2.47/5 ).\nThese signals behave like multipliers when handled credibly — and like trust destroyers when they’re vague or inconsistent.\n\nStory Continues\n4) Product information accuracy is now a measurable performance lever.\nCustomers repeatedly flag mismatches and confusion in key product details (including closure type), alongside function/QC issues. “Truth-in-spec” is increasingly tied to conversion confidence and “not as described” returns.\nSwitching momentum: where preference is moving\n\nUsing Net Flux, Clootrack found American Eagle, Gap and Old Navy gained the most net switchers in the dataset. For Gap specifically, inbound switching was driven by reasons customers cite directly: Fit (41%) , Price (26%) , and Quality (~20%) .\n“What’s different here is connecting switching momentum to the fixable drivers customers explicitly cite - not just what they complain about,” said Shameel Abdulla, CEO of Clootrack.\nFigure 2: Net Flux snapshot\nInflux vs. outflux switching mentions by brand.\nWhat this means for brands\nThe data points to three priorities for 2026 planning:\nMake sizing predictability the loyalty lever.\nMove beyond “fit” as a brand promise and focus on reducing shopper risk - consistency across washes and colors, and measurement guidance that reliably matches what arrives.\nMake durability visible, not implied.\nShoppers increasingly judge denim by concrete failure points (seams, pockets, crotch reinforcement, wash durability). Strengthen those stress areas and communicate durability with a small set of clear, comparable cues.\nTreat “trust cues” as part of the product experience.\nAs odor/chemical concerns and sustainability expectations rise, credibility matters. Tighten claims, clarify product specs on PDP, and remove ambiguity that drives “not as described” frustration and returns.\n\nMethodology at a glance\nDataset: 55,287 U.S. men’s denim reviews and discussions (Q4 2022 - Q4 2025) across major retailers and official brand stores; six leading denim brands in scope.\nPositivity (%): share of positive opinions within a theme.\nFulfillment score (1 - 5): how effectively brands meet the underlying job to be done.\nNet Flux: incoming minus outgoing switches expressed in reviews/discussions; a directional indicator, not audited sales or market share.\nReport availability: Full theme hierarchy, verbatims, and drill-down cuts (persona, price tier, fit type) available on request.\nAbout Clootrack\nClootrack is an AI-powered Voice of the Customer analytics platform with AI Super Agents that help enterprises convert fragmented customer feedback into actions tied to business KPIs such as NPS, churn, returns, revenue, and operational efficiency. Using patented unsupervised thematic analysis, Clootrack analyzes 100% of structured and unstructured VoC data across first- and third-party sources. Insights are delivered through explainable AI Decision Briefs that clearly show what is happening, why it is happening, and what teams should do next, with 98% overall analysis accuracy.\n\nCorporate Communication\nClootrack Software Labs Inc\n+1 302-204-1872\n‍ pr@clootrack.com ‍\n‍Visit us on social media:‍\n‍ LinkedIn\n‍ ‍ Facebook\n‍ ‍ YouTube\n‍ ‍ X\nPhotos accompanying this announcement are available at:\nhttps://www.globenewswire.com/NewsRoom/AttachmentNg/d3339211-d769-4ccb-8756-9b2ae00364ad\nhttps://www.globenewswire.com/NewsRoom/AttachmentNg/8f11b5d1-d683-4dcf-9c61-772ab2e26fe6\nhttps://www.globenewswire.com/NewsRoom/AttachmentNg/0fd88d07-d2cc-4a2f-a5ae-a421bd1f4063\nA video accompanying this announcement is available at: https://www.globenewswire.com/NewsRoom/AttachmentNg/f072f588-2e88-4d5a-b51e-570a03704c2d\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:00:00",
      "Source": "Business Wire",
      "Title": "Amazon Business Prime Offers Small and Midsize Businesses Even More Value with New Benefits from Intuit QuickBooks, CrowdStrike, and Gusto",
      "URL": "https://finance.yahoo.com/news/amazon-business-prime-offers-small-140000389.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nAmazon Business Prime Offers Small and Midsize Businesses Even More Value with New Benefits from Intuit QuickBooks, CrowdStrike, and Gusto\n\nBusiness Wire\nThu, December 18, 2025 at 6:00 AM PST 6 min read\n\nIn this article: INTU\n\nAMZN\n\nBusiness Prime customers have access to exclusive benefits with Intuit QuickBooks, CrowdStrike, and Gusto to support their financial management, cybersecurity, and Human Resources needs\nExpanded benefits can help SMBs save nearly $1,000 per year, streamline operations, and simplify business buying\nSavings build on Business Prime’s value, joining member benefits like fast, free shipping, Spend Visibility, Guided Buying, and flexible payment options\n\nSEATTLE, December 18, 2025 --( BUSINESS WIRE )--Today Amazon (NASDAQ: AMZN) announced that Amazon Business has added even more value to the Business Prime membership program with benefits from Intuit QuickBooks, CrowdStrike, and Gusto that help small and midsize business customers save time and money. Amazon Business tailors the best of Amazon—everyday low prices, vast selection, and a convenient shopping and delivery experience—alongside a diverse supplier network, a reliable global logistics system, adaptable workflow features, and intelligent automation tools to meet the needs of organizations of all sizes, including hundreds of thousands of small businesses worldwide.\nThe Business Prime membership enhances this value proposition by offering organizations even more benefits, including access to fast, free shipping on millions of items, along with powerful analytics and spending controls that optimize the management of decentralized purchasing.\n\nWith three new collaborations offering benefits in financial management, cybersecurity, and HR, Business Prime has never been more valuable for members.\n\"Small business owners wear a lot of hats — accountant, HR manager, IT lead — sometimes all before lunch,\" said Todd Heimes, VP at Amazon Business. \"We’re thrilled to introduce new Business Prime benefits that help them work smarter, save money, and get back to what they love most — running their business.\"\nSimplify Finances with Intuit QuickBooks\nQuickBooks brings industry-leading financial management tools to Business Prime members at a fraction of the cost, which includes a direct integration that enables small business customers to seamlessly automate purchase reconciliation and categorization. Coming in 2026, this benefit gives Business Prime members access to QuickBooks Online Simple Start for just $180 per year — a 60% discount off the regular $456 MSRP.\n\nWith QuickBooks, millions of small businesses manage their finances end-to-end including automating payments, getting paid faster, paying employees, and seamlessly reconciling their books. This benefit is best suited for small businesses that want to simplify business operations, gain visibility into cash flow, and streamline financial management. It’s available to Business Prime members in the U.S. who are new QuickBooks Online subscribers and maintain an active Business Prime Essentials subscription.\n\nStory Continues\nBusiness Prime members can redeem this exclusive offer through their Business Prime benefits page and complete a simple activation process on Intuit’s website. Once enrolled, members can manage their business while continuing to enjoy their discounted rate for the duration of the promotion period.\nProtect Your Business with Free Enterprise-Grade Cybersecurity\n\nBusiness Prime members on the Essentials plan and above now receive access to CrowdStrike Falcon Go at no additional cost — bringing the power of the industry’s leading cybersecurity platform to small and midsize businesses. Falcon Go delivers AI-native protection designed to stop breaches, providing world-class prevention against ransomware, malware, and modern cyberattacks for organizations that often lack dedicated security teams.\nFalcon Go delivers the same industry-leading speed, efficacy, and AI-powered detection that protect the world’s largest enterprises. This benefit, valued at $59 per device annually, removes financial and operational barriers by giving SMBs effortless access to enterprise-grade protection through the Amazon Business Prime membership.\n\nThe offer is available to Business Prime members in the U.S. who do not already have a CrowdStrike account and maintain an active Business Prime account. Business Prime Duo members receive 50% off the standard Falcon Go rate. Members can activate their cybersecurity benefit directly through their Business Prime benefits page and complete a quick setup experience on CrowdStrike’s website. Once enabled, Falcon Go immediately provides AI-powered protection that helps businesses defend against evolving threats and keep operations running securely.\nStreamline HR and Payroll with Gusto\nBusiness Prime members in the U.S. also now receive 70% off their first 12 months of Gusto’s comprehensive payroll and HR platform. Available immediately, this benefit gives members access to Gusto’s all-in-one system for hiring, onboarding, payroll, and benefits administration — helping business owners save time, stay compliant with company policies, and reduce manual work. Trusted by more than 400,000 businesses nationwide, Gusto is best suited for small businesses looking to automate payroll, simplify HR management, and drive compliance with federal and state regulations. The offer is available to members without an existing Gusto account and requires an active Business Prime membership to qualify.\n\nMembers can redeem this offer through their Business Prime benefits page and complete the activation process on Gusto’s website. Once enrolled, members gain access to automated payroll runs, built-in tax filing, and benefits management tools that help save hours each week and allow them to focus more on growing their business. After the 12-month promotional period, standard pricing applies.\nWhen Prime Means Business\nWith yearly savings of nearly $1,000, fast delivery speeds, and significant membership engagement, Business Prime continues to demonstrate its value as an essential tool for business customers worldwide. Business Prime members also have access to enhanced shipping benefits including Amazon Day, which consolidates eligible deliveries to a single day each week. Last year, Business Prime members saved more than $750 million globally in shipping fees, and nearly 50% of global orders and over 70% of U.S. Business Prime orders arrived the same day or next day in the last year.\n\nSmall business customers in the U.S. can take advantage of additional savings opportunities through Business Prime Rewards which offers up to 4% back on brands by Amazon. Customers can also enjoy savings from the Amazon Business Prime American Express Card and Prime-exclusive deals.\nFrom Solopreneurs to Fortune 500: Amazon Business Provides Value, Selection, and Convenience\nSince launching in the U.S. in 2015, Amazon Business has empowered businesses of all sizes through unmatched selection, deep discounts, and smart capabilities. Today, Amazon Business continues to be a priority for the company, driving over $35 billion in annualized gross sales, with strong adoption and positive feedback from customers. Amazon Business actively serves more than eight million organizations globally, excluding emerging geographies. Procurement and business leaders benefit from convenient shipping options on hundreds of millions of supplies across categories like office, IT, janitorial, and food service, along with business-tailored features including a curated site experience, Business Prime, business-only pricing and selection, single- or multi-user business accounts, approval workflows, purchasing system integrations, payment solutions, tax exemptions, and dedicated customer support.\n\nWorking closely with customers to understand their business buying challenges, Amazon Business continues to develop new technologies that make it easy for organizations and administrators to define, meet, and proactively measure progress toward their purchasing budgets and goals. Amazon Business is now a strategic partner to businesses in 11 countries including Australia, Canada, France, Germany, India, Italy, Japan, Mexico, Spain, the United Kingdom, and the United States.\nVisit the Amazon Business website to learn more.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251218043163/en/\nContacts\nAmazon.com, Inc.\nMedia Hotline\nAmazon-pr@amazon.com\nwww.amazon.com/pr\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:30:04",
      "Source": "24/7 Wall St.",
      "Title": "Microsoft (NASDAQ: MSFT) Stock Price Prediction for 2025: Where Will It Be in 1 Year",
      "URL": "https://finance.yahoo.com/m/fde91597-c2ad-3dbf-a423-4d0acc661d47/microsoft-%28nasdaq%3A-msft%29.html",
      "Content": "Microsoft (NASDAQ: MSFT) Stock Price Prediction for 2025: Where Will It Be in 1 Year\n\nJoel South\nThu, December 18, 2025 at 5:30 AM PST 5 min read\n\nIn this article: AMZN\n\nORCL\n\nMSFT\n\nKey Points in This Article: Microsoft is dedicating significant capex to AI and cloud infrastructure in order to compete with other tech firms.\nMicrosoft’s gaming segment grew 44% last year, providing significant revenue to complement its software, cloud and AI business lines.\nIf you’re thinking about retiring or know someone who is, there are three quick questions causing many Americans to realize they can retire earlier than expected. take 5 minutes to learn more here\n\nShares of Microsoft ( NASDAQ:MSFT ) lost 0.03% over the past five trading sessions after losing 0.27% the five prior. That brings MSFT's year-to-date gain to 13.75%, including a more than 3r4% gain since its year-to-date low on April 8.\nWhen the Magnificent Seven member reported FY 2026 Q1 earnings on Oct. 29, shares fell despite beating on EPS and revenue. The company announced earnings of $3.72 per share versus analysts' expectations of $3.67, and quarterly revenue of $77.67 billion versus analysts' expectations of $75.33 billion.\nOn Oct. 1, the company announced that it was increasing its Xbox Game Pass subscription by 50%. In its last fiscal year, Microsoft saw more than 8% of revenue derived from its gaming segment, which now boasts 50 million monthly active subscribers and nearly $5 billion in YoY revenue.\n\nMicrosoft's decision in May fire 6,000 employees — or 3% of its workforce — signals the tech giant is serious about cost discipline amid economic uncertainty. With analysts eyeing sustained cloud demand, 24/7 Wall St. conducted analysis to explore whether Microsoft can maintain its upward trajectory and drive long-term growth.\nWhy Invest in Microsoft Microsoft navigates challenges, but remains a prime investment due to its AI and cloud dominance. Third-quarter earnings showcased robust demand for its Intelligent Cloud segment, though tariff risks linger. Microsoft’s $80 billion cash reserve fuels its $80 billion investments in cloud and AI infrastructure, with over half in the U.S.\n\nIts Microsoft 365 Copilot, adopted by over 70% of Fortune 500 firms, drives productivity revenue, positioning Microsoft to capture the AI market’s 37% compounded annual growth predicted through 2030. Similarly, partnerships with Oracle ( NYSE:ORCL ) for multi-cloud solutions bolster its competitiveness against Amazon 's ( NASDAQ:AMZN ) AWS.\nIn June, it was reported that the company will be expanding its AI and cloud investments in Switzerland, committing $400 million to expand its data center infrastructure in the European nation. The additional capacity is expected to support more than 50,000 current customers and expand the availability of AI services for more sectors, including health care, finance government. Microsoft is capitalizing on its Azure platform’s momentum as revenue jumped 39% in FY25 Q4, driven by AI services.\n\nStory Continues\nWhen Microsoft last reported earnings, EPS beat by 7.40% and revenue beat by 2.37%. The EPS beat marked the 15th time in the past 16 quarters that the company surpassed estimates, with EPS coming in at $3.46 versus the consensus forecast of $3.20.\nMicrosoft (MSFT) As a Company Microsoft reported a gross profit of $49.8 billion, up 14% year-over-year, with gross margins at 68%, driven by strong cloud and AI demand. The company committed to continuing spending on capital expenditures, focusing on AI data center expansion to meet enterprise needs. Analysts expect the company's capex to remain elevated to support Microsoft’s cloud infrastructure growth.\n\nTariff uncertainties do pose risks, even with the pause on China, as supply chain cost pressures for server hardware are not eliminated. Microsoft’s operating income of $32 billion was tempered by a 5% rise in operating expenses, reflecting heavy AI R&D investments. Despite no revenue from its $13 billion OpenAI stake, Microsoft reported $42.4 billion in Microsoft Cloud revenue, up 20% year-over-year.\nBeyond cloud, Microsoft’s gaming segment grew 44% with 43 points of the gain coming from its acquisition of Activision, but bolstered by Xbox content and Bethesda’s Starfield expansion. A partnership with Oracle for multicloud solutions strengthens its enterprise offerings, further diversifying its revenue. Wall Street projects Q4 revenue of $73.8 billion, up 14%, driven by Microsoft's AI and cloud momentum.\n\nMicrosoft As a Stock Broadly, 34 Wall Street analysts' remain bullish, with 32 analysts covering MSFT assigning it a \"Buy\" rating, two assigning it a \"Hold\" rating and none assigning it a \"Sell\" rating. Overall, the stock receives a consensus \"Strong Buy\" rating. Wall Street's price targets cover a significant range, spanning $500 per share on the low end to $700 per share on the high end. The median one-year price target for MSFT is $632.22, which represents 32.78% potential upside from today's share price.\nInstitutional ownership currently stands at 73.74%, with three of the four largest buy-side firms — Vanguard, BlackRock and State Street — holding a collective 1.570 billion shares of Microsoft.\nEstimate\nPrice Target\n%Change From Current Price\nLow\n$500\n5.01%\nMedian\n$632.22\n32.17%\nHigh\n$700\n47.02%\n\nMicrosoft (MSFT) Stock Prediction in 2025 Microsoft’s strong Azure revenue growth positions it for cloud and AI market gains. However, $20 billion quarterly capex and tariff risks require caution. Its $80 billion cash reserve and Oracle partnership offer stability, making MSFT stock a buy for growth investors, even as valuation concerns linger.\n\n24/7 Wall St. ’s year-end price target for Microsoft is $563.64, implying upside potential of 18.38% from the stock's current price. This cautious target reflects Azure’s strength and FY26 Q1 revenue guidance, balanced against the need for higher capex spending and potential supply chain disruptions, positioning it at a realistic estimate of its leading presence in the space.\nData Shows One Habit Doubles American’s Savings And Boosts Retirement Most Americans drastically underestimate how much they need to retire and overestimate how prepared they are. But data shows that people with one habit have more than double the savings of those who don’t.\nAnd no, it’s got nothing to do with increasing your income, savings, clipping coupons, or even cutting back on your lifestyle. It’s much more straightforward (and powerful) than any of that. Frankly, it’s shocking more people don’t adopt the habit given how easy it is .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:06:00",
      "Source": "Barrons.com",
      "Title": "FedEx’s Earnings Are Today. Expect Signals About Holiday Demand.",
      "URL": "https://finance.yahoo.com/m/60f70f41-b814-3d94-962a-c120bd7eede9/fedex%E2%80%99s-earnings-are-today..html",
      "Content": "FedEx’s Earnings Are Today. Expect Signals About Holiday Demand.\n\nAl Root\nThu, December 18, 2025 at 5:06 AM PST 3 min read\n\nIn this article: FDX\n\n^GSPC\n\n^DJI\n\nUPS\n\nAMZN\n\nA lot is going on at FedEx which raises the stakes for its second-quarter results, due out after the close of trading on Thursday. Investors will be looking for updates on cost reductions, the spinoff of its less-than-truckload freight business, the health of the U.S. consumer, and the impact of tariffs on the global economy. For the fiscal second quarter, the consensus call on Wall Street is that adjusted earnings per share will land at $4.12, from $22.8 billion in sales.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:00:00",
      "Source": "PR Newswire",
      "Title": "Data Center Capex Up 59 Percent on Continued AI Investment in 3Q 2025, According to Dell'Oro Group",
      "URL": "https://finance.yahoo.com/news/data-center-capex-59-percent-130000640.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nData Center Capex Up 59 Percent on Continued AI Investment in 3Q 2025, According to Dell'Oro Group\n\nPR Newswire\nThu, December 18, 2025 at 5:00 AM PST 3 min read\n\nIn this article: AMZN\n\nGOOG\n\nORCL\n\nMETA\n\nMSFT\n\nAccelerated Server Demand and Hyperscale Cloud expansion Drive Broad-based Infrastructure Spending\nREDWOOD CITY, Calif. , Dec. 18, 2025 /PRNewswire/ -- According to a recently published report by Dell'Oro Group, the trusted source for market information about the telecommunications, security, networks, and data center industries, worldwide data center capital expenditures increased 59 percent year-over-year, marking the eighth consecutive quarter of double-digit growth as the AI investment cycle continues to broaden beyond early, training-focused deployments.\n\"The Top 4 US cloud service providers—Amazon, Google, Meta, and Microsoft—continue to raise data center capex expectations for 2025, supported by increased investments in both AI and general-purpose infrastructure. Oracle is also on track to double its data center capex this year as it expands capacity for the Stargate project,\" said Baron Fung, Senior Research Director at Dell'Oro Group. \"What is notable this cycle is not just the pace of spending, but the expanding scope of investment, as cloud providers simultaneously scale accelerated compute, general-purpose servers, and the supporting infrastructure required to deploy AI at production scale. Accelerated server spending surged in the quarter, driven by the ramp of NVIDIA Blackwell Ultra, along with custom accelerator platforms across US hyperscalers, neo cloud providers, and sovereign AI deployments. At the same time, cloud service providers are increasing emphasis on greater capex discipline by optimizing asset depreciation and lifecycles to ensure healthy cash flow,\" explained Fung.\n\nAdditional highlights from the 3Q 2025 Data Center IT Capex Quarterly Report:\nThe global data center capex growth outlook was raised through 2026, reflecting sustained hyperscale investment and continued prioritization of AI infrastructure.\nDemand for general-purpose servers strengthened as cloud providers expanded compute and storage capacity to support growing cloud services and inference-heavy AI workloads.\nDell led all server OEMs in revenue, followed by HPE and Lenovo, gaining share on strong NVIDIA Blackwell shipments and a refreshed x86 portfolio, while white-box vendors captured the majority of server shipments, supported by hyperscale AI deployments and elevated general-purpose server demand.\nAbout the Report\nDell'Oro Group's Data Center IT Capex Quarterly Report details the data center infrastructure capital expenditures of each of the ten largest Cloud service providers, as well as the Rest-of-Cloud, Telco, and Enterprise customer segments. Allocation of the data center infrastructure capex for general-purpose and accelerated servers, storage systems, and other auxiliary data center equipment is provided. The report also discusses market trends, drivers of the leading Cloud service providers' capex growth during the quarter, and the outlook for the next year. To purchase this report, please contact us at dgsales@delloro.com.\n\nStory Continues\nAbout Dell'Oro Group\nDell'Oro Group is a market research firm that specializes in strategic competitive analysis in the telecommunications, security, enterprise networks infrastructure, and data center markets. Our firm provides in-depth quantitative data and qualitative analysis to facilitate critical, fact-based business decisions. For more information, contact Dell'Oro Group at +1.650.622.9400 or visit www.delloro.com .\nView original content to download multimedia: https://www.prnewswire.com/news-releases/data-center-capex-up-59-percent-on-continued-ai-investment-in-3q-2025-according-to-delloro-group-302642624.html\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:46:31",
      "Source": "Investor's Business Daily",
      "Title": "Data Centers Are Booming. So Is A Backlash Over Electricity Rates.",
      "URL": "https://finance.yahoo.com/m/21efdd73-59b7-33fc-8e84-fd1b3ad8eb99/data-centers-are-booming.-so.html",
      "Content": "Data Centers Are Booming. So Is A Backlash Over Electricity Rates.\n\nALEXIS GARCIA and KIT NORTON\nThu, December 18, 2025 at 4:46 AM PST 16 min read\n\nIn this article: AMZN\n\nMSFT\n\nGOOG\n\nMETA\n\nORCL\n\nThe data centers critical to the nation's AI ambitions are spawning local political battles as rising energy costs frustrate communities. What investors need to know about data center NIMBYism.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:37:28",
      "Source": "Simply Wall St.",
      "Title": "E-Commerce Today - Akamai and Visa Team Up for Secure AI-Driven Commerce",
      "URL": "https://finance.yahoo.com/news/e-commerce-today-akamai-visa-123728337.html",
      "Content": "E-Commerce Today - Akamai and Visa Team Up for Secure AI-Driven Commerce\n\nSimply Wall St\nThu, December 18, 2025 at 4:37 AM PST 2 min read\n\nIn this article: AKAM\n\nBABA\n\nBABAF\n\nAMZN\n\nADBE\n\nAkamai Technologies, Inc. and Visa Inc. have announced a strategic collaboration designed to enhance security in the emerging field of agentic commerce. By integrating Visa’s Trusted Agent Protocol with Akamai’s edge-based behavioral intelligence, the partnership aims to provide robust identity and fraud controls necessary for merchants to trust AI agents that shop on behalf of consumers. This development addresses challenges such as authenticating AI agents, identifying the users they represent, and ensuring secure interactions, which are crucial as AI-driven commerce activity increases. The collaboration is set to help merchants safely navigate this new landscape by distinguishing legitimate AI activity from malicious bots, promoting a secure expansion into agentic commerce.\n\nVisa last closed at $344.41 down 0.2%.\nIn other market news, Microalliance Group was trading firmly up 248.3% and ending the day at $1.78, a new 52-week high. In the meantime, Rezolve AI lagged, down 19.2% to end trading at $2.40. This week, the company provided December earnings guidance, anticipating the strongest month in its history with revenue expected to exceed $17 million despite a GAAP net loss.\nVisa's strategic shift towards higher-margin offerings amid digital growth demands attention now. Click through to explore this compelling narrative on Visa's evolving business model.\nDon't miss our Market Insights article titled \"Circular Deals and Soaring Valuations,\" offering crucial insights into Walmart's innovative AI e-commerce strategy. Read it now!\n\nBest E-Commerce Stocks Adobe finished trading at $354.66 up 1.9%.\nAmazon.com ended the day at $221.27 down 0.6%. This week, the company partnered with Mill Industries Inc. to introduce an industry-first on-site food waste recycling technology at Whole Foods Market stores, enhancing sustainability and reducing operational costs.\nAlibaba Group Holding closed at $147.09 down 1.5%.\n\nSumming It All Up Embark on your investment journey to our 266 E-Commerce Stocks selection, featuring Label Vie , China Youran Dairy Group and Hebei Yangyuan ZhiHui Beverage , right here.\nContemplating Other Strategies? Trump's oil boom is here — pipelines are primed to profit. Discover the 22 US stocks riding the wave.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nStory Continues\nSources:\nSimply Wall St\n\"Akamai and Visa Join Forces to Secure the Next Era of Agentic Commerce\" from Akamai Technologies, Inc. on GlobeNewswire (published 17 December 2025)\nCompanies discussed in this article include OTCPK:MALG NasdaqGS:ADBE NYSE:V NasdaqGS:AMZN NYSE:BABA and NasdaqGM:RZLV .\nThis article was originally published by Simply Wall St .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:35:00",
      "Source": "Motley Fool",
      "Title": "2 Unstoppable Stocks to Buy No Matter What Happens in 2026",
      "URL": "https://finance.yahoo.com/m/e0a71a55-de4f-38de-8f4c-18bef668a9f9/2-unstoppable-stocks-to-buy.html",
      "Content": "2 Unstoppable Stocks to Buy No Matter What Happens in 2026\n\nProsper Junior Bakiny, The Motley Fool\nThu, December 18, 2025 at 4:35 AM PST 5 min read\n\nIn this article: AMZN\n\nAAPL\n\nKey Points These two tech leaders had a challenging year but have demonstrated their resilience.\nThey also boast strong prospects and economic moats, making them excellent long-term investments.\n10 stocks we like better than Amazon ›\nIn 2025, tariff threats and trade wars rocked equities and nearly triggered a full-blown bear market. Despite all that, stocks have performed pretty well this year.\n\nWhat's in store for 2026? Nobody knows. However, some companies can navigate the challenges ahead -- whatever they may be -- and perform well over the long run. These are the kind of businesses that investors want to set their eyes on.\nHere are two excellent, well-known candidates that fit the bill: Amazon (NASDAQ: AMZN) and Apple (NASDAQ: AAPL) . These longtime market beaters are still worth investing in and sticking with next year and beyond.\n1. Amazon Amazon has basically moved sideways this year. The e-commerce specialist is lagging broader equities and most of its \"Magnificent Seven\" peers. What's going on with the company?\nThere are several things, and here's one of the most important: Many investors are worried that the company is losing market share to its closest competitors in the cloud computing industry.\n\nAmazon Web Services (AWS) accounts for most of Amazon's operating profits, as it boasts much juicier margins than its e-commerce operations. If it loses ground in this market, Amazon could see slower-growing earnings. That said, Amazon is showing it can perform well, despite this issue.\nDuring the third quarter, the company's sales growth within AWS accelerated, compared to recent quarters, and was stronger than anything investors have seen since 2022. Amazon maintains its lead at the top of the cloud computing industry.\nElsewhere, the company is seeking ways to enhance margins and profits within its e-commerce division. To that end, it has deployed a fleet of industrial robots in its warehouses.\nThe company's goal with this initiative is twofold. First, it will seek to cut costs while making shipping and deliveries faster, thereby improving the customer experience. Amazon's efforts here could help increase its razor-thin margin in its e-commerce division. Even a relatively small improvement may meaningfully boost the company's earnings.\n\nSecond, Amazon has several other potential growth drivers. Its advertising business is going strong, and it's making strides within its healthcare division, thanks to initiatives such as Amazon Pharmacy. And here's the best part: The industries and markets where it dominates still have significant long-term growth prospects.\n\nStory Continues\nThat's the case with e-commerce, which, despite its seeming ubiquity, still captures less than 20% of retail transactions in the U.S. It's also true of cloud computing and artificial intelligence (AI), which, CEO Andy Jassy has observed, are still in their early innings.\nLastly, Amazon has a wide economic moat due to its brand name, switching costs, and network effects. The company's investment thesis remains intact, despite the headwinds it has faced in 2025.\n\n2. Apple Apple is more exposed to the threat of tariffs than perhaps any of its similarly sized peers. The company still generates most of its sales from its hardware devices, particularly the iPhone, which is manufactured in countries such as China -- a country on which the Trump administration tried to impose steep tariffs.\n\nDespite all that, Apple's shares are up 12% year to date. That's below the performance of the S&P 500 but better than many expected six months ago.\nApple's strength lies in its ability to continue convincing new and existing customers to purchase more iPhones. The company's latest launch, the iPhone 17, was well received and is expected to drive a strong renewal cycle over the next three years, helping to maintain decent sales growth.\nHowever, Apple's hardware business isn't where the company's most important long-term opportunities lie. The company's services segment -- where Apple boasts more than 1 billion paid memberships -- arguably takes that crown. It accounted for a meaningful 39% of its sales, as of the last quarter.\n\nMoreover, the services segment has been growing its revenue, on average, faster than the rest of the business for years, a trend that should continue for the foreseeable future. Since services boast significantly higher margins than hardware sales, Apple's profits should increase meaningfully over the long run as the company expands this segment.\nRevenue from services will rise as Apple's large installed base of devices expands. The company routinely hits new highs in that department. And given the company's high switching costs -- Apple makes it hard to leave its ecosystem -- Apple's installed base should, at the very least, remain stable.\nApple has demonstrated that it can navigate the threat from tariffs, still maintains a solid hardware business, and boasts attractive tailwinds within services. To top it all off, it remains an excellent dividend stock . These are all good reasons to stick with Apple in 2026 and beyond.\n\nShould you invest $1,000 in Amazon right now? Before you buy stock in Amazon, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Amazon wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,955 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,089,460 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 968 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nProsper Junior Bakiny has positions in Amazon. The Motley Fool has positions in and recommends Amazon and Apple. The Motley Fool has a disclosure policy .\n2 Unstoppable Stocks to Buy No Matter What Happens in 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:14:00",
      "Source": "Zacks",
      "Title": "Can NBIS AI Cloud 3.1's Blackwell Ultra Launch Trigger Growth Momentum?",
      "URL": "https://finance.yahoo.com/news/nbis-ai-cloud-3-1s-121400275.html",
      "Content": "Can NBIS AI Cloud 3.1's Blackwell Ultra Launch Trigger Growth Momentum?\n\nShreya Majumder\nThu, December 18, 2025 at 4:14 AM PST 4 min read\n\nIn this article: NVDA\n\nCRWV\n\nAMZN\n\nNBIS\n\nAs AI initiatives grow, enterprises face new operational challenges regarding GPU availability across regions, planning capacity for multiple teams and ensuring predictable access to resources. Nebius Group N.V. NBIS is addressing these needs with the launch of Nebius AI Cloud 3.1, the latest release of its full-stack AI cloud platform. Building on the Nebius AI Cloud “Aether\" framework, version 3.1 infuses next-generation NVIDIA NVDA Blackwell Ultra infrastructure, transparent GPU capacity management, expanded AI/ML developer tools and improved enterprise security and compliance features. These updates position Nebius AI Cloud as an ideal platform for enterprises scaling AI workloads in production.\n\nNebius is now rolling out NVIDIA Blackwell Ultra globally, including HGX B300 and GB300 NVL72 systems, becoming the first cloud provider in Europe to run both in production and the first worldwide to deploy GB300 NVL72 with 800 Gbps NVIDIA Quantum-X800 InfiniBand. Paired with accelerated networking, storage and filesystem scaling, Nebius AI Cloud 3.1 removes AI infrastructure bottlenecks and reinforces its position with top MLPerf Training v5.1 results. Furthermore, version 3.1 introduces Capacity Blocks and a real-time dashboard, providing enterprises with full visibility into reserved GPU capacity across regions. Additionally, project-level quotas and new storage rules enable tighter control over resources and costs.\nBeyond infrastructure and operations, Nebius AI Cloud 3.1 expands its ecosystem to streamline AI development, offering simplified access to NVIDIA BioNeMo NIM microservices for healthcare and life sciences without requiring NGC keys or NVDA AI Enterprise licenses. The release also enhances developer experience with improved Slurm orchestration, FOCUS-compliant billing and a refined console, while strengthening enterprise security with HIPAA-ready audit logs, granular access controls, VPC security groups and Microsoft Entra ID–based IAM for regulated and government workloads.\n\nAs AI models grow larger and more complex, platforms like Nebius AI Cloud 3.1 are poised to play a key role in enabling enterprises to innovate faster, without compromising on performance, governance, or control. While capacity expansion supports NBIS’ revenue outlook, with 2025 guidance now set at $500–$550 million, up from the prior $450-$630 million, near-term risks remain. Power constraints, supply-chain uncertainty and intensifying competition from top players like Amazon AMZN and rivals such as CoreWeave, Inc . CRWV could limit capacity growth and weigh on execution in an increasingly crowded AI infrastructure market.\n\nStory Continues\nRising Rivalry to Cloud NBIS’ AI Infrastructure Growth Path CoreWeave continues to ramp up investments in data centers and server infrastructure to keep pace with the ongoing traction in customer demand. CRWV grew from a niche GPU provider into a leading AI cloud by buying large GPU inventories and carving out relationships with AI labs and companies that need lots of H100/Blackwell-class GPUs. A major force behind its momentum is its multi-billion-dollar agreements with NVDA. Third-quarter highlights include being the first to deploy NVIDIA GB300 NVL72 systems for large-scale frontier AI workloads and the first to offer NVIDIA RTX PRO 6000 Blackwell Server Edition instances, giving CRWV an early lead in real-time AI and simulation workloads.\n\nAmazon is rapidly expanding AWS’ power capacity, doubling what it had in 2022 and on track to double again by 2027. In the fourth quarter alone, it expects to add another 1 GW. The expansion includes power, data centers and chips like AWS’ Trainium and NVIDIA GPUs. AMZN continues to deepen partnerships with NVIDIA, AMD and Intel, placing large chip orders and expanding these relationships over time. Backed by strong security, performance and enterprise focus, AWS continues to dominate major enterprise and government cloud migrations, driving AI demand. To support this, AWS added over 3.8 GW of capacity in the past year, more than any other cloud provider.\nNBIS’ Price Performance, Valuation and Estimates Shares of Nebius have gained 179% in the past year compared with the Internet – Software and Services industry’s growth of 26.8%.\n\nImage Source: Zacks Investment Research\nValuation-wise, Nebius seems overvalued, as suggested by the Value Score of F. In terms of Price/Book, NBIS shares are trading at 3.95X, higher than the Internet Software Services industry’s 3.74X.\n\nImage Source: Zacks Investment Research\nThe Zacks Consensus Estimate for NBIS’ 2025 earnings has seen a downward revision over the past 60 days.\n\nImage Source: Zacks Investment Research\nNBIS currently carries a Zacks Rank #4 (Sell).\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nNebius Group N.V. (NBIS) : Free Stock Analysis Report\nCoreWeave Inc. (CRWV) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:03:00",
      "Source": "Barrons.com",
      "Title": "AI Fears Are Fickle. Why Oracle Woes Present a Stock Market Opportunity and 5 Other Things to Know Today.",
      "URL": "https://finance.yahoo.com/m/235c0204-a4df-33b4-a656-d9bb079fdd95/ai-fears-are-fickle.-why.html",
      "Content": "AI Fears Are Fickle. Why Oracle Woes Present a Stock Market Opportunity and 5 Other Things to Know Today.\n\nBarrons.com\nThu, December 18, 2025 at 4:03 AM PST 8 min read\n\nIn this article: OWL\n\nMU\n\nMSFT\n\nAMZN\n\nORCL\n\nMicron Earnings Impress Wall Street, Trump’s prediction of an economic boom may be wrong, more news to start your day.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:00:39",
      "Source": "Yahoo Finance Video",
      "Title": "Amazon, Apple, Google, etc.: Why the Mag 7 needs to 'recalibrate'",
      "URL": "https://finance.yahoo.com/video/amazon-apple-google-etc-why-120039409.html",
      "Content": "Amazon, Apple, Google, etc.: Why the Mag 7 needs to 'recalibrate'\n\nYahoo Finance Video and Brian Sozzi\nThu, December 18, 2025 at 4:00 AM PST\n\nIn this video: TSLA\n\n^GSPC\n\nAAPL\n\nGOOG\n\nMSFT\n\nThe S&P 500 ( ^GSPC ) is concentrated primarily in the top ten technology stocks, according to Barclays.\nPNC Asset Management Group chief investment officer Amanda Agati, Yahoo Finance Senior Business Reporter Ines Ferré , and Yahoo Finance Senior Reporter Brooke DiPalma join Opening Bid host Brian Sozzi to discuss the market's concentration in tech and whether it's time for investors to start selling the \"Magnificent Seven.\"\nTo watch more expert insights and analysis on the latest market action, check out more Opening Bid .\n\nVideo Transcript\n\n00:00 Speaker A\nWhat I mentioned at the top about how much concentration risk there is in the S&P 500. What does that mean exactly for investors as we gear up for next year?\n00:10 Amanda\nWell, it's a great question and it's great to be with all of you again.\n00:15 Amanda\nIt's tough out there. Uh certainly for active managers to try and own enough of those top seven or top 10 names to really make a difference in terms of trying to keep up with, let alone outperform the S&P 500.\n00:30 Amanda\nSo for multi- asset investors, it's I think it's just going to continue to be a challenging environment to keep up with the S&P 500. It's hard to bet against them though.\n00:43 Amanda\nBut I think for 2026, it's going to be less about valuation multiple expansion and much more about what happens to the bottom 490 or 493, however you want to calculate it. I think that market breadth story, it was a little bit elusive this year, but I think it's going to come to the forefront next year and make a difference for multi- asset investor positioning.\n01:00 Speaker A\nAmanda, that's good points. Uh is the sell-offs we're seeing in Oracle and CoreWeave over the past few weeks, is that the signal Amanda to investors to start lightning the load on the Mag 7?\n01:11 Amanda\nI don't know that it's necessarily a signal to start selling. Again, we're not trying to bet against that story. It's it's very secular, thematic, long runway, still very much early innings. So we're all in on it. I think just the reality of where valuations have moved to is a little bit, I don't want to say nonsensical, but I just said nonsensical.\n01:28 Amanda\nIt feel it feels like we need to recalibrate a little bit. And so I think what's happening here is some seasonality, selling some of those winners and hoping that we get another crack at it, maybe early in the new year.\n01:40 Speaker A\nInez, this is all one big fat bubble, right?\n01:44 Ines\nLook, uh Sozzi, uh like Amanda was saying, I mean, yes, there is this concentration uh and also Goldman Sachs uh just recently put out a note as well talking about that concentration for earnings growth for next year and concentrated in the largest uh S&P 500, the largest seven stocks of the S&P 500.\n02:05 Ines\nHowever, like what Amanda was just saying, there is this expectation that for the other 493, that you will see a bit of an acceleration of earnings growth for those companies as well. So there may be a little tiny bit of broadening out when it comes to that.\n02:22 Ines\nBut a lot of this of course is the AI theme that we've been talking about and this is what Wall Street has been bullish on, is this AI theme that AI uh driven productivity will also be supporting earnings.\n02:37 Speaker A\nUh important point here Brooke is that within these 10 stocks that have uh essentially taken over the S&P 500 and taken over the minds of investors. These companies have earnings, the earnings are good and they're still accelerating. So I guess to Amanda's point, it's going to be hard to bet against these names next year.\n02:53 Brooke\nBrian, but I think what the key point here that investors have really weighed in on is the future outlook of these companies, the guidance that they're putting out.\n03:02 Brooke\nAnd I think that's why we're seeing investors fall disappointed based upon what these companies say will be the end results or what exactly the end result could potentially be for revenue when it comes to all the AI investments that they're currently making, the spending that they're currently doing.\n03:20 Brooke\nAnd and that's why sometimes we're not seeing the same return that we see from other uh stocks, other investments because of the fact that these these uh guidance, these outlook that these companies put out just doesn't meet the very high bar that these investors have set for these sort of companies.\n03:42 Brooke\nAnd also, we are seeing a bit of a different fold. Over the past three months, we've seen Tesla, Apple, and Alphabet outperform the broader uh Mag 7.\n03:51 Brooke\nAnd that's largely because of the fact that investors seem to be liking the way in which these companies are now pursuing AI. And so we're seeing this bit of a uh a differ, you know, a difference in what we're seeing in these latter parts of the month than maybe earlier this year when we really saw Nvidia, Amazon, Microsoft, as well as Meta really lead the way within this AI tech rally, especially over the summer months.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 17
}