{
  "stock_id": "AVGO",
  "last_updated": "2026-01-03T18:10:48.190Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2026-01-03",
      "Time": "01:43:00",
      "Source": "Motley Fool",
      "Title": "Is Broadcom Stock a Buy After the Dip?",
      "URL": "https://finance.yahoo.com/m/3825e3e6-af22-399b-8c46-a5407401e8f1/is-broadcom-stock-a-buy-after.html",
      "Content": "Is Broadcom Stock a Buy After the Dip?\n\nWill Ebiefung, The Motley Fool\nFri, January 2, 2026 at 9:43 AM PST 5 min read\n\nIn this article: AVGO\n\nOPAI.PVT\n\nKey Points Some investors are feeling skittish about the high levels of capital spending on AI.\nOne important player, Broadcom, has a big opportunity in custom chip production.\n10 stocks we like better than Broadcom ›\nSemiconductor giant Broadcom (NASDAQ: AVGO) is one of the big winners in the recent generative artificial intelligence (AI) boom that started with the launch of OpenAI's ChatGPT in 2022. Shares have soared by roughly 350% in three years as investors bet on its ability to capitalize on the soaring demand for advanced computing hardware.\n\nThat said, some market participants feel that the AI boom might be getting ahead of itself as companies overspend on data centers without a meaningful guarantee of future returns. This uncertainty has sent Broadcom's stock down by around 15% from its all-time high of $412.\nLet's dig deeper into the pros and cons of the stock to see if this dip is a buying opportunity or a signal for investors to stay far away.\nWhy are investors getting nervous? The stock's recent slide came after Broadcom's fourth-quarter earnings report in mid-December. On the surface, the numbers were fantastic.\nRevenue jumped 28% year over year to a record of $18 billion, driven by soaring demand for AI semiconductor revenue, which rose 74% in the period. This operating segment reflects sales of Broadcom's advanced computer hardware to AI data centers, and management expects the momentum to continue into 2026 as demand for these products continues to surge.\n\nBroadcom's bottom line is also looking great, with net income doubling to $8.5 billion. With numbers like these, it's hard to believe shares are on a two-week downtrend. However, the correction makes more sense when you look at some of the uncomfortable dynamics of the AI industry itself.\nAccording to analysts at Goldman Sachs , hyperscalers are on track to spend an eye-popping $527 billion on AI-related capital expenditures (capex) , with some of this going to hardware produced by companies like Broadcom. The problem is that the scale of the spending doesn't really match up with the profits generated by AI-related software services.\nDeutsche Bank expects ChatGPT creator OpenAI to lose $140 billion by 2029. And despite being one of the top hardware spenders (with roughly $125 billion in capex for 2025), Amazon saw its cloud computing revenue rise by a relatively modest $5.6 billion compared to the prior-year period. The fear is that eventually shareholders will start to push back on all the AI spending. After all, this is money that could be going to buybacks or dividends.\n\nStory Continues\nBroadcom might be better positioned than Nvidia It is fair to assume that AI-related capex spending could soon drop to reasonable levels, which could reduce the growth potential of infrastructure providers like Broadcom. That said, the company is better positioned to weather a potential fallout than the industry leader, Nvidia. To understand why, we must first look at the reasons why AI development is so expensive and generally unprofitable right now.\n\nRunning and training large language models like ChatGPT requires thousands of expensive AI accelerators (such as Nvidia's Blackwell series), which consume significant amounts of energy. Broadcom's semiconductor business actually helps solve this problem by helping its clients develop appl ication-specific integrated circui ts (ASICs). These are custom chips designed to do a specific workload, making them cheaper and easier to run than Nvidia's large, general-purpose chips.\nObviously, ASICs won't be the magic bullet that makes AI companies stop burning through money. But they are the natural first step as companies seek to reduce their reliance on expensive third-party hardware. In October, cloud giant Google selected Broadcom to build its first in-house AI processor chips. This development follows a deal with OpenAI to co-develop AI accelerators and Ethernet solutions.\n\nIs Broadcom stock a buy? Broadcom's ability to benefit from the transition to custom chips makes it a strong bet in the generative AI opportunity. That said, the AI boom is getting long in the tooth, and investors may want to wait until there is more clarity about the sustainability of current industry hardware spending before taking a position in such a highly exposed stock.\n\nShould you invest $1,000 in Broadcom right now? Before you buy stock in Broadcom, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Broadcom wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $505,641 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,143,283 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 974 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 29, 2025\nWill Ebiefung has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Goldman Sachs Group, and Nvidia. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nIs Broadcom Stock a Buy After the Dip? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-03",
      "Time": "00:16:55",
      "Source": "CoinDesk",
      "Title": "Bitcoin pushes above $90,000 as traders eye change in pattern",
      "URL": "https://finance.yahoo.com/m/025312aa-14f2-3003-b5e8-830e3a59b063/bitcoin-pushes-above-%2490%2C000.html",
      "Content": "Bitcoin pushes above $90,000 as traders eye change in pattern\n\nStephen Alpher\nFri, January 2, 2026 at 8:16 AM PST 1 min read\n\nIn this article: BTC-USD\n\nXRP-USD\n\nETH-USD\n\nGC=F\n\nHG=F\n\nLast year in crypto will be remembered for many things, but one notable trend — particularly late in the year — was the selloffs that occurred nearly every day during U.S. trading hours.\nIt&#x27;s not much to go on just yet, but on 2026&#x27;s first official trading day, a change could be afoot as crypto prices are actually rising while American markets are open.\n\nThe action has pushed bitcoin (BTC) above $90,000, up 2.5% over the past 24 hours. Ether (ETH), solana (SOL) and XRP (XRP) are seeing advances closer to 4%.\nAssets in general are on the rise in the year&#x27;s first session, with the Nasdaq higher by 0.6%, led by AI-related chipmakers like Nvidia, Broadcom, Micron and Intel posting 3%-6% gains. Favored commodity play of late, silver has added 3%. Gold and copper are each modestly higher.\nBitcoin miners turned AI infrastructure firms are sharply higher across the board, with Hut 8 (HUT), CleanSpark (CLSK), TeraWulf (WULF) sporting 10% gains, and Cipher Mining (CIFR) and IREN (IREN) each higher by 8%.\nStrategy (MSTR) and Coinbase (COIN) are each ahead more than 3%, Galaxy Digital (GLXY) by 7% and Circle Financial (CRCL) by 4.5%.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-03",
      "Time": "00:01:04",
      "Source": "StockStory",
      "Title": "Why Are AMD (AMD) Shares Soaring Today",
      "URL": "https://finance.yahoo.com/news/why-amd-amd-shares-soaring-160104506.html",
      "Content": "Why Are AMD (AMD) Shares Soaring Today\n\nAnthony Lee\nFri, January 2, 2026 at 8:01 AM PST 2 min read\n\nIn this article: AMD\n\n^IXIC\n\nNVDA\n\nAVGO\n\nWhat Happened? Shares of computer processor maker AMD (NASDAQ:AMD) jumped 5.3% in the morning session after investor optimism grew following favorable analyst predictions for 2026 and anticipation of new product announcements.\nThe move came as top Wall Street analysts predicted a potential 32% jump in the stock's value for 2026, building on significant gains from the previous year. This positive outlook was tied to AMD's role in the artificial intelligence sector, driven by demand for high-performance computing and data centers. Adding to the excitement were rumors that the company planned to reveal a new, faster Ryzen chip and a new generation of processors at the upcoming CES 2026 conference. AMD's stock also benefited from a broader rally in tech stocks, as fresh excitement surrounding the prospects of AI lifted the sector.\n\nAfter the initial pop the shares cooled down to $220.34, up 2.9% from previous close.\nIs now the time to buy AMD? Access our full analysis report here .\nWhat Is The Market Telling Us AMD’s shares are extremely volatile and have had 30 moves greater than 5% over the last year. In that context, today’s move indicates the market considers this news meaningful but not something that would fundamentally change its perception of the business.\nThe previous big move we wrote about was 14 days ago when the stock gained 6.8% on the news that investor optimism around artificial intelligence fueled broad market gains. Technology stocks with a focus on artificial intelligence once again led the market higher, boosting the Nasdaq and S&P 500. Companies at the forefront of the AI boom, such as Nvidia and Broadcom, saw significant jumps in their share prices. The rally reflects a renewed belief among investors in the transformative potential of AI technology to drive future growth and productivity. The rally was further supported by a surprise cooling in the November consumer price index (CPI) report, which triggered market pricing for additional rate cuts in the coming year. This created a more favorable environment for growth-oriented companies.\nInvestors who bought $1,000 worth of AMD’s shares 5 years ago would now be looking at an investment worth $2,387.\nThe 1999 book Gorilla Game predicted Microsoft and Apple would dominate tech before it happened. Its thesis? Identify the platform winners early. Today, enterprise software companies embedding generative AI are becoming the new gorillas. Click here for access to our special report that reveals one profitable leader already riding this wave .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-02",
      "Time": "23:05:00",
      "Source": "Barrons.com",
      "Title": "Nvidia, AMD, and Broadcom Are Facing Off. How the 2026 AI Chips Battle Is Shaping Up.",
      "URL": "https://finance.yahoo.com/m/addd5bdc-4a61-3d4e-868b-6eded84848ed/nvidia%2C-amd%2C-and-broadcom-are.html",
      "Content": "Nvidia, AMD, and Broadcom Are Facing Off. How the 2026 AI Chips Battle Is Shaping Up.\n\nAdam Clark\nFri, January 2, 2026 at 7:05 AM PST 5 min read\n\nIn this article: INTC\n\nAMD\n\nAVGO\n\nNVDA\n\nNvidia, AMD and Broadcom are planning big things this year year. These are the biggest developments to watch in the AI chip sector in 2026.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-02",
      "Time": "22:10:34",
      "Source": "Insider Monkey",
      "Title": "Benchmark Boosts Broadcom’s (AVGO) Price Target Amid AI Chip Growth",
      "URL": "https://finance.yahoo.com/news/benchmark-boosts-broadcom-avgo-price-141034796.html",
      "Content": "Benchmark Boosts Broadcom’s (AVGO) Price Target Amid AI Chip Growth\n\nSheryar Siddiq\nFri, January 2, 2026 at 6:10 AM PST 2 min read\n\nIn this article: AVGO\n\nANTH.PVT\n\nMETA\n\nGOOG\n\nOPAI.PVT\n\nBroadcom Inc. (NASDAQ: AVGO ) ranks among the best AI stocks to buy according to analysts . Citing robust development in the AI semiconductor industry, Benchmark increased its price target for Broadcom Inc. (NASDAQ:AVGO) from $385 to $485 on December 12, retaining a Buy rating on the company’s shares. According to Broadcom Inc. (NASDAQ:AVGO), its AI semiconductor division achieved $6.5 billion in Q4, improving 76% year-over-year and 25% sequentially.\nThe company reported $21 billion in orders from Anthropic over the last two quarters, while its six-quarter AI order backlog climbed to $73 billion. Broadcom’s list of clients now includes giants like Meta, ByteDance, and Google, as well as an additional contract with OpenAI to supply $1 billion in chips by late 2026.\n\nAccording to Reuters, while Broadcom’s backlog is scheduled to ship over the next 18 months, CFO Kirsten Spears warned that margins could fall. She stated that the Q1 consolidated gross margin is likely to fall roughly 100 basis points sequentially, owing to a higher percentage of AI revenue.\nAnalysts quoted by Reuters emphasize two main risks for the company, including its excessive concentration on just five AI customers, and weaker margins on AI systems, which are likely to account for a greater share of the total revenue in coming quarters, notably in the second half of fiscal year 2026.\nBroadcom Inc. (NASDAQ:AVGO) designs, develops, and supplies various semiconductor devices and infrastructure software solutions worldwide. The company operates in two segments: Semiconductor Solutions and Infrastructure Software.\n\nWhile we acknowledge the potential of AVGO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 10 Best Magic Formula Stocks for 2025 and 10 Best Retirement Stocks to Buy According to Hedge Funds .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-02",
      "Time": "22:07:34",
      "Source": "24/7 Wall St.",
      "Title": "Is Capital Group Dividend Value ETF Good For Retirees? | CGDV",
      "URL": "https://finance.yahoo.com/m/3ccff36c-6165-3b66-83d2-b0d539a14741/is-capital-group-dividend.html",
      "Content": "Is Capital Group Dividend Value ETF Good For Retirees? | CGDV\n\nMichael Williams\nFri, January 2, 2026 at 6:07 AM PST 3 min read\n\nIn this article: CGDV\n\nSCHD\n\nMSFT\n\nAVGO\n\nNVDA\n\nQuick Read CGDV delivers only 1.4% yield despite 24% annual returns. Its tech-heavy allocation prioritizes growth over immediate income.\nThe fund generated $1,400 annually on $100K invested versus $3,800 from a 3.8% yielding alternative like SCHD.\nTech concentration at 24.5% creates volatility uncommon in dividend funds. Top three holdings are Microsoft, Broadcom and NVIDIA.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Date": "2026-01-02",
      "Time": "21:57:00",
      "Source": "Zacks",
      "Title": "MRVL's Custom Silicon Business Scales Up: What's Coming Next?",
      "URL": "https://finance.yahoo.com/news/mrvls-custom-silicon-business-scales-135700350.html",
      "Content": "MRVL's Custom Silicon Business Scales Up: What's Coming Next?\n\nSubham Roy\nFri, January 2, 2026 at 5:57 AM PST 3 min read\n\nIn this article: MRVL\n\nAVGO\n\nAMD\n\nMarvell Technology 's MRVL AI XPU offerings are experiencing massive traction among hyperscalers, AI data centers and high-performance computing workloads. In the third quarter of fiscal 2026, Marvell Technology’s data center segment posted revenues of $1.52 billion, growing 37.8% year over year, led by strong traction in custom XPU silicon products.\n\nMarvell Technology expects its custom silicon business to roughly contribute to one-fourth of its overall data center revenues and grow at least 20% next year. The company recently unveiled 18 XPU and XPU-attach socket design wins, among which many are already in volume production.\nThese design wins include full custom XPU programs, XPU-attached silicon, electrical I/O chiplets integrated inside multi-die XPU packages and other products, contributing to a pipeline of more than 10% of a $75 billion lifetime revenue funnel. MRVL’s custom silicon strategy has evolved from a niche application-specific integrated circuit (ASIC) offering into a deeply embedded, multi-year hyperscaler partnership model.\nNow, Marvell Technology develops custom ASIC designs for AI, cloud data center and OEM customers using its advanced 5nm and 3nm processes like 112G XSR serializer/de-serializer (SerDes), Long Reach SerDes, PCIe Gen 6 SerDes. These capabilities enable MRVL to stay ahead of its competitors in the custom AI silicon space.\n\nHow Competitors Fare Against MRVL Broadcom AVGO is one of the leading suppliers of custom silicon solutions for data center, service provider and enterprise networking customers. Broadcom’s advanced 3.5D XDSiP packaging platform is specifically designed to enhance the performance and efficiency of custom AI XPUs.\nAdvanced Micro Devices AMD is another player in the custom silicon solutions and AI accelerator space with its semi-custom SoC offerings and Instinct Accelerators that power numerous data centers. Advanced Micro Devices’ reconfigurable Alveo Adaptable Accelerator Cards are used to speed up compute-intensive applications in data centers.\n\nWhile Broadcom and Advanced Micro Devices are formidable players in the custom silicon space for AI acceleration, Marvell Technology’s deep partnership with NVIDIA provides MRVL necessary support to sustain in this space.\nMRVL's Price Performance, Valuation and Estimates Shares of Marvell Technology have gained 13.1% in the past six months compared with the Electronics - Semiconductors industry’s growth of 22.3%.\nMRVL 6-Month Performance Chart\nImage Source: Zacks Investment Research\nFrom a valuation standpoint, Marvell Technology is trading at a forward price-to-sales ratio of 7.31X, lower than the industry’s average of 8.46X.\n\nStory Continues\nMRVL Forward 12-Month (P/S) Valuation Chart\nImage Source: Zacks Investment Research\nThe Zacks Consensus Estimate for MRVL’s fiscal 2026 and 2027 earnings implies year-over-year growth of 81% and 26%, respectively. The estimates for fiscal 2026 and fiscal 2027 have been revised upward in the past 30 days.\n\nImage Source: Zacks Investment Research\nMarvell Technology currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nMarvell Technology, Inc. (MRVL) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-02",
      "Time": "20:14:00",
      "Source": "Barrons.com",
      "Title": "Nvidia, AMD and Broadcom Are Facing Off. How the 2026 AI Chips Battle Is Shaping Up.",
      "URL": "https://finance.yahoo.com/m/addd5bdc-4a61-3d4e-868b-6eded84848ed/nvidia%2C-amd-and-broadcom-are.html",
      "Content": "Nvidia, AMD and Broadcom Are Facing Off. How the 2026 AI Chips Battle Is Shaping Up.\n\nAdam Clark\nFri, January 2, 2026 at 4:14 AM PST 5 min read\n\nIn this article: NVDA\n\nINTC\n\nAMD\n\nAVGO\n\nNvidia, AMD and Broadcom are planning big things this year year. These are the biggest developments to watch in the AI chip sector in 2026.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-02",
      "Time": "14:30:00",
      "Source": "Barrons.com",
      "Title": "The Stock Market Won’t Be Worth Celebrating in 2026",
      "URL": "https://finance.yahoo.com/m/2315906d-b736-3476-be5c-a25e480c3bf0/the-stock-market-won%E2%80%99t-be.html",
      "Content": "The Stock Market Won’t Be Worth Celebrating in 2026\n\nBen Levisohn\nThu, January 1, 2026 at 10:30 PM PST 5 min read\n\nIn this article: NVDA\n\nCRWV\n\nAVGO\n\nGOOG\n\n^GSPC\n\nFor three years, Big Tech has been able to cover up the market’s flaws. Cracks started appearing in 2025—and they’re only looking worse.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-02",
      "Time": "04:00:00",
      "Source": "Yahoo Finance Video",
      "Title": "AI trade will fracture into winners & losers: Top stock picks",
      "URL": "https://finance.yahoo.com/video/ai-trade-fracture-winners-losers-200000655.html",
      "Content": "AI trade will fracture into winners & losers: Top stock picks\n\nYahoo Finance Video and Josh Lipton\nThu, January 1, 2026 at 12:00 PM PST\n\nIn this video: AVGO\n\nGOOG\n\nMU\n\nORCL\n\nArtificial intelligence (AI) will continue to be a key pillar of market gains in 2026, Sevens Report research founder Tom Essaye tells Market Domination host Josh Lipton .\nEssaye says the AI trade could become more fractured, highlighting which AI stocks he expects to be winners and losers.\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination .\n\nVideo Transcript\n\n00:00 Josh\nPillar number one, no surprise, AI, lots of investor excitement, Tom. It's helped to carry this market in 2025. I'm curious how you how you see that AI trade and trend evolving in 2026, Tom.\n00:30 Tom\nGood afternoon, Josh. Thank you very much for having me on and happy New Year to everyone. Yeah, so, so we sort of described four pillars of the rally and the most important and first one as you said is AI. and it's really been a rising tide that's lifted all boats, not just this year, but for the past three and a half years, really. But we think that's changing a little bit in 2026. and importantly, it doesn't mean it's necessarily going away, but instead, I think the sort of AI enthusiasm is going to look a lot more like Q4 than it did say Q2 and Q3. and what I mean by that is that it's fractured. So we're not going to have every single tech stock just running away. It's going to become a selection of winners, say like your Micron, and then maybe some losers, like your Oracle and to a point Qualcomm. and I'm not saying to those stocks specifically into 2026, but more as an example that we're going to have to be selective as AI matures.\n01:41 Josh\nWell, let me ask you, if AI is sort of more fractured next year, you know, if I'm a viewer or I'm an investor, I'm listening to that. How do I discern, Tom, then the winners and losers in this AI fractured world you're describing?\n02:00 Tom\nSo for me, I look at AI as sort of a cycle that's maturing, right? And really the first stage was sort of it was it was the epiphany stage, right? Oh my gosh, we can do this. And then in order to do this, the first thing we need is semiconductors. And now we're going to run out and buy all the semiconductors that we can and obviously Nvidia, Broadcom, Taiwan Semi have benefited fantastically from this. I see it evolving a bit now into those that those companies that are really taking the leading edge. Probably my top AI pick for 2026 is Google. I like Gemini 3. I think their advantage on search gives them a huge uh sort of chip in the game against Open AI. So I like Google from a search standpoint. I also like the memory because that's sort of the next stage of this data center build out, right? We need the compute power. Well now all of a sudden we need all the memory to power all that we need. So I see it more of an infrastructure play evolving uh towards memory on the infrastructure side, but then also from sort of the hyperscalers, I really like Google uh with YouTube and then with Gemini 3.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "22:04:00",
      "Source": "Motley Fool",
      "Title": "This Artificial Intelligence Stock Could Be the Biggest Bargain Buy of 2026",
      "URL": "https://finance.yahoo.com/m/0cb03d73-5e25-38b6-8686-387b78e4f5b1/this-artificial-intelligence.html",
      "Content": "This Artificial Intelligence Stock Could Be the Biggest Bargain Buy of 2026\n\nHarsh Chauhan, The Motley Fool\nThu, January 1, 2026 at 6:04 AM PST 4 min read\n\nIn this article: MU\n\nNVDA\n\nPLTR\n\nAVGO\n\nKey Points Micron Technology has remarkable earnings growth potential.\nIt is benefiting from the favorable dynamics of the memory market, particularly due to the AI infrastructure buildout.\n10 stocks we like better than Micron Technology ›\nArtificial intelligence (AI) stocks delivered another year of impressive returns to investors in 2025, as is evident from the 30% jump in the Global X Artificial Intelligence & Technology ETF -- the largest AI-focused exchange-traded fund.\n\nThe sector did well despite starting 2025 on the back foot for reasons that included President Donald Trump's tariff-induced trade wars and concerns about the huge amounts of money being spent on AI infrastructure. Those concerns were amplified after Chinese tech startup DeepSeek claimed that it had been able to train its large language model for a fraction of what the likes of OpenAI have been spending.\nFollowing their remarkable surges over the past year, most of the top AI stocks -- names like Nvidia , Palantir , Broadcom , and Snowflake -- are trading at expensive sales multiples, lofty earnings multiples, or both. However, there is one AI stock that can be bought at an incredibly cheap valuation right now, despite having risen 250% in the past year -- Micron Technology (NASDAQ: MU) .\nHere's why this semiconductor company could be the biggest bargain buy of 2026.\nMicron Technology is too cheap to ignore right now For a company that reported a 57% year-over-year increase in revenue and a 167% increase in non-GAAP (adjusted) earnings in its latest quarter, a trailing earnings multiple of 27 is a massive bargain. Even better, Micron anticipates that in the current quarter, its top line will jump by 132% year over year to $18.7 billion, and its adjusted earnings will jump more than fivefold.\n\nTherefore, Micron's valuation suggests that the market has not yet fully priced its growth potential into the stock. Consensus estimates are projecting its earnings will increase nearly fourfold in its next fiscal year to $32.14 per share. Not surprisingly, Micron has a forward earnings multiple of just 9, well below the tech-laden Nasdaq-100 index's forward price-to-earnings (P/E) ratio of 26.\nIf the market decides to reward Micron with a higher multiple and it trades at a forward P/E in line with the Nasdaq-100's average after a year, its stock price could shoot up remarkably. More importantly, Micron is indeed capable of hitting Wall Street's earnings expectations.\nThe memory market boom will be a big catalyst for the stock Demand for memory chips is far outstripping supply. A significant chunk of the available high-bandwidth memory production is being deployed in AI accelerator chips such as graphics processing units. As a result, there is a shortage of the memory chips used in smartphones and personal computers. This shortage has driven a massive increase in memory prices.\n\nStory continues\nThose prices are likely to go higher in 2026. Server memory prices could even double, driven by the booming demand for the high-bandwidth memory (HBM) that goes into data center chips. At the same time, memory manufacturers such as Micron are expected to keep a check on the production capacity they bring online to support the higher prices.\n\nMarket research firm IDC anticipates that memory supply growth in 2026 will be around 16% to 17%, which is lower than the usual rate. For comparison, the HBM market alone is poised to grow at an annualized rate of 42% through 2033.\nSo Micron's stunning share price growth could continue beyond 2026, especially considering that spending on AI data centers could hit a whopping $1.2 trillion in 2030. All this suggests that Micron could turn out to be a long-term winner, which makes buying the growth stock at its current dirt-cheap valuation a no-brainer decision.\nShould you buy stock in Micron Technology right now? Before you buy stock in Micron Technology, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Micron Technology wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $505,641 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,143,283 !*\nNow, it’s worth noting Stock Advisor’s total average return is 974 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 29, 2025\nHarsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia, Palantir Technologies, and Snowflake. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nThis Artificial Intelligence Stock Could Be the Biggest Bargain Buy of 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "19:00:07",
      "Source": "GuruFocus.com",
      "Title": "Navigating Market Uncertainty: Intrinsic Value of Broadcom Inc",
      "URL": "https://finance.yahoo.com/news/navigating-market-uncertainty-intrinsic-value-110007827.html",
      "Content": "Navigating Market Uncertainty: Intrinsic Value of Broadcom Inc\n\nGuruFocus News\nThu, January 1, 2026 at 3:00 AM PST 4 min read\n\nIn this article: AVGO\n\nThis article first appeared on GuruFocus .\nIn this article, we will take a look into Broadcom Inc's ( NASDAQ:AVGO ) DCF analysis, a reliable and data-driven approach to estimating its intrinsic value. Instead of using future free cash flow as in the traditional DCF model, the GuruFocus DCF calculator uses EPS without NRI as the default for the DCF model based on research that shows that historically stock prices have been more correlated with earnings than free cash flow.\n\nWarning! GuruFocus has detected 2 Warning Sign with AVGO.\nIs AVGO fairly valued? Test your thesis with our free DCF calculator.\nAs of 2026-01-01, Broadcom Inc's intrinsic value as calculated by the Discounted Earnings model is $207.48. It's currently trading at a price of $346.1. Therefore, the margin of safety based on the DCF model is -66.81%. The company is modestly overvalued.\nThe model The GuruFocus DCF calculator follows a two-stage model by default. This model consists of the Growth Stage and the Terminal Stage. In the growth stage, the company is experiencing faster growth, while in the terminal stage, a lower growth rate is applied because sustained rapid growth is not sustainable in the long run. Broadcom Inc's intrinsic value estimated by Discounted Earnings model are arrived at by following assumptions and steps.\n\nAssumptions Term\nValue\nExplanation\nEPS without NRI\n$6.82\nGuruFocus DCF calculator uses EPS without NRI as the default because historically stock prices are more correlated to earnings than free cash flow.\nDiscount Rate\n11%\nAn appropriate discount rate is typically the risk-free rate plus the risk premium of the stock market. GuruFocus uses the current 10-year Treasury Constant Maturity Rate of 4.16%, rounded up to the nearest whole number, which is 5%. A 6% risk premium is then added to arrive at the estimated discount rate.\nGrowth Stage\nGrowth rate (g1) = 19.60% Years of Growth Stage = 10\nWe choose the growth rate based on the availability, prioritizing the average EPS without NRI growth rate from the past 10, 5, or 3 years in that order, and then capping between 5% and 20% to maintain a fair and balanced estimate. The default growth period is set to 10 years.\nTerminal Stage\nGrowth rate (g2) = 4% Years of Terminal Stage = 10\nFor the terminal stage, the eps will grow at 4% for 10 years. It is important to ensure that the terminal growth rate remains lower than the discount rate to facilitate convergence in the calculation.\n\nCalculation Growth Stage\n=\nEPS without NRI\n*\n[ (1 + g1) / (1 + d)\n*\n(1 + g1) ^ 2 / (1 + d) ^ 2\n+\n...\n+\n(1 + g1) ^ 10 / (1 + d) ^ 10 ]\n=\n105.19\nTerminal Stage\n=\nEPS without NRI\n*\n(1 + g1) ^ 10 / (1 + d) ^ 10\n*\n[ (1 + g2) / (1 + d)\n+\n(1 + g2) ^ 2 / (1 + d) ^ 2\n+\n...\n+\n(1 + g2) ^ 10 / (1 + d) ^ 10 ]\n=\n102.29\nIntrinsic Value: DCF (Earnings Based)\n=\nGrowth Stage\n+\nTerminal Stage\n=\n207.48\n\nDiscounted Free Cash Flow Model GuruFocus also provides the calculation using the traditional approach of free cash flow . Using trailing twelve month(ttm) Free Cash Flow per Share as a parameter, the DCF intrinsic value based on free cash flow is $173.22. This valuation indicates that the Broadcom Inc is modestly overvalued, accompanied by a margin of safety of -99.8%. You can always switch to using Free Cash Flow per Share to calculate the real DCF model on our DCF calculator page .\n\nStory Continues\nThe Bottom Line Please note that while the DCF model is a robust valuation methodology, it relies on various assumptions and projections that may affect the accuracy of the final intrinsic value calculation. Here are some considerations when employing the DCF model:\nFuture Earnings Potential: The DCF model evaluates a company based on its potential future earnings.\nEmbracing Growth: Growth plays a pivotal role. All else being equal, a company with rapid growth will have a higher value.\nPredictability: The model assumes that a company will grow at the same rate as its past 10-year performance, making it a better fit for companies with consistent performance. For companies with unpredictable performance, such as cyclical companies, the DCF model may be less accurate and a larger margin of safety should be emphasized.\nDiscount Rate: Selecting an appropriate discount rate is paramount. Using your anticipated return on investment is a sensible choice for the discount rate.\nNavigating with GuruFocus: Using the GuruFocus All-in-One Screener , you can easily screen for stocks that are currently trading below their intrinsic value: DCF (FCF Based) and Intrinsic Value: DCF (Earnings Based). To identify undervalued predictable companies , focus on those with a high Predictability Rank that are trading at a discount to their Intrinsic Value: DCF (FCF Based) and Intrinsic Value: DCF (Earnings Based).\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "18:35:00",
      "Source": "Motley Fool",
      "Title": "This Super Semiconductor Stock Crushed Nvidia in 2025. Is It a Buy, Sell, or Hold in 2026?",
      "URL": "https://finance.yahoo.com/m/1e3d84d8-f5c5-38de-8375-3140baeb8344/this-super-semiconductor.html",
      "Content": "This Super Semiconductor Stock Crushed Nvidia in 2025. Is It a Buy, Sell, or Hold in 2026?\n\nAnthony Di Pizio, The Motley Fool\nThu, January 1, 2026 at 2:35 AM PST 5 min read\n\nIn this article: NVDA\n\nAVGO\n\nANTH.PVT\n\nKey Points Demand continues to outstrip supply for the data center chips and networking equipment used in artificial intelligence (AI) development.\nBroadcom's custom AI accelerators are increasing in popularity, with leading start-up Anthropic placing a whopping $21 billion worth of orders.\nBroadcom stock outperformed Nvidia stock in 2025, but its valuation could limit further blistering gains in the short term.\n10 stocks we like better than Broadcom ›\n\nArtificial intelligence (AI) development requires an astronomical amount of computing power, which can only be delivered through large, centralized data centers fitted with thousands of specialized chips. Nvidia (NASDAQ: NVDA) CEO Jensen Huang predicts annual spending on this infrastructure could hit $4 trillion by 2030, creating a massive financial opportunity for hardware suppliers.\nNvidia's graphics processing units (GPUs) are currently the best chips in the world for AI development, but Broadcom 's (NASDAQ: AVGO) alternative chips -- called AI accelerators -- are increasing in popularity among tech giants because they can be fully customized.\nBroadcom stock soared by 50% in 2025, comfortably beating Nvidia stock, which climbed by 36%. But is it too late for investors to board this train, or are the best gains yet to come?\nServing some of the biggest AI companies Nvidia's data center GPUs are a great plug-and-play solution for most AI companies, but as workloads become more complex, some developers see value in custom solutions that can be tailored to their specific needs. Alphabet , for instance, enlisted Broadcom's help to create its own AI accelerators called Tensor Processing Units (TPUs), which it used to develop its industry-leading Gemini family of AI models.\n\nAlphabet recently started selling its latest Ironwood TPUs to other developers, which is a big win for Broadcom as the designer and manufacturer. Anthropic, which is the AI start-up behind the Claude chatbot, placed a $10 billion order for Ironwood TPUs earlier this year, followed by another order worth $11 billion more recently, which is scheduled for delivery in late 2026. Broadcom says Anthropic is just one of four customers so far.\nBut the chipmaker's AI opportunity doesn't stop there, because demand is also soaring for its data center networking equipment. Its Tomahawk Ethernet switches, for example, regulate how fast data travels between chips and devices, and they deliver industry-leading low latency and high throughput. The result is faster processing speeds with less data loss, which is a winning combination for AI developers.\n\nStory Continues\nBroadcom's AI revenue continues to soar Broadcom generated $18 billion in total revenue during its fiscal 2025 fourth quarter (ended Nov. 2), beating management's forecast of $17.4 billion. It was a 28% increase compared to the year-ago period, and this was the second straight quarter in which that growth rate accelerated.\nBroadcom's AI semiconductor business fueled the strong fourth-quarter result, with its revenue soaring by 74% to $6.5 billion. That growth rate also accelerated from 63% in the previous quarter, which highlights the significant momentum in the company's AI business.\n\nBut it gets better, because Broadcom's guidance for the first quarter of fiscal 2026 (which ends in early February) points to $8.2 billion in AI semiconductor revenue, representing further accelerated growth of 100%, led by surging demand for AI chips and networking equipment.\nTurning to the bottom line, Broadcom produced a massive generally accepted accounting principles (GAAP) profit of $8.5 billion during the fourth quarter, a whopping 97% increase from the year-ago period. For fiscal 2025 overall, the company's GAAP profit almost quadrupled to $23.1 billion.\nThese results are a welcome payoff for patient investors who endured Broadcom's near-$100 billion merger and acquisition spree between 2019 and 2023, which led to substantial short-term losses, but ultimately turned the company into what it is today.\n\nIs Broadcom stock a buy, sell, or hold in 2026? Broadcom's operating performance is exceptional right now, but whether investors should buy this stock might depend entirely on their time horizon, because it isn't cheap.\nBased on the company's fiscal 2025 earnings of $4.77 per share, its stock is trading at a price-to-earnings (P/E) ratio of 73.3, which is more than double the P/E ratio of the Nasdaq-100 technology index. It's also far more expensive than Nvidia stock, which trades at a P/E ratio of 46.6.\nBroadcom is also extremely expensive when we value the company based on its annual revenue. It's trading at a price-to-sales (P/S) ratio of 26.5 as I write this, nearly triple its 10-year average of 9.1.\nBroadcom's premium valuation isn't a surprise in light of the company's soaring growth. However, even if we assume its revenue will continue growing at the current pace, it might still be a couple of years before its stock looks attractively valued (unless it declines significantly in the meantime).\n\nThat means investors who are thinking about buying Broadcom stock -- or those who already own it -- should plan to hold it for at least a few years to maximize their chances of earning a positive return. This probably isn't the right stock for short-term investors who want to see big gains in 12 months or less.\nShould you buy stock in Broadcom right now? Before you buy stock in Broadcom, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Broadcom wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $505,749 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,149,658 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 979 % — a market-crushing outperformance compared to 195% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 29, 2025\nAnthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet and Nvidia. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nThis Super Semiconductor Stock Crushed Nvidia in 2025. Is It a Buy, Sell, or Hold in 2026? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "16:35:00",
      "Source": "Motley Fool",
      "Title": "The Best AI Semiconductor Stock to Buy for 2026, According to Certain Wall Street Analysts (Hint: Not Nvidia or Broadcom)",
      "URL": "https://finance.yahoo.com/m/e9bec84d-cf73-3d46-a7da-9e13adf259d7/the-best-ai-semiconductor.html",
      "Content": "The Best AI Semiconductor Stock to Buy for 2026, According to Certain Wall Street Analysts (Hint: Not Nvidia or Broadcom)\n\nTrevor Jennewine, The Motley Fool\nThu, January 1, 2026 at 12:35 AM PST 5 min read\n\nIn this article: NVDA\n\nAVGO\n\nMU\n\nKey Points Nvidia is the market leader in AI accelerators, and its full-stack strategy means its systems often have the lowest total cost of operation.\nBroadcom is the industry standard in Ethernet switching and routing chips, and it is the market leader in custom AI accelerators.\nMicron is gaining market share in DRAM and NAND memory, and the company should benefit from the ongoing DRAM supply shortage.\n10 stocks we like better than Nvidia ›\n\nNvidia (NASDAQ: NVDA) and Broadcom (NASDAQ: AVGO) are cornerstones of the artificial intelligence trade. But while Morgan Stanely analysts led by Joseph Moore have buy ratings on both chip stocks, Micron Technology (NASDAQ: MU) is their top pick within in the semiconductor industry for 2026.\nReaders should be aware that most Wall Street analysts have a different opinion.\nAmong 69 analysts, Nvidia has a median target price of $250 per share. That implies 33% upside from its current share price of $187.\nAmong 52 analysts, Broadcom has a median target price of $460 per share. That implies 31% upside from its current share price of $350.\nAmong 44 analysts, Micron has a median target price of $305 per share. That implies 4% upside from its current share price of $293.\nHere's what investors should know.\n1. Nvidia Nvidia is well known for its best-in-class graphics processing units (GPUs), chips used to speed up compute-intensive data center workloads like artificial intelligence (AI) training and inference. However, the company is truly formidable because of its full-stack strategy that spans adjacent hardware and software development tools.\n\nNvidia develops rack-scale systems that pair GPUs with CPUs and networking equipment, which lets the company optimize performance across the entire data center, while saving clients the trouble of integrating hardware from multiple suppliers.\nIn addition, Nvidia's CUDA software platform provides developers with an extensive suite of code libraries, frameworks, and pretrained models that simplify application development across numerous of use cases, from predictive analytics and content generation to conversational agents and autonomous machines.\nConsequently, while custom AI chips designed by rivals like Broadcom may be cheaper, Nvidia systems often have the lowest total cost of ownership (TCO) when every expense is include. \"Our TCO is so good that even when the competitors' chips are free, it's not cheap enough,\" according to Nvidia CEO Jensen Huang.\n\nNvidia dominates the AI accelerator space today with more than 80% market share, and the company is likely to maintain its dominance for the foreseeable future because it offers customers the lowest TCO. Wall Street expects Nvidia's earnings to grow at 37% annually in the next three years. That makes the current valuation of 46 times earnings look attractive.\n\nStory Continues\n2. Broadcom Broadcom is a key player in two parts of the AI supply chain: networking chips and custom accelerators. The company has 80% market share in high-speed Ethernet switching and routing chips, a market forecast to grow at 20% to 30% annually in the next few years, per JPMorgan Chase . Its latest Tomahawk 6 (switching) and Jericho 3 (routing) chips offer industry-leading performance.\n\nBroadcom is also the leading supplier of custom AI accelerators, also called application-specific integrated circuits (ASICs), with 70% to 80% market share. The company has five major ASIC customers: Alphabet 's Google, Meta Platforms , TikTok parent ByteDance, OpenAI, and Anthropic. However, Broadcom has other prospective customers in the pipeline, including Apple , Arm Holdings , and xAI. The AI accelerator market is projected to expand at 29% annually through 2033, according to Grand View Research.\nBeyond semiconductors, Broadcom subsidiary VMware is a leader in virtualization software. Consultancy Gartner recently recognized the company as a leader in distributed hybrid infrastructure, a setup that uses virtualization to combine public and private clouds into one manageable system. The data center virtualization market is forecast to grow at 21% annually through 2033, according to Grand View.\n\nWall Street estimates Broadcom's adjusted earnings will grow at 36% annually during the next three years. That makes the current valuation of 51 times earnings look attractive.\n3. Micron Technology Micron develops memory and storage solutions for personal computers, mobile devices, data center servers, and automotive systems. The company sells DRAM (dynamic random access memory) products, including high-bandwidth memory (HBM) created by stacking DRAM chips, and NAND products.\nDRAM products offer fast, short-term memory for active applications, and NAND products provide slow, long-term memory for file storage. Both are important for artificial intelligence workloads; DRAM (especially HBM) products offer the bandwidth needed for training and inference, while NAND products provide the storage needed for datasets and AI models.\n\nImportantly, Micron is not the market leader in DRAM or NAND products, but the company is gaining market share in both categories and its primary competitors, Samsung and SK Hynix , are losing market share. Particularly important, Micron gained 10 percentage points of market share in HBM over the past year.\nWhy is Morgan Stanley so bullish? The analysts argue the ongoing AI buildout has led to the most severe DRAM and NAND shortage in the last three decades. That shortage is driving prices higher and Micron is well-positioned to benefit. Indeed, Wall Street expects Micron's earnings to grow at 48% annually over the next three years, which makes the current valuation of 28 times earnings look quite cheap.\nShould you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $505,749 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,149,658 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 979 % — a market-crushing outperformance compared to 195% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 29, 2025\nTrevor Jennewine has positions in Nvidia. The Motley Fool has positions in and recommends Alphabet, Apple, Meta Platforms, and Nvidia. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nThe Best AI Semiconductor Stock to Buy for 2026, According to Certain Wall Street Analysts (Hint: Not Nvidia or Broadcom) was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "03:45:01",
      "Source": "Investor's Business Daily",
      "Title": "Funds Plow Money Into AppLovin, Broadcom, Google — And This Top 100 Stock",
      "URL": "https://finance.yahoo.com/m/27ad62cb-8474-3e41-b47b-5d23f46f707e/funds-plow-money-into.html",
      "Content": "Funds Plow Money Into AppLovin, Broadcom, Google — And This Top 100 Stock\n\nMATTHEW GALGANI\nWed, December 31, 2025 at 11:45 AM PST 2 min read\n\nIn this article: AEIS\n\nAVGO\n\nAPP\n\nGOOG\n\nOne of the best stocks of 2025 and in demand among the best mutual funds, Advanced Energy looks to power a new breakout.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "01:36:00",
      "Source": "Barchart",
      "Title": "Nvidia Could Buy AI21 Next. What Does That Mean for NVDA Stock?",
      "URL": "https://finance.yahoo.com/m/a09c1428-dee8-364b-9f6d-d35a9f04419f/nvidia-could-buy-ai21-next..html",
      "Content": "Nvidia Could Buy AI21 Next. What Does That Mean for NVDA Stock?\n\nPathikrit Bose\nWed, December 31, 2025 at 9:36 AM PST 4 min read\n\nIn this article: NVDA\n\nGOOG\n\nAVGO\n\nAfter establishing its dominance in the GPU space with its cadence of chips over the years, chip giant and the world's most valuable company by market cap, Nvidia (NVDA), is slowly making a strategic shift. Following the emergence of Google's (GOOG) (GOOGL) TPU chips in a big way, Nvidia's hegemonic reign at the top of the chip industry was suddenly put into question. However, the Jensen Huang-led company is not doing nothing about it, with the company increasingly turning attention towards the enterprise side and catering to their specific applications. Basically, Nvidia is looking to make a serious splash in the domain of ASICs, in which Broadcom (AVGO) is the biggest player.\n\nRoutine Earnings Beat in Q3 In Q3 2025, Nvidia surpassed its revenue and earnings estimates again. Moreover, both metrics grew at a pace of greater than 50% again in the quarter.\nMore News from Barchart Dear UiPath Stock Fans, Mark Your Calendars for January 2\nHow to Buy PYPL for a 29% Discount, or Achieve a 7% Annual Return\nApple is an Analyst Favorite, But AAPL Stock Has Been Flat - Shorting Puts Is the Best Play\nGet exclusive insights with the FREE Barchart Brief newsletter. Subscribe now for quick, incisive midday market analysis you won't find anywhere else.\n\nWhile the revenues of $57.1 billion for the quarter represented an annual growth rate of 62%, earnings went up by 60% in the same period to $1.30 (vs. the consensus estimate of $1.26). Core data center revenues continued on their sharp upward trajectory in this quarter as well, rising by 66% on an annual basis to $51.2 billion.\nMeanwhile, what helps Nvidia in carrying out these valuable acquisitions is its cash flow prowess, which again witnessed a strong showing in Q3. Net cash from operating activities increased to $23.8 billion from $17.6 billion in the previous year as free cash flow moved higher at an even sharper tick of 65% in the same period to $22.1 billion. Overall, Nvidia closed the quarter with a cash balance of $60.6 billion, with short-term debt of just under a billion on its books. In fact, the cash balance was more than eight times higher than its long-term debt levels of $7.5 billion.\nFor Q4, the company expects revenue to be $65 billion, which would denote an annual growth of 65.4%.\nMeanwhile, despite its stark outperformance over the years, the NVDA stock is up over 40% this year.\nWill AI21 Labs Be an A1 Purchase for Nvidia? Armed with those solid financials, Nvidia is going down a familiar route to gain prominence in a relatively unfamiliar space for the company: acquisitions. While the $20 billion deal to purchase AI startup Groq is hailed as a significant signal of intent from the company to strengthen its footing in inference. Recent reports have emerged that it is looking to buy another AI startup based out of Israel, AI21 Labs.\n\nStory Continues\nA developer of large language models (LLMs), AI21 Labs builds custom generative AI applications for enterprises. Along with Google, Nvidia has also been an investor in the company, which had a purported valuation of $1.4 billion following its latest fundraising round in 2023. Notably, the firm today positions itself as a builder of “frontier” models and enterprise AI stacks rather than a pure consumer app shop, emphasizing secure, customizable on-prem/cloud deployments for customers in regulated industries and ISV partners.\n\nAI21’s product set includes the Jurassic family of LLMs (e.g., Jurassic-1, Jurassic-2), developer APIs (AI21 Studio/Task APIs), user-facing writing tools such as Wordtune, and more recently enterprise orchestration and “AI systems” like Maestro and Jamba that claim to reduce hallucinations and improve long-context performance for document-centric workflows; the company touts architectural work on long-context, task-specific models and tooling for knowledge grounding and retrieval, which it uses to sell higher-margin enterprise deployments. That technical focus gives AI21 a mix of IP in model architecture, inference optimization, and data-centric tooling that appeals to customers who need accuracy, privacy controls, and vertical integration.\n\nSo, how will it help Nvidia?\nWell, for starters, Nvidia will gain access to AI21’s ~200 research engineers with deep LLM and inference expertise, a scarce and strategically attractive commodity for Nvidia’s expanded AI-software push and planned Israeli campus. Further, AI21’s stack for long-context, low-hallucination enterprise inference complements Nvidia’s hardware+software strategy (GPUs + CUDA + Triton) and could accelerate Nvidia’s push into higher-value, software-driven services. Finally, AI21’s direct enterprise contracts and tooling offer a route for Nvidia to monetize more than silicon by selling vertically integrated AI systems. Those three drivers explain why a premium north of AI21’s last public valuation ($1.4 billion) could be defensible to Nvidia.\n\nThus, buying AI21 would accelerate Nvidia’s software/service monetization and deepen its Israel R&D footprint. However, Nvidia should be mindful of the potential integration risks for AI21’s inference stack into its software ecosystem (Triton, TensorRT, NeMo).\nAnalyst Opinion on NVDA Stock Thus, analysts have deemed the stock to be a consensus “Strong Buy,” with a mean target price of $256. This indicates an upside potential of about 36.5% from current levels. Out of 48 analysts covering the stock, 44 have a “Strong Buy” rating, two have a “Moderate Buy” rating, one has a “Hold” rating, and one has a “Strong Sell” rating.\nOn the date of publication, Pathikrit Bose did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "22:51:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Has Barely Budged Since the End of July. What Gets It Going Again.",
      "URL": "https://finance.yahoo.com/m/586cab0b-f177-3383-83f7-a7f71f2dd3c2/nvidia-stock-has-barely.html",
      "Content": "Nvidia Stock Has Barely Budged Since the End of July. What Gets It Going Again.\n\nAdam Clark\nWed, December 31, 2025 at 6:51 AM PST 2 min read\n\nIn this article: NVDA\n\nAMD\n\nAVGO\n\nTSM\n\nTSMWF\n\nNvidia shares are drifting but reports of strong demand for its artificial-intelligence processors in China could point the way to future gains.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "22:12:32",
      "Source": "Argus Research",
      "Title": "Daily Spotlight: Bull Market Set for 2026",
      "URL": "https://finance.yahoo.com/m/c94ab6af-b922-3170-95ed-a8ff6b284f5b/daily-spotlight%3A-bull-market.html",
      "Content": "Daily Spotlight: Bull Market Set for 2026\n\nArgus Research\nWed, December 31, 2025 at 6:12 AM PST 1 min read\n\nIn this article: ^GSPC\n\nAVGO\n\nThe current bull market started on October 12, 2022, and is now more than three years old. During that time, the S&P 500 has risen more than 90%, having endured high inflation, economic uncertainty, a credit rating downgrade of the U.S. Treasury, a hard-fought political election, the onset of tariffs and trade wars, and a government shutdown. Indeed, stocks have been supported by an economy that continues to grow, inflation and interest rates that have been heading lower, and robust profitability from S&P 500 companies. How much farther can this bull market go? We have studied the 13 bull markets that have occurred since the end of World War II. On average, the S&P 500 gained 164% during these 13 periods, which averaged 57 months in duration, or just about five years. We also note that the recent bull markets have generated higher returns over longer periods of time. On average, the five bull markets since 1980 have seen stocks advance about 240% over a period of almost six years. And the bull market prior to the pandemic carried on for 11 years, during which stocks rose 500%. It is worth pointing out, though, that the 2009-2020 bull market began with stocks deeply depressed on valuation, whereas stocks are already near fair value in the current market environment. Even so, if rates continue to head lower on mild inflation news, earnings growth accelerates, and the economy can continue to avoid a recession, then the current bull market, driven by disruptive innovation from the Information Technology sector, may have more room to run. Our 12-month target price for the S&P 500 in 2026 is 7500.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "21:08:23",
      "Source": "Insider Monkey",
      "Title": "Bristol Gate US Equity Strategy: NVDA’s Demand Today is Broadcom’s (AVGO) Opportunity Tomorrow",
      "URL": "https://finance.yahoo.com/news/bristol-gate-us-equity-strategy-130823220.html",
      "Content": "Bristol Gate US Equity Strategy: NVDA’s Demand Today is Broadcom’s (AVGO) Opportunity Tomorrow\n\nSoumya Eswaran\nWed, December 31, 2025 at 5:08 AM PST 3 min read\n\nIn this article: AVGO\n\n^GSPC\n\nNVDA\n\nBristol Gate Capital Partners , an investment management company, published its Q3 2025 investor letter for the “US Equity Strategy”. A copy of the letter can be downloaded here . The strategy underperformed the benchmark, the S&P 500® Total Return Index, this quarter, but still surpassed the index in dividend growth. The underperformance was due to a lack of significant exposure to the AI/TMT sector or the Value sector, which provides advantages stemming from the Federal Reserve's rate cut. The portfolio returned 15% dividend growth over the trailing 12 months, driven by the strong underlying fundamentals. In addition, please check the fund’s top five holdings to know its best picks in 2025.\n\nIn its third-quarter 2025 investor letter, Bristol Gate US Equity Strategy highlighted stocks such as Broadcom Inc. (NASDAQ: AVGO ). Broadcom Inc. (NASDAQ:AVGO) is a leading technology company that designs and develops various semiconductor and infrastructure software solutions. The one-month return of Broadcom Inc. (NASDAQ:AVGO) was -8.31%, and its shares gained 50.90% of their value over the last 52 weeks. On December 30, 2025, Broadcom Inc. (NASDAQ:AVGO) stock closed at $349.85 per share, with a market capitalization of $1.659 trillion.\nBristol Gate US Equity Strategy stated the following regarding Broadcom Inc. (NASDAQ:AVGO) in its third quarter 2025 investor letter:\nBroadcom Inc. (NASDAQ:AVGO) is in the 12th position on our list of 30 Most Popular Stocks Among Hedge Funds . As per our database, 183 hedge fund portfolios held Broadcom Inc. (NASDAQ:AVGO) at the end of the third quarter, which was 156 in the previous quarter. In the fiscal third quarter of 2025, Broadcom Inc. (NASDAQ:AVGO) reported record revenue of $16 billion, up 22% year-over-year. While we acknowledge the potential of Broadcom Inc. (NASDAQ:AVGO) as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\n\nStory continues\nIn another article , we covered Broadcom Inc. (NASDAQ:AVGO) and shared the list of best AI stocks to buy according to analysts. In addition, please check out our hedge fund investor letters Q3 2025 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "21:06:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Is Drifting. This Could Get It Going Again.",
      "URL": "https://finance.yahoo.com/m/586cab0b-f177-3383-83f7-a7f71f2dd3c2/nvidia-stock-is-drifting..html",
      "Content": "Nvidia Stock Is Drifting. This Could Get It Going Again.\n\nAdam Clark\nWed, December 31, 2025 at 5:06 AM PST 2 min read\n\nIn this article: NVDA\n\nAMD\n\nAVGO\n\nTSM\n\nTSMWF\n\nNvidia shares are drifting but reports of strong demand for its artificial-intelligence processors in China could point the way to future gains.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "19:33:01",
      "Source": "Argus Research",
      "Title": "Daily – Vickers Top Buyers & Sellers for 12/31/2025",
      "URL": "https://finance.yahoo.com/m/af00d4c5-ac90-3665-8aed-14502d8d952f/daily-%E2%80%93-vickers-top-buyers-%26.html",
      "Content": "Daily – Vickers Top Buyers & Sellers for 12/31/2025\n\nArgus Research\nWed, December 31, 2025 at 3:33 AM PST\n\nIn this article: AVO\n\nIMNM\n\nAISP\n\nAVGO\n\nCOGT\n\nThe Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "18:30:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Is in a Rut. This Could Get It Going Again.",
      "URL": "https://finance.yahoo.com/m/586cab0b-f177-3383-83f7-a7f71f2dd3c2/nvidia-stock-is-in-a-rut..html",
      "Content": "Nvidia Stock Is in a Rut. This Could Get It Going Again.\n\nAdam Clark\nWed, December 31, 2025 at 2:30 AM PST 2 min read\n\nIn this article: NVDA\n\nAMD\n\nAVGO\n\nTSM\n\nTSMWF\n\nNvidia shares are drifting but reports of strong demand for its artificial-intelligence processors in China could point the way to future gains.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "15:15:00",
      "Source": "Barrons.com",
      "Title": "This Money Pro Sees Higher Stock Prices and More Rate Cuts in 2026",
      "URL": "https://finance.yahoo.com/m/15115e36-0baf-3875-84c5-0ec859bf2bb3/this-money-pro-sees-higher.html",
      "Content": "This Money Pro Sees Higher Stock Prices and More Rate Cuts in 2026\n\nAbby Schultz\nTue, December 30, 2025 at 11:15 PM PST 7 min read\n\nIn this article: ^GSPC\n\nORCL\n\nAVGO\n\nCRWV\n\nGOOG\n\nNancy Curtin, chief investment officer at A1Ti Tiedemann Global, helps wealthy families invest for the long term. An “innovation” bull market helps.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "14:00:00",
      "Source": "Barrons.com",
      "Title": "Even Permabears Have Portfolios. Where Jeremy Grantham Sees Value Now.",
      "URL": "https://finance.yahoo.com/m/d93781f7-95dd-30ef-b538-61ee25130da0/even-permabears-have.html",
      "Content": "Even Permabears Have Portfolios. Where Jeremy Grantham Sees Value Now.\n\nLauren R. Rublin\nTue, December 30, 2025 at 10:00 PM PST 5 min read\n\nIn this article: AVGO\n\nGOOG\n\nQLTY\n\nMSFT\n\nJeremy Grantham was born toward the tail end of the Great Depression, but has surfed plenty of subsequent booms and busts in his storied investment career. Barron’s spoke with Grantham, co-founder of Boston-based GMO, on Dec. 23 about the current stock market boom, his favorite investments, and the economic challenges that lie ahead. What is your stock market forecast for 2026?\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "07:00:04",
      "Source": "The Wall Street Journal",
      "Title": "Wall Street Overcame This Year's Slowdown Predictions",
      "URL": "https://finance.yahoo.com/m/4ff2ff7e-0d3a-34c7-92b4-77338c038037/wall-street-overcame-this.html",
      "Content": "Wall Street Overcame This Year's Slowdown Predictions\n\nDavid Uberti\nTue, December 30, 2025 at 3:00 PM PST 1 min read\n\nIn this article: NVDA\n\nAVGO\n\nGOOG\n\nPLTR\n\nMU\n\nThe 2025 slowdown foreseen by many on Wall Street never materialized in full. Tariff exemptions and a slew of trade deals have limited the inflationary effects of the highest import taxes in decades. And an artificial-intelligence arms race has triggered a capital-spending boom, propelling growth, minting millionaires—and leaving the U.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "05:54:00",
      "Source": "The Wall Street Journal",
      "Title": "U.S. Stocks Defy ‘Sell America’ Warnings and Are Ending 2025 Near Record Highs",
      "URL": "https://finance.yahoo.com/m/c583ffa2-a670-30a0-a641-1553afe4de48/u.s.-stocks-defy-%E2%80%98sell.html",
      "Content": "U.S. Stocks Defy ‘Sell America’ Warnings and Are Ending 2025 Near Record Highs\n\nDavid Uberti\nTue, December 30, 2025 at 1:54 PM PST 5 min read\n\nIn this article: AMD\n\nPLTR\n\nAVGO\n\nGOOG\n\n^GSPC\n\nTrump’s tariff policies didn’t raise prices as much as feared, while an AI arms race powered growth—and the shares of the largest tech companies.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "02:31:52",
      "Source": "Yahoo Finance",
      "Title": "Investors should beware of AI's circular financing trap, look for alternatives like Broadcom",
      "URL": "https://finance.yahoo.com/news/investors-should-beware-of-ais-circular-financing-trap-look-for-alternatives-like-broadcom-183152653.html",
      "Content": "Investors should beware of AI's circular financing trap, look for alternatives like Broadcom\n\nFrancisco Velasquez\nTue, December 30, 2025 at 10:31 AM PST 3 min read\n\nIn this article: AVGO\n\nNVDA\n\n^GSPC\n\nOPAI.PVT\n\nCVX\n\nThe AI gold rush has investors cautious that the industry may be feeding itself through a risky cycle of circular financing.\n\"I would be cautious on the financing aspect of OpenAI, the circular financing,\" Miramar Capital co-founder Max Wasserman told Yahoo Finance's Opening Bid . \"Given the concentration, you need to diversify the portfolio, and you need to understand what you own and what happens if you're wrong.\"\n\nHe added that if the AI trade \"goes south, it's going to take the indices with it.\"\nAn example of this cycle is where Big Tech titans invest billions into AI startups, which then use that money to buy cloud services or hardware from said investor. For instance, OpenAI ( OPAI.PVT ), Yahoo Finance's 2025 Company of the Year , committed to buying 10 gigawatts of Nvidia's ( NVDA ) chips, while Nvidia intends to invest up to $100 billion into the startup.\nWasserman warned that these deals could mask cash burn. \"The stock market valuations are still elevated, given the AI trade, which skews market indices and ignores many inherent risks of the market,\" he added.\nMoreover, as the economy shows signs of cooling, with manufacturing activity dropping and layoffs beginning to tick upward, AI valuations have increasingly veered away from fundamental business reality.\n\n\"I don't think you're going to get these double-, triple-digit returns like you have,\" Wasserman warned. \"I think you have to go to other parts of the market.\"\nFor investors looking to stay in the chip space , Broadcom ( AVGO ) offers a more grounded option.\nUnlike many AI darlings that rely on speculative future software revenue, Broadcom has built a defensive moat through hardware specialization and high-margin integration.\nThis strategy has paid off. Shares are up roughly 51% year to date, significantly outperforming the S&P 500's ( ^GSPC ) 17% gain.\n\nWasserman argued that Broadcom \"is a little misunderstood\" and that its value proposition differs from AI names like Nvidia in three key areas: VMware integration, specialized silicon via custom chips, and consistent dividend discipline.\n\"I think their growth rate and the ownership has been tremendous,\" he said. \"But again, we've been trimming this position because it grew to so much in our accounts.\"\nWasserman forecasts a 2026 shift involving a \"broadening\" of the market. As the Federal Reserve likely cuts interest rates to combat slowing growth, the \"other 493\" stocks in the S&P 500 may finally get their day in the sun.\n\nStory Continues\nThat rotation likely leads back to \"boring\" but reliable cash generators. Retailers and consumer staples like Home Depot ( HD ) and McDonald's ( MCD ) are expected to benefit from lower short-term rates.\nMeanwhile, defensive heavyweights like Chevron ( CVX ), AbbVie ( ABBV ), and Waste Management ( WM ) offer a sanctuary of dividends if the AI bubble begins to leak — or pops, in a worst-case scenario.\nUltimately, investors don't necessarily need to bet against AI, but they should certainly stop betting their entire portfolio on it. \"We continue to caution investors not to become too concentrated in technology,\" Wasserman said.\nFrancisco Velasquez is a Reporter at Yahoo Finance. Follow him on LinkedIn , X , and Instagram . Story tips? Email him at francisco.velasquez@yahooinc.com.\nClick here for the latest technology news that will impact the stock market\nRead the latest financial and business news from Yahoo Finance\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "23:14:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock and the Bright Side of the Groq Deal",
      "URL": "https://finance.yahoo.com/m/a84f7af6-04aa-3bb9-8440-10aa23d41301/nvidia-stock-and-the-bright.html",
      "Content": "Nvidia Stock and the Bright Side of the Groq Deal\n\nAdam Clark\nTue, December 30, 2025 at 7:14 AM PST 2 min read\n\nIn this article: NVDA\n\nAMD\n\nAVGO\n\nGROQ.PVT\n\nNvidia is paying $20 billion for Groq’s technology, including compensation packages for many of the company’s employees who will join Nvidia, The Wall Street Journal reported.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "21:24:00",
      "Source": "MarketBeat",
      "Title": "The Lazy Way to Play NVIDIA’s $20B Groq Deal",
      "URL": "https://finance.yahoo.com/m/05f1a08f-a398-30cc-8b3c-ac263b53534a/the-lazy-way-to-play-nvidia%E2%80%99s.html",
      "Content": "The Lazy Way to Play NVIDIA’s $20B Groq Deal\n\nJeffrey Neal Johnson, MarketBeat\nTue, December 30, 2025 at 5:24 AM PST 6 min read\n\nIn this article: NVDA\n\nSMH\n\nSOXX\n\nAVGO\n\nMU\n\nKey Points The shift from training to inference represents a permanent industrial evolution that solidifies the long term growth trajectory of the chip sector.\nInvestors looking for maximum exposure to the industry leader can use concentrated funds to capitalize on the benefits of a winner-takes-most market.\nDiversified exchange traded funds offer a strategic way to capture the broader rally in memory and networking hardware without relying on a single company.\nInterested in iShares Semiconductor ETF? Here are five stocks we like better.\n\nThe financial world shook in late December 2025 when NVIDIA (NASDAQ: NVDA) announced a strategic move to lock down Groq’s assets and leadership in a deal valued at approximately $20 billion. For Wall Street, this confirms that the artificial intelligence (AI) boom is evolving from a speculative frenzy into a permanent industrial shift.\nWhen a massive acquisition occurs, the target company's stock price often soars, offering quick gains for shareholders who bought early. But in this case, the door was locked, as Groq is not publicly traded. Retail investors cannot purchase shares of Groq directly on the public exchange, creating frustration for those who sought to capitalize on the deal.\n→ Broadcom's Insider Selling: A Big Red Flag, or Business as Usual?\n\nThe only liquid way to capture the value of this deal is through the acquirer, NVIDIA. Yet, betting everything on a single stock carries significant risk, especially with antitrust regulators in the United States and Europe watching the semiconductor sector closely. A blocked deal could send the NVDA stock tumbling.\nThis scenario creates the perfect storm for semiconductor Exchange Traded Funds (ETFs). These funds offer a backdoor entry into the trade, allowing investors to participate in the upside without the stress of managing a single stock ticker. However, not all ETFs are built the same. Understanding the structural differences between ETF strategies like the VanEck Semiconductor ETF (NASDAQ: SMH) and the iShares Semiconductor ETF (NASDAQ: SOXX) is critical to portfolio positioning in 2026.\n\n→ Netflix Is Out of Favor—and That’s Why It’s Getting Interesting\nThe Winner Takes Most Strategy To understand why the VanEck Semiconductor ETF (SMH) is the aggressive choice, investors must first understand the business case behind the merger.\nFor the last two years, the market has focused on Training AI, building the massive digital brains behind chatbots and data models.\n→ Verizon: Out of the Doghouse and Into Your Dividend Portfolio\nThe Groq deal signals a shift to Inference, which is the actual usage of those models to generate instant answers. Groq’s technology acts as a turbocharger for this specific task.\n\nStory Continues\nBy absorbing this technology, NVIDIA cements its dominance in the next phase of the AI cycle. SMH is structured to reward this kind of dominance because it uses a market-cap-weighted system. This means the larger a company gets, the more influence it has on the fund's performance.\nThe Superweight Effect As of late December 2025, NVIDIA constitutes approximately 16% of the SMH fund. This is a significant concentration. For every $1,000 an investor puts into SMH, roughly $210 is a direct wager on the success of the NVIDIA-Groq integration. This lack of a cap is the primary reason SMH is up approximately 50% year-to-date. The fund managers effectively allowed the winner to run, rather than selling shares to rebalance the portfolio.\n\nThe Manufacturing Bonus The fund also offers a secondary benefit: the manufacturing angle. Groq’s high-speed chips require advanced packaging and fabrication to function. The primary beneficiary of this demand is Taiwan Semiconductor (NYSE: TSM), which makes up roughly 10% of SMH.\nBetween NVIDIA and TSMC, nearly 31% of the fund is tied directly to the hardware required for this new deal. For investors who believe the biggest companies will keep getting bigger, SMH serves as a high-octane proxy for the AI trade.\n\nThe Hedged Play: Broad Exposure for the Supercycle While SMH chases the leader, the iShares Semiconductor ETF (SOXX) takes a hedged approach. The key difference lies in its rulebook. SOXX utilizes a capped weighting scheme, meaning no single company is allowed to exceed roughly 8% of the portfolio during rebalancing.\nThis rule explains why SOXX has lagged its counterpart, returning approximately 42% year-to-date compared to SMH’s 50% gain. Even though SOXX holds NVIDIA, the fund is forced to sell shares when the stock rallies to keep the weight at roughly 8%.\n\nWhile this limits the upside during a parabolic rally, it offers significant protection against volatility.\nThe Memory Supercycle The bull case for SOXX relies on the idea that the AI rally will broaden beyond just one company in 2026. While headlines focus on NVIDIA’s processors, AI models require massive amounts of High Bandwidth Memory (HBM). A shortage in this sector has created a pricing supercycle for companies like Micron (NASDAQ: MU). Because a single stock does not dominate SOXX, it offers more equal weighting across these secondary winners.\n\nNetworking and Infrastructure SOXX also provides deeper exposure to Broadcom (NASDAQ: AVGO). As AI data centers grow, Broadcom's cabling and networking chips become essential. If the Department of Justice or international regulators decide to block the NVIDIA-Groq deal, NVIDIA stock could face high volatility or a sharp correction. In that scenario, the capped structure of SOXX acts as a safety net. It protects the investor from a single-stock crash while still capturing the broader sector rally led by memory and networking stocks.\n\nChoosing Your Strategy for 2026 The choice between these two funds ultimately comes down to an investor's risk tolerance and their view on the regulatory landscape for 2026. The 2025 market data provides a clear picture of where the smart money is currently moving.\nInvestors have favored the aggressive strategy this year. SMH saw net inflows of over $2 billion, while SOXX experienced net outflows of roughly $4.5 billion. This divergence suggests that institutional investors are currently willing to accept higher risk to chase the performance of the industry leaders.\n\nHowever, following the herd isn't always the right move for an individual portfolio. Here is a simple framework for deciding which fund fits your goals:\nScenario A: The Bullish Aggressor The Thesis: You believe NVIDIA will execute the Groq integration flawlessly and that Inference will be a winner-take-all market dominated by a single player.\nThe Pick: SMH. Its uncapped structure ensures you capture the maximum upside of the deal. You are comfortable with the risk that if NVIDIA sneezes, your portfolio catches a cold.\n\nScenario B: The Cautious Optimizer The Thesis: You believe the semiconductor sector will rise, but you worry about trade wars, tariffs, or antitrust lawsuits hitting the biggest players. You want to bet on the Industrial Revolution of AI, not just one company.\nThe Pick: SOXX. Its diversified, capped structure mitigates the risk of any single company failing, offering a smoother ride.\n\nPositioning for the Next Phase of Growth The $20 billion NVIDIA-Groq deal serves as a powerful validation that the semiconductor supercycle is far from over. The innovation engine driving the modern economy is still running hot, fueled by the rapid transition from building AI models to deploying them in the real world.\nFor investors, the most dangerous decision in 2026 may be having no exposure at all. Whether one chooses the concentrated aggression of SMH or the diversified safety of SOXX, the semiconductor sector remains a cornerstone of a modern growth portfolio. The technology is shifting, and the market is moving with it. By choosing the ETF that aligns with their risk tolerance, investors can ensure they are part of the next leg of the rally.\nThe article \" The Lazy Way to Play NVIDIA’s $20B Groq Deal \" was originally published by MarketBeat.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "20:54:28",
      "Source": "24/7 Wall St.",
      "Title": "3 ETFs Warren Buffett Is Quietly Keeping in His Secret Portfolio",
      "URL": "https://finance.yahoo.com/m/7bd4ff5d-7589-30b7-8947-226736e3b2d9/3-etfs-warren-buffett-is.html",
      "Content": "3 ETFs Warren Buffett Is Quietly Keeping in His Secret Portfolio\n\nOmor Ibne Ehsan\nTue, December 30, 2025 at 4:54 AM PST 5 min read\n\nIn this article: BRK.A\n\nAVGO\n\nBRK-B\n\n^GSPC\n\nIEFA\n\nQuick Read Berkshire Hathaway (BRK.B) owns New England Asset Management which holds ETFs in a separate portfolio. Berkshire increased IEFA holdings by 35% and IDEV by 30% in Q3.\nIEFA and IDEV target developed international markets excluding the US. Both outperformed the S&P 500 year-to-date with returns above 27%.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "20:45:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Gains. How Groq Can Help Defend Its AI Chip Dominance.",
      "URL": "https://finance.yahoo.com/m/a84f7af6-04aa-3bb9-8440-10aa23d41301/nvidia-stock-gains.-how-groq.html",
      "Content": "Nvidia Stock Gains. How Groq Can Help Defend Its AI Chip Dominance.\n\nAdam Clark\nTue, December 30, 2025 at 4:45 AM PST 2 min read\n\nIn this article: NVDA\n\nGROQ.PVT\n\nAMD\n\nAVGO\n\nNvidia is paying $20 billion for Groq’s technology, including compensation packages for many of the company’s key employees who will join Nvidia, The Wall Street Journal reported.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "16:56:10",
      "Source": "Bloomberg",
      "Title": "Korea Crushes Global Benchmarks With Best Stock Rally Since 1999",
      "URL": "https://finance.yahoo.com/news/korea-crushes-global-benchmarks-best-085610450.html",
      "Content": "Korea Crushes Global Benchmarks With Best Stock Rally Since 1999\n\nYoukyung Lee\nUpdated Tue, December 30, 2025 at 3:22 AM PST 4 min read\n\nIn this article: 278470.KS\n\nSSNLF\n\n000660.KS\n\n267260.KS\n\n090430.KS\n\n(Bloomberg) — South Korea’s stock market renaissance in 2025 was one for the history books. Buoyed by world-beating gains in arms exporters to eye-popping surge in AI and K-beauty shares, the market just capped its strongest advance in a quarter century.\nThe Kospi ( ^KS11 ) Index has soared 76% this year, compared with the S&P 500’s 17% advance so far and MSCI Asia Pacific Index’s 25% gain. The Korean benchmark’s performance, the best among major equity gauges, has been helped by chip heavyweights Samsung Electronics Co. and SK Hynix Inc. as well as defense and nuclear firms.\n\nMost Read from Bloomberg\nLondon’s Love of Wood-Burning Stoves Sparks a Pollution Debate\nAnalysts see further upside ahead, with Citigroup Inc., JPMorgan Chase & Co. and Nomura Holdings Inc. among brokers forecasting at least another 20% climb next year. Strong earnings growth should bolster that upward trajectory, analysts add.\nHere is a recap of the winners and losers from the market in 2025.\nAI Proxy Trades The biggest artificial intelligence winners weren’t conventional chipmakers or large-cap names but proxy plays. That includes power transformer maker Hyosung Heavy Industries Corp. and nuclear power provider Doosan Enerbility Co., which saw shares up more than 320% each this year, according to Korea Exchange prices.\n\nDespite their high valuations, bulls argue that there’s no quick carbon-free alternative to meet surging power demand of AI data centers, making these players indispensable.\nInvestor interest in power grid and infrastructure stocks should continue into 2026, according to Morgan Stanley analysts. Among them, HD Hyundai Electric Co. is entering “a multi-decade re-rating as grid modernization, AI data center, and decarbonization converge,” they said.\nMemory Bulls Samsung and SK Hynix had a standout year, cementing their status as Kospi heavyweights and the world’s top manufacturers of memory chips. Thanks to growing demand from global tech giants for specialized, high-performance chips, Samsung has jumped 125% this year to an all-time high. SK Hynix rose about 270%.\n\nThe momentum has spilled over into related firms like SK Hynix’s parent SK Square Co. and Korea Circuit Co., which counts Broadcom Inc. as its customer. Both stocks are up more than 330% each.\n“Shortages in memory chips are unquestionably taking hold so I expect an extremely strong year for Korean semiconductor stocks,” said Kang DaeKwun, chief investment officer at Life Asset Management in Seoul.\nDefense Stars President Donald Trump’s reshaping of traditional security alliances spurred new defense spending across Europe and Asia this year, driving renewed interest in Korean contractors known for delivering weapons faster and at lower cost.\n\nStory Continues\nHanwha Aerospace Co., maker of the K9 self-propelled howitzer, emerged as one of the biggest winners, with shares up nearly 200% this year. Shipbuilder Hanwha Ocean Co. has jumped 204%.\nMust Asset Management says that given recent success by local companies making inroads in Europe, these firms will likely see more partnerships in coming years among NATO members.\n\nK-Beauty Leaders Less than two years after its IPO, APR Corp. has leapfrogged beauty giants Amorepacific Corp. and LG H&H Co. in market value. Up 362%, the Medicube maker and at-home beauty device leader topped stock gains in the MSCI Korea Index.\n“To me, APR’s outperformance isn’t just about better execution. It’s about playing a different game,” said Jung In Yun, chief executive officer at Fibonacci Asset Management Global in Singapore. “It sells outcomes and experiences through social-first channels, not just skincare through traditional retail.”\n\nLG H&H, the company behind The Whoo skincare brand, recorded a fifth consecutive year of stock declines, while Amorepacific has risen 14% this year. Investors say that expectations are high for APR to continue outperforming, though its high valuation makes the stock vulnerable to sharp swings if setbacks occur.\nLosing Games Despite Korea’s broad market rally, game developers were notably left behind. Krafton Inc., has lost about one-fifth of its market value while Com2uS Corp. shed more than one-third. Worries about their limited appeal in Asia and inability to compete with Chinese rivals have forced investors to look elsewhere.\n\nWith demand for Korean role-playing games constrained in Asia, the upside remains limited, according to Life Asset’s Kang.\nOther equity market loser standouts include electric vehicle supply chain companies hit by dwindling demand for EVs. Before Ford Motor Co. ended its partnership with one of Korea’s biggest battery makers, widening technological gaps with Chinese rivals had already weighed on the sector. Among the biggest losers is Enchem Co., which saw shares slump about 50%. Shares of SK Innovation Co., one of South Korea’s three main battery suppliers, ended the year in the red.\n(Updates with prices as of Tuesday close.)\nMost Read from Bloomberg Businessweek\nErasing the Verdict: The Ongoing Shock of Trump’s Cocaine Kingpin Pardon\nJapan’s Viral Horse-Racing Video Game Has Players Flocking to Real-Life Stables\nChina’s EV Battery Giant Is Trying to Find a New Road\nThat Time I Tried to Buy OpenAI\nThe United States of Klarna\n©2025 Bloomberg L.P.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "13:00:27",
      "Source": "Insider Monkey",
      "Title": "Broadcom Inc. (AVGO) up 51% YTD, Wall Street Still Sees 31% Upside",
      "URL": "https://finance.yahoo.com/news/broadcom-inc-avgo-51-ytd-050027389.html",
      "Content": "Broadcom Inc. (AVGO) up 51% YTD, Wall Street Still Sees 31% Upside\n\nTalha Qureshi\nMon, December 29, 2025 at 9:00 PM PST 2 min read\n\nIn this article: AVGO\n\nTFC\n\nBroadcom Inc. (NASDAQ: AVGO ) is among the Stocks That Will Make You Rich in 2026 . Broadcom Inc. (NASDAQ:AVGO) has gained more than 51% year-to-date, and Wall Street still sees around 31% upside from the current levels.\nRecently, on December 19, William Stein from Truist Financial reiterated a Buy rating on the stock with a $329.88 price target. Earlier on December 15, Timothy Arcuri of UBS also reiterated a Buy rating on the stock and raised the price target from $472 to $475.\nAnalysts at Truist noted that they adjusted the price target after establishing 2027 estimates for the semiconductor and AI sector. The firm sees the AI infrastructure companies as cheaply valued, considering the growth potential. Truist acknowledged that the AI industry is faced with the challenge of power resources and the investment to build the power infrastructure. However, regardless, the analysts see a rise in AI expenditure in 2026 and more upside for companies like Broadcom Inc. (NASDAQ:AVGO) compared to the diversified semiconductor group.\n\nOn the other hand, UBS expects the company to exceed the $60 billion revenue target in 2026, reflecting a threefold year-over-year increase. The firm noted that this is mainly due to the 50% quarter-over-quarter increase in the company’s backlog during Q4. Its backlog stood at $73 billion, which is expected to be shipped in the next 12-months rather than 18 months.\n​Broadcom Inc. (NASDAQ:AVGO) designs, develops, and supplies various semiconductor devices and infrastructure software solutions worldwide. The company operates in two segments: Semiconductor Solutions and Infrastructure Software.\nWhile we acknowledge the potential of AVGO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "04:20:48",
      "Source": "Motley Fool",
      "Title": "Why One Fund Ditched Viper Energy in a $12 Million Exit Amid a 20% Stock Slide",
      "URL": "https://finance.yahoo.com/m/768da0a6-deef-3ef7-8b03-4d1149ccd56f/why-one-fund-ditched-viper.html",
      "Content": "Why One Fund Ditched Viper Energy in a $12 Million Exit Amid a 20% Stock Slide\n\nJonathan Ponciano, The Motley Fool\nMon, December 29, 2025 at 12:20 PM PST 4 min read\n\nIn this article: AVGO\n\nAAPL\n\nKey Points Michigan-based Nemes Rush Group sold 319,503 shares of Viper Energy in the third quarter.\nThe position was worth an estimated $12.18 million as of the previous period.\nThe move marked an exit for Nemes Rush, which reported holding no VNOM shares as of September 30.\nThese 10 stocks could mint the next wave of millionaires ›\n\nOn November 13, Michigan-based Nemes Rush Group disclosed it sold out its entire position in Viper Energy (NASDAQ:VNOM) , reducing holdings by 319,503 shares worth an estimated $12.18 million.\nWhat Happened According to a Securities and Exchange Commission (SEC) filing dated November 13, Nemes Rush Group sold all 319,503 shares of Viper Energy (NASDAQ:VNOM) during the third quarter. The estimated transaction value was approximately $12.18 million based on average quarterly pricing.\nWhat Else to Know The fund's VNOM stake previously comprised 1.33% of reportable AUM.\nTop holdings after the filing:\nNASDAQ:AVGO: $55.44 million (5.5% of AUM)\nNASDAQ:AAPL: $52.14 million (5.2% of AUM)\nNASDAQ:MSFT: $42.41 million (4.2% of AUM)\nNASDAQ:GOOGL: $38.28 million (3.8% of AUM)\nNASDAQ:NVDA: $37.42 million (3.7% of AUM)\n\nAs of Monday, Viper Energy shares were priced at $38.48, down 20% over the past year and well underperforming the S&P 500, which is instead up about 15.5% in the same period.\nCompany Overview Metric\nValue\nRevenue (TTM)\n$1.19 billion\nNet income (TTM)\n$243.66 million\nDividend yield\n5.5%\nPrice (as of Monday)\n$38.48\n\nCompany Snapshot Viper Energy owns and manages mineral interests in oil and natural gas properties, primarily in the Permian Basin and Eagle Ford Shale\nThe company generates revenue from royalties on hydrocarbon production\nIt operates as a subsidiary of Diamondback Energy\nViper Energy focuses on acquiring and managing mineral rights in key U.S. oil and gas basins, enabling participation in upstream production economics while minimizing capital expenditures and operational risks. The company’s business model is based on collecting royalties from operators extracting oil and gas on its acreage.\n\nFoolish Take What makes this exit worth watching is not the size of the sale but what it signals about investor tolerance for volatility in income-focused energy plays. Viper Energy is not a growth stock -- it’s a royalty business designed to convert commodity exposure into cash flow, dividends, and buybacks. That model has worked operationally, but the share price recently has not worked out so well.\n\nIn the third quarter, Viper produced more than 108,000 barrels of oil equivalent per day and generated $165 million in pro forma cash available for distribution. It returned 85% of that cash to shareholders through a $0.58 combined base and variable dividend and $90 million in buybacks. That translated into an annualized yield north of 6% at recent prices. At the same time, reported results showed a net loss driven by non-cash impairment charges tied to asset transfers, not underlying operating weakness.\n\nFor a diversified fund, trimming or fully exiting a sub 2% position after a sharp drawdown can be a portfolio hygiene move rather than a fundamental call, and that may be what long-term investors should most keep in mind here.\n\nStory Continues\nGlossary Assets under management (AUM): The total market value of investments managed by a fund or investment firm.\n13F reportable assets: Securities that institutional investment managers must disclose quarterly to the SEC if over a certain threshold.\nLiquidated: Sold off an entire investment position, reducing holdings to zero.\n\nDividend yield: Annual dividends paid by a company divided by its share price, shown as a percentage.\nTrailing twelve months (TTM): Financial data covering the most recent 12 consecutive months.\nMineral interests: Ownership rights to minerals (like oil or gas) beneath land, often generating royalties.\nRoyalties: Payments made to mineral rights owners based on production or revenue from resource extraction.\nUpstream production: The exploration and extraction phase of oil and gas operations, before refining or distribution.\nCapital expenditures: Funds used by a company to acquire or upgrade physical assets such as property or equipment.\nOperational risks: Potential losses resulting from failed internal processes, systems, or external events.\nDon’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $494,182 !*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $52,012 !*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $509,470 !*\nRight now, we’re issuing “Double Down” alerts for three incredible companies , available when you join Stock Advisor , and there may not be another chance like this anytime soon.\nSee the 3 stocks »\n*Stock Advisor returns as of December 29, 2025\nJonathan Ponciano has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Apple, Microsoft, and Nvidia. The Motley Fool recommends Broadcom and Viper Energy and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nWhy One Fund Ditched Viper Energy in a $12 Million Exit Amid a 20% Stock Slide was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "03:30:00",
      "Source": "Yahoo Finance Video",
      "Title": "AI chipmakers that could steal some of Nvidia's spotlight in 2026",
      "URL": "https://finance.yahoo.com/video/ai-chipmakers-could-steal-nvidias-193000972.html",
      "Content": "AI chipmakers that could steal some of Nvidia's spotlight in 2026\n\nYahoo Finance Video and Jared Blikre\nMon, December 29, 2025 at 11:30 AM PST\n\nIn this video: NVDA\n\nAMD\n\nAVGO\n\nARM\n\nNvidia ( NVDA ) announced a deal to acquire AI hardware and software designer Groq ( GROQ.PVT ) for $20 billion last week. While the semiconductor manufacturer remained a major AI player in 2025, who could be some of Nvida's biggest competition in the fast-approaching 2026?\nTECHnalysis Research, LLC President Bob O'Donnell sits down with Yahoo Finance markets and data editor Jared Blikre on Market Catalysts to discuss which chipmaker could gain more prominence next year.\nAlso catch Bob O'Donnell's predictions for agentic AI in 2026 as it relates to cybersecurity usage.\nTo watch more expert insights and analysis on the latest market action, check out more Market Catalysts .\n\nVideo Transcript\n\n00:00 Jared\nAnd another thing people have been uh some of the critics have been pouuncing on is all the spending, the capital expenditures, so-called CAPEX. Uh we saw that it's been exploding over the last few years. It's set to continue next year. But uh we've seen in the Mag 5, for instance, we used to kind of talk about them or the Mag 7 uh as a whole. It's really only Alphabet and Nvidia, maybe Tesla as a come behind story that have really surged this year. So is it a game of have and have nots or how do you see this playing out?\n00:32 Bob\nNo, it's a great question. I mean, look, I think Nvidia obviously continues to do well, but I also am certain that Nvidia is going to heck get a heck of a lot more competition in 2026. AMD is, you know, an obvious one, but there's a lot of other little players. I mean, you know, Nvidia's uh deal with Grock recently to bring more of their technology in is a reflection of the fact that we're seeing more specialized types of models being developed. We're we're going from the days of big general purpose LLMs that you can use for everything to much more specialized areas. And each of those are going to require different types of hardware and I think in turn that's going to create additional opportunities, but it's going to create more diversity, which is going to be a little harder to figure out. But obviously I think, you know, you're going to continue to see folks like Nvidia and AMD do well. I do, as I said, I think you're going to start to see uh some of the smaller the cloud guys who are doing custom chips often through Broadcom will also start to benefit. We've seen already, you know, Google's been doing more with TPUs, uh Amazon has their Graviton chips. Um, we've got a a bunch of other companies. Microsoft is doing custom chips. A lot of these are arm-based. So arm is another company, you know, we haven't been talking about them a lot lately, but arm's helping drive some of this innovation. Intel, as you've talked about, you know, is doing well. They continue to plug away. Obviously, they had their challenges last year, but things are looking better in 2026. So, I think we're going to see a lot of different players uh from different areas uh all start to come together. And we'll see some smaller companies. Uh there's a little company called SiTime that does uh timing chips and all these networks have to be completely aligned from a timing perspective. They're doing some interesting stuff. So, I think there's a lot of different opportunities in different areas. Um but we're going to have a lot of the bears on the side just again, waiting to pounce on these oper these concerns that get raised, I think around a gentic AI.\n02:29 Jared\nAnd we'll have to see if those are dips worth buying or not. And Bob, what I'm realizing is we got to do another podcast real soon. So thank you for showing up.\n02:39 Bob\nYeah, man, I'd love to.\n02:40 Jared\nIt was great seeing you here.\n02:41 Bob\nThanks, Jared.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "03:15:00",
      "Source": "MarketBeat",
      "Title": "Why Q4 Earnings Season Could Be a Bullish Catalyst for S&P 500 Stocks",
      "URL": "https://finance.yahoo.com/m/894fe7e6-828c-327a-88f5-7feb39eabd35/why-q4-earnings-season-could.html",
      "Content": "Why Q4 Earnings Season Could Be a Bullish Catalyst for S&P 500 Stocks\n\nThomas Hughes, MarketBeat\nMon, December 29, 2025 at 11:15 AM PST 4 min read\n\nIn this article: ^GSPC\n\nORCL\n\nXLP\n\nXLI\n\nXLU\n\nKey Points The Q4 earnings reporting cycle is at hand, and investors should expect significant outperformance relative to the 2025 year-end consensus.\nAI underpins the expected strength, but so too does economic health and consumer spending.\nThe S&P 500 is poised to reach 7,400 by early 2026 and then continue trending higher through the end of the year.\nInterested in SPDR S&P 500 ETF Trust? Here are five stocks we like better.\n\nThe Q1 2026 earnings reporting season—when most companies deliver Q4 2025 results—is shaping up to be a bullish catalyst for the S&P 500.\nUncertainty and concerns, bricks in the Wall of Worry, kept analysts from lifting their estimates in late 2025, despite the many strengths revealed in Q3 that were setting the index up to outperform. As of year-end, the consensus estimate is rising but remains well below where the tally will likely be at the end of the period.\n→ Broadcom's Insider Selling: A Big Red Flag, or Business as Usual?\nThe S&P 500 tends to outperform its season-starting consensus by at least a few hundred basis points. The trend in 2025 is outperformance at the high end of the range, closer to 500 basis points, and the Q3 results were much stronger. The average S&P 500 company outperformed by 570 basis points, suggesting that Q4 results will top out in the 14% range, perhaps even higher.\nWith this in play, the bullish trends at the end of 2025, including an outlook for earnings growth, growth acceleration throughout 2026, and an uptrend in the all-index consensus forecast, will continue to lift stocks in 2026.\n→ Netflix Is Out of Favor—and That’s Why It’s Getting Interesting\nThe Market Rally Could Broaden Beyond Tech in Early 2026 While the Information Technology Sector (NYSEARCA: XLK) is expected to lead in growth and likely outperform its consensus, other sectors will contribute to market enthusiasm. Analysts have lifted the consensus forecast for technology, underpinning the quarterly index forecast, but lowered the bar for nearly all other sectors.\n\n→ 5 Stocks Set to Start Strong in January and Lead Through 2026\nCertain sectors are well-positioned to exceed their forecasts and provide optimistic guidance for the year, offering investors an alternative to technology and the AI trade. Investors can access these sectors through ETFs that track them, such as the Consumer Staples Select Sector SPDR Fund (NYSEARCA: XLP), Consumer Discretionary Select Sector SPDR Fund (NYSEARCA: XLY), Utilities Select Sector SPDR Fund (XLU), Industrial Select Sector SPDR Fund (NYSEARCA: XLI), and Health Care Select Sector SPDR Fund (NYSEARCA: XLV).\n\nStory Continues\nBut don’t discount the AI trade. AI will continue to underpin the technology sector’s revenue and earnings growth outlook, as well as those of other sectors. Businesses unable to monetize AI with their clients are using it to improve operational and business quality, thereby strengthening margins, earnings, and cash flow.\n\nNVIDIA (NASDAQ: NVDA) remains the tech sector leader and is expected to grow its revenue by more than 65% in Q1, while also widening its margin. Other anticipated tech winners include Microsoft (NASDAQ: MSFT), Broadcom (NASDAQ: AVGO), and Micron Technology (NASDAQ: MU), which are forecast to grow revenue by 25%, 27%, and over 100%, respectively, but it will be the guidance that matters most. Signs at the end of 2025 suggest that AI spending trends will remain robust, with demand for GPUs, the HBM memory that supports them, and AI computing capacity sold out.\nCapital Returns Could Reinforce the Bull Case Analyst outlook on share buybacks in 2026 varies but is generally bullish for stock prices. The consensus is for margin improvement and cash flow health to at least support buyback activity, if not lead to increases, and updates are expected during the Q1 reporting season.\nSectors best-positioned to issue increases include financials (expected to grow earnings by more than 6% in CQ4) and technology (which has significantly benefited from its AI-enhanced cash flow). Companies including NVIDIA, Advanced Micro Devices (NASDAQ: AMD), and Micron have seen their cash hoards grow, putting them in fortress-like positions to invest in growth, return capital, and sustain balance-sheet health.\n\nThe takeaway for investors is that the S&P 500 is in an uptrend and the Q1 2026 reports are unlikely to end it. The more likely scenario is that this index will continue moving higher, setting fresh highs in Q1 and later in the year. The 2025 price action suggests the April-to-October rally is only half the move, and another significant updraft is coming. Assuming the index outperforms as trends suggest and the outlook remains favorable, the S&P 500 could reach the 7,400 level before the end of Q1 2026 and then continue moving higher through the year’s end.\nThe article \" Why Q4 Earnings Season Could Be a Bullish Catalyst for S&P 500 Stocks \" was originally published by MarketBeat.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "01:43:00",
      "Source": "MarketBeat",
      "Title": "Broadcom's Insider Selling: A Big Red Flag, or Business as Usual?",
      "URL": "https://finance.yahoo.com/m/b15bd92b-7862-3705-a077-66431c605c29/broadcom%27s-insider-selling%3A-a.html",
      "Content": "Broadcom's Insider Selling: A Big Red Flag, or Business as Usual?\n\nLeo Miller, MarketBeat\nMon, December 29, 2025 at 9:43 AM PST 4 min read\n\nIn this article: AVGO\n\nKey Points Broadcom’s share price hit an all-time high on Dec. 10, but plummeted after its earnings report released the next day.\nLate-December insider selling looks worse than it is because many sales were “sell-to-cover” transactions tied to restricted stock unit vesting and tax withholding.\nCEO Hock Tan’s $42.4 million sale stands out, but filings indicate it was connected to an exchange fund diversification move, not a clear negative call on the business\nInterested in Broadcom Inc.? Here are five stocks we like better.\n\nRecent events have rattled investor confidence in semiconductor giant Broadcom (NASDAQ: AVGO). The company’s latest earnings release led to a dramatic sell-off.\nAfter reaching an all-time closing high of around $412 on Dec. 10, shares dropped as much as 21%, closing near $325 on Dec. 17. By the Dec. 26 close, the stock had recovered moderately to around $350.\n→ Broadcom's Insider Selling: A Big Red Flag, or Business as Usual?\nHowever, concerns linger around the company’s gross margins going forward, a dynamic that seems to be keeping a lid on Broadcom’s share price.\nAdding to the uncertainty is a burst of sales from Broadcom insiders in late December. At a time when Broadcom shareholders could use a boost in confidence, several Broadcom insiders are selling. Let’s break down these insider moves and gain clarity on how concerned investors should be.\n\n→ Netflix Is Out of Favor—and That’s Why It’s Getting Interesting\nWhy Broadcom Insider Sales Appear Concerning Since it released its earnings on Dec. 11, Broadcom has seen eight separate insider sales, worth approximately $66.7 million in total. The vast majority were not made under a predetermined 10b5-1 plan. Insiders must schedule 10b5-1 sales well in advance of when they actually take place, greatly limiting their utility in reacting to recent developments. Therefore, 10b5-1 plan sales don’t provide much of a near-term bearish signal. In contrast, sales not made under these plans are much more likely to provide a pessimistic signal in the near term.\n\n$66.4 million, or 99% of the value of Broadcom’s recent insider sales, did not come under a predetermined plan. This suggests that these insiders may have made these sales in reaction to Broadcom’s latest report and the ensuing sell-off. At first glance, these sales certainly appear worrisome. However, a key detail of these sales pushes back on this interpretation significantly.\n→ 5 Stocks Set to Start Strong in January and Lead Through 2026\nInsider Sale Impetus: RSU Requirements and CEO Diversification The Form 4 SEC filing provides details on the reasoning behind every insider sale. In six out of the seven non-105b-1 sales, the following disclosure appears:\n\nStory Continues\n“Shares were sold through automatic transactions to cover withholding taxes due upon the vesting of restricted stock units (\"RSUs\") as required under the relevant RSU awards.”\nThis means that despite not coming under a 105b-1 plan, these sales were not discretionary. They covered the taxes incurred from these insiders' vested RSUs. RSU awards are a type of stock-based compensation.\n\nEmployees must continue working for their company through the RSU vesting period to actually receive these stock awards. Once this happens, employees incur a tax liability, which, in Broadcom’s case, is automatically covered by selling some of the stock they were just awarded.\nThus, sales made for this purpose do not provide a bearish signal, as they are simply a formality.\nAbout $24 million worth of Broadcom’s recent sales, coming from three insiders, fall into this category. That leaves us to reconcile Hock Tan’s $42.4 million sale.\nHock Tan’s Sale Stands Out, but the Structure Matters Tan sold 130,000 shares, leaving him with 1,078,474 shares after the transaction. This includes 595,638 shares owned indirectly through a trust and 482,836 shares owned directly. Doing the math, Tan reduced his total position in Broadcom by around 11%.\nWhile a significant reduction in his position, investors should review the notes of his Form 4 filing, which state, “The reporting person contributed shares into an exchange fund.” This suggests that Tan made this sale to diversify his portfolio, selling Broadcom to buy an ETF. This dampens the bearishness of his sale.\n\nAVGO Insiders Aren’t Panicking; Neither Should Investors Broadcom’s recent insider sales, although significant, should not deter investors. Tan’s sale is the only one that is potentially worrisome, as an 11% decline in his position is meaningful. However, Tan still maintains a massive position in Broadcom. His artificial intelligence-influenced pay package is expected to significantly increase his position over the coming years, assuming Broadcom’s success continues. Thus, it is not alarming to see him moderately diversify his holdings.\nOne More Data Point: A Small Insider Buy On the other side of the ledger, Broadcom director Harry L. You reported buying 1,000 shares on Dec. 18 at roughly $325.13. It’s not a huge purchase relative to Broadcom’s market cap, but it does matter as a signal: insiders rarely buy for administrative reasons.\nThe article \" Broadcom's Insider Selling: A Big Red Flag, or Business as Usual? \" was originally published by MarketBeat.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "01:30:46",
      "Source": "24/7 Wall St.",
      "Title": "Billionaires Dump the Magnificent Seven and Load Up on These Stocks",
      "URL": "https://finance.yahoo.com/m/d55fce68-c7c0-3d3c-b684-9e2856308324/billionaires-dump-the.html",
      "Content": "Billionaires Dump the Magnificent Seven and Load Up on These Stocks\n\nVandita Jadeja\nMon, December 29, 2025 at 9:30 AM PST 5 min read\n\nIn this article: NVDA\n\nAMZN\n\nPLTR\n\nADBE\n\nAVGO\n\nQuick Read Billionaire Stanley Druckenmiller fully exited Nvidia and Palantir positions.\nKen Griffin reduced his Amazon stake by 39% by selling 2.1 million shares.\nBridgewater Associates and Tiger Global Management increased their positions in Adobe and Broadcom.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "23:48:09",
      "Source": "Yahoo Finance Video",
      "Title": "Chip sales could top $1T in 2026. Is Nvidia still top AI play?",
      "URL": "https://finance.yahoo.com/video/chip-sales-could-top-1t-154809053.html",
      "Content": "Chip sales could top $1T in 2026. Is Nvidia still top AI play?\n\nYahoo Finance Video and Brian Sozzi\nMon, December 29, 2025 at 7:48 AM PST\n\nIn this video: NVDA\n\nMSFT\n\nADI\n\nKLAC\n\nAMZN\n\nWhile Nvidia ( NVDA ) was one of the standout winners of the AI trade in 2025, will the chipmaker remain a tried-and-true stock pick in 2026?\nWinthrop Capital Chief Investment Officer Adam Coons weighs in on the importance of diversification in the artificial intelligence ecosystem, especially as Bank of America analysts forecast semiconductor sales to top $1 trillion next year. Yahoo Finance senior reporter Brooke DiPalma also joins the discussion.\nTo watch more expert insights and analysis on the latest market action, check out more Opening Bid .\n\nVideo Transcript\n\n00:00 Speaker A\nAdam, what's the the best course of action for the average investor? Do they waste a whole day trying to find the next big play in AI or do they just say, you know what? Nvidia's going to win this whole damn thing? I'm just going to bet on them again next year.\n00:15 Adam\nYeah, I definitely wouldn't uh just bet on Nvidia. I I think you do need to do your homework if you want to buy specific names. I think probably the general investor is probably better finding some sort of basket to kind of play the overall space. Uh but we're very early innings in this and\n00:41 Adam\nobviously Nvidia is the winner right now, but uh to say, you know, in five years that we look back that they're going to be the dominant player still, very, very unlikely. Like I said, this is really an evolving space. So I I would be careful with something that's so specific as Nvidia. Uh we kind of like to barbell this with, you know, something like the the big hyperscaler like a like an Alphabet Google, uh because that's really the type of name that uh you could probably have a little bit more comfort in because they just\n01:14 Adam\noverall, the AI story is just benefiting an already existing business model that was doing well. So, I think you would just want to be careful with what we're calling kind of the one trick ponies, like a Nvidia, uh a Core Weve or a Patier right now.\n01:31 Speaker A\nUh, Brooke, let me get over to you because I think what you're seeing in industrial metals and some of the things that Adam's talking about fits nicely with what we heard from Ed Yardini this morning that he might see it is likely to see we are likely to see a broadening out in this rally. Investors doing their homework, trying to get outside of the tried and true Mag 7.\n01:53 Brooke\nYeah, Brian, what we did hear from Ed Danny over the weekend was really ongoing momentum in this market in 2026. He maintained that year end target for the S&P 500 of 7,700 and he said largely it won't be really led by uh the Mag 7, but also what he called the impressive 493 of the S&P 500 as really this broadening out, this boost in productivity growth really leads to overall returns for the\n02:26 Brooke\nS&P 500 in 2026. Specifically, you know, he went on to say that that is really where exactly investors should be thinking about this mindset. You know, not really overweight technology, but more so thinking about the other users of AI as opposed to just the producers of AI. And so certainly he's not alone in this uh momentum that he thinks will exist within 2026 ongoing from what we've seen so far in the returns in 2025.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "23:01:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Slips as Groq Deal Raises Questions",
      "URL": "https://finance.yahoo.com/m/95a0cad5-3b27-3e4d-87f7-d72c690058be/nvidia-stock-slips-as-groq.html",
      "Content": "Nvidia Stock Slips as Groq Deal Raises Questions\n\nAdam Clark\nMon, December 29, 2025 at 7:01 AM PST 3 min read\n\nIn this article: NVDA\n\nGROQ.PVT\n\nAMD\n\nAVGO\n\nNvidia was dropping early on Monday. Broader jitters about the technology sector looked to be hurting the stock, while Wall Street assessed the reported $20 billion price tag put on Nvidia’s agreement to license technology from artificial intelligence chip start-up Groq. Nvidia shares were down 1.6% at $187.45 in early trading, while the technology-heavy Nasdaq Composite lost 0.4%.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "21:24:02",
      "Source": "Investor's Business Daily",
      "Title": "AI Stocks Face 'Show Me' Moment: Why OpenAI's Success Or Failure Is Key",
      "URL": "https://finance.yahoo.com/m/684c930d-1475-3adc-b013-ae604c056ebc/ai-stocks-face-%27show-me%27.html",
      "Content": "AI Stocks Face 'Show Me' Moment: Why OpenAI's Success Or Failure Is Key\n\nREINHARDT KRAUSE\nMon, December 29, 2025 at 5:24 AM PST 9 min read\n\nIn this article: NVDA\n\nAVGO\n\nORCL\n\nPLTR\n\nGOOG\n\nOpenAI news often drives many AI stocks up or down. Many tech companies have a stake in OpenAI's success or failure in 2026 and beyond.\n\nContinue Reading\n\nCGU et Politique de confidentialité\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "21:21:11",
      "Source": "24/7 Wall St.",
      "Title": "An Actively Managed AI ETF Put 18% Into Two Chip Giants Just Ahead of Massive Infrastructure Buildout",
      "URL": "https://finance.yahoo.com/m/3a5c1b5b-1744-3ca0-b848-b09f050d5c3d/an-actively-managed-ai-etf.html",
      "Content": "An Actively Managed AI ETF Put 18% Into Two Chip Giants Just Ahead of Massive Infrastructure Buildout\n\nMichael Williams\nMon, December 29, 2025 at 5:21 AM PST 4 min read\n\nIn this article: NVDA\n\nAVGO\n\nQuick Read BAI holds $8B in assets with nearly 60% in information technology. NVIDIA and Broadcom alone represent 18% of the fund.\nGoldman Sachs projects AI infrastructure spending will exceed $500B in 2026, up from roughly $400B in 2025.\nThe fund’s 56% turnover allows rotation across the AI stack but concentrates 40% in seven names.\nIf you’re thinking about retiring or know someone who is, there are three quick questions causing many Americans to realize they can retire earlier than expected. take 5 minutes to learn more here\n\nThe iShares AI Innovation and Tech Active ETF ( NYSEARCA:BAI ) launched in October 2024 to capture the entire AI infrastructure buildout in one actively managed package. With $8 billion in assets and a 0.55% expense ratio, the fund takes a concentrated approach to AI exposure across the technology stack.\nWith $8 billion in assets and a 0.55% expense ratio, BAI takes a full-stack approach to AI exposure. Nearly 60% sits in information technology, led by NVIDIA ( NASDAQ:NVDA ) at 9.5% and Broadcom ( NASDAQ:AVGO ) at 8.8%. The next tier includes hyperscalers Microsoft ( NASDAQ:MSFT ), Alphabet ( NASDAQ:GOOGL ), and Meta ( NASDAQ:META ), plus software plays like Snowflake ( NYSE:SNOW ) and Palantir ( NYSE:PLTR ). It's a who's-who of AI infrastructure, from chips to cloud to enterprise software.\nThis infographic outlines how the iShares BAI ETF invests in the AI infrastructure buildout, detailing its strategy, suitable use cases, and key pros and cons for investors.\nWhat Drives This Trade in 2026 The single macro factor that matters most: hyperscaler capital expenditure. Goldman Sachs ( NYSE:GS ) Research projects AI companies will spend over $500 billion on infrastructure in 2026, up from roughly $400 billion in 2025. That spending flows directly to BAI's top holdings. Microsoft, Google, Meta, and Amazon ( NASDAQ:AMZN ) are building data centers, buying NVIDIA GPUs, and deploying custom silicon at unprecedented scale. When Azure grows 40% year-over-year or Google Cloud expands 34%, that revenue translates into orders for semiconductors, networking gear, and software platforms.\n\nWatch quarterly earnings from the hyperscalers, particularly their capex guidance. Microsoft, Alphabet, and Meta report fiscal results in January, April, July, and October. Any upward revision to infrastructure spending signals sustained demand for BAI's semiconductor and hardware holdings. If capex growth slows below 25%, the valuation premium on AI infrastructure stocks compresses quickly.\nPortfolio Mechanics and Concentration Risk BAI's active management means turnover runs at 56%, well above passive index funds. That flexibility allows managers to rotate between chip makers, cloud platforms, and emerging software plays as the AI landscape evolves. Check the fund's monthly fact sheet on iShares' website to track changes in sector allocation and top 10 concentration.\n\nStory Continues\nThe fund's concentration is both strength and vulnerability. NVIDIA and Broadcom alone represent 18% of assets. Add the hyperscalers and you're approaching 40% in just seven names. This amplifies returns when AI infrastructure spending accelerates, but any stumble in semiconductor demand or cloud growth hits hard. The 56% turnover suggests active rebalancing, but investors should monitor whether the fund maintains its chip-heavy tilt or rotates toward software as enterprise AI adoption matures.\n\nConsider the Broader Play For comparison, the iShares Robotics and Artificial Intelligence Multisector ETF ( NYSEARCA:IRBO ) offers similar AI exposure with a 0.47% expense ratio and longer track record since 2018. IRBO spreads risk across 92 holdings versus BAI's more concentrated approach, making it a steadier option for investors prioritizing diversification over maximum AI infrastructure exposure.\n\nFor 2026, hyperscaler capex guidance and BAI's quarterly rebalancing will be key indicators. Goldman Sachs Research projects infrastructure spending above $500 billion, which would support continued demand for the fund's semiconductor and cloud holdings.\nThe New Report Shaking Up Retirement Plans You may think retirement is about picking the best stocks or ETFs, but you’d be wrong. Even great investments can be a liability in retirement. It’s a simple difference between accumulating vs distributing, and it makes all the difference.\nThe good news? After answering three quick questions many Americans are reworking their portfolios and finding they can retire earlier than expected. If you’re thinking about retiring or know someone who is, take 5 minutes to learn more here .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "21:19:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Slips. Why Its Groq Deal Raises Questions.",
      "URL": "https://finance.yahoo.com/m/95a0cad5-3b27-3e4d-87f7-d72c690058be/nvidia-stock-slips.-why-its.html",
      "Content": "Nvidia Stock Slips. Why Its Groq Deal Raises Questions.\n\nAdam Clark\nMon, December 29, 2025 at 5:19 AM PST 2 min read\n\nIn this article: NVDA\n\nGROQ.PVT\n\nAMD\n\nAVGO\n\nNvidia was edging down early on Monday. Broader jitters about the technology sector looked to be hurting the stock, while Wall Street assessed the reported $20 billion price tag put on Nvidia’s agreement to license technology from artificial intelligence chip start-up Groq. Nvidia shares were down 1.1% at $188.49 in premarket trading.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "18:58:00",
      "Source": "Zacks",
      "Title": "Zacks Investment Ideas feature highlights: Nvidia, Broadcom, Vertiv and Alphabet",
      "URL": "https://finance.yahoo.com/news/zacks-investment-ideas-feature-highlights-105800503.html",
      "Content": "Zacks Investment Ideas feature highlights: Nvidia, Broadcom, Vertiv and Alphabet\n\nZacks Equity Research\nMon, December 29, 2025 at 2:58 AM PST 8 min read\n\nIn this article: VRT\n\nNVDA\n\nAVGO\n\nGOOG\n\nFor Immediate Release Chicago, IL &ndash; December 29, 2025 &ndash; Today, Zacks Investment Ideas feature highlights Nvidia NVDA, Broadcom AVGO, Vertiv VRT and Alphabet GOOGL.\n3 Leading AI Stocks Investors Can Buy for 2026\nThe market, and many leading AI stocks, are at an inflection point. In the near term, further volatility or even a pullback is possible. However, the longer-term opportunity remains compelling, with upside potential that extends well into 2026 and beyond.\n\nAI capital spending is projected to reach an estimated $571 billion in 2026, and Nvidia , Broadcom and Vertiv sit at the center of this historic infrastructure buildout. These companies are among the most critical enablers of the AI expansion.\nAfter running multiple screens focused on growth, valuation, and margin strength, these three names consistently rose to the top. Collectively, they represent exceptional businesses with durable competitive advantages and strong earnings power.\nDespite their leadership positions, these stocks are not stretched on valuation and in recent weeks have experienced earnings upgrades, giving two of them top Zacks Ranks.\nRecent months have been choppy in these stocks, with prices moving sideways to lower, leaving shares near technically important levels. Whether those levels hold or break in the short term is uncertain, but the risk-reward profile remains attractive at current prices regardless.\n\nEven if further downside materializes and bearish narratives resurface, any weakness is unlikely to persist given the scale and durability of AI-driven demand. If support holds, these stocks may already be positioning for their next leg higher.\nBelow, I will break down the recent developments, fundamental strength of these businesses and highlight a tactical trading plan using the technical charts.\nNvidia Stocks Breaks Out on Bullish Developments\nNvidia continues to anchor the AI boom as the critical infrastructure provider through its leadership in GPU technology. While 2025 was comparatively subdued for the now roughly $4.5 trillion semiconductor giant, with shares delivering a tidy 42% return, the company has remained firmly on offense.\nOver the past week, Nvidia advanced its largest acquisition to date, agreeing to acquire assets from AI chip startup Groq in a deal valued at approximately $20 billion. Groq, founded by former Google TPU architects, develops high-performance inference-focused silicon that competes in certain AI workloads. While Groq described the transaction as a &ldquo;non-exclusive licensing agreement,&rdquo; the deal includes the integration of Groq&rsquo;s CEO and senior leadership into Nvidia, signaling deeper strategic alignment.\n\nStory Continues\nFrom a competitive standpoint, the acquisition strengthens Nvidia&rsquo;s already formidable moat at the leading edge of AI semiconductors.\nFundamentals also continue to move in the right direction. Analysts have resumed raising earnings estimates, earning Nvidia a Zacks Rank #2 (Buy) . Consensus forecasts for next year&rsquo;s earnings have climbed nearly 16% over the past two months, and longer-term projections call for 46.3% annual EPS growth over the next three to five years. At roughly 40.6x forward earnings, the valuation remains reasonable given Nvidia&rsquo;s growth profile and its central role in the most powerful technology cycle in more than a decade.\n\nThe technical picture has also improved meaningfully. After months of choppy, volatile trading marked by sharp rallies and pullbacks, NVDA has made a decisive bullish turn. During the low-volume holiday period, the stock broke out from a clear descending bullish wedge, marking its most constructive advance in several months. As long as shares hold above the breakout level, the setup points to further upside as 2026 begins.\nBroadcom Shares Consolidate at Key Price Level\nBroadcom has been a core beneficiary of the AI boom since the trend began, but its importance has become even more apparent in recent months. After being viewed as a relative laggard for several years, Alphabet has reasserted itself as a leader in AI and large language models. A major driver of that shift has been renewed appreciation for Alphabet&rsquo;s proprietary hardware stack, most notably its Tensor Processing Units (TPUs), which Google has deployed internally for nearly a decade.\n\nBroadcom plays a critical role in that ecosystem. While TPUs are branded as Google-designed chips, Broadcom provides the underlying expertise in ASIC design, networking, and high-speed I/O, effectively enabling Google to scale these systems reliably at hyperscale. As Alphabet rapidly expands AI infrastructure across Search, cloud services, and generative AI models, custom silicon becomes economically unavoidable. Broadcom sits squarely at the center of that transition, helping design chips optimized for inference, training, and internal workloads, areas where generic GPUs are often less cost-efficient. As Alphabet&rsquo;s AI leadership has become clearer, Broadcom&rsquo;s strategic importance has risen alongside it.\nFrom a fundamentals perspective, Broadcom currently carries a Zacks Rank #3 (Hold) , reflecting a pause in earnings revisions rather than any deterioration in outlook. Consensus estimates still call for 35.7% annual EPS growth over the next three to five years, and the stock trades at roughly 36x one-year forward earnings. Given that growth profile and Broadcom&rsquo;s deep entrenchment in the AI infrastructure stack, valuation remains reasonable relative to peers.\n\nTechnically, Broadcom had been outperforming much of the AI complex in recent months as investors increasingly recognized its role within the Alphabet AI ecosystem. The sharp selloff following its most recent earnings report was less about weakening fundamentals and more about positioning and nuanced guidance, a classic &ldquo;sell-the-news&rdquo; event after a strong run. Importantly, shares found support at a level that has held up the stock since late summer. As long as that support holds, the consolidation looks constructive, and the near-term technical outlook remains encouraging.\nVertiv Stock Sits Within Trading Range\nVertiv remains one of the purest plays on the physical backbone of the AI buildout, supplying critical power, cooling, and thermal-management solutions to hyperscale and enterprise data centers. Recent developments continue to reinforce that positioning. Over the past several months, Vertiv has announced expanded partnerships with large data center operators and hyperscalers, while management has highlighted strong backlog growth and improving visibility tied directly to AI-driven capacity expansion. Demand for high-density cooling solutions continues to exceed expectations as next-generation AI workloads push power and thermal limits higher.\n\nFundamentally, the story remains compelling. Vertiv currently carries a Zacks Rank #2 (Buy) as earnings estimates continue to trend higher. Consensus forecasts call for 30.2% annual EPS growth over the next three to five years, reflecting operating leverage, improving margins, and sustained AI-related demand. While the stock trades at a 40.6x forward earnings multiple, that valuation appears justified given Vertiv&rsquo;s growth rate, expanding addressable market, and increasingly important role in AI infrastructure.\nThe technical setup adds another layer of appeal. After a sharp advance earlier in the cycle, VRT has spent recent months consolidating within a well-defined trading range. Importantly, the stock recently bounced cleanly off support within its rising channel. The key level to watch on the upside is the ~$180 area, which marks the top of the current range. A decisive breakout above that level would likely signal the next leg higher, while continued support near the lower end of the channel keeps the risk-reward profile attractive.\n\nTaken together, Vertiv offers a differentiated way to participate in the AI boom&mdash;not through chips or software, but through the indispensable infrastructure that makes large-scale AI deployment possible. With fundamentals strengthening and the technical picture improving, VRT remains well positioned as investors look ahead to 2026.\nShould Investors Buy Shares in VRT, NVDA and AVGO?\nTaken together, Nvidia, Broadcom, and Vertiv offer complementary exposure to the core layers of the AI buildout&mdash;compute, custom silicon and networking, and physical infrastructure. While near-term volatility is always possible, fundamentals, earnings momentum, and long-term demand visibility remain firmly intact. With each stock positioned at a critical point in the AI value chain and trading near technically important levels, the current setup favors accumulation opportunistically as the AI investment cycle extends into 2026 and beyond.\n\nFree: Instant Access to Zacks' Market-Crushing Strategies\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\nToday you can tap into those powerful strategies &ndash; and the high-potential stocks they uncover &ndash; free. No strings attached.\nGet all the details here >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nVertiv Holdings Co. (VRT) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "12:55:27",
      "Source": "Associated Press Finance",
      "Title": "Stocks slip on Wall Street as 2025 winds down",
      "URL": "https://finance.yahoo.com/news/asian-shares-mixed-quiet-holiday-045527800.html",
      "Content": "Stocks slip on Wall Street as 2025 winds down\n\nDAMIAN J. TROISE\nSun, December 28, 2025 at 8:55 PM PST 1 min read\n\nIn this article: CL=F\n\nGC=F\n\n^GSPC\n\n^DJI\n\n^IXIC\n\nNEW YORK (AP) — Stocks slipped in morning trading on Wall Street Monday to kick off another holiday-shortened week.\nThe S&P 500 fell 0.4%. With just three trading days left in 2025, the benchmark index is still up more than 17% for the year and it remains on track for its eighth monthly gain in a row.\n\nThe Dow Jones Industrial Average fell 144 points, or 0.3%, as of 10:01 a.m. Eastern. The Nasdaq composite fell 0.6%.\nBig technology stocks with outsized valuations were among the heaviest weights on the market. Nvidia fell 2% and Broadcom fell 1.3%.\nEnergy stocks gained ground along with rising oil prices. U.S. benchmark crude jumped 2.4% to $58.11 per barrel. The price of Brent crude, the international standard, rose 2.2% to $61.56 a barrel.\nExxon Mobil rose 0.9%.\nGold prices pulled back after recent sharp gains. The price of gold slumped 3.5%, though prices for the precious metal are still up about 66% for the year.\nWall Street faces another short week in the final stretch of 2025. Markets in the U.S. will be closed on Thursday for New Year's Day.\nTreasury yields fell in the bond market. The yield on the 10-year Treasury fell to 4.12% from 4.13% late Friday.\nMarkets in Europe and Asia were mixed. Shares in Taiwan were higher even after China’s military said it was conducting drills around the self-governed island that Beijing claims as its territory. Taiwan's benchmark Taiex gained 0.9%, but the Hang Seng in Hong Kong gave up early gains, falling 0.7%.\n___\nElaine Kurtenbach contributed to this story.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "02:15:52",
      "Source": "Insider Monkey",
      "Title": "Here’s What Kim Forrest and William Kerwin Think About Broadcom Inc (AVGO)",
      "URL": "https://finance.yahoo.com/news/kim-forrest-william-kerwin-think-181552611.html",
      "Content": "Here’s What Kim Forrest and William Kerwin Think About Broadcom Inc (AVGO)\n\nTalha Qureshi\nSun, December 28, 2025 at 10:15 AM PST 2 min read\n\nIn this article: AVGO\n\n​Broadcom Inc. (NASDAQ: AVGO ) is one of the Best Quality Stocks to Buy Before 2026 . Broadcom Inc. (NASDAQ:AVGO) topped Wall Street estimates during its fiscal Q4 2025 earnings, released on December 11. However, the stock price has fallen more than 16% since the release.\n​To talk about the earnings and the market selloff that followed, Kim Forrest, founder and chief investment officer at Bokeh Capital Partners LLC, and William Kerwin of Morningstar appeared on a Schwab Network interview on December 13. Kim noted that at the first appearance, the numbers looked great as they exceeded Street expectations, and demand looked good as well. However, the earnings call shifted the sentiment based on some products waiting for shipment, larger than anticipated backlog, and a 100 basis point decline in margins. Kim added that while the results were not bad, the AI investor sentiment has shaped in a way that if a company does not exceed expectations greatly, the sentiment turns negative.\n​William also expressed surprise over the market reaction. He noted that the investment case for Broadcom Inc. (NASDAQ:AVGO) remains intact, driven by accelerating AI demand. He highlighted that the company enjoys a significant benefit based on its co-designed TPU chip with Google, which has also seen immense demand. William added that Morningstar remains bullish on the stock, similar to Kim Forrest of Bokeh Capital Partners.\n\n​Broadcom Inc. (NASDAQ:AVGO) designs, develops, and supplies various semiconductor devices and infrastructure software solutions worldwide. The company operates in two segments: Semiconductor Solutions and Infrastructure Software.\nWhile we acknowledge the potential of AVGO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "00:48:05",
      "Source": "Insider Monkey",
      "Title": "Deutsche Bank Is Bullish On Broadcom Inc. (AVGO)",
      "URL": "https://finance.yahoo.com/news/deutsche-bank-bullish-broadcom-inc-164805992.html",
      "Content": "Deutsche Bank Is Bullish On Broadcom Inc. (AVGO)\n\nFatima Gulzar\nSun, December 28, 2025 at 8:48 AM PST 2 min read\n\nIn this article: AVGO\n\nDB\n\nORCL\n\nBroadcom Inc. (NASDAQ: AVGO ) is among the Growth Stock Portfolio: 12 Stock Picks By Ken Fisher .\nOn December 12, 2025, Thefly reported that Deutsche Bank increased its price objective for Broadcom Inc. (NASDAQ:AVGO) from $400 to $430 while keeping a buy rating. The business highlighted the company’s fiscal fourth-quarter performance, labeling growth as impressive. As stated in the commentary, the firm pointed out that although the results showed good performance, the growth came at a cost.\n\nOn December 12, Broadcom Inc. (NASDAQ:AVGO) warned that increasing sales of lower-margin custom AI chips would decrease profitability, which caused the company’s stock to drop more than 11%. Following a 10.8% decline in Oracle shares the day before due to debt-funded AI infrastructure expenditure, the margin warning heightened investor fears about returns from significant AI spending. The business stated that the margins will remain under pressure due to a higher proportion of AI sales, despite reporting a $73 billion backlog to ship in the next 18 months.\nThe stock has increased by over 46.72% so far this year. Melius Research’s Ben Reitzes stated that, considering the high spending plans, panic is premature.\nMeanwhile, the announcement of a new custom AI chip in 2026, a new $11 billion order for an AI chip from Anthropic for the second half of 2026, and guidance for artificial intelligence revenue in the January quarter were all significant highlights of the last quarter.\n\nBroadcom Inc. (NASDAQ:AVGO) is one of the world’s leading semiconductor businesses, and it has expanded into infrastructure software.\nWhile we acknowledge the potential of AVGO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 10 High-Growth EV Stocks to Invest In and 13 Best Car Stocks to Buy in 2025 .\nDisclosure. None\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "00:36:00",
      "Source": "Motley Fool",
      "Title": "What Is the Best Artificial Intelligence (AI) Stock to Hold for the Next 10 Years?",
      "URL": "https://finance.yahoo.com/m/92e033bd-467e-3790-a963-523cff98bcb6/what-is-the-best-artificial.html",
      "Content": "What Is the Best Artificial Intelligence (AI) Stock to Hold for the Next 10 Years?\n\nAdam Spatacco, The Motley Fool\nSun, December 28, 2025 at 8:36 AM PST 5 min read\n\nIn this article: TSM\n\nNVDA\n\nAMD\n\nAVGO\n\nMU\n\nKey Points Chip designers such as Nvidia, Advanced Micro Devices, and Broadcom serve as the backbone of generative AI development.\nWhile chip designers steal the spotlight, Taiwan Semiconductor Manufacturing is playing a hugely important supporting role in the background.\nAs demand for AI chips and data centers accelerates, Taiwan Semi is poised for explosive long-term growth.\n10 stocks we like better than Taiwan Semiconductor Manufacturing ›\n\nFor the last three years, investing in semiconductor stocks has proven to be a profitable decision given the critical role chips play in the development of generative artificial intelligence (AI). Companies such as Nvidia , Advanced Micro Devices , Broadcom , and Micron Technology have been some of the biggest contributors to the semiconductor industry throughout the artificial intelligence (AI) revolution.\nFlying under the radar is another chip company whose storyline seems muted compared to its peers. That's Taiwan Semiconductor Manufacturing (NYSE: TSM) , the pick-and-shovel specialist of the chip realm.\nLet's dive into Taiwan Semi's increasingly important role for the future of AI and assess why the stock looks like a no-brainer buying opportunity for investors with a long-term horizon.\nHow does Taiwan Semiconductor benefit from AI? Throughout the AI revolution, hyperscalers such as Microsoft , Alphabet , Amazon , Meta Platforms , and OpenAI have collectively poured hundreds of billions of dollars into AI-related capital expenditures (capex) -- namely, chips and networking gear for data centers.\nOn the surface, this is great news for the likes of Nvidia, AMD, and Broadcom. But underneath the surface, it's even better news for Taiwan Semi. Why is that?\n\nTSMC is the largest chip manufacturer in the world in terms of revenue. While Nvidia, AMD, and Broadcom design the most-in demand GPUs and custom application-specific integrated circuits (ASICs) on the planet, each of these giants relies heavily on Taiwan Semi's cutting-edge fabrication processes.\nIn other words, if Nvidia and its competitors represent the body of the car moving the AI narrative forward, TSMC holds the keys to the ignition.\nTSMC's growth is off the charts Over the last year, Taiwan Semi's revenue has been growing strongly thanks to ongoing demand for AI accelerators. What's interesting to point out is that the company's revenue trajectory is actually steepening. This is largely driven by rising demand for Nvidia's and AMD's next-generation Rubin and MI400 Series chips, as well as increasing investment in custom hardware from cloud infrastructure providers.\n\nStory Continues\nThe more subtle aspect from the financial picture above is Taiwan Semi's expanding profitability profile. Given its near-70% market share, TSMC is able to command enormous pricing power relative to competitors like Intel or Samsung .\nAgainst this backdrop, Taiwan Semi's gross margin is widening -- with excess cash flowing straight to the bottom line. The company is making the most of this new wave of capital by expanding its geographic footprint -- building additional foundries in Arizona, Germany, and Japan.\n\nIs Taiwan Semi stock a good buy right now? At the moment, TSMC boasts a forward price-to-earnings (P/E) multiple of 28.4 -- hovering near its highest level during the AI revolution. If you were to base your investment decision purely off of this metric, you may think Taiwan Semi is overvalued.\nSmart investors understand that TSMC's premium valuation could be warranted, though. McKinsey & Company is forecasting AI infrastructure to be a $7 trillion market through 2030 -- with the majority of spend allocated toward refining AI workloads.\nIn essence, building out AI-equipped data centers is expected to accelerate throughout the rest of the decade as training and inferencing models becomes more sophisticated and demanding. This is great news for TSMC as it paves the way for long-run visibility across the business.\n\nThe AI infrastructure chapter is still in its early innings. Over the course of the next several years, Taiwan Semi is positioned to benefit from the secular tailwind of rising investment in infrastructure both domestically and abroad.\nTaking this one step further, physical applications such as autonomous systems and robotics are yet to be deployed in a commercial sense. Looking beyond into the 2030s, these use cases are expected to drive additional trillions in economic value.\nShould they achieve some form of adoption and set the stage for the next wave of AI, Taiwan Semi has the potential to benefit immensely beyond where AI stands today -- building large language models (LLMs) and other software-based applications.\nWhen you consider the bigger picture and begin to think longer-term, TSMC's growth potential relative to its valuation looks compelling. So while the stock may not appear dirt cheap at first glance, I think there is ample room for meaningful valuation expansion over the course of the next decade -- making the stock a no-brainer buy right now in my eyes.\n\nShould you invest $1,000 in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nAdam Spatacco has positions in Alphabet, Amazon, Meta Platforms, Microsoft, and Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Intel, Meta Platforms, Microsoft, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nWhat Is the Best Artificial Intelligence (AI) Stock to Hold for the Next 10 Years? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-28",
      "Time": "23:20:00",
      "Source": "Motley Fool",
      "Title": "Prediction: This AI Stock Could Be the First New $2 Trillion Company in 2026",
      "URL": "https://finance.yahoo.com/m/2d751d5f-fd34-3071-bd63-786e1f7111b2/prediction%3A-this-ai-stock.html",
      "Content": "Prediction: This AI Stock Could Be the First New $2 Trillion Company in 2026\n\nAdam Levy, The Motley Fool\nSun, December 28, 2025 at 7:20 AM PST 5 min read\n\nIn this article: META\n\nTSLA\n\nAVGO\n\nNVDA\n\nKey Points Meta Platforms, Tesla, and Broadcom each have market caps around $1.6 trillion.\nAI is the driving force behind all three stock prices.\nOne of these tech leaders is seeing immediate results from AI spending, and its stock valuation is more attractive right now.\n10 stocks we like better than Meta Platforms ›\n\nArtificial intelligence (AI) is responsible for adding trillions of dollars in value to a handful of companies over the last few years. Nvidia , for example, briefly touched a $5 trillion market cap this year, thanks to its dominant position in the market for graphics processing units (GPUs). Four other companies sit firmly above the $2 trillion threshold as we approach the new year.\nBut three AI stocks currently have similar market caps around $1.6 trillion as of this writing, and are vying to become the first new $2 trillion company of 2026: Meta Platforms (NASDAQ: META) , Tesla (NASDAQ: TSLA) , and Broadcom (NASDAQ: AVGO) . Here's my prediction for the next company to top the milestone, and it could come as soon as next year.\nArtificial intelligence is fueling all three Meta, Tesla, and Broadcom have all seen their stock prices heavily influenced by advances in AI this year.\nMeta stock climbed higher early in the year as its efforts to improve its recommendation algorithms bore fruit. Ad revenue climbed higher as time spent on its apps increased, and ads became more effective. However, the stock took a step back recently as management shared plans to increase its AI-related spending.\n\nTesla's value is heavily tied to its robotaxi service and AI innovations. The stock received a boost over the summer when it launched its robotaxi pilot in Austin, Texas. Investors added to those gains on promising progress on the company's next-generation AI chip for its vehicles.\nBroadcom's custom AI accelerator business has gained momentum in 2025, as the company signed big contracts with OpenAI and Anthropic, the latter of which is buying Alphabet 's Broadcom-designed tensor processing units (TPUs). To that end, Alphabet and Broadcom are seeing excellent progress in shifting more developer workloads to TPUs, which offer greater energy efficiency and cost savings versus Nvidia's GPUs.\nBroadcom stock took a step back after its last earnings report, as many analysts were disappointed with management's expectation that greater AI chip sales would come at a lower gross margin.\nWhile all three of these stocks have a path to a $2 trillion valuation in 2026, I expect Meta Platforms to reach the milestone first. Here's why.\n\nStory Continues\nAI-powered earnings growth at an attractive valuation Even with its run rate of $200 billion in annual revenue, Meta is still growing its bottom line quickly. Adjusted earnings per share climbed 20% in the third quarter, and improvements in AI are the reason.\nMeta has seen an increase in both ad impressions and price per ad for eight straight quarters. That indicates that it's increasing user engagement and opening new places within its apps for advertising while making ads more effective.\n\nManagement attributes a shift in its recommendation algorithm to make it more general across formats as the primary reason users are spending more time on its apps. Meta has seen similar improvements by applying the same methodology to its advertising algorithm. In other words, bigger models have directly translated into more revenue.\nThat trend should continue in 2026, as Meta opens up more opportunities for advertising, including on Threads and WhatsApp. It could also begin monetizing Meta AI, its generative AI chatbot. The improvements in its algorithms over the last couple of years should enable it to ramp up advertising quickly without as much negative impact on its pricing as we've seen in the past.\nThe bigger opportunity for Meta in 2026, though, may be the expansion of its generative AI features. It's reportedly working on an AI agent that can manage advertising campaigns for small businesses. CEO Mark Zuckerberg repeatedly talks about the opportunity to handle everything involved with creating, testing, and optimizing ad campaigns on its platform through an AI agent.\n\nAnd chatbots specializing in sales and customer service for a company could open the door for more businesses to push Facebook and Instagram users to start messaging them through Meta's chat apps.\nWith small- and medium-sized businesses accounting for the bulk of advertisers on Meta's platform, these innovations have the potential to dramatically increase the amount they're willing to spend on ads. If the overhead for these clients is much lower, they can increase their ad spending and scale up their businesses faster.\nThose efforts should fuel another year of strong revenue growth. And while depreciation expense from the increase in AI-related capital expenditures could eat into earnings growth, Meta should be able to manage continued improvements in earnings per share with the help of share repurchases.\n\nThe stock trades for just 26 times forward earnings expectations, which is much lower than Broadcom's multiple and less than one-tenth the multiple Tesla stock trades for. I expect Meta to fetch a higher earnings multiple as it proves its AI spending to be well worth it once again in 2026, pushing its valuation to $2 trillion.\nShould you invest $1,000 in Meta Platforms right now? Before you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nAdam Levy has positions in Alphabet and Meta Platforms. The Motley Fool has positions in and recommends Alphabet, Meta Platforms, Nvidia, and Tesla. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nPrediction: This AI Stock Could Be the First New $2 Trillion Company in 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-28",
      "Time": "17:15:00",
      "Source": "Motley Fool",
      "Title": "The Best Artificial Intelligence (AI) Stocks to Buy Ahead of 2026, According to Wall Street Analysts (Hint: Not Palantir)",
      "URL": "https://finance.yahoo.com/m/32a856c7-f936-3b66-b577-8c497c7d7178/the-best-artificial.html",
      "Content": "The Best Artificial Intelligence (AI) Stocks to Buy Ahead of 2026, According to Wall Street Analysts (Hint: Not Palantir)\n\nTrevor Jennewine, The Motley Fool\nSun, December 28, 2025 at 1:15 AM PST 5 min read\n\nIn this article: PLTR\n\nNVDA\n\nMSFT\n\nMETA\n\nAMZN\n\nKey Points Morningstar analysts recently ranked Nvidia and Microsoft as the two best artificial intelligence stocks to buy right now.\nBrian Colello at Morningstar says Nvidia has an economic moat due to its leadership in GPUs, networking, and software tools needed for artificial intelligence.\nDan Romanoff at Morningstar says Microsoft’s cloud computing unit has emerged as a leader in artificial intelligence due to investments in OpenAI.\n10 stocks we like better than Nvidia ›\n\nPalantir Technologies has been one of the best-performing artificial intelligence (AI) stocks in recent years. Shares have advanced 1,000% since January 2024, but many analysts worry about its valuation. That may explain why Palantir did not appear on Morningstar 's recent list detailing the best AI stocks to buy now.\nInstead, Nvidia (NASDAQ: NVDA) and Microsoft (NASDAQ: MSFT) took the top two spots, followed by Amazon , Broadcom , and Meta Platforms . But optimism concerning Nvidia and Microsoft is not limited to Morningstar. Most Wall Street analysts believe the stocks are undervalued.\nAmong 69 analysts, Nvidia has a median target price of $250 per share. That implies 31% upside from its current share price of $190.\nAmong 63 analysts, Microsoft has a median target price of $631 per share. That implies 29% upside from its current share price of $488.\nHere's what investors should know about Nvidia and Microsoft.\n1. Nvidia Morningstar analyst Brian Colello writes:\nTo summarize, Nvidia has an important competitive advantage in its full-stack strategy. The company is best known for its GPUs, chips that accelerate demanding data center workloads like AI training and AI inference. But Nvidia is truly formidable because it pairs best-in-class GPUs with CPUs, high-speed interconnects, and networking platforms, such that the company essentially builds entire data centers.\n\nAdditionally, Nvidia has spent the better part of two decades creating its CUDA software platform, which comprises an unparalleled number of code libraries, pretrained models, and application frameworks that assist developers. While custom AI chips developed by Broadcom may be cheaper, the total cost of ownership is often higher because they lack pre-built software tools.\n\nStory Continues\nNvidia has over 90% market share in data center GPUs, a market where sales are projected to grow at 36% annually through 2033, and the company is likely to maintain its dominant position due to its full-stack strategy. Wall Street estimates Nvidia's adjusted earnings will increase at 48% annually through the fiscal year ending in January 2028. That makes the current valuation of 47 times earnings look cheap.\n\n2. Microsoft Microsoft is the largest enterprise software company in the world. While best known for Microsoft 365 (a suite that includes office applications like Excel, PowerPoint, and Word), the company also has a strong position in other software verticals, including business intelligence, cybersecurity, and enterprise resource planning.\n\nMicrosoft has added generative AI copilots to several software products and monthly active users surpassed 150 million in the September quarter, up from 100 million in the June quarter. And CEO Satya Nadella told analysts, \"Customers continue to adopt Microsoft 365 Copilot faster than any other Microsoft 365 suite. All up, more than 90% of the Fortune 500 now use Microsoft 365 Copilot.\"\nMeanwhile, Microsoft Azure is the second-largest public cloud in terms of infrastructure and platform services sales. \"Azure has several distinct advantages, including that it offers customers a painless way to experiment and move select workloads to the cloud,\" according to Morningstar analyst Dan Romanoff. \"Based on its investment in OpenAI, the company has also emerged as a leader in AI.\"\n\nMicrosoft owns a 27% equity stake in OpenAI and it has exclusive rights to the AI start-up's most advanced models (e.g., GPT-4 and GPT-5). Also, The Information reports that OpenAI shares 20% of its revenue with Microsoft under the agreement. Those payments will top $1 billion this year, up from about $500 million last year, according to TechCrunch.\nWall Street estimates Microsoft's adjusted earnings will increase at 16% annually through the fiscal year ending in June 2027. That makes the current valuation of 34 times earnings look somewhat expensive. But Microsoft topped the consensus earnings estimate by an average of 8% during the last four quarters, which makes the current valuation look more reasonable. Nvidia is still the more attractive option, but I think patient investors should consider buying a small position in both stocks.\n\nShould you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nTrevor Jennewine has positions in Nvidia and Palantir Technologies. The Motley Fool has positions in and recommends Microsoft, Nvidia, and Palantir Technologies. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nThe Best Artificial Intelligence (AI) Stocks to Buy Ahead of 2026, According to Wall Street Analysts (Hint: Not Palantir) was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 50
}