{
  "stock_id": "AVGO",
  "last_updated": "2025-12-31T17:11:19.902Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-31",
      "Time": "22:51:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Has Barely Budged Since the End of July. What Gets It Going Again.",
      "URL": "https://finance.yahoo.com/m/586cab0b-f177-3383-83f7-a7f71f2dd3c2/nvidia-stock-has-barely.html",
      "Content": "Nvidia Stock Has Barely Budged Since the End of July. What Gets It Going Again.\n\nAdam Clark\nWed, December 31, 2025 at 6:51 AM PST 2 min read\n\nIn this article: NVDA\n\nAMD\n\nAVGO\n\nTSM\n\nTSMWF\n\nNvidia shares are drifting but reports of strong demand for its artificial-intelligence processors in China could point the way to future gains.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "22:12:32",
      "Source": "Argus Research",
      "Title": "Daily Spotlight: Bull Market Set for 2026",
      "URL": "https://finance.yahoo.com/m/c94ab6af-b922-3170-95ed-a8ff6b284f5b/daily-spotlight%3A-bull-market.html",
      "Content": "Daily Spotlight: Bull Market Set for 2026\n\nArgus Research\nWed, December 31, 2025 at 6:12 AM PST 1 min read\n\nIn this article: ^GSPC\n\nAVGO\n\nThe current bull market started on October 12, 2022, and is now more than three years old. During that time, the S&P 500 has risen more than 90%, having endured high inflation, economic uncertainty, a credit rating downgrade of the U.S. Treasury, a hard-fought political election, the onset of tariffs and trade wars, and a government shutdown. Indeed, stocks have been supported by an economy that continues to grow, inflation and interest rates that have been heading lower, and robust profitability from S&P 500 companies. How much farther can this bull market go? We have studied the 13 bull markets that have occurred since the end of World War II. On average, the S&P 500 gained 164% during these 13 periods, which averaged 57 months in duration, or just about five years. We also note that the recent bull markets have generated higher returns over longer periods of time. On average, the five bull markets since 1980 have seen stocks advance about 240% over a period of almost six years. And the bull market prior to the pandemic carried on for 11 years, during which stocks rose 500%. It is worth pointing out, though, that the 2009-2020 bull market began with stocks deeply depressed on valuation, whereas stocks are already near fair value in the current market environment. Even so, if rates continue to head lower on mild inflation news, earnings growth accelerates, and the economy can continue to avoid a recession, then the current bull market, driven by disruptive innovation from the Information Technology sector, may have more room to run. Our 12-month target price for the S&P 500 in 2026 is 7500.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "21:08:23",
      "Source": "Insider Monkey",
      "Title": "Bristol Gate US Equity Strategy: NVDA’s Demand Today is Broadcom’s (AVGO) Opportunity Tomorrow",
      "URL": "https://finance.yahoo.com/news/bristol-gate-us-equity-strategy-130823220.html",
      "Content": "Bristol Gate US Equity Strategy: NVDA’s Demand Today is Broadcom’s (AVGO) Opportunity Tomorrow\n\nSoumya Eswaran\nWed, December 31, 2025 at 5:08 AM PST 3 min read\n\nIn this article: AVGO\n\n^GSPC\n\nNVDA\n\nBristol Gate Capital Partners , an investment management company, published its Q3 2025 investor letter for the “US Equity Strategy”. A copy of the letter can be downloaded here . The strategy underperformed the benchmark, the S&P 500® Total Return Index, this quarter, but still surpassed the index in dividend growth. The underperformance was due to a lack of significant exposure to the AI/TMT sector or the Value sector, which provides advantages stemming from the Federal Reserve's rate cut. The portfolio returned 15% dividend growth over the trailing 12 months, driven by the strong underlying fundamentals. In addition, please check the fund’s top five holdings to know its best picks in 2025.\n\nIn its third-quarter 2025 investor letter, Bristol Gate US Equity Strategy highlighted stocks such as Broadcom Inc. (NASDAQ: AVGO ). Broadcom Inc. (NASDAQ:AVGO) is a leading technology company that designs and develops various semiconductor and infrastructure software solutions. The one-month return of Broadcom Inc. (NASDAQ:AVGO) was -8.31%, and its shares gained 50.90% of their value over the last 52 weeks. On December 30, 2025, Broadcom Inc. (NASDAQ:AVGO) stock closed at $349.85 per share, with a market capitalization of $1.659 trillion.\nBristol Gate US Equity Strategy stated the following regarding Broadcom Inc. (NASDAQ:AVGO) in its third quarter 2025 investor letter:\nBroadcom Inc. (NASDAQ:AVGO) is in the 12th position on our list of 30 Most Popular Stocks Among Hedge Funds . As per our database, 183 hedge fund portfolios held Broadcom Inc. (NASDAQ:AVGO) at the end of the third quarter, which was 156 in the previous quarter. In the fiscal third quarter of 2025, Broadcom Inc. (NASDAQ:AVGO) reported record revenue of $16 billion, up 22% year-over-year. While we acknowledge the potential of Broadcom Inc. (NASDAQ:AVGO) as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\n\nStory continues\nIn another article , we covered Broadcom Inc. (NASDAQ:AVGO) and shared the list of best AI stocks to buy according to analysts. In addition, please check out our hedge fund investor letters Q3 2025 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "21:06:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Is Drifting. This Could Get It Going Again.",
      "URL": "https://finance.yahoo.com/m/586cab0b-f177-3383-83f7-a7f71f2dd3c2/nvidia-stock-is-drifting..html",
      "Content": "Nvidia Stock Is Drifting. This Could Get It Going Again.\n\nAdam Clark\nWed, December 31, 2025 at 5:06 AM PST 2 min read\n\nIn this article: NVDA\n\nAMD\n\nAVGO\n\nTSM\n\nTSMWF\n\nNvidia shares are drifting but reports of strong demand for its artificial-intelligence processors in China could point the way to future gains.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "19:33:01",
      "Source": "Argus Research",
      "Title": "Daily – Vickers Top Buyers & Sellers for 12/31/2025",
      "URL": "https://finance.yahoo.com/m/af00d4c5-ac90-3665-8aed-14502d8d952f/daily-%E2%80%93-vickers-top-buyers-%26.html",
      "Content": "Daily – Vickers Top Buyers & Sellers for 12/31/2025\n\nArgus Research\nWed, December 31, 2025 at 3:33 AM PST\n\nIn this article: AVO\n\nIMNM\n\nAISP\n\nAVGO\n\nCOGT\n\nThe Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "18:30:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Is in a Rut. This Could Get It Going Again.",
      "URL": "https://finance.yahoo.com/m/586cab0b-f177-3383-83f7-a7f71f2dd3c2/nvidia-stock-is-in-a-rut..html",
      "Content": "Nvidia Stock Is in a Rut. This Could Get It Going Again.\n\nAdam Clark\nWed, December 31, 2025 at 2:30 AM PST 2 min read\n\nIn this article: NVDA\n\nAMD\n\nAVGO\n\nTSM\n\nTSMWF\n\nNvidia shares are drifting but reports of strong demand for its artificial-intelligence processors in China could point the way to future gains.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "15:15:00",
      "Source": "Barrons.com",
      "Title": "This Money Pro Sees Higher Stock Prices and More Rate Cuts in 2026",
      "URL": "https://finance.yahoo.com/m/15115e36-0baf-3875-84c5-0ec859bf2bb3/this-money-pro-sees-higher.html",
      "Content": "This Money Pro Sees Higher Stock Prices and More Rate Cuts in 2026\n\nAbby Schultz\nTue, December 30, 2025 at 11:15 PM PST 7 min read\n\nIn this article: ^GSPC\n\nORCL\n\nAVGO\n\nCRWV\n\nGOOG\n\nNancy Curtin, chief investment officer at A1Ti Tiedemann Global, helps wealthy families invest for the long term. An “innovation” bull market helps.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "14:00:00",
      "Source": "Barrons.com",
      "Title": "Even Permabears Have Portfolios. Where Jeremy Grantham Sees Value Now.",
      "URL": "https://finance.yahoo.com/m/d93781f7-95dd-30ef-b538-61ee25130da0/even-permabears-have.html",
      "Content": "Even Permabears Have Portfolios. Where Jeremy Grantham Sees Value Now.\n\nLauren R. Rublin\nTue, December 30, 2025 at 10:00 PM PST 5 min read\n\nIn this article: AVGO\n\nGOOG\n\nQLTY\n\nMSFT\n\nJeremy Grantham was born toward the tail end of the Great Depression, but has surfed plenty of subsequent booms and busts in his storied investment career. Barron’s spoke with Grantham, co-founder of Boston-based GMO, on Dec. 23 about the current stock market boom, his favorite investments, and the economic challenges that lie ahead. What is your stock market forecast for 2026?\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "07:00:04",
      "Source": "The Wall Street Journal",
      "Title": "Wall Street Overcame This Year's Slowdown Predictions",
      "URL": "https://finance.yahoo.com/m/4ff2ff7e-0d3a-34c7-92b4-77338c038037/wall-street-overcame-this.html",
      "Content": "Wall Street Overcame This Year's Slowdown Predictions\n\nDavid Uberti\nTue, December 30, 2025 at 3:00 PM PST 1 min read\n\nIn this article: NVDA\n\nAVGO\n\nGOOG\n\nPLTR\n\nMU\n\nThe 2025 slowdown foreseen by many on Wall Street never materialized in full. Tariff exemptions and a slew of trade deals have limited the inflationary effects of the highest import taxes in decades. And an artificial-intelligence arms race has triggered a capital-spending boom, propelling growth, minting millionaires—and leaving the U.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "05:54:00",
      "Source": "The Wall Street Journal",
      "Title": "U.S. Stocks Defy ‘Sell America’ Warnings and Are Ending 2025 Near Record Highs",
      "URL": "https://finance.yahoo.com/m/c583ffa2-a670-30a0-a641-1553afe4de48/u.s.-stocks-defy-%E2%80%98sell.html",
      "Content": "U.S. Stocks Defy ‘Sell America’ Warnings and Are Ending 2025 Near Record Highs\n\nDavid Uberti\nTue, December 30, 2025 at 1:54 PM PST 5 min read\n\nIn this article: AMD\n\nPLTR\n\nAVGO\n\nGOOG\n\n^GSPC\n\nTrump’s tariff policies didn’t raise prices as much as feared, while an AI arms race powered growth—and the shares of the largest tech companies.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "02:31:52",
      "Source": "Yahoo Finance",
      "Title": "Investors should beware of AI's circular financing trap, look for alternatives like Broadcom",
      "URL": "https://finance.yahoo.com/news/investors-should-beware-of-ais-circular-financing-trap-look-for-alternatives-like-broadcom-183152653.html",
      "Content": "Investors should beware of AI's circular financing trap, look for alternatives like Broadcom\n\nFrancisco Velasquez\nTue, December 30, 2025 at 10:31 AM PST 3 min read\n\nIn this article: AVGO\n\nNVDA\n\n^GSPC\n\nOPAI.PVT\n\nCVX\n\nThe AI gold rush has investors cautious that the industry may be feeding itself through a risky cycle of circular financing.\n\"I would be cautious on the financing aspect of OpenAI, the circular financing,\" Miramar Capital co-founder Max Wasserman told Yahoo Finance's Opening Bid . \"Given the concentration, you need to diversify the portfolio, and you need to understand what you own and what happens if you're wrong.\"\n\nHe added that if the AI trade \"goes south, it's going to take the indices with it.\"\nAn example of this cycle is where Big Tech titans invest billions into AI startups, which then use that money to buy cloud services or hardware from said investor. For instance, OpenAI ( OPAI.PVT ), Yahoo Finance's 2025 Company of the Year , committed to buying 10 gigawatts of Nvidia's ( NVDA ) chips, while Nvidia intends to invest up to $100 billion into the startup.\nWasserman warned that these deals could mask cash burn. \"The stock market valuations are still elevated, given the AI trade, which skews market indices and ignores many inherent risks of the market,\" he added.\nMoreover, as the economy shows signs of cooling, with manufacturing activity dropping and layoffs beginning to tick upward, AI valuations have increasingly veered away from fundamental business reality.\n\n\"I don't think you're going to get these double-, triple-digit returns like you have,\" Wasserman warned. \"I think you have to go to other parts of the market.\"\nFor investors looking to stay in the chip space , Broadcom ( AVGO ) offers a more grounded option.\nUnlike many AI darlings that rely on speculative future software revenue, Broadcom has built a defensive moat through hardware specialization and high-margin integration.\nThis strategy has paid off. Shares are up roughly 51% year to date, significantly outperforming the S&P 500's ( ^GSPC ) 17% gain.\n\nWasserman argued that Broadcom \"is a little misunderstood\" and that its value proposition differs from AI names like Nvidia in three key areas: VMware integration, specialized silicon via custom chips, and consistent dividend discipline.\n\"I think their growth rate and the ownership has been tremendous,\" he said. \"But again, we've been trimming this position because it grew to so much in our accounts.\"\nWasserman forecasts a 2026 shift involving a \"broadening\" of the market. As the Federal Reserve likely cuts interest rates to combat slowing growth, the \"other 493\" stocks in the S&P 500 may finally get their day in the sun.\n\nStory Continues\nThat rotation likely leads back to \"boring\" but reliable cash generators. Retailers and consumer staples like Home Depot ( HD ) and McDonald's ( MCD ) are expected to benefit from lower short-term rates.\nMeanwhile, defensive heavyweights like Chevron ( CVX ), AbbVie ( ABBV ), and Waste Management ( WM ) offer a sanctuary of dividends if the AI bubble begins to leak — or pops, in a worst-case scenario.\nUltimately, investors don't necessarily need to bet against AI, but they should certainly stop betting their entire portfolio on it. \"We continue to caution investors not to become too concentrated in technology,\" Wasserman said.\nFrancisco Velasquez is a Reporter at Yahoo Finance. Follow him on LinkedIn , X , and Instagram . Story tips? Email him at francisco.velasquez@yahooinc.com.\nClick here for the latest technology news that will impact the stock market\nRead the latest financial and business news from Yahoo Finance\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "23:14:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock and the Bright Side of the Groq Deal",
      "URL": "https://finance.yahoo.com/m/a84f7af6-04aa-3bb9-8440-10aa23d41301/nvidia-stock-and-the-bright.html",
      "Content": "Nvidia Stock and the Bright Side of the Groq Deal\n\nAdam Clark\nTue, December 30, 2025 at 7:14 AM PST 2 min read\n\nIn this article: NVDA\n\nAMD\n\nAVGO\n\nGROQ.PVT\n\nNvidia is paying $20 billion for Groq’s technology, including compensation packages for many of the company’s employees who will join Nvidia, The Wall Street Journal reported.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "21:24:00",
      "Source": "MarketBeat",
      "Title": "The Lazy Way to Play NVIDIA’s $20B Groq Deal",
      "URL": "https://finance.yahoo.com/m/05f1a08f-a398-30cc-8b3c-ac263b53534a/the-lazy-way-to-play-nvidia%E2%80%99s.html",
      "Content": "The Lazy Way to Play NVIDIA’s $20B Groq Deal\n\nJeffrey Neal Johnson, MarketBeat\nTue, December 30, 2025 at 5:24 AM PST 6 min read\n\nIn this article: NVDA\n\nSMH\n\nSOXX\n\nAVGO\n\nMU\n\nKey Points The shift from training to inference represents a permanent industrial evolution that solidifies the long term growth trajectory of the chip sector.\nInvestors looking for maximum exposure to the industry leader can use concentrated funds to capitalize on the benefits of a winner-takes-most market.\nDiversified exchange traded funds offer a strategic way to capture the broader rally in memory and networking hardware without relying on a single company.\nInterested in iShares Semiconductor ETF? Here are five stocks we like better.\n\nThe financial world shook in late December 2025 when NVIDIA (NASDAQ: NVDA) announced a strategic move to lock down Groq’s assets and leadership in a deal valued at approximately $20 billion. For Wall Street, this confirms that the artificial intelligence (AI) boom is evolving from a speculative frenzy into a permanent industrial shift.\nWhen a massive acquisition occurs, the target company's stock price often soars, offering quick gains for shareholders who bought early. But in this case, the door was locked, as Groq is not publicly traded. Retail investors cannot purchase shares of Groq directly on the public exchange, creating frustration for those who sought to capitalize on the deal.\n→ Broadcom's Insider Selling: A Big Red Flag, or Business as Usual?\n\nThe only liquid way to capture the value of this deal is through the acquirer, NVIDIA. Yet, betting everything on a single stock carries significant risk, especially with antitrust regulators in the United States and Europe watching the semiconductor sector closely. A blocked deal could send the NVDA stock tumbling.\nThis scenario creates the perfect storm for semiconductor Exchange Traded Funds (ETFs). These funds offer a backdoor entry into the trade, allowing investors to participate in the upside without the stress of managing a single stock ticker. However, not all ETFs are built the same. Understanding the structural differences between ETF strategies like the VanEck Semiconductor ETF (NASDAQ: SMH) and the iShares Semiconductor ETF (NASDAQ: SOXX) is critical to portfolio positioning in 2026.\n\n→ Netflix Is Out of Favor—and That’s Why It’s Getting Interesting\nThe Winner Takes Most Strategy To understand why the VanEck Semiconductor ETF (SMH) is the aggressive choice, investors must first understand the business case behind the merger.\nFor the last two years, the market has focused on Training AI, building the massive digital brains behind chatbots and data models.\n→ Verizon: Out of the Doghouse and Into Your Dividend Portfolio\nThe Groq deal signals a shift to Inference, which is the actual usage of those models to generate instant answers. Groq’s technology acts as a turbocharger for this specific task.\n\nStory Continues\nBy absorbing this technology, NVIDIA cements its dominance in the next phase of the AI cycle. SMH is structured to reward this kind of dominance because it uses a market-cap-weighted system. This means the larger a company gets, the more influence it has on the fund's performance.\nThe Superweight Effect As of late December 2025, NVIDIA constitutes approximately 16% of the SMH fund. This is a significant concentration. For every $1,000 an investor puts into SMH, roughly $210 is a direct wager on the success of the NVIDIA-Groq integration. This lack of a cap is the primary reason SMH is up approximately 50% year-to-date. The fund managers effectively allowed the winner to run, rather than selling shares to rebalance the portfolio.\n\nThe Manufacturing Bonus The fund also offers a secondary benefit: the manufacturing angle. Groq’s high-speed chips require advanced packaging and fabrication to function. The primary beneficiary of this demand is Taiwan Semiconductor (NYSE: TSM), which makes up roughly 10% of SMH.\nBetween NVIDIA and TSMC, nearly 31% of the fund is tied directly to the hardware required for this new deal. For investors who believe the biggest companies will keep getting bigger, SMH serves as a high-octane proxy for the AI trade.\n\nThe Hedged Play: Broad Exposure for the Supercycle While SMH chases the leader, the iShares Semiconductor ETF (SOXX) takes a hedged approach. The key difference lies in its rulebook. SOXX utilizes a capped weighting scheme, meaning no single company is allowed to exceed roughly 8% of the portfolio during rebalancing.\nThis rule explains why SOXX has lagged its counterpart, returning approximately 42% year-to-date compared to SMH’s 50% gain. Even though SOXX holds NVIDIA, the fund is forced to sell shares when the stock rallies to keep the weight at roughly 8%.\n\nWhile this limits the upside during a parabolic rally, it offers significant protection against volatility.\nThe Memory Supercycle The bull case for SOXX relies on the idea that the AI rally will broaden beyond just one company in 2026. While headlines focus on NVIDIA’s processors, AI models require massive amounts of High Bandwidth Memory (HBM). A shortage in this sector has created a pricing supercycle for companies like Micron (NASDAQ: MU). Because a single stock does not dominate SOXX, it offers more equal weighting across these secondary winners.\n\nNetworking and Infrastructure SOXX also provides deeper exposure to Broadcom (NASDAQ: AVGO). As AI data centers grow, Broadcom's cabling and networking chips become essential. If the Department of Justice or international regulators decide to block the NVIDIA-Groq deal, NVIDIA stock could face high volatility or a sharp correction. In that scenario, the capped structure of SOXX acts as a safety net. It protects the investor from a single-stock crash while still capturing the broader sector rally led by memory and networking stocks.\n\nChoosing Your Strategy for 2026 The choice between these two funds ultimately comes down to an investor's risk tolerance and their view on the regulatory landscape for 2026. The 2025 market data provides a clear picture of where the smart money is currently moving.\nInvestors have favored the aggressive strategy this year. SMH saw net inflows of over $2 billion, while SOXX experienced net outflows of roughly $4.5 billion. This divergence suggests that institutional investors are currently willing to accept higher risk to chase the performance of the industry leaders.\n\nHowever, following the herd isn't always the right move for an individual portfolio. Here is a simple framework for deciding which fund fits your goals:\nScenario A: The Bullish Aggressor The Thesis: You believe NVIDIA will execute the Groq integration flawlessly and that Inference will be a winner-take-all market dominated by a single player.\nThe Pick: SMH. Its uncapped structure ensures you capture the maximum upside of the deal. You are comfortable with the risk that if NVIDIA sneezes, your portfolio catches a cold.\n\nScenario B: The Cautious Optimizer The Thesis: You believe the semiconductor sector will rise, but you worry about trade wars, tariffs, or antitrust lawsuits hitting the biggest players. You want to bet on the Industrial Revolution of AI, not just one company.\nThe Pick: SOXX. Its diversified, capped structure mitigates the risk of any single company failing, offering a smoother ride.\n\nPositioning for the Next Phase of Growth The $20 billion NVIDIA-Groq deal serves as a powerful validation that the semiconductor supercycle is far from over. The innovation engine driving the modern economy is still running hot, fueled by the rapid transition from building AI models to deploying them in the real world.\nFor investors, the most dangerous decision in 2026 may be having no exposure at all. Whether one chooses the concentrated aggression of SMH or the diversified safety of SOXX, the semiconductor sector remains a cornerstone of a modern growth portfolio. The technology is shifting, and the market is moving with it. By choosing the ETF that aligns with their risk tolerance, investors can ensure they are part of the next leg of the rally.\nThe article \" The Lazy Way to Play NVIDIA’s $20B Groq Deal \" was originally published by MarketBeat.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "20:54:28",
      "Source": "24/7 Wall St.",
      "Title": "3 ETFs Warren Buffett Is Quietly Keeping in His Secret Portfolio",
      "URL": "https://finance.yahoo.com/m/7bd4ff5d-7589-30b7-8947-226736e3b2d9/3-etfs-warren-buffett-is.html",
      "Content": "3 ETFs Warren Buffett Is Quietly Keeping in His Secret Portfolio\n\nOmor Ibne Ehsan\nTue, December 30, 2025 at 4:54 AM PST 5 min read\n\nIn this article: BRK.A\n\nAVGO\n\nBRK-B\n\n^GSPC\n\nIEFA\n\nQuick Read Berkshire Hathaway (BRK.B) owns New England Asset Management which holds ETFs in a separate portfolio. Berkshire increased IEFA holdings by 35% and IDEV by 30% in Q3.\nIEFA and IDEV target developed international markets excluding the US. Both outperformed the S&P 500 year-to-date with returns above 27%.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "20:45:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Gains. How Groq Can Help Defend Its AI Chip Dominance.",
      "URL": "https://finance.yahoo.com/m/a84f7af6-04aa-3bb9-8440-10aa23d41301/nvidia-stock-gains.-how-groq.html",
      "Content": "Nvidia Stock Gains. How Groq Can Help Defend Its AI Chip Dominance.\n\nAdam Clark\nTue, December 30, 2025 at 4:45 AM PST 2 min read\n\nIn this article: NVDA\n\nGROQ.PVT\n\nAMD\n\nAVGO\n\nNvidia is paying $20 billion for Groq’s technology, including compensation packages for many of the company’s key employees who will join Nvidia, The Wall Street Journal reported.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "16:56:10",
      "Source": "Bloomberg",
      "Title": "Korea Crushes Global Benchmarks With Best Stock Rally Since 1999",
      "URL": "https://finance.yahoo.com/news/korea-crushes-global-benchmarks-best-085610450.html",
      "Content": "Korea Crushes Global Benchmarks With Best Stock Rally Since 1999\n\nYoukyung Lee\nUpdated Tue, December 30, 2025 at 3:22 AM PST 4 min read\n\nIn this article: 278470.KS\n\nSSNLF\n\n000660.KS\n\n267260.KS\n\n090430.KS\n\n(Bloomberg) — South Korea’s stock market renaissance in 2025 was one for the history books. Buoyed by world-beating gains in arms exporters to eye-popping surge in AI and K-beauty shares, the market just capped its strongest advance in a quarter century.\nThe Kospi ( ^KS11 ) Index has soared 76% this year, compared with the S&P 500’s 17% advance so far and MSCI Asia Pacific Index’s 25% gain. The Korean benchmark’s performance, the best among major equity gauges, has been helped by chip heavyweights Samsung Electronics Co. and SK Hynix Inc. as well as defense and nuclear firms.\n\nMost Read from Bloomberg\nLondon’s Love of Wood-Burning Stoves Sparks a Pollution Debate\nAnalysts see further upside ahead, with Citigroup Inc., JPMorgan Chase & Co. and Nomura Holdings Inc. among brokers forecasting at least another 20% climb next year. Strong earnings growth should bolster that upward trajectory, analysts add.\nHere is a recap of the winners and losers from the market in 2025.\nAI Proxy Trades The biggest artificial intelligence winners weren’t conventional chipmakers or large-cap names but proxy plays. That includes power transformer maker Hyosung Heavy Industries Corp. and nuclear power provider Doosan Enerbility Co., which saw shares up more than 320% each this year, according to Korea Exchange prices.\n\nDespite their high valuations, bulls argue that there’s no quick carbon-free alternative to meet surging power demand of AI data centers, making these players indispensable.\nInvestor interest in power grid and infrastructure stocks should continue into 2026, according to Morgan Stanley analysts. Among them, HD Hyundai Electric Co. is entering “a multi-decade re-rating as grid modernization, AI data center, and decarbonization converge,” they said.\nMemory Bulls Samsung and SK Hynix had a standout year, cementing their status as Kospi heavyweights and the world’s top manufacturers of memory chips. Thanks to growing demand from global tech giants for specialized, high-performance chips, Samsung has jumped 125% this year to an all-time high. SK Hynix rose about 270%.\n\nThe momentum has spilled over into related firms like SK Hynix’s parent SK Square Co. and Korea Circuit Co., which counts Broadcom Inc. as its customer. Both stocks are up more than 330% each.\n“Shortages in memory chips are unquestionably taking hold so I expect an extremely strong year for Korean semiconductor stocks,” said Kang DaeKwun, chief investment officer at Life Asset Management in Seoul.\nDefense Stars President Donald Trump’s reshaping of traditional security alliances spurred new defense spending across Europe and Asia this year, driving renewed interest in Korean contractors known for delivering weapons faster and at lower cost.\n\nStory Continues\nHanwha Aerospace Co., maker of the K9 self-propelled howitzer, emerged as one of the biggest winners, with shares up nearly 200% this year. Shipbuilder Hanwha Ocean Co. has jumped 204%.\nMust Asset Management says that given recent success by local companies making inroads in Europe, these firms will likely see more partnerships in coming years among NATO members.\n\nK-Beauty Leaders Less than two years after its IPO, APR Corp. has leapfrogged beauty giants Amorepacific Corp. and LG H&H Co. in market value. Up 362%, the Medicube maker and at-home beauty device leader topped stock gains in the MSCI Korea Index.\n“To me, APR’s outperformance isn’t just about better execution. It’s about playing a different game,” said Jung In Yun, chief executive officer at Fibonacci Asset Management Global in Singapore. “It sells outcomes and experiences through social-first channels, not just skincare through traditional retail.”\n\nLG H&H, the company behind The Whoo skincare brand, recorded a fifth consecutive year of stock declines, while Amorepacific has risen 14% this year. Investors say that expectations are high for APR to continue outperforming, though its high valuation makes the stock vulnerable to sharp swings if setbacks occur.\nLosing Games Despite Korea’s broad market rally, game developers were notably left behind. Krafton Inc., has lost about one-fifth of its market value while Com2uS Corp. shed more than one-third. Worries about their limited appeal in Asia and inability to compete with Chinese rivals have forced investors to look elsewhere.\n\nWith demand for Korean role-playing games constrained in Asia, the upside remains limited, according to Life Asset’s Kang.\nOther equity market loser standouts include electric vehicle supply chain companies hit by dwindling demand for EVs. Before Ford Motor Co. ended its partnership with one of Korea’s biggest battery makers, widening technological gaps with Chinese rivals had already weighed on the sector. Among the biggest losers is Enchem Co., which saw shares slump about 50%. Shares of SK Innovation Co., one of South Korea’s three main battery suppliers, ended the year in the red.\n(Updates with prices as of Tuesday close.)\nMost Read from Bloomberg Businessweek\nErasing the Verdict: The Ongoing Shock of Trump’s Cocaine Kingpin Pardon\nJapan’s Viral Horse-Racing Video Game Has Players Flocking to Real-Life Stables\nChina’s EV Battery Giant Is Trying to Find a New Road\nThat Time I Tried to Buy OpenAI\nThe United States of Klarna\n©2025 Bloomberg L.P.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "13:00:27",
      "Source": "Insider Monkey",
      "Title": "Broadcom Inc. (AVGO) up 51% YTD, Wall Street Still Sees 31% Upside",
      "URL": "https://finance.yahoo.com/news/broadcom-inc-avgo-51-ytd-050027389.html",
      "Content": "Broadcom Inc. (AVGO) up 51% YTD, Wall Street Still Sees 31% Upside\n\nTalha Qureshi\nMon, December 29, 2025 at 9:00 PM PST 2 min read\n\nIn this article: AVGO\n\nTFC\n\nBroadcom Inc. (NASDAQ: AVGO ) is among the Stocks That Will Make You Rich in 2026 . Broadcom Inc. (NASDAQ:AVGO) has gained more than 51% year-to-date, and Wall Street still sees around 31% upside from the current levels.\nRecently, on December 19, William Stein from Truist Financial reiterated a Buy rating on the stock with a $329.88 price target. Earlier on December 15, Timothy Arcuri of UBS also reiterated a Buy rating on the stock and raised the price target from $472 to $475.\nAnalysts at Truist noted that they adjusted the price target after establishing 2027 estimates for the semiconductor and AI sector. The firm sees the AI infrastructure companies as cheaply valued, considering the growth potential. Truist acknowledged that the AI industry is faced with the challenge of power resources and the investment to build the power infrastructure. However, regardless, the analysts see a rise in AI expenditure in 2026 and more upside for companies like Broadcom Inc. (NASDAQ:AVGO) compared to the diversified semiconductor group.\n\nOn the other hand, UBS expects the company to exceed the $60 billion revenue target in 2026, reflecting a threefold year-over-year increase. The firm noted that this is mainly due to the 50% quarter-over-quarter increase in the company’s backlog during Q4. Its backlog stood at $73 billion, which is expected to be shipped in the next 12-months rather than 18 months.\n​Broadcom Inc. (NASDAQ:AVGO) designs, develops, and supplies various semiconductor devices and infrastructure software solutions worldwide. The company operates in two segments: Semiconductor Solutions and Infrastructure Software.\nWhile we acknowledge the potential of AVGO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "04:20:48",
      "Source": "Motley Fool",
      "Title": "Why One Fund Ditched Viper Energy in a $12 Million Exit Amid a 20% Stock Slide",
      "URL": "https://finance.yahoo.com/m/768da0a6-deef-3ef7-8b03-4d1149ccd56f/why-one-fund-ditched-viper.html",
      "Content": "Why One Fund Ditched Viper Energy in a $12 Million Exit Amid a 20% Stock Slide\n\nJonathan Ponciano, The Motley Fool\nMon, December 29, 2025 at 12:20 PM PST 4 min read\n\nIn this article: AVGO\n\nAAPL\n\nKey Points Michigan-based Nemes Rush Group sold 319,503 shares of Viper Energy in the third quarter.\nThe position was worth an estimated $12.18 million as of the previous period.\nThe move marked an exit for Nemes Rush, which reported holding no VNOM shares as of September 30.\nThese 10 stocks could mint the next wave of millionaires ›\n\nOn November 13, Michigan-based Nemes Rush Group disclosed it sold out its entire position in Viper Energy (NASDAQ:VNOM) , reducing holdings by 319,503 shares worth an estimated $12.18 million.\nWhat Happened According to a Securities and Exchange Commission (SEC) filing dated November 13, Nemes Rush Group sold all 319,503 shares of Viper Energy (NASDAQ:VNOM) during the third quarter. The estimated transaction value was approximately $12.18 million based on average quarterly pricing.\nWhat Else to Know The fund's VNOM stake previously comprised 1.33% of reportable AUM.\nTop holdings after the filing:\nNASDAQ:AVGO: $55.44 million (5.5% of AUM)\nNASDAQ:AAPL: $52.14 million (5.2% of AUM)\nNASDAQ:MSFT: $42.41 million (4.2% of AUM)\nNASDAQ:GOOGL: $38.28 million (3.8% of AUM)\nNASDAQ:NVDA: $37.42 million (3.7% of AUM)\n\nAs of Monday, Viper Energy shares were priced at $38.48, down 20% over the past year and well underperforming the S&P 500, which is instead up about 15.5% in the same period.\nCompany Overview Metric\nValue\nRevenue (TTM)\n$1.19 billion\nNet income (TTM)\n$243.66 million\nDividend yield\n5.5%\nPrice (as of Monday)\n$38.48\n\nCompany Snapshot Viper Energy owns and manages mineral interests in oil and natural gas properties, primarily in the Permian Basin and Eagle Ford Shale\nThe company generates revenue from royalties on hydrocarbon production\nIt operates as a subsidiary of Diamondback Energy\nViper Energy focuses on acquiring and managing mineral rights in key U.S. oil and gas basins, enabling participation in upstream production economics while minimizing capital expenditures and operational risks. The company’s business model is based on collecting royalties from operators extracting oil and gas on its acreage.\n\nFoolish Take What makes this exit worth watching is not the size of the sale but what it signals about investor tolerance for volatility in income-focused energy plays. Viper Energy is not a growth stock -- it’s a royalty business designed to convert commodity exposure into cash flow, dividends, and buybacks. That model has worked operationally, but the share price recently has not worked out so well.\n\nIn the third quarter, Viper produced more than 108,000 barrels of oil equivalent per day and generated $165 million in pro forma cash available for distribution. It returned 85% of that cash to shareholders through a $0.58 combined base and variable dividend and $90 million in buybacks. That translated into an annualized yield north of 6% at recent prices. At the same time, reported results showed a net loss driven by non-cash impairment charges tied to asset transfers, not underlying operating weakness.\n\nFor a diversified fund, trimming or fully exiting a sub 2% position after a sharp drawdown can be a portfolio hygiene move rather than a fundamental call, and that may be what long-term investors should most keep in mind here.\n\nStory Continues\nGlossary Assets under management (AUM): The total market value of investments managed by a fund or investment firm.\n13F reportable assets: Securities that institutional investment managers must disclose quarterly to the SEC if over a certain threshold.\nLiquidated: Sold off an entire investment position, reducing holdings to zero.\n\nDividend yield: Annual dividends paid by a company divided by its share price, shown as a percentage.\nTrailing twelve months (TTM): Financial data covering the most recent 12 consecutive months.\nMineral interests: Ownership rights to minerals (like oil or gas) beneath land, often generating royalties.\nRoyalties: Payments made to mineral rights owners based on production or revenue from resource extraction.\nUpstream production: The exploration and extraction phase of oil and gas operations, before refining or distribution.\nCapital expenditures: Funds used by a company to acquire or upgrade physical assets such as property or equipment.\nOperational risks: Potential losses resulting from failed internal processes, systems, or external events.\nDon’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $494,182 !*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $52,012 !*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $509,470 !*\nRight now, we’re issuing “Double Down” alerts for three incredible companies , available when you join Stock Advisor , and there may not be another chance like this anytime soon.\nSee the 3 stocks »\n*Stock Advisor returns as of December 29, 2025\nJonathan Ponciano has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Apple, Microsoft, and Nvidia. The Motley Fool recommends Broadcom and Viper Energy and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nWhy One Fund Ditched Viper Energy in a $12 Million Exit Amid a 20% Stock Slide was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "03:30:00",
      "Source": "Yahoo Finance Video",
      "Title": "AI chipmakers that could steal some of Nvidia's spotlight in 2026",
      "URL": "https://finance.yahoo.com/video/ai-chipmakers-could-steal-nvidias-193000972.html",
      "Content": "AI chipmakers that could steal some of Nvidia's spotlight in 2026\n\nYahoo Finance Video and Jared Blikre\nMon, December 29, 2025 at 11:30 AM PST\n\nIn this video: NVDA\n\nAMD\n\nAVGO\n\nARM\n\nNvidia ( NVDA ) announced a deal to acquire AI hardware and software designer Groq ( GROQ.PVT ) for $20 billion last week. While the semiconductor manufacturer remained a major AI player in 2025, who could be some of Nvida's biggest competition in the fast-approaching 2026?\nTECHnalysis Research, LLC President Bob O'Donnell sits down with Yahoo Finance markets and data editor Jared Blikre on Market Catalysts to discuss which chipmaker could gain more prominence next year.\nAlso catch Bob O'Donnell's predictions for agentic AI in 2026 as it relates to cybersecurity usage.\nTo watch more expert insights and analysis on the latest market action, check out more Market Catalysts .\n\nVideo Transcript\n\n00:00 Jared\nAnd another thing people have been uh some of the critics have been pouuncing on is all the spending, the capital expenditures, so-called CAPEX. Uh we saw that it's been exploding over the last few years. It's set to continue next year. But uh we've seen in the Mag 5, for instance, we used to kind of talk about them or the Mag 7 uh as a whole. It's really only Alphabet and Nvidia, maybe Tesla as a come behind story that have really surged this year. So is it a game of have and have nots or how do you see this playing out?\n00:32 Bob\nNo, it's a great question. I mean, look, I think Nvidia obviously continues to do well, but I also am certain that Nvidia is going to heck get a heck of a lot more competition in 2026. AMD is, you know, an obvious one, but there's a lot of other little players. I mean, you know, Nvidia's uh deal with Grock recently to bring more of their technology in is a reflection of the fact that we're seeing more specialized types of models being developed. We're we're going from the days of big general purpose LLMs that you can use for everything to much more specialized areas. And each of those are going to require different types of hardware and I think in turn that's going to create additional opportunities, but it's going to create more diversity, which is going to be a little harder to figure out. But obviously I think, you know, you're going to continue to see folks like Nvidia and AMD do well. I do, as I said, I think you're going to start to see uh some of the smaller the cloud guys who are doing custom chips often through Broadcom will also start to benefit. We've seen already, you know, Google's been doing more with TPUs, uh Amazon has their Graviton chips. Um, we've got a a bunch of other companies. Microsoft is doing custom chips. A lot of these are arm-based. So arm is another company, you know, we haven't been talking about them a lot lately, but arm's helping drive some of this innovation. Intel, as you've talked about, you know, is doing well. They continue to plug away. Obviously, they had their challenges last year, but things are looking better in 2026. So, I think we're going to see a lot of different players uh from different areas uh all start to come together. And we'll see some smaller companies. Uh there's a little company called SiTime that does uh timing chips and all these networks have to be completely aligned from a timing perspective. They're doing some interesting stuff. So, I think there's a lot of different opportunities in different areas. Um but we're going to have a lot of the bears on the side just again, waiting to pounce on these oper these concerns that get raised, I think around a gentic AI.\n02:29 Jared\nAnd we'll have to see if those are dips worth buying or not. And Bob, what I'm realizing is we got to do another podcast real soon. So thank you for showing up.\n02:39 Bob\nYeah, man, I'd love to.\n02:40 Jared\nIt was great seeing you here.\n02:41 Bob\nThanks, Jared.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "03:15:00",
      "Source": "MarketBeat",
      "Title": "Why Q4 Earnings Season Could Be a Bullish Catalyst for S&P 500 Stocks",
      "URL": "https://finance.yahoo.com/m/894fe7e6-828c-327a-88f5-7feb39eabd35/why-q4-earnings-season-could.html",
      "Content": "Why Q4 Earnings Season Could Be a Bullish Catalyst for S&P 500 Stocks\n\nThomas Hughes, MarketBeat\nMon, December 29, 2025 at 11:15 AM PST 4 min read\n\nIn this article: ^GSPC\n\nORCL\n\nXLP\n\nXLI\n\nXLU\n\nKey Points The Q4 earnings reporting cycle is at hand, and investors should expect significant outperformance relative to the 2025 year-end consensus.\nAI underpins the expected strength, but so too does economic health and consumer spending.\nThe S&P 500 is poised to reach 7,400 by early 2026 and then continue trending higher through the end of the year.\nInterested in SPDR S&P 500 ETF Trust? Here are five stocks we like better.\n\nThe Q1 2026 earnings reporting season—when most companies deliver Q4 2025 results—is shaping up to be a bullish catalyst for the S&P 500.\nUncertainty and concerns, bricks in the Wall of Worry, kept analysts from lifting their estimates in late 2025, despite the many strengths revealed in Q3 that were setting the index up to outperform. As of year-end, the consensus estimate is rising but remains well below where the tally will likely be at the end of the period.\n→ Broadcom's Insider Selling: A Big Red Flag, or Business as Usual?\nThe S&P 500 tends to outperform its season-starting consensus by at least a few hundred basis points. The trend in 2025 is outperformance at the high end of the range, closer to 500 basis points, and the Q3 results were much stronger. The average S&P 500 company outperformed by 570 basis points, suggesting that Q4 results will top out in the 14% range, perhaps even higher.\nWith this in play, the bullish trends at the end of 2025, including an outlook for earnings growth, growth acceleration throughout 2026, and an uptrend in the all-index consensus forecast, will continue to lift stocks in 2026.\n→ Netflix Is Out of Favor—and That’s Why It’s Getting Interesting\nThe Market Rally Could Broaden Beyond Tech in Early 2026 While the Information Technology Sector (NYSEARCA: XLK) is expected to lead in growth and likely outperform its consensus, other sectors will contribute to market enthusiasm. Analysts have lifted the consensus forecast for technology, underpinning the quarterly index forecast, but lowered the bar for nearly all other sectors.\n\n→ 5 Stocks Set to Start Strong in January and Lead Through 2026\nCertain sectors are well-positioned to exceed their forecasts and provide optimistic guidance for the year, offering investors an alternative to technology and the AI trade. Investors can access these sectors through ETFs that track them, such as the Consumer Staples Select Sector SPDR Fund (NYSEARCA: XLP), Consumer Discretionary Select Sector SPDR Fund (NYSEARCA: XLY), Utilities Select Sector SPDR Fund (XLU), Industrial Select Sector SPDR Fund (NYSEARCA: XLI), and Health Care Select Sector SPDR Fund (NYSEARCA: XLV).\n\nStory Continues\nBut don’t discount the AI trade. AI will continue to underpin the technology sector’s revenue and earnings growth outlook, as well as those of other sectors. Businesses unable to monetize AI with their clients are using it to improve operational and business quality, thereby strengthening margins, earnings, and cash flow.\n\nNVIDIA (NASDAQ: NVDA) remains the tech sector leader and is expected to grow its revenue by more than 65% in Q1, while also widening its margin. Other anticipated tech winners include Microsoft (NASDAQ: MSFT), Broadcom (NASDAQ: AVGO), and Micron Technology (NASDAQ: MU), which are forecast to grow revenue by 25%, 27%, and over 100%, respectively, but it will be the guidance that matters most. Signs at the end of 2025 suggest that AI spending trends will remain robust, with demand for GPUs, the HBM memory that supports them, and AI computing capacity sold out.\nCapital Returns Could Reinforce the Bull Case Analyst outlook on share buybacks in 2026 varies but is generally bullish for stock prices. The consensus is for margin improvement and cash flow health to at least support buyback activity, if not lead to increases, and updates are expected during the Q1 reporting season.\nSectors best-positioned to issue increases include financials (expected to grow earnings by more than 6% in CQ4) and technology (which has significantly benefited from its AI-enhanced cash flow). Companies including NVIDIA, Advanced Micro Devices (NASDAQ: AMD), and Micron have seen their cash hoards grow, putting them in fortress-like positions to invest in growth, return capital, and sustain balance-sheet health.\n\nThe takeaway for investors is that the S&P 500 is in an uptrend and the Q1 2026 reports are unlikely to end it. The more likely scenario is that this index will continue moving higher, setting fresh highs in Q1 and later in the year. The 2025 price action suggests the April-to-October rally is only half the move, and another significant updraft is coming. Assuming the index outperforms as trends suggest and the outlook remains favorable, the S&P 500 could reach the 7,400 level before the end of Q1 2026 and then continue moving higher through the year’s end.\nThe article \" Why Q4 Earnings Season Could Be a Bullish Catalyst for S&P 500 Stocks \" was originally published by MarketBeat.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "01:43:00",
      "Source": "MarketBeat",
      "Title": "Broadcom's Insider Selling: A Big Red Flag, or Business as Usual?",
      "URL": "https://finance.yahoo.com/m/b15bd92b-7862-3705-a077-66431c605c29/broadcom%27s-insider-selling%3A-a.html",
      "Content": "Broadcom's Insider Selling: A Big Red Flag, or Business as Usual?\n\nLeo Miller, MarketBeat\nMon, December 29, 2025 at 9:43 AM PST 4 min read\n\nIn this article: AVGO\n\nKey Points Broadcom’s share price hit an all-time high on Dec. 10, but plummeted after its earnings report released the next day.\nLate-December insider selling looks worse than it is because many sales were “sell-to-cover” transactions tied to restricted stock unit vesting and tax withholding.\nCEO Hock Tan’s $42.4 million sale stands out, but filings indicate it was connected to an exchange fund diversification move, not a clear negative call on the business\nInterested in Broadcom Inc.? Here are five stocks we like better.\n\nRecent events have rattled investor confidence in semiconductor giant Broadcom (NASDAQ: AVGO). The company’s latest earnings release led to a dramatic sell-off.\nAfter reaching an all-time closing high of around $412 on Dec. 10, shares dropped as much as 21%, closing near $325 on Dec. 17. By the Dec. 26 close, the stock had recovered moderately to around $350.\n→ Broadcom's Insider Selling: A Big Red Flag, or Business as Usual?\nHowever, concerns linger around the company’s gross margins going forward, a dynamic that seems to be keeping a lid on Broadcom’s share price.\nAdding to the uncertainty is a burst of sales from Broadcom insiders in late December. At a time when Broadcom shareholders could use a boost in confidence, several Broadcom insiders are selling. Let’s break down these insider moves and gain clarity on how concerned investors should be.\n\n→ Netflix Is Out of Favor—and That’s Why It’s Getting Interesting\nWhy Broadcom Insider Sales Appear Concerning Since it released its earnings on Dec. 11, Broadcom has seen eight separate insider sales, worth approximately $66.7 million in total. The vast majority were not made under a predetermined 10b5-1 plan. Insiders must schedule 10b5-1 sales well in advance of when they actually take place, greatly limiting their utility in reacting to recent developments. Therefore, 10b5-1 plan sales don’t provide much of a near-term bearish signal. In contrast, sales not made under these plans are much more likely to provide a pessimistic signal in the near term.\n\n$66.4 million, or 99% of the value of Broadcom’s recent insider sales, did not come under a predetermined plan. This suggests that these insiders may have made these sales in reaction to Broadcom’s latest report and the ensuing sell-off. At first glance, these sales certainly appear worrisome. However, a key detail of these sales pushes back on this interpretation significantly.\n→ 5 Stocks Set to Start Strong in January and Lead Through 2026\nInsider Sale Impetus: RSU Requirements and CEO Diversification The Form 4 SEC filing provides details on the reasoning behind every insider sale. In six out of the seven non-105b-1 sales, the following disclosure appears:\n\nStory Continues\n“Shares were sold through automatic transactions to cover withholding taxes due upon the vesting of restricted stock units (\"RSUs\") as required under the relevant RSU awards.”\nThis means that despite not coming under a 105b-1 plan, these sales were not discretionary. They covered the taxes incurred from these insiders' vested RSUs. RSU awards are a type of stock-based compensation.\n\nEmployees must continue working for their company through the RSU vesting period to actually receive these stock awards. Once this happens, employees incur a tax liability, which, in Broadcom’s case, is automatically covered by selling some of the stock they were just awarded.\nThus, sales made for this purpose do not provide a bearish signal, as they are simply a formality.\nAbout $24 million worth of Broadcom’s recent sales, coming from three insiders, fall into this category. That leaves us to reconcile Hock Tan’s $42.4 million sale.\nHock Tan’s Sale Stands Out, but the Structure Matters Tan sold 130,000 shares, leaving him with 1,078,474 shares after the transaction. This includes 595,638 shares owned indirectly through a trust and 482,836 shares owned directly. Doing the math, Tan reduced his total position in Broadcom by around 11%.\nWhile a significant reduction in his position, investors should review the notes of his Form 4 filing, which state, “The reporting person contributed shares into an exchange fund.” This suggests that Tan made this sale to diversify his portfolio, selling Broadcom to buy an ETF. This dampens the bearishness of his sale.\n\nAVGO Insiders Aren’t Panicking; Neither Should Investors Broadcom’s recent insider sales, although significant, should not deter investors. Tan’s sale is the only one that is potentially worrisome, as an 11% decline in his position is meaningful. However, Tan still maintains a massive position in Broadcom. His artificial intelligence-influenced pay package is expected to significantly increase his position over the coming years, assuming Broadcom’s success continues. Thus, it is not alarming to see him moderately diversify his holdings.\nOne More Data Point: A Small Insider Buy On the other side of the ledger, Broadcom director Harry L. You reported buying 1,000 shares on Dec. 18 at roughly $325.13. It’s not a huge purchase relative to Broadcom’s market cap, but it does matter as a signal: insiders rarely buy for administrative reasons.\nThe article \" Broadcom's Insider Selling: A Big Red Flag, or Business as Usual? \" was originally published by MarketBeat.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "01:30:46",
      "Source": "24/7 Wall St.",
      "Title": "Billionaires Dump the Magnificent Seven and Load Up on These Stocks",
      "URL": "https://finance.yahoo.com/m/d55fce68-c7c0-3d3c-b684-9e2856308324/billionaires-dump-the.html",
      "Content": "Billionaires Dump the Magnificent Seven and Load Up on These Stocks\n\nVandita Jadeja\nMon, December 29, 2025 at 9:30 AM PST 5 min read\n\nIn this article: NVDA\n\nAMZN\n\nPLTR\n\nADBE\n\nAVGO\n\nQuick Read Billionaire Stanley Druckenmiller fully exited Nvidia and Palantir positions.\nKen Griffin reduced his Amazon stake by 39% by selling 2.1 million shares.\nBridgewater Associates and Tiger Global Management increased their positions in Adobe and Broadcom.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "23:48:09",
      "Source": "Yahoo Finance Video",
      "Title": "Chip sales could top $1T in 2026. Is Nvidia still top AI play?",
      "URL": "https://finance.yahoo.com/video/chip-sales-could-top-1t-154809053.html",
      "Content": "Chip sales could top $1T in 2026. Is Nvidia still top AI play?\n\nYahoo Finance Video and Brian Sozzi\nMon, December 29, 2025 at 7:48 AM PST\n\nIn this video: NVDA\n\nMSFT\n\nADI\n\nKLAC\n\nAMZN\n\nWhile Nvidia ( NVDA ) was one of the standout winners of the AI trade in 2025, will the chipmaker remain a tried-and-true stock pick in 2026?\nWinthrop Capital Chief Investment Officer Adam Coons weighs in on the importance of diversification in the artificial intelligence ecosystem, especially as Bank of America analysts forecast semiconductor sales to top $1 trillion next year. Yahoo Finance senior reporter Brooke DiPalma also joins the discussion.\nTo watch more expert insights and analysis on the latest market action, check out more Opening Bid .\n\nVideo Transcript\n\n00:00 Speaker A\nAdam, what's the the best course of action for the average investor? Do they waste a whole day trying to find the next big play in AI or do they just say, you know what? Nvidia's going to win this whole damn thing? I'm just going to bet on them again next year.\n00:15 Adam\nYeah, I definitely wouldn't uh just bet on Nvidia. I I think you do need to do your homework if you want to buy specific names. I think probably the general investor is probably better finding some sort of basket to kind of play the overall space. Uh but we're very early innings in this and\n00:41 Adam\nobviously Nvidia is the winner right now, but uh to say, you know, in five years that we look back that they're going to be the dominant player still, very, very unlikely. Like I said, this is really an evolving space. So I I would be careful with something that's so specific as Nvidia. Uh we kind of like to barbell this with, you know, something like the the big hyperscaler like a like an Alphabet Google, uh because that's really the type of name that uh you could probably have a little bit more comfort in because they just\n01:14 Adam\noverall, the AI story is just benefiting an already existing business model that was doing well. So, I think you would just want to be careful with what we're calling kind of the one trick ponies, like a Nvidia, uh a Core Weve or a Patier right now.\n01:31 Speaker A\nUh, Brooke, let me get over to you because I think what you're seeing in industrial metals and some of the things that Adam's talking about fits nicely with what we heard from Ed Yardini this morning that he might see it is likely to see we are likely to see a broadening out in this rally. Investors doing their homework, trying to get outside of the tried and true Mag 7.\n01:53 Brooke\nYeah, Brian, what we did hear from Ed Danny over the weekend was really ongoing momentum in this market in 2026. He maintained that year end target for the S&P 500 of 7,700 and he said largely it won't be really led by uh the Mag 7, but also what he called the impressive 493 of the S&P 500 as really this broadening out, this boost in productivity growth really leads to overall returns for the\n02:26 Brooke\nS&P 500 in 2026. Specifically, you know, he went on to say that that is really where exactly investors should be thinking about this mindset. You know, not really overweight technology, but more so thinking about the other users of AI as opposed to just the producers of AI. And so certainly he's not alone in this uh momentum that he thinks will exist within 2026 ongoing from what we've seen so far in the returns in 2025.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "23:01:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Slips as Groq Deal Raises Questions",
      "URL": "https://finance.yahoo.com/m/95a0cad5-3b27-3e4d-87f7-d72c690058be/nvidia-stock-slips-as-groq.html",
      "Content": "Nvidia Stock Slips as Groq Deal Raises Questions\n\nAdam Clark\nMon, December 29, 2025 at 7:01 AM PST 3 min read\n\nIn this article: NVDA\n\nGROQ.PVT\n\nAMD\n\nAVGO\n\nNvidia was dropping early on Monday. Broader jitters about the technology sector looked to be hurting the stock, while Wall Street assessed the reported $20 billion price tag put on Nvidia’s agreement to license technology from artificial intelligence chip start-up Groq. Nvidia shares were down 1.6% at $187.45 in early trading, while the technology-heavy Nasdaq Composite lost 0.4%.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "21:24:02",
      "Source": "Investor's Business Daily",
      "Title": "AI Stocks Face 'Show Me' Moment: Why OpenAI's Success Or Failure Is Key",
      "URL": "https://finance.yahoo.com/m/684c930d-1475-3adc-b013-ae604c056ebc/ai-stocks-face-%27show-me%27.html",
      "Content": "AI Stocks Face 'Show Me' Moment: Why OpenAI's Success Or Failure Is Key\n\nREINHARDT KRAUSE\nMon, December 29, 2025 at 5:24 AM PST 9 min read\n\nIn this article: NVDA\n\nAVGO\n\nORCL\n\nPLTR\n\nGOOG\n\nOpenAI news often drives many AI stocks up or down. Many tech companies have a stake in OpenAI's success or failure in 2026 and beyond.\n\nContinue Reading\n\nCGU et Politique de confidentialité\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "21:21:11",
      "Source": "24/7 Wall St.",
      "Title": "An Actively Managed AI ETF Put 18% Into Two Chip Giants Just Ahead of Massive Infrastructure Buildout",
      "URL": "https://finance.yahoo.com/m/3a5c1b5b-1744-3ca0-b848-b09f050d5c3d/an-actively-managed-ai-etf.html",
      "Content": "An Actively Managed AI ETF Put 18% Into Two Chip Giants Just Ahead of Massive Infrastructure Buildout\n\nMichael Williams\nMon, December 29, 2025 at 5:21 AM PST 4 min read\n\nIn this article: NVDA\n\nAVGO\n\nQuick Read BAI holds $8B in assets with nearly 60% in information technology. NVIDIA and Broadcom alone represent 18% of the fund.\nGoldman Sachs projects AI infrastructure spending will exceed $500B in 2026, up from roughly $400B in 2025.\nThe fund’s 56% turnover allows rotation across the AI stack but concentrates 40% in seven names.\nIf you’re thinking about retiring or know someone who is, there are three quick questions causing many Americans to realize they can retire earlier than expected. take 5 minutes to learn more here\n\nThe iShares AI Innovation and Tech Active ETF ( NYSEARCA:BAI ) launched in October 2024 to capture the entire AI infrastructure buildout in one actively managed package. With $8 billion in assets and a 0.55% expense ratio, the fund takes a concentrated approach to AI exposure across the technology stack.\nWith $8 billion in assets and a 0.55% expense ratio, BAI takes a full-stack approach to AI exposure. Nearly 60% sits in information technology, led by NVIDIA ( NASDAQ:NVDA ) at 9.5% and Broadcom ( NASDAQ:AVGO ) at 8.8%. The next tier includes hyperscalers Microsoft ( NASDAQ:MSFT ), Alphabet ( NASDAQ:GOOGL ), and Meta ( NASDAQ:META ), plus software plays like Snowflake ( NYSE:SNOW ) and Palantir ( NYSE:PLTR ). It's a who's-who of AI infrastructure, from chips to cloud to enterprise software.\nThis infographic outlines how the iShares BAI ETF invests in the AI infrastructure buildout, detailing its strategy, suitable use cases, and key pros and cons for investors.\nWhat Drives This Trade in 2026 The single macro factor that matters most: hyperscaler capital expenditure. Goldman Sachs ( NYSE:GS ) Research projects AI companies will spend over $500 billion on infrastructure in 2026, up from roughly $400 billion in 2025. That spending flows directly to BAI's top holdings. Microsoft, Google, Meta, and Amazon ( NASDAQ:AMZN ) are building data centers, buying NVIDIA GPUs, and deploying custom silicon at unprecedented scale. When Azure grows 40% year-over-year or Google Cloud expands 34%, that revenue translates into orders for semiconductors, networking gear, and software platforms.\n\nWatch quarterly earnings from the hyperscalers, particularly their capex guidance. Microsoft, Alphabet, and Meta report fiscal results in January, April, July, and October. Any upward revision to infrastructure spending signals sustained demand for BAI's semiconductor and hardware holdings. If capex growth slows below 25%, the valuation premium on AI infrastructure stocks compresses quickly.\nPortfolio Mechanics and Concentration Risk BAI's active management means turnover runs at 56%, well above passive index funds. That flexibility allows managers to rotate between chip makers, cloud platforms, and emerging software plays as the AI landscape evolves. Check the fund's monthly fact sheet on iShares' website to track changes in sector allocation and top 10 concentration.\n\nStory Continues\nThe fund's concentration is both strength and vulnerability. NVIDIA and Broadcom alone represent 18% of assets. Add the hyperscalers and you're approaching 40% in just seven names. This amplifies returns when AI infrastructure spending accelerates, but any stumble in semiconductor demand or cloud growth hits hard. The 56% turnover suggests active rebalancing, but investors should monitor whether the fund maintains its chip-heavy tilt or rotates toward software as enterprise AI adoption matures.\n\nConsider the Broader Play For comparison, the iShares Robotics and Artificial Intelligence Multisector ETF ( NYSEARCA:IRBO ) offers similar AI exposure with a 0.47% expense ratio and longer track record since 2018. IRBO spreads risk across 92 holdings versus BAI's more concentrated approach, making it a steadier option for investors prioritizing diversification over maximum AI infrastructure exposure.\n\nFor 2026, hyperscaler capex guidance and BAI's quarterly rebalancing will be key indicators. Goldman Sachs Research projects infrastructure spending above $500 billion, which would support continued demand for the fund's semiconductor and cloud holdings.\nThe New Report Shaking Up Retirement Plans You may think retirement is about picking the best stocks or ETFs, but you’d be wrong. Even great investments can be a liability in retirement. It’s a simple difference between accumulating vs distributing, and it makes all the difference.\nThe good news? After answering three quick questions many Americans are reworking their portfolios and finding they can retire earlier than expected. If you’re thinking about retiring or know someone who is, take 5 minutes to learn more here .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "21:19:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Slips. Why Its Groq Deal Raises Questions.",
      "URL": "https://finance.yahoo.com/m/95a0cad5-3b27-3e4d-87f7-d72c690058be/nvidia-stock-slips.-why-its.html",
      "Content": "Nvidia Stock Slips. Why Its Groq Deal Raises Questions.\n\nAdam Clark\nMon, December 29, 2025 at 5:19 AM PST 2 min read\n\nIn this article: NVDA\n\nGROQ.PVT\n\nAMD\n\nAVGO\n\nNvidia was edging down early on Monday. Broader jitters about the technology sector looked to be hurting the stock, while Wall Street assessed the reported $20 billion price tag put on Nvidia’s agreement to license technology from artificial intelligence chip start-up Groq. Nvidia shares were down 1.1% at $188.49 in premarket trading.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "18:58:00",
      "Source": "Zacks",
      "Title": "Zacks Investment Ideas feature highlights: Nvidia, Broadcom, Vertiv and Alphabet",
      "URL": "https://finance.yahoo.com/news/zacks-investment-ideas-feature-highlights-105800503.html",
      "Content": "Zacks Investment Ideas feature highlights: Nvidia, Broadcom, Vertiv and Alphabet\n\nZacks Equity Research\nMon, December 29, 2025 at 2:58 AM PST 8 min read\n\nIn this article: VRT\n\nNVDA\n\nAVGO\n\nGOOG\n\nFor Immediate Release Chicago, IL &ndash; December 29, 2025 &ndash; Today, Zacks Investment Ideas feature highlights Nvidia NVDA, Broadcom AVGO, Vertiv VRT and Alphabet GOOGL.\n3 Leading AI Stocks Investors Can Buy for 2026\nThe market, and many leading AI stocks, are at an inflection point. In the near term, further volatility or even a pullback is possible. However, the longer-term opportunity remains compelling, with upside potential that extends well into 2026 and beyond.\n\nAI capital spending is projected to reach an estimated $571 billion in 2026, and Nvidia , Broadcom and Vertiv sit at the center of this historic infrastructure buildout. These companies are among the most critical enablers of the AI expansion.\nAfter running multiple screens focused on growth, valuation, and margin strength, these three names consistently rose to the top. Collectively, they represent exceptional businesses with durable competitive advantages and strong earnings power.\nDespite their leadership positions, these stocks are not stretched on valuation and in recent weeks have experienced earnings upgrades, giving two of them top Zacks Ranks.\nRecent months have been choppy in these stocks, with prices moving sideways to lower, leaving shares near technically important levels. Whether those levels hold or break in the short term is uncertain, but the risk-reward profile remains attractive at current prices regardless.\n\nEven if further downside materializes and bearish narratives resurface, any weakness is unlikely to persist given the scale and durability of AI-driven demand. If support holds, these stocks may already be positioning for their next leg higher.\nBelow, I will break down the recent developments, fundamental strength of these businesses and highlight a tactical trading plan using the technical charts.\nNvidia Stocks Breaks Out on Bullish Developments\nNvidia continues to anchor the AI boom as the critical infrastructure provider through its leadership in GPU technology. While 2025 was comparatively subdued for the now roughly $4.5 trillion semiconductor giant, with shares delivering a tidy 42% return, the company has remained firmly on offense.\nOver the past week, Nvidia advanced its largest acquisition to date, agreeing to acquire assets from AI chip startup Groq in a deal valued at approximately $20 billion. Groq, founded by former Google TPU architects, develops high-performance inference-focused silicon that competes in certain AI workloads. While Groq described the transaction as a &ldquo;non-exclusive licensing agreement,&rdquo; the deal includes the integration of Groq&rsquo;s CEO and senior leadership into Nvidia, signaling deeper strategic alignment.\n\nStory Continues\nFrom a competitive standpoint, the acquisition strengthens Nvidia&rsquo;s already formidable moat at the leading edge of AI semiconductors.\nFundamentals also continue to move in the right direction. Analysts have resumed raising earnings estimates, earning Nvidia a Zacks Rank #2 (Buy) . Consensus forecasts for next year&rsquo;s earnings have climbed nearly 16% over the past two months, and longer-term projections call for 46.3% annual EPS growth over the next three to five years. At roughly 40.6x forward earnings, the valuation remains reasonable given Nvidia&rsquo;s growth profile and its central role in the most powerful technology cycle in more than a decade.\n\nThe technical picture has also improved meaningfully. After months of choppy, volatile trading marked by sharp rallies and pullbacks, NVDA has made a decisive bullish turn. During the low-volume holiday period, the stock broke out from a clear descending bullish wedge, marking its most constructive advance in several months. As long as shares hold above the breakout level, the setup points to further upside as 2026 begins.\nBroadcom Shares Consolidate at Key Price Level\nBroadcom has been a core beneficiary of the AI boom since the trend began, but its importance has become even more apparent in recent months. After being viewed as a relative laggard for several years, Alphabet has reasserted itself as a leader in AI and large language models. A major driver of that shift has been renewed appreciation for Alphabet&rsquo;s proprietary hardware stack, most notably its Tensor Processing Units (TPUs), which Google has deployed internally for nearly a decade.\n\nBroadcom plays a critical role in that ecosystem. While TPUs are branded as Google-designed chips, Broadcom provides the underlying expertise in ASIC design, networking, and high-speed I/O, effectively enabling Google to scale these systems reliably at hyperscale. As Alphabet rapidly expands AI infrastructure across Search, cloud services, and generative AI models, custom silicon becomes economically unavoidable. Broadcom sits squarely at the center of that transition, helping design chips optimized for inference, training, and internal workloads, areas where generic GPUs are often less cost-efficient. As Alphabet&rsquo;s AI leadership has become clearer, Broadcom&rsquo;s strategic importance has risen alongside it.\nFrom a fundamentals perspective, Broadcom currently carries a Zacks Rank #3 (Hold) , reflecting a pause in earnings revisions rather than any deterioration in outlook. Consensus estimates still call for 35.7% annual EPS growth over the next three to five years, and the stock trades at roughly 36x one-year forward earnings. Given that growth profile and Broadcom&rsquo;s deep entrenchment in the AI infrastructure stack, valuation remains reasonable relative to peers.\n\nTechnically, Broadcom had been outperforming much of the AI complex in recent months as investors increasingly recognized its role within the Alphabet AI ecosystem. The sharp selloff following its most recent earnings report was less about weakening fundamentals and more about positioning and nuanced guidance, a classic &ldquo;sell-the-news&rdquo; event after a strong run. Importantly, shares found support at a level that has held up the stock since late summer. As long as that support holds, the consolidation looks constructive, and the near-term technical outlook remains encouraging.\nVertiv Stock Sits Within Trading Range\nVertiv remains one of the purest plays on the physical backbone of the AI buildout, supplying critical power, cooling, and thermal-management solutions to hyperscale and enterprise data centers. Recent developments continue to reinforce that positioning. Over the past several months, Vertiv has announced expanded partnerships with large data center operators and hyperscalers, while management has highlighted strong backlog growth and improving visibility tied directly to AI-driven capacity expansion. Demand for high-density cooling solutions continues to exceed expectations as next-generation AI workloads push power and thermal limits higher.\n\nFundamentally, the story remains compelling. Vertiv currently carries a Zacks Rank #2 (Buy) as earnings estimates continue to trend higher. Consensus forecasts call for 30.2% annual EPS growth over the next three to five years, reflecting operating leverage, improving margins, and sustained AI-related demand. While the stock trades at a 40.6x forward earnings multiple, that valuation appears justified given Vertiv&rsquo;s growth rate, expanding addressable market, and increasingly important role in AI infrastructure.\nThe technical setup adds another layer of appeal. After a sharp advance earlier in the cycle, VRT has spent recent months consolidating within a well-defined trading range. Importantly, the stock recently bounced cleanly off support within its rising channel. The key level to watch on the upside is the ~$180 area, which marks the top of the current range. A decisive breakout above that level would likely signal the next leg higher, while continued support near the lower end of the channel keeps the risk-reward profile attractive.\n\nTaken together, Vertiv offers a differentiated way to participate in the AI boom&mdash;not through chips or software, but through the indispensable infrastructure that makes large-scale AI deployment possible. With fundamentals strengthening and the technical picture improving, VRT remains well positioned as investors look ahead to 2026.\nShould Investors Buy Shares in VRT, NVDA and AVGO?\nTaken together, Nvidia, Broadcom, and Vertiv offer complementary exposure to the core layers of the AI buildout&mdash;compute, custom silicon and networking, and physical infrastructure. While near-term volatility is always possible, fundamentals, earnings momentum, and long-term demand visibility remain firmly intact. With each stock positioned at a critical point in the AI value chain and trading near technically important levels, the current setup favors accumulation opportunistically as the AI investment cycle extends into 2026 and beyond.\n\nFree: Instant Access to Zacks' Market-Crushing Strategies\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\nToday you can tap into those powerful strategies &ndash; and the high-potential stocks they uncover &ndash; free. No strings attached.\nGet all the details here >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nVertiv Holdings Co. (VRT) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "12:55:27",
      "Source": "Associated Press Finance",
      "Title": "Stocks slip on Wall Street as 2025 winds down",
      "URL": "https://finance.yahoo.com/news/asian-shares-mixed-quiet-holiday-045527800.html",
      "Content": "Stocks slip on Wall Street as 2025 winds down\n\nDAMIAN J. TROISE\nSun, December 28, 2025 at 8:55 PM PST 1 min read\n\nIn this article: CL=F\n\nGC=F\n\n^GSPC\n\n^DJI\n\n^IXIC\n\nNEW YORK (AP) — Stocks slipped in morning trading on Wall Street Monday to kick off another holiday-shortened week.\nThe S&P 500 fell 0.4%. With just three trading days left in 2025, the benchmark index is still up more than 17% for the year and it remains on track for its eighth monthly gain in a row.\n\nThe Dow Jones Industrial Average fell 144 points, or 0.3%, as of 10:01 a.m. Eastern. The Nasdaq composite fell 0.6%.\nBig technology stocks with outsized valuations were among the heaviest weights on the market. Nvidia fell 2% and Broadcom fell 1.3%.\nEnergy stocks gained ground along with rising oil prices. U.S. benchmark crude jumped 2.4% to $58.11 per barrel. The price of Brent crude, the international standard, rose 2.2% to $61.56 a barrel.\nExxon Mobil rose 0.9%.\nGold prices pulled back after recent sharp gains. The price of gold slumped 3.5%, though prices for the precious metal are still up about 66% for the year.\nWall Street faces another short week in the final stretch of 2025. Markets in the U.S. will be closed on Thursday for New Year's Day.\nTreasury yields fell in the bond market. The yield on the 10-year Treasury fell to 4.12% from 4.13% late Friday.\nMarkets in Europe and Asia were mixed. Shares in Taiwan were higher even after China’s military said it was conducting drills around the self-governed island that Beijing claims as its territory. Taiwan's benchmark Taiex gained 0.9%, but the Hang Seng in Hong Kong gave up early gains, falling 0.7%.\n___\nElaine Kurtenbach contributed to this story.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "02:15:52",
      "Source": "Insider Monkey",
      "Title": "Here’s What Kim Forrest and William Kerwin Think About Broadcom Inc (AVGO)",
      "URL": "https://finance.yahoo.com/news/kim-forrest-william-kerwin-think-181552611.html",
      "Content": "Here’s What Kim Forrest and William Kerwin Think About Broadcom Inc (AVGO)\n\nTalha Qureshi\nSun, December 28, 2025 at 10:15 AM PST 2 min read\n\nIn this article: AVGO\n\n​Broadcom Inc. (NASDAQ: AVGO ) is one of the Best Quality Stocks to Buy Before 2026 . Broadcom Inc. (NASDAQ:AVGO) topped Wall Street estimates during its fiscal Q4 2025 earnings, released on December 11. However, the stock price has fallen more than 16% since the release.\n​To talk about the earnings and the market selloff that followed, Kim Forrest, founder and chief investment officer at Bokeh Capital Partners LLC, and William Kerwin of Morningstar appeared on a Schwab Network interview on December 13. Kim noted that at the first appearance, the numbers looked great as they exceeded Street expectations, and demand looked good as well. However, the earnings call shifted the sentiment based on some products waiting for shipment, larger than anticipated backlog, and a 100 basis point decline in margins. Kim added that while the results were not bad, the AI investor sentiment has shaped in a way that if a company does not exceed expectations greatly, the sentiment turns negative.\n​William also expressed surprise over the market reaction. He noted that the investment case for Broadcom Inc. (NASDAQ:AVGO) remains intact, driven by accelerating AI demand. He highlighted that the company enjoys a significant benefit based on its co-designed TPU chip with Google, which has also seen immense demand. William added that Morningstar remains bullish on the stock, similar to Kim Forrest of Bokeh Capital Partners.\n\n​Broadcom Inc. (NASDAQ:AVGO) designs, develops, and supplies various semiconductor devices and infrastructure software solutions worldwide. The company operates in two segments: Semiconductor Solutions and Infrastructure Software.\nWhile we acknowledge the potential of AVGO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "00:48:05",
      "Source": "Insider Monkey",
      "Title": "Deutsche Bank Is Bullish On Broadcom Inc. (AVGO)",
      "URL": "https://finance.yahoo.com/news/deutsche-bank-bullish-broadcom-inc-164805992.html",
      "Content": "Deutsche Bank Is Bullish On Broadcom Inc. (AVGO)\n\nFatima Gulzar\nSun, December 28, 2025 at 8:48 AM PST 2 min read\n\nIn this article: AVGO\n\nDB\n\nORCL\n\nBroadcom Inc. (NASDAQ: AVGO ) is among the Growth Stock Portfolio: 12 Stock Picks By Ken Fisher .\nOn December 12, 2025, Thefly reported that Deutsche Bank increased its price objective for Broadcom Inc. (NASDAQ:AVGO) from $400 to $430 while keeping a buy rating. The business highlighted the company’s fiscal fourth-quarter performance, labeling growth as impressive. As stated in the commentary, the firm pointed out that although the results showed good performance, the growth came at a cost.\n\nOn December 12, Broadcom Inc. (NASDAQ:AVGO) warned that increasing sales of lower-margin custom AI chips would decrease profitability, which caused the company’s stock to drop more than 11%. Following a 10.8% decline in Oracle shares the day before due to debt-funded AI infrastructure expenditure, the margin warning heightened investor fears about returns from significant AI spending. The business stated that the margins will remain under pressure due to a higher proportion of AI sales, despite reporting a $73 billion backlog to ship in the next 18 months.\nThe stock has increased by over 46.72% so far this year. Melius Research’s Ben Reitzes stated that, considering the high spending plans, panic is premature.\nMeanwhile, the announcement of a new custom AI chip in 2026, a new $11 billion order for an AI chip from Anthropic for the second half of 2026, and guidance for artificial intelligence revenue in the January quarter were all significant highlights of the last quarter.\n\nBroadcom Inc. (NASDAQ:AVGO) is one of the world’s leading semiconductor businesses, and it has expanded into infrastructure software.\nWhile we acknowledge the potential of AVGO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 10 High-Growth EV Stocks to Invest In and 13 Best Car Stocks to Buy in 2025 .\nDisclosure. None\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "00:36:00",
      "Source": "Motley Fool",
      "Title": "What Is the Best Artificial Intelligence (AI) Stock to Hold for the Next 10 Years?",
      "URL": "https://finance.yahoo.com/m/92e033bd-467e-3790-a963-523cff98bcb6/what-is-the-best-artificial.html",
      "Content": "What Is the Best Artificial Intelligence (AI) Stock to Hold for the Next 10 Years?\n\nAdam Spatacco, The Motley Fool\nSun, December 28, 2025 at 8:36 AM PST 5 min read\n\nIn this article: TSM\n\nNVDA\n\nAMD\n\nAVGO\n\nMU\n\nKey Points Chip designers such as Nvidia, Advanced Micro Devices, and Broadcom serve as the backbone of generative AI development.\nWhile chip designers steal the spotlight, Taiwan Semiconductor Manufacturing is playing a hugely important supporting role in the background.\nAs demand for AI chips and data centers accelerates, Taiwan Semi is poised for explosive long-term growth.\n10 stocks we like better than Taiwan Semiconductor Manufacturing ›\n\nFor the last three years, investing in semiconductor stocks has proven to be a profitable decision given the critical role chips play in the development of generative artificial intelligence (AI). Companies such as Nvidia , Advanced Micro Devices , Broadcom , and Micron Technology have been some of the biggest contributors to the semiconductor industry throughout the artificial intelligence (AI) revolution.\nFlying under the radar is another chip company whose storyline seems muted compared to its peers. That's Taiwan Semiconductor Manufacturing (NYSE: TSM) , the pick-and-shovel specialist of the chip realm.\nLet's dive into Taiwan Semi's increasingly important role for the future of AI and assess why the stock looks like a no-brainer buying opportunity for investors with a long-term horizon.\nHow does Taiwan Semiconductor benefit from AI? Throughout the AI revolution, hyperscalers such as Microsoft , Alphabet , Amazon , Meta Platforms , and OpenAI have collectively poured hundreds of billions of dollars into AI-related capital expenditures (capex) -- namely, chips and networking gear for data centers.\nOn the surface, this is great news for the likes of Nvidia, AMD, and Broadcom. But underneath the surface, it's even better news for Taiwan Semi. Why is that?\n\nTSMC is the largest chip manufacturer in the world in terms of revenue. While Nvidia, AMD, and Broadcom design the most-in demand GPUs and custom application-specific integrated circuits (ASICs) on the planet, each of these giants relies heavily on Taiwan Semi's cutting-edge fabrication processes.\nIn other words, if Nvidia and its competitors represent the body of the car moving the AI narrative forward, TSMC holds the keys to the ignition.\nTSMC's growth is off the charts Over the last year, Taiwan Semi's revenue has been growing strongly thanks to ongoing demand for AI accelerators. What's interesting to point out is that the company's revenue trajectory is actually steepening. This is largely driven by rising demand for Nvidia's and AMD's next-generation Rubin and MI400 Series chips, as well as increasing investment in custom hardware from cloud infrastructure providers.\n\nStory Continues\nThe more subtle aspect from the financial picture above is Taiwan Semi's expanding profitability profile. Given its near-70% market share, TSMC is able to command enormous pricing power relative to competitors like Intel or Samsung .\nAgainst this backdrop, Taiwan Semi's gross margin is widening -- with excess cash flowing straight to the bottom line. The company is making the most of this new wave of capital by expanding its geographic footprint -- building additional foundries in Arizona, Germany, and Japan.\n\nIs Taiwan Semi stock a good buy right now? At the moment, TSMC boasts a forward price-to-earnings (P/E) multiple of 28.4 -- hovering near its highest level during the AI revolution. If you were to base your investment decision purely off of this metric, you may think Taiwan Semi is overvalued.\nSmart investors understand that TSMC's premium valuation could be warranted, though. McKinsey & Company is forecasting AI infrastructure to be a $7 trillion market through 2030 -- with the majority of spend allocated toward refining AI workloads.\nIn essence, building out AI-equipped data centers is expected to accelerate throughout the rest of the decade as training and inferencing models becomes more sophisticated and demanding. This is great news for TSMC as it paves the way for long-run visibility across the business.\n\nThe AI infrastructure chapter is still in its early innings. Over the course of the next several years, Taiwan Semi is positioned to benefit from the secular tailwind of rising investment in infrastructure both domestically and abroad.\nTaking this one step further, physical applications such as autonomous systems and robotics are yet to be deployed in a commercial sense. Looking beyond into the 2030s, these use cases are expected to drive additional trillions in economic value.\nShould they achieve some form of adoption and set the stage for the next wave of AI, Taiwan Semi has the potential to benefit immensely beyond where AI stands today -- building large language models (LLMs) and other software-based applications.\nWhen you consider the bigger picture and begin to think longer-term, TSMC's growth potential relative to its valuation looks compelling. So while the stock may not appear dirt cheap at first glance, I think there is ample room for meaningful valuation expansion over the course of the next decade -- making the stock a no-brainer buy right now in my eyes.\n\nShould you invest $1,000 in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nAdam Spatacco has positions in Alphabet, Amazon, Meta Platforms, Microsoft, and Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Intel, Meta Platforms, Microsoft, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nWhat Is the Best Artificial Intelligence (AI) Stock to Hold for the Next 10 Years? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-28",
      "Time": "23:20:00",
      "Source": "Motley Fool",
      "Title": "Prediction: This AI Stock Could Be the First New $2 Trillion Company in 2026",
      "URL": "https://finance.yahoo.com/m/2d751d5f-fd34-3071-bd63-786e1f7111b2/prediction%3A-this-ai-stock.html",
      "Content": "Prediction: This AI Stock Could Be the First New $2 Trillion Company in 2026\n\nAdam Levy, The Motley Fool\nSun, December 28, 2025 at 7:20 AM PST 5 min read\n\nIn this article: META\n\nTSLA\n\nAVGO\n\nNVDA\n\nKey Points Meta Platforms, Tesla, and Broadcom each have market caps around $1.6 trillion.\nAI is the driving force behind all three stock prices.\nOne of these tech leaders is seeing immediate results from AI spending, and its stock valuation is more attractive right now.\n10 stocks we like better than Meta Platforms ›\n\nArtificial intelligence (AI) is responsible for adding trillions of dollars in value to a handful of companies over the last few years. Nvidia , for example, briefly touched a $5 trillion market cap this year, thanks to its dominant position in the market for graphics processing units (GPUs). Four other companies sit firmly above the $2 trillion threshold as we approach the new year.\nBut three AI stocks currently have similar market caps around $1.6 trillion as of this writing, and are vying to become the first new $2 trillion company of 2026: Meta Platforms (NASDAQ: META) , Tesla (NASDAQ: TSLA) , and Broadcom (NASDAQ: AVGO) . Here's my prediction for the next company to top the milestone, and it could come as soon as next year.\nArtificial intelligence is fueling all three Meta, Tesla, and Broadcom have all seen their stock prices heavily influenced by advances in AI this year.\nMeta stock climbed higher early in the year as its efforts to improve its recommendation algorithms bore fruit. Ad revenue climbed higher as time spent on its apps increased, and ads became more effective. However, the stock took a step back recently as management shared plans to increase its AI-related spending.\n\nTesla's value is heavily tied to its robotaxi service and AI innovations. The stock received a boost over the summer when it launched its robotaxi pilot in Austin, Texas. Investors added to those gains on promising progress on the company's next-generation AI chip for its vehicles.\nBroadcom's custom AI accelerator business has gained momentum in 2025, as the company signed big contracts with OpenAI and Anthropic, the latter of which is buying Alphabet 's Broadcom-designed tensor processing units (TPUs). To that end, Alphabet and Broadcom are seeing excellent progress in shifting more developer workloads to TPUs, which offer greater energy efficiency and cost savings versus Nvidia's GPUs.\nBroadcom stock took a step back after its last earnings report, as many analysts were disappointed with management's expectation that greater AI chip sales would come at a lower gross margin.\nWhile all three of these stocks have a path to a $2 trillion valuation in 2026, I expect Meta Platforms to reach the milestone first. Here's why.\n\nStory Continues\nAI-powered earnings growth at an attractive valuation Even with its run rate of $200 billion in annual revenue, Meta is still growing its bottom line quickly. Adjusted earnings per share climbed 20% in the third quarter, and improvements in AI are the reason.\nMeta has seen an increase in both ad impressions and price per ad for eight straight quarters. That indicates that it's increasing user engagement and opening new places within its apps for advertising while making ads more effective.\n\nManagement attributes a shift in its recommendation algorithm to make it more general across formats as the primary reason users are spending more time on its apps. Meta has seen similar improvements by applying the same methodology to its advertising algorithm. In other words, bigger models have directly translated into more revenue.\nThat trend should continue in 2026, as Meta opens up more opportunities for advertising, including on Threads and WhatsApp. It could also begin monetizing Meta AI, its generative AI chatbot. The improvements in its algorithms over the last couple of years should enable it to ramp up advertising quickly without as much negative impact on its pricing as we've seen in the past.\nThe bigger opportunity for Meta in 2026, though, may be the expansion of its generative AI features. It's reportedly working on an AI agent that can manage advertising campaigns for small businesses. CEO Mark Zuckerberg repeatedly talks about the opportunity to handle everything involved with creating, testing, and optimizing ad campaigns on its platform through an AI agent.\n\nAnd chatbots specializing in sales and customer service for a company could open the door for more businesses to push Facebook and Instagram users to start messaging them through Meta's chat apps.\nWith small- and medium-sized businesses accounting for the bulk of advertisers on Meta's platform, these innovations have the potential to dramatically increase the amount they're willing to spend on ads. If the overhead for these clients is much lower, they can increase their ad spending and scale up their businesses faster.\nThose efforts should fuel another year of strong revenue growth. And while depreciation expense from the increase in AI-related capital expenditures could eat into earnings growth, Meta should be able to manage continued improvements in earnings per share with the help of share repurchases.\n\nThe stock trades for just 26 times forward earnings expectations, which is much lower than Broadcom's multiple and less than one-tenth the multiple Tesla stock trades for. I expect Meta to fetch a higher earnings multiple as it proves its AI spending to be well worth it once again in 2026, pushing its valuation to $2 trillion.\nShould you invest $1,000 in Meta Platforms right now? Before you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nAdam Levy has positions in Alphabet and Meta Platforms. The Motley Fool has positions in and recommends Alphabet, Meta Platforms, Nvidia, and Tesla. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nPrediction: This AI Stock Could Be the First New $2 Trillion Company in 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-28",
      "Time": "17:15:00",
      "Source": "Motley Fool",
      "Title": "The Best Artificial Intelligence (AI) Stocks to Buy Ahead of 2026, According to Wall Street Analysts (Hint: Not Palantir)",
      "URL": "https://finance.yahoo.com/m/32a856c7-f936-3b66-b577-8c497c7d7178/the-best-artificial.html",
      "Content": "The Best Artificial Intelligence (AI) Stocks to Buy Ahead of 2026, According to Wall Street Analysts (Hint: Not Palantir)\n\nTrevor Jennewine, The Motley Fool\nSun, December 28, 2025 at 1:15 AM PST 5 min read\n\nIn this article: PLTR\n\nNVDA\n\nMSFT\n\nMETA\n\nAMZN\n\nKey Points Morningstar analysts recently ranked Nvidia and Microsoft as the two best artificial intelligence stocks to buy right now.\nBrian Colello at Morningstar says Nvidia has an economic moat due to its leadership in GPUs, networking, and software tools needed for artificial intelligence.\nDan Romanoff at Morningstar says Microsoft’s cloud computing unit has emerged as a leader in artificial intelligence due to investments in OpenAI.\n10 stocks we like better than Nvidia ›\n\nPalantir Technologies has been one of the best-performing artificial intelligence (AI) stocks in recent years. Shares have advanced 1,000% since January 2024, but many analysts worry about its valuation. That may explain why Palantir did not appear on Morningstar 's recent list detailing the best AI stocks to buy now.\nInstead, Nvidia (NASDAQ: NVDA) and Microsoft (NASDAQ: MSFT) took the top two spots, followed by Amazon , Broadcom , and Meta Platforms . But optimism concerning Nvidia and Microsoft is not limited to Morningstar. Most Wall Street analysts believe the stocks are undervalued.\nAmong 69 analysts, Nvidia has a median target price of $250 per share. That implies 31% upside from its current share price of $190.\nAmong 63 analysts, Microsoft has a median target price of $631 per share. That implies 29% upside from its current share price of $488.\nHere's what investors should know about Nvidia and Microsoft.\n1. Nvidia Morningstar analyst Brian Colello writes:\nTo summarize, Nvidia has an important competitive advantage in its full-stack strategy. The company is best known for its GPUs, chips that accelerate demanding data center workloads like AI training and AI inference. But Nvidia is truly formidable because it pairs best-in-class GPUs with CPUs, high-speed interconnects, and networking platforms, such that the company essentially builds entire data centers.\n\nAdditionally, Nvidia has spent the better part of two decades creating its CUDA software platform, which comprises an unparalleled number of code libraries, pretrained models, and application frameworks that assist developers. While custom AI chips developed by Broadcom may be cheaper, the total cost of ownership is often higher because they lack pre-built software tools.\n\nStory Continues\nNvidia has over 90% market share in data center GPUs, a market where sales are projected to grow at 36% annually through 2033, and the company is likely to maintain its dominant position due to its full-stack strategy. Wall Street estimates Nvidia's adjusted earnings will increase at 48% annually through the fiscal year ending in January 2028. That makes the current valuation of 47 times earnings look cheap.\n\n2. Microsoft Microsoft is the largest enterprise software company in the world. While best known for Microsoft 365 (a suite that includes office applications like Excel, PowerPoint, and Word), the company also has a strong position in other software verticals, including business intelligence, cybersecurity, and enterprise resource planning.\n\nMicrosoft has added generative AI copilots to several software products and monthly active users surpassed 150 million in the September quarter, up from 100 million in the June quarter. And CEO Satya Nadella told analysts, \"Customers continue to adopt Microsoft 365 Copilot faster than any other Microsoft 365 suite. All up, more than 90% of the Fortune 500 now use Microsoft 365 Copilot.\"\nMeanwhile, Microsoft Azure is the second-largest public cloud in terms of infrastructure and platform services sales. \"Azure has several distinct advantages, including that it offers customers a painless way to experiment and move select workloads to the cloud,\" according to Morningstar analyst Dan Romanoff. \"Based on its investment in OpenAI, the company has also emerged as a leader in AI.\"\n\nMicrosoft owns a 27% equity stake in OpenAI and it has exclusive rights to the AI start-up's most advanced models (e.g., GPT-4 and GPT-5). Also, The Information reports that OpenAI shares 20% of its revenue with Microsoft under the agreement. Those payments will top $1 billion this year, up from about $500 million last year, according to TechCrunch.\nWall Street estimates Microsoft's adjusted earnings will increase at 16% annually through the fiscal year ending in June 2027. That makes the current valuation of 34 times earnings look somewhat expensive. But Microsoft topped the consensus earnings estimate by an average of 8% during the last four quarters, which makes the current valuation look more reasonable. Nvidia is still the more attractive option, but I think patient investors should consider buying a small position in both stocks.\n\nShould you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nTrevor Jennewine has positions in Nvidia and Palantir Technologies. The Motley Fool has positions in and recommends Microsoft, Nvidia, and Palantir Technologies. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nThe Best Artificial Intelligence (AI) Stocks to Buy Ahead of 2026, According to Wall Street Analysts (Hint: Not Palantir) was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-28",
      "Time": "01:57:00",
      "Source": "Motley Fool",
      "Title": "Billionaire Chase Coleman Has Formed His Own \"Magnificent Seven\" and It's Even Better Than the Original",
      "URL": "https://finance.yahoo.com/m/8acc8d83-f1c7-3ebb-a71b-5848b544b190/billionaire-chase-coleman-has.html",
      "Content": "Billionaire Chase Coleman Has Formed His Own \"Magnificent Seven\" and It's Even Better Than the Original\n\nKeithen Drury, The Motley Fool\nSat, December 27, 2025 at 9:57 AM PST 5 min read\n\nIn this article: AAPL\n\nTSLA\n\nGOOG\n\nMSFT\n\nAMZN\n\nKey Points Apple and Tesla are excluded from the new grouping.\nBroadcom and Taiwan Semiconductor are key additions.\nProspects for Coleman's new grouping look promising.\n10 stocks we like better than Nvidia ›\nThe \"Magnificent Seven\" is a common grouping of stocks used to describe some of the largest and most influential stocks in the market today. The Magnificent Seven consists of these familiar names:\n\nNvidia (NASDAQ: NVDA)\nApple (NASDAQ: AAPL)\nAlphabet (NASDAQ: GOOG) (NASDAQ: GOOGL)\nMicrosoft (NASDAQ: MSFT)\nAmazon (NASDAQ: AMZN)\nMeta Platforms (NASDAQ: META)\nTesla (NASDAQ: TSLA)\nHowever, billionaire hedge fund manager Chase Coleman has created an alternative Magnificent Seven, and I think it's even better than the original. Which companies were cut and which ones were added? Let's take a look.\nAI is the theme in the new Magnificent Seven Investors have access to what hedge fund managers own. This is thanks to the Securities and Exchange Commission (SEC) requirement that managers with $100 million or more in assets must disclose their end-of-quarter holdings to the public 45 days after the quarter ends in a Form 13F . While this isn't up-to-date information, it's better than nothing.\n\nIn Tiger Global Management's third-quarter portfolio, we can see that Chase Coleman has heavily positioned his portfolio to take advantage of the massive artificial intelligence buildout. Some of his major holdings are:\nMicrosoft (10.5% of portfolio)\nAlphabet (8% of portfolio)\nAmazon (7.5% of portfolio)\nNvidia (6.8% of portfolio)\nMeta Platforms (6.4% of portfolio)\nTaiwan Semiconductor Manufacturing (NYSE: TSM) (4% of portfolio)\nBroadcom (NASDAQ: AVGO) (3% of portfolio)\nAltogether, these stocks make up 46.2% of Coleman's portfolio, which is a massive concentration. However, the track record of each company speaks for itself, and all of these have been great investments over the past few years.\nWhat's notable is that Apple and Tesla aren't included. I think there are a few reasons why, and I like the inclusion of Taiwan Semiconductor and Broadcom over these two in the new Magnificent Seven.\n\nApple lacks an AI focus, and Tesla's business model took a hit this year Apple has been a notable AI laggard in recent years. Its AI technology is really non-existent, and many of the features Apple promised users years ago still haven't been released. The only step left is for Apple to become a client of one of the major generative AI providers, which doesn't bode well for the future.\nFurthermore, Apple is surviving on past innovations, and hasn't released anything groundbreaking in the past few years. All the companies on this list have had incredible results, leaving Apple in the dust in terms of growth.\n\nStory Continues\nTesla is a bit different. It has an AI strategy for implementing self-driving capabilities in its cars. It also has a close partnership with xAI, another one of Elon Musk's companies. I think it shouldn't be excluded from the new Magnificent Seven based on AI alone.\nYet, it's impossible to ignore the shifting landscape in Tesla's primary market. Electric vehicles aren't as hot as they used to be, and with U.S. government subsidies ending, they aren't as attractive to consumers. This isn't to say the EV market is dead, but growth will be more difficult to come by in the future.\n\nAn investment in Tesla is a bet that its various aspirations, like robotaxis and humanoid robots, will be successful. These are far from surefire bets, unlike the other seven companies that are making money right now.\nTaiwan Semiconductor and Broadcom are great inclusions, as they are each thriving in the AI market. They are also large businesses, with Broadcom and Tesla often swapping places as the seventh and eighth largest companies, while Taiwan Semiconductor is the 10th largest in the world at a $1.5 trillion market cap.\nBroadcom is competing in the AI race with its custom AI accelerator chips, which are starting to grow in popularity as an alternative to Nvidia's graphics processing units (GPUs). Taiwan Semiconductor is a key provider of chips to nearly every company on this list. As long as more data centers keep being built, Taiwan Semiconductor will be an excellent stock pick.\n\nI'm confident that Chase Coleman's new Magnificent Seven will outperform the old Magnificent Seven in 2026. I think investors should consider moving on from Apple and Tesla and into Broadcom and Taiwan Semiconductor, as they are better positioned for the next few years.\nShould you buy stock in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nKeithen Drury has positions in Alphabet, Amazon, Broadcom, Meta Platforms, Nvidia, Taiwan Semiconductor Manufacturing, and Tesla. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, Taiwan Semiconductor Manufacturing, and Tesla. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nBillionaire Chase Coleman Has Formed His Own \"Magnificent Seven\" and It's Even Better Than the Original was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "23:21:59",
      "Source": "24/7 Wall St.",
      "Title": "3 Reasons Broadcom Crashed 15% on Blockbuster Earnings — And the Real Reason to Load Up Now",
      "URL": "https://finance.yahoo.com/m/66759db0-77a0-3032-b2b0-f2da74fc33f7/3-reasons-broadcom-crashed.html",
      "Content": "3 Reasons Broadcom Crashed 15% on Blockbuster Earnings — And the Real Reason to Load Up Now\n\nRich Duprey\nSat, December 27, 2025 at 7:21 AM PST 4 min read\n\nIn this article: AVGO\n\nQuick Read Broadcom ( AVGO ) reported Q4 revenue of $18B with AI semiconductor revenue up 74% to $6.5B. Broadcom stock dropped 21% post-earnings despite beating estimates.\nBroadcom’s AI revenue is expected to double in Q1 to $8.2B. The company added a fifth custom chip customer with $1B in initial orders.\nGross margins of 77.9% are expected to decline 100 basis points in Q1 due to higher AI revenue mix and lower-margin rack solutions.\nIf you’re thinking about retiring or know someone who is, there are three quick questions causing many Americans to realize they can retire earlier than expected. take 5 minutes to learn more here\n\nBroadcom ( NASDAQ:AVGO ) delivered stellar fiscal fourth-quarter results earlier this month, with record revenue, beating analyst estimates. AI-driven growth powered the performance, yet the stock tumbled sharply afterward, dropping as much as 21% from $405 per share before the report to $321 per share in the following days.\nWhile Broadcom shares have since recovered some ground, they remain approximately 15% below their pre-earnings levels. This selloff is the result of a disconnect between strong fundamentals and the market's reaction.\nThere are three key reasons behind the decline in Broadcom stock, but these concerns open up an opportunity for investors to buy at a lower price.\nBroadcom Shows Exceptional Strength Broadcom reported net revenue of $18 billion for the period, a 28% increase from $14 billion a year earlier. Semiconductor solutions revenue reached $11.1 billion, up 35% year-over-year, while infrastructure software contributed $6.9 billion, up 19%. AI semiconductor revenue was exceptionally strong, rising 74% year-over-year to $6.5 billion. Adjusted earnings came in at $1.95 per share, up 37% from the year-ago quarter, with adjusted EBITDA at $12.1 billion, for margins of 68%, which was also 34% higher than last year, allowing Broadcom to generate a 36% increase in free cash flow to $7.5 billion.\n\nCEO Hock Tan highlighted the momentum, noting AI revenue growth drove the results. Broadcom also offered robust guidance for Q1, projecting revenue of $19.1 billion, up 28% year-over-year, with AI semiconductor revenue expected to double to $8.2 billion. Semiconductor revenue is forecast at about $12.3 billion, up 50%, underscoring continued demand acceleration.\nReason 1 For the Selloff: AI Backlog While AI-related order backlog of over $73 billion -- deliverable over 18 months -- was substantial, representing nearly half of the consolidated $162 billion backlog, was lower than anticipated for the pace of AI demand. This backlog includes custom AI accelerators (XPUs) and networking components like the Tomahawk 6 switch, with over $10 billion in orders for the latter alone. Management described bookings as \"unprecedented\" in recent months, but the specific backlog number contributed to perceptions of moderating momentum.\n\nStory Continues\nReason 2: Expected Margin Pressure Where gross margins were 77.9%, management said it expected a sequential decline of about 100 basis points in Q1 due to a higher mix of AI revenue, including passthrough costs in rack-level solutions. AI semiconductors, particularly custom chips and systems, carry lower margins than traditional products. Semiconductor gross margins are around 68%, compared to 93% for infrastructure software. As AI becomes a larger portion of revenue, this mix shift is expected to dilute overall margins slightly, even as absolute operating profit dollars grow.\n\nReason 3: Slowing Growth in Infrastructure Software A third concern was the outlook for infrastructure software, primarily from VMware. Although segment revenue grew 19%, guidance called for low double-digit growth next year, with Q1 at $6.8 billion, only 2% higher year-over-year. This deceleration from prior rates raised questions about sustained momentum in the software segment, which has offered high-margin stability.\n\nWhy This Is a Buying Opportunity Despite the stock's tumble, Broadcom's outlook remains robust, driven by accelerating AI demand that management describes as a multiyear trend. AI revenue is on track to double in Q1, fueled by custom accelerators and Ethernet networking.\nThe company has also diversified its customer base, adding a fifth XPU client with a $1 billion initial order for delivery in late 2026, alongside follow-on commitments worth $11 billion from existing hyperscalers. Networking backlog for AI switches exceeds $10 billion, reflecting strong deployment needs.\n\nMoreover, bookings have surged recently, with visibility into leading-edge nodes and advanced packaging secured through facility expansions. Non-AI semiconductors remain stable, supported by a recovery in broadband.\nBroadcom continues to deliver strong capital returns, raising its dividend 10% and extending a $7.5 billion repurchase program. These factors point to sustained growth in 2026 and beyond. Broadcom is likely to surprise the market in future earnings reports with its strength, making the drop in its stock today the time to buy.\nThe New Report Shaking Up Retirement Plans You may think retirement is about picking the best stocks or ETFs, but you’d be wrong. Even great investments can be a liability in retirement. It’s a simple difference between accumulating vs distributing, and it makes all the difference.\nThe good news? After answering three quick questions many Americans are reworking their portfolios and finding they can retire earlier than expected. If you’re thinking about retiring or know someone who is, take 5 minutes to learn more here .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "23:00:19",
      "Source": "Yahoo Finance",
      "Title": "6 under-the-radar stocks to play the AI boom in 2026: BofA",
      "URL": "https://finance.yahoo.com/news/6-under-the-radar-stocks-to-play-the-ai-boom-in-2026-bofa-150019301.html",
      "Content": "6 under-the-radar stocks to play the AI boom in 2026: BofA\n\nFrancisco Velasquez\nSat, December 27, 2025 at 7:00 AM PST 3 min read\n\nIn this article: NVDA\n\nCRDO\n\nALAB\n\nMTSI\n\nTER\n\nWhile players like Nvidia ( NVDA ) and Broadcom ( AVGO ) are at the forefront of investors’ minds, smaller specialized players are grabbing a slice of the AI spending behind the scenes.\nIn a recent report, Bank of America analyst Vivek Arya named a handful of small- to mid-cap companies as the unsung heroes of the semiconductor surge.\n\n\"We mentioned a few companies on the smid-cap side, Credo, MKS, Advanced Energy, MACOM, and Teradyne,\" Arya told reporters on a Dec. 19 call.\nWhile these companies lack the massive margins of Nvidia, Arya suggests they are currently benefitting from being the primary providers of essential technologies.\nThe scale of the unsung opportunity is staggering. BofA predicts the total addressable market for AI data center systems will exceed $1.2 trillion by 2030, fueled by a 38% compound annual growth rate. Within that, AI accelerators will grab around $900 billion, but that leaves a massive $300 billion slice — one that depends on secondary technologies like networking, cables, and power systems.\nArya breaks down how the pie is divided. For every $100 spent on AI hardware, $15 to $20 goes into networking. A third flows directly into interconnects — the wires and optical components that let GPUs talk to each other. As AI clusters expand, these bits and bolts of the trillion-dollar build-out are seeing a direct benefit.\n\nArya highlights Credo ( CRDO ) for its leadership in active electrical cables. As data centers prioritize \"performance per watt,\" Credo's niche technology is critical. \"They want to make sure that all these GPUs talk to each other, very effectively,\" he said.\nHe also pointed to Astera Labs ( ALAB ) and its robust high-speed connectivity efforts via PCIe 6.0, the standard for moving data between a computer's motherboard and its hardware.\n\"They were the ones who invested in specific technologies ... nobody cared about these categories,\" he said. \"So now, they are benefitting from being the only people standing in those specific niche technologies.\"\nOther key players, such as MKS Instruments ( MKSI ) and Advanced Energy ( AEIS ), provide the precision power and vacuum systems needed to actually build chips. If Nvidia is the architect, these companies provide the machinery and high-voltage power to keep the site running.\nMeanwhile, MACOM ( MTSI ) provides high-speed analog and optical components that let these \"brains\" interact, while Teradyne ( TER ) serves as a final checkpoint. The company's automated testing equipment ensures these expensive components actually work before they are shipped.\n\nStory Continues\nStill, a healthy dose of skepticism is required. Unlike Nvidia, which can sell a single GPU for $30,000, the interconnect players like Credo and Astera face a brutal reality: pricing compression.\n\"Of course, they are not going to get these multiples forever,\" Arya said.\nArya warns that transceiver prices often fall from $1 per gigabit to $0.50 in just a few months.\n\n\"They can never hold pricing right, so you will never see them quite grow as fast as the accelerator or the logic companies,\" he explained. While their gross margins are currently 35%-40%, they are nowhere near Nvidia's \"different galaxy\" levels of 70% plus.\nFrancisco Velasquez is a Reporter at Yahoo Finance. Follow him on LinkedIn , X , and Instagram . Story tips? Email him at francisco.velasquez@yahooinc.com.\nClick here for the latest technology news that will impact the stock market\nRead the latest financial and business news from Yahoo Finance\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "20:35:00",
      "Source": "Motley Fool",
      "Title": "3 Stock-Split Stocks to Buy that Could Soar As Much as 40%, 35%, and 640%, According to Wall Street",
      "URL": "https://finance.yahoo.com/m/7c394f77-f849-33ce-893d-5bb9975070b8/3-stock-split-stocks-to-buy.html",
      "Content": "3 Stock-Split Stocks to Buy that Could Soar As Much as 40%, 35%, and 640%, According to Wall Street\n\nRachel Warren, The Motley Fool\nSat, December 27, 2025 at 4:35 AM PST 8 min read\n\nIn this article: NFLX\n\nWSFX.BO\n\nAVGO\n\nNOW\n\nKey Points Netflix is the indomitable leader in streaming, and its advertising segment is gaining steam.\nBroadcom supplies infrastructure to hyperscalers, and it backlog of AI revenue is growing.\nServiceNow's cloud business is robust and its AI solutions serve major customers.\n10 stocks we like better than Netflix ›\n\nA stock split is a corporate action where a company divides its existing shares into multiple new shares, which increases the total share count while proportionally decreasing the price per share. This can make the stock more affordable and liquid for investors without changing the total market value of the company or an investor's stake.\nPlenty of stocks have initiated splits over the last several years, and some of those are quality businesses that could be poised to soar significantly in the coming years. If you have cash to put to work in stocks right now, here are three stock-split stocks to buy and hold for the long run that look to have significant upside potential.\n1. Netflix Netflix (NASDAQ: NFLX) enacted a 10-for-1 stock split that went into effect on Nov. 17, 2025. At the time of this writing, shares are trading around $94. Currently, the median 12-month price target from analysts on Wall Street is around $133, which would represent upside of about 40% from its current price. The high end of the available price estimate anticipates as much as 62% upside in the next 12 months.\n\nNetflix is increasingly benefiting from the growth engine of the ad-supported tier it launched in late 2022. The company is on pace to double its advertising business revenue in 2025 and its ads now reach 190 million monthly active viewers. This high- margin revenue stream provides a significant new path to profitability beyond traditional subscriptions.\nNetflix's expansion into live programming, featuring the NFL and WWE, has proven highly successful in driving both subscriber acquisition and retention, as well as breaking viewership records. These events also command premium advertising rates, helping the company gain market share in areas where it previously lagged. Regions such as the Asia-Pacific and Latin America are also experiencing faster subscriber growth, offering a large, unsaturated addressable market.\n\nIn Q3 2025, Netflix's growth and engagement reached record highs, thanks to a diversified content slate including breakout original films, returning series, and massive live sports events. The animated film KPop Demon Hunters was the primary growth driver of the quarter and became Netflix's most-watched film ever with 325 million views. The second season of Wednesday was a major tentpole that recorded over 1 billion viewing minutes in Q3. Black Rabbit was also a top-performing original series for the quarter that generated over 1.2 billion minutes of viewing.\n\nStory Continues\nThese hits contributed to a 17% year-over-year revenue increase (reaching $11.5 billion) and record viewing shares of 8.6% in the U.S. and 9.4% in the U.K. The content strength also fueled a record-breaking quarter for Netflix's advertising tier, with U.S. upfront commitments doubling from last year. Netflix continues to invest heavily in a diverse content pipeline and leverages its in-house adtech and data-driven recommendation algorithms to enhance user engagement and loyalty. The company is in the process of acquiring Warner Bros. Discovery in a massive $82.7 billion deal announced in early December 2025.\n\nAlthough regulatory scrutiny and industry concerns about monopolies are significant hurdles, this acquisition would bring HBO, Warner Bros. Discovery's film/TV studios, and streaming service under Netflix's umbrella. As Netflix transitions into a mature, cash-generating business model, it remains the undisputed leader in streaming, with its scale and brand power providing a significant competitive advantage over rivals. Long-term investors would do well to capitalize on that growth trajectory.\n2. Broadcom Broadcom (NASDAQ: AVGO) executed a 10-for-1 stock split on July 15, 2024. At the time of this writing, shares trade for approximately $350 each, but some Wall Street analysts think the stock could realize an upside of 35% over the next 12 months, or even 58% on the high end. Since we're talking about stock splits, as a a side note, Broadcom's Canadian Depositary Receipts (CDRs), enacted a 6-for-1 stock split that took effect for trading on Nov. 14, 2025.\n\nBroadcom is a leading supplier of custom AI accelerators (ASICs) and Ethernet switches for hyperscale data centers. Its customers include the likes of Alphabet 's Google, Meta Platforms , Anthropic, and OpenAI. Broadcom reported a record revenue of $64 billion for fiscal year 2025. This represented a 24% increase compared to fiscal year 2024 revenue of $51.6 billion.\nAI semiconductor revenue for fiscal year 2025 was $20 billion, representing a 65% year-over-year growth, and management expects this figure to double in Q1 of its fiscal year 2026. Meanwhile, semiconductor solutions generated $37 billion in revenue during the fiscal year, representing a 58% increase from the previous year. Infrastructure software revenue increased 26% year over year to $27 billion, primarily driven by the adoption of VMware Cloud Foundation.\n\nThe acquisition of VMware in November 2023 positioned Broadcom as a full-stack AI infrastructure vendor with a significant presence in enterprise software. This segment provides stable, high-margin, recurring revenue that helps offset potential margin pressures from AI hardware.\nThe company ended fiscal 2025 with a robust backlog of $73 billion in AI-related hardware orders. Profitability also soared in fiscal 2025, with adjusted EBITDA (earnings before interest, taxes, depreciation, and amortization) hitting $43 billion (up 35%) and Broadcom reported significant free cash flow of $26.9 billion.\nBroadcom's dominant position in AI networking hardware, strong cash flow, high-margin software, and persistent AI demand are all positive indicators of where this business currently stands and where it's headed. This could be a compelling stock for long-term investors seeking to capitalize on a 'pick-and-shovel' play in the AI space.\n\n3. ServiceNow ServiceNow (NYSE: NOW) executed a 5-for-1 stock split on Dec. 18, 2025, with shares trading on a split-adjusted basis starting that day. This means that shares trade now for roughly $155 each. Wall Street analysts seem to be particularly enthusiastic about ServiceNow's growth prospects, with the median 12-month price target coming in at 640% above its current share price. The high 12-month stock price forecast is approximately 735%.\n\nServiceNow is a cloud-based enterprise platform that helps businesses automate and manage their digital workflows across IT, HR, customer service, security, and other departments. Essentially, the business acts as a central control tower, connecting people, processes, and systems and replacing manual tasks with streamlined, AI-powered processes. The company is strategically positioned to capitalize on the generative AI boom with its Now Assist suite of products.\nThese AI solutions are gaining strong traction and are targeted to reach $1 billion in annual contract value by the end of 2026. ServiceNow's platform is used by over 85% of Fortune 500 companies. This deep integration creates high switching costs and it boasts a high renewal rate of around 96% or higher.\n\nServiceNow's customers are large enterprises and organizations across nearly every major industry, including Walmart , Amazon , Microsoft , Apple , JPMorgan Chase , and the U.S. Department of Defense. ServiceNow has recently made major acquisition moves, buying AI firm Moveworks for $2.85 billion in March 2025. The company is also reportedly nearing a potential $7 billion acquisition of cybersecurity firm Armis, which would add critical device security and asset intelligence to its offerings and address the growing need for AI governance.\nIn Q3 2025, ServiceNow reported subscription revenue of $3.3 billion, up 22% from one year ago. The current remaining performance obligations stood at $11.4 billion as of Q3 2025, representing a 21% year-over-year growth. ServiceNow also delivered adjusted EPS of $4.82 and adjusted free cash flow of $592 million with a 17.5% margin.\n\nAn analyst downgrade and news of ServiceNow's acquisition ambitions for Armis, which would be its largest-ever deal, have weighed on the stock recently. There has also been generally more volatility among tech stocks lately. However, investors who believe in the company's future as a key player in AI workflow automation may want to take a second look.\nShould you buy stock in Netflix right now? Before you buy stock in Netflix, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Netflix wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $504,994 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,156,218 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 986 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nJPMorgan Chase is an advertising partner of Motley Fool Money. Rachel Warren has positions in Alphabet, Amazon, and Apple. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, JPMorgan Chase, Meta Platforms, Microsoft, Netflix, ServiceNow, Walmart, and Warner Bros. Discovery. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\n3 Stock-Split Stocks to Buy that Could Soar As Much as 40%, 35%, and 640%, According to Wall Street was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "07:45:00",
      "Source": "MarketBeat",
      "Title": "Broadcom’s Margin Warning Spooked Wall Street—But Cash Flow Could Still Win",
      "URL": "https://finance.yahoo.com/m/fa58ccf8-be2b-3115-9b8f-097844b6d048/broadcom%E2%80%99s-margin-warning.html",
      "Content": "Broadcom’s Margin Warning Spooked Wall Street—But Cash Flow Could Still Win\n\nLeo Miller, MarketBeat\nFri, December 26, 2025 at 3:45 PM PST 4 min read\n\nIn this article: AVGO\n\nGOOG\n\nNVDA\n\nKey Points Markets have crushed Broadcom's shares since the firm reported earnings on Dec. 11.\nForecasts regarding gross margin pressure are driving serious concerns.\nBroadcom's proven track record outweighs the uncertainty many investors are feeling, supporting the stock's positive outlook.\nInterested in Broadcom Inc.? Here are five stocks we like better.\n\nInvestors are feeling more uncertainty around semiconductor giant Broadcom (NASDAQ: AVGO) than they have in quite a while.\nShares are down nearly 14% since the company reported its fiscal Q4 2025 earnings report on Dec. 11.\n→ Why Kratos and AeroVironment Are Suddenly Moving Like Tech Stocks\nBroadcom’s post-earnings sell-off is really a debate over one question: will the company’s fast-growing AI “system” revenue dilute margins—or expand operating profit and free cash flow anyway?\nThe answer could determine whether the sell-off is a short-term sentiment hit or a broader reassessment of Broadcom’s longer-term earnings power.\n→ These 3 Household Names Are Flashing Rare Oversold Signals\nGross Margin Concerns Weigh on AVGO Stock The primary issue plaguing Broadcom shares after earnings was management's gross margin outlook.\nNext quarter, Broadcom expects its gross margin to fall 100 basis points due to a higher mix of artificial intelligence (AI) revenue. With a 78% gross margin last quarter, management signaled that margins may continue trending lower throughout 2026 as Broadcom increases AI system shipments.\n\n→ MarketBeat Week in Review – 12/22 - 12/26\nInstead of simply selling its chips, Broadcom is combining them with third-party components, such as memory and delivering them to customers as systems. This strategy increases total revenue but lowers overall margins because those third-party components add costs that Broadcom passes on to customers.\nIt also leads to concerns about the profitability of Broadcom’s $73 billion AI backlog, which it expects to convert into revenue over the next 18 months. Analysts believe Broadcom’s orders from Anthropic, totaling $21 billion, are system sales. That is certainly a significant portion of the company’s AI backlog, adding weight to margin-related concerns.\nHowever, Broadcom emphasized that while gross margins will deteriorate, operating margins will only come down slightly in 2026 because the company can spread its higher revenues over a larger base of fixed costs. Ultimately, operating margin is more important than gross margin, as it correlates much more closely with free cash flow (FCF) generation. Thus, it is a very positive sign that Broadcom believes it can protect its operating margin.\n\nStory Continues\nLower Margins Can Still Mean Higher Profits Until recently, Broadcom had not engaged in system sales on a large scale. Although investors typically dislike margin deterioration, companies will often pursue new lines of business that have this effect. Entering lower-margin markets often drives revenue growth that offsets thinner margins—a tradeoff that Broadcom believes will play out in 2026.\n\nThere are also clear reasons why, in the case of Anthropic, it would make sense for Broadcom to pursue system sales. Broadcom is not developing a specific chip for Anthropic. Instead, Anthropic will use tensor processing units (TPUs), which Broadcom originally developed for Alphabet (NASDAQ: GOOGL). Broadcom’s deep experience with TPUs positions it to deliver ready-made AI systems faster than Anthropic could build them independently.\nBy providing turnkey systems, Broadcom captures billions in new revenue opportunities and strengthens relationships in the fast-growing AI infrastructure market. Still, investors should monitor whether system sales become a long-term structural shift or remain a short-term growth lever. Overextending into lower-margin segments could pressure profitability if not managed carefully.\n\nDespite Uncertainty, the Long-Term Case Remains Strong Ultimately, the disappointment in Broadcom’s earnings release stems from one key dynamic: the introduction of uncertainty.\nIn not knowing how far Broadcom's gross margins could fall, markets ran for cover.\nHowever, what investors do know is that Broadcom’s demonstrated success in the AI chip design space is second only to NVIDIA (NASDAQ: NVDA).\nThey also know Alphabet solely used TPUs to develop its highly advanced Gemini 3 model, and that analysts still see big-time upside in this stock.\nAmid the uncertainty, these factors support the continued bullish outlook on Broadcom shares.\nThe article \" Broadcom’s Margin Warning Spooked Wall Street—But Cash Flow Could Still Win \" was originally published by MarketBeat.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "02:58:00",
      "Source": "Zacks",
      "Title": "3 Leading AI Stocks Investors Can Buy for 2026 (NVDA, AVGO, VRT)",
      "URL": "https://finance.yahoo.com/news/3-leading-ai-stocks-investors-185800576.html",
      "Content": "3 Leading AI Stocks Investors Can Buy for 2026 (NVDA, AVGO, VRT)\n\nEthan Feller\nFri, December 26, 2025 at 10:58 AM PST 7 min read\n\nIn this article: VRT\n\nNVDA\n\nAVGO\n\nThe market, and many leading AI stocks, are at an inflection point. In the near term, further volatility or even a pullback is possible. However, the longer-term opportunity remains compelling, with upside potential that extends well into 2026 and beyond.\nAI capital spending is projected to reach an estimated $571 billion in 2026, and Nvidia ( NVDA ), Broadcom ( AVGO ), and Vertiv ( VRT ) sit at the center of this historic infrastructure buildout. These companies are among the most critical enablers of the AI expansion.\n\nAfter running multiple screens focused on growth, valuation, and margin strength, these three names consistently rose to the top. Collectively, they represent exceptional businesses with durable competitive advantages and strong earnings power.\nDespite their leadership positions, these stocks are not stretched on valuation and in recent weeks have experienced earnings upgrades, giving two of them top Zacks Ranks.\nRecent months have been choppy in these stocks, with prices moving sideways to lower, leaving shares near technically important levels. Whether those levels hold or break in the short term is uncertain, but the risk-reward profile remains attractive at current prices regardless.\nEven if further downside materializes and bearish narratives resurface, any weakness is unlikely to persist given the scale and durability of AI-driven demand. If support holds, these stocks may already be positioning for their next leg higher.\nBelow, I will break down the recent developments, fundamental strength of these businesses and highlight a tactical trading plan using the technical charts.\n\nImage Source: Zacks Investment Research\nNvidia Stocks Breaks Out on Bullish Developments Nvidia continues to anchor the AI boom as the critical infrastructure provider through its leadership in GPU technology. While 2025 was comparatively subdued for the now roughly $4.5 trillion semiconductor giant, with shares delivering a tidy 42% return, the company has remained firmly on offense.\nOver the past week, Nvidia advanced its largest acquisition to date, agreeing to acquire assets from AI chip startup Groq in a deal valued at approximately $20 billion. Groq, founded by former Google TPU architects, develops high-performance inference-focused silicon that competes in certain AI workloads. While Groq described the transaction as a “non-exclusive licensing agreement,” the deal includes the integration of Groq’s CEO and senior leadership into Nvidia, signaling deeper strategic alignment.\nFrom a competitive standpoint, the acquisition strengthens Nvidia’s already formidable moat at the leading edge of AI semiconductors.\n\nStory Continues\nFundamentals also continue to move in the right direction. Analysts have resumed raising earnings estimates, earning Nvidia a Zacks Rank #2 (Buy) . Consensus forecasts for next year’s earnings have climbed nearly 16% over the past two months, and longer-term projections call for 46.3% annual EPS growth over the next three to five years. At roughly 40.6x forward earnings, the valuation remains reasonable given Nvidia’s growth profile and its central role in the most powerful technology cycle in more than a decade.\n\nThe technical picture has also improved meaningfully. After months of choppy, volatile trading marked by sharp rallies and pullbacks, NVDA has made a decisive bullish turn. During the low-volume holiday period, the stock broke out from a clear descending bullish wedge, marking its most constructive advance in several months. As long as shares hold above the breakout level, the setup points to further upside as 2026 begins.\n\nImage Source: TradingView\nBroadcom Shares Consolidate at Key Price Level Broadcom has been a core beneficiary of the AI boom since the trend began, but its importance has become even more apparent in recent months. After being viewed as a relative laggard for several years, Alphabet ( GOOGL ) has reasserted itself as a leader in AI and large language models. A major driver of that shift has been renewed appreciation for Alphabet’s proprietary hardware stack, most notably its Tensor Processing Units (TPUs), which Google has deployed internally for nearly a decade.\n\nBroadcom plays a critical role in that ecosystem. While TPUs are branded as Google-designed chips, Broadcom provides the underlying expertise in ASIC design, networking, and high-speed I/O, effectively enabling Google to scale these systems reliably at hyperscale. As Alphabet rapidly expands AI infrastructure across Search, cloud services, and generative AI models, custom silicon becomes economically unavoidable. Broadcom sits squarely at the center of that transition, helping design chips optimized for inference, training, and internal workloads, areas where generic GPUs are often less cost-efficient. As Alphabet’s AI leadership has become clearer, Broadcom’s strategic importance has risen alongside it.\nFrom a fundamentals perspective, Broadcom currently carries a Zacks Rank #3 (Hold) , reflecting a pause in earnings revisions rather than any deterioration in outlook. Consensus estimates still call for 35.7% annual EPS growth over the next three to five years, and the stock trades at roughly 36x one-year forward earnings. Given that growth profile and Broadcom’s deep entrenchment in the AI infrastructure stack, valuation remains reasonable relative to peers.\n\nTechnically, Broadcom had been outperforming much of the AI complex in recent months as investors increasingly recognized its role within the Alphabet AI ecosystem. The sharp selloff following its most recent earnings report was less about weakening fundamentals and more about positioning and nuanced guidance, a classic “sell-the-news” event after a strong run. Importantly, shares found support at a level that has held up the stock since late summer. As long as that support holds, the consolidation looks constructive, and the near-term technical outlook remains encouraging.\n\nImage Source: TradingView\nVertiv Stock Sits Within Trading Range Vertiv remains one of the purest plays on the physical backbone of the AI buildout, supplying critical power, cooling, and thermal-management solutions to hyperscale and enterprise data centers. Recent developments continue to reinforce that positioning. Over the past several months, Vertiv has announced expanded partnerships with large data center operators and hyperscalers, while management has highlighted strong backlog growth and improving visibility tied directly to AI-driven capacity expansion. Demand for high-density cooling solutions continues to exceed expectations as next-generation AI workloads push power and thermal limits higher.\n\nFundamentally, the story remains compelling. Vertiv currently carries a Zacks Rank #2 (Buy) as earnings estimates continue to trend higher. Consensus forecasts call for 30.2% annual EPS growth over the next three to five years, reflecting operating leverage, improving margins, and sustained AI-related demand. While the stock trades at a 40.6x forward earnings multiple, that valuation appears justified given Vertiv’s growth rate, expanding addressable market, and increasingly important role in AI infrastructure.\nThe technical setup adds another layer of appeal. After a sharp advance earlier in the cycle, VRT has spent recent months consolidating within a well-defined trading range. Importantly, the stock recently bounced cleanly off support within its rising channel. The key level to watch on the upside is the ~$180 area, which marks the top of the current range. A decisive breakout above that level would likely signal the next leg higher, while continued support near the lower end of the channel keeps the risk-reward profile attractive.\n\nTaken together, Vertiv offers a differentiated way to participate in the AI boom—not through chips or software, but through the indispensable infrastructure that makes large-scale AI deployment possible. With fundamentals strengthening and the technical picture improving, VRT remains well positioned as investors look ahead to 2026.\n\nImage Source: TradingView\nShould Investors Buy Shares in VRT, NVDA and AVGO? Taken together, Nvidia, Broadcom, and Vertiv offer complementary exposure to the core layers of the AI buildout—compute, custom silicon and networking, and physical infrastructure. While near-term volatility is always possible, fundamentals, earnings momentum, and long-term demand visibility remain firmly intact. With each stock positioned at a critical point in the AI value chain and trading near technically important levels, the current setup favors accumulation opportunistically as the AI investment cycle extends into 2026 and beyond.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nVertiv Holdings Co. (VRT) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "01:50:00",
      "Source": "Barrons.com",
      "Title": "A Stock Market Priced for Perfection Can Still Have a Very Good Year",
      "URL": "https://finance.yahoo.com/m/bf595d08-7ab1-34b3-91ad-ec5c467017c5/a-stock-market-priced-for.html",
      "Content": "A Stock Market Priced for Perfection Can Still Have a Very Good Year\n\nJosh Schafer\nFri, December 26, 2025 at 9:50 AM PST 3 min read\n\nIn this article: FDS\n\n^GSPC\n\nChristmas week sparked a Santa Claus rally, but a stock market that’s posted three straight years of above-average gains will have to wrestle with a simple fact of life—it’s incredibly hard to stay perfect. The S&P 500 is expected to grow earnings by 15% in 2026, per FactSet, while net profit margins are forecast to hit 13.9%, the highest since FactSet began tracking the metric in 2008. Meanwhile, economic growth forecasts are moving higher after a stellar third-quarter gross-domestic-product reading, inflation isn’t expected to be a problem, and the labor market should be able to hold on.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "23:35:00",
      "Source": "Zacks",
      "Title": "QCOM Rides on Strength in Premium Handset Market: Will it Sustain?",
      "URL": "https://finance.yahoo.com/news/qcom-rides-strength-premium-handset-153500215.html",
      "Content": "QCOM Rides on Strength in Premium Handset Market: Will it Sustain?\n\nZacks Equity Research\nFri, December 26, 2025 at 7:35 AM PST 3 min read\n\nIn this article: QCOM\n\n2454.TW\n\nAAPL\n\nSSNLF\n\nQualcomm Incorporated ( QCOM ) generated about $6.96 billion in handset revenues in the latest quarter, with a year-over-year increase of 14% and an estimated $27.8 billion in fiscal 2025, contributing roughly 63% of the total company’s revenues. Qualcomm’s strong handset revenues are driven by its increased customer demand for Snapdragon-powered premium Android smartphones.\n\nQualcomm faces strong competition from rivals like MediaTek, especially in mid-range and budget smartphones, which puts pressure on its market share and pricing. U.S.-China trade tensions have reduced companies' handset demand to a great extent. Qualcomm's handset business experienced ongoing challenges as global smartphone demand slowed down day by day. Moreover, major handset manufacturers, such as Apple and Samsung, are moving toward in-house chip development. This is a major challenge for Qualcomm.\nTo overcome challenges in the smartphone business, Qualcomm is focusing on premium Snapdragon chips to stay competitive in flagship devices. Qualcomm recently launched the Snapdragon 8 Gen 5, offering high-speed performance, advanced AI, improved graphics, and enhanced camera capabilities for flagship smartphones from global brands like iQOO , Honor, ASUS, OnePlus, and Vivo.\n\nPer a report from Precedence Research, the global 5G chipset market is expected to reach $126.4 billion by 2030 from $18.7 billion in 2022, with a CAGR of 27%, indicating strong underlying growth potential for Qualcomm’s handset segment in the near future. QCOM’s continuous innovation in powering flagship devices with cutting-edge features helps to boost its handset revenues, maintain leadership in the premium segment, and drive future revenue growth.\nOther Tech Companies Focused on Handset Chip Development Qualcomm faces competition from Apple, Inc. ( AAPL ) and Broadcom, Inc. ( AVGO ). Apple recently launched the new iPad Pro, MacBook Pro, and upgraded Vision Pro, all powered by their M5 chip. Apple’s iPhone 17 series uses the A19 chip, and the iPhone Air features the A19 Pro chip, both offering faster performance, better graphics, and advanced AI capabilities. These recent chips strengthen Apple’s position in the smartphone market and reduce its reliance on third-party suppliers.\n\nBroadcom recently launched Wi Fi 8 chips for smartphones and connected devices, improving speed, reliability, and efficiency. Broadcom, by providing essential smartphone components like Wi Fi, Bluetooth, and RF chips for major brands, remains important in the handset market. The company also focuses on affordable LTE chips for emerging markets, helping OEMs bring affordable smartphones to countries like India.\n\nStory Continues\nQCOM’s Price Performance, Valuation and Estimates Qualcomm shares have gained 11.1% over the past year compared with the industry ’s growth of 35.3%.\n\nImage Source: Zacks Investment Research\nGoing by the price/earnings ratio, the company's shares currently trade at 14.26 forward earnings, lower than 34.54 for the industry.\n\nImage Source: Zacks Investment Research\nEarnings estimates for 2025 have increased 2% to $12.15 over the past 60 days, while those for 2026 have risen 3.4% to $12.60.\n\nImage Source: Zacks Investment Research\nQualcomm stock currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nApple Inc. (AAPL) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "22:00:05",
      "Source": "Zacks",
      "Title": "Broadcom Inc. (AVGO) is Attracting Investor Attention: Here is What You Should Know",
      "URL": "https://finance.yahoo.com/news/broadcom-inc-avgo-attracting-investor-140005180.html",
      "Content": "Broadcom Inc. (AVGO) is Attracting Investor Attention: Here is What You Should Know\n\nZacks Equity Research\nFri, December 26, 2025 at 6:00 AM PST 5 min read\n\nIn this article: AVGO\n\n^GSPC\n\nBroadcom Inc. (AVGO) has recently been on Zacks.com's list of the most searched stocks. Therefore, you might want to consider some of the key factors that could influence the stock's performance in the near future.\nOver the past month, shares of this chipmaker have returned -11.9%, compared to the Zacks S&P 500 composite's +2.6% change. During this period, the Zacks Electronics - Semiconductors industry, which Broadcom Inc. falls in, has lost 3.9%. The key question now is: What could be the stock's future direction?\n\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nRevisions to Earnings Estimates Rather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nFor the current quarter, Broadcom Inc. is expected to post earnings of $2.01 per share, indicating a change of +25.6% from the year-ago quarter. The Zacks Consensus Estimate has changed +5.6% over the last 30 days.\nFor the current fiscal year, the consensus earnings estimate of $9.69 points to a change of +42.1% from the prior year. Over the last 30 days, this estimate has changed +6.3%.\nFor the next fiscal year, the consensus earnings estimate of $13.68 indicates a change of +41.2% from what Broadcom Inc. is expected to report a year ago. Over the past month, the estimate has changed +17.3%.\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Broadcom Inc. is rated Zacks Rank #3 (Hold).\n\nStory Continues\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS Projected Revenue Growth While earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\n\nFor Broadcom Inc., the consensus sales estimate for the current quarter of $19.23 billion indicates a year-over-year change of +28.9%. For the current and next fiscal years, $92.57 billion and $130.01 billion estimates indicate +44.9% and +40.4% changes, respectively.\nLast Reported Results and Surprise History Broadcom Inc. reported revenues of $18.02 billion in the last reported quarter, representing a year-over-year change of +28.2%. EPS of $1.95 for the same period compares with $1.42 a year ago.\nCompared to the Zacks Consensus Estimate of $17.5 billion, the reported revenues represent a surprise of +2.94%. The EPS surprise was +4.28%.\n\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\nValuation No investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\n\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nBroadcom Inc. is graded D on this front, indicating that it is trading at a premium to its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nConclusion The facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Broadcom Inc.. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "19:44:44",
      "Source": "GuruFocus.com",
      "Title": "Top Analyst Says Nvidia and Broadcom May Explode on Next-Gen AI Rollout",
      "URL": "https://finance.yahoo.com/news/cantor-fitzgerald-nvidia-broadcom-may-114444609.html",
      "Content": "Top Analyst Says Nvidia and Broadcom May Explode on Next-Gen AI Rollout\n\nNauman Khan\nFri, December 26, 2025 at 3:44 AM PST 1 min read\n\nIn this article: AVGO\n\nNVDA\n\nGOOG\n\nThis article first appeared on GuruFocus .\nNvidia ( NASDAQ:NVDA ) and Broadcom ( NASDAQ:AVGO ) may be positioned for potential gains in 2026, Cantor Fitzgerald said Wednesday, following a period of recent weakness in semiconductor stocks.\nAnalyst C.J. Muse noted that AI-related stocks have faced pressure since early November amid broader market caution and concerns over an AI valuation bubble. Muse said these concerns might be overstated, given growing demand tied to AI infrastructure.\n\nWarning! GuruFocus has detected 2 Warning Sign with AVGO.\nIs AVGO fairly valued? Test your thesis with our free DCF calculator.\nNvidia shares are trading at roughly 16 times Cantor's earnings estimates. The rollout of next-generation hardware, the Rubin GPU architecture and the custom Vera CPU, which together form the Vera Rubin platform, is expected to support massive-context AI workloads and data center growth.\nBroadcom is valued around 26 times Cantor's earnings estimates. Muse highlighted the company's networking business and its role in supporting Google ( NASDAQ:GOOG ) tensor processing units, which could further benefit from AI-driven infrastructure spending.\nThe firm reiterated Nvidia and Broadcom as top picks for 2026, suggesting investors consider establishing positions ahead of anticipated AI-related growth, according to a Wednesday press release.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "19:44:44",
      "Source": "GuruFocus.com",
      "Title": "Cantor Fitzgerald: Nvidia and Broadcom May Explode on Next-Gen AI Rollout",
      "URL": "https://finance.yahoo.com/news/cantor-fitzgerald-nvidia-broadcom-may-114444609.html",
      "Content": "Cantor Fitzgerald: Nvidia and Broadcom May Explode on Next-Gen AI Rollout\n\nNauman Khan\nFri, December 26, 2025 at 3:44 AM PST 1 min read\n\nIn this article: AVGO\n\nNVDA\n\nGOOG\n\nThis article first appeared on GuruFocus .\nNvidia ( NASDAQ:NVDA ) and Broadcom ( NASDAQ:AVGO ) may be positioned for potential gains in 2026, Cantor Fitzgerald said Wednesday, following a period of recent weakness in semiconductor stocks.\nAnalyst C.J. Muse noted that AI-related stocks have faced pressure since early November amid broader market caution and concerns over an AI valuation bubble. Muse said these concerns might be overstated, given growing demand tied to AI infrastructure.\n\nWarning! GuruFocus has detected 2 Warning Sign with AVGO.\nIs AVGO fairly valued? Test your thesis with our free DCF calculator.\nNvidia shares are trading at roughly 16 times Cantor's earnings estimates. The rollout of next-generation hardware, the Rubin GPU architecture and the custom Vera CPU, which together form the Vera Rubin platform, is expected to support massive-context AI workloads and data center growth.\nBroadcom is valued around 26 times Cantor's earnings estimates. Muse highlighted the company's networking business and its role in supporting Google ( NASDAQ:GOOG ) tensor processing units, which could further benefit from AI-driven infrastructure spending.\nThe firm reiterated Nvidia and Broadcom as top picks for 2026, suggesting investors consider establishing positions ahead of anticipated AI-related growth, according to a Wednesday press release.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "00:47:26",
      "Source": "Investor's Business Daily",
      "Title": "Nvidia Licenses Groq's AI Chip Tech, Grabs Top Execs In Not-Quite Takeover",
      "URL": "https://finance.yahoo.com/m/ba65cea8-f694-3370-b38a-aeedb9f7b0cf/nvidia-licenses-groq%27s-ai.html",
      "Content": "Nvidia Licenses Groq's AI Chip Tech, Grabs Top Execs In Not-Quite Takeover\n\nED CARSON\nThu, December 25, 2025 at 8:47 AM PST 2 min read\n\nIn this article: NVDA\n\nAVGO\n\nGOOG\n\nGROQ.PVT\n\nNvidia will license key technology from AI chip startup Groq, hiring top personnel. It's not a full takeover, but might be close.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "21:30:21",
      "Source": "Investor's Business Daily",
      "Title": "These 7 Stocks Are Analyst Favorites For Magnificent Earnings Growth; GE, Google Among Winners",
      "URL": "https://finance.yahoo.com/m/2b47c372-177e-3051-aa01-406a8d82b220/these-7-stocks-are-analyst.html",
      "Content": "These 7 Stocks Are Analyst Favorites For Magnificent Earnings Growth; GE, Google Among Winners\n\nJUAN CARLOS ARANCIBIA\nThu, December 25, 2025 at 5:30 AM PST 9 min read\n\nIn this article: SCHW\n\nAPH\n\nAVGO\n\nLRCX\n\nGOOG\n\nAmong the best stocks in earnings performance, Broadcom boasts a 98 EPS Rating, one of the highest in the chip sector.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "21:00:15",
      "Source": "Simply Wall St.",
      "Title": "Broadcom's (NASDAQ:AVGO) five-year earnings growth trails the 55% YoY shareholder returns",
      "URL": "https://finance.yahoo.com/news/broadcoms-nasdaq-avgo-five-earnings-130015332.html",
      "Content": "Broadcom's (NASDAQ:AVGO) five-year earnings growth trails the 55% YoY shareholder returns\n\nSimply Wall St\nThu, December 25, 2025 at 5:00 AM PST 3 min read\n\nIn this article: AVGO\n\nBuying shares in the best businesses can build meaningful wealth for you and your family. And we've seen some truly amazing gains over the years. For example, the Broadcom Inc. ( NASDAQ:AVGO ) share price is up a whopping 705% in the last half decade, a handsome return for long term holders. This just goes to show the value creation that some businesses can achieve. And in the last week the share price has popped 7.4%. But this could be related to the buoyant market which is up about 3.1% in a week. It really delights us to see such great share price performance for investors.\n\nThe past week has proven to be lucrative for Broadcom investors, so let's see if fundamentals drove the company's five-year performance.\nTrump has pledged to \"unleash\" American oil and gas and these 15 US stocks have developments that are poised to benefit.\nTo quote Buffett, 'Ships will sail around the world but the Flat Earth Society will flourish. There will continue to be wide discrepancies between price and value in the marketplace...' One imperfect but simple way to consider how the market perception of a company has shifted is to compare the change in the earnings per share (EPS) with the share price movement.\nOver half a decade, Broadcom managed to grow its earnings per share at 49% a year. This EPS growth is reasonably close to the 52% average annual increase in the share price. That suggests that the market sentiment around the company hasn't changed much over that time. In fact, the share price seems to largely reflect the EPS growth.\nYou can see below how EPS has changed over time (discover the exact values by clicking on the image).\nIt's probably worth noting we've seen significant insider buying in the last quarter, which we consider a positive. On the other hand, we think the revenue and earnings trends are much more meaningful measures of the business. Before buying or selling a stock, we always recommend a close examination of historic growth trends, available here. .\n\nWhat About Dividends? When looking at investment returns, it is important to consider the difference between total shareholder return (TSR) and share price return . The TSR incorporates the value of any spin-offs or discounted capital raisings, along with any dividends, based on the assumption that the dividends are reinvested. So for companies that pay a generous dividend, the TSR is often a lot higher than the share price return. We note that for Broadcom the TSR over the last 5 years was 795%, which is better than the share price return mentioned above. The dividends paid by the company have thusly boosted the total shareholder return.\n\nStory Continues\nA Different Perspective It's nice to see that Broadcom shareholders have received a total shareholder return of 47% over the last year. And that does include the dividend. However, the TSR over five years, coming in at 55% per year, is even more impressive. I find it very interesting to look at share price over the long term as a proxy for business performance. But to truly gain insight, we need to consider other information, too. For instance, we've identified 2 warning signs for Broadcom that you should be aware of.\n\nThere are plenty of other companies that have insiders buying up shares. You probably do not want to miss this free list of undervalued small cap companies that insiders are buying.\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "20:22:33",
      "Source": "Investor's Business Daily",
      "Title": "Nvidia Licenses Groq's AI Chip Tech, Grabs Top Execs",
      "URL": "https://finance.yahoo.com/m/ba65cea8-f694-3370-b38a-aeedb9f7b0cf/nvidia-licenses-groq%27s-ai.html",
      "Content": "Nvidia Licenses Groq's AI Chip Tech, Grabs Top Execs\n\nED CARSON\nThu, December 25, 2025 at 4:22 AM PST 1 min read\n\nIn this article: GROQ.PVT\n\nNVDA\n\nGOOG\n\nAVGO\n\nNvidia will license key technology from AI chip startup Groq, hiring top personnel. But it's not a full takeover, as previously reported.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "06:08:28",
      "Source": "Investor's Business Daily",
      "Title": "Nvidia Licenses Groq's AI Chip Tech, Grabs Top Execs, But Not A Takeover",
      "URL": "https://finance.yahoo.com/m/ba65cea8-f694-3370-b38a-aeedb9f7b0cf/nvidia-licenses-groq%27s-ai.html",
      "Content": "Nvidia Licenses Groq's AI Chip Tech, Grabs Top Execs, But Not A Takeover\n\nED CARSON\nWed, December 24, 2025 at 2:08 PM PST 1 min read\n\nIn this article: GROQ.PVT\n\nNVDA\n\nAVGO\n\nGOOG\n\nNvidia will license key technology from AI chip startup Groq, hiring top personnel. But it's not a full takeover, as previously reported.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "03:36:00",
      "Source": "Barrons.com",
      "Title": "This Tech Investor Likes Broadcom, Bloom Energy, and Other AI Bargains",
      "URL": "https://finance.yahoo.com/m/c40c62e1-2a05-3341-b072-3b8d8254886f/this-tech-investor-likes.html",
      "Content": "This Tech Investor Likes Broadcom, Bloom Energy, and Other AI Bargains\n\nAvi Salzman\nWed, December 24, 2025 at 11:36 AM PST 8 min read\n\nIn this article: BE\n\nNVDA\n\nCRWV\n\nGEV\n\nAVGO\n\nPaul Wick of Seligman Investments has piloted his winning fund through numerous technology cycles. How he is playing AI, and why he is skeptical of quantum computing stocks.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "02:30:00",
      "Source": "Yahoo Finance Video",
      "Title": "AI trade: Broadcom has 'one of the great' recurring revenues in tech",
      "URL": "https://finance.yahoo.com/video/ai-trade-broadcom-one-great-183000079.html",
      "Content": "AI trade: Broadcom has 'one of the great' recurring revenues in tech\n\nYahoo Finance Video and Josh Lipton\nWed, December 24, 2025 at 10:30 AM PST\n\nIn this video: AVGO\n\n^IXIC\n\nNVDA\n\n^DJI\n\n^GSPC\n\nRainwater Equity founder and portfolio manager Joseph Shaposhnik discusses what he expects from the AI trade in 2026 — highlighting underlying conditions like the interest rate environment and the state of the US economy — and why semiconductor manufacturer Broadcom ( AVGO ) is among his top stock picks for 2026.\nAlso catch Joseph Shaposhnik explain why he expects the S&P 493 to benefit from outsized returns in 2026.\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination .\n\nVideo Transcript\n\n00:00 Speaker A\nThere was a story out there, Joseph, sort of a narrative that had built that, you know, well, the AI trade and trend had better stay intact. If it doesn't, you know, the market's going to come off its wheels. But having said that, I mean, recently, you can look at, you know, some poster childs of the AI trade. You know, I think of an AI heavy name like an Nvidia. It's well off its 52-week high, Joseph, but this market has continued to grind higher. I'm just curious what you make of that.\n00:23 Joseph\nWell, I think that it it it bolsters the the thesis that the 493 certainly have legs. And I think that I think more broadly, the economy is stronger than people thought it would be when we started the year. Uh, rates are probably lower than uh, lower today than where where we thought they would be. Inflation is probably a tick lower uh, than we thought it would be. So the underlying conditions are somewhat better for the broad market and the broad market has been able to weather as you talked about, the bumps in the road that are inevitable uh uh with regard to the Mag 7 and and the AI trade. So, I think it's positive for the index as we enter 2026 that we've seen some level of broadening. And obviously, we see opportunities uh in the defense sector, uh in in healthcare and selectively in technology as well as as this rally continues to broaden.\n01:21 Speaker A\nYeah, let's get to some of those specific names and picks, Joseph. Uh you like Broadcom here for example. How come? What do you like about C.O. Hock Tan's company specifically? Is it the business model, margins, his AI story?\n01:40 Joseph\nWell, you know, our strategy is to invest in recurring revenue businesses and Broadcom has one of the great uh technology recurring revenue businesses. When you think about how they're positioned with regard to AI, they're really very, very well positioned uh in a category where the product, the GPU is 90% of the cost of the solution. And Broadcom with their XPUs is dramatically reducing the cost of effectuating the outcome that AI provides. And so we think that they'll continue to take market share among the hyperscalers, which is going to drive fantastic revenue growth in the AI business. We see the AI business doubling uh in 2026 for Broadcom and we see it growing very, very rapidly uh after 2026. So long-term, they're very, very well positioned with a product that is that is highly efficient for their customers.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 52
}