{
  "stock_id": "AVGO",
  "last_updated": "2025-12-19T04:10:47.568Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-19",
      "Time": "12:07:00",
      "Source": "TheStreet",
      "Title": "Bank of America revamps forecast for 'bridge-to-grid' AI stock",
      "URL": "https://finance.yahoo.com/m/803ae81f-c6a1-31df-bc3d-35a4a47b4ec9/bank-of-america-revamps.html",
      "Content": "Bank of America revamps forecast for 'bridge-to-grid' AI stock\n\nSilin Chen\nThu, December 18, 2025 at 8:07 PM PST 3 min read\n\nIn this article: GEV\n\n^IXIC\n\nORCL\n\nAVGO\n\nU.S. stocks have been swinging as investors debate whether the AI boom is turning into a bubble. Over the past five days, the tech-heavy Nasdaq Composite has declined by approximately 2.4%.\nMixed earnings from companies such as Oracle and Broadcom have added to the AI bubble concern, raising questions about whether massive AI-related spending will translate into returns.\n\nThe uncertainty has weighed on shares across the AI supply chain , including companies indirectly tied to the theme.\nGE Vernova ( GEV ), a maker of energy turbines and grid equipment, has also come under pressure. The company has increasingly been viewed as an AI play because of the enormous amount of electricity required to power data centers.\nGE Vernova stock is down roughly 15% over the past five days, despite some analysts setting positive tones on the stock.\n“AI is still in the build phase,” Fidelity analyst says Training AI models and running AI applications consume vast amounts of power, creating growing opportunities for companies involved in power generation and grid infrastructure, according to Clayton Pfannenstiel , co-manager of the Fidelity Select Industrials Portfolio at Fidelity.\nNatural gas turbines are one of the most immediate solutions to easing the power bottleneck.\n\nRelated: Analysts revamp Oracle stock price target after slump\n“If we need power now, the main source is gas turbines,” said Pfannenstiel.\nGE Vernova is Pfannenstiel’s fourth-largest holding, accounting for about 5.4% of the portfolio. He said the company is already seeing stronger natural gas turbine orders, prompting management to raise its earnings outlook.\n“AI is still in the build phase,” said Pfannenstiel. “There are a lot of ‘picks and shovels’ companies that could potentially benefit.”\nAI power demand reshapes GE Vernova’s growth outlook GE Vernova recently lifted its guidance at its Dec. 9 investor update event . The company now expects revenue to reach $52 billion in 2028, up from $45 billion, with adjusted EBITDA margins expanding from about 9% this year to 20% by 2028.\nManagement also raised its backlog outlook to $200 billion from $135 billion, driven in part by rapid growth in its electrification business. GE Vernova expects free cash flow to rise to $22 billion from $14 billion between 2025 and 2028.\n\nThe company has doubled its dividend to $0.5 per share and increased its share repurchase authorization to $10 billion from $6 billion.\n“Electric power will be critical to unlocking economic growth in the decades ahead and we are well-positioned with our large installed base and platform of advanced solutions to serve this growing, long-cycle market,\" said GE Vernova CEO Scott Strazik.\n\nStory Continues\nBank of America bullish on GEV stock Bank of America analyst Andrew Obin has a $804 price target and a buy rating on GE Vernova stocks, citing strong demand for power and grid equipment, according to a Dec. 16 research note sent to TheStreet.\nObin said GE Vernova remains “laser focused on execution” as regulatory (for example, the Environmental Protection Agency is reconsidering air regulations on power plants), data center, and electrification trends all stand in the company’s favor.\n\nRelated: Cathie Wood sells $40 million of megacap tech stock\nThe analyst added that his target multiple for GE Vernova represents a premium to the roughly 14 times peer average on 2026 estimates, reflecting GE Vernova’s stronger financials.\n\"We argue a premium multiple is warranted given above-peer earnings growth and margin trajectory,\" said Obin.\nWhat's boosting the need for power generation and grid equipment is not just data centers, but also building electrification and electric vehicles, Obin said in an earlier Dec. 10 research note.\n\"We see data center growth, building electrification, and electric vehicle adoption driving faster electrical load growth. This should drive increased demand for power generation and grid equipment as well as gas power services,\" he said.\nGE Vernova stock is up roughly 95% year-to-date as of Dec. 18.\nRelated: Longtime fund manager offers 2-word stock market prediction for 2026\nThis story was originally published by TheStreet on Dec 19, 2025, where it first appeared in the Investing section. Add TheStreet as a Preferred Source by clicking here.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "08:52:00",
      "Source": "Motley Fool",
      "Title": "This \"Magnificent Seven\" Company May Now Be Winning the AI War",
      "URL": "https://finance.yahoo.com/m/b54209c2-822e-362d-96f9-5e8ae83e74bb/this-%22magnificent-seven%22.html",
      "Content": "This \"Magnificent Seven\" Company May Now Be Winning the AI War\n\nJennifer Saibil, The Motley Fool\nThu, December 18, 2025 at 4:52 PM PST 5 min read\n\nIn this article: GOOG\n\nNVDA\n\nAVGO\n\nAMZN\n\nMETA\n\nKey Points After ChatGPT took some of its search traffic, Alphabet rebounded by introducing AI Overviews and AI Mode.\nAlphabet's Gemini 3 is considered a leading LLM.\nManagement will increase the tech giant's capital expenditures in 2026.\n10 stocks we like better than Alphabet ›\nIt's clear that artificial intelligence (AI) is changing the world in significant ways, and the major hyperscalers are all investing hundreds of billions of dollars in their efforts to capitalize on the trend. Companies like Amazon , Meta Platforms , and Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) are all developing robust AI businesses that are driving the charge, and companies like Nvidia and Broadcom are providing key parts of the hardware infrastructure that supports the technology.\n\nIf 2025 was a year of expansion, 2026 could be a year when those companies' investments start showing results, and when that happens, Alphabet could be a big winner.\nMore AI for more people The current types of large language models (LLMs) were first introduced to the public through OpenAI's ChatGPT three years ago, but Alphabet has actually used similar tech to power its Google search engine for years. However, the ChatGPT launch changed the AI landscape and led to a new LLM race, and Alphabet now offers its own generative AI services.\n\nAlthough it looked for a time like Google was in danger of losing its dominance in search as more people just asked questions to ChatGPT and had it do the legwork, Alphabet has responded effectively by rolling out its own competitive LLMs, and it flipped the script by offering AI Overview and AI Mode on its search pages. Recently, paid clicks have been accelerating, and Alphabet's revenue is soaring. Sales increased 16% year over year in the third quarter, with strong performances across the business.\nToday, its operation includes a broad spectrum of products and services, including YouTube, Android, Waymo autonomous vehicles, and others. Google Search remains its core business, but there's a lot more going on. Its varied revenue streams will provide it with diverse growth drivers in 2026 and beyond.\n\nHowever, of particular importance recently is the Google Cloud Platform. Alphabet's cloud services are where its clients engage with generative AI to create their own apps and agents, and cloud services revenue increased 34% year over year in Q3. The accelerating pace of growth in this area implies that the opportunity to create with AI is attracting more clients to the cloud, and Alphabet's newest LLM, Gemini 3, has been rated the top LLM to use right now according to several leaderboards. Gemini has 650 million active users, and the company is capitalizing on its strong user base to monetize these services.\n\nStory Continues\nNot just LLMs Beyond its robust LLMs, which may be winning the LLM wars at least for now, and its search feature, which still holds a market share of about 90%, Alphabet has other AI products that are driving growth. It designs its own AI accelerator chips, called Tensor Processing Units (TPUs), which it uses to train and power its LLMs, along with the Nvidia graphics processing units (GPUs) that most of its rivals are using today.\n\n\"Our extensive and reliable infrastructure, which powers all of Google's products, is the foundation of our stack and a key differentiator,\" CEO Sundar Pichai said.\nAlphabet has made several important deals recently for its TPUs, which are specialized chips designed for deep learning and inference workloads, in contrast with Nvidia's more general-purpose GPUs. TPUs give Alphabet an edge in AI development, especially as LLMs become more sophisticated and need more of this kind of processing power to deliver the results users want. Alphabet signed a key partnership with Anthropic, which makes the popular Claude LLM, and is rumored to be in talks with Meta to supply it with chips.\nMore in store for 2026 On the Q3 earnings call, management told investors that it expects to spend between $91 billion and $93 billion on capital expenditures in 2025, up from its previous forecast figure of $85 billion. It also plans a \"significant increase\" in capex in 2026.\nThe results of all this spending are already showing up in accelerated cloud growth, accelerating paid clicks, and higher overall sales, and those trends could get even better next year.\n\nShould you invest $1,000 in Alphabet right now? Before you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $511,196 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,047,897 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 951 % — a market-crushing outperformance compared to 192% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nJennifer Saibil has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Meta Platforms, and Nvidia. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nThis \"Magnificent Seven\" Company May Now Be Winning the AI War was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "08:30:03",
      "Source": "Barchart",
      "Title": "Broadcom Stock Just Raised Its Dividend by 10%. Should You Buy AVGO Stock Now?",
      "URL": "https://finance.yahoo.com/m/68502d6d-cb40-3f84-bd0a-46192534c21b/broadcom-stock-just-raised.html",
      "Content": "Broadcom Stock Just Raised Its Dividend by 10%. Should You Buy AVGO Stock Now?\n\nJabran Kundi\nThu, December 18, 2025 at 4:30 PM PST 3 min read\n\nIn this article: AVGO\n\nOn Dec. 11, Broadcom (AVGO) declared a $0.65 dividend for the quarter, a 10.2% increase from the previous quarter’s $0.59. The chipmaker continues to reward long-term investors as a rare dividend payer in the semiconductor industry. The fact that the company can not only keep up with but also increase the dividend payout speaks volumes about its strong cash flows.\n\nThe world is seeing increasing investment in IT infrastructure upgrades since the emergence of generative AI in 2022. As an AI chipmaker, AVGO is expected to continue reaping the benefits of this AI boom, which, according to analysts, is likely only at the halfway stage in terms of infrastructure spending.\nMore News from Barchart Why Short–Term Bond ETFs Might Be the Best Income Investment for 2026\nThis Bank Stock May Be Small, But It Has Big Potential\nStop Missing Market Moves: Get the FREE Barchart Brief – your midday dose of stock movers, trending sectors, and actionable trade ideas, delivered right to your inbox. Sign Up Now!\n\nBank of America’s analysts believe volatility is set to dominate chip stocks, mainly because the question of ROI on AI investments is going to become increasingly important. However, for companies like Broadcom, the chip demand should stay strong. In 2026, semiconductor sales are likely to hit the $1 trillion mark for the first time. AVGO will take a good chunk of this pie.\nAbout Broadcom Stock Broadcom is a global tech giant that designs semiconductor equipment, along with software and networking equipment. The company plays a pivotal role in meeting the demand of the AI industry through its custom chip designs, built specifically to run AI workloads. It is led by CEO Hock Tan and headquartered in San Jose, California.\nDespite a 22% drop in the last five trading sessions, the stock is up 35% in the last year, comfortably outpacing the Nasdaq Composite Index’s ($NASX) 13.2% gains.\nBroadcom’s forward P/E of 44.68x has finally fallen below its five-year average forward P/E of 47.36x. This isn’t any significant discount, especially when seen in the context of its peers. Both Nvidia (NVDA) and Marvell Technologies (MRVL) trade at a forward P/E below AVGO at 38.38x and 28.06x, respectively. Even with a 22% dip in a matter of five days, the stock is trading at a premium to its peers. Its long-term debt-to-total capital ratio of 42.33% is also significantly higher than NVDA's 7.31% and MRVL’s 22.43%. It is quite possible that this high valuation is what has caused such a strong negative reaction post-earnings, coupled with the obvious margin pressure the company is facing going forward.\n\nStory Continues\nAVGO now boasts a 0.77% forward dividend yield, giving enough dividend security to investors who like to cash in quarterly dividends while betting on the growth of the semiconductor industry.\nBroadcom Stock Reports Strong Earnings AVGO announced its Q4 2025 earnings on Dec. 12. It reported an EPS of $1.95 vs. $1.86 expected on a strong revenue of $18.02 billion vs. $17.49 billion expected. Going forward, the first fiscal quarter’s revenue is likely to come in at $19.1 billion, a healthy 28% year-over-year (YoY) growth.\nManagement clarified on the earnings call that the $10 billion customer announced during the quarter was Anthropic. Investors were presented with another surprise, as the company announced a fifth large customer as well. Broadcom also signed a deal with OpenAI recently and carries a $73 billion backlog, which it is likely to deliver over the next 18 months. This aids Broadcom's ambitious revenue targets, as per analysts.\n\nWhat Analysts Are Saying About AVGO Stock AVGO is a top pick among analysts, with 34 out of 40 Wall Street analysts rating it a “Strong Buy.” Earlier in the week, UBS raised AVGO’s price target from $472 to $475, implying a further 45% upside. Due to the ongoing dip in the stock price, the highest price target of $535 offers 64% upside from here on.\nOn the date of publication, Jabran Kundi did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "05:55:20",
      "Source": "MT Newswires",
      "Title": "US Equity Indexes Rise as Cooling Inflation Aids Fed Doves, Micron Technology's Solid Q1 Lifts Sentiment",
      "URL": "https://finance.yahoo.com/news/us-equity-indexes-rise-cooling-215520006.html",
      "Content": "PREMIUM\nUS Equity Indexes Rise as Cooling Inflation Aids Fed Doves, Micron Technology's Solid Q1 Lifts Sentiment\n\nMT Newswires\nThu, December 18, 2025 at 1:55 PM PST 3 min read\n\nIn this article: ORCL\n\n^SPX\n\nAIQ\n\nAVGO\n\nMU\n\nUS equity indexes advanced on Thursday as a surprise retreat in the inflation rate boosted the odds\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "05:52:29",
      "Source": "Yahoo Finance Video",
      "Title": "AI trade is helping build out the 'next new economy': Strategist",
      "URL": "https://finance.yahoo.com/video/ai-trade-helping-build-next-215229607.html",
      "Content": "AI trade is helping build out the 'next new economy': Strategist\n\nYahoo Finance Video and Josh Lipton\nThu, December 18, 2025 at 1:52 PM PST\n\nIn this video: QCOM\n\nNVDA\n\nAMZN\n\nGOOG\n\nTXN\n\nAs the AI boom continues, investors hedge their bets on what's next for the AI trade as companies spend trillions building out AI infrastructure. Pence Capital Management CIO Dryden Pence sits down with Market Domination Host Josh Lipton to talk about his expectations for the AI space.\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination .\n\nVideo Transcript\n\n00:00 Speaker A\nbroadly when you look at that AI trade, you see some evidence that maybe investors are getting a little some jitters are popping up, some nerves.\n00:07 Speaker A\nBut then you see the companies drawing like I my micron earnings after the bell. I did a double take on that guidance. I thought I had been reading it wrong, right? It was that much of a beat. That thing reported and surged and it's this story of demand strong, supply tight. I'm just curious what you make of that.\n00:23 Speaker B\nWe are in the we're in the infrastructure\n00:30 Speaker B\nbuilding period\n00:32 Speaker B\nof the next new economy. This is like the transcontinental railroad, which transformed our entire economy uh with transportation stuff, you know, back in the 1870s.\n00:43 Speaker B\nSo when you look at right now, we're spending a tremendous amount of money, not all the companies are going to be winners. You got to look at it one by one. But\n00:51 Speaker B\nwhen you recognize the amount of capital that's going into this, we're just in the early stages. We're in the infrastructure stage.\n00:58 Speaker B\nWhat's going to happen when we go to the implementation stage where companies are now going to use this AI technology and all of this infrastructure to increase labor productivity and and and jobs. That's that's really going to push earnings not just for the Mac 7,\n01:11 Speaker B\nbut for the entire economy.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "05:01:39",
      "Source": "Yahoo Finance",
      "Title": "Stock market today: Dow, S&P 500, Nasdaq jump after cooler CPI inflation reading as AI trade reignites",
      "URL": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-jump-after-cooler-cpi-inflation-reading-as-ai-trade-reignites-210127820.html",
      "Content": "LIVE\n\nStock market today: Dow, S&P 500, Nasdaq jump after cooler CPI inflation reading as AI trade reignites\n\nKaren Friar , Brett LoGiurato and Ines Ferré\nThu, December 18, 2025 at 1:01 PM PST 2 min read\n\nIn this article: MU\n\n^DJI\n\nGOOG\n\n^IXIC\n\nNVDA\n\nUS stocks rebounded on Thursday as investors digested easing inflation pressures from the latest reading on consumer prices that could help set expectations for the path of interest rates.\nThe tech-heavy Nasdaq Composite ( ^IXIC ) led the way up with a gain of 1.4%, pushed north by a strong earnings report from Micron ( MU ), which saw its shares rise 10%. The tech gain came after AI trade worries had spurred another bruising session for tech on Wednesday.\nShares in the benchmark S&P 500 ( ^GSPC ) and the blue chip-heavy Dow Jones Industrial Average ( ^DJI ) rose around 0.8% and 0.2%, respectively.\n\nHeadlining the morning was a cooler-than-expected Consumer Price Index (CPI) report, which showed inflation rose 2.7% in November over the prior year and 2.6% on a \"core\" basis — both figures coming in below economist estimates of 3% and 3.1%, respectively.\nAs with Tuesday's monthly jobs report , economists have noted that the inflation data may be less reliable than normal thanks to the US government shutdown . At the same time, the Federal Reserve seems more attentive to cracks in the labor market than to price pressures. On Wednesday, Fed governor Chris Waller signaled support for rate cuts before the release of the CPI update.",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "04:53:46",
      "Source": "MT Newswires",
      "Title": "Cooling Inflation, Micron Technology's Blowout Q1 Send US Equity Indexes Higher",
      "URL": "https://finance.yahoo.com/news/cooling-inflation-micron-technology-apos-205346508.html",
      "Content": "PREMIUM\nCooling Inflation, Micron Technology's Blowout Q1 Send US Equity Indexes Higher\n\nMT Newswires\nThu, December 18, 2025 at 12:53 PM PST 2 min read\n\nIn this article: ^IXIC\n\nMU\n\n^GSPC\n\n^DJI\n\nUS equity indexes climbed ahead of Thursday's close as an unexpected drop in the inflation rate lift\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "04:12:04",
      "Source": "StockStory",
      "Title": "KLA Corporation (KLAC) Stock Is Up, What You Need To Know",
      "URL": "https://finance.yahoo.com/news/kla-corporation-klac-stock-know-201204461.html",
      "Content": "KLA Corporation (KLAC) Stock Is Up, What You Need To Know\n\nJabin Bastian\nThu, December 18, 2025 at 12:12 PM PST 2 min read\n\nIn this article: KLAC\n\nMU\n\nNVDA\n\nAVGO\n\nAMAT\n\nWhat Happened? Shares of semiconductor manufacturing equipment maker KLA Corporation (NASDAQ:KLAC) jumped 4.6% in the afternoon session after the company was named a top pick for 2026 by Jefferies amid a broader rally in the chip sector.\nThe positive sentiment came after the investment firm identified KLA alongside industry leaders Nvidia and Broadcom. The recommendation noted a shift in investor interest toward companies with sustainable demand from the build-out of AI infrastructure. KLA's stock also benefited from a wider rebound among chipmakers, which followed a strong forecast from memory-chip maker Micron Technology. Micron's upbeat outlook was driven by surging demand and supply shortages, which allowed the company to charge more for its products and lifted sentiment for peers like KLA and Applied Materials.\n\nAfter the initial pop the shares cooled down to $1,225, up 4.5% from previous close.\nIs now the time to buy KLA Corporation? Access our full analysis report here .\nWhat Is The Market Telling Us KLA Corporation’s shares are somewhat volatile and have had 14 moves greater than 5% over the last year. In that context, today’s move indicates the market considers this news meaningful but not something that would fundamentally change its perception of the business.\nThe previous big move we wrote about was 3 days ago when the stock gained 3.9% on the news that Jefferies upgraded the semiconductor company's stock to Buy from Hold and raised its price target.\n\nThe firm increased its price target on the shares to $1,500 from a previous target of $1,100, marking a significant 36% jump. This move signaled a more positive outlook for the company. The sentiment was echoed by other analysts. TD Cowen also raised its price target for KLA to $1,300 from $900. Similarly, Stifel increased its price target to $1,260 while maintaining its Buy rating, pointing to the company's fiscal first-quarter earnings that surpassed expectations. These actions reflected a strong growth outlook for KLA.\nKLA Corporation is up 92.3% since the beginning of the year, and at $1,225 per share, it is trading close to its 52-week high of $1,246 from December 2025. Investors who bought $1,000 worth of KLA Corporation’s shares 5 years ago would now be looking at an investment worth $4,671.\nWhile Wall Street chases Nvidia at all-time highs, an under-the-radar semiconductor supplier is dominating a critical AI component these giants can’t build without. Click here to access our full research report .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "04:12:03",
      "Source": "StockStory",
      "Title": "Marvell Technology (MRVL) Stock Is Up, What You Need To Know",
      "URL": "https://finance.yahoo.com/news/marvell-technology-mrvl-stock-know-201203934.html",
      "Content": "Marvell Technology (MRVL) Stock Is Up, What You Need To Know\n\nPetr Huřťák\nThu, December 18, 2025 at 12:12 PM PST 2 min read\n\nIn this article: MRVL\n\nTSM\n\nMU\n\nQCOM\n\nINTC\n\nWhat Happened? Shares of networking chips designer Marvell Technology (NASDAQ: MRVL) jumped 3.2% in the afternoon session after positive results from peer company Micron lifted the broader semiconductor sector.\nThe strong report created a ripple effect, boosting sentiment for chip-related companies. Marvell climbed alongside other industry players, as firms connected to memory and storage saw some of the most notable gains. For instance, Taiwan Semiconductor Manufacturing, Intel, Broadcom, and Qualcomm all recorded increases. The move highlighted investor optimism across the semiconductor space, reinforcing the view that companies like Marvell, which are key to AI infrastructure, were well-positioned.\n\nAfter the initial pop the shares cooled down to $84.30, up 3.1% from previous close.\nIs now the time to buy Marvell Technology? Access our full analysis report here .\nWhat Is The Market Telling Us Marvell Technology’s shares are extremely volatile and have had 42 moves greater than 5% over the last year. In that context, today’s move indicates the market considers this news meaningful but not something that would fundamentally change its perception of the business.\nThe previous big move we wrote about was 7 days ago when the stock dropped 3.8% on the news that reports revealed that China is moving to substitute US technology by adding domestic AI chips to its government procurement list.\n\nThis development is part of a broader \"buy local\" campaign aimed at reducing China's reliance on foreign technology, particularly from the United States, amid persistent trade and tech tensions. The Chinese government has updated its guidelines to include AI chips from homegrown companies like Huawei and Cambricon. This policy shift effectively steers government and state-affiliated buyers away from American semiconductor firms. For US chipmakers, this signals a potential loss of market share in one of the world's largest tech markets, raising concerns among investors about future revenue streams from the region.\nMarvell Technology is down 25.8% since the beginning of the year, and at $84.30 per share, it is trading 33.1% below its 52-week high of $126.06 from January 2025. Investors who bought $1,000 worth of Marvell Technology’s shares 5 years ago would now be looking at an investment worth $1,774.\nWhile Wall Street chases Nvidia at all-time highs, an under-the-radar semiconductor supplier is dominating a critical AI component these giants can’t build without. Click here to access our full research report .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "03:15:00",
      "Source": "Barrons.com",
      "Title": "Micron Earnings ‘Best’ in Chip History After Nvidia. How Its Stock Became the New AI Darling.",
      "URL": "https://finance.yahoo.com/m/2426dfcf-19b7-35a0-8d6e-a27309a08566/micron-earnings-%E2%80%98best%E2%80%99-in.html",
      "Content": "Micron Earnings ‘Best’ in Chip History After Nvidia. How Its Stock Became the New AI Darling.\n\nTae Kim\nThu, December 18, 2025 at 11:15 AM PST 2 min read\n\nIn this article: MU\n\nAVGO\n\nAMD\n\nNVDA\n\nMicron Technology earnings are out—and the AI trade may be back on track. Micron Technology stock surged Thursday, the day after the memory chip maker reported better-than-expected earnings results and gave guidance that was significantly higher than expectations. For the current quarter, Micron forecast a revenue range with a midpoint of $18.7 billion, above analysts’ expectations of $14.3 billion.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "03:11:00",
      "Source": "Zacks",
      "Title": "Micron Shares Jump on Earnings Beat - What's Next?",
      "URL": "https://finance.yahoo.com/news/micron-shares-jump-earnings-beat-191100799.html",
      "Content": "Micron Shares Jump on Earnings Beat - What's Next?\n\nEthan Feller\nThu, December 18, 2025 at 11:11 AM PST 4 min read\n\nIn this article: MU\n\nMicron Technology ( MU ) shares surged more than 11% after the company reported blowout earnings yesterday evening, easily beating analyst estimates on both the top and bottom lines. The most notable takeaway was Micron’s guidance for next quarter, with revenue expectations raised to $18.7 billion from roughly $14.2 billion and earnings guidance nearly doubling from $4.78 per share to $8.42.\n\nManagement struck a confident tone, noting that it is “more than sold out,” and reiterated expectations for the total addressable market for high-bandwidth memory to reach $100 billion by 2028, implying a compound annual growth rate of roughly 40%.\nThere’s no question this was a stellar report, capping off a banner year for the memory giant. Still, it’s hard to ignore the industry’s cyclical nature. Historically, peak earnings often coincide with peak pricing, and memory stocks have a habit of looking cheapest just before margins begin to roll over.\nThat said, the AI-driven demand backdrop makes this cycle anything but typical. With powerful secular tailwinds, a Zacks Rank #1 (Strong Buy) , and strong technical momentum reinforcing the bullish fundamentals, excessive caution here could quickly prove misplaced.\n\nWhile AI leaders like Nvidia ( NVDA ) and Broadcom ( AVGO ) have traded sideways to lower over the past several months, Micron has continued to push higher. The key question is whether tight high-bandwidth memory supply will persist and drive the stock even higher, or if investors begin rotating back into established leaders like Nvidia and Broadcom.\nFor investors considering MU stock, the most practical approach is to let the price action be the guide. Below, I’ll break down Micron’s technical setup and outline a tactical plan.\nMicron Technology Shares Rally on Earnings Upgrades As shown in the chart below, Micron shares largely stagnated between 2022 and mid-2025, reflecting a choppy earnings revision trend and lingering skepticism around the durability of the memory recovery. While AI-driven demand for high-bandwidth memory was already emerging, investors lacked confidence that Micron could fully monetize that opportunity.\n\nThat changed in the summer of 2025, when earnings revisions turned decisively higher as visibility into HBM production, pricing, and capacity allocation improved. Management’s increasingly confident guidance signaled that demand was not only strong but constrained by supply, forcing analysts to raise forecasts. As earnings expectations reset higher, the stock followed.\nThe wave of earnings upgrades has continued, earning Micron a Zacks Rank #1 (Strong Buy) . Estimates were raised again today, and over the past 60 days, current year earnings expectations have climbed 22.38%, while next year’s estimates are up 32.42%.\n\nStory Continues\n\nImage Source: Zacks Investment Research\nCan MU Stock Breakout Again? Micron’s technical chart is sending several important signals. The stock has delivered an impressive run, forming a series of consolidations and subsequent breakouts over the past several months. While shares are trading sharply higher today, MU has not yet cleared prior highs and remains within a broad trading range.\n\nKey support and resistance levels are critical to watch here. This news should be decisively bullish, but if the stock fails to break out and close above the $262 level in the near-term, it raises some caution flags. A clean breakout above that level, however, would likely signal another leg higher.\nIf MU does not break out, investors should closely monitor the rising support below. A decisive move beneath that level would materially increase downside risk. One additional cautionary signal is the expansion in the stock’s daily trading range. Stocks that grind higher on low volatility often sustain trends, but rising volatility (ranges) during an advance, as seen in MU, can sometimes precede a corrective phase.\n\nImage Source: TradingView\nWhat’s Next for Shares of Micron Technology? Micron’s earnings reset has clearly established the stock as a leader in the AI infrastructure trade, but the next phase will likely be driven by price action rather than headlines. As long as high-bandwidth memory supply remains tight and earnings revisions continue to trend higher, MU has room to extend its outperformance, even as larger AI names like Nvidia work through their own consolidation phases.\n\nThat said, leadership rotations are a constant in this market. If investor risk appetite shifts back toward platform and networking exposure, or some other vertical, you could see leadership emerge elsewhere in the AI industry. For now, however, MU’s combination of accelerating earnings momentum and constructive technicals keeps the stock firmly in focus.\nUltimately, investors should remain disciplined and let the chart confirm the next move. A sustained breakout would argue for another leg higher, while a failure to hold key support would signal that expectations may be getting ahead of fundamentals.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMicron Technology, Inc. (MU) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "02:47:13",
      "Source": "24/7 Wall St.",
      "Title": "The 3 Income ETFs I’d Use to Offset Social Security",
      "URL": "https://finance.yahoo.com/m/17c2e586-8e07-3c40-8f1e-0e6aae5bdd7e/the-3-income-etfs-i%E2%80%99d-use-to.html",
      "Content": "The 3 Income ETFs I’d Use to Offset Social Security\n\nGerelyn Terzo\nThu, December 18, 2025 at 10:47 AM PST 5 min read\n\nIn this article: AGG\n\nSCHD\n\nVHYAX\n\nVYM\n\nABBV\n\nKey Points Schwab US Dividend Equity ETF (SCHD) offers a 3.79% dividend yield and holds stocks like AbbVie and Lockheed Martin.\nVanguard High Dividend Yield ETF (VYM) returned 12.6% year-to-date with exposure to JPMorgan and Broadcom.\niShares Core US Aggregate Bond ETF (AGG) yields 3.8% with monthly distributions and tracks investment-grade bonds.\nIf you’re thinking about retiring or know someone who is, there are three quick questions causing many Americans to realize they can retire earlier than expected. take 5 minutes to learn more here\n\nIf you are depending on Social Security for your retirement income, you might want to add reinforcements. While Social Security is tweaked annually in an attempt to keep up with the pace of inflation, its buying power has been dwindling in recent decades while the core inflation rate of 3% continues to hover above the Federal Reserve's elusive 2% target. One strategic way to bolster your retirement income is to add a mix of income ETFs that are the most likely to offset any deficiencies left by Social Security.\nRather than relying on a single stock or even asset class, we've uncovered a trio of income ETFs, including both equity and fixed-income flavors, that are dependable bets to offset any Social Security shortfall. These funds include the Schwab U.S. Dividend Equity ETF ( NYSE Arca: SCHD ), Vanguard High Dividend Yield ETF (NYSE Arca: VYM) and the iShares Core U.S. Aggregate Bond ETF (NYSE: Arca: AGG), delivering a diversified mix of steady performers, high-yield plays and fixed-income stability. Given the uncertainty around the Social Security System, I would turn to these three income ETFs to strengthen my income streams in retirement.\n1.) Schwab U.S. Dividend Equity ETF (SCHD) The Schwab U.S. Dividend Equity ETF (NYSEArca: SCHD) is one to consider in the current market climate. Targeting the returns of the Dow Jones U.S. Dividend 100 Index, SCHD has a high standard for fundamental strength, including cash flow, among members, providing potential capital appreciation to a diversified portfolio in addition to the cash flow stream that dividends generate. With just over 100 stock holdings, SCHD has a trailing dividend yield of 3.84%, surpassing that of the average dividend stock in the S&P 500 at 1.16%.\n\nWith a total expense ratio of 0.060%, SCHD is attractive for its above-3% dividend yield, for a current quarterly payout of $0.2782 per share. By investing in SCHD, you're gaining exposure to leading stocks such as AbbVie ( NYSE: ABBV ), defense giant Lockheed Martin ( NYSE: LMT ), biotechnology stock Amgen ( Nasdaq: AMGN ) as well as pharmaceutical giant Merck ( NYSE: MRK ), consumer staple stock PepsiCo ( NYSE: PEP ), Big Tech company Cisco Systems ( Nasdaq: CSCO ), energy holdings ConocoPhillips ( NYSE: COP ) and Chevron ( NYSE: CVX ), among many others.\n\nStory Continues\nDividends are paid quarterly, giving investors an opportunity to plan and budget for cash flow as needed in retirement or decide to reinvest the dividends for a rainy day. Investors can replace the dependability of a steady paycheck with that of dividend income from stocks that have set the standard as steady payers for years, with some, like PepsiCo, achieving status as a Dividend Aristocrat for paying consistent dividends for at least 25 years.\n\n2.) Vanguard High Dividend Yield ETF (VYM) Next consider the Vanguard High Dividend Yield ETF (VYM) if your risk/reward profile allows for some high-yield drama. The higher the dividend yield, the greater the chance that these payouts could become unsustainable in the future. VYM tracks the FTSE High Dividend Yield Index, pursuing domestic large-cap names, falling on the moderate-to-aggressive side of the risk spectrum. Stocks include JPMorgan ( NYSE: JPM ), Broadcom ( Nasdaq: AVGO ), Exxon Mobil ( NYSE: XOM ), among hundreds of other names.\n\nThis ETF provides investors with grand sector exposure, ranging from financials to consumer staples to tech to energy and beyond, a strategy that that favors established cash generators over passing trends, spreads risk across sectors, and delivers a steadier yield profile than many other options. Distributions can ebb and flow with markets, but VYM’s wider emphasis on value and blue-chip names make it a credible core income path to help supplement Social Security, especially when combined with a cash or short-term bond instrument to buffer any potential rough patches.\nIn addition to dividends, VYM has a proven performance history on the capital appreciation side, generating returns of 12.91% year-to-date, just shy of the 15.71% in the S&P 500 index. There are always trade-offs; value-focused funds can lag when growth stocks lead, and dividend stocks have a tendency to favor financials and energy. Overall, VYM can add steady cash flow and capital appreciation to offset part of Social Security.\n\n3.) iShares Core U.S. Aggregate Bond ETF (AGG) For some fixed income exposure, consider the iShares Core U.S. Aggregate Bond ETF (NYSEArca: AGG). This fund strategy targets wide exposure to U.S. investment-grade bonds, ensuring that your portfolio is filled with credit-worthy instruments. The growth of a hypothetical $10,000 investment into this ETF would surpass $20,000 over the past two decades. With a dividend yield of 3.86% on a trailing 12 month basis, AGG makes distributions monthly, helping you to cover those bills in retirement without having to depend on Social Security.\n\nAGG tracks the Bloomberg U.S. Aggregate Bond Index, holding a wide mix of Treasuries, agency mortgage-backed securities (MBS) and investment-grade corporate bonds. With a low expense ratio of 0.03%, this ETF is somewhat sensitive to interest rates; prices can dip when yields rise and rise when rates fall. AS a result, AGG offers both diversification away from stocks as well as steady monthly income for predictable cash flow when you need it the most.\nThe New Report Shaking Up Retirement Plans You may think retirement is about picking the best stocks or ETFs, but you’d be wrong. Even great investments can be a liability in retirement. It’s a simple difference between accumulating vs distributing, and it makes all the difference.\nThe good news? After answering three quick questions many Americans are reworking their portfolios and finding they can retire earlier than expected. If you’re thinking about retiring or know someone who is, take 5 minutes to learn more here .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "02:02:40",
      "Source": "GuruFocus.com",
      "Title": "Wall Street's AI Darlings Are Cracking--Is the Speculative Boom Running Out of Steam?",
      "URL": "https://finance.yahoo.com/news/wall-streets-ai-darlings-cracking-180240068.html",
      "Content": "Wall Street's AI Darlings Are Cracking--Is the Speculative Boom Running Out of Steam?\n\nKhac Phu Nguyen\nThu, December 18, 2025 at 10:02 AM PST 2 min read\n\nIn this article: AMD\n\nEXPE\n\nEL\n\nIVZ\n\n^GSPC\n\nThis article first appeared on GuruFocus .\nJPMorgan strategists have been flagging a growing risk beneath the surface of US equity markets as volatility picks up: what they describe as extreme crowding in stocks that rallied hard earlier this year. After the S&P 500 fell 1.2% on Wednesday, extending its losing streak to four sessions following a record high, JPMorgan's quantitative team pointed to a rotation out of recent winners, led by technology shares. The strategists said crowding in highly volatile, riskier stocks has reached the 99th percentile, a level they suggested could be vulnerable to a sharper unwind if a significant macro event were to emerge.\n\nWarning! GuruFocus has detected 3 Warning Sign with AVGO.\nIs AVGO fairly valued? Test your thesis with our free DCF calculator.\nBram Kaplan, JPMorgan's head of Americas equity derivatives strategy, highlighted six stocks the bank views as speculative growth plays that could be more sensitive to sudden repricing: Broadcom ( NASDAQ:AVGO ), Advanced Micro Devices ( NASDAQ:AMD ), Expedia Group ( NASDAQ:EXPE ), Estee Lauder ( NYSE:EL ), Invesco ( NYSE:IVZ ) and Nucor ( NYSE:NUE ). Since Dec. 10, Broadcom has fallen more than 21% and AMD is down 11%, while Estee Lauder, Invesco and Nucor are also lower, with Expedia up about 3%. Kaplan described many of these names as second-order speculative AI beneficiaries, noting they could be prone to larger swings because expansion may rely on access to capital or debt markets rather than internal growth alone.\n\nKaplan outlined a potential approach for navigating the environment, suggesting bearish put options on speculative names paired with bullish exposure to lower-volatility stocks such as Cigna ( NYSE:CI ), Pfizer ( NYSE:PFE ) and Verizon Communications ( NYSE:VZ ). There remains the possibility that the recent selloff reflects a temporary rotation rather than a broader shift, a view supported by Micron Technology's ( NASDAQ:MU ) strong earnings that helped lift AI-linked stocks again on Wednesday. Even so, JPMorgan's warning comes as investors increasingly question whether the AI trade can lift all boats, with attention gradually shifting toward sorting potential winners from possible laggards.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "01:50:03",
      "Source": "GuruFocus.com",
      "Title": "Broadcom Stock Is Falling -- UBS Says the Sell-off Went Too Far",
      "URL": "https://finance.yahoo.com/news/broadcom-stock-falling-ubs-says-175003545.html",
      "Content": "Broadcom Stock Is Falling -- UBS Says the Sell-off Went Too Far\n\nNauman Khan\nThu, December 18, 2025 at 9:50 AM PST 1 min read\n\nIn this article: AVGO\n\nThis article first appeared on GuruFocus .\nBroadcom ( NASDAQ:AVGO ) shares fell about 20% over the past five days, even after the chipmaker posted solid fiscal fourth-quarter results, as investors focused on the lack of a full-year artificial intelligence revenue outlook.\nWarning! GuruFocus has detected 3 Warning Sign with AVGO.\nIs AVGO fairly valued? Test your thesis with our free DCF calculator.\n\nThe pullback followed Broadcom's recent earnings report, which showed continued strength in its AI-related semiconductor business. Still, the stock sold off as the market weighed uncertainty around longer-term AI demand visibility.\nAfter meeting with Broadcom's full management team, UBS analyst Timothy Arcuri said recent trading likely reflects an overreaction. He raised his estimates for fiscal 2026, projecting AI semiconductor revenue above $60 billion, nearly triple year-over-year growth.\nArcuri also lifted his fiscal 2027 forecasts, including revenue of $135 billion and earnings per share of $14.15. He pointed to a $73 billion AI backlog covering roughly 18 months, noting that shipments may arrive sooner than initially outlined.\nThe analyst highlighted strong backlog growth tied mainly to large customers such as Alphabet (GOOG) and Meta Platforms (META), with additional upside possible as AI inference demand expands.\nUBS kept a Buy rating on Broadcom and increased its price target to $475.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "01:44:00",
      "Source": "Zacks",
      "Title": "AVGO Stock Drops 20% From 52-Week High: Should You Buy on the Dip?",
      "URL": "https://finance.yahoo.com/news/avgo-stock-drops-20-52-174400579.html",
      "Content": "AVGO Stock Drops 20% From 52-Week High: Should You Buy on the Dip?\n\nAniruddha Ganguly\nThu, December 18, 2025 at 9:44 AM PST 5 min read\n\nIn this article: AVGO\n\nBroadcom AVGO shares closed at $326.02 on Wednesday, down 19.7% from the 52-week high of $414.61, it hit on Dec.10. The decline can be attributed to AVGO’s soft gross margin guidance for fiscal 2026 due to higher AI mix in the revenue as well as higher tax rate due to the impact of global minimum tax and shift in geographic mix of income as compared with fiscal 2025. The first-quarter fiscal 2026 guidance also reflects the negative impact of unfavorable AI mix in revenues, a sequential decline in non-AI semiconductor revenues and modest growth expectations for the Infrastructure Software segment. However, does this dip in AVGO shares offer a buying opportunity? Let’s find out.\n\nAVGO Prospects Ride on Strong AI Revenues AVGO is benefiting from strong demand for XPUs, which are a type of application-specific integrated circuits necessary to train Generative AI models. They require complex integration of compute, memory and I/O capabilities to achieve the necessary performance at lower power consumption and cost. Alphabet GOOGL and Meta Platforms are major users of these XPUs. In fiscal 2025, AI revenues surged 65% to $20 billion from fiscal 2024. Broadcom’s current order backlog for AI switches exceeds $10 billion as AVGO’s latest 102-terabit per second Tomahawk 6 switch continues to gain traction.\n\nBroadcom’s XPUs are gaining traction. In the fourth quarter of fiscal 2025, AI revenues surged 74% year over year to $6.5 billion. XPU adoption accelerated in the reported quarter as enterprises continue to use these to train their large language models (LLMs) and monetize their platforms through inferencing APIs and applications. AVGO’s expanding clientele, which now includes Anthropic, is driving growth. In the third quarter of fiscal 2025, Broadcom received a $10 billion order to sell Alphabet’s latest TPU Ironwood racks to Anthropic. In the fourth quarter of fiscal 2025, Broadcom received an additional order worth $11 billion from the same customer. AVGO now expects first-quarter fiscal 2026 AI revenues to double year over year to $8.2 billion.\n\nIn fact, strong demand for XPUs, an innovative product portfolio, and an expanding partner base have helped Broadcom outperform the broader Zacks Computer and Technology sector as well as peers including NVIDIA NVDA and Marvell Technology MRVL. In the trailing 12 months, AVGO shares have appreciated 49.3%, outperforming the broader sector’s return of 21.2%. While shares of NVIDIA have returned 30.9%, Marvell Technology fell 25.1% in the past year.\n\nAVGO Stock’s Performance\nImage Source: Zacks Investment Research\n\nStory Continues\nStrong Portfolio & Rich Partner Base Drives AVGO’s Top Line Consolidated backlog hit $162 billion in fiscal 2025, including $73 billion in AI backlog set to be delivered over the next 18 months. AVGO’s networking portfolio is gaining from strong demand for Tomahawk 6 products, as well as the Jericho 4 Ethernet fabric router.\n\nAVGO expanded its portfolio with the launch of the industry’s first Wi-Fi 8 silicon solutions for the broadband wireless edge ecosystem, including residential gateways, enterprise access points and smart mobile clients. Tomahawk 6 - Davisson (TH6-Davisson), the company’s third-generation Co-Packaged Optics Ethernet switch, is now being shipped. TH6-Davisson is specifically designed for the accelerating demands of AI networking, as it delivers an unprecedented 102.4 terabits per second of optically enabled switching capacity.\n\nIn August, Broadcom announced the Jericho 4 Ethernet fabric router that has the ability to interconnect more than one million XPUs across multiple data centers. In October, the company announced Thor Ultra, the industry’s first 800G AI Ethernet Network Interface Card, capable of interconnecting hundreds of thousands of XPUs to drive trillion-parameter AI workloads. AVGO also announced the industry’s first Wi-Fi 8 silicon solutions for the broadband wireless edge ecosystem, including residential gateways, enterprise access points and smart mobile clients.\n\nMoreover, Broadcom has a rich partner base that includes the likes of OpenAI, Walmart, NVIDIA, Canonical, Arista Networks, Alphabet, Dell Technologies, Meta Platform, Juniper, Supermicro, among others. AVGO expects first-quarter fiscal 2026 Semiconductor revenues of $12.3 billion, suggesting 50% year-over-year growth. Infrastructure Software revenues are expected to grow 2% year over year to $6.8 billion.\n\nAVGO’s Earnings Estimate Revision Shows Positive Trend The Zacks Consensus Estimate for fiscal 2026 earnings is pegged at $9.88 per share, up 8.1% over the past 30 days, indicating 44.9% growth from fiscal 2025’s reported figure. The consensus mark for fiscal 2026 revenues is currently pegged at $92.51 billion, suggesting 44.8% growth from fiscal 2025’s reported figure.\n\nThe Zacks Consensus Estimate for the first quarter of fiscal 2026 earnings is pegged at $2.01 per share, up six cents over the past 30 days, indicating 25.6% growth from the figure reported in the year-ago quarter. The consensus mark for the first quarter of fiscal 2026 revenues is currently pegged at $19.23 billion, suggesting 29% growth from the figure reported in the year-ago quarter.\n\nBroadcom Inc. Price and Consensus Broadcom Inc. price-consensus-chart | Broadcom Inc. Quote\nAVGO Shares Are Overvalued AVGO stock is trading at a premium, as suggested by the Value Score of D.\n\nIn terms of the forward 12-month price/sales, AVGO is trading at 17.26X, higher than the sector’s 6.37X, NVIDIA’s 14.33X, and Marvell Technology’s 7.12X.\nAVGO’s Valuation\nImage Source: Zacks Investment Research\nConclusion Broadcom’s expanding AI portfolio, along with a rich partner base, reflects solid top-line growth potential. These are good reasons to buy the stock for investors and justifies the premium valuation.\n\nBroadcom currently carries a Zacks Rank #2 (Buy), which implies that investors should start accumulating the stock right now. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nMarvell Technology, Inc. (MRVL) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "01:08:00",
      "Source": "Motley Fool",
      "Title": "The Best Dividend Stocks to Buy and Hold Forever",
      "URL": "https://finance.yahoo.com/m/f2f1f7e2-47df-3e4d-afd9-9f049158cb7a/the-best-dividend-stocks-to.html",
      "Content": "The Best Dividend Stocks to Buy and Hold Forever\n\nRick Munarriz, The Motley Fool\nThu, December 18, 2025 at 9:08 AM PST 5 min read\n\nIn this article: AVGO\n\nUMC\n\nKey Points Broadcom just stretched its streak of annual dividend hikes to 15 years.\nStrong growth and wide margins have made Broadcom a market favorite in recent years.\nUnited Microelectronics is more obscure, but Taiwan's second-largest foundry has a healthy annual dividend yield of 5.7%.\n10 stocks we like better than Broadcom ›\n\nYou don't have to choose between being an income investor and a fan of growth stocks. There are plenty of opportunities to participate in a growing business that also happens to shell out regular cash distributions. You can have the best of both worlds.\nBroadcom (NASDAQ: AVGO) and United Microelectonics (NYSE: UMC) are two attractive dividend payers that also happen to have strong growth prospects. One of the dividend yields is much higher than the other, but the two stocks offer healthy upside with their strong growth prospects. These are two of the best dividend stocks to buy and hold forever.\n1. Broadcom: 0.8% yield Don't let Broadcom's small payout dissuade you. The provider of semiconductor and tech infrastructure solutions may be packing a yield just shy of 1%, but never punish an income stock simply because it has delivered monster capital appreciation along the way.\nBroadcom was yielding more than 5% just seven years ago. Your initial instinct might be to assume that it has cut its distributions along the way, but consider a better reason for the shrinking yield. After all, just last week, Broadcom boosted its dividend by 10%. It has increased its dividend for 15 consecutive years.\n\nBroadcom stock is a seven-bagger over the past five years. The actual quarterly distributions continue to increase, but the yield is lower because the stock is appreciating even faster than the annual hikes.\nBroadcom's run coincides with the boom in artificial intelligence (AI) and other chip-based growth opportunities. It claims that more than 99% of the world's internet traffic crosses through some type of Broadcom technology. With a gargantuan market cap of $1.6 trillion, there are only seven other U.S. exchange-listed stocks with larger market caps. You've heard of the \"Magnificent Seven.\" Meet the one stock that's punching up at the ceiling to crash that penthouse party.\nMomentum is on its side right now. The 44% and 24% revenue growth in its two latest fiscal years represent the two largest jumps that the business has taken in the last eight years. The sweet spot here is that this isn't some low-margin commodity play. Broadcom's trailing net profit margin is a whopping 36%. Yes, 36% of its revenue makes it all the way down to the bottom line. This isn't a fluke. More than a third of its revenue has been served up as net income in three of the past four fiscal years.\n\nStory Continues\n2. United Microelectronics: 5.7% yield If you're looking for a semiconductor stock with a beefier yield, try United Microelectronics. You probably know Taiwan Semiconductor Manufacturing . It's the world's largest semiconductor foundry, accounting for more than two-thirds of the global market. Now consider warming up to Taiwan's second-largest foundry.\n\nUnited Microelectronics will fall short across many measuring sticks when pitted against TSMC. It's not growing as quickly as the market leader. Its net margin is also less than half of TSMC. However, it stands tall on valuation. TSMC trades at a trailing earnings multiple of 24 and pays a reasonable 1.2% yield. United Microelectronics has a P/E ratio of less than 16 with a chunky 5.7% yield. It pays out a single large dividend every summer.\nRevenue growth has been positive in five of the last six years, with double-digit percentage increases in half of those years. United Microelectronics recently reported that sales for the month of November rose 6%, accelerating from its overall pace through the first 10 months of the year. Analysts have been inching their profit targets higher for the current quarter, following a big bottom-line beat in its previous quarter.\n\nChip stocks come in different flavors and with different payouts. If you can find ascending businesses that just happen to cut regular dividend checks, you'll find yourself winning even when the chips are down.\nShould you buy stock in Broadcom right now? Before you buy stock in Broadcom, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Broadcom wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $511,196 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,047,897 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 954 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nRick Munarriz has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nThe Best Dividend Stocks to Buy and Hold Forever was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "01:03:27",
      "Source": "Barchart",
      "Title": "Analysts Say This 1 Lesser-Known Chip Stock Is a Top Buy for 2026. Should You Add It to Your Portfolios Here?",
      "URL": "https://finance.yahoo.com/m/8ff01e32-7045-375d-8604-d4061363484c/analysts-say-this-1.html",
      "Content": "Analysts Say This 1 Lesser-Known Chip Stock Is a Top Buy for 2026. Should You Add It to Your Portfolios Here?\n\nYiannis Zourmpanos\nThu, December 18, 2025 at 9:03 AM PST 4 min read\n\nIn this article: KLAC\n\n$SPX\n\nNVDA\n\nAVGO\n\nKLA Corporation (KLAC) is in the limelight yet again after Jefferies identified the chip equipment supplier as one of the top picks in the chip space for the year 2026, alongside industry stalwarts Nvidia (NVDA) and Broadcom (AVGO). This recommendation comes at a juncture where investor interest is rotating away from those with cyclical demand in the chip industry towards those with sustainable demand in AI infrastructure development.\n\nKLAC stock's movement has been positive, breaking past the $1,220 level and rising close to the upper part of the 52-week range. Although the majority of the story regarding AI innovation surrounds GPUs and custom silicon, analysts are pointing to the not-so-visible but crucial firms propelling the innovation of chips. KLA Corporation fits the bill nearly to perfection.\nMore News from Barchart Cathie Wood Keeps Buying the Dip in CoreWeave Stock. Should You?\nIs Cathie Wood Jumping Ship on Tesla Stock?\nBroadcom Stock Is Up 120% in the Past Year. This Analyst Thinks It Is One of the Highest-Quality Stocks to Buy for the Next Year Too.\nOur exclusive Barchart Brief newsletter is your FREE midday guide to what's moving stocks, sectors, and investor sentiment - delivered right when you need the info most. Subscribe today!\n\nThere are also broader trends that work to its favor. The semiconductor sector has been quite volatile over the last six months, but it appears that spending on AI, logic, memory, and packaging has been quite strong. Such a scenario would generally favor companies that offer mission-critical equipment over those that are product-cycle driven.\nAbout KLAC Stock KLA Corporation (KLAC) is a major supplier of process control solutions, inspection solutions, and yield management solutions to the semiconductor industry. They cater to foundries, logic chipmakers, those involved in DRAM and other memory products, and advanced packaging customers globally. As a company headquartered in Milpitas, in the state of California, KLA has a market capitalization in excess of $150 billion, making it a major part of the industry.\nKLAC stock has made a phenomenal performance over the last year. It is up substantially from a 52-week low of $550 and has been trading above $1,220 recently, although a bit short of the 52-week high of $1,284. This is substantially better than the performance of the S&P 500 Index ($SPX).\nValuation-wise, KLA is seen to be at around 35 times trailing earnings, with a multiple of around 34.6 times its forward earnings. Although it does seem a mite expensive in relation to its broader market, it is certainly much more justifiable from a profitability perspective. Its operating margins remain in excess of 30 percent, its return on equity in excess of 100 percent, and its free cash flows are quite robust. Additionally, its price/sales ratio of 13.2 times and price/cash flow ratio of around 32 times indicate that it does command a quality premium.\n\nStory Continues\nThe company is a dividend payer; however, it is not a dividend-focused company.\nKLA Beats on Earnings as AI Complexity Fuels Demand KLA's most recent update on financial performance came in with the first quarter of fiscal 2026, which ended on Sept. 30, and was a resounding positive on all major counts. The company recorded revenue of $3.21 billion, which is above the range that management guided for. Additionally, both GAAP and non-GAAP EPS figures came in at $8.47 and $8.81, respectively.\n\nThe generation of cash remained one of the areas that shone brightest. The company generated operating cash flow of $1.16 billion for the quarter and $4.25 billion for the past twelve months. However, the company generated free cash flow of $1.07 billion for the quarter and $3.88 billion on a trailing basis. The company distributed capital returns amounting to almost $800 million for the quarter and over $3.0 billion for the year.\nThe fact is that the building out of the AI infrastructure differs structurally from the other semiconductor cycles. This is because the increased complexity of advanced AI chips is directly driving the demand for the inspection and process control solutions offered by the likes of KLA, as explained by the company’s CEO, Rick Wallace.\n\nKLA has also expressed no near-term pressure on demand, and the tone of its comments suggests confidence in its relative revenue growth compared to the semiconductor equipment market for calendar 2025.\nWhat Do Analysts Expect for KLAC Stock? The overall Wall Street sentiment for KLAC stock has been positive. The inclusion of KLA in the list of companies by Jefferies, along with companies like Nvidia and Broadcom, supports the idea that KLAC provides leveraged exposure to AI, independent of end-market demand. KLAC has a “Moderate Buy” rating consensus, and the mean price target of the company is $1,295.17. Using the current price of approximately $1,220 found on the street, the mean price target would provide potential upside of around 6%. The street high price target is provided at $1,500 compared to the lowest target of $870.\nOn the date of publication, Yiannis Zourmpanos did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "00:45:23",
      "Source": "GuruFocus.com",
      "Title": "NVDA: Nvidia Stock Jumps as Micron Earnings Ease AI Investment Fears",
      "URL": "https://finance.yahoo.com/news/why-nvidia-stock-rising-today-160826749.html",
      "Content": "NVDA: Nvidia Stock Jumps as Micron Earnings Ease AI Investment Fears\n\nNauman Khan\nThu, December 18, 2025 at 8:45 AM PST 1 min read\n\nIn this article: NVDA\n\nMU\n\nAVGO\n\nAMD\n\nThis article first appeared on GuruFocus .\nNvidia ( NASDAQ:NVDA ) edged up more than 3% on Thursday morning as strong earnings from memory-chip maker Micron ( NASDAQ:MU ) eased investor worries about a slowdown in AI spending.\nOther chip stocks also saw gains. Advanced Micro Devices (AMD) climbed about 2%, while Broadcom ( NASDAQ:AVGO ) rose roughly 1% ahead of the opening bell. Analysts noted that robust data-center demand for high-performance memory is supporting continued AI hardware purchases.\n\nWarning! GuruFocus has detected 9 Warning Sign with MU.\nIs MU fairly valued? Test your thesis with our free DCF calculator.\nMicron's report highlighted rising sales in high-capacity memory, helping to stabilize stocks that had been pressured by doubts over the AI investment cycle. The industry supply remains short of demand for the foreseeable future, said Micron CEO Sanjay Mehrotra.\nAdding to the optimism, a private cloud operator said it would deploy more than 2,300 Nvidia Blackwell GPUs in California, marking the first phase of a $6 billion North American expansion plan.\nInvestors caution that supply constraints for AI-specific chips and funding uncertainties remain, but Thursday's moves suggest AI hardware momentum remains intact.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "00:26:19",
      "Source": "Barchart",
      "Title": "Forget Nvidia and Broadcom. This Forgotten Retail Stock Is a Top Performer in 2025.",
      "URL": "https://finance.yahoo.com/m/369e06ea-cf9a-3ee1-9d87-ba9012725882/forget-nvidia-and-broadcom..html",
      "Content": "Forget Nvidia and Broadcom. This Forgotten Retail Stock Is a Top Performer in 2025.\n\nPathikrit Bose\nThu, December 18, 2025 at 8:26 AM PST 5 min read\n\nIn this article: DDS\n\nAMD\n\nNVDA\n\nAVGO\n\nArtificial intelligence has been the theme on Wall Street for more than three years now. Headlined by the likes of Nvidia (NVDA), AMD (AMD), and Broadcom (AVGO), chipmakers have been the undisputed winners, and their share price actions reflect the same. On the other hand, as inflation continues to hover around the 3% level, above the Fed's comfort rate of 2%, one would not expect stocks from the retail sector to outperform these AI juggernauts. However, that is precisely what Dillard's (DDS) has done over the past five years.\n\nAbout Dillard's Founded in 1938 and based out of Arkansas, Dillard's operates full-line department stores and clearance centers across the U.S., primarily in the Southeast, Southwest, West, and Midwest. Other than retail operations, the company is also engaged in providing construction services. It operates approximately 272 full-line department stores plus around 28 clearance centers across 30 U.S. states and over 140 cities as of late 2025.\n\nMore News from Barchart Cathie Wood Keeps Buying the Dip in CoreWeave Stock. Should You?\nIs Cathie Wood Jumping Ship on Tesla Stock?\nBroadcom Stock Is Up 120% in the Past Year. This Analyst Thinks It Is One of the Highest-Quality Stocks to Buy for the Next Year Too.\nGet exclusive insights with the FREE Barchart Brief newsletter. Subscribe now for quick, incisive midday market analysis you won't find anywhere else.\n\nValued at a market cap of $10.2 billion, the DDS stock is up 54% on a year-to-date (YTD) basis, outperforming the likes of Broadcom, AMD, and Microsoft (MSFT). Notably, the stock offers a dividend yield of 4.76%, which is higher than the sector median of 1.023%. Further, the company has been raising dividends consecutively over the past 14 years, and with a payout ratio of just 2.87%, the headroom for growth remains.\nBut is that enough to warrant an investment? Let's analyze.\nAll Good (Except Sales Growth) Dillard's, despite its share price pop, is not for the growth enthusiasts. While its earnings have grown at a CAGR of 6.28% over the past 10 years, revenues have actually declined at a CAGR of 0.28% in the same period. Modest revenue growth was reported in the most recent quarter as well.\nIn Q3 2025, Dillard's net sales were $1.47 billion, up a mere 2.8% from the previous year. Comparable store sales, a key indicator of organic store sales, inched up by just 3% in the same period. Further, gross margins improved to 45.3% in the quarter, an increase from the previous year's figure of 44.5%, implying effective control over direct costs.\n\nLeer más\nOverall, earnings for the quarter were reported to be $8.31 per share, a YoY rise of 7.5%. Notably, the EPS also came in higher than the consensus estimate of $6.18, as the past two years have seen the company's earnings miss estimates on just one occasion.\nComing to cash flows, for the nine months ended Nov. 1, Dillard's reported net cash from operating activities of $505.8 million, up from $349.4 million in the year-ago period. Overall, the company closed the quarter with a cash balance of $1.15 billion, much higher than its short-term debt levels of $96 million.\n\nFinally, aside from its record of shelling out regular dividends, Dillard's has rewarded shareholders through share repurchases. While during the quarter, the company repurchased shares worth $107.8 million, the past decade has seen the company carrying out share buybacks worth more than $3 billion.\nThus, a slowdown in sales growth cannot be squarely blamed on the company's operations, as the wider retail sector has been subdued for a while now. Structural headwinds such as mall traffic decline and the emergence of e-commerce over the years have played a significant role. Considering this, Dillard's showing has been commendable, as it has done what it can in this scenario: controlling costs, raising margins, keeping debt under control, and increasing earnings with an effective cash management strategy.\n\nCan the Good Times Continue to Roll? Now, Dillard's needs just one thing: sales growth. That will ensure that the company's upmove was not just based on effective balance sheet management but is built upon solid, sustainable growth. To that end, the company is taking some initiatives.\nFirst up, Dillard's has been putting more effort into freshening up its stock lately, bringing in clothes and accessories that feel current and on-trend, particularly on the men's side. This is to bring in younger shoppers and get the regulars to stop by more often. That's shown up in better sales numbers of late. The categories doing the heavy lifting are the ones with stronger margins and real pull, like women's clothing, handbags, shoes, and makeup.\n\nConversely, while the stores are still the main game for Dillard's, the company is spending serious cash on the website too. They're building out the online shopping experience and making it work hand-in-hand with what's in the stores, so customers don't feel any drop-off. It's beginning to click, with online sales expected to surpass $400 million for 2025. Stuff like ordering online and grabbing in-store, nicer product pages, and a wider catalog of items online are helping drive that.\nFinally, Dillard's uses targeted promotions and marketing to attract both value-conscious and brand-focused shoppers. Promotions are tailored to drive both traffic and conversion, emphasizing value without eroding margin.\nHowever, it's not all smooth sailing. Inflation is still biting, and the job picture is getting shakier, so shoppers are tightening their purse strings in ways Dillard's can't fully fix. And being smaller in scale than the giants means it's tougher to match them on price; Amazon (AMZN) and Walmart (WMT), the behemoths in the space, have much more financial muscle to pull customers to their aisles.\n\nThe shares are priced for a lot of good news already too, trading at a forward P/E of 20.06 and P/B of 5.81. Both stats are quite a bit above the sector averages of 17.66 and 2.70, which doesn't leave much buffer if the spending environment cools further.\nAnalyst Opinion on DDS Stock Taking all of this into account, analysts have deemed DDS stock a “Hold,” with a mean target price that has already been surpassed. The high target price of $700 denotes an upside potential of about 6% from current levels. Out of five analysts covering the stock, one has a “Strong Buy” rating, two have a “Hold” rating, and two have a “Strong Sell” rating.\nOn the date of publication, Pathikrit Bose did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nCondiciones y Política de privacidad\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "00:17:29",
      "Source": "Simply Wall St.",
      "Title": "Zeta Global Holdings (ZETA): Evaluating Valuation After AI-Driven Tech Sell-Off Triggered by Broadcom Warning",
      "URL": "https://finance.yahoo.com/news/zeta-global-holdings-zeta-evaluating-161729128.html",
      "Content": "Zeta Global Holdings (ZETA): Evaluating Valuation After AI-Driven Tech Sell-Off Triggered by Broadcom Warning\n\nSimply Wall St\nThu, December 18, 2025 at 8:17 AM PST 2 min read\n\nIn this article: ZETA\n\nAVGO\n\nTech stocks tied closely to artificial intelligence came under pressure after Broadcom flagged thinner margins on AI systems, and Zeta Global Holdings (ZETA) was pulled into that downdraft as investors rotated toward safer names.\nSee our latest analysis for Zeta Global Holdings.\nEven after this latest pullback, with the share price at $17.39 following a 1 day share price return of minus 4.13 percent and a 7 day share price return of minus 10.87 percent, Zeta’s longer term story still looks constructive given its 3 year total shareholder return of about 104 percent. This suggests momentum has cooled in the near term but has not broken the broader growth narrative.\n\nIf you are weighing how this AI marketing name fits in your portfolio, it is worth also scanning high growth tech and AI stocks to spot other potential winners and compare how the market is pricing their growth and risk.\nWith Zeta still trading at a steep discount to Wall Street targets despite strong multi year returns and rapid top line growth, should investors view this pullback as a fresh entry point, or assume the market is already pricing in its AI upside?\nMost Popular Narrative: 41.4% Undervalued With Zeta Global Holdings last closing at $17.39 versus a most popular narrative fair value near $29.67, the spread points to significant upside if the thesis holds.\nRead the complete narrative.\nCurious what kind of revenue climb, margin lift, and earnings power would justify that kind of valuation gap? The narrative leans on bold, long duration financial upgrades and a richer profit profile than the market is currently pricing.\nResult: Fair Value of $29.67 (UNDERVALUED)\n\nHave a read of the narrative in full and understand what's behind the forecasts.\nHowever, stricter privacy regulation and intensifying competition from larger AI marketing platforms could pressure Zeta’s growth, margins, and the lofty valuation implied by bullish forecasts.\nFind out about the key risks to this Zeta Global Holdings narrative.\nBuild Your Own Zeta Global Holdings Narrative If you see the outlook differently or want to dig into the numbers yourself, you can build a personalized view in just minutes with Do it your way .\nA good starting point is our analysis highlighting 4 key rewards investors are optimistic about regarding Zeta Global Holdings.\n\nStory Continues\nLooking for more investment ideas? Before you move on, set yourself up for the next opportunity by scanning fresh ideas on Simply Wall Street that match different risk and growth profiles.\nCapture potential multi baggers early by reviewing these 3640 penny stocks with strong financials where smaller companies already show resilient fundamentals.\nPosition ahead of the next wave of innovation by focusing on these 26 AI penny stocks that pair strong AI exposure with solid underlying businesses.\nStrengthen your portfolio’s value core through these 908 undervalued stocks based on cash flows that appear attractively priced relative to their future cash flows.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include ZETA .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:23:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Gains. The AI Trade Is Back, at Least for One Day.",
      "URL": "https://finance.yahoo.com/m/dd15d960-3cb7-3ea9-9f43-5c45141aa288/nvidia-stock-gains.-the-ai.html",
      "Content": "Nvidia Stock Gains. The AI Trade Is Back, at Least for One Day.\n\nAdam Clark\nThu, December 18, 2025 at 7:23 AM PST 2 min read\n\nIn this article: NVDA\n\nMU\n\nORCL\n\nAVGO\n\nAMD\n\nNvidia stock was gaining Thursday as earnings from Micron Technology reassured the market about artificial-intelligence investment.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:22:00",
      "Source": "Barrons.com",
      "Title": "Micron Earnings Are Best in Chip History After Nvidia. The AI Trade Is Back.",
      "URL": "https://finance.yahoo.com/m/2426dfcf-19b7-35a0-8d6e-a27309a08566/micron-earnings-are-best-in.html",
      "Content": "Micron Earnings Are Best in Chip History After Nvidia. The AI Trade Is Back.\n\nTae Kim\nThu, December 18, 2025 at 7:22 AM PST 2 min read\n\nIn this article: MU\n\nAVGO\n\nAMD\n\nNVDA\n\nMicron Technology stock surged Thursday, the day after the memory chip maker reported better-than-expected earnings results and gave guidance that was significantly higher than expectations. For the current quarter, Micron forecast a revenue range with a midpoint of $18.7 billion, above analysts’ expectations of $14.3 billion. “Outside of NVIDIA this was likely the best revenue/$ net income upside in the history of the U.S. semis industry,” Morgan Stanley analyst Joseph Moore wrote in a note to clients Thursday.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:08:25",
      "Source": "GuruFocus.com",
      "Title": "Top Semiconductor Stocks for 2026 -- Nvidia and Broadcom Lead Chip Picks",
      "URL": "https://finance.yahoo.com/news/top-semiconductor-stocks-2026-wall-120207279.html",
      "Content": "Top Semiconductor Stocks for 2026 -- Nvidia and Broadcom Lead Chip Picks\n\nNauman Khan\nThu, December 18, 2025 at 7:08 AM PST 1 min read\n\nIn this article: AVGO\n\nNVDA\n\nALAB\n\nMU\n\nAMD\n\nThis article first appeared on GuruFocus .\nMorgan Stanley named Nvidia ( NASDAQ:NVDA ), Broadcom ( NASDAQ:AVGO ) and Astera Labs ( NASDAQ:ALAB ) as its top semiconductor picks for 2026, pointing to strong AI-driven demand in data center chips, according to a recent research note.\nThe firm highlighted Nvidia and Broadcom as its preferred processor names. Analysts said Nvidia could deliver the highest returns in cloud computing as Vera Rubin deployments ramp in the second half of 2026. Broadcom remains central to AI infrastructure, despite potential bottlenecks in ASIC growth.\n\nWarning! GuruFocus has detected 4 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nAstera Labs emerged as the standout small-cap pick for data center opportunities. Morgan Stanley kept Equal-Weight ratings on AMD ( NASDAQ:AMD ) and Marvell ( NASDAQ:MRVL ), noting room for upside but also some uncertainties. Intel ( NASDAQ:INTC ) drew a cautious view due to challenges in its foundry operations.\nIn memory and chip equipment, Micron ( NASDAQ:MU ) leads the way, with Sandisk ( NASDAQ:SNDK ) also rated Overweight. Applied Materials (AMAT) and Taiwan Semiconductor ( NYSE:TSM ) are favored in equipment, while NXP Semiconductors (NXPI) balances growth and value. Analog Devices (ADI) shows growth potential, though at a higher price point.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:07:34",
      "Source": "24/7 Wall St.",
      "Title": "Premarket Movers: Micron is Rocketing $31 Higher",
      "URL": "https://finance.yahoo.com/m/f7280146-bd4e-3929-947e-59021b24f16e/premarket-movers%3A-micron-is.html",
      "Content": "Premarket Movers: Micron is Rocketing $31 Higher\n\nIan Cooper\nThu, December 18, 2025 at 7:07 AM PST 4 min read\n\nIn this article: MU\n\nAVGO\n\nAMD\n\nQuick Read Micron is surging thanks to strong earnings. EPS of $4.78 beat by 82 cents. Revenue of $13.64 billion beat by $760 million.\nWith an overweight rating on AVGO, Morgan Stanley has a $462 price target on AVGO.\nShares of Advanced Micro Devices are up about 3%, or by $6 a share in premarket. Analysts at Piper Sandler have an overweight rating on the stock.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:58:20",
      "Source": "AFP",
      "Title": "Stocks rise as US inflation cools, tech stocks bounce",
      "URL": "https://finance.yahoo.com/news/asian-markets-track-wall-st-025351925.html",
      "Content": "Stocks rise as US inflation cools, tech stocks bounce\n\nAFP\nThu, December 18, 2025 at 6:58 AM PST 4 min read\n\nIn this article: ^IXIC\n\nAVGO\n\nORCL\n\nEquity markets climbed on Thursday as investors welcomed cool US inflation data and tech stocks bounced.\nUS consumer inflation slowed unexpectedly in November, climbing 2.7 percent from a year ago, coming considerably in below analysts' predictions of a 3.1 percent uptick.\n\"Although this is just one inflation reading -- and admittedly not the Fed's preferred inflation gauge -- easing inflation concerns could open the door to a more accommodative Fed moving forward,\" said eToro analyst Bret Kenwell.\n\n\"That has markets rallying this morning.\"\nWall Street's three main indices pushed higher as trading got underway in New York.\nMeanwhile, shares in Oracle rose 2.9 percent.\nShares in the cloud computing giant plunged more than five percent Wednesday, dragging down other tech stocks and the Nasdaq index, on reports an investor pulling out put its data centre project at risk.\nThat report came after Oracle and chip giant Broadcom last week unveiled disappointing earnings reports.\nShares in Google-parent Alphabet and Broadcom both gained 1.4 percent.\n\"The sector got a boost from a strong set of quarterly results from Micron Technology after last night's close\" and its \"bullish forward guidance\", said Trade Nation analyst David Morrison.\n\nShares in the company which produces computer memory and storage jumped more than 15 percent at the start of trading.\n\"The question now is if today's bounce is a dip-buying opportunity which morphs into a 'Santa Rally', or if it is simply a round of short-covering ahead of another lurch lower\" said Morrison.\nHopes for an end-of-year rally, often called a Santa Rally, have been dealt a blow after the US Federal Reserve last week hinted that it could pause its rate cuts next month.\nQuestions about whether all the cash being pumped into AI is creating a bubble have also acted as a dampener on sentiment.\nThe Bank of England, as expected, cut its key interest rate to 3.75 percent after UK inflation eased faster than expected and as the economy weakened.\n\nHowever the pound rose as policymakers indicated that although rates would continue to decline in 2026, the pace would be dependent upon data.\nThat sent the London's FTSE 100 stock index lower for a period in afternoon trading.\nThe ECB held rates steady, also as expected, while it raised growth forecasts for this year and next.\nIt was the fourth meeting in a row where the ECB held rates steady following a year-long series of cuts.\n\"The new macroeconomic projections suggest there is little scope for further easing in the short term,\" said GianLuigi Mandruzzato, senior economist at EFG Asset Management.\n\nStory Continues\nECB chief Christine Lagarde indicated that \"all optionalities should be on the table\" regarding future interest rate decisions, citing high global \"uncertainty\".\nBoth Frankfurt and Paris stocks were higher in afternoon training.\nAsian stock markets mostly sank Thursday after Wednesday's sell-off on Wall Street as worries over the tech sector's colossal spending on artificial intelligence continued to dog investor sentiment.\n\n- Key figures at around 1430 GMT -\nNew York - Dow: UP 0.7 percent at 48,205.89 points\nNew York - S&P 500: UP 1.0 percent at 6,785.30\nNew York - Nasdaq Composite: UP 1.4 percent at 23,009.66\nLondon - FTSE 100: UP less than 0.1 percent at 9,782.22\nParis - CAC 40: UP 0.5 percent at 8,122.36\nFrankfurt - DAX: UP 0.6 percent at 24,094.18\nTokyo - Nikkei 225: DOWN 1.0 percent at 49,001.50 (close)\nHong Kong - Hang Seng Index: DOWN 0.1 percent at 25,447.44 (close)\nShanghai - Composite: UP 0.2 percent at 3,876.37 (close)\nEuro/dollar: DOWN at $1.1727 from $1.1743 on Wednesday\nPound/dollar: UP at $1.3418 from $1.3379\nDollar/yen: DOWN at 155.38 yen from 155.70\nEuro/pound: DOWN at 87.48 pence from 87.77\nBrent North Sea Crude: UP 0.6 percent at $60.03 per barrel\nWest Texas Intermediate: UP 0.7 percent at $56.22 per barrel\nburs-rl/jj\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:35:06",
      "Source": "Yahoo Finance",
      "Title": "Stock market today: Dow, S&P 500, Nasdaq rise as CPI inflation eases in November, Micron boosts tech",
      "URL": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-rise-as-cpi-inflation-eases-in-november-micron-boosts-tech-143506528.html",
      "Content": "LIVE\n\nStock market today: Dow, S&P 500, Nasdaq rise as CPI inflation eases in November, Micron boosts tech\n\nKaren Friar and Brett LoGiurato\nUpdated Thu, December 18, 2025 at 6:35 AM PST 2 min read\n\nIn this article: MU\n\n^DJI\n\nGOOG\n\n^IXIC\n\nNVDA\n\nUS stocks rose on Thursday, eyeing a recovery from Wall Street's tech-fueled sell-off, as investors digested the easing inflation pressures from the latest reading on consumer prices that could help set expectations for the path of interest rates.\nThe tech-heavy Nasdaq Composite ( ^IXIC ) led the way up with a gain of 1.5%, pushed north by a strong earnings report from Micron ( MU ) after AI trade worries spurred another bruising session for tech on Wednesday. Shares in the benchmark S&P 500 ( ^GSPC ) and the blue chip-heavy Dow Jones Industrial Average ( ^DJI ) rose around 1% and 0.7%, respectively.\n\nHeadlining the morning was a cooler-than-expected Consumer Price Index (CPI) report, which showed inflation rose 2.7% in November over the prior year and 2.6% on a \"core\" basis — both figures coming in below economist estimates of 3% and 3.1%, respectively.\nAs with Tuesday's monthly jobs report , economists have noted that the inflation data may be less reliable than normal thanks to the US government shutdown. At the same time, the Federal Reserve seems more attentive to cracks in the labor market than to price pressures. On Wednesday, Fed governor Chris Waller signaled support for rate cuts before the release of the CPI update.",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:46:43",
      "Source": "Barchart",
      "Title": "As Nvidia Launches New Nemotron 3 Models, Should You Buy, Sell, or Hold NVDA Stock?",
      "URL": "https://finance.yahoo.com/m/76790768-2610-396d-9558-070a9ee4e9b1/as-nvidia-launches-new.html",
      "Content": "As Nvidia Launches New Nemotron 3 Models, Should You Buy, Sell, or Hold NVDA Stock?\n\nEbube Jones\nThu, December 18, 2025 at 5:46 AM PST 5 min read\n\nIn this article: NVDA\n\nGOOG\n\nAMD\n\nAVGO\n\nAMZN\n\nOn Dec. 15, Nvidia (NVDA) announced the launch of its Nemotron 3 family of open models, built to support transparent, efficient, and specialized agentic artificial intelligence (AI) development across industries.\nThe Nemotron 3 Nano model delivers four times the throughput of the Nemotron 2 Nano, making it a more compute-cost-efficient open model for practical work, such as software debugging, content summarization, and AI assistant tasks.\n\nMore News from Barchart Cathie Wood Keeps Buying the Dip in CoreWeave Stock. Should You?\nBroadcom Stock Is Up 120% in the Past Year. This Analyst Thinks It Is One of the Highest-Quality Stocks to Buy for the Next Year Too.\nJPMorgan Says the Dip in Broadcom Stock Is a Screaming Buy. Are You Loading Up on Shares Now?\nGet exclusive insights with the FREE Barchart Brief newsletter. Subscribe now for quick, incisive midday market analysis you won't find anywhere else.\n\nThis launch comes at a tricky moment for the stock. Nvidia is currently valued at a market capitalization of approximately $4.15 trillion, but shares have also fallen more than 17% from recent highs. That pullback shows investors are still debating how long hyper-scalers can continue heavy spending on AI, especially with growing competition from chipmakers, like Advanced Micro Devices (AMD) and Broadcom (AVGO), and the push by Amazon (AMZN) and Alphabet (GOOG) (GOOGL) to build more custom chips in-house.\nAt the same time, Nemotron 3 points to Nvidia’s continued move into agentic AI, and early adopters already include ServiceNow (NOW), Palantir (PLTR), Perplexity, and Oracle Cloud Infrastructure. So for investors, the question is simple: Does Nemotron 3 strengthen Nvidia’s moat enough to support buying at current valuations? Or do valuation pressures and the macro risks justify a more cautious stance? Let’s find out.\n\nNvidia’s Financial Pulse in 2025 Nvidia is an AI infrastructure company. It sells high-performance graphics processing units (GPUs) and closely integrated software that customers use to train and run AI in data centers, while also serving gaming and professional visualization markets on the side.\nOver the past 52 weeks, the stock is up about 40%, so the bigger trend remains positive, although sentiment has cooled. Over the past month, shares have declined by about 8%, which appears more like a normal reset after a strong run than a sign that the story has fallen apart.\nThe valuation indicates that investors are willing to pay a premium. NVDA’s forward price-to-earnings (P/E) ratio is 40x versus the sector’s 24.34x, which means the market is pricing in faster growth and stronger long-term earnings power than the average stock in the group.\n\nStory Continues\nIncome is still a small part of the picture. Nvidia’s annual dividend yield is 0.02%, well below the average technology yield of 1.37%.\nWhat really supports Nvidia's case is financial performance. For Q3, Nvidia reported record revenue of $57 billion, up 22% quarter-over-quarter and 62% year-over-year. That growth was driven by record data center revenue of $51.2 billion. Gross margins stayed high at 73.4% GAAP and 73.6% non-GAAP, and earnings per share (EPS) came in at $1.30 on both GAAP and non-GAAP results. During the first nine months of fiscal 2026, Nvidia returned $37 billion through buybacks and dividends, and it still had $62.2 billion authorized for repurchases, which continues to support shareholder returns.\n\nThe Growth Engines Driving Nvidia’s AI Empire Nvidia’s newly expanded collaboration with Synopsys (SNPS) is a direct move into the design and engineering work that sits behind many major industries. By combining Nvidia’s AI and accelerated computing with Synopsys’s market-leading data analysis tools, the goal is to help research and development teams design, simulate, and verify complex intelligent systems faster, with lower costs, and under tighter time-to-market pressure.\n\nNvidia also backed this partnership financially, investing $2 billion in Synopsys common stock at $414.79 per share, which underlies its seriousness about AI becoming part of core engineering workflows.\nIn addition, Nvidia’s tie-up with HUMAIN, a PIF-backed full-stack AI firm, is focused on scaling real infrastructure and supporting sovereign computers. HUMAIN plans to deploy up to 600,000 Nvidia GB300 platforms over the next three years and will use Nemotron open models to train its own HUMAIN Chat models.\nThe partnership also includes the building of Nvidia-powered data centers in Saudi Arabia and expanding to AI data centers in the United States, which broadens Nvidia’s reach as agentic AI moves from testing to wider rollout across regions.\n\nMeanwhile, Nvidia’s collaboration with Upwind focuses on securing AI workloads where they run. Upwind is bringing its runtime-first cloud security platform onto Nvidia’s AI compute and inference stack, using Nvidia NIM microservices to boost its own AI-driven security operations while also adding dedicated protection for Nvidia GPU-based infrastructure, like DGX and Blackwell.\nWhat Analysts See Ahead for NVDA Stock For the fourth quarter of fiscal 2026, the company expects revenue of about $65 billion. Earnings expectations are strong, too. The average EPS estimate is $1.44 versus $0.85 a year ago, and the next quarter is projected at $1.51 versus $0.77, which suggests year-over-year growth of 69.41% and 96.10%, respectively.\n\nThose numbers help explain why several major firms remain upbeat. Morgan Stanley analyst Joe Moore recently raised his price target to $250, citing Nvidia’s visibility into roughly $500 billion of data center infrastructure revenue between 2025 and 2026 as companies continue building out AI and agentic AI capacity. Loop Capital is even more aggressive with a Street-high $350 target, which would imply a market cap of about $8.5 trillion.\nNot everyone is on board, though. Seaport Research analyst Jay Goldberg has a “Sell” rating on NVDA, pointing to what he calls potential “circular financing” risks in the AI ecosystem.\nEven with that pushback, among 48 analysts, the consensus rating for Nvidia is a “Strong Buy,” and the average price target of $252.67 implies roughly 43.33% upside from the current price.\nIn Conclusion In my opinion, Nvidia looks like a “Hold” with a buy-on-the-dip bias, because Nemotron 3 strengthens Nvidia’s position in agentic AI while the company is still putting up elite revenue growth, margins, and shareholder returns. The stock’s recent pullback suggests the market is wrestling with valuation and fears regarding the spending cycle, not a breakdown in execution. If guidance stays on track and the next couple of earnings prints confirm the demand curve, shares are more likely to grind higher than roll over, even if the ride stays volatile. A clean break is highly likely to need another upside surprise or clearer visibility into 2026 demand.\nOn the date of publication, Ebube Jones did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:02:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Pops. This Helped Shake Off the AI Fear.",
      "URL": "https://finance.yahoo.com/m/dd15d960-3cb7-3ea9-9f43-5c45141aa288/nvidia-stock-pops.-this.html",
      "Content": "Nvidia Stock Pops. This Helped Shake Off the AI Fear.\n\nAdam Clark\nThu, December 18, 2025 at 5:02 AM PST 2 min read\n\nIn this article: MU\n\nNVDA\n\nAMD\n\nAVGO\n\nORCL\n\nNvidia stock was gaining Thursday as earnings from Micron Technology reassured the market about artificial-intelligence investment.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:07:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Rises. This Helped Shake Off the AI Fear.",
      "URL": "https://finance.yahoo.com/m/dd15d960-3cb7-3ea9-9f43-5c45141aa288/nvidia-stock-rises.-this.html",
      "Content": "Nvidia Stock Rises. This Helped Shake Off the AI Fear.\n\nAdam Clark\nThu, December 18, 2025 at 4:07 AM PST 1 min read\n\nIn this article: NVDA\n\nAVGO\n\nAMD\n\nMU\n\nORCL\n\nNvidia stock was gaining Thursday as earnings from Micron Technology reassured the market about artificial-intelligence investment.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:05:39",
      "Source": "Investor's Business Daily",
      "Title": "Dow Jones Futures Rise; Micron Jumps On Earnings After Oracle Leads AI Stock Sell-Off",
      "URL": "https://finance.yahoo.com/m/ff75ab41-f2d5-3639-a63d-2124f5fc841b/dow-jones-futures-rise%3B.html",
      "Content": "Dow Jones Futures Rise; Micron Jumps On Earnings After Oracle Leads AI Stock Sell-Off\n\nED CARSON\nThu, December 18, 2025 at 4:05 AM PST 5 min read\n\nIn this article: ^DJI\n\nMU\n\nORCL\n\nGEV\n\nNVDA\n\nOracle and AI stocks drove damaging market losses Wednesday. Micron jumped late on strong earnings and blowout guidance.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:02:07",
      "Source": "GuruFocus.com",
      "Title": "Top Semiconductor Stocks for 2026 --  Wall Street's 10 Picks To Watch",
      "URL": "https://finance.yahoo.com/news/top-semiconductor-stocks-2026-wall-120207279.html",
      "Content": "Top Semiconductor Stocks for 2026 -- Wall Street's 10 Picks To Watch\n\nNauman Khan\nThu, December 18, 2025 at 4:02 AM PST 1 min read\n\nIn this article: AVGO\n\nALAB\n\nNVDA\n\nMU\n\nINTC\n\nThis article first appeared on GuruFocus .\nMorgan Stanley named Nvidia ( NASDAQ:NVDA ), Broadcom ( NASDAQ:AVGO ) and Astera Labs ( NASDAQ:ALAB ) as its top semiconductor picks for 2026, pointing to strong AI-driven demand in data center chips, according to a recent research note.\nThe firm highlighted Nvidia and Broadcom as its preferred processor names. Analysts said Nvidia could deliver the highest returns in cloud computing as Vera Rubin deployments ramp in the second half of 2026. Broadcom remains central to AI infrastructure, despite potential bottlenecks in ASIC growth.\n\nWarning! GuruFocus has detected 4 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nAstera Labs emerged as the standout small-cap pick for data center opportunities. Morgan Stanley kept Equal-Weight ratings on AMD ( NASDAQ:AMD ) and Marvell ( NASDAQ:MRVL ), noting room for upside but also some uncertainties. Intel ( NASDAQ:INTC ) drew a cautious view due to challenges in its foundry operations.\nIn memory and chip equipment, Micron ( NASDAQ:MU ) leads the way, with Sandisk ( NASDAQ:SNDK ) also rated Overweight. Applied Materials (AMAT) and Taiwan Semiconductor ( NYSE:TSM ) are favored in equipment, while NXP Semiconductors (NXPI) balances growth and value. Analog Devices (ADI) shows growth potential, though at a higher price point.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "19:46:24",
      "Source": "GuruFocus.com",
      "Title": "Nvidia and Broadcom Slide on Amazon's $10 Billion OpenAI Talks",
      "URL": "https://finance.yahoo.com/news/nvidia-broadcom-slide-amazons-10-114624308.html",
      "Content": "Nvidia and Broadcom Slide on Amazon's $10 Billion OpenAI Talks\n\nNauman Khan\nThu, December 18, 2025 at 3:46 AM PST 1 min read\n\nIn this article: AMZN\n\nNVDA\n\nAVGO\n\nOPAI.PVT\n\nThis article first appeared on GuruFocus .\nShares of Nvidia ( NASDAQ:NVDA ) and Broadcom ( NASDAQ:AVGO ) slid about 4% Wednesday after reports surfaced that Amazon ( NASDAQ:AMZN ) is in discussions to invest roughly $10 billion in OpenAI.\nThe move would involve OpenAI using Amazon's in-house Trainium chips, potentially limiting future hardware purchases from Nvidia and Broadcom.\n\nWarning! GuruFocus has detected 4 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nAmazon and OpenAI did not immediately comment on the reports. The two firms already have a partnership, with a $38 billion AWS deal signed in November, which relied on Nvidia chips rather than Amazon's Trainium processors.\nTrainium hardware is central to Amazon's strategy to reduce reliance on external AI chips. Amazon recently unveiled UltraServers powered by up to 144 Trainium 3 chips, offering more than four times the previous generation's performance.\nThe potential investment could boost custom-chip designer Marvell Technology ( NASDAQ:MRVL ), which has helped develop Trainium processors.\nExperts note that while Amazon gains AI infrastructure control, Nvidia and Broadcom may face reduced demand from one of AI's biggest spenders.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "19:45:26",
      "Source": "MT Newswires",
      "Title": "Social Buzz: Wallstreetbets Stocks Higher Pre-Bell Thursday; Micron, Nvidia to Advance",
      "URL": "https://finance.yahoo.com/news/social-buzz-wallstreetbets-stocks-higher-114526823.html",
      "Content": "PREMIUM\nSocial Buzz: Wallstreetbets Stocks Higher Pre-Bell Thursday; Micron, Nvidia to Advance\n\nMT Newswires\nThu, December 18, 2025 at 3:45 AM PST 1 min read\n\nIn this article: NVDA\n\nHOOD\n\nGOOGL\n\nAMZN\n\nMU\n\nThe most-talked-about stocks in the Reddit subforum Wallstreetbets were higher hours before Thursday\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "19:37:11",
      "Source": "Barrons.com",
      "Title": "U.S. Tech Stocks Rebound Premarket After Heavy Selloff",
      "URL": "https://finance.yahoo.com/m/75b7e9c2-3a6b-3575-bb6b-66bd15928d2a/u.s.-tech-stocks-rebound.html",
      "Content": "U.S. Tech Stocks Rebound Premarket After Heavy Selloff\n\nBarrons.com\nThu, December 18, 2025 at 3:37 AM PST 1 min read\n\nIn this article: ORCL\n\n^IXIC\n\nAVGO\n\nNVDA\n\nAMD\n\nShares in U.S. tech stocks recovered slightly premarket after a heavy selloff in the prior session. Oracle climbed 1% premarket, having dropped 5.4% to a six-month low Wednesday. Broadcom stock is also on the rise after shedding roughly $422 billion of its market cap over the last five trading days.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "19:09:19",
      "Source": "GuruFocus.com",
      "Title": "S&P 500, Nasdaq and Dow Falls as Tech Slips Ahead of Inflation Data",
      "URL": "https://finance.yahoo.com/news/p-500-nasdaq-dow-falls-110919539.html",
      "Content": "S&P 500, Nasdaq and Dow Falls as Tech Slips Ahead of Inflation Data\n\nNauman Khan\nThu, December 18, 2025 at 3:09 AM PST 1 min read\n\nIn this article: AVGO\n\n^GSPC\n\nORCL\n\nNVDA\n\n^DJI\n\nThis article first appeared on GuruFocus .\nU.S. stocks traded down on Wednesday as investors digested fresh signals on interest rates and mixed corporate results.\nThe Dow Jones Industrial Average dippedabout 0.5%, while the S&P 500 slipped 1% and the Nasdaq Composite fell roughly 1.8%.\nTraders remain cautious ahead of Thursday's consumer inflation update for November.\n\nWarning! GuruFocus has detected 4 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nFederal Reserve Governor Chris Waller suggested the central bank still has room to cut rates, noting potential flexibility of 50 to 100 basis points. Comments from New York Fed President John Williams added to the focus on monetary policy direction.\nTech stocks faced pressure as Oracle ( NYSE:ORCL ) shares slid about 5% following reports that Blue Owl Capital would not back a $10 billion data center deal. AI chipmakers including Nvidia ( NASDAQ:NVDA ) and Broadcom ( NASDAQ:AVGO ) also saw declines.\nMeanwhile, Netflix ( NASDAQ:NFLX ) rose 1% as Warner Bros. Discovery ( NASDAQ:WBD ) urged shareholders to reject a rival bid from Paramount Skydance ( NASDAQ:PSKY ).\nInvestors continue to weigh interest rate expectations, AI spending, and debt levels in tech, keeping markets mixed and volatile.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "18:30:00",
      "Source": "Bloomberg",
      "Title": "JPMorgan Quants Warn of ‘Extreme Crowding’ in Speculative Stocks",
      "URL": "https://finance.yahoo.com/news/jpmorgan-quants-warn-extreme-crowding-103000458.html",
      "Content": "JPMorgan Quants Warn of ‘Extreme Crowding’ in Speculative Stocks\n\nBernard Goyder\nThu, December 18, 2025 at 2:30 AM PST 3 min read\n\nIn this article: JPM\n\nAVGO\n\nAMD\n\nEXPE\n\nIVZ\n\n(Bloomberg) -- The latest bout of volatility in US equity markets highlights a risk that strategists at JPMorgan Chase & Co. have been warning about: “extreme crowding” in stocks that have rallied hard this year.\nThe bank has a list of six stocks it considers speculative growth plays and warned that they are “vulnerable to a reversal” in the event of any major macro event. The list includes Broadcom Inc., Advanced Micro Devices Inc., Expedia Group Inc., Estee Lauder Cos Inc., Invesco Ltd. and Nucor Corp.\n\nMost Read from Bloomberg\nHudson Tunnel Digging Work to Start as Boring Machines Ready\nHow This Chameleon UK Location Became a Little-Known Hollywood Backdrop\nNYC High Line-Area Building Floats $53 Million Bankruptcy Sale\nNew York Says Cab, Rideshare Insurance Rates to Rise 25%\nNew York Utility Says Queue for Large Power Users Has Tripled\nThe S&P 500 dropped 1.2% Wednesday, a fourth straight day of loss after notching a record last week. The selloff has been led by tech shares as investors rotate out of winners — an event the JPMorgan quants warned about. They said “crowding” into the highly volatile, risky stocks had reached the 99th percentile — an “extreme” level that could lead to a sharp unwind that investors should hedge against.\n“These companies are more sensitive to shocks, leaving them at risk of sudden repricing,” wrote Bram Kaplan, JPMorgan’s head of Americas equity derivatives strategy. “Low Vol stocks possess a more attractive risk-reward profile” he added, compared to the more volatile stocks, many of which are “second order speculative AI plays.”\nSince Dec. 10, Broadcom shares are down more than 21%, while Advanced Micro Devices has dropped 11%. Estee Lauder, Invesco and Nucor are in the red as well, with only Expedia up about 3%.\nInvestors looking for winners from the artificial intelligence trade this year fanned out from Big Tech names like Nvidia Corp. and Microsoft Corp., and piled into names they expect to benefit from the AI wave. JPMorgan called the ones that made its list “second-order speculative AI beneficiaries” and said they are vulnerable to big swings because they have to tap capital or debt markets to fund expansion, rather than rely on internal growth.\n\nKaplan offers a simple recipe for clients looking to trade the moment: buy bearish put options on speculative names and take bullish positions on less volatile stocks. Investors can consider shorting some of the high-momentum names, while taking long positions in duller “low volatility” stalwarts like Cigna Group, Pfizer Inc. and Verizon Communications Inc.\n\nStory Continues\nThere is the chance, of course, that the four-day slump in these momentum stocks could merely be a temporary rotation away from a few hot stocks, rather than any significant change to the landscape. That criticism is bolstered by Micron Technology Inc.’s blowout earnings on Wednesday, that are pushing AI stocks higher once again.\n\n“Real asset owners — retail investors and large institutions — are the only market participants capable of moving markets beyond short-term, shallow and technical drawdowns,” Alexis Maubourguet, chief investment officer of the Swiss hedge fund Adapt Investment Managers, said in an interview. “It will take a meaningful fundamental change for them to liquidate their positions, such as a material shift in the AI narrative.”\nNevertheless, there’s been a growing sense that the AI trade is no longer capable of lifting all boats, with investors trying to sort out winners and losers.\n--With assistance from Matt Turner.\nMost Read from Bloomberg Businessweek\nThe Cracks in Crumbl’s Cookie Empire Are Showing\nDonald and Melania Trump’s Terrible, Tacky, Seemingly Legal Memecoin Adventure\nOracle’s $300 Billion AI Bet Has Fast Become a Bubble Barometer\nUniqlo Founder and Japan’s Richest Man Loves a $32 Pair of Slacks\nThe Prosperity Gap Between Big and Small Businesses\n©2025 Bloomberg L.P.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "16:25:59",
      "Source": "The Wall Street Journal",
      "Title": "Heard on the Street Wednesday Recap: Another AI Selloff",
      "URL": "https://finance.yahoo.com/m/6713f446-6929-3db8-b875-9579fe516ea6/heard-on-the-street-wednesday.html",
      "Content": "Heard on the Street Wednesday Recap: Another AI Selloff\n\nThe Wall Street Journal\nThu, December 18, 2025 at 12:25 AM PST 1 min read\n\nIn this article: ORCL\n\nNVDA\n\n^SOX\n\n^GSPC\n\n^IXIC\n\nMain indexes fall as AI selloff resumes. The Dow industrials fell 228 points, led by Caterpillar and Nvidia. The S&P 500 shed 1.2% while the Nasdaq slid by 1.8%. The PHLX Semiconductor Index, which houses 30 major chip stocks, dropped 3.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "13:39:38",
      "Source": "Insider Monkey",
      "Title": "Broadcom (AVGO) Posts Financial Results for Q4 2025 and FY 2025",
      "URL": "https://finance.yahoo.com/news/broadcom-avgo-posts-financial-results-053938635.html",
      "Content": "Broadcom (AVGO) Posts Financial Results for Q4 2025 and FY 2025\n\nBob Karr\nWed, December 17, 2025 at 9:39 PM PST 2 min read\n\nIn this article: AVGO\n\nBroadcom Inc. (NASDAQ: AVGO ) is one of the Top AI and Technology Stocks to Buy According to Hedge Funds. On December 11, the company posted its financial results for Q4 2025 and FY 2025, with record quarterly revenue of $18.0 billion, up 28% YoY. This was mainly driven by AI semiconductor revenue that rose 74% YoY. Broadcom Inc. (NASDAQ:AVGO) continues to see the momentum continuing in Q1 and anticipates AI semiconductor revenue to double YoY to $8.2 billion, thanks to the custom AI accelerators and Ethernet AI switches.\nIn Q4 2025, the company saw income from continuing operations of $8,518 million, reflecting an increase from $4,140 million in Q4 2024, amidst increased operating income. Broadcom Inc. (NASDAQ:AVGO) expects total revenue of $19.1 billion and adjusted EBITDA of 67% in Q1 2026.\nIn Q4 2025, infrastructure software revenue came in at $6.9 billion, reflecting an increase of 19% YoY. Broadcom Inc. (NASDAQ:AVGO) ended the year with $73 billion of infrastructure software backlog, reflecting an increase from $49 billion a year ago. The company expects renewals to be seasonal in Q1 2026 and forecasts infrastructure software revenue to be ~$6.8 billion. Broadcom Inc. (NASDAQ:AVGO) expects that, for FY 2026, infrastructure software revenue will grow low double-digit percentage.\n\nAfter the company’s earnings release, Morgan Stanley’s Joseph Moore gave an “Overweight” rating on the company’s stock, while increasing the price objective from $443 to $462.\nWhile we acknowledge the potential of AVGO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 13 Cheap AI Stocks to Buy According to Analysts and 11 Unstoppable Growth Stocks to Invest in Now\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "13:37:31",
      "Source": "Insider Monkey",
      "Title": "Broadcom (AVGO) Soars Past Expectations with Blockbuster Results, Forecasts $8.2B AI Revenue Driven by XPUs and Networking",
      "URL": "https://finance.yahoo.com/news/broadcom-avgo-soars-past-expectations-053731045.html",
      "Content": "Broadcom (AVGO) Soars Past Expectations with Blockbuster Results, Forecasts $8.2B AI Revenue Driven by XPUs and Networking\n\nMaham Fatima\nWed, December 17, 2025 at 9:37 PM PST 2 min read\n\nIn this article: AVGO\n\nBroadcom Inc. (NASDAQ: AVGO ) is one of the best Reddit stocks to invest in right now . On December 12, Piper Sandler analyst Harsh Kumar raised the firm’s price target on Broadcom to $430 from $375 and kept an Overweight rating on the shares. According to Piper Sandler, Broadcom delivered blockbuster results and guidance. The company exceeded expectations, driven by substantial AI growth from XPUs and networking. Broadcom forecasts its AI business will hit $8.2 billion in Q1 2026, marking roughly 100% year-over-year growth.\n\nIn the full fiscal year 2025, Broadcom’s revenue reached $63.9 billion, which was a strong 24% year-over-year increase. This growth was overwhelmingly propelled by the AI segment, which saw its revenue grow by 65% year-over-year to $20 billion for the fiscal year. The company’s total order backlog for AI-related components, including XPUs, switches, and DSPs, now stands at a substantial $73 billion, which is expected to be delivered over the next 6 quarters, with management expecting this figure to continue growing as new orders are placed.\nFor Q4 alone, total revenue was $18 billion, up 28% year-on-year. The Semiconductor segment, driven by AI, saw its revenue increase by 35% to $11.1 billion, leading to a full-year revenue of $36.9 billion. However, non-AI semiconductor revenue showed limited growth, increasing only 2% in Q4, with enterprise spending remaining soft. The Infrastructure Software segment also performed well, reporting revenue of $6.9 billion, up 19%, contributing to a full-year revenue of $27 billion. This segment’s growth was fueled by strong adoption of the VMware Cloud Foundation.\n\nBroadcom Inc. (NASDAQ:AVGO) designs, develops, and supplies various semiconductor devices and infrastructure software solutions worldwide. The company operates in two segments: Semiconductor Solutions and Infrastructure Software.\nWhile we acknowledge the potential of AVGO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "13:31:35",
      "Source": "StockStory",
      "Title": "5 Insightful Analyst Questions From Broadcom’s Q3 Earnings Call",
      "URL": "https://finance.yahoo.com/news/5-insightful-analyst-questions-broadcom-053135312.html",
      "Content": "5 Insightful Analyst Questions From Broadcom’s Q3 Earnings Call\n\nAnthony Lee\nWed, December 17, 2025 at 9:31 PM PST 4 min read\n\nIn this article: AVGO\n\nBroadcom’s third quarter results exceeded Wall Street’s expectations for both revenue and non-GAAP earnings, but the market reacted negatively to the print. Management attributed the quarter’s performance to accelerating demand for AI semiconductors and continued growth in its infrastructure software segment. CEO Hock Tan highlighted that AI semiconductor revenue rose sharply, supported by major orders for custom accelerators and AI data center components. He also noted, “We have never seen bookings of the nature that we have seen over the past three months.” Meanwhile, infrastructure software benefited from strong VMware Cloud Foundation adoption, driving robust contract bookings and expanding the company’s software backlog.\n\nIs now the time to buy AVGO? Find out in our full research report (it’s free for active Edge members).\nBroadcom (AVGO) Q3 CY2025 Highlights: Revenue: $18.02 billion vs analyst estimates of $17.49 billion (28.2% year-on-year growth, 3% beat)\nAdjusted EPS: $1.95 vs analyst estimates of $1.87 (4.3% beat)\nAdjusted EBITDA: $12.22 billion vs analyst estimates of $11.64 billion (67.8% margin, 5% beat)\nRevenue Guidance for Q4 CY2025 is $19.1 billion at the midpoint, above analyst estimates of $18.29 billion\nOperating Margin: 41.7%, up from 32.9% in the same quarter last year\nInventory Days Outstanding: 49, down from 54 in the previous quarter\nMarket Capitalization: $1.54 trillion\n\nWhile we enjoy listening to the management's commentary, our favorite part of earnings calls are the analyst questions. Those are unscripted and can often highlight topics that management teams would rather avoid or topics where the answer is complicated. Here is what has caught our attention.\nOur Top 5 Analyst Questions From Broadcom’s Q3 Earnings Call Vivek Arya (Bank of America): Asked about the sustainability and implications of the $73 billion AI backlog. CEO Hock Tan clarified that the figure is dynamic, with bookings accelerating, and emphasized that actual future shipments could be higher as more orders accumulate.\nRoss Seymore (Deutsche Bank): Queried whether Broadcom’s move to offer TPUs to external customers substitutes for or augments custom ASIC work. Tan responded that TPUs mostly substitute for merchant GPUs and that custom ASIC development remains a longer-term, strategic effort for customers.\nStacy Rasgon (Bernstein): Pressed management on gross margin trends as system sales increase. CFO Kirsten Spears explained that gross margins will decline but operating margin dollars should rise due to operating leverage from higher revenue.\nBlayne Curtis (Jefferies): Asked about the nature of recent system sales and whether Broadcom’s approach mirrors Google’s networking architecture. Tan confirmed the move to system-level sales and said full systems now include Broadcom’s key components, with customization varying by customer.\nHarsh Kumar (Piper Sandler): Sought details on AI revenue growth diversity and the strategic importance of optical components. Tan described strong demand across multiple customers and highlighted the growing contribution from switches, DSPs, and optical components, with system orders comprising both XPU and non-XPU elements.\n\nLa historia continúa\nCatalysts in Upcoming Quarters In the coming quarters, the StockStory team will be monitoring (1) the pace at which Broadcom converts its expanding AI order backlog into revenue, (2) the impact of system-level sales on both gross and operating margins, and (3) the continued adoption and integration of VMware Cloud Foundation within the infrastructure software segment. Progress in advanced packaging capacity and supply chain resilience will also be critical for meeting delivery commitments.\n\nBroadcom currently trades at $326.28, down from $406.60 just before the earnings. Is the company at an inflection point that warrants a buy or sell? The answer lies in our full research report (it’s free for active Edge members) .\nHigh-Quality Stocks for All Market Conditions If your portfolio success hinges on just 4 stocks, your wealth is built on fragile ground. You have a small window to secure high-quality assets before the market widens and these prices disappear.\nDon’t wait for the next volatility shock. Check out our Top 5 Strong Momentum Stocks for this week . This is a curated list of our High Quality stocks that have generated a market-beating return of 244% over the last five years (as of June 30, 2025).\nStocks that have made our list include now familiar names such as Nvidia (+1,326% between June 2020 and June 2025) as well as under-the-radar businesses like the once-small-cap company Exlservice (+354% five-year return). Find your next big winner with StockStory today .\n\nCondiciones y Política de privacidad\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "13:20:00",
      "Source": "Motley Fool",
      "Title": "Broadcom Has Beaten the Market for 6 Straight Years. Can It Continue to Outperform in 2026?",
      "URL": "https://finance.yahoo.com/m/44f4bd98-d9a2-338b-808f-05ce3c01642e/broadcom-has-beaten-the.html",
      "Content": "Broadcom Has Beaten the Market for 6 Straight Years. Can It Continue to Outperform in 2026?\n\nDavid Jagielski, CPA, The Motley Fool\nWed, December 17, 2025 at 9:20 PM PST 5 min read\n\nIn this article: AVGO\n\n^GSPC\n\nKey Points Broadcom is coming off yet another strong fiscal year, with artificial intelligence giving its business a boost.\nThe company's earnings nearly quadrupled to more than $23 billion.\nWhile the numbers were impressive, the stock trades at an exceptionally high valuation.\n10 stocks we like better than Broadcom ›\n\nIt was a year ago that tech company Broadcom (NASDAQ: AVGO) joined the trillion-dollar club. And what's remarkable is that even as it crossed that valuation, it has continued to soar this year. As of Dec. 15, it has rallied 47% since January, which is far higher than the S&P 500 's gains of just under 16%.\nBroadcom has routinely outperformed the index, and it's on track to do so for a sixth consecutive year in 2025. The last time it fell short of the S&P 500's returns was in 2019, when the index gained 29% but Broadcom's stock rose by just 24%. It was a close one, but by and large, investors have done exceptionally well with this tech company .\nIs Broadcom likely to extend its market-beating streak to seven years in 2026?\nWhy Broadcom could beat the market again in 2026 Broadcom's business has benefited from robust demand from hyperscalers for its custom chips. On Dec. 11, the company released its year-end results for fiscal 2025 (it ended on Nov. 2), with sales totaling $63.9 billion, representing a year-over-year increase of 24%. What was far more impressive was its bottom line, which totaled $23.1 billion and nearly quadrupled the $5.9 billion that it reported a year ago.\n\nThe big catalyst was, unsurprisingly, artificial intelligence (AI). The company says that during its most recent quarter, AI semiconductor revenue grew by 74%. And CEO Hock Tan says that the momentum remains strong in the first quarter, with AI semiconductor revenue on track to double on a year-over-year basis.\nIf this proves to be a sign of things to come for Broadcom, it won't be hard to envision a scenario where the stock outperforms the S&P 500 yet again. The company is involved with the leading tech and AI companies in the world, and as long as demand is strong, the stock could be poised for more significant gains in 2026.\nWhy Broadcom's stock might struggle The bearish case for Broadcom centers around its valuation and the possibility of a slowdown in AI spending. There are no indications that will happen, but it's something that investors are growing cognizant of, especially given how high stock prices have risen.\nBroadcom's stock currently trades at a price-to-earnings multiple of 75, which is close to three times the 26 times earnings the average stock on the S&P 500 trades at. A premium may be justifiable given the strong AI growth, but Broadcom's overall growth rate is still less than 30%; it may be hard to justify such an astronomical valuation for that level of growth.\n\nStory Continues\nUltimately, Broadcom's stock performance next year will likely come down to two factors: the appetite from retail investors to continue paying high premiums for AI stocks, and whether AI spending will remain strong. If both conditions are favorable for Broadcom, I'd expect it to outperform the index; otherwise, a sell-off could be coming.\n\nIs Broadcom a good AI stock to buy right now? It may be tempting to assume that since Broadcom has done well for six straight years that it's likely going to continue that pattern in 2026. But the past doesn't predict the future, and the danger for investors is in assuming that the stock will rise again simply because it has done so in previous years.\n\nAnd there are signs that investor sentiment is souring on AI stocks. On Monday, Broadcom's stock fell to below $340 -- down from over $406, which is where it was before it released earnings last week. In a matter of days, it has lost over 16% in value. It's an alarming sign that investors may not be as excited with the stock as they have been in the past, even though the company beat expectations on both the top and bottom lines in its most recent quarter.\nAs hot as Broadcom's stock has been, I think more of a cooldown is coming. It looks overdue for a decline, and 2026 could very well be the year when the S&P 500 generates better returns again.\nShould you buy stock in Broadcom right now? Before you buy stock in Broadcom, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Broadcom wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,955 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,089,460 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 968 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nDavid Jagielski, CPA has no position in any of the stocks mentioned. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nBroadcom Has Beaten the Market for 6 Straight Years. Can It Continue to Outperform in 2026? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "10:00:38",
      "Source": "Investor's Business Daily",
      "Title": "Dow Jones Futures: Micron Jumps On Earnings After Oracle Leads AI Stock Sell-Off",
      "URL": "https://finance.yahoo.com/m/ff75ab41-f2d5-3639-a63d-2124f5fc841b/dow-jones-futures%3A-micron.html",
      "Content": "Dow Jones Futures: Micron Jumps On Earnings After Oracle Leads AI Stock Sell-Off\n\nED CARSON\nWed, December 17, 2025 at 6:00 PM PST 5 min read\n\nIn this article: ^DJI\n\nMU\n\nORCL\n\nGEV\n\nNVDA\n\nOracle and AI stocks drove damaging market losses Wednesday. Micron jumped late on strong earnings and blowout guidance.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "07:10:00",
      "Source": "Zacks",
      "Title": "Markets Sell Off -0.5% to -1.8% Ahead of Inflation Rate Thursday",
      "URL": "https://finance.yahoo.com/news/markets-sell-off-0-5-231000792.html",
      "Content": "Markets Sell Off -0.5% to -1.8% Ahead of Inflation Rate Thursday\n\nMark Vickery\nWed, December 17, 2025 at 3:10 PM PST 3 min read\n\nIn this article: CAT\n\nORCL\n\nTSLA\n\nMU\n\nNVDA\n\nWednesday, December 17, 2025\n\nMarkets experienced a heavier sell-off today, after starting the session at the opening bell flat-to-up. By 11am or so, the Dow and the small-cap Russell were in negative territory; the Nasdaq and S&P 500 had already gotten there. The Dow closed -228 points, -0.47%, and it got off easy. The S&P 500, Nasdaq and Russell 2000 were all down -1.16%, -1.81% and -1.14%, respectively.\n\nThis marks the fourth-straight down-day for the blue-chip Dow and the comprehensive S&P 500. The Russell 2000 has only traded down since closing at an all-time high last Thursday. The Nasdaq has dipped into the red over the past month of trading, and down -6.5% from its all-time high back in late October of this year.\n\nThe AI trade had been keeping markets buoyant for much of 2025; now that the year is coming to an end, investors are apparently looking toward 2026 with a warier eye than we&rsquo;ve seen &mdash; although we&rsquo;ve only had one &ldquo;Santa Claus Rally&rdquo; in the past five years, in 2023. AI stocks have taken it on the chin, including Oracle ORCL -5.4%, Broadcom AVGO -4.5% and NVIDIA NVDA -3.8%. Also, Caterpillar CAT dropped -4.7% and Lennar Home LEN fell -4.4%.\n\nEven Tesla TSLA, fresh from an all-time closing high just yesterday, suffered a heavy round of profit-taking today, as the EV leader slid -4.6% on the day. Tesla has also been named by the California DMV as having provided misleading claims about its autos, claiming them to have &ldquo;full self-driving capability&rdquo; when they don&rsquo;t, exactly. The DMV adopted this position from a judge&rsquo;s ruling last month, and has been given 60 days to take down such claims.\n\nMicron Posts Huge Beats in Q1 Report\n\nAfter today&rsquo;s close, Zacks Rank #1 (Strong Buy)-rated Micron MU blew the doors off expectations in its fiscal Q1 report. Earnings of $4.78 per share swept away the paltry Zacks consensus of $3.91, while revenues of $13.64 billion zoomed past the $12.74 billion anticipated. Next-quarter guidance is also significantly higher than we had previously forecast.\n\nOperating cash flow rose +47% quarter over quarter to $8.41 billion, and is more than double the $3.24 billion it had reported in the year-ago quarter. Micron doubled its cloud memory business year over year to $5.28 billion, on improved +66% gross margins. Shares are up +5% in late trading, adding to its stupendous +168% rise in share price from the start of the year.\n\nNovember CPI Inflation Rate Hits the Tape Thursday Morning\n\nTomorrow ahead of the opening bell, we not only get normal Weekly Jobless Claims , but the government-shutdown-delayed Consumer Price Index (CPI) for November (skipping October completely). We already hear noises from some market participants about the accuracy of this upcoming data 16 hours before it&rsquo;s released, but consensus is currently for a +3.1% Inflation Rate (year-over-year CPI, headline) &mdash; the highest since May of 2024. Core CPI year over year is anticipated at +3.0%.\n\nWe have already seen the erosion to the labor market over the past year yesterday with the Employment Situation report. If we also see CPI numbers continuing to tick up &mdash; and we&rsquo;ve only gone up or stayed pat each month since April&rsquo;s low +2.3% &mdash; that may be a bad sign for the economy on the brink of a new year. &ldquo;May&rdquo; be; it&rsquo;s not certain. Even still, selling off the tops of this healthy 2025 market seems more reasonable if investors are questioning what&rsquo;s to come.\n\nQuestions or comments about this article and/or author? Click here>>\n\nStory Continues\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nCaterpillar Inc. (CAT) : Free Stock Analysis Report\nMicron Technology, Inc. (MU) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nOracle Corporation (ORCL) : Free Stock Analysis Report\nLennar Corporation (LEN) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nTesla, Inc. (TSLA) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "07:07:52",
      "Source": "Yahoo Finance",
      "Title": "Stock market today: S&P 500, Nasdaq futures rise as Micron boosts tech after sell-off, CPI report looms",
      "URL": "https://finance.yahoo.com/news/live/stock-market-today-sp-500-nasdaq-futures-rise-as-micron-boosts-tech-after-sell-off-cpi-report-looms-230752790.html",
      "Content": "LIVE\n\nStock market today: S&P 500, Nasdaq futures rise as Micron boosts tech after sell-off, CPI report looms\n\nKaren Friar and Brett LoGiurato\nUpdated Thu, December 18, 2025 at 12:06 AM PST 2 min read\n\nIn this article: MU\n\n^DJI\n\n^IXIC\n\n^GSPC\n\nORCL\n\nUS stock futures leaned broadly higher on Thursday, eyeing a recovery from Wall Street's tech-fueled sell-off as investors waited for the latest reading on consumer inflation that could help set expectations for the path of interest rates.\nS&P 500 futures ( ES=F ) moved up 0.2%, while those on the Nasdaq 100 ( NQ=F ) gained 0.5%, looking to rebound after Oracle ( ORCL )-propelled AI trade worries spurred another bruising session for tech . Meanwhile, Dow Jones Industrial Average futures ( YM=F ) clung to the flatline.\n\nWall Street is keeping watch for more signs of tech malaise after Oracle lost key backing for a $10 billion data center project, sending its stock tumbling Wednesday along with heavyweight names like Nvidia ( NVDA ) and Broadcom ( AVGO ), among others.\nChipmaker Micron Technology's ( MU ) earnings late Wednesday painted a rosier picture for AI demand, as the Nvidia ( NVDA ) supplier forecast next quarter's adjusted profit to be nearly double what analysts expected . Shares jumped in premarket trading.\n\nMeanwhile, markets are waiting for Thursday's report on the consumer price index for November, originally scheduled for Dec. 10. But as with Tuesday's monthly jobs report , the inflation data could be less reliable than normal thanks to the US government shutdown. For one thing, month-on-month comparisons will be missing, given the disruption to the collection of CPI data in October.\nThat will make it more difficult to gauge the momentum of inflation. At the same time, the Federal Reserve seems more attentive to cracks in the labor market than to price pressures. On Wednesday, Fed governor Chris Waller signaled support for rate cuts before the release of the CPI update.\nRead more: How the Fed rate decision affects your bank accounts, loans, credit cards, and investments\nGiven all that, markets are seen as less laser-focused on the inflation print than usual. On the jobs front, markets will get the latest weekly look at initial unemployment claims, but that data has also been subject to significant volatility in the wake of the federal shutdown.\nLIVE 1 update\nWed, December 17, 2025 at 11:50 PM UTC Brett LoGiurato\n\nMicron jumps after forecasting blowout earnings on booming AI market Micron shares jumped in after-hours trading Wednesday after the company forecast second-quarter profit to be nearly double what analysts projected. The results could also once again fortify faith in the AI trade after tech's latest rocky stretch.\nReuters reports :\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "07:07:52",
      "Source": "Yahoo Finance",
      "Title": "Stock market today: Dow, S&P 500, Nasdaq futures rise as Micron boosts tech after sell-off, CPI report looms",
      "URL": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-rise-as-micron-boosts-tech-after-sell-off-cpi-report-looms-230752495.html",
      "Content": "Stock market today: Dow, S&P 500, Nasdaq futures rise as Micron boosts tech after sell-off, CPI report looms\n\nKaren Friar and Brett LoGiurato\nWed, December 17, 2025 at 3:07 PM PST 2 min read\n\nIn this article: MU\n\nORCL\n\nNVDA\n\n^DJI\n\n^IXIC\n\nUS stock futures ticked higher overnight, eyeing a recovery from Wall Street's tech-fueled sell-off as investors waited for the latest reading on consumer inflation that could help set expectations for the path of interest rates.\nS&P 500 futures ( ES=F ) rose 0.3%, while those on the Nasdaq 100 ( NQ=F ) gained 0.4%, looking to rebound after Oracle ( ORCL )-propelled AI trade worries spurred another bruising session for tech . Meanwhile, Dow Jones Industrial Average futures ( YM=F ) edged up.\n\nWall Street is keeping watch for more signs of tech malaise after Oracle lost key backing for a $10 billion data center project, sending its stock tumbling Wednesday along with heavyweight names like Nvidia ( NVDA ) and Broadcom ( AVGO ), among others.\nChipmaker Micron Technology's ( MU ) earnings late Wednesday painted a rosier picture for AI demand, as the Nvidia ( NVDA ) supplier forecast next quarter's adjusted profit to be nearly double what analysts expected . Shares jumped in after-hours trading.\n\nMeanwhile, markets are waiting for Thursday's report on the consumer price index for November, originally scheduled for Dec. 10. But as with Tuesday's monthly jobs report , the inflation data could be less reliable than normal thanks to the US government shutdown. For one thing, month-on-month comparisons will be missing, given the disruption to the collection of CPI data in October.\nThat will make it more difficult to gauge the momentum of inflation. At the same time, the Federal Reserve seems more attentive to cracks in the labor market than to price pressures. On Wednesday, Fed governor Chris Waller signaled support for rate cuts before the release of the CPI update.\nRead more: How the Fed rate decision affects your bank accounts, loans, credit cards, and investments\nGiven all that, markets are seen as less laser-focused on the inflation print than usual. On the jobs front, markets will get the latest weekly look at initial unemployment claims, but that data has also been subject to significant volatility in the wake of the federal shutdown.\nComing soon\n\nLIVE COVERAGE BEGINS SOON\n\nStock market coverage for Thursday, December 18, 2025.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "06:50:55",
      "Source": "Investor's Business Daily",
      "Title": "Dow Jones Futures: Micron Jumps On Earnings, Guidance After Oracle Leads AI Stock Sell-Off",
      "URL": "https://finance.yahoo.com/m/ff75ab41-f2d5-3639-a63d-2124f5fc841b/dow-jones-futures%3A-micron.html",
      "Content": "Dow Jones Futures: Micron Jumps On Earnings, Guidance After Oracle Leads AI Stock Sell-Off\n\nED CARSON\nWed, December 17, 2025 at 2:50 PM PST 5 min read\n\nIn this article: ^DJI\n\nMU\n\nORCL\n\nNVDA\n\nGEV\n\nOracle and AI stocks drove damaging market losses Wednesday. Micron jumped late on strong earnings and blowout guidance.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "06:38:59",
      "Source": "The Wall Street Journal",
      "Title": "Heard on the Street Recap: Another AI Selloff",
      "URL": "https://finance.yahoo.com/m/91039310-2f23-3f12-92f1-8ee13a4dd2d3/heard-on-the-street-recap%3A.html",
      "Content": "Heard on the Street Recap: Another AI Selloff\n\nThe Wall Street Journal\nWed, December 17, 2025 at 2:38 PM PST 1 min read\n\nIn this article: ORCL\n\nNVDA\n\n^SOX\n\n^GSPC\n\n^IXIC\n\nThe Dow fell 228 points led by Caterpillar and Nvidia. The PHLX Semiconductor Index that is home to 30 major chip stocks dropped 3.8% by the closing bell. Nvidia, Broadcom, Tesla and Google-parent Alphabet all shed 3-4% by the closing bell, racking up a total of $431 billion in lost market cap for the day.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "06:33:40",
      "Source": "Motley Fool",
      "Title": "Stock Market Today, Dec. 17: Broadcom Drops on  China AI Chip Breakthrough and AI Buildout Uncertainty",
      "URL": "https://finance.yahoo.com/m/b94120bd-2174-3b5e-aacc-11f8ba04d936/stock-market-today%2C-dec.-17%3A.html",
      "Content": "Stock Market Today, Dec. 17: Broadcom Drops on China AI Chip Breakthrough and AI Buildout Uncertainty\n\nHoward Smith, The Motley Fool\nWed, December 17, 2025 at 2:33 PM PST 2 min read\n\nIn this article: AVGO\n\n^GSPC\n\n^IXIC\n\nNVDA\n\nINTC\n\nBroadcom (NASDAQ:AVGO) , which designs and supplies semiconductor devices and infrastructure software solutions, closed at $326.02, down 4.48%. Trading volume reached 73 million shares, coming in about 287% above versus its three-month average of 26 million shares.\nHow the markets moved today Wednesday’s trading reflected renewed concern about AI chip profitability and competitive threats from Chinese AI developments, and investors are watching how Broadcom manages margins alongside VMware integration and AI infrastructure demand.\n\nThe S&P 500 (SNPINDEX:^GSPC) fell 1.15% to 6,722, while the Nasdaq Composite (NASDAQINDEX:^IXIC) lost 1.81% to close at 22,694. Among Semiconductors industry rivals, Nvidia (NASDAQ:NVDA) slid 3.81% and Intel (NASDAQ:INTC) dropped 3.38%, underscoring broad pressure on major AI-focused chipmakers.\n\nWhat this means for investors Rising competition from China had tech investors on their heels to start the day. It only got worse with reports that one private equity firm may not back an Oracle data center project as had been expected.\nAn ongoing Chinese government project to boost semiconductor self-sufficiency made a breakthrough, according to reports. While it has yet to result in working chips, a laboratory prototype represents progress.\n\nInvestors are also souring on names like Broadcom as questions arise around AI infrastructure funding. Reports today that Blue Owl Capital may not back the Oracle project as expected gave investors another reason to book profits today.\nDon’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $460,957 !*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $52,242 !*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $509,955 !*\nRight now, we’re issuing “Double Down” alerts for three incredible companies , available when you join Stock Advisor , and there may not be another chance like this anytime soon.\nSee the 3 stocks »\n*Stock Advisor returns as of December 15, 2025\nHoward Smith has positions in Broadcom, Intel, and Nvidia and has the following options: short February 2026 $170 calls on Nvidia and short January 2026 $26 calls on Intel. The Motley Fool has positions in and recommends Intel, Nvidia, and Oracle. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nStock Market Today, Dec. 17: Broadcom Drops on China AI Chip Breakthrough and AI Buildout Uncertainty was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "06:33:24",
      "Source": "Motley Fool",
      "Title": "Stock Market Today, Dec. 17: AI Concentration Fears Weigh on Markets",
      "URL": "https://finance.yahoo.com/m/a0010a9b-6070-369b-abca-e1cb0ebacbe0/stock-market-today%2C-dec.-17%3A.html",
      "Content": "Stock Market Today, Dec. 17: AI Concentration Fears Weigh on Markets\n\nEmma Newbery, The Motley Fool\nWed, December 17, 2025 at 2:33 PM PST 2 min read\n\nIn this article: MU\n\nAVGO\n\n^GSPC\n\n^DJI\n\n^IXIC\n\nS&P 500 fell 1.16% to 6,721.43, the Nasdaq Composite slid 1.81% to 22,693.32 on tech and AI weakness, and the Dow Jones Industrial Average (DJINDEX:^DJI) lost 0.47% to 47,885.96, easing from recent highs.\nMarket movers Broadcom dropped nearly 5% as investors reassessed AI-chip valuations. Concerns about AI put pressure on Nasdaq, in spite of a dramatic IPO from Medline (NASDAQ:MDLN) . The newly listed medical supply distributor jumped more than 30% in its Nasdaq debut. Micron Technology (NASDAQ:MU) advanced after upbeat earnings.\n\nWhat this means for investors Questions about AI drove risk-off sentiment as the S&P 500 finished in the red for the fourth consecutive day. Data from Barclays (NYSE:BCS) shows just 10 companies account for over 40% of the total market cap and over 30% of earnings. That concentration has some investors concerned about the fragility of the market.\n\nThe U.S. Census Bureau's October estimates show stagnating retail sales, which puts pressure on retailers and other consumer-focused sectors. The unexpectedly flat outlook sparked uncertainty. However, the data also shows fragmented consumer behavior as some sectors, such as furniture and home furnishing stores, saw increasing sales.\nFinally, Federal Reserve governor Christopher Waller told CNBC that a weaker jobs market is a reason for continued, but careful, rate cuts. Other officials are more cautious.\nDon’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $460,957 !*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $52,242 !*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $509,955 !*\nRight now, we’re issuing “Double Down” alerts for three incredible companies , available when you join Stock Advisor , and there may not be another chance like this anytime soon.\nSee the 3 stocks »\n*Stock Advisor returns as of December 15, 2025\nEmma Newbery has no position in any of the stocks mentioned. The Motley Fool recommends Barclays Plc and Broadcom. The Motley Fool has a disclosure policy .\nStock Market Today, Dec. 17: AI Concentration Fears Weigh on Markets was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "06:05:12",
      "Source": "Investor's Business Daily",
      "Title": "Dow Jones Futures: Micron Rises On Earnings, Blowout Guidance After Oracle Leads AI Stock Sell-Off",
      "URL": "https://finance.yahoo.com/m/ff75ab41-f2d5-3639-a63d-2124f5fc841b/dow-jones-futures%3A-micron.html",
      "Content": "Dow Jones Futures: Micron Rises On Earnings, Blowout Guidance After Oracle Leads AI Stock Sell-Off\n\nED CARSON\nWed, December 17, 2025 at 2:05 PM PST 5 min read\n\nIn this article: MU\n\nFIX\n\n^DJI\n\nORCL\n\n^GSPC\n\nOracle and AI stocks drove damaging market losses Wednesday. Micron jumped late on strong earnings and blowout guidance.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "05:48:01",
      "Source": "AFP",
      "Title": "Nasdaq tumbles on renewed angst over AI building boom",
      "URL": "https://finance.yahoo.com/news/asian-markets-drift-us-jobs-025017134.html",
      "Content": "Nasdaq tumbles on renewed angst over AI building boom\n\nAFP\nWed, December 17, 2025 at 1:48 PM PST 3 min read\n\nIn this article: ORCL\n\n^IXIC\n\nCL=F\n\nAVGO\n\nNVDA\n\nTech shares suffered another bout of weakness Wednesday on worries about an AI bubble, hitting US stocks as oil prices advanced following a US announcement of a blockade of tankers to Venezuela.\nThe Nasdaq led major Wall Street indices lower following reports questioning the financing of an Oracle project to build a data center in Michigan.\n\nArt Hogan of B. Riley Wealth Management described Oracle as \"probably the poster child\" for questions about AI project financing and profitability.\n\"Investors are starting to be more differentiated and looking at the potential winners and the potential time frame before return on invested capital,\" Hogan said. \"That doesn't mean we're anywhere close to the final innings of artificial intelligence. It just means investors are being more discerning.\"\nBesides Oracle, which fell 5.4 percent, other AI players such as Nvidia, Google parent Alphabet and Broadcom all lost more than three percent.\nWhile technology and communications services were among the sectors to retreat, energy led the winners among sectors moving higher.\n\nOil prices rallied after US President Donald Trump ordered a blockade of \"sanctioned\" oil tankers heading to and leaving Venezuela.\nThe commodity later pared some of its gains, but finished the day up more than one percent.\nVenezuela, which has the world's largest proven oil reserves, shrugged off the threat of more pain, insisting that it was proceeding with business as usual.\n\"Export operations for crude and byproducts continue normally. Oil tankers linked to PDVSA operations continue to sail with full security,\" state oil company Petroleos de Venezuela (PDVSA) said.\nIn Europe, London's stock market rallied as the pound faltered on expectations of cuts to Bank of England interest rates, after data showed UK inflation falling faster than forecast.\n\nBritain's annual inflation rate slowed to 3.2 percent in November, cementing expectations that the Bank of England will cut its main interest rate on Thursday and again on more than one occasion in 2026.\nAnalysts had expected inflation to have cooled only slightly to 3.5 percent from 3.6 percent in October.\nEurozone inflation remained at 2.1 percent in November, hovering just above the target set by the European Central Bank, slightly revised official data showed Wednesday.\nThe ECB is expected to hold interest rates steady Thursday for its fourth straight meeting with inflation in check, although debate is heating up about the path forward.\nBoth the Paris and Frankfurt stock markets ended lower. Asian markets were mixed.\n\nStory Continues\nIn corporate news, the share price of Chinese chipmaker MetaX Integrated Circuits Shanghai soared more than 550 percent on its home-city debut Wednesday.\nShares in Netflix climbed 0.2 percent after Warner Bros. Discovery rejected a hostile takeover bid by Paramount in favor of being acquired by the streaming giant.\n\nShares in Warner Bros. Discovery shed 2.4 percent and shares in Paramount tumbled 5.4 percent.\n- Key figures at around 2115 GMT -\nNew York - Dow: DOWN 0.5 percent at 47,885.97 (close)\nNew York - S&P 500: DOWN 0.8 percent at 6,721.43 (close)\nNew York - Nasdaq Composite: DOWN 1.8 percent at 22,693.32 (close)\nLondon - FTSE 100: UP 0.9 percent at 9,774.32 (close)\nParis - CAC 40: DOWN 0.3 percent at 8,086.05 (close)\nFrankfurt - DAX: DOWN 0.5 percent at 23,960.59 (close)\nTokyo - Nikkei 225: UP 0.3 percent at 49,512.28 (close)\nHong Kong - Hang Seng Index: UP 0.9 percent at 25,468.78 (close)\nShanghai - Composite: UP 1.2 percent at 3,870.28 (close)\nEuro/dollar: DOWN at $1.1743 from $1.1747 on Tuesday\nPound/dollar: DOWN at $1.3379 from $1.3423\nDollar/yen: UP at 155.70 yen from 154.72\nEuro/pound: UP at 87.77 pence from 87.51\nBrent North Sea Crude: UP 1.3 percent at $59.68 per barrel\nWest Texas Intermediate: UP 1.2 percent at $55.94 per barrel\nburs-jmb/sla\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "05:46:00",
      "Source": "Barrons.com",
      "Title": "Salesforce and Other AI Stocks That Can Catch Up to the Pack",
      "URL": "https://finance.yahoo.com/m/bae0672d-398a-3bf1-b01d-b1c91e47b924/salesforce-and-other-ai.html",
      "Content": "Salesforce and Other AI Stocks That Can Catch Up to the Pack\n\nJacob Sonenshine\nWed, December 17, 2025 at 1:46 PM PST 3 min read\n\nIn this article: MSFT\n\n^GSPC\n\nNVDA\n\nCRM\n\nAMD\n\nNvidia Microsoft and other prominent artificial-intelligence stocks are seeing bouts of selling. Wall Street has grown wary that software and internet companies will slow down the pace of their investments in data centers, dragging down chip stocks. The worry there is that returns on their massive AI investments might disappoint the market’s expectations.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "05:23:00",
      "Source": "The Wall Street Journal",
      "Title": "Tech Slide Weighs on Nasdaq; Oil Prices Gain",
      "URL": "https://finance.yahoo.com/m/48d4a891-0b99-3e06-8437-3dbf2b0e95c1/tech-slide-weighs-on-nasdaq%3B.html",
      "Content": "Tech Slide Weighs on Nasdaq; Oil Prices Gain\n\nAngus Berwick\nWed, December 17, 2025 at 1:23 PM PST 1 min read\n\nIn this article: CL=F\n\n^GSPC\n\n^IXIC\n\nNVDA\n\nAVGO\n\nA fresh fall in tech stocks dragged indexes lower Wednesday as concerns about artificial-intelligence valuations and spending heated up.\nThe Nasdaq composite lost 1.8%, with Nvidia, Broadcom and Oracle all down more than 3% on the day. Tech shares in the S&P 500 fell 2.2%, leading the benchmark lower. The Dow industrials surrendered early gains, dragged down by a slide in shares of Caterpillar.\n\nMost Read from The Wall Street Journal U.S. Tanker Seizure Has Paralyzed Venezuelan Oil Shipping—Except Chevron’s\nSpooked by AI and Layoffs, White-Collar Workers See Their Security Slip Away\nPepsi Worked to Keep Prices Higher at Retailers to Protect Walmart, FTC Found\nPanama Ports Deal Hits Impasse as China Makes New Demands for Its Approval\nU.S. Unemployment Rose in November ​Despite Job Gains\n\nWarner Bros. Discovery rejected an unsolicited bid from Paramount, saying it believes a planned deal with Netflix is still superior. Paramount and Warner shares both fell, while Netflix edged higher.\nShares of Medline, a medical-supplies manufacturer and distributor, surged 42% in their trading debut Wednesday after the company raised $6.26 billion in the largest U.S. IPO since 2021.\nOil prices rose after President Trump ramped up pressure on Venezuela, ordering a blockade of sanctioned tankers entering and exiting the country.\nBrent crude futures moved 1.3% higher to $59.68 a barrel, after skidding Tuesday. Shares of energy companies, including Exxon Mobil, BP and Shell, rallied.\nThe dollar strengthened against a range of currencies. The British pound fell after data showed U.K. inflation slowed to an eight-month low, making a Thursday rate cut all but certain.\n\nIn other markets:\nGlobal markets largely advanced. China’s Shanghai composite and Hang Seng Index both rose about 1%, boosted by AI stocks. The FTSE 100 rose 1%, bolstered by energy and bank stocks.\nGold and silver futures rallied to record highs. Gold rose 1% to $4,347.50 a troy ounce. Silver added 5.6% to $66.24.\nWrite to Angus Berwick at angus.berwick@wsj.com\nMost Read from The Wall Street Journal Warner Preparing to Tell Shareholders to Reject Paramount Offer\nThe Factory Workers Who Build the Power Grid by Hand\nBlackstone Leads $400 Million Investment in Cyber Startup Cyera\nCalifornia Gives Tesla 90 Days to Change Autopilot Advertising\nBitcoin Keeps Sliding, and the True Believers Keep Buying\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "05:03:00",
      "Source": "TheStreet",
      "Title": "Bank of America sets AI stocks to buy list for 2026",
      "URL": "https://finance.yahoo.com/m/1b002e49-901c-3ecc-8222-694c5845bc6c/bank-of-america-sets-ai.html",
      "Content": "Bank of America sets AI stocks to buy list for 2026\n\nMoz Farooque\nWed, December 17, 2025 at 1:03 PM PST 6 min read\n\nIn this article: BAC\n\nNVDA\n\nAVGO\n\nLRCX\n\nMSFT\n\nAI chip stocks haven’t had the smoothest of rides lately, but Bank of America believes the bigger trend driving them is intact.\nIn doing so, the investment bank 's analysts are putting familiar names at the top of their AI stocks to buy list for 2026.\nNvidia ( NVDA ), Broadcom ( AVGO ), and Lam Research ( LRCX ) are BofA’s three headline picks, as it argues that the powerful AI spending boom is still in its early innings.\n\nFor perspective, four of the biggest tech giants in Microsoft, Amazon, Alphabet, and Meta dropped nearly $110 billion on AI-driven capex in Q3 alone.\nBank of America's analysts make the case that 2026 is likely to be the midpoint in a major overhaul of global computing infrastructure, with companies upgrading systems to handle AI workloads.\nThat view is also why the recent pullbacks in the bellwethers haven’t shaken conviction in the core narrative.\nSo, the message is that while AI stocks could remain volatile in the near-term, the companies involved in the infrastructure boom are positioned to benefit immensely as spending continues to rise at an aggressive pace.\nBofA sees AI spending as a long-term buildout BofA isn’t buying the idea that AI spending has peaked out.\nMore AI Stocks:\nIs Nvidia’s AI boom already priced in? Oppenheimer doesn’t think so\nWindows president told ‘Stop this nonsense. No one wants this’\nMichael Burry turns up heat on anti-AI bet\nAI plays expanding role in predicting natural disasters\nMorgan Stanley revamps Nvidia’s price target ahead of big Q3\nCathie Wood buys $16.2 million of sinking AI stock\n\nInstead, the bank argues that 2026 is perhaps when we’re in the middle part of the innings, describing AI adoption as a lengthy 8–10 year process, with businesses reworking traditional IT systems to support AI compute requirements.\nIn fact, BofA expects AI chips to post another year of scoring 50% growth, spearheaded by “strong data center utilization, tight supply, enterprise adoption and the race between LLM builders, hyperscalers, and sovereign customers.”\nAlso, it argues that there are plenty of near-term catalysts for AI bellwethers like Nvidia, including its popular CES and GTC conferences.\nThey also tout Nvidia's top GPU rival, AMD , as another top AI-focused chip stock to keep tabs on.\nHowever, investors have grown a lot more focused on near-term returns, hyperscaler budgets, and cash flow discipline.\nNevertheless, BofA sees those hiccups as part of a maturing cycle instead of a warning sign.\nHence, from that angle, the uneven stock market performance doesn’t point to sluggish adoption; it’s the market effectively adjusting expectations as AI moves toward scaled deployment.\n\nStory Continues\nWhere Nvidia, Broadcom, and Lam fit in the AI cycle It’s hard to make sense of what each company does in the AI chip boom, especially with so many headlines bombarding our feeds daily.\nRelated: Netflix, Disney have unexpected streaming rival\nNvidia’s a no-brainer in all of it. It basically sells the “brains,” with its potent GPUs that train and run AI models. On top of its hardware stack, it’s also pushing out software that makes it usable at scale.\n\nBroadcom plays a less visible but key role, too, supplying the networking and custom chips that let data move quickly inside AI-heavy data centers.\nLam Research sits even further upstream, manufacturing the equipment chipmakers need to build advanced chips in the first place.\nThat said, here’s a look at how each of these stalwarts performed in 2025 as the AI buildout continued.\nNvidia (up 32% year to date) It was another massive year for Nvidia, marked by insatiable demand for its chips, along with more drama and receipts.\nBlackwell moved from hype to volume, taking data-center revenues to new heights as cloud giants kept ordering compute.\nRelated: Microsoft sends harsh message to millions of Microsoft 365 customers\n\nIn April, it was dealt a blow when Washington threw a wrench into its plans, requiring licenses to ship Nvidia's China-tailored H20. Consequently, Nvidia took a massive $4.5 billion hit for excess inventory and commitments.\nStill, the market kept buying the narrative, and on July 9, Nvidia became the first company to reach a $4 trillion valuation (currently around $4.3 trillion).\nBy November, Nvidia reported another solid quarter, backed by $57 billion in quarterly sales , with $51.2 billion from data center, along with $65 billion guide.\nNevertheless, AI bubble fears have Nvidia stock stuck in a limbo, but most of Wall Street feels it's a temporary blip.\nEarnings snapshot: last four quarters\nFQ3 2026 (Oct 2025): EPS $1.30 (beat by 5 cents); Revenue $57.01 billion, +62.5% YoY (beat by $1.96 billion)\nFQ2 2026 (Jul 2025): EPS $1.05 (beat by 4 cents); Revenue $46.74 billion, +55.6% YoY (beat by $687 million)\nFQ1 2026 (Apr 2025): EPS 81 cents (beat by 6 cents); Revenue $44.06 billion, +69.2% YoY (beat by $807 million)\nFQ4 2025 (Jan 2025): EPS 89 cents (beat by 4 cents); Revenue $39.33 billion, +77.9% YoY (beat by $1.19 billion)\n\nBroadcom (up 47% year to date) Broadcom’s 2025 also had a superb year.\nOn the semiconductor side, its powerful custom AI accelerators and data-center networking impressed, pushing AI-related sales to nearly $20 billion for the year.\nOn the software end, VMware kept throwing off cash, providing Broadcom a much stronger and steadier base than its peers.\n\nHowever, by the end of the year, Wall Street got picky.\nIn December, Broadcom posted another solid quarter of results, handily beating expectations and posting a record fiscal 2025 sales figure of $63.9 billion .\nHowever, it also warned margins might dip as AI chips become a bigger piece of the pie, and the stock sold off anyway.\nEarnings snapshot: last four quarters\nFQ4 2025 (Oct 2025): EPS $1.95 (beat by 8 cents); Revenue $18.02 billion, +28.2% YoY (beat by $556 million).\nFQ3 2025 (Jul 2025): EPS $1.69 (beat by 3 cents); Revenue $15.95 billion, +22.0% YoY (beat by $129 million).\nFQ2 2025 (Apr 2025): EPS $1.58 (beat by 1 cent); Revenue $15.00 billion, +20.2% YoY (beat by $28 million).\nFQ1 2025 (Jan 2025): EPS $1.60 (beat by 9 cents); Revenue $14.92 billion, +24.7% YoY (beat by $325 million).\n\nLam Research (up 128% year to date) Lam Research remained the top “picks-and-shovels” player in the AI story.\nNvidia is involved in chip sales, but Lam sells the tools helping fabs make them.\nThese include things like etching, deposition, and the gear keeping yields higher as the chips get tinier.\nThe numbers backed it up as Lam posted record fiscal 2025 sales of nearly $18.4 billion , then kept the ball rolling with a massive $5.32 billion September-quarter print (gross margins at around 50%).\n\nOn top of that, the industry backdrop remained mostly conducive, with wafer-fab equipment sales expected to be strong again in 2026 as AI pushes more investment into logic and memory.\nEarnings snapshot: last four quarters\nFQ1 2026 (Sep 2025): EPS $1.26 (beat by 4 cents); Revenue $5.32 billion, +27.7% YoY (beat by $93.6 million).\nFQ4 2025 (Jun 2025): EPS $1.33 (beat by 12 cents); Revenue $5.17 billion, +33.6% YoY (beat by $167.2 million).\nFQ3 2025 (Mar 2025): EPS $1.04 (beat by 4 cents); Revenue $4.72 billion, +24.4% YoY (beat by $79.9 million).\nFQ2 2025 (Dec 2024): EPS 91 cents (beat by 3 cents); Revenue $4.38 billion, +16.4% YoY (beat by $63.0 million).\nRelated: Palantir secures quiet contract win with big implications\nThis story was originally published by TheStreet on Dec 17, 2025, where it first appeared in the Investing section. Add TheStreet as a Preferred Source by clicking here.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "05:00:44",
      "Source": "Yahoo Finance",
      "Title": "Stock market today: Dow, S&P 500, Nasdaq sink as Oracle stock gets hit over AI funding worries",
      "URL": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-sink-as-oracle-stock-gets-hit-over-ai-funding-worries-210044415.html",
      "Content": "LIVE\n\nStock market today: Dow, S&P 500, Nasdaq sink as Oracle stock gets hit over AI funding worries\n\nKaren Friar , Brett LoGiurato and Laura Bratton\nUpdated Wed, December 17, 2025 at 1:02 PM PST 2 min read\n\nIn this article: ^GSPC\n\nTSLA\n\nORCL\n\n^IXIC\n\n^DJI\n\nUS stocks fell on Wednesday as investors weighed what the latest data means for the Fed's interest rate policy, with tech stocks under pressure as Oracle ( ORCL ) slid.\nThe Nasdaq Composite ( ^IXIC ) sank about 1.8%, as the tech-led sell-off accelerated into the close. The S&P 500 ( ^GSPC ) fell over 1%, as tech weakness returned emphatically. The Dow Jones Industrial Average ( ^DJI ) lost around 0.5%, after US stocks finished mixed in Tuesday's session .\n\nAI trade worries rattled tech stocks again following a Financial Times report that Oracle's $10 billion data center project has lost the backing of private lender Blue Owl Capital. It comes amid scrutiny of increasing use of debt and off-balance-sheet moves to fund tech companies' capital spending on AI infrastructure, despite persistent questions over demand for the tech.\n\nOracle shares fell nearly 6%, and megacap tech stocks followed. Nvidia ( NVDA ) lost almost 4%, Broadcom ( AVGO ) sank over 4%, and Google ( GOOG ) was down over 3%.\nTech's bruising intensifies the spotlight on Micron Technology's ( MU ) quarterly results, due after the bell on Wednesday. Its report should help paint a clearer picture of demand on the AI semiconductor side of the market, as the company supplies chips for Nvidia's server systems.\nMeanwhile, weeks in a data vacuum, Wall Street is trying to find a clear signal in a noisy November jobs report to pinpoint a path for interest rates next year. Markets are also waiting for the other data shoe to drop: Thursday's update on consumer inflation in November.\nIn a clue to the path ahead, Fed governor Chris Waller said Wednesday that the central bank still has scope to cut rates, hinting at \"50 to 100 basis points\" of room.\nElsewhere in corporates, Netflix ( NFLX ) stock rose after Warner Bros. Discovery's ( WBD ) board called on shareholders to reject a rival bid from Paramount Skydance ( PSKY ), questioning funding guarantees.\nLIVE 22 updates\n8 mins ago Ines Ferré\n\nStock sink over AI worries Stocks were hit on Wednesday as concerns over funding in AI weighed on the tech sector.\nThe Nasdaq Composite ( ^IXIC ) dropped more than 1.8% while the S&P 500 ( ^GSPC ) slid 1%. The Dow Jones Industrial Average ( ^DJI ) lost 0.4%.\nOracle ( ORCL ) shares led tech lower after an FT report indicated the company's $10 billion data center project has lost the backing of private lender Blue Owl Capital. The stock is down more than 40% from its peak in September.\nInvestors will turn their focus to Micron Technology's ( MU ) quarterly results, which are due after the bell, as well as the November Consumer Price Index report scheduled for Thursday.\n\nInvestors flocked to safe-haven metals. Gold ( GC=F ) neared a record high, extending its year-to-date gains to above 60%.\nMeanwhile, silver ( SI=F ) jumped 5% to trade above $66 per ounce.\n\n40 mins ago Ines Ferré\n\nTesla's car business is only worth $30 a share, analyst warns Yahoo Finance's Francisco Velasquez reports:\nTesla ( TSLA ) is currently trading like a futuristic AI powerhouse, thanks to a recent robotaxi win . But a closer look suggests its core business of building and selling EVs is only worth a fraction of its market cap.\n\"Tesla is being viewed more and more on autonomy and energy,\" Jed Dorsheimer, group head of energy research at William Blair, told Yahoo Finance's Opening Bid.\n\nOn Wednesday shares of the EV giant retreated after closing at a record high.\nRead more here.\n\nToday at 8:01 PM UTC Ines Ferré\n\nGold climbs near record while silver squeeze sends precious metal skyrocketing The price of precious metals jumped on Wednesday as the broader markets sank.\nGold ( GC=F ) neared a record high, extending its year-to-date gains to more than 60%.\nMeanwhile, silver ( SI=F ) jumped 5% on Wednesday, touching new highs amid what appeared to be a short squeeze, as traders who had bet on falling prices were forced to cover their positions, driving prices higher.\n\nToday at 7:15 PM UTC Ines Ferré\n\nBitcoin hovers at $86,000 as token faces 'lackluster' end of 2025 Bitcoin ( BTC-USD ) hovered near $86,000 on Wednesday as Wall Street remained wary of a meaningful rebound heading into the end of the year.\nRecent jitters over AI-related stocks and speculation over who will take over Fed Chair Jerome Powell's position next year may be keeping a lid on prices.\n\"For a while, the market was convinced that ultra-dove Kevin Hassett was a shoo-in for the next Fed Chair role, but now Kevin Warsh — a far more hawkish candidate — appears to be emerging as the frontrunner,\" Coin Bureau investment analyst and co-founder Nic Puckrin said.\n\nRead more here.\n\nToday at 6:45 PM UTC Grace O'Donnell\n\nGE Vernova stock pulls back after Oracle data center snafu casts doubts on AI boom GE Vernova ( GEV ) stock was one of the AI-related plays getting crushed in the wake of Oracle's ( ORCL ) nearly 5% slide on Wednesday.\nShares of the energy infrastructure company, which spun off from General Electric ( GE ) in 2024, dropped nearly 8% in midday trading as valuation concerns came to the forefront. Year to date, GE Vernova stock has run up 93%, inclusive of a 15% gain last Wednesday, after the company announced plans to roll out a fuel cell business for data centers at its investor day.\n\nGE Vernova has been seen as a beneficiary of the AI infrastructure build-out, as demand for energy transmission and grid integration is booming. According to RBC analyst Christopher Dendrinos, GE Vernova's electrification backlog has grown 4x since 2022 and is projected to double again by 2028.\nBut news that private lender Blue Owl Capital ( OWL ) will not back a $10 billion deal for Oracle's data center threw funding for that build-out into greater scrutiny on Wednesday.\nStill, GE Vernova CEO Scott Strazik emphasized in an interview last week that the company has \"a lot of other drivers\" of demand. Strazik said that only 10% of the company's current backlog comes from hyperscalers, which could grow to approximately one-third of the backlog over the next three years.\n\nToday at 6:06 PM UTC Grace O'Donnell\n\nMedline stock begins trading above $35 per share Medline ( MDLN ) shares began trading on Wednesday afternoon at $35 each. The stock popped over 26% above the expected IPO price of $29.\nEarly trading gave the company, which makes gauze, hospital beds, and a host of other medical supplies, a market capitalization of $28.65 billion, according to Yahoo Finance data.\nRead more here.\n\nToday at 5:15 PM UTC Laura Bratton\n\nThe stock market is being powered by 10 stocks that are fueling AI bubble fears Yahoo Finance's Brian Sozzi writes:\nRead the full story here.\n\nToday at 4:30 PM UTC Laura Bratton\n\nFed's Waller favors more rate cuts next year Yahoo Finance's Jennifer Schonberger reports:\nRead more here.\n\nToday at 3:44 PM UTC Laura Bratton\n\nAI chip stocks sink as tech names come under pressure The tech-heavy Nasdaq Composite ( ^IXIC ) led a partial market downturn as stocks diverged on Wednesday.\nAI chip names fell across the board, with Google ( GOOG ) TPU supplier Broadcom ( AVGO ) sinking 3% and Nvidia ( NVDA ) dropping 2%. AI chipmaking machine producer ASML ( ASML ) also shed 3%, while contract semiconductor manufacturer TSMC ( TSM ) dropped nearly 2% and Nvidia rival Advanced Micro Devices ( AMD ) edged down just over 1%,\n\nToday at 3:35 PM UTC Myles Udland\n\nMedline raises $6.3 billion in year's biggest IPO The biggest IPO of 2025 is getting in just before the finish line.\nMedical supply giant Medline ( MDLN ) said late Tuesday that it had raised $6.26 billion in its IPO, selling a little over 216 million shares at $29 a piece, with the stock set to begin trading on Wednesday. The IPO values Medline at upwards of $50 billion, based on a total of roughly 1.8 billion Class A and Class B shares outstanding.\nThe deal caps the best year for the IPO market since 2021 , with Wall Street's outlook for deals and new issues even more optimistic heading into 2026 .\nRecent reports have indicated that SpaceX is likely to go public in 2026 , with the company having recently struck a deal for insiders to sell stock in Elon Musk's rocketry and satellite business that valued the company at $800 billion.\nMajor AI players like OpenAI and Anthropic are also expected to explore going public within the next 18 months, according to The Information . Database giant Databricks, which raised money at a $134 billion valuation this week, said it could explore a public offering as soon as next year.\n\nToday at 3:02 PM UTC Laura Bratton\n\nOracle drops on debt concerns Oracle ( ORCL ) shares fell nearly 4% Wednesday after the Financial Times reported that private lender Blue Owl Capital will not back a $10 billion deal for its next data center as the burgeoning AI cloud player rushes to secure computing capacity and investors scrutinize its mounting use of debt to do so.\n\nThe decline put Oracle shares down nearly 18% for the month. The stock fell after the company's earnings last week showed its costs rising more than expected while bleeding more cash than anticipated. The tech firm's $248 billion in off-balance sheet lease obligations revealed in its quarterly SEC filing added to investor fears over its growing debt pile, while its over-reliance on OpenAI to meet its ambitious revenue targets has also sent shareholders backpedaling.\nThough Oracle execs said after its earnings results that it's committed to maintaining an investment-grade credit rating — it currently has a BBB rating on its bonds — investors haven't been so sure, piling into Oracle credit default swaps that saw spreads reach their highest level since 2009 last week.\n\nToday at 2:45 PM UTC\n\nStocks rise at the open Stocks rose briefly at the market open as Wall Street weighed the latest jobs data and oil surged, while Oracle ( ORCL ) shares slid.\nThe S&P 500 ( ^GSPC ) and the tech-heavy Nasdaq Composite ( ^IXIC ) moved up nearly 0.2%. The Dow Jones Industrial Average ( ^DJI ) added 0.3% after US stocks finished mixed in Tuesday's session .\n\nToday at 2:05 PM UTC Grace O'Donnell\n\nGeneral Mills stock rises as revenue tops estimates, guidance reaffirmed General Mills stock ( GIS ) climbed about 1% in premarket trading after earnings missed estimates, but revenue came in better than expected for the quarter.\nThe Cheerios maker reported fiscal second quarter earnings per share of $0.78 on revenue of $4.86 billion. Wall Street analysts estimated earnings of $1.04 on revenue of $4.78 billion, according to S&P Global Market Intelligence.\nGeneral Mills' efforts to invest in its brands, divest its North American yogurt business, and unfavorable trade comparisons weighed on the results, the company said.\nFor the full fiscal year, which ends in May, General Mills reaffirmed it expects net sales growth to range from a decline of 1% to an increase of 1%. Adjusted operating profit and adjusted diluted EPS are both expected to fall 10% to 15% for the year.\nGeneral Mills' guidance was largely in line with analysts' expectations. Although many on the Street believe the packaged foods company is facing some challenges, analysts noted that these challenges are already reflected in the stock price.\n\"Underlying fundamentals remain challenging, but we think many are of the view that this is largely reflected in Street estimates and with shares trading at a discount to PF peers on a historical basis and no major surprises expected for the print itself, many find it difficult to see how the stock could trade lower,\" UBS analysts wrote in a note ahead of the results.\n\nToday at 1:30 PM UTC Brett LoGiurato\n\nHut 8 shares surge as ex-bitcoin miner signs $7 billion AI data center lease Reuters reports :\n\nRead more here .\n\nToday at 1:00 PM UTC\n\nAmerica's biggest banks are ending 2025 on top with big growth goals and markets 'wide open' Bank of America ( BAC ), JPMorgan Chase ( JPM ), Wells Fargo ( WFC ), and Citigroup ( C ) are setting ambitious plans for growth in 2026 as they wrap up an upbeat 2025.\nYahoo Finance's David Hollerith reports:\n\nRead more here .\n\nToday at 12:33 PM UTC Karen Friar\n\nWarner Bros Discovery board urges shareholders to reject rival bid from Paramount The contest for Warner Bros. Discovery ( WBD ) took a fresh twist as the Hollywood giant's board urged shareholders to reject Paramount Skydance's ( PSKY ) $108.4 billion offer, saying it was \"inferior\" to the current merger deal with Netflix ( NFLX ).\nShares of WBD and Paramount traded 1.6% and 1.8% lower, respectively, while Netflix stock rose 1.3% before the bell.\n\nReuters reports:\n\nRead more here .\n\nToday at 12:30 PM UTC Karen Friar\n\nTesla's Robotaxi progress gives investors proof of the AI dream Yahoo Finance's Hamza Shaban reports:\n\nRead more here in the takeaway from today's Morning Brief.\n\nToday at 11:15 AM UTC Jenny McCall\n\nGood morning. Here's what's happening today. Economic data: MBA mortgage applications (week ended Dec. 12)\nEarnings calendar: Micron Technology ( MU )\nHere are some of the biggest stories you may have missed overnight and early this morning:\nAmerica's biggest banks shoot for an even better 2026\nWarner Bros Discovery board rejects rival bid from Paramount US readies new Russia sanctions if Putin rejects peace deal\nTrump orders blockade of oil tankers off Venezuela\nOil climbs after Trump orders Venezuela blockade\nSpaceX said to notify employees of quiet period ahead of IPO\nChina stocks stage sudden rally as tech enthusiasm roars back\nEV transition unravels slowly — then all at once\nKushner's Affinity withdraws from Warner Bros. takeover battle\nWaymo in talks to raise funds at over $100B valuation: Report\n\nToday at 10:54 AM UTC Karen Friar\n\nAmazon said to be in talks to invest about $10 billion in OpenAI Shares in Amazon ( AMZN ) ticked up in premarket after Reuters reported that it is eyeing a $10 billion investment in OpenAI ( OPAI.PVT ), citing a source familiar with the matter.\nThe potential deal, which could value the ChatGPT maker at over $500 billion, comes as some on Wall Street question the circularity of investments in AI providers and Big Tech.\nReuters reports:\n\nRead more here .\n\nToday at 10:10 AM UTC Jenny McCall\n\nPremarket trending tickers: Lennar, Brent futures and Micron Homebuilder Lennar ( LEN ) stock fell more than 3% before the bell on Wednesday after reporting a drop in its fourth quarter profit. The housing market has been very precarious over the last 12 months, as consumers have continued to be hindered by affordability concerns.\n\nBrent crude futures ( BZ=F ) rose 2% and traded just below $60 a barrel on Wednesday after Present Trump ramped up pressure on Venezuela by ordering a blockade of sanctioned tankers.\nMicron ( MU ) stock rose 3% before the bell on Wednesday. The chipmaker is due to report its first quarter financial report after the bell today.\n\nToday at 9:31 AM UTC Karen Friar\n\nOil gains after Trump orders blockade of tankers off Venezuela Bloomberg reports:\n\nRead more here .\n\nToday at 8:11 AM UTC Karen Friar\n\nBitcoin fatigue sets in as it heads for fourth annual loss Bloomberg reports:\nBitcoin ( BTC-USD ) is headed for the fourth annual decline in its history, and the first one that didn’t coincide with a major scandal or industry meltdown.\nThe latest leg down came Monday, with a sharp sell-off that sent the original cryptocurrency falling as much as 3.7% during New York hours. Bitcoin is now about 7% lower for the year. It was trading at about $87,100 at noon in Singapore on Wednesday.\n\nWhile the latest decline is a much milder correction than in the previous three down years, it’s happened against a vastly different backdrop. Since the last major crypto crash in 2022, institutional adoption has widened, regulation has matured, and the industry has found its arguably most important champion in US President Donald Trump.\nThe rapid lurch lower since bitcoin hit a record of over $126,000 in early October has confounded bulls and left cryptoassets struggling to find a footing. Volumes are low, investors are bailing on bitcoin ETFs and derivatives markets are showing a lack of appetite for betting on a rebound. Even massive buying from the dominant bitcoin whale — Michael Saylor’s Strategy Inc. ( MSTR ) — hasn’t been enough to turn things around.\n“Most are surprised by the lack of follow-through despite so many positive catalysts,” said Pratik Kala, a portfolio manager at hedge fund Apollo Crypto.\nRead more here .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "04:44:49",
      "Source": "Investor's Business Daily",
      "Title": "Stock Market Today: Tech Rout Drives Indexes Below Crucial Lines; Reddit Rides Higher (Live Coverage)",
      "URL": "https://finance.yahoo.com/m/08034984-b2ec-32ee-b4d6-81730f186925/stock-market-today%3A-tech-rout.html",
      "Content": "Stock Market Today: Tech Rout Drives Indexes Below Crucial Lines; Reddit Rides Higher (Live Coverage)\n\nSCOTT LEHTONEN and CARLA MOZEE\nWed, December 17, 2025 at 12:44 PM PST 6 min read\n\nIn this article: ORCL\n\nTSLA\n\n^GSPC\n\n^IXIC\n\n^DJI\n\nStock Market Today: The Dow Jones index rose Wednesday after the indexes dropped Tuesday. Tesla stock wavered.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "04:40:41",
      "Source": "StockStory",
      "Title": "Why Alphabet (GOOGL) Shares Are Falling Today",
      "URL": "https://finance.yahoo.com/news/why-alphabet-googl-shares-falling-204041616.html",
      "Content": "Why Alphabet (GOOGL) Shares Are Falling Today\n\nJabin Bastian\nWed, December 17, 2025 at 12:40 PM PST 2 min read\n\nIn this article: GOOG\n\nORCL\n\nNVDA\n\nAVGO\n\nWhat Happened? Shares of online advertising giant Alphabet (NASDAQ:GOOGL) fell 3.1% in the afternoon session after reports surfaced about a lack of financing for a major Michigan data center, which dragged down several large-cap AI-related stocks.\nThe news specifically impacted Oracle, Nvidia, Broadcom, and Alphabet, as reports indicated a major partner refused to back a plan to build a $10 billion data center. This development triggered a sell-off among these tech giants, weighing on the broader indexes even as many smaller companies saw gains. The move occurred amid wider concerns about the technology sector, with some economists highlighting a slowdown in hiring within the industry. On the day of the decline, the communication services and technology sectors were the market's worst performers.\n\nThe stock market overreacts to news, and big price drops can present good opportunties to buy high-quality stocks. Is now the time to buy Alphabet? Access our full analysis report here .\nWhat Is The Market Telling Us Alphabet’s shares are not very volatile and have only had 5 moves greater than 5% over the last year. In that context, today’s move indicates the market considers this news meaningful, although it might not be something that would fundamentally change its perception of the business.\nThe previous big move we wrote about was 6 days ago when the stock dropped 2.6% on the news that reports surfaced that its Google unit was expected to be fined by EU antitrust regulators for favoring its own services, contributing to a broader tech sector downturn.\n\nThe potential penalty stemmed from charges that Google did not do enough to comply with the Digital Markets Act, which can lead to fines of up to 10% of a company's global annual turnover.\nAdding to the regulatory headwinds, the European Commission also launched a separate investigation into whether Google improperly used other publishers' content for its AI purposes. The negative news was compounded by a wider market retreat from technology stocks. The sell-off was triggered after Oracle, seen as a key indicator for AI investment, reported cloud sales that missed estimates, sparking concerns across the industry about the high cost and uncertain returns of AI infrastructure spending. This sentiment pulled down most major tech stocks.\nAlphabet is up 57% since the beginning of the year, and at $297.36 per share, it is trading close to its 52-week high of $323.44 from November 2025. Investors who bought $1,000 worth of Alphabet’s shares 5 years ago would now be looking at an investment worth $3,417.\nWhile Wall Street chases Nvidia at all-time highs, an under-the-radar semiconductor supplier is dominating a critical AI component these giants can’t build without. Click here to access our full research report .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "04:23:39",
      "Source": "The Telegraph",
      "Title": "AI stocks slide as $10bn data centre funding falls through",
      "URL": "https://finance.yahoo.com/m/7ed9aa5f-a825-3289-9112-f802f939d4c3/ai-stocks-slide-as-%2410bn-data.html",
      "Content": "AI stocks slide as $10bn data centre funding falls through\n\nNora Redmond\nWed, December 17, 2025 at 12:23 PM PST 2 min read\n\nIn this article: ORCL\n\nAVGO\n\n^IXIC\n\nOWL\n\nRenewed fears about a bubble in artificial intelligence (AI) have triggered a slump in tech stocks on Wall Street.\nAI-linked stocks fell in the US after news broke that the software giant Oracle had lost a key backer of its $10bn data centre project.\nShares in Oracle slid almost 5pc after the Financial Times revealed that the asset manager Blue Owl Capital, the biggest backer of its data centres in the US, had pulled out of funding a new data centre in Michigan.\n\nThe tech-heavy Nasdaq Composite declined 1.1pc in the wake of the report. The sell-off mirrors last week, when tumbles in the value of shares at Oracle and the semiconductor maker Broadcom both dragged down the wider stock market.\nOn Wednesday, shares in Broadcom fell 5.5pc as investors continued to worry that the company was running out of momentum, despite recently beating analyst expectations on earnings and sales.\nShares in the chipmaker Nvidia edged down more than 3pc and Alphabet, the owner of Google, fell close to 3pc.\nGrowing AI bubble fears Investors continue to be concerned that AI companies are overvalued, amid fears that the huge amounts of cash pouring into data centres may fail to pay off.\nGoldman Sachs analysts wrote in a recent note: “We expect increasing investor scrutiny around monetisation, underlying value creation and returns from AI spending.\n\n“We believe there will be increased focus on the financial health of AI model builders, which are becoming an increasing portion of overall revenue share for the chip designers we cover.”\nShares in Oracle, which makes database software and is owned by the billionaire Larry Ellison , are now down about 14pc in the past six months.\nThe Blue Owl Capital setback marks the second blow for Mr Ellison on Wednesday. Earlier, the board of Warner Bros Discovery rejected Paramount Skydance’s $108.4bn (£81bn) takeover bid . Paramount is controlled by the Ellison family.\nWall Street’s two other major stock markets also fell, although not to the same extent as the Nasdaq. The benchmark S&P 500 was down 0.8pc in the early afternoon New York time and the Dow Jones Industrial Average slipped 0.3pc.\n\nVenu Krishna, of Barclays, wrote in a note on Wednesday: “Big Tech remains the dominant driver of US equity performance, underpinned by unprecedented levels of AI-related capital expenditure from hyperscalers, as compute demand continues to outpace supply.”\nMr Krishna added that the top 10 stocks now accounted for about a third of S&P 500 earnings and commanded more than 40pc of total market capitalisation, which are levels not seen since at least 1980.\nTry full access to The Telegraph free today. Unlock their award-winning website and essential news app, plus useful tools and expert guides for your money, health and holidays.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "03:54:09",
      "Source": "Benzinga",
      "Title": "ChatGPT Thinks Broadcom Stock Will Close At This Price By The End of 2025",
      "URL": "https://finance.yahoo.com/news/chatgpt-thinks-broadcom-stock-close-195409270.html",
      "Content": "ChatGPT Thinks Broadcom Stock Will Close At This Price By The End of 2025\n\nRyan Peterson\nWed, December 17, 2025 at 11:54 AM PST 2 min read\n\nIn this article: AVGO\n\nOPAI.PVT\n\nBenzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\nShares of Broadcom have moved lower in recent weeks as investors weigh broader tech-market volatility against ongoing demand for AI networking chips and custom accelerators. The story right now is less about slowing growth and more about how the market is factoring in Broadcom's institutional investor backing, VMware integration, and steady cash flow profile.\n\nAgainst that backdrop, we ran Broadcom through an AI price-prediction agent powered by OpenAI's GPT. The goal wasn't to project a sensational multi-year target, but to provide a short, data-driven outlook capturing where price, technical momentum, and the current narrative intersect.\nWhat the AI model is actually predicting The agent was fed recent price action and a focused set of inputs to produce a short-term outlook. At the time of the run, Broadcom traded at $339.81. For the period from Dec. 16 through Jan. 5, the model's base-case projection came out to:\nAverage predicted price: $347.50\nImplied move: roughly +2.26% into early January\nSignal snapshot: MACD drops sharply, and RSI also drops sharply, signaling waning momentum and short-term selling pressure\n\nIn plain terms, the AI sees Broadcom's path as modestly higher, but with notable volatility, reflecting a market reconciling strong fundamentals with technical weakness. Broadcom remains a slower-moving but institutionally heavy beneficiary of the AI boom, especially in networking chips and custom accelerators for hyperscalers. That positioning supports a slightly bullish drift despite the sharp pullback in technical indicators.\nThe company's VMware integration story continues to underpin its software-adjacent revenue, which, alongside semiconductor sales, bolsters free cash flow and cushions the stock against broader tech market swings. Analysts continue to note Broadcom's ability to generate predictable cash flows while participating in AI-driven growth sectors, making it a defensive growth play relative to more volatile peers.\n\nDecember's price action reflects this duality. While MACD and RSI indicate sharp downward moves, suggesting short-term selling and momentum fade, the company's fundamentals, strong AI-related product demand, and institutional ownership suggest that the declines may be more technical than structural.\nThink of this AI outlook as a short-term temperature check. The model isn't issuing a long-term verdict on Broadcom's role in the AI sector, nor on the ultimate impact of VMware integration. Instead, it estimates how the market may behave over the next few weeks as investors digest ongoing demand for AI networking chips, custom accelerators, and steady institutional cash flow. For traders, it's a reminder that near-term moves will likely be driven by technical shifts and sector rotation, while longer-term investors can remain focused on Broadcom's durable fundamentals.\n\nStory Continues\nImage: Shutterstock\nThis article ChatGPT Thinks Broadcom Stock Will Close At This Price By The End of 2025 originally appeared on Benzinga.com\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "03:31:51",
      "Source": "Investor's Business Daily",
      "Title": "Stock Market Today: Nasdaq, S&P Drop As AI Trade Stumbles; Medical Supply IPO Soars (Live Coverage)",
      "URL": "https://finance.yahoo.com/m/08034984-b2ec-32ee-b4d6-81730f186925/stock-market-today%3A-nasdaq%2C.html",
      "Content": "Stock Market Today: Nasdaq, S&P Drop As AI Trade Stumbles; Medical Supply IPO Soars (Live Coverage)\n\nSCOTT LEHTONEN and CARLA MOZEE\nWed, December 17, 2025 at 11:31 AM PST 6 min read\n\nIn this article: ORCL\n\nTSLA\n\n^IXIC\n\nCAT\n\n^GSPC\n\nStock Market Today: The Dow Jones index rose Wednesday after the indexes dropped Tuesday. Tesla stock wavered.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "03:14:15",
      "Source": "MT Newswires",
      "Title": "Technology Sell-Off Pushes US Equity Indexes Lower",
      "URL": "https://finance.yahoo.com/news/technology-sell-off-pushes-us-191415673.html",
      "Content": "PREMIUM\nTechnology Sell-Off Pushes US Equity Indexes Lower\n\nMT Newswires\nWed, December 17, 2025 at 11:14 AM PST 2 min read\n\nIn this article: ORCL\n\n^IXIC\n\nIVZ\n\n^GSPC\n\n^DJI\n\nUS equity indexes declined after midday on Wednesday as the Nasdaq Composite dropped amid a sell-off\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "03:13:00",
      "Source": "The Wall Street Journal",
      "Title": "Major U.S. Stock Indexes Fall; Oil Prices Gain After Trump Pressures Venezuela",
      "URL": "https://finance.yahoo.com/m/48d4a891-0b99-3e06-8437-3dbf2b0e95c1/major-u.s.-stock-indexes.html",
      "Content": "Major U.S. Stock Indexes Fall; Oil Prices Gain After Trump Pressures Venezuela\n\nAngus Berwick\nWed, December 17, 2025 at 11:13 AM PST 1 min read\n\nIn this article: CL=F\n\nXOM\n\nBP\n\nSHEL\n\n^IXIC\n\nOil prices rose after President Trump ramped up pressure on Venezuela, ordering a blockade of sanctioned tankers entering and exiting the country.\nBrent crude futures moved higher toward $60 a barrel, after skidding Tuesday. Shares of energy companies, including Exxon Mobil, BP and Shell, rallied.\nMost Read from The Wall Street Journal U.S. Tanker Seizure Has Paralyzed Venezuelan Oil Shipping—Except Chevron’s\nSpooked by AI and Layoffs, White-Collar Workers See Their Security Slip Away\nPanama Ports Deal Hits Impasse as China Makes New Demands for Its Approval\nPepsi Worked to Keep Prices Higher at Retailers to Protect Walmart, FTC Found\nU.S. Unemployment Rose in November ​Despite Job Gains\n\nThe Nasdaq composite lost ground Wednesday, falling more than 1% with Nvidia, Broadcom and Oracle all down on the day. The Dow industrials surrendered early gains, dragged down by a slide in shares of Caterpillar.\nWarner Bros. Discovery rejected an unsolicited bid from Paramount, saying it believes a planned deal with Netflix is still superior. Paramount and Warner shares both fell, while Netflix gained.\nShares of Medline, a medical-supplies manufacturer and distributor, rose more than 20% in their trading debut Wednesday after the company raised $6.26 billion in the largest U.S. IPO since 2021.\nThe dollar strengthened against a range of currencies. The British pound fell after data showed U.K. inflation slowed to an eight-month low, making a Thursday rate cut all but certain.\n\nIn other markets:\nGlobal markets largely advanced . China’s Shanghai composite and Hang Seng Index both rose about 1%, boosted by AI stocks. The FTSE 100 rose 1.5%, bolstered by energy and bank stocks.\nSilver futures rallied to another record intraday high. Gold prices also gained.\nWrite to Angus Berwick at angus.berwick@wsj.com\nMost Read from The Wall Street Journal Warner Preparing to Tell Shareholders to Reject Paramount Offer\nThe Factory Workers Who Build the Power Grid by Hand\nBlackstone Leads $400 Million Investment in Cyber Startup Cyera\nCalifornia Gives Tesla 90 Days to Change Autopilot Advertising\nBitcoin Keeps Sliding, and the True Believers Keep Buying\n\nCondizioni e Informativa sulla privacy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "03:07:25",
      "Source": "MT Newswires",
      "Title": "Equity Markets Fall Intraday as Tech Sector Slides",
      "URL": "https://finance.yahoo.com/news/equity-markets-fall-intraday-tech-190725283.html",
      "Content": "PREMIUM\nEquity Markets Fall Intraday as Tech Sector Slides\n\nMT Newswires\nWed, December 17, 2025 at 11:07 AM PST 2 min read\n\nIn this article: ^GSPC\n\nORCL\n\n^DJI\n\n^IXIC\n\nAAPL\n\nUS benchmark equity indexes were lower intraday amid a notable decline in the technology sector, whi\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "02:56:49",
      "Source": "Barrons.com",
      "Title": "Gold Hits Record as Bitcoin, AI Stocks Slide",
      "URL": "https://finance.yahoo.com/m/e40d72ff-8af5-34d7-aaca-ce6f225187aa/gold-hits-record-as-bitcoin%2C.html",
      "Content": "Gold Hits Record as Bitcoin, AI Stocks Slide\n\nConnor Smith\nWed, December 17, 2025 at 10:56 AM PST 1 min read\n\nIn this article: GC=F\n\nBTC-USD\n\n^GSPC\n\nCEG\n\nORCL\n\nThe price of gold rallied to a record on Wednesday, as Wall Street was in no mood for risk-taking. Front-month gold settled at $4,347.50 an ounce, which is its first record settlement since Oct. 20, according to Dow Jones Market Data.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "02:20:57",
      "Source": "Investor's Business Daily",
      "Title": "Chip Leader Rides AI Boom Wave; Stock Vaults 62%",
      "URL": "https://finance.yahoo.com/m/944b539d-a87b-3e93-bcd3-fd9ff7a0973f/chip-leader-rides-ai-boom.html",
      "Content": "Chip Leader Rides AI Boom Wave; Stock Vaults 62%\n\nVIDYA RAMAKRISHNAN\nWed, December 17, 2025 at 10:20 AM PST 2 min read\n\nIn this article: AVGO\n\nNVMI\n\nNVDA\n\nChip designers like Nvidia and Broadcom have led the artificial intelligence rally in 2024 and 2025. Nova stock is Wednesday's choice for IBD 50 Stocks To Watch. Nova is a chip process control tools provider.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "02:00:42",
      "Source": "StockStory",
      "Title": "Broadcom (AVGO) Stock Trades Down, Here Is Why",
      "URL": "https://finance.yahoo.com/news/broadcom-avgo-stock-trades-down-180042096.html",
      "Content": "Broadcom (AVGO) Stock Trades Down, Here Is Why\n\nRadek Strnad\nWed, December 17, 2025 at 10:00 AM PST 2 min read\n\nIn this article: AVGO\n\nWhat Happened? Shares of fabless chip and software maker Broadcom (NASDAQ:AVGO) fell 5.4% in the afternoon session after it continued a multi-day slide as management warned that its fast-growing artificial intelligence (AI) business would negatively impact gross profit margins.\nThe drop extended a steep decline that began after the company's recent earnings update. During the update, management indicated that increasing sales of custom AI processors, which have lower margins, would reduce the company's overall gross margins in the upcoming quarter.\n\nThis guidance alarmed investors, who feared that the profitable AI surge might not be as lucrative as Broadcom's traditional software business. The continued selling pressure capped a multi-day slide that was reportedly the stock's worst in several years.\nThe stock market overreacts to news, and big price drops can present good opportunties to buy high-quality stocks. Is now the time to buy Broadcom? Access our full analysis report here .\nWhat Is The Market Telling Us Broadcom’s shares are very volatile and have had 25 moves greater than 5% over the last year. In that context, today’s move indicates the market considers this news meaningful but not something that would fundamentally change its perception of the business.\nThe previous big move we wrote about was 5 days ago when the stock dropped 10.7% as investors locked in some profits amid margin anxiety as the company reported a top-and-bottom-line earnings beat.\n\nWhile revenue jumped 28% and AI sales surged 74%, management guided for gross margins to fall by ~100 basis points sequentially. This fueled a bearish view: the company's booming AI hardware business is structurally less profitable than its legacy software segments, causing \"margin dilution\" as it grows. The sell-off was deepened by Oracle's contagion.\nEarlier in the week, Oracle spooked the market with massive capital expenditure hikes, signaling that AI infrastructure is becoming exorbitantly expensive to build. When Broadcom CEO Hock Tan added that 2026 AI demand was \"hard to pinpoint,\" it shattered the perfection priced into the stock. After a 75% rally during the year, investors seized this moment to lock in profits, fearing that AI growth is becoming costly and opaque.\n\nBroadcom is up 39.3% since the beginning of the year, but at $323.13 per share, it is still trading 21.8% below its 52-week high of $412.97 from December 2025. Investors who bought $1,000 worth of Broadcom’s shares 5 years ago would now be looking at an investment worth $7,586.\nMicrosoft, Alphabet, Coca-Cola, Monster Beverage—all began as under-the-radar growth stories riding a massive trend. We’ve identified the next one: a profitable AI semiconductor play Wall Street is still overlooking. Go here for access to our full report .\n\nAGB und Datenschutzerklärung\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "01:59:28",
      "Source": "Investor's Business Daily",
      "Title": "Stock Market Today: Dow Slips As Nasdaq Struggles; Oracle Hit, Salesforce Up (Live Coverage)",
      "URL": "https://finance.yahoo.com/m/08034984-b2ec-32ee-b4d6-81730f186925/stock-market-today%3A-dow-slips.html",
      "Content": "Stock Market Today: Dow Slips As Nasdaq Struggles; Oracle Hit, Salesforce Up (Live Coverage)\n\nSCOTT LEHTONEN and CARLA MOZEE\nWed, December 17, 2025 at 9:59 AM PST 5 min read\n\nIn this article: CRM\n\n^DJI\n\nORCL\n\nCAT\n\n^GSPC\n\nStock Market Today: The Dow Jones index rose Wednesday after the indexes dropped Tuesday. Tesla stock wavered.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "01:50:07",
      "Source": "TheStreet",
      "Title": "Stock Market Today: Oracle Credit Controversy Causes Tech Selloff, Sending Nasdaq and Russell 2000 Spiraling",
      "URL": "https://finance.yahoo.com/m/c1785135-d4b3-382f-9e4f-56f55f71fc61/stock-market-today%3A-oracle.html",
      "Content": "Stock Market Today: Oracle Credit Controversy Causes Tech Selloff, Sending Nasdaq and Russell 2000 Spiraling\n\nNoah Weidner\nWed, December 17, 2025 at 9:50 AM PST 6 min read\n\nIn this article: ^DJI\n\n^IXIC\n\nORCL\n\nAVGO\n\nAMD\n\nT his live blog is refreshed periodically throughout the day with the latest updates from the market. To find the latest Stock Market Today threads, click here .\nHappy Wednesday. This is TheStreet’s Stock Market Today for Dec. 17, 2025. You can follow the latest updates on the market here in our daily live blog.\n\nUpdate 1:20 p.m ET Midday Movers Now that the midday fireworks are in the rear view, all four U.S. market indexes are facing steeper declines -- near day lows.\nThe Russell 2000 (-1.26%) is down amid sluggishness in the industrial, technology, and communication services sector today.\nThe same is at least partially true for the Nasdaq (-1.23%) and S&P 500 (-0.83%), which are facing a similar downturn as the Oracle (-4.8%) drama permeates throughout the market, weighing on shares of other semiconductor names such as Broadcom (-5.3%), Advanced Micro Devices (-3.8%), and Nvidia (-3%).\n\nToday, the Dow (-0.39%) is making the best case today. Half of the index is in the red, the other half is in the red.\nIn total, 53.8% (2,992) of U.S. issues are in decline today against 42.8% (2,379) advancing, which brings us to our midday mover list for today. We'll take a look at the top and bottom 20 equities in the market among firms with at least a $2 billion market cap :\nWinners Despite it being a bad day for AI , today's top stock is an AI-fueled biotech play called Recursion Pharmaceuticals (+17.8%), who we haven't seen atop the list in quite awhile. A one-time retail favorite, the company was upgraded by JPMorgan today, which moved it from 'neutral' to 'overweight' citing the potential of its MEK inhibitor clinical trial.\nFollowing close behind is Hut 8 (+12.5%), Anbio (+10.6%), and Via Transportation (+8.4%).\nAmong the larger firms making the list today are Elbit Systems (+4.3%), Texas Pacific Land Corporation (+5.6%), and Figma (+4.8%).\nLosers At the other end of the market, EverCommerce (-11.6%) is plummeting on some volatility . It's followed by some AI-related trades, independent power producer Bloom Energy (-10.1%) and Fermi (-9.6%).\nEven larger firms are being weighed down today by the AI jitters, including GE Vernova (-8.2%), Constellation Energy (-7.9%), and Vistra (-7.3%).\nUpdate 10:44 a.m ET More Oracle Drama Weighs on Tech Stocks Oracle is once again making itself the main character in the AI boom -- and maybe not in a good way.\nToday, the hyperscaler is declining on a Financial Times report that Blue Owl Capital won't go forward with funding the firm's $10 billion Michigan data center amid worries about \"tougher debt terms and the risk of delays,\" per the article.\n\nStory Continues\nThe news comes just days after sources close to Oracle said it was pushing back key data center deliveries for partner OpenAI , who has committed billions to data center projects. Oracle was made to refute reports that it was not punting on these projects and that all milestones were coming along as planned. Obviously, Blue Owl seems to have sided with the anonymous sources cited in that Bloomberg report.\n\nWhy Does It Matter? Traders have remained relatively flighty about Oracle and ChatGPT creator OpenAI. Oracle counts more than half of its performance obligations from the Sam Altman-helmed company, which remains reliant on capital infusions from venture capital to stay afloat as it burns through money.\nAnd since the latter has not put up the money upfront, the hyperscaler has taken on gobs of debt to bring its data center ambitions to life. An astonishing $25 billion of the firm's $127 billion in debt is due within just three years. And with negative free cash flow -- in fact, -$13 billion -- a modest delay could seriously jeopardize the company's financial prospects.\n\nThe company's Altman Z-Score, a measure which is designed to predict likelihoods of bankruptcy within two years, is in the so-called \"grey area\" already, indicating financial stress.\nA deal with tech giant Meta seemed to help settle some concerns, but the underlying story is still the same: Oracle needs to deliver these projects or there might be trouble.\nWhat Does This Have to Do with WBD? Larry Ellison , the CEO and Co-Founder of Oracle, was seen trying to help finance the acquisition of HBO parent Warner Bros. Discovery ( WBD ).\nLarry's son, David, is the CEO of media company Skydance -- which recently acquired Paramount to become Paramount Skydance.\nHowever, the Ellison Family Trust was seen as a precarious sticking point in the recent negotiations between the media giants, leading WBD to go with Netflix for a proposed takeout. Partially harming matters for the Ellisons were questions about their financing, as well as Oracle's sagging stock.\n\nThat said, counting its decline today, Oracle has now fallen more than 45% from all-time highs.\nUpdate 9:34 a.m ET Opening Bell The U.S. markets are now open. The Russell 2000 (+0.57%) has already reversed yesterday's -0.45% decline from yesterday; it's now just a matter of holding onto those gains for the day.\nIn large caps, the Dow (+0.36%) is also having a solid start to the day. The S&P 500 (+0.12%) and Nasdaq (+0.09%), by contrast, are just up a few basis points at the market open. For the former, a gain today would put an end to a three day skid for the index.\n\nThe 10Y is up 0.8 bips to 4.157%.\nOne of the foreboding themes of the Tuesday trade -- aside from so-so payrolls -- was the large decline in U.S. energy stocks. The S&P Energy sector declined 3% as domestic oil prices approached a nearly four-year low. This morning, the U.S. oil benchmark known as WTI Crude , is trading at $56 -- up about 1.5%.\nToday, the sector is up about 1%, taking a bite of some of yesterday's losses. Financials and materials are also joining in the recovery, up more than half a percentage point.\nJoining in some of that excitement are Natural Gas continuous futures (+2.96% to $4.001) and the international oil benchmark, Brent Crude (+1.46% to $59.78), which is seeing a healthy bump in its continuous futures too.\nBut since it's the holiday season, there might not be a more timely trade than Silver (+3.75% and $65.675) and Gold (+0.81% to $4,367) -- they're up again today, continuing a hefty showing from precious metals in recent trading.\n\nUpdate 7:43 a.m ET A.M. Update Good morning. Futures this morning are currently pointing to modest gains in U.S. equities this morning, potentially offsetting Tuesday's tepid payrolls market reaction.\nEarnings Today: Micron, JBS, General Mills Here are all of the companies with at least a $1 billion market cap which are slated to report today, per Nasdaq:\nEconomic Data + Events Today will be a fairly relaxed day compared with yesterday, which saw the release of the overdue October payrolls alongside November's data. Here is what is on deck for today:\nThis story was originally published by TheStreet on Dec 17, 2025, where it first appeared in the Latest Business & Market News section. Add TheStreet as a Preferred Source by clicking here.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "01:45:54",
      "Source": "MT Newswires",
      "Title": "US Equity Indexes Drop, Treasury Yields Rise in Midday Trading",
      "URL": "https://finance.yahoo.com/news/us-equity-indexes-drop-treasury-174554916.html",
      "Content": "PREMIUM\nUS Equity Indexes Drop, Treasury Yields Rise in Midday Trading\n\nMT Newswires\nWed, December 17, 2025 at 9:45 AM PST 1 min read\n\nIn this article: ORCL\n\n^IXIC\n\nAVGO\n\nOWL\n\n^GSPC\n\nUS equity indexes declined, led by the Nasdaq Composite, amid a jump in volatility and gains in gove\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "01:40:00",
      "Source": "The Wall Street Journal",
      "Title": "Major U.S. Stock Indexes Slip; Oil Rises on Trump Order of Venezuela Blockade",
      "URL": "https://finance.yahoo.com/m/48d4a891-0b99-3e06-8437-3dbf2b0e95c1/major-u.s.-stock-indexes.html",
      "Content": "Major U.S. Stock Indexes Slip; Oil Rises on Trump Order of Venezuela Blockade\n\nAngus Berwick\nWed, December 17, 2025 at 9:40 AM PST 1 min read\n\nIn this article: CL=F\n\nGBP=X\n\nXOM\n\nBP\n\nSHEL\n\nOil prices rose after President Trump ramped up pressure on Venezuela, ordering a blockade of sanctioned tankers entering and exiting the country.\nBrent crude futures moved higher toward $60 a barrel, after skidding Tuesday. Shares of energy companies, including Exxon Mobil, BP and Shell, rallied.\nMost Read from The Wall Street Journal U.S. Tanker Seizure Has Paralyzed Venezuelan Oil Shipping—Except Chevron’s\nSpooked by AI and Layoffs, White-Collar Workers See Their Security Slip Away\nPanama Ports Deal Hits Impasse as China Makes New Demands for Its Approval\nPepsi Worked to Keep Prices Higher at Retailers to Protect Walmart, FTC Found\nWarner Preparing to Tell Shareholders to Reject Paramount Offer\n\nThe Nasdaq composite lost ground Wednesday, falling more than 1% with Nvidia, Broadcom and Oracle all down on the day. The Dow industrials surrendered early gains, dragged down by a slide in shares of Caterpillar.\nWarner Bros. Discovery rejected an unsolicited bid from Paramount, saying it believes a planned deal with Netflix is still superior. Paramount and Warner shares both fell, while Netflix gained.\nThe dollar strengthened against a range of currencies. The British pound fell after data showed U.K. inflation slowed to an eight-month low, making a Thursday rate cut all but certain.\nIn other markets:\n— Global markets largely advanced. China’s Shanghai composite and Hang Seng Index both rose about 1%, boosted by AI stocks. The FTSE 100 rose 1.5%, bolstered by energy and bank stocks.\n— Silver futures rallied to another record intraday high. Gold prices also gained.\nWrite to Angus Berwick at angus.berwick@wsj.com\nMost Read from The Wall Street Journal U.S. Unemployment Rose in November ​Despite Job Gains\nCalifornia Gives Tesla 90 Days to Change Autopilot Advertising\nBlackstone Leads $400 Million Investment in Cyber Startup Cyera\nThe Factory Workers Who Build the Power Grid by Hand\nBitcoin Keeps Sliding, and the True Believers Keep Buying\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "01:30:04",
      "Source": "Barrons.com",
      "Title": "Nasdaq Slides. Why AI Stocks Are Falling Again.",
      "URL": "https://finance.yahoo.com/m/6fe915db-5984-3400-82a0-232baaa3d7a3/nasdaq-slides.-why-ai-stocks.html",
      "Content": "Nasdaq Slides. Why AI Stocks Are Falling Again.\n\nConnor Smith\nWed, December 17, 2025 at 9:30 AM PST 2 min read\n\nIn this article: ^IXIC\n\nSOXX\n\n^DJI\n\nMAGS\n\n^GSPC\n\nThe Nasdaq Composite took a plunge on Wednesday amid a flurry of selling among artificial intelligence and Big Tech stocks. The Dow fell 110 points, or 0.2%, dragged down by Caterpillar and Nvidia. Utility stocks tied to the AI trade like Constellation Energy and Vistra were down more than 5%.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "01:28:35",
      "Source": "Insider Monkey",
      "Title": "Jim Cramer on Broadcom (AVGO): “I Like It”",
      "URL": "https://finance.yahoo.com/news/jim-cramer-broadcom-avgo-172835460.html",
      "Content": "Jim Cramer on Broadcom (AVGO): “I Like It”\n\nSyeda Seirut Javed\nWed, December 17, 2025 at 9:28 AM PST 2 min read\n\nIn this article: AVGO\n\nBroadcom Inc. (NASDAQ: AVGO ) is one of the stocks that Jim Cramer shared his take on . Cramer called the stock a “battleship” during the episode, as he said:\nPhoto by JESHOOTS.COM on Unsplash\nBroadcom Inc. (NASDAQ:AVGO) supplies semiconductor devices and infrastructure software, including networking, connectivity, and storage solutions. The company’s products are used for applications in data centers, telecommunications, broadband, smartphones, industrial systems, and AI networking.\n\nWhile we acknowledge the potential of AVGO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "00:44:20",
      "Source": "Investor's Business Daily",
      "Title": "Stock Market Today: Dow Turns Lower As Nasdaq Loss Deepens; Oracle Tumbles (Live Coverage)",
      "URL": "https://finance.yahoo.com/m/08034984-b2ec-32ee-b4d6-81730f186925/stock-market-today%3A-dow-turns.html",
      "Content": "Stock Market Today: Dow Turns Lower As Nasdaq Loss Deepens; Oracle Tumbles (Live Coverage)\n\nSCOTT LEHTONEN and CARLA MOZEE\nWed, December 17, 2025 at 8:44 AM PST 4 min read\n\nIn this article: ORCL\n\n^DJI\n\nCAT\n\n^GSPC\n\nTSLA\n\nStock Market Today: The Dow Jones index rose Wednesday after the indexes dropped Tuesday. Tesla stock wavered.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "00:34:44",
      "Source": "Barrons.com",
      "Title": "Nasdaq Slides. Tech Stocks Are Falling Again.",
      "URL": "https://finance.yahoo.com/m/6fe915db-5984-3400-82a0-232baaa3d7a3/nasdaq-slides.-tech-stocks.html",
      "Content": "Nasdaq Slides. Tech Stocks Are Falling Again.\n\nConnor Smith\nWed, December 17, 2025 at 8:34 AM PST 2 min read\n\nIn this article: ^IXIC\n\n^GSPC\n\nCAT\n\nNVDA\n\nAVGO\n\nThe Nasdaq Composite took a plunge on Wednesday amid a flurry of selling among artificial intelligence and Big Tech stocks. The Dow fell 110 points, or 0.2%, dragged down by Caterpillar and Nvidia. Utility stocks tied to the AI trade like Constellation Energy and Vistra were down more than 5%.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "00:31:10",
      "Source": "GuruFocus.com",
      "Title": "Micron's Make-or-Break Moment: Can AI Hype Justify a 176% Surge?",
      "URL": "https://finance.yahoo.com/news/microns-break-moment-ai-hype-163110049.html",
      "Content": "Micron's Make-or-Break Moment: Can AI Hype Justify a 176% Surge?\n\nKhac Phu Nguyen\nWed, December 17, 2025 at 8:31 AM PST 2 min read\n\nIn this article: MU\n\nAVGO\n\nNVDA\n\nAMD\n\n^GSPC\n\nThis article first appeared on GuruFocus .\nMarket participants are bracing for Micron Technology ( NASDAQ:MU ) to report earnings after Wednesday's close, with the bar set high as skepticism around the AI trade begins to surface. The shares have surged 176% in 2025, ranking as the fifth-best performer in the S&P 500 and marking Micron's strongest year since 2013, well ahead of the roughly 40% gain in the Philadelphia Semiconductor Index. That momentum has softened in recent sessions, with the stock down about 12% over the past four days following a Dec. 10 high, suggesting investors may be reassessing expectations ahead of the report.\n\nWarning! GuruFocus has detected 9 Warning Sign with MU.\nIs MU fairly valued? Test your thesis with our free DCF calculator.\nThe company is expected to post strong growth as sustained spending on AI data centers supports demand for its high-bandwidth memory chips, but the market appears focused on whether that momentum is still accelerating. Recent sharp declines in Oracle and Broadcom, both of which fell 11% in a single session last week, have highlighted how quickly sentiment can turn on perceived AI beneficiaries. Some investors may now be adopting a more cautious stance, waiting for clearer signals on how durable data-center growth could be before re-engaging with the sector.\nValuation remains a central part of the Micron debate. Despite this year's rally, the shares trade at roughly 11 times estimated earnings over the next 12 months, the lowest multiple among the 30 stocks in the semiconductor index, which trades closer to 25 times forward earnings. That discount stands out against peers such as Nvidia ( NASDAQ:NVDA ), Broadcom ( NASDAQ:AVGO ), and Advanced Micro Devices ( NASDAQ:AMD ), which command significantly higher multiples. At the same time, expectations for Micron's fundamentals have been moving higher, with consensus forecasts for fiscal 2026 net earnings up 16% over the past month and more than 50% over the past quarter, while revenue estimates have risen by more than 20% over the past three months. With enthusiasm elevated and memory demand still cyclical, the upcoming earnings report could either reinforce the view that Micron is reasonably valued or test how much optimism is already reflected in the shares.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:55:02",
      "Source": "Zacks",
      "Title": "Does Broadcom Inc. (AVGO) Have the Potential to Rally 33.58% as Wall Street Analysts Expect?",
      "URL": "https://finance.yahoo.com/news/does-broadcom-inc-avgo-potential-145502998.html",
      "Content": "Does Broadcom Inc. (AVGO) Have the Potential to Rally 33.58% as Wall Street Analysts Expect?\n\nZacks Equity Research\nWed, December 17, 2025 at 6:55 AM PST 4 min read\n\nIn this article: AVGO\n\nBroadcom Inc. (AVGO) closed the last trading session at $341.3, gaining 0.2% over the past four weeks, but there could be plenty of upside left in the stock if short-term price targets set by Wall Street analysts are any guide. The mean price target of $455.92 indicates a 33.6% upside potential.\nThe average comprises 36 short-term price targets ranging from a low of $375.00 to a high of $535.00, with a standard deviation of $40.01. While the lowest estimate indicates an increase of 9.9% from the current price level, the most optimistic estimate points to a 56.8% upside. More than the range, one should note the standard deviation here, as it helps understand the variability of the estimates. The smaller the standard deviation, the greater the agreement among analysts.\n\nWhile the consensus price target is a much-coveted metric for investors, solely banking on this metric to make an investment decision may not be wise at all. That's because the ability and unbiasedness of analysts in setting price targets have long been questionable.\nHowever, an impressive consensus price target is not the only factor that indicates a potential upside in AVGO. This view is strengthened by the agreement among analysts that the company will report better earnings than what they estimated earlier. Though a positive trend in earnings estimate revisions doesn't give any idea as to how much the stock could surge, it has proven effective in predicting an upside.\nPrice, Consensus and EPS Surprise Here's What You Should Know About Analysts' Price Targets According to researchers at several universities across the globe, a price target is one of many pieces of information about a stock that misleads investors far more often than it guides. In fact, empirical research shows that price targets set by several analysts, irrespective of the extent of agreement, rarely indicate where the price of a stock could actually be heading.\n\nWhile Wall Street analysts have deep knowledge of a company's fundamentals and the sensitivity of its business to economic and industry issues, many of them tend to set overly optimistic price targets. Are you wondering why?\nThey usually do that to drum up interest in shares of companies that their firms either have existing business relationships with or are looking to be associated with. In other words, business incentives of firms covering a stock often result in inflated price targets set by analysts.\nHowever, a tight clustering of price targets, which is represented by a low standard deviation, indicates that analysts have a high degree of agreement about the direction and magnitude of a stock's price movement. While that doesn't necessarily mean the stock will hit the average price target, it could be a good starting point for further research aimed at identifying the potential fundamental driving forces.\n\nStory Continues\nThat said, while investors should not entirely ignore price targets, making an investment decision solely based on them could lead to disappointing ROI. So, price targets should always be treated with a high degree of skepticism.\nWhy AVGO Could Witness a Solid Upside Analysts' growing optimism over the company's earnings prospects, as indicated by strong agreement among them in revising EPS estimates higher, could be a legitimate reason to expect an upside in the stock. That's because empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nOver the last 30 days, the Zacks Consensus Estimate for the current year has increased 9.3%, as 10 estimates have moved higher compared to no negative revision.\nMoreover, AVGO currently has a Zacks Rank #2 (Buy), which means it is in the top 20% of more than 4,000 stocks that we rank based on four factors related to earnings estimates. Given an impressive externally-audited track record, this is a more conclusive indication of the stock's potential upside in the near term. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>> .\nTherefore, while the consensus price target may not be a reliable indicator of how much AVGO could gain, the direction of price movement it implies does appear to be a good guide.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:49:03",
      "Source": "Investor's Business Daily",
      "Title": "OpenAI In Talks To Get $10 Billion Amazon Investment, Use Its Chips: The Information",
      "URL": "https://finance.yahoo.com/m/2726b9b8-789b-3d00-8ef3-494b9b80d8bf/openai-in-talks-to-get-%2410.html",
      "Content": "OpenAI In Talks To Get $10 Billion Amazon Investment, Use Its Chips: The Information\n\nED CARSON\nWed, December 17, 2025 at 6:49 AM PST 1 min read\n\nIn this article: AMZN\n\nNVDA\n\nAVGO\n\nAMD\n\nORCL\n\nAmazon is in talks to invest at least $10 billion in OpenAI, which would use the e-commerce giant's in-house AI chips.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:37:51",
      "Source": "Barchart",
      "Title": "Broadcom Stock Is Up 120% in the Past Year. This Analyst Thinks It Is One of the Highest-Quality Stocks to Buy for the Next Year Too.",
      "URL": "https://finance.yahoo.com/m/63692b79-7427-3160-9c5f-b64e9986bc56/broadcom-stock-is-up-120%25-in.html",
      "Content": "Broadcom Stock Is Up 120% in the Past Year. This Analyst Thinks It Is One of the Highest-Quality Stocks to Buy for the Next Year Too.\n\nYiannis Zourmpanos\nWed, December 17, 2025 at 6:37 AM PST 3 min read\n\nIn this article: AVGO\n\nSemiconductor giant Broadcom Inc. (AVGO) has been among the big winners in the artificial intelligence (AI)-fueled market, and its recent correction hasn’t done much to alter that. After registering an impressive 120% gain last year, the stock took a sharp dip recently. Yet, it continues to remain in focus on Wall Street as a high-quality stock that stands to gain from AI expenditure well into next year.\n\nThat sentiment was reiterated recently by GMO Portfolio Manager Tom Hancock, who considered Broadcom a relatively safe AI bet because it’s more diversified. Not all stocks with an AI link rely on a single product cycle or market demand. Broadcom already has multiple product cycles with semiconductor and infrastructure software business. The growth engine for Broadcom is AI, but that isn’t its lone source. Its biggest weakness, according to Hancock, is valuations.\nMore News from Barchart While AI Panic Struck Applied Digital (APLD) Stock, the Smart Money Has a Different View\nJPMorgan Says to Sell NVDA March $160 Puts. Should You Actually?\nBuy the Dip, or Panic Sell? What This Powerful Chart Indicator is Telling Us About the Stock Market Now.\nMarkets move fast. Keep up by reading our FREE midday Barchart Brief newsletter for exclusive charts, analysis, and headlines.\n\nAbout Broadcom Stock Broadcom primarily designs and provides semiconductor solutions and infrastructure software. It is headquartered in California and ranks among the most prominent and strategically significant participants in global technology infrastructure.\nThe performance of AVGO stock over the past year has been remarkable. Broadcom has a current market cap of $1.6 trillion. Its stock price range has varied from $138 to $415 over the past 52 weeks, primarily due to the strength of the AI sector and its volatility. Even after the latest drop, it is clear that Broadcom has performed remarkably well compared to the rest of the market, thus firmly establishing it as a leader rather than purely speculative.\nValuation is an area where people have differing views. As of current market prices, Broadcom’s price-to-earnings ratio remains above 45x, and its price-to-sales ratio remains above 25x. By no standards is Broadcom stock cheap, but then again, its margins, cash flow visibility, and customer loyalty warrant a premium.\n\nBroadcom also pays a dividend. It isn’t very high, but it is significant nonetheless. The company just boosted its dividend payout by 10%, with a payout rate of $0.65 per share. It marked the fifteenth year of dividend growth.\nBroadcom Beats on Earnings The latest earnings report from Broadcom continued to fuel the bull camp. For the fourth quarter of fiscal 2025, revenue stood at $18 billion, an increase of 28% compared to the previous year. Non-GAAP diluted earnings per share (EPS) of $1.95 marked a 37% increase, while GAAP diluted EPS almost doubled.\n\nStory Continues\nHowever, it was AI that stole the show. The company reported 74% year-over-year growth in AI semiconductor revenue. Looking ahead, it forecasts a doubling of AI semiconductor revenue on a year-over-year basis. Evidently, there are no signs of slowing demand yet.\nGuidance was also strong. Looking ahead to fiscal 2026, for the first quarter, Broadcom forecasted revenue of about $19.1 billion, implying a 28% increase from the previous year. Adjusted EBITDA margins are forecast at about 67%, consistent with its excellent margins at scale. Free cash flow continues to be a bright spot, offering opportunities for the firm to invest, repay debt, and distribute payouts simultaneously.\n\nWhat Do Analysts Expect for Broadcom Stock? Overall, analyst sentiment remains largely positive. The stock enjoys a “Strong Buy” rating consensus. The average price target among analysts is approximately $454, reflecting upside potential from current market levels. Some price targets are significantly above $500, as there is no doubting the profitability facilitated by AI and the perception that it will continue to grow. On the low side, some price targets are set around $375.\nOn the date of publication, Yiannis Zourmpanos did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:13:34",
      "Source": "Simply Wall St.",
      "Title": "Has Broadcom’s AI Fueled Surge Run Ahead of Its Fundamentals in 2025?",
      "URL": "https://finance.yahoo.com/news/broadcom-ai-fueled-surge-run-141334186.html",
      "Content": "Has Broadcom’s AI Fueled Surge Run Ahead of Its Fundamentals in 2025?\n\nSimply Wall St\nWed, December 17, 2025 at 6:13 AM PST 5 min read\n\nIn this article: AVGO\n\nIf you are wondering whether Broadcom is still attractive after its massive run, or if the market has already priced in the story, this article will unpack whether the current share price lines up with the fundamentals.\nEven after a recent pullback of around 16.0% over the last week and a flat 30 day move, Broadcom is still up about 47.1% year to date and roughly 43.5% over the past year, following multi year gains north of 500% over three years and more than 770% over five.\nThose swings have come against a backdrop of big headlines around Broadcom's role in powering AI data centers and its ongoing integration of VMware. Together, these have sharpened the market's focus on its long term growth runway and execution risks. At the same time, investors are weighing how much of that optimism is already embedded in the price as chip and infrastructure names re rate across the sector.\nAccording to our checks, Broadcom scores a 1 out of 6 valuation score , which suggests that on most traditional measures it is not obviously cheap, but that is only part of the story. Next, we will break down the different valuation approaches behind that score and then circle back at the end to a more holistic way of thinking about what the stock may be worth.\n\nBroadcom scores just 1/6 on our valuation checks. See what other red flags we found in the full valuation breakdown .\nApproach 1: Broadcom Discounted Cash Flow (DCF) Analysis The Discounted Cash Flow, or DCF, model estimates what a company is worth by projecting its future cash flows and then discounting them back to today in dollar terms. For Broadcom, the model starts with last twelve month free cash flow of roughly $26.9 billion and then builds in expectations for strong growth as AI and infrastructure demand scale.\n\nAnalyst estimates and Simply Wall St extrapolations suggest free cash flow could rise to about $107.1 billion by 2030, with further increases beyond that as growth gradually tapers. These ten year cash flow projections are then discounted back using a 2 Stage Free Cash Flow to Equity framework to arrive at an intrinsic value of roughly $290.56 per share.\nCompared with the current share price, this DCF implies Broadcom is about 17.5% overvalued, meaning much of the anticipated cash flow growth already appears to be reflected in the market price.\nResult: OVERVALUED\nOur Discounted Cash Flow (DCF) analysis suggests Broadcom may be overvalued by 17.5%. Discover 915 undervalued stocks or create your own screener to find better value opportunities.\nHead to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for Broadcom.\n\nStory Continues\nApproach 2: Broadcom Price vs Earnings For a mature, highly profitable business like Broadcom, the price to earnings ratio is a useful way to gauge how much investors are paying today for each dollar of current profits. In broad terms, faster growth and lower perceived risk justify a higher normal PE, while slower growth or higher uncertainty usually warrant a lower one.\n\nBroadcom currently trades on a PE of about 69.7x. This is almost double the broader Semiconductor industry average of roughly 36.8x and also well above the peer group average of around 54.2x. To put that into better context, Simply Wall St calculates a proprietary Fair Ratio for each stock, which estimates what its PE should be given its specific earnings growth outlook, industry, profit margins, market value and risk profile. This is more precise than a simple peer or industry comparison because it adjusts for the fact that not all chip companies grow, earn or risk the same way.\nFor Broadcom, the Fair Ratio is around 54.8x, noticeably below the current 69.7x. This points to the shares trading at a premium to what its fundamentals alone would suggest.\nResult: OVERVALUED\nPE ratios tell one story, but what if the real opportunity lies elsewhere? Discover 1460 companies where insiders are betting big on explosive growth .\nUpgrade Your Decision Making: Choose your Broadcom Narrative Earlier we mentioned that there is an even better way to understand valuation, so let us introduce you to Narratives, which are simply your own story about a company linked directly to numbers like fair value, and forecasts for future revenue, earnings and margins. A Narrative on Simply Wall St turns your view of Broadcom’s AI opportunity, VMware integration, customer concentration and competitive risks into a structured financial forecast, then connects that forecast to an explicit fair value you can compare with today’s share price to consider whether you think it is a buy, hold or sell. Narratives live on the Community page of Simply Wall St, are easy to create and follow, and are dynamically updated when fresh information such as earnings, guidance or major news arrives. For example, one Broadcom Narrative might assume rapid AI chip adoption, a smooth VMware ramp and premium profitability, giving a fair value above the current analyst consensus of about $403 per share. A more cautious Narrative might lean on the bearish analyst view near $218 if you expect slower growth, more intense competition and bumpier integration.\nDo you think there's more to the story for Broadcom? Head over to our Community to see what others are saying!\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include AVGO .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:00:00",
      "Source": "Zacks",
      "Title": "AI Overvaluation Bothering You? Try Buffer ETFs",
      "URL": "https://finance.yahoo.com/news/ai-overvaluation-bothering-try-buffer-140000271.html",
      "Content": "AI Overvaluation Bothering You? Try Buffer ETFs\n\nSanghamitra Saha\nWed, December 17, 2025 at 6:00 AM PST 3 min read\n\nIn this article: ORCL\n\nDECW\n\nSPY\n\n^GSPC\n\nNVDA\n\nThe overvaluation concerns in the red-hot artificial intelligence (AI) space, the fear of timing mismatch between massive AI investments and their payoffs, and uncertainty in circular financing in the AI space have been bothering Wall Street for quite some time now. The tech stocks were beaten down last week, taking a toll on the Nasdaq-100 as well as the S&P 500.\n\nOracle 's ORCL shares plummeted 14% last week as revenues missed expectations, dragging down related AI names like NVIDIA and Micron. Broadcom AVGO fell about 11% despite strong earnings and guidance, intensifying concerns over high capital spending and delayed AI revenue payoffs (read: ETFs to Watch as Oracle Dips Despite Beating on Q2 Earnings).\nAre You Worried? Although many bullish analysts believe that the AI bubble is yet to burst, due to its immense potential for growth and rapid adoption in various industries, sudden, steep, occasional selloffs in the tech space are likely to unnerve retail investors.\nAgainst this backdrop, investors may consider some investment vehicles that strike a balance between growth and protection. One such solution gaining traction is Defined Outcome ETFs. These ETFs normally offer investors downside protection while allowing them to participate in upside market returns, making them a lucrative bet in 2026.\n\nHow Are Defined Outcome ETFs Structured? Defined Outcome ETFs, also known as buffer ETFs or structured outcome ETFs, use options to create a structured payoff profile over a set investment period, typically one year. These ETFs aim to cap the maximum return an investor can achieve in market participation, buffer a specific percentage of losses, usually 10%, 15%, or 20%, and provide transparent outcomes at the start of the investment period.\n\nChief Investment Officer of Kathmere Capital Management Nick Ryder said defined outcome ETFs are incorporated into some equity strategies to help reduce downside risk. They are often paired with trend-following approaches and covered-call strategies, as mentioned in CNBC.\nGoldman Makes Strategic Push Into Buffer ETFs Goldman Sachs Asset Management is doubling down on defined outcome exchange-traded funds. This month, Goldman has agreed to acquire Innovator Capital Management, a pioneer in defined outcome ETFs, in a deal valued at $2 billion, as quoted on CNBC. The transaction is expected to be sealed in the first half of next year.\n\nDefined Outcome Exchange-Traded Funds (ETFs) in Focus FT Vest Laddered Buffer ETF BUFR\nThe FT Vest Laddered Buffer ETF seeks to provide investors with capital appreciation by providing U.S. large-cap equity market exposure while attempting to limit downside risk through a laddered portfolio of 12 FT Vest U.S. Equity Buffer ETFs. It charges 95 bps in fees. BUFR is up 9.7% over the past six months versus 13.6% returns offered by the SPDR S&P 500 ETF Trust SPY.\n\nStory Continues\nFT Vest Laddered Nasdaq Buffer ETF BUFQ\nThe FT Vest Laddered Nasdaq Buffer ETF seeks to provide investors with capital appreciation by providing investors with large-cap equity market exposure while attempting to limit downside risk through a laddered portfolio of four FT Vest Nasdaq-100 Buffer ETFs. The fund charges 100 bps in fees. BUFQ has added about 9.8% over the past six months.\n\nAllianzIM U.S. Large Cap Buffer20 Dec ETF DECW\nThe AllianzIM U.S. Large Cap Buffer20 Dec ETF matches the share price returns of the SPDR S&P 500 ETF Trust, up to a specified upside Cap, while providing a Buffer against the first 20% of Underlying ETF losses. The Cap and the Buffer will be reduced after management and other Fund fees and expenses. The current Outcome Period is from Dec. 1, 2024, to Nov. 30, 2025. The fund charges 74 bps in fees. DECW has added about 11.3% over the past six months.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nOracle Corporation (ORCL) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nSPDR S&P 500 ETF (SPY): ETF Research Reports\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "21:37:00",
      "Source": "Barrons.com",
      "Title": "Amazon in Talks Over $10 Billion OpenAI Move: Report. That’s Bad for Nvidia, Broadcom.",
      "URL": "https://finance.yahoo.com/m/b42fe308-59b5-32c1-bf2a-65c9908a7a1f/amazon-in-talks-over-%2410.html",
      "Content": "Amazon in Talks Over $10 Billion OpenAI Move: Report. That’s Bad for Nvidia, Broadcom.\n\nAdam Clark\nWed, December 17, 2025 at 5:37 AM PST 2 min read\n\nIn this article: AMZN\n\nMRVL\n\nNVDA\n\nAVGO\n\nOPAI.PVT\n\nAmazon’s investment would be tied to an agreement for OpenAI to use the e-commerce company’s in-house Trainium chips, according to a report.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "21:00:55",
      "Source": "Investing.com",
      "Title": "Nvidia vs. Broadcom: Which AI chip stock to own for 2026? Analyst answers",
      "URL": "https://finance.yahoo.com/news/nvidia-vs-broadcom-ai-chip-130055434.html",
      "Content": "Nvidia vs. Broadcom: Which AI chip stock to own for 2026? Analyst answers\n\nSam Boughedda\nWed, December 17, 2025 at 5:00 AM PST 2 min read\n\nIn this article: AVGO\n\nNVDA\n\nInvesting.com -- The debate over which AI chip stock to own heading into 2026 remains central for investors, and Morgan Stanley says the outlook for next year still strongly favors the sector’s leaders.\nIn a 2026 semiconductor outlook, Morgan Stanley analyst Joseph Moore wrote that “the picture for CY26 appears very strong,” with AI spending supported by “the scaling up of token growth for complex inference, around usage of the models, not training.”\n\nMoore acknowledged ongoing skepticism around longer-term AI assumptions, noting it has “some skepticism on the 5-year views that make 2025 strength look like a rounding error.”\nStill, the bank said visibility for 2026 remains solid, helped by recent capital raises among major model developers and sustained demand for compute.\nWithin processors, Morgan Stanley “remain[s] OW NVDA and AVGO, maintaining a preference for NVDA.”\n“[Nvidia is] still the nucleus for the AI trade, and at an undemanding multiple we think it’s hard to look elsewhere in AI,” said Moore.\nThe analyst highlighted “growing enthusiasm for ASIC, where growth will be strong,” but added that “as various bottlenecks emerge we continue to think that NVIDIA will be the highest ROI solution in cloud, particularly as Vera Rubin ramps in 2h26.”\n\nMorgan Stanley also believes “the market is underestimating NVIDIA’s position.”\nBroadcom remains favored as part of Morgan Stanley’s overweight positioning, but Nvidia stands out as the preferred name.\nHowever, the bank wrote that “on the GPU alternatives debate, we prefer AVGO as the proven and enduring accelerator story beyond CY2026.”\n“We really like the growth story here, and while we tend to be vocal on GPUs maintaining market share leadership, we still see very strong growth potential for both custom silicon and networking at Broadcom ,” Moore added.\nRelated articles\nNvidia vs. Broadcom: Which AI chip stock to own for 2026? Analyst answers\n10 Beaten-Down Large-Cap Tech Stocks Offering Solid Upside Potential\nLoading Up HEAVY on These 3 Stocks by End of 2025 (+ 1 New ETF)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "21:00:00",
      "Source": "Motley Fool",
      "Title": "Nvidia vs AMD: Which AI Chipmaker Will Lead the Next Decade of Compute?",
      "URL": "https://finance.yahoo.com/m/4d09bc4e-1434-3959-9bee-1d77685550e3/nvidia-vs-amd%3A-which-ai.html",
      "Content": "Nvidia vs AMD: Which AI Chipmaker Will Lead the Next Decade of Compute?\n\nAdria Cimino, The Motley Fool\nWed, December 17, 2025 at 5:00 AM PST 5 min read\n\nIn this article: NVDA\n\nAMD\n\nAVGO\n\nAMZN\n\nKey Points Nvidia has been the leading AI chip designer since the start of the AI boom, but AMD has been gaining ground.\nBoth companies design the chips powering crucial AI tasks.\n10 stocks we like better than Nvidia ›\nNvidia (NASDAQ: NVDA) has been the \"go-to\" source for artificial intelligence (AI) chips since the start of the AI boom, and this is thanks to two things: the company's first-to-market advantage and the strong performance of its chips. All of this has generated enormous earnings growth, with revenue and profit reaching record levels, and mind-boggling share price gains -- the stock has advanced more than 900% over three years.\n\nBut Nvidia isn't alone in the exciting AI space. It faces competition from other chip designers such as Broadcom and even some of its own customers that have developed their own chips, like Amazon , for example. But one name in particular represents perhaps the biggest threat to Nvidia's dominance, and that's Advanced Micro Devices (NASDAQ: AMD) , a company that's been quickly advancing with new high-powered chips and attractive pricing. And the coming years could represent a crucial moment for chip companies, as Nvidia predicts AI infrastructure spending may reach as much as $4 trillion.\nWhich of these two AI chip designers will lead the next decade of compute? Let's find out.\nNvidia's path to leadership First, let's consider Nvidia's path to leadership and how it's managed to stay ahead of rivals so far. As mentioned, Nvidia entered the market first with its supercharged graphics processing units (GPUs), AI chips that power the most crucial of AI tasks from training to inferencing . This offered the company the opportunity to build relationships with customers, and for customers to be won over by the quality of Nvidia's products.\n\nNvidia maintained this leadership by continuing to innovate on a regular basis, and in recent years, it committed to annual updates to its top chips.\nAMD made AI a focus with the launch of its Instinct line of accelerators back in 2017, and since then has added to GPU offerings, gaining in performance and therefore becoming a stronger rival for AI powerhouse Nvidia.\nIn the most recent earnings report, the company delivered a 36% increase in revenue to a record level of $9.2 billion, and chief executive officer Lisa Su said quarterly performance and guidance for the next quarter marked \"a clear step up in our growth trajectory.\" Demand from data center customers for the company's EPYC processors and Instinct AI accelerators drove gains in the period.\n\nStory Continues\nAMD and OpenAI It's also important to note that AMD recently signed a deal with OpenAI for the deployment of six gigawatts of AMD GPUs, with the first gigawatt set to roll out in the second half of next year. (OpenAI also has a deal with Nvidia for the deployment of 10 gigawatts of Nvidia GPUs.)\nThough AMD has come a long way in a short period of time and surely will continue to gain many orders for its GPUs, I don't see the company unseating Nvidia and driving compute in the coming decade. And here's why: Nvidia truly has built out a massive ecosystem within the world of AI, offering everything needed to do the AI job, from GPUs to high-performance networking equipment and software, as well as platforms for specific industries like autonomous vehicles, healthcare, and robotics. And within those industry platforms, Nvidia's built tools designed to help customers reach their goals.\n\nThough AMD also offers a significant array of products and services, it's not as far-reaching as that of its bigger competitor.\nLeading the next decade of AI All of this makes Nvidia better positioned to lead the next decade of compute -- but this doesn't mean AMD won't benefit from the upcoming phases of AI growth. AMD's chips and systems are powerful, pricing is competitive, and the company has seen demand take off in recent quarters. Major chip customers, like Amazon, just to name one, buy GPUs from a variety of chip designers -- not just from Nvidia. In its recent earnings call, Amazon chief Andy Jassy said Amazon Web Services continues \"to work closely with chip partners like Nvidia, with whom we continue to order very significant amounts as well as with AMD and Intel .\"\n\nAll of this means that AMD may have plenty of very of bright days ahead, but considering the empire Nvidia has carefully built over time and its commitment to innovation, I expect this AI giant to keep powering the AI revolution.\nShould you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $505,695 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,080,694 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 962 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nAdria Cimino has positions in Amazon. The Motley Fool has positions in and recommends Advanced Micro Devices, Amazon, Intel, and Nvidia. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nNvidia vs AMD: Which AI Chipmaker Will Lead the Next Decade of Compute? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "20:47:10",
      "Source": "GuruFocus.com",
      "Title": "Cantor Sees Semiconductors Outperforming in 2026 as AI Spending Heats up",
      "URL": "https://finance.yahoo.com/news/cantor-sees-semiconductors-outperforming-2026-124710345.html",
      "Content": "Cantor Sees Semiconductors Outperforming in 2026 as AI Spending Heats up\n\nMoz Farooque ACCA\nWed, December 17, 2025 at 4:47 AM PST 1 min read\n\nIn this article: NVDA\n\n^GSPC\n\nAVGO\n\nMU\n\nWDC\n\nThis article first appeared on GuruFocus .\nNVIDIA Corporation ( NVDA , Financials ) and the broader semiconductor sector may be poised for another strong year, according to a new outlook from Cantor. The firm expects chip stocks to outperform in 2026 as demand for AI infrastructure continues to surge and memory supply remains tight.\n\nWarning! GuruFocus has detected 4 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nCantor noted that the Philadelphia Semiconductor Index has climbed 40% this year, significantly outpacing the S&P 500 and Nasdaq. Analysts believe the same dynamics that powered this year's rally heavy investment from cloud providers, rapid adoption of AI compute, and ongoing supply constraints will carry into next year.\nThe firm highlighted several areas of strength, including AI processors, memory, storage, and semiconductor equipment. Companies tied to hyperscale data center spending, such as Nvidia and Broadcom, remain central to the buildout. At the same time, memory makers like Micron and Western Digital continue to benefit from constrained supply conditions that support pricing.\nCantor argued that the investment cycle behind AI is still in its early stages and should offer multi-year growth potential rather than the short-lived surge some investors feared. With cloud providers reporting strong returns on AI infrastructure, analysts see little sign that demand will taper in the near term.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "20:11:28",
      "Source": "MT Newswires",
      "Title": "Social Buzz: Wallstreetbets Stocks Mostly Higher Pre-Bell Wednesday; Amazon, Hood to Advance",
      "URL": "https://finance.yahoo.com/news/social-buzz-wallstreetbets-stocks-mostly-121128842.html",
      "Content": "PREMIUM\nSocial Buzz: Wallstreetbets Stocks Mostly Higher Pre-Bell Wednesday; Amazon, Hood to Advance\n\nMT Newswires\nWed, December 17, 2025 at 4:11 AM PST 1 min read\n\nIn this article: AMZN\n\nDTE\n\nTSLA\n\nNVDA\n\nHOOD\n\nThe most-talked-about stocks in the Reddit subforum Wallstreetbets were mostly higher hours before W\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "20:00:00",
      "Source": "Zacks",
      "Title": "6 Top-Performing ETF Areas of Last Week",
      "URL": "https://finance.yahoo.com/news/6-top-performing-etf-areas-120000857.html",
      "Content": "6 Top-Performing ETF Areas of Last Week\n\nSanghamitra Saha\nWed, December 17, 2025 at 4:00 AM PST 3 min read\n\nIn this article: AVGO\n\nSIL\n\nGDXJ\n\nSILJ\n\nCNBS\n\nWall Street was upbeat last week. The S&P 500 lost 0.6%, the Dow Jones advanced 1.1% and the Nasdaq retreated about 1.6% last week. The tech stocks were beaten down, taking a toll on the Nasdaq-100 as well as the S&P 500. Roundhill Magnificent Seven ETF MAGS lost 1.7% last week, while State Street Technology Select Sector SPDR ETF XLK was off 2.5%.\n\nInside the Tech Sell-off Oracle 's ORCL shares plummeted 14% last week as revenues missed expectations, dragging down related AI names like NVIDIA and Micron. Broadcom AVGO fell about 11% despite strong earnings and guidance, intensifying concerns over high capital spending and delayed AI revenue payoffs (read: ETFs to Watch as Oracle Dips Despite Beating on Q2 Earnings).\n\nFed Rate Cut The Fed enacted its final rate cut of the year last week. The move brings the benchmark federal funds rate to a range of 3.5% to 3.75% after a closely divided vote among policymakers.The Fed will now conclude the year facing a softer labor market and inflation still about one percentage point above its 2% target.\n\nAfter three rate cuts in 2025 totaling three-quarters of a percentage point, the Fed&rsquo;s outlook for 2026 looks more restrained. Policymakers continue to project just one rate cut next year, consistent with their September forecast (read: 'A Hawkish Cut' From Fed? ETFs to Gain).\nAgainst this backdrop, below we highlight a few winning exchange-traded fund (ETF) areas of last week.\nWinning ETF Areas in Focus Cannabis\nRoundhill Cannabis ETF WEED &ndash; Up 51.2%\nAmplify Seymour Cannabis ETF CNBS &ndash; Up 51.0%\nCannabis stocks surged significantly on Dec. 12, 2025, thanks to reports of President Trump's plans to ease federal marijuana regulations by reclassifying it to Schedule III from a Schedule I. This news sparked gains across major players, boosting investor optimism despite no final policy confirmation, as mentioned in CNBC.\n\nSilver Miners\nGlobal X Silver Miners ETF SIL &ndash; Up 8.4%\nAmplify Junior Silver Miners ETF SILJ &ndash; Up 7.6%\nSilver is often considered an industrial metal. Rising industrial usage in solar panels, electric vehicles, electronics, and AI data centers has fueled demand. Plus, persistent supply shortages have now been boosting silver prices. As a result, silver mining stocks soared in recent tradings.\nSpace Economy\nProcure Space ETF UFO &ndash; Up 7.8%\nRocket Lab Corp RKLB surged 22.8% last week. The stock is benefiting from the uptick in investors&rsquo; attention in the overall space economy.Rocket Lab&rsquo;s successful move in the next-gen Neutron rocket and securing of new funding from the Canadian Space Agency were other positives. There has been a report about a potential $1.5 trillion SpaceX IPO for 2026 (per Bloomberg, as quoted on Yahoo Finance). SpaceX news acted as a cornerstone for the entire space investing arena.\n\nStory Continues\nGold Miners\nVanEck Junior Gold Miners ETF GDXJ &ndash; Up 7.1%\nSPDR Gold Trust GLD gained 2.2% last week as the greenback weakened further. Since gold mining stocks act as leveraged plays of the underlying metal, GDXJ surged materially.\nPlatinum\nGraniteShares Platinum Trust PLTM &ndash; Up 6.3%\nPlatinum surged above $1,700 per ounce, touching its strongest level since 2011, per Tradingeconomics. The World Platinum Investment Council forecasts a 2025 deficit of 69,200 ounces, marking a third successive annual shortfall. However, 2026 could see a balance in the platinum market with a modest surplus of about 20,000 ounces, as quoted on Tradingeconomics.\n\nHealth Care\nRoundhill GLP-1 & Weight Loss ETF OZEM &ndash; Up 6.3%\nThe Roundhill GLP-1 & Weight Loss ETF is the world&rsquo;s first GLP-1 ETF. OZEM is an actively-managed ETF. The fund charges 59 bps and yields 0.16% annually. Roundhill believes that weight loss drugs, including GLP-1 agonists, offer one of the most groundbreaking advancements in the global pharmaceuticals industry (read: Best-Performing ETFs of November).\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nOracle Corporation (ORCL) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nSPDR Gold Shares (GLD): ETF Research Reports\nState Street Technology Select Sector SPDR ETF (XLK): ETF Research Reports\n\nVanEck Junior Gold Miners ETF (GDXJ): ETF Research Reports\nGlobal X Silver Miners ETF (SIL): ETF Research Reports\nAmplify Junior Silver Miners ETF (SILJ): ETF Research Reports\nProcure Space ETF (UFO): ETF Research Reports\nAmplify Seymour Cannabis ETF (CNBS): ETF Research Reports\nRocket Lab Corporation (RKLB) : Free Stock Analysis Report\nRoundhill Cannabis ETF (WEED): ETF Research Reports\nRoundhill GLP-1 & Weight Loss ETF (OZEM): ETF Research Reports\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "15:34:17",
      "Source": "Insider Monkey",
      "Title": "Cantor Maintains Overweight on Broadcom (AVGO), Citing Strong AI Momentum",
      "URL": "https://finance.yahoo.com/news/cantor-maintains-overweight-broadcom-avgo-073417737.html",
      "Content": "Cantor Maintains Overweight on Broadcom (AVGO), Citing Strong AI Momentum\n\nGhazal Ahmed\nTue, December 16, 2025 at 11:34 PM PST 2 min read\n\nIn this article: AVGO\n\nGOOG\n\nANTH.PVT\n\nOPAI.PVT\n\nBroadcom Inc. (NASDAQ: AVGO ) is one of the Trending AI Stocks on Wall Street . On December 12, Cantor Fitzgerald maintained its “Overweight” rating on the stock with a $525 price target. The firm has reiterated its “Top Pick” status on Broadcom based on AI infrastructure momentum and expanding silicon footprint.\n\nThe fabless chip and software maker reported a top-and-bottom-line earnings beat. Besides strong results for the October quarter, the company also provided a modest raise for January quarter guidance.\nHowever, this was partially affected by a higher tax rate forecast for fiscal year 2026. There was also a $73 billion of AI backlog, including $53 billion in custom silicon, which is anticipated to convert to revenue over the next six quarters.\nBroadcom also announced a fifth customer, bringing its total AI customer count to six, including Google, Anthropic, META, Bytedance, and OpenAI. The firm estimates AI semiconductor revenue to grow by more than 100% in calendar year 2026, leading to an earnings per share of at least $10.70.\nBroadcom is a technology company uniquely positioned in the AI revolution owing to its custom chip offerings and networking assets.\nWhile we acknowledge the potential of AVGO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 12 Must-Watch AI Stocks on Wall Street and 11 AI Stocks Analysts Are Watching Closely .\nDisclosure: None.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "09:37:00",
      "Source": "TheStreet",
      "Title": "Bank of America updates Palantir stock forecast after private meeting",
      "URL": "https://finance.yahoo.com/m/497d2e7e-b89d-3c6c-b35d-13a1a3781785/bank-of-america-updates.html",
      "Content": "Bank of America updates Palantir stock forecast after private meeting\n\nVuk Zdinjak\nTue, December 16, 2025 at 5:37 PM PST 4 min read\n\nIn this article: PLTR\n\nORCL\n\nAVGO\n\nPalantir stock has gained about 20% since its November slump. It appears that the stock has weathered the storm of the AI sell-off, which was triggered by investor fears that AI is a bubble.\nLast week was especially difficult, as Oracle and Broadcom both took a sharp drop after reporting earnings, dragging other AI companies down with them.\nBank of America analyst Mariana Perez Mora and her team hosted investor meetings last week, featuring Palantir CFO Dave Glazer, Deployment Strategists Hind Kraytem and Austin Lee, and Investor Relations representative Cary Li, in South Korea. They updated their opinion on the stock afterward.\nBank of America says “PLTR still in a league of its own” The team said they came back confident from the meetings, as Palantir’s ( PLTR ) growth continues to build momentum in tandem with enterprise-level AI adoption.\nThey noted that U.S. Commercial growth continues to show the strongest momentum, thanks to strengthening backlog and lower contract duration. Palantir recently received a two-year contract with the U.S. Navy for ShipOS, worth $448 million, and Mora said that it further aligns the company with the Trump administration’s priorities regarding reindustrialization of America.\n\nThe team believes Palantir has an opportunity for margin expansion, as operating leverage grows with each use case across the businesses.\nRelated: Bank of America resets Broadcom stock price target\nMora wrote: “We continue to see PLTR unmatched in their ability to rapidly achieve in-production solutions and provide human-machine teams with the ability to make the most informed decisions.”\nIn a research note shared with TheStreet, Mora reiterated a buy rating and the target price of $255 for PLTR stock, based on a 15 enterprise multiple estimate for 2035. She used a longer-term valuation methodology to reflect the sustained high-growth and profitability profile of the company.\nMora believes this valuation fairly captures the beneficial position to national security and U.S. government, reflecting a leading role in artificial intelligence platforms, strong balance sheet , and strong profitability.\n\nAnalysts noted downside risk factors for Palantir: Lower-than-expected AI-platforms market growth\nFaster-than-expected commoditization\nCompetitors catching up with technologies,\nStronger-than-expected resistance from government customers to use commercial\noff-the-shelf solutions\nUpside risk factors for Palantir are: Stronger-than-expected growth of the AI-platforms market\nHigher-than-expected Palantir penetration\nBetter-than-expected profitability\nBetter-than-expected successful agreements and investments\nOther opinions on Palantir stock Wedbush analyst Dan Ives and his team rate Palantir with a buy rating and a target price of $230. TheStreet Pro ’s veteran analyst Stephen Guilfoyle rates Palantir with a buy rating and a target price of $215.\nMorgan Stanley reiterated a hold rating and raised Palantir’s price target from $155 to $205 in November, according to TipRanks .\n\nMotley Fool's Keithen Drury believes Palantir is “grossly overvalued.” He sees a big problem for Palantir in Wall Street ’s estimates for Palantir’s revenue growth rate for next year of 41%, because if they are correct, this will be a slowdown.\nIn turn, this slowdown will increase the number of years required for growth to bring Palantir’s valuation to a reasonable level.\nPalantir’s recent activity Palantir announced a three-year renewal of its contract with the DGSI, France’s domestic intelligence agency. The company will supply its proprietary software platform to the agency, along with the necessary integration, support, and assistance services for the software’s deployment and operational use.\n\n“We are very proud to support the DGSI in its crucial work in the service of France and its fight against terrorism,\" said Palantir CEO Alex Karp . \"This contract renewal reaffirms Palantir’s commitment to serving the interests of France since 2016, and ensuring the security of the French people.”\nMore AI Stocks:\nIs Nvidia’s AI boom already priced in? Oppenheimer doesn’t think so\nWindows president told ‘Stop this nonsense. No one wants this’\nMichael Burry turns up heat on anti-AI bet\nAI plays expanding role in predicting natural disasters\nMorgan Stanley revamps Nvidia’s price target ahead of big Q3\nCathie Wood buys $16.2 million of sinking AI stock\nThe company unveiled Chain Reaction , a platform it describes as “the operating system for American AI infrastructure.” Chain Reaction is designed to accelerate the AI buildout with energy producers, power distributors, data centers, and infrastructure builders. The platform’s founding partners include CenterPoint Energy and Nvidia .\n\n\"We have spent years quietly deploying systems that keep power plants running and grids reliable,\" Tristan Gruska, Palantir’s head of energy and infrastructure, stated. \"Chain Reaction is the result of building from the ground up for the demands of AI.”\nAfter spending more than 12 years at Palantir, Jim Siders has stepped down from his most recent position of CIO and joined Shield Technology Partners to serve as CEO, according to CNBC .\nRelated: Bank of America resets Oracle stock price target\nThis story was originally published by TheStreet on Dec 16, 2025, where it first appeared in the Investing section. Add TheStreet as a Preferred Source by clicking here.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 88
}