{
  "stock_id": "AVGO",
  "last_updated": "2025-12-17T14:26:05.565Z",
  "source": "Yahoo Finance Only",
  "news": [
    {
      "Date": "2025-12-17",
      "Time": "21:37:00",
      "Source": "Yahoo Finance",
      "Title": "Amazon in Talks Over $10 Billion OpenAI Move: Report. That’s Bad for Nvidia, Broadcom.",
      "URL": "https://finance.yahoo.com/m/b42fe308-59b5-32c1-bf2a-65c9908a7a1f/amazon-in-talks-over-%2410.html?.tsrc=rss",
      "Content": "Amazon in Talks Over $10 Billion OpenAI Move: Report. That’s Bad for Nvidia, Broadcom.\n\nAdam Clark\nWed, December 17, 2025 at 5:37 AM PST 2 min read\n\nIn this article: AMZN\n\nMRVL\n\nNVDA\n\nAVGO\n\nOPAI.PVT\n\nAmazon’s investment would be tied to an agreement for OpenAI to use the e-commerce company’s in-house Trainium chips, according to a report.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "21:04:34",
      "Source": "Yahoo Finance",
      "Title": "OpenAI In Talks To Get $10 Billion Amazon Investment, Use Its Chips: The Information",
      "URL": "https://finance.yahoo.com/m/2726b9b8-789b-3d00-8ef3-494b9b80d8bf/openai-in-talks-to-get-%2410.html?.tsrc=rss",
      "Content": "OpenAI In Talks To Get $10 Billion Amazon Investment, Use Its Chips: The Information\n\nED CARSON\nWed, December 17, 2025 at 5:04 AM PST 1 min read\n\nIn this article: AMZN\n\nNVDA\n\nAVGO\n\nAMD\n\nORCL\n\nAmazon is in talks to invest at least $10 billion in OpenAI, which would use the e-commerce giant's in-house AI chips.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "21:00:55",
      "Source": "Yahoo Finance",
      "Title": "Nvidia vs. Broadcom: Which AI chip stock to own for 2026? Analyst answers",
      "URL": "https://finance.yahoo.com/news/nvidia-vs-broadcom-ai-chip-130055434.html?.tsrc=rss",
      "Content": "Nvidia vs. Broadcom: Which AI chip stock to own for 2026? Analyst answers\n\nSam Boughedda\nWed, December 17, 2025 at 5:00 AM PST 2 min read\n\nIn this article: AVGO\n\nNVDA\n\nInvesting.com -- The debate over which AI chip stock to own heading into 2026 remains central for investors, and Morgan Stanley says the outlook for next year still strongly favors the sector’s leaders.\nIn a 2026 semiconductor outlook, Morgan Stanley analyst Joseph Moore wrote that “the picture for CY26 appears very strong,” with AI spending supported by “the scaling up of token growth for complex inference, around usage of the models, not training.”\n\nMoore acknowledged ongoing skepticism around longer-term AI assumptions, noting it has “some skepticism on the 5-year views that make 2025 strength look like a rounding error.”\nStill, the bank said visibility for 2026 remains solid, helped by recent capital raises among major model developers and sustained demand for compute.\nWithin processors, Morgan Stanley “remain[s] OW NVDA and AVGO, maintaining a preference for NVDA.”\n“[Nvidia is] still the nucleus for the AI trade, and at an undemanding multiple we think it’s hard to look elsewhere in AI,” said Moore.\nThe analyst highlighted “growing enthusiasm for ASIC, where growth will be strong,” but added that “as various bottlenecks emerge we continue to think that NVIDIA will be the highest ROI solution in cloud, particularly as Vera Rubin ramps in 2h26.”\n\nMorgan Stanley also believes “the market is underestimating NVIDIA’s position.”\nBroadcom remains favored as part of Morgan Stanley’s overweight positioning, but Nvidia stands out as the preferred name.\nHowever, the bank wrote that “on the GPU alternatives debate, we prefer AVGO as the proven and enduring accelerator story beyond CY2026.”\n“We really like the growth story here, and while we tend to be vocal on GPUs maintaining market share leadership, we still see very strong growth potential for both custom silicon and networking at Broadcom ,” Moore added.\nRelated articles\nNvidia vs. Broadcom: Which AI chip stock to own for 2026? Analyst answers\n10 Beaten-Down Large-Cap Tech Stocks Offering Solid Upside Potential\nLoading Up HEAVY on These 3 Stocks by End of 2025 (+ 1 New ETF)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "20:47:10",
      "Source": "Yahoo Finance",
      "Title": "Cantor Sees Semiconductors Outperforming in 2026 as AI Spending Heats up",
      "URL": "https://finance.yahoo.com/news/cantor-sees-semiconductors-outperforming-2026-124710345.html?.tsrc=rss",
      "Content": "Cantor Sees Semiconductors Outperforming in 2026 as AI Spending Heats up\n\nMoz Farooque ACCA\nWed, December 17, 2025 at 4:47 AM PST 1 min read\n\nIn this article: NVDA\n\n^GSPC\n\nAVGO\n\nMU\n\nWDC\n\nThis article first appeared on GuruFocus .\nNVIDIA Corporation ( NVDA , Financials ) and the broader semiconductor sector may be poised for another strong year, according to a new outlook from Cantor. The firm expects chip stocks to outperform in 2026 as demand for AI infrastructure continues to surge and memory supply remains tight.\n\nWarning! GuruFocus has detected 4 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nCantor noted that the Philadelphia Semiconductor Index has climbed 40% this year, significantly outpacing the S&P 500 and Nasdaq. Analysts believe the same dynamics that powered this year's rally heavy investment from cloud providers, rapid adoption of AI compute, and ongoing supply constraints will carry into next year.\nThe firm highlighted several areas of strength, including AI processors, memory, storage, and semiconductor equipment. Companies tied to hyperscale data center spending, such as Nvidia and Broadcom, remain central to the buildout. At the same time, memory makers like Micron and Western Digital continue to benefit from constrained supply conditions that support pricing.\nCantor argued that the investment cycle behind AI is still in its early stages and should offer multi-year growth potential rather than the short-lived surge some investors feared. With cloud providers reporting strong returns on AI infrastructure, analysts see little sign that demand will taper in the near term.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "20:00:00",
      "Source": "Yahoo Finance",
      "Title": "6 Top-Performing ETF Areas of Last Week",
      "URL": "https://finance.yahoo.com/news/6-top-performing-etf-areas-120000857.html?.tsrc=rss",
      "Content": "6 Top-Performing ETF Areas of Last Week\n\nSanghamitra Saha\nWed, December 17, 2025 at 4:00 AM PST 3 min read\n\nIn this article: AVGO\n\nSIL\n\nGDXJ\n\nSILJ\n\nCNBS\n\nWall Street was upbeat last week. The S&P 500 lost 0.6%, the Dow Jones advanced 1.1% and the Nasdaq retreated about 1.6% last week. The tech stocks were beaten down, taking a toll on the Nasdaq-100 as well as the S&P 500. Roundhill Magnificent Seven ETF MAGS lost 1.7% last week, while State Street Technology Select Sector SPDR ETF XLK was off 2.5%.\n\nInside the Tech Sell-off Oracle 's ORCL shares plummeted 14% last week as revenues missed expectations, dragging down related AI names like NVIDIA and Micron. Broadcom AVGO fell about 11% despite strong earnings and guidance, intensifying concerns over high capital spending and delayed AI revenue payoffs (read: ETFs to Watch as Oracle Dips Despite Beating on Q2 Earnings).\n\nFed Rate Cut The Fed enacted its final rate cut of the year last week. The move brings the benchmark federal funds rate to a range of 3.5% to 3.75% after a closely divided vote among policymakers.The Fed will now conclude the year facing a softer labor market and inflation still about one percentage point above its 2% target.\n\nAfter three rate cuts in 2025 totaling three-quarters of a percentage point, the Fed&rsquo;s outlook for 2026 looks more restrained. Policymakers continue to project just one rate cut next year, consistent with their September forecast (read: 'A Hawkish Cut' From Fed? ETFs to Gain).\nAgainst this backdrop, below we highlight a few winning exchange-traded fund (ETF) areas of last week.\nWinning ETF Areas in Focus Cannabis\nRoundhill Cannabis ETF WEED &ndash; Up 51.2%\nAmplify Seymour Cannabis ETF CNBS &ndash; Up 51.0%\nCannabis stocks surged significantly on Dec. 12, 2025, thanks to reports of President Trump's plans to ease federal marijuana regulations by reclassifying it to Schedule III from a Schedule I. This news sparked gains across major players, boosting investor optimism despite no final policy confirmation, as mentioned in CNBC.\n\nSilver Miners\nGlobal X Silver Miners ETF SIL &ndash; Up 8.4%\nAmplify Junior Silver Miners ETF SILJ &ndash; Up 7.6%\nSilver is often considered an industrial metal. Rising industrial usage in solar panels, electric vehicles, electronics, and AI data centers has fueled demand. Plus, persistent supply shortages have now been boosting silver prices. As a result, silver mining stocks soared in recent tradings.\nSpace Economy\nProcure Space ETF UFO &ndash; Up 7.8%\nRocket Lab Corp RKLB surged 22.8% last week. The stock is benefiting from the uptick in investors&rsquo; attention in the overall space economy.Rocket Lab&rsquo;s successful move in the next-gen Neutron rocket and securing of new funding from the Canadian Space Agency were other positives. There has been a report about a potential $1.5 trillion SpaceX IPO for 2026 (per Bloomberg, as quoted on Yahoo Finance). SpaceX news acted as a cornerstone for the entire space investing arena.\n\nStory Continues\nGold Miners\nVanEck Junior Gold Miners ETF GDXJ &ndash; Up 7.1%\nSPDR Gold Trust GLD gained 2.2% last week as the greenback weakened further. Since gold mining stocks act as leveraged plays of the underlying metal, GDXJ surged materially.\nPlatinum\nGraniteShares Platinum Trust PLTM &ndash; Up 6.3%\nPlatinum surged above $1,700 per ounce, touching its strongest level since 2011, per Tradingeconomics. The World Platinum Investment Council forecasts a 2025 deficit of 69,200 ounces, marking a third successive annual shortfall. However, 2026 could see a balance in the platinum market with a modest surplus of about 20,000 ounces, as quoted on Tradingeconomics.\n\nHealth Care\nRoundhill GLP-1 & Weight Loss ETF OZEM &ndash; Up 6.3%\nThe Roundhill GLP-1 & Weight Loss ETF is the world&rsquo;s first GLP-1 ETF. OZEM is an actively-managed ETF. The fund charges 59 bps and yields 0.16% annually. Roundhill believes that weight loss drugs, including GLP-1 agonists, offer one of the most groundbreaking advancements in the global pharmaceuticals industry (read: Best-Performing ETFs of November).\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nOracle Corporation (ORCL) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nSPDR Gold Shares (GLD): ETF Research Reports\nState Street Technology Select Sector SPDR ETF (XLK): ETF Research Reports\n\nVanEck Junior Gold Miners ETF (GDXJ): ETF Research Reports\nGlobal X Silver Miners ETF (SIL): ETF Research Reports\nAmplify Junior Silver Miners ETF (SILJ): ETF Research Reports\nProcure Space ETF (UFO): ETF Research Reports\nAmplify Seymour Cannabis ETF (CNBS): ETF Research Reports\nRocket Lab Corporation (RKLB) : Free Stock Analysis Report\nRoundhill Cannabis ETF (WEED): ETF Research Reports\nRoundhill GLP-1 & Weight Loss ETF (OZEM): ETF Research Reports\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "15:34:17",
      "Source": "Yahoo Finance",
      "Title": "Cantor Maintains Overweight on Broadcom (AVGO), Citing Strong AI Momentum",
      "URL": "https://finance.yahoo.com/news/cantor-maintains-overweight-broadcom-avgo-073417737.html?.tsrc=rss",
      "Content": "Cantor Maintains Overweight on Broadcom (AVGO), Citing Strong AI Momentum\n\nGhazal Ahmed\nTue, December 16, 2025 at 11:34 PM PST 2 min read\n\nIn this article: AVGO\n\nGOOG\n\nANTH.PVT\n\nOPAI.PVT\n\nBroadcom Inc. (NASDAQ: AVGO ) is one of the Trending AI Stocks on Wall Street . On December 12, Cantor Fitzgerald maintained its “Overweight” rating on the stock with a $525 price target. The firm has reiterated its “Top Pick” status on Broadcom based on AI infrastructure momentum and expanding silicon footprint.\n\nThe fabless chip and software maker reported a top-and-bottom-line earnings beat. Besides strong results for the October quarter, the company also provided a modest raise for January quarter guidance.\nHowever, this was partially affected by a higher tax rate forecast for fiscal year 2026. There was also a $73 billion of AI backlog, including $53 billion in custom silicon, which is anticipated to convert to revenue over the next six quarters.\nBroadcom also announced a fifth customer, bringing its total AI customer count to six, including Google, Anthropic, META, Bytedance, and OpenAI. The firm estimates AI semiconductor revenue to grow by more than 100% in calendar year 2026, leading to an earnings per share of at least $10.70.\nBroadcom is a technology company uniquely positioned in the AI revolution owing to its custom chip offerings and networking assets.\nWhile we acknowledge the potential of AVGO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 12 Must-Watch AI Stocks on Wall Street and 11 AI Stocks Analysts Are Watching Closely .\nDisclosure: None.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "06:35:52",
      "Source": "Yahoo Finance",
      "Title": "Stocks to Watch Tuesday Recap: Ford Motor, Broadcom, Lennar",
      "URL": "https://finance.yahoo.com/m/bcfa1724-217b-385c-900e-be9f4041f390/stocks-to-watch-tuesday.html?.tsrc=rss",
      "Content": "Stocks to Watch Tuesday Recap: Ford Motor, Broadcom, Lennar\n\nThe Wall Street Journal\nTue, December 16, 2025 at 2:35 PM PST 1 min read\n\nIn this article: F\n\nNAVN\n\nAVGO\n\nLEN\n\nLUV\n\n🔎 Ford Motor (F): The automaker expects about $19.5 billion in charges as it scales back electric-vehicle ambitions and shifts focus to gas-powered and hybrid vehicles. Shares closed slightly higher but edged lower after hours.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "05:39:06",
      "Source": "Yahoo Finance",
      "Title": "Tesla Stock Rises to First Record of 2025",
      "URL": "https://finance.yahoo.com/m/da2526c2-5015-3a1f-8e52-0ab9593ce72a/tesla-stock-rises-to-first.html?.tsrc=rss",
      "Content": "Tesla Stock Rises to First Record of 2025\n\nThe Wall Street Journal\nTue, December 16, 2025 at 1:39 PM PST\n\nIn this article: TSLA\n\nF\n\nAVGO\n\nShares of EV-maker Tesla rose 3.1% Tuesday to their first record since last December. The price move, which pushed the stock to $489.88, gave the company run by Elon Musk a market cap of $1.629 trillion, according to Dow Jones Market Data.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "05:36:00",
      "Source": "Yahoo Finance",
      "Title": "Nvidia Stock Walks the Fine Line of AI Bubble Fears",
      "URL": "https://finance.yahoo.com/m/1faa0046-68c0-3276-a2c6-059babb8ea11/nvidia-stock-walks-the-fine.html?.tsrc=rss",
      "Content": "Nvidia Stock Walks the Fine Line of AI Bubble Fears\n\nAdam Clark\nTue, December 16, 2025 at 1:36 PM PST 1 min read\n\nIn this article: NVDA\n\nAVGO\n\nAMD\n\nNvidia stock has been hit by worries over an artificial-intelligence bubble but UBS analysts think the concerns are overblown.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "05:33:00",
      "Source": "Yahoo Finance",
      "Title": "Broadcom Stock Got Stomped. Why It’s Still J.P. Morgan’s Top Chip Pick.",
      "URL": "https://finance.yahoo.com/m/9c041391-b953-3858-9c9d-ff19afe929c1/broadcom-stock-got-stomped..html?.tsrc=rss",
      "Content": "Broadcom Stock Got Stomped. Why It’s Still J.P. Morgan’s Top Chip Pick.\n\nAdam Clark\nTue, December 16, 2025 at 1:33 PM PST 2 min read\n\nIn this article: AVGO\n\nJPM\n\nMRVL\n\nNVDA\n\nBroadcom stock has tumbled after its earnings. That's a huge buying opportunity for J.P. Morgan analysts.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "05:18:00",
      "Source": "Yahoo Finance",
      "Title": "These Stocks Moved the Most Today: Tesla, Pfizer, Humana, Circle, CoreWeave, Broadcom, IonQ, Ford, Navan, and More",
      "URL": "https://finance.yahoo.com/m/2b5d4d84-10a9-3167-a024-cdf08bdd0ad0/these-stocks-moved-the-most.html?.tsrc=rss",
      "Content": "These Stocks Moved the Most Today: Tesla, Pfizer, Humana, Circle, CoreWeave, Broadcom, IonQ, Ford, Navan, and More\n\nGeorge Glover\nTue, December 16, 2025 at 1:18 PM PST 2 min read\n\nIn this article: F\n\nTSLA\n\nPFE\n\nHUM\n\nCRWV\n\nStocks were mixed Tuesday as U.S. hiring in November was stronger than expected and the unemployment rate jumped to 4.6%. Ford was up 0.2%. The auto maker announced a pivot toward hybrids and away from electric cars.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "05:11:00",
      "Source": "Yahoo Finance",
      "Title": "Down About 18% From Recent Highs, Is Broadcom Stock a Buy?",
      "URL": "https://www.fool.com/investing/2025/12/16/down-about-18-from-recent-highs-is-broadcom-stock/?.tsrc=rss",
      "Content": "Dec 16, 2025 • By Danny Vena, CPA\nPossible Stock Splits in 2026: 2 Unstoppable Stocks Up 337% and 1,780% in 2 Years to Buy Now, According to Wall Street",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "03:42:54",
      "Source": "Yahoo Finance",
      "Title": "Broadcom (AVGO) Target Jumped at Truist as AI Growth Story Stays Intact",
      "URL": "https://finance.yahoo.com/news/broadcom-avgo-target-jumped-truist-194254786.html?.tsrc=rss",
      "Content": "Broadcom (AVGO) Target Jumped at Truist as AI Growth Story Stays Intact\n\nVardah Gill\nTue, December 16, 2025 at 11:42 AM PST 2 min read\n\nIn this article: AVGO\n\nTFC\n\nANTH.PVT\n\nBroadcom Inc. (NASDAQ: AVGO ) is included among the 15 Best Blue-Chip Stocks with Growing Dividends .\nPhoto by nathan dumlao on Unsplash\nTruist lifted its price target on Broadcom Inc. (NASDAQ:AVGO) to $500 from $365 and kept a Buy rating on the stock. The firm said the latest quarter came in as a “pretty low-drama” earnings beat with higher guidance. While there is some awareness around pressure on gross margins, Truist made it clear that earnings power is the bigger story right now. The stock, in its view, still offers “AI growth with duration.”\n\nBroadcom’s fiscal fourth quarter, which ended November 2, easily cleared expectations. Revenue reached a record $18.01 billion, up 28% from a year earlier. Adjusted EPS climbed 37% to $1.95.That performance topped consensus forecasts by a comfortable margin. Wall Street had been looking for $17.46 billion in revenue and adjusted EPS of $1.87.\nAI continues to be the main engine. Revenue tied to AI jumped 74% year over year, marking the 11th straight quarter of accelerating growth. On the earnings call, CEO Hock Tan said demand for Broadcom Inc. (NASDAQ:AVGO)’s AI accelerators, AI switches, and other data center products remains unprecedented.\nTan also shared an update on customer activity. After placing a $10 billion order last quarter, AI start-up Anthropic added another $11 billion order scheduled to be filled over the next year.\n\nBroadcom Inc. (NASDAQ:AVGO) is an American company that designs and supplies semiconductors and infrastructure software, with products that sit at the core of modern data centers and enterprise systems worldwide.\nWhile we acknowledge the potential of AVGO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 15 Best Stocks to Buy for the Long Term and 11 Best Low Priced Dividend Stocks to Buy According to Analysts .\nDisclosure: None.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "03:13:36",
      "Source": "Yahoo Finance",
      "Title": "S&P 500 and Dow Slip as November Jobs Report Paints Mixed Picture",
      "URL": "https://finance.yahoo.com/news/p-500-dow-slip-november-191336825.html?.tsrc=rss",
      "Content": "S&P 500 and Dow Slip as November Jobs Report Paints Mixed Picture\n\nNauman Khan\nTue, December 16, 2025 at 11:13 AM PST 1 min read\n\nIn this article: AVGO\n\nF\n\nROKU\n\nGTLB\n\n^DJI\n\nThis article first appeared on GuruFocus .\nU.S. stocks opened mixed after a delayed jobs report showed payrolls rose modestly in November while the unemployment rate ticked higher, prompting fresh Fed-watch scrutiny.\nThe Dow Jones Industrial Average slid about 0.4%, the S&P 500 lost about 0.4% and the Nasdaq fell roughly 0.3% in early trading as investors digested the numbers.\n\nWarning! GuruFocus has detected 4 Warning Signs with NVDA.\nIs SPY fairly valued? Test your thesis with our free DCF calculator.\nThe Bureau of Labor Statistics reported nonfarm payrolls increased by 64,000 in November, following a steep October drop, while the jobless rate rose to 4.6%.\nMarket focus shifted to corporate headlines. Ford ( NYSE:F ) rallied after management outlined a major charge tied to its EV strategy, while homebuilder Lennar (LEN) held steady ahead of earnings.\nChip bellwether Broadcom ( NASDAQ:AVGO ) extended a recent slide after an earnings miss and margin warning, adding pressure across tech names.\nSmall-cap movers included Roku ( NASDAQ:ROKU ) and GitLab ( NASDAQ:GTLB ) on analyst activity, and Zillow (Z) after product news. Traders will watch inflation data due Thursday for further Fed clues.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "02:46:00",
      "Source": "Yahoo Finance",
      "Title": "Chip Stocks Are In a Bubble. Here’s More Good News.",
      "URL": "https://finance.yahoo.com/m/1be6f617-c2a5-3cf9-bdb6-04657db83573/chip-stocks-are-in-a-bubble..html?.tsrc=rss",
      "Content": "Chip Stocks Are In a Bubble. Here’s More Good News.\n\nTeresa Rivas\nTue, December 16, 2025 at 10:46 AM PST 3 min read\n\nIn this article: AVGO\n\nLRCX\n\nMU\n\nAMD\n\nNVDA\n\nSemiconductors have accounted for three of the nine industry groups that met the bubble criteria going back to 1991, according to Ned Davis Research Chief Thematic Strategist Pat Tschosik.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "02:07:00",
      "Source": "Yahoo Finance",
      "Title": "From Oracle to Broadcom, the Concerns About Artificial Intelligence Stocks Are Starting to Pile Up",
      "URL": "https://www.fool.com/investing/2025/12/16/oracle-broadcom-concerns-ai-stocks/?.tsrc=rss",
      "Content": "Dec 15, 2025 • By Daniel Foelber\nDown 42% From Its High, Is Oracle the Best AI Growth Stock to Buy in 2026?",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "01:16:00",
      "Source": "Yahoo Finance",
      "Title": "ALAB vs. AVGO: Which AI Infrastructure Stock Is the Better Buy Now?",
      "URL": "https://finance.yahoo.com/news/alab-vs-avgo-ai-infrastructure-171600361.html?.tsrc=rss",
      "Content": "ALAB vs. AVGO: Which AI Infrastructure Stock Is the Better Buy Now?\n\nNilanshi Mukherjee\nTue, December 16, 2025 at 9:16 AM PST 5 min read\n\nIn this article: AVGO\n\nALAB\n\nAstera Lab ALAB and Broadcom AVGO are major players in the AI infrastructure market, specifically in high-speed connectivity solutions like PCIe and CXL retimers and switches. While Astera Labs focuses on PCIe 6, CXL, and Ethernet products, Broadcom has established itself as a long-standing leader in PCIe switches and infrastructure software.\n\nPer the Mordor Intelligence report, the AI Infrastructure Market is estimated to be worth $87.60 billion in 2025. It is expected to grow to $197.64 billion by 2030, at a CAGR of 17.71% during the forecast period from 2025 to 2030. Both ALAB and AVGO are expected to benefit from this rapid growth pace.\n\nSo, ALAB or AVGO — Which of these AI Infrastructure stocks has the greater upside potential? Let’s find out.\n\nThe Case for ALAB Stock Astera Lab is benefiting from the broad-based demand across its product lines, including Scorpio P-Series fabric switches, Aries PCIe 6 retimers, and Taurus Ethernet smart cable modules. Aries PCIe 6 solutions contributed more than 20% of third-quarter revenues, highlighting ALAB’s leadership in the PCIe 6 retimer market.\n\nAstera Labs is rapidly expanding its portfolio to address the growing demands of AI infrastructure and connectivity solutions. The company recently announced plans to deliver custom connectivity solutions leveraging its COSMOS architecture and new photonic chiplet capabilities to support hyperscalers building NVLink-enabled, heterogeneous AI infrastructure.\n\nUA Link offers a significant growth opportunity for Astera Labs. UA Link combines the memory semantics of PCIe with the high speed of Ethernet, but is devoid of the software complexity and performance limitations inherent to Ethernet. ALAB expects to deliver UA Link solutions in 2026 to solve scale-up connectivity challenges for next-generation AI infrastructure. The growing proliferation of UA Link is expected to be a multibillion-dollar additional market opportunity for Astera Labs by 2029.\n\nAstera Labs also benefits from a rich partner base that includes top companies such as Microsoft, NVIDIA, Advanced Micro Devices, Micron Technology, and Intel.\n\nThe Case for AVGO Stock Broadcom is expanding its footprint in the PCIe retimers market by developing advanced solutions that enhance signal quality and extend the reach of PCIe connections in high-speed data environments. The company’s launch of PCIe Gen 6 portfolio, featuring high-port switches and retimers tested for interoperability with partners like Micron and Teledyne LeCroy, is a noteworthy development.\n\nThe company is benefiting from strong demand for its networking products and custom AI accelerators. Broadcom’s AI revenue grew 65% year over year in fiscal 2025, reaching $20 billion. This growth is driven by AI semiconductors and infrastructure software, with AI revenue expected to double year over year to $8.2 billion in the first quarter of fiscal 2026.\n\nBroadcom’s AI networking segment also experienced strong demand, with a $10 billion order backlog for AI switches, including the 102-terabit-per-second Tomahawk 6 switch. The company has secured record orders for DSPs, optical components, and PCI Express switches, all of which contribute to its total AI-related order backlog of $73 billion in the fourth quarter of fiscal 2026. This backlog represents nearly half of Broadcom’s consolidated backlog of $162 billion.\n\nBroadcom’s innovative products are also playing a crucial role in its expansion. In November, the company announced the availability of the Brocade X8 Directors and Brocade G820 56-port switch, the industry’s first 128G Fibre Channel platforms designed for mission-critical workloads and enterprise AI applications.\n\nStory Continues\nPrice Performance and Valuation of ALAB and AVGO In the trailing six-month period, ALAB and AVGO’s shares have gained 54.6% and 36.2%, respectively. The outperformance of ALAB stock can be attributed to its robust and diversified product portfolio, as well as its expanding partner base.\n\nDespite AVGO’s strong portfolio, along with an expanding partner base, the company is suffering from a slight decline in gross margin due to a higher AI revenue mix and semiconductor product costs.\n\nALAB and AVGO Stock Performance\nImage Source: Zacks Investment Research\nValuation-wise, ALAB and Broadcom shares are currently overvalued as suggested by a Value Score of F and D, respectively.\n\nIn terms of forward 12-month Price/Sales, ALAB shares are trading at 21.11X, higher than Broadcom’s 18.02X.\nALAB and AVGO Valuation\nImage Source: Zacks Investment Research\nHow Do Earnings Estimates Compare for ALAB & AVGO? The Zacks Consensus Estimate for ALAB’s 2025 earnings is currently pegged at $1.78 per share, which has remained unchanged over the past 30 days, indicating a 111.90% year-over-year rise.\nAstera Labs, Inc. Price and Consensus Astera Labs, Inc. price-consensus-chart | Astera Labs, Inc. Quote\nThe Zacks Consensus Estimate for Broadcom’s 2025 earnings is currently pegged at $9.20 per share, which has increased 1.54% over the past 30 days, indicating a 34.90% year-over-year rise.\nBroadcom Inc. Price and Consensus Broadcom Inc. price-consensus-chart | Broadcom Inc. Quote\nConclusion While both ALAB and AVGO are well-positioned to capitalize on the booming AI infrastructure market, AVGO offers higher growth potential due to its massive AI backlog, diversified revenue streams, and stronger earnings.\n\nAstera Labs’ strong fundamentals, expanding partnerships, and rising AI demand reinforce its leadership in connectivity solutions. However, challenging macroeconomic uncertainties and stiff competition remain a headwind.\n\nCurrently, Broadcom carries a Zacks Rank #2 (Buy), making the stock a stronger pick than Astera Lab, which has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nAstera Labs, Inc. (ALAB) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "00:38:58",
      "Source": "Yahoo Finance",
      "Title": "Nvidia and Broadcom Are Wall Street's Top Chip Picks for 2026",
      "URL": "https://finance.yahoo.com/news/nvidia-broadcom-lead-bank-americas-161455468.html?.tsrc=rss",
      "Content": "Nvidia and Broadcom Are Wall Street's Top Chip Picks for 2026\n\nNauman Khan\nTue, December 16, 2025 at 8:38 AM PST 1 min read\n\nIn this article: NVDA\n\nAVGO\n\nLRCX\n\nKLAC\n\nADI\n\nThis article first appeared on GuruFocus .\nNvidia ( NASDAQ:NVDA ), Broadcom ( NASDAQ:AVGO ) and Lam Research ( NASDAQ:LRCX ) are highlighted by Bank of America as top semiconductor stocks for 2026, amid ongoing growth in AI-related spending.\nAnalysts see next year as a midpoint in an extended cycle of IT infrastructure upgrades driven by AI and accelerated workloads. They noted some short-term volatility could persist as investors weigh returns, but demand from enterprise, hyperscale, and government customers is expected to provide steady support.\n\nWarning! GuruFocus has detected 4 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nOther favored large-cap names include KLA Corp. (KLAC), Analog Devices ( NASDAQ:ADI ) and Cadence Design Systems (CDNS). Small- and mid-cap picks include Credo Technology ( NASDAQ:CRDO ), MKS (MKSI), Macom Technology Solutions (MTSI), Teradyne (TER) and Advanced Energy Industries ( NASDAQ:AEIS ).\nBank of America projects another year of strong AI semiconductor growth, backed by tight supply and high data center usage. Advanced Micro Devices (AMD) also stands out in the AI chip space.\nThe firm cautioned that analog chips may face pressure from softer industrial activity and rising competition. Emerging trends in 2026 include co-packaged optics, robotics and quantum, with Lumentum ( NASDAQ:LITE ) and Coherent (COHR) positioned as potential leaders.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 18
}