{
  "stock_id": "AVGO",
  "last_updated": "2025-12-29T20:11:16.043Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-30",
      "Time": "03:30:00",
      "Source": "Yahoo Finance Video",
      "Title": "AI chipmakers that could steal some of Nvidia's spotlight in 2026",
      "URL": "https://finance.yahoo.com/video/ai-chipmakers-could-steal-nvidias-193000972.html",
      "Content": "AI chipmakers that could steal some of Nvidia's spotlight in 2026\n\nYahoo Finance Video and Jared Blikre\nMon, December 29, 2025 at 11:30 AM PST\n\nIn this video: NVDA\n\nAMD\n\nAVGO\n\nARM\n\nNvidia ( NVDA ) announced a deal to acquire AI hardware and software designer Groq ( GROQ.PVT ) for $20 billion last week. While the semiconductor manufacturer remained a major AI player in 2025, who could be some of Nvida's biggest competition in the fast-approaching 2026?\nTECHnalysis Research, LLC President Bob O'Donnell sits down with Yahoo Finance markets and data editor Jared Blikre on Market Catalysts to discuss which chipmaker could gain more prominence next year.\nAlso catch Bob O'Donnell's predictions for agentic AI in 2026 as it relates to cybersecurity usage.\nTo watch more expert insights and analysis on the latest market action, check out more Market Catalysts .\n\nVideo Transcript\n\n00:00 Jared\nAnd another thing people have been uh some of the critics have been pouuncing on is all the spending, the capital expenditures, so-called CAPEX. Uh we saw that it's been exploding over the last few years. It's set to continue next year. But uh we've seen in the Mag 5, for instance, we used to kind of talk about them or the Mag 7 uh as a whole. It's really only Alphabet and Nvidia, maybe Tesla as a come behind story that have really surged this year. So is it a game of have and have nots or how do you see this playing out?\n00:32 Bob\nNo, it's a great question. I mean, look, I think Nvidia obviously continues to do well, but I also am certain that Nvidia is going to heck get a heck of a lot more competition in 2026. AMD is, you know, an obvious one, but there's a lot of other little players. I mean, you know, Nvidia's uh deal with Grock recently to bring more of their technology in is a reflection of the fact that we're seeing more specialized types of models being developed. We're we're going from the days of big general purpose LLMs that you can use for everything to much more specialized areas. And each of those are going to require different types of hardware and I think in turn that's going to create additional opportunities, but it's going to create more diversity, which is going to be a little harder to figure out. But obviously I think, you know, you're going to continue to see folks like Nvidia and AMD do well. I do, as I said, I think you're going to start to see uh some of the smaller the cloud guys who are doing custom chips often through Broadcom will also start to benefit. We've seen already, you know, Google's been doing more with TPUs, uh Amazon has their Graviton chips. Um, we've got a a bunch of other companies. Microsoft is doing custom chips. A lot of these are arm-based. So arm is another company, you know, we haven't been talking about them a lot lately, but arm's helping drive some of this innovation. Intel, as you've talked about, you know, is doing well. They continue to plug away. Obviously, they had their challenges last year, but things are looking better in 2026. So, I think we're going to see a lot of different players uh from different areas uh all start to come together. And we'll see some smaller companies. Uh there's a little company called SiTime that does uh timing chips and all these networks have to be completely aligned from a timing perspective. They're doing some interesting stuff. So, I think there's a lot of different opportunities in different areas. Um but we're going to have a lot of the bears on the side just again, waiting to pounce on these oper these concerns that get raised, I think around a gentic AI.\n02:29 Jared\nAnd we'll have to see if those are dips worth buying or not. And Bob, what I'm realizing is we got to do another podcast real soon. So thank you for showing up.\n02:39 Bob\nYeah, man, I'd love to.\n02:40 Jared\nIt was great seeing you here.\n02:41 Bob\nThanks, Jared.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "01:30:46",
      "Source": "24/7 Wall St.",
      "Title": "Billionaires Dump the Magnificent Seven and Load Up on These Stocks",
      "URL": "https://finance.yahoo.com/m/d55fce68-c7c0-3d3c-b684-9e2856308324/billionaires-dump-the.html",
      "Content": "Billionaires Dump the Magnificent Seven and Load Up on These Stocks\n\nVandita Jadeja\nMon, December 29, 2025 at 9:30 AM PST 5 min read\n\nIn this article: NVDA\n\nAMZN\n\nPLTR\n\nADBE\n\nAVGO\n\nQuick Read Billionaire Stanley Druckenmiller fully exited Nvidia and Palantir positions.\nKen Griffin reduced his Amazon stake by 39% by selling 2.1 million shares.\nBridgewater Associates and Tiger Global Management increased their positions in Adobe and Broadcom.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "23:48:09",
      "Source": "Yahoo Finance Video",
      "Title": "Chip sales could top $1T in 2026. Is Nvidia still top AI play?",
      "URL": "https://finance.yahoo.com/video/chip-sales-could-top-1t-154809053.html",
      "Content": "Chip sales could top $1T in 2026. Is Nvidia still top AI play?\n\nYahoo Finance Video and Brian Sozzi\nMon, December 29, 2025 at 7:48 AM PST\n\nIn this video: NVDA\n\nMSFT\n\nADI\n\nKLAC\n\nAMZN\n\nWhile Nvidia ( NVDA ) was one of the standout winners of the AI trade in 2025, will the chipmaker remain a tried-and-true stock pick in 2026?\nWinthrop Capital Chief Investment Officer Adam Coons weighs in on the importance of diversification in the artificial intelligence ecosystem, especially as Bank of America analysts forecast semiconductor sales to top $1 trillion next year. Yahoo Finance senior reporter Brooke DiPalma also joins the discussion.\nTo watch more expert insights and analysis on the latest market action, check out more Opening Bid .\n\nVideo Transcript\n\n00:00 Speaker A\nAdam, what's the the best course of action for the average investor? Do they waste a whole day trying to find the next big play in AI or do they just say, you know what? Nvidia's going to win this whole damn thing? I'm just going to bet on them again next year.\n00:15 Adam\nYeah, I definitely wouldn't uh just bet on Nvidia. I I think you do need to do your homework if you want to buy specific names. I think probably the general investor is probably better finding some sort of basket to kind of play the overall space. Uh but we're very early innings in this and\n00:41 Adam\nobviously Nvidia is the winner right now, but uh to say, you know, in five years that we look back that they're going to be the dominant player still, very, very unlikely. Like I said, this is really an evolving space. So I I would be careful with something that's so specific as Nvidia. Uh we kind of like to barbell this with, you know, something like the the big hyperscaler like a like an Alphabet Google, uh because that's really the type of name that uh you could probably have a little bit more comfort in because they just\n01:14 Adam\noverall, the AI story is just benefiting an already existing business model that was doing well. So, I think you would just want to be careful with what we're calling kind of the one trick ponies, like a Nvidia, uh a Core Weve or a Patier right now.\n01:31 Speaker A\nUh, Brooke, let me get over to you because I think what you're seeing in industrial metals and some of the things that Adam's talking about fits nicely with what we heard from Ed Yardini this morning that he might see it is likely to see we are likely to see a broadening out in this rally. Investors doing their homework, trying to get outside of the tried and true Mag 7.\n01:53 Brooke\nYeah, Brian, what we did hear from Ed Danny over the weekend was really ongoing momentum in this market in 2026. He maintained that year end target for the S&P 500 of 7,700 and he said largely it won't be really led by uh the Mag 7, but also what he called the impressive 493 of the S&P 500 as really this broadening out, this boost in productivity growth really leads to overall returns for the\n02:26 Brooke\nS&P 500 in 2026. Specifically, you know, he went on to say that that is really where exactly investors should be thinking about this mindset. You know, not really overweight technology, but more so thinking about the other users of AI as opposed to just the producers of AI. And so certainly he's not alone in this uh momentum that he thinks will exist within 2026 ongoing from what we've seen so far in the returns in 2025.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "23:01:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Slips as Groq Deal Raises Questions",
      "URL": "https://finance.yahoo.com/m/95a0cad5-3b27-3e4d-87f7-d72c690058be/nvidia-stock-slips-as-groq.html",
      "Content": "Nvidia Stock Slips as Groq Deal Raises Questions\n\nAdam Clark\nMon, December 29, 2025 at 7:01 AM PST 3 min read\n\nIn this article: NVDA\n\nGROQ.PVT\n\nAMD\n\nAVGO\n\nNvidia was dropping early on Monday. Broader jitters about the technology sector looked to be hurting the stock, while Wall Street assessed the reported $20 billion price tag put on Nvidia’s agreement to license technology from artificial intelligence chip start-up Groq. Nvidia shares were down 1.6% at $187.45 in early trading, while the technology-heavy Nasdaq Composite lost 0.4%.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "21:24:02",
      "Source": "Investor's Business Daily",
      "Title": "AI Stocks Face 'Show Me' Moment: Why OpenAI's Success Or Failure Is Key",
      "URL": "https://finance.yahoo.com/m/684c930d-1475-3adc-b013-ae604c056ebc/ai-stocks-face-%27show-me%27.html",
      "Content": "AI Stocks Face 'Show Me' Moment: Why OpenAI's Success Or Failure Is Key\n\nREINHARDT KRAUSE\nMon, December 29, 2025 at 5:24 AM PST 9 min read\n\nIn this article: NVDA\n\nAVGO\n\nORCL\n\nPLTR\n\nGOOG\n\nOpenAI news often drives many AI stocks up or down. Many tech companies have a stake in OpenAI's success or failure in 2026 and beyond.\n\nContinue Reading\n\nCGU et Politique de confidentialité\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "21:21:11",
      "Source": "24/7 Wall St.",
      "Title": "An Actively Managed AI ETF Put 18% Into Two Chip Giants Just Ahead of Massive Infrastructure Buildout",
      "URL": "https://finance.yahoo.com/m/3a5c1b5b-1744-3ca0-b848-b09f050d5c3d/an-actively-managed-ai-etf.html",
      "Content": "An Actively Managed AI ETF Put 18% Into Two Chip Giants Just Ahead of Massive Infrastructure Buildout\n\nMichael Williams\nMon, December 29, 2025 at 5:21 AM PST 4 min read\n\nIn this article: NVDA\n\nAVGO\n\nQuick Read BAI holds $8B in assets with nearly 60% in information technology. NVIDIA and Broadcom alone represent 18% of the fund.\nGoldman Sachs projects AI infrastructure spending will exceed $500B in 2026, up from roughly $400B in 2025.\nThe fund’s 56% turnover allows rotation across the AI stack but concentrates 40% in seven names.\nIf you’re thinking about retiring or know someone who is, there are three quick questions causing many Americans to realize they can retire earlier than expected. take 5 minutes to learn more here\n\nThe iShares AI Innovation and Tech Active ETF ( NYSEARCA:BAI ) launched in October 2024 to capture the entire AI infrastructure buildout in one actively managed package. With $8 billion in assets and a 0.55% expense ratio, the fund takes a concentrated approach to AI exposure across the technology stack.\nWith $8 billion in assets and a 0.55% expense ratio, BAI takes a full-stack approach to AI exposure. Nearly 60% sits in information technology, led by NVIDIA ( NASDAQ:NVDA ) at 9.5% and Broadcom ( NASDAQ:AVGO ) at 8.8%. The next tier includes hyperscalers Microsoft ( NASDAQ:MSFT ), Alphabet ( NASDAQ:GOOGL ), and Meta ( NASDAQ:META ), plus software plays like Snowflake ( NYSE:SNOW ) and Palantir ( NYSE:PLTR ). It's a who's-who of AI infrastructure, from chips to cloud to enterprise software.\nThis infographic outlines how the iShares BAI ETF invests in the AI infrastructure buildout, detailing its strategy, suitable use cases, and key pros and cons for investors.\nWhat Drives This Trade in 2026 The single macro factor that matters most: hyperscaler capital expenditure. Goldman Sachs ( NYSE:GS ) Research projects AI companies will spend over $500 billion on infrastructure in 2026, up from roughly $400 billion in 2025. That spending flows directly to BAI's top holdings. Microsoft, Google, Meta, and Amazon ( NASDAQ:AMZN ) are building data centers, buying NVIDIA GPUs, and deploying custom silicon at unprecedented scale. When Azure grows 40% year-over-year or Google Cloud expands 34%, that revenue translates into orders for semiconductors, networking gear, and software platforms.\n\nWatch quarterly earnings from the hyperscalers, particularly their capex guidance. Microsoft, Alphabet, and Meta report fiscal results in January, April, July, and October. Any upward revision to infrastructure spending signals sustained demand for BAI's semiconductor and hardware holdings. If capex growth slows below 25%, the valuation premium on AI infrastructure stocks compresses quickly.\nPortfolio Mechanics and Concentration Risk BAI's active management means turnover runs at 56%, well above passive index funds. That flexibility allows managers to rotate between chip makers, cloud platforms, and emerging software plays as the AI landscape evolves. Check the fund's monthly fact sheet on iShares' website to track changes in sector allocation and top 10 concentration.\n\nStory Continues\nThe fund's concentration is both strength and vulnerability. NVIDIA and Broadcom alone represent 18% of assets. Add the hyperscalers and you're approaching 40% in just seven names. This amplifies returns when AI infrastructure spending accelerates, but any stumble in semiconductor demand or cloud growth hits hard. The 56% turnover suggests active rebalancing, but investors should monitor whether the fund maintains its chip-heavy tilt or rotates toward software as enterprise AI adoption matures.\n\nConsider the Broader Play For comparison, the iShares Robotics and Artificial Intelligence Multisector ETF ( NYSEARCA:IRBO ) offers similar AI exposure with a 0.47% expense ratio and longer track record since 2018. IRBO spreads risk across 92 holdings versus BAI's more concentrated approach, making it a steadier option for investors prioritizing diversification over maximum AI infrastructure exposure.\n\nFor 2026, hyperscaler capex guidance and BAI's quarterly rebalancing will be key indicators. Goldman Sachs Research projects infrastructure spending above $500 billion, which would support continued demand for the fund's semiconductor and cloud holdings.\nThe New Report Shaking Up Retirement Plans You may think retirement is about picking the best stocks or ETFs, but you’d be wrong. Even great investments can be a liability in retirement. It’s a simple difference between accumulating vs distributing, and it makes all the difference.\nThe good news? After answering three quick questions many Americans are reworking their portfolios and finding they can retire earlier than expected. If you’re thinking about retiring or know someone who is, take 5 minutes to learn more here .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "21:19:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Slips. Why Its Groq Deal Raises Questions.",
      "URL": "https://finance.yahoo.com/m/95a0cad5-3b27-3e4d-87f7-d72c690058be/nvidia-stock-slips.-why-its.html",
      "Content": "Nvidia Stock Slips. Why Its Groq Deal Raises Questions.\n\nAdam Clark\nMon, December 29, 2025 at 5:19 AM PST 2 min read\n\nIn this article: NVDA\n\nGROQ.PVT\n\nAMD\n\nAVGO\n\nNvidia was edging down early on Monday. Broader jitters about the technology sector looked to be hurting the stock, while Wall Street assessed the reported $20 billion price tag put on Nvidia’s agreement to license technology from artificial intelligence chip start-up Groq. Nvidia shares were down 1.1% at $188.49 in premarket trading.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "18:58:00",
      "Source": "Zacks",
      "Title": "Zacks Investment Ideas feature highlights: Nvidia, Broadcom, Vertiv and Alphabet",
      "URL": "https://finance.yahoo.com/news/zacks-investment-ideas-feature-highlights-105800503.html",
      "Content": "Zacks Investment Ideas feature highlights: Nvidia, Broadcom, Vertiv and Alphabet\n\nZacks Equity Research\nMon, December 29, 2025 at 2:58 AM PST 8 min read\n\nIn this article: VRT\n\nNVDA\n\nAVGO\n\nGOOG\n\nFor Immediate Release Chicago, IL &ndash; December 29, 2025 &ndash; Today, Zacks Investment Ideas feature highlights Nvidia NVDA, Broadcom AVGO, Vertiv VRT and Alphabet GOOGL.\n3 Leading AI Stocks Investors Can Buy for 2026\nThe market, and many leading AI stocks, are at an inflection point. In the near term, further volatility or even a pullback is possible. However, the longer-term opportunity remains compelling, with upside potential that extends well into 2026 and beyond.\n\nAI capital spending is projected to reach an estimated $571 billion in 2026, and Nvidia , Broadcom and Vertiv sit at the center of this historic infrastructure buildout. These companies are among the most critical enablers of the AI expansion.\nAfter running multiple screens focused on growth, valuation, and margin strength, these three names consistently rose to the top. Collectively, they represent exceptional businesses with durable competitive advantages and strong earnings power.\nDespite their leadership positions, these stocks are not stretched on valuation and in recent weeks have experienced earnings upgrades, giving two of them top Zacks Ranks.\nRecent months have been choppy in these stocks, with prices moving sideways to lower, leaving shares near technically important levels. Whether those levels hold or break in the short term is uncertain, but the risk-reward profile remains attractive at current prices regardless.\n\nEven if further downside materializes and bearish narratives resurface, any weakness is unlikely to persist given the scale and durability of AI-driven demand. If support holds, these stocks may already be positioning for their next leg higher.\nBelow, I will break down the recent developments, fundamental strength of these businesses and highlight a tactical trading plan using the technical charts.\nNvidia Stocks Breaks Out on Bullish Developments\nNvidia continues to anchor the AI boom as the critical infrastructure provider through its leadership in GPU technology. While 2025 was comparatively subdued for the now roughly $4.5 trillion semiconductor giant, with shares delivering a tidy 42% return, the company has remained firmly on offense.\nOver the past week, Nvidia advanced its largest acquisition to date, agreeing to acquire assets from AI chip startup Groq in a deal valued at approximately $20 billion. Groq, founded by former Google TPU architects, develops high-performance inference-focused silicon that competes in certain AI workloads. While Groq described the transaction as a &ldquo;non-exclusive licensing agreement,&rdquo; the deal includes the integration of Groq&rsquo;s CEO and senior leadership into Nvidia, signaling deeper strategic alignment.\n\nStory Continues\nFrom a competitive standpoint, the acquisition strengthens Nvidia&rsquo;s already formidable moat at the leading edge of AI semiconductors.\nFundamentals also continue to move in the right direction. Analysts have resumed raising earnings estimates, earning Nvidia a Zacks Rank #2 (Buy) . Consensus forecasts for next year&rsquo;s earnings have climbed nearly 16% over the past two months, and longer-term projections call for 46.3% annual EPS growth over the next three to five years. At roughly 40.6x forward earnings, the valuation remains reasonable given Nvidia&rsquo;s growth profile and its central role in the most powerful technology cycle in more than a decade.\n\nThe technical picture has also improved meaningfully. After months of choppy, volatile trading marked by sharp rallies and pullbacks, NVDA has made a decisive bullish turn. During the low-volume holiday period, the stock broke out from a clear descending bullish wedge, marking its most constructive advance in several months. As long as shares hold above the breakout level, the setup points to further upside as 2026 begins.\nBroadcom Shares Consolidate at Key Price Level\nBroadcom has been a core beneficiary of the AI boom since the trend began, but its importance has become even more apparent in recent months. After being viewed as a relative laggard for several years, Alphabet has reasserted itself as a leader in AI and large language models. A major driver of that shift has been renewed appreciation for Alphabet&rsquo;s proprietary hardware stack, most notably its Tensor Processing Units (TPUs), which Google has deployed internally for nearly a decade.\n\nBroadcom plays a critical role in that ecosystem. While TPUs are branded as Google-designed chips, Broadcom provides the underlying expertise in ASIC design, networking, and high-speed I/O, effectively enabling Google to scale these systems reliably at hyperscale. As Alphabet rapidly expands AI infrastructure across Search, cloud services, and generative AI models, custom silicon becomes economically unavoidable. Broadcom sits squarely at the center of that transition, helping design chips optimized for inference, training, and internal workloads, areas where generic GPUs are often less cost-efficient. As Alphabet&rsquo;s AI leadership has become clearer, Broadcom&rsquo;s strategic importance has risen alongside it.\nFrom a fundamentals perspective, Broadcom currently carries a Zacks Rank #3 (Hold) , reflecting a pause in earnings revisions rather than any deterioration in outlook. Consensus estimates still call for 35.7% annual EPS growth over the next three to five years, and the stock trades at roughly 36x one-year forward earnings. Given that growth profile and Broadcom&rsquo;s deep entrenchment in the AI infrastructure stack, valuation remains reasonable relative to peers.\n\nTechnically, Broadcom had been outperforming much of the AI complex in recent months as investors increasingly recognized its role within the Alphabet AI ecosystem. The sharp selloff following its most recent earnings report was less about weakening fundamentals and more about positioning and nuanced guidance, a classic &ldquo;sell-the-news&rdquo; event after a strong run. Importantly, shares found support at a level that has held up the stock since late summer. As long as that support holds, the consolidation looks constructive, and the near-term technical outlook remains encouraging.\nVertiv Stock Sits Within Trading Range\nVertiv remains one of the purest plays on the physical backbone of the AI buildout, supplying critical power, cooling, and thermal-management solutions to hyperscale and enterprise data centers. Recent developments continue to reinforce that positioning. Over the past several months, Vertiv has announced expanded partnerships with large data center operators and hyperscalers, while management has highlighted strong backlog growth and improving visibility tied directly to AI-driven capacity expansion. Demand for high-density cooling solutions continues to exceed expectations as next-generation AI workloads push power and thermal limits higher.\n\nFundamentally, the story remains compelling. Vertiv currently carries a Zacks Rank #2 (Buy) as earnings estimates continue to trend higher. Consensus forecasts call for 30.2% annual EPS growth over the next three to five years, reflecting operating leverage, improving margins, and sustained AI-related demand. While the stock trades at a 40.6x forward earnings multiple, that valuation appears justified given Vertiv&rsquo;s growth rate, expanding addressable market, and increasingly important role in AI infrastructure.\nThe technical setup adds another layer of appeal. After a sharp advance earlier in the cycle, VRT has spent recent months consolidating within a well-defined trading range. Importantly, the stock recently bounced cleanly off support within its rising channel. The key level to watch on the upside is the ~$180 area, which marks the top of the current range. A decisive breakout above that level would likely signal the next leg higher, while continued support near the lower end of the channel keeps the risk-reward profile attractive.\n\nTaken together, Vertiv offers a differentiated way to participate in the AI boom&mdash;not through chips or software, but through the indispensable infrastructure that makes large-scale AI deployment possible. With fundamentals strengthening and the technical picture improving, VRT remains well positioned as investors look ahead to 2026.\nShould Investors Buy Shares in VRT, NVDA and AVGO?\nTaken together, Nvidia, Broadcom, and Vertiv offer complementary exposure to the core layers of the AI buildout&mdash;compute, custom silicon and networking, and physical infrastructure. While near-term volatility is always possible, fundamentals, earnings momentum, and long-term demand visibility remain firmly intact. With each stock positioned at a critical point in the AI value chain and trading near technically important levels, the current setup favors accumulation opportunistically as the AI investment cycle extends into 2026 and beyond.\n\nFree: Instant Access to Zacks' Market-Crushing Strategies\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\nToday you can tap into those powerful strategies &ndash; and the high-potential stocks they uncover &ndash; free. No strings attached.\nGet all the details here >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nVertiv Holdings Co. (VRT) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "12:55:27",
      "Source": "Associated Press Finance",
      "Title": "Stocks slip on Wall Street as 2025 winds down",
      "URL": "https://finance.yahoo.com/news/asian-shares-mixed-quiet-holiday-045527800.html",
      "Content": "Stocks slip on Wall Street as 2025 winds down\n\nDAMIAN J. TROISE\nSun, December 28, 2025 at 8:55 PM PST 1 min read\n\nIn this article: CL=F\n\nGC=F\n\n^GSPC\n\n^DJI\n\n^IXIC\n\nNEW YORK (AP) — Stocks slipped in morning trading on Wall Street Monday to kick off another holiday-shortened week.\nThe S&P 500 fell 0.4%. With just three trading days left in 2025, the benchmark index is still up more than 17% for the year and it remains on track for its eighth monthly gain in a row.\n\nThe Dow Jones Industrial Average fell 144 points, or 0.3%, as of 10:01 a.m. Eastern. The Nasdaq composite fell 0.6%.\nBig technology stocks with outsized valuations were among the heaviest weights on the market. Nvidia fell 2% and Broadcom fell 1.3%.\nEnergy stocks gained ground along with rising oil prices. U.S. benchmark crude jumped 2.4% to $58.11 per barrel. The price of Brent crude, the international standard, rose 2.2% to $61.56 a barrel.\nExxon Mobil rose 0.9%.\nGold prices pulled back after recent sharp gains. The price of gold slumped 3.5%, though prices for the precious metal are still up about 66% for the year.\nWall Street faces another short week in the final stretch of 2025. Markets in the U.S. will be closed on Thursday for New Year's Day.\nTreasury yields fell in the bond market. The yield on the 10-year Treasury fell to 4.12% from 4.13% late Friday.\nMarkets in Europe and Asia were mixed. Shares in Taiwan were higher even after China’s military said it was conducting drills around the self-governed island that Beijing claims as its territory. Taiwan's benchmark Taiex gained 0.9%, but the Hang Seng in Hong Kong gave up early gains, falling 0.7%.\n___\nElaine Kurtenbach contributed to this story.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "02:15:52",
      "Source": "Insider Monkey",
      "Title": "Here’s What Kim Forrest and William Kerwin Think About Broadcom Inc (AVGO)",
      "URL": "https://finance.yahoo.com/news/kim-forrest-william-kerwin-think-181552611.html",
      "Content": "Here’s What Kim Forrest and William Kerwin Think About Broadcom Inc (AVGO)\n\nTalha Qureshi\nSun, December 28, 2025 at 10:15 AM PST 2 min read\n\nIn this article: AVGO\n\n​Broadcom Inc. (NASDAQ: AVGO ) is one of the Best Quality Stocks to Buy Before 2026 . Broadcom Inc. (NASDAQ:AVGO) topped Wall Street estimates during its fiscal Q4 2025 earnings, released on December 11. However, the stock price has fallen more than 16% since the release.\n​To talk about the earnings and the market selloff that followed, Kim Forrest, founder and chief investment officer at Bokeh Capital Partners LLC, and William Kerwin of Morningstar appeared on a Schwab Network interview on December 13. Kim noted that at the first appearance, the numbers looked great as they exceeded Street expectations, and demand looked good as well. However, the earnings call shifted the sentiment based on some products waiting for shipment, larger than anticipated backlog, and a 100 basis point decline in margins. Kim added that while the results were not bad, the AI investor sentiment has shaped in a way that if a company does not exceed expectations greatly, the sentiment turns negative.\n​William also expressed surprise over the market reaction. He noted that the investment case for Broadcom Inc. (NASDAQ:AVGO) remains intact, driven by accelerating AI demand. He highlighted that the company enjoys a significant benefit based on its co-designed TPU chip with Google, which has also seen immense demand. William added that Morningstar remains bullish on the stock, similar to Kim Forrest of Bokeh Capital Partners.\n\n​Broadcom Inc. (NASDAQ:AVGO) designs, develops, and supplies various semiconductor devices and infrastructure software solutions worldwide. The company operates in two segments: Semiconductor Solutions and Infrastructure Software.\nWhile we acknowledge the potential of AVGO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "00:48:05",
      "Source": "Insider Monkey",
      "Title": "Deutsche Bank Is Bullish On Broadcom Inc. (AVGO)",
      "URL": "https://finance.yahoo.com/news/deutsche-bank-bullish-broadcom-inc-164805992.html",
      "Content": "Deutsche Bank Is Bullish On Broadcom Inc. (AVGO)\n\nFatima Gulzar\nSun, December 28, 2025 at 8:48 AM PST 2 min read\n\nIn this article: AVGO\n\nDB\n\nORCL\n\nBroadcom Inc. (NASDAQ: AVGO ) is among the Growth Stock Portfolio: 12 Stock Picks By Ken Fisher .\nOn December 12, 2025, Thefly reported that Deutsche Bank increased its price objective for Broadcom Inc. (NASDAQ:AVGO) from $400 to $430 while keeping a buy rating. The business highlighted the company’s fiscal fourth-quarter performance, labeling growth as impressive. As stated in the commentary, the firm pointed out that although the results showed good performance, the growth came at a cost.\n\nOn December 12, Broadcom Inc. (NASDAQ:AVGO) warned that increasing sales of lower-margin custom AI chips would decrease profitability, which caused the company’s stock to drop more than 11%. Following a 10.8% decline in Oracle shares the day before due to debt-funded AI infrastructure expenditure, the margin warning heightened investor fears about returns from significant AI spending. The business stated that the margins will remain under pressure due to a higher proportion of AI sales, despite reporting a $73 billion backlog to ship in the next 18 months.\nThe stock has increased by over 46.72% so far this year. Melius Research’s Ben Reitzes stated that, considering the high spending plans, panic is premature.\nMeanwhile, the announcement of a new custom AI chip in 2026, a new $11 billion order for an AI chip from Anthropic for the second half of 2026, and guidance for artificial intelligence revenue in the January quarter were all significant highlights of the last quarter.\n\nBroadcom Inc. (NASDAQ:AVGO) is one of the world’s leading semiconductor businesses, and it has expanded into infrastructure software.\nWhile we acknowledge the potential of AVGO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 10 High-Growth EV Stocks to Invest In and 13 Best Car Stocks to Buy in 2025 .\nDisclosure. None\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "00:36:00",
      "Source": "Motley Fool",
      "Title": "What Is the Best Artificial Intelligence (AI) Stock to Hold for the Next 10 Years?",
      "URL": "https://finance.yahoo.com/m/92e033bd-467e-3790-a963-523cff98bcb6/what-is-the-best-artificial.html",
      "Content": "What Is the Best Artificial Intelligence (AI) Stock to Hold for the Next 10 Years?\n\nAdam Spatacco, The Motley Fool\nSun, December 28, 2025 at 8:36 AM PST 5 min read\n\nIn this article: TSM\n\nNVDA\n\nAMD\n\nAVGO\n\nMU\n\nKey Points Chip designers such as Nvidia, Advanced Micro Devices, and Broadcom serve as the backbone of generative AI development.\nWhile chip designers steal the spotlight, Taiwan Semiconductor Manufacturing is playing a hugely important supporting role in the background.\nAs demand for AI chips and data centers accelerates, Taiwan Semi is poised for explosive long-term growth.\n10 stocks we like better than Taiwan Semiconductor Manufacturing ›\n\nFor the last three years, investing in semiconductor stocks has proven to be a profitable decision given the critical role chips play in the development of generative artificial intelligence (AI). Companies such as Nvidia , Advanced Micro Devices , Broadcom , and Micron Technology have been some of the biggest contributors to the semiconductor industry throughout the artificial intelligence (AI) revolution.\nFlying under the radar is another chip company whose storyline seems muted compared to its peers. That's Taiwan Semiconductor Manufacturing (NYSE: TSM) , the pick-and-shovel specialist of the chip realm.\nLet's dive into Taiwan Semi's increasingly important role for the future of AI and assess why the stock looks like a no-brainer buying opportunity for investors with a long-term horizon.\nHow does Taiwan Semiconductor benefit from AI? Throughout the AI revolution, hyperscalers such as Microsoft , Alphabet , Amazon , Meta Platforms , and OpenAI have collectively poured hundreds of billions of dollars into AI-related capital expenditures (capex) -- namely, chips and networking gear for data centers.\nOn the surface, this is great news for the likes of Nvidia, AMD, and Broadcom. But underneath the surface, it's even better news for Taiwan Semi. Why is that?\n\nTSMC is the largest chip manufacturer in the world in terms of revenue. While Nvidia, AMD, and Broadcom design the most-in demand GPUs and custom application-specific integrated circuits (ASICs) on the planet, each of these giants relies heavily on Taiwan Semi's cutting-edge fabrication processes.\nIn other words, if Nvidia and its competitors represent the body of the car moving the AI narrative forward, TSMC holds the keys to the ignition.\nTSMC's growth is off the charts Over the last year, Taiwan Semi's revenue has been growing strongly thanks to ongoing demand for AI accelerators. What's interesting to point out is that the company's revenue trajectory is actually steepening. This is largely driven by rising demand for Nvidia's and AMD's next-generation Rubin and MI400 Series chips, as well as increasing investment in custom hardware from cloud infrastructure providers.\n\nStory Continues\nThe more subtle aspect from the financial picture above is Taiwan Semi's expanding profitability profile. Given its near-70% market share, TSMC is able to command enormous pricing power relative to competitors like Intel or Samsung .\nAgainst this backdrop, Taiwan Semi's gross margin is widening -- with excess cash flowing straight to the bottom line. The company is making the most of this new wave of capital by expanding its geographic footprint -- building additional foundries in Arizona, Germany, and Japan.\n\nIs Taiwan Semi stock a good buy right now? At the moment, TSMC boasts a forward price-to-earnings (P/E) multiple of 28.4 -- hovering near its highest level during the AI revolution. If you were to base your investment decision purely off of this metric, you may think Taiwan Semi is overvalued.\nSmart investors understand that TSMC's premium valuation could be warranted, though. McKinsey & Company is forecasting AI infrastructure to be a $7 trillion market through 2030 -- with the majority of spend allocated toward refining AI workloads.\nIn essence, building out AI-equipped data centers is expected to accelerate throughout the rest of the decade as training and inferencing models becomes more sophisticated and demanding. This is great news for TSMC as it paves the way for long-run visibility across the business.\n\nThe AI infrastructure chapter is still in its early innings. Over the course of the next several years, Taiwan Semi is positioned to benefit from the secular tailwind of rising investment in infrastructure both domestically and abroad.\nTaking this one step further, physical applications such as autonomous systems and robotics are yet to be deployed in a commercial sense. Looking beyond into the 2030s, these use cases are expected to drive additional trillions in economic value.\nShould they achieve some form of adoption and set the stage for the next wave of AI, Taiwan Semi has the potential to benefit immensely beyond where AI stands today -- building large language models (LLMs) and other software-based applications.\nWhen you consider the bigger picture and begin to think longer-term, TSMC's growth potential relative to its valuation looks compelling. So while the stock may not appear dirt cheap at first glance, I think there is ample room for meaningful valuation expansion over the course of the next decade -- making the stock a no-brainer buy right now in my eyes.\n\nShould you invest $1,000 in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nAdam Spatacco has positions in Alphabet, Amazon, Meta Platforms, Microsoft, and Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Intel, Meta Platforms, Microsoft, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nWhat Is the Best Artificial Intelligence (AI) Stock to Hold for the Next 10 Years? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-28",
      "Time": "23:20:00",
      "Source": "Motley Fool",
      "Title": "Prediction: This AI Stock Could Be the First New $2 Trillion Company in 2026",
      "URL": "https://finance.yahoo.com/m/2d751d5f-fd34-3071-bd63-786e1f7111b2/prediction%3A-this-ai-stock.html",
      "Content": "Prediction: This AI Stock Could Be the First New $2 Trillion Company in 2026\n\nAdam Levy, The Motley Fool\nSun, December 28, 2025 at 7:20 AM PST 5 min read\n\nIn this article: META\n\nTSLA\n\nAVGO\n\nNVDA\n\nKey Points Meta Platforms, Tesla, and Broadcom each have market caps around $1.6 trillion.\nAI is the driving force behind all three stock prices.\nOne of these tech leaders is seeing immediate results from AI spending, and its stock valuation is more attractive right now.\n10 stocks we like better than Meta Platforms ›\n\nArtificial intelligence (AI) is responsible for adding trillions of dollars in value to a handful of companies over the last few years. Nvidia , for example, briefly touched a $5 trillion market cap this year, thanks to its dominant position in the market for graphics processing units (GPUs). Four other companies sit firmly above the $2 trillion threshold as we approach the new year.\nBut three AI stocks currently have similar market caps around $1.6 trillion as of this writing, and are vying to become the first new $2 trillion company of 2026: Meta Platforms (NASDAQ: META) , Tesla (NASDAQ: TSLA) , and Broadcom (NASDAQ: AVGO) . Here's my prediction for the next company to top the milestone, and it could come as soon as next year.\nArtificial intelligence is fueling all three Meta, Tesla, and Broadcom have all seen their stock prices heavily influenced by advances in AI this year.\nMeta stock climbed higher early in the year as its efforts to improve its recommendation algorithms bore fruit. Ad revenue climbed higher as time spent on its apps increased, and ads became more effective. However, the stock took a step back recently as management shared plans to increase its AI-related spending.\n\nTesla's value is heavily tied to its robotaxi service and AI innovations. The stock received a boost over the summer when it launched its robotaxi pilot in Austin, Texas. Investors added to those gains on promising progress on the company's next-generation AI chip for its vehicles.\nBroadcom's custom AI accelerator business has gained momentum in 2025, as the company signed big contracts with OpenAI and Anthropic, the latter of which is buying Alphabet 's Broadcom-designed tensor processing units (TPUs). To that end, Alphabet and Broadcom are seeing excellent progress in shifting more developer workloads to TPUs, which offer greater energy efficiency and cost savings versus Nvidia's GPUs.\nBroadcom stock took a step back after its last earnings report, as many analysts were disappointed with management's expectation that greater AI chip sales would come at a lower gross margin.\nWhile all three of these stocks have a path to a $2 trillion valuation in 2026, I expect Meta Platforms to reach the milestone first. Here's why.\n\nStory Continues\nAI-powered earnings growth at an attractive valuation Even with its run rate of $200 billion in annual revenue, Meta is still growing its bottom line quickly. Adjusted earnings per share climbed 20% in the third quarter, and improvements in AI are the reason.\nMeta has seen an increase in both ad impressions and price per ad for eight straight quarters. That indicates that it's increasing user engagement and opening new places within its apps for advertising while making ads more effective.\n\nManagement attributes a shift in its recommendation algorithm to make it more general across formats as the primary reason users are spending more time on its apps. Meta has seen similar improvements by applying the same methodology to its advertising algorithm. In other words, bigger models have directly translated into more revenue.\nThat trend should continue in 2026, as Meta opens up more opportunities for advertising, including on Threads and WhatsApp. It could also begin monetizing Meta AI, its generative AI chatbot. The improvements in its algorithms over the last couple of years should enable it to ramp up advertising quickly without as much negative impact on its pricing as we've seen in the past.\nThe bigger opportunity for Meta in 2026, though, may be the expansion of its generative AI features. It's reportedly working on an AI agent that can manage advertising campaigns for small businesses. CEO Mark Zuckerberg repeatedly talks about the opportunity to handle everything involved with creating, testing, and optimizing ad campaigns on its platform through an AI agent.\n\nAnd chatbots specializing in sales and customer service for a company could open the door for more businesses to push Facebook and Instagram users to start messaging them through Meta's chat apps.\nWith small- and medium-sized businesses accounting for the bulk of advertisers on Meta's platform, these innovations have the potential to dramatically increase the amount they're willing to spend on ads. If the overhead for these clients is much lower, they can increase their ad spending and scale up their businesses faster.\nThose efforts should fuel another year of strong revenue growth. And while depreciation expense from the increase in AI-related capital expenditures could eat into earnings growth, Meta should be able to manage continued improvements in earnings per share with the help of share repurchases.\n\nThe stock trades for just 26 times forward earnings expectations, which is much lower than Broadcom's multiple and less than one-tenth the multiple Tesla stock trades for. I expect Meta to fetch a higher earnings multiple as it proves its AI spending to be well worth it once again in 2026, pushing its valuation to $2 trillion.\nShould you invest $1,000 in Meta Platforms right now? Before you buy stock in Meta Platforms, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Meta Platforms wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nAdam Levy has positions in Alphabet and Meta Platforms. The Motley Fool has positions in and recommends Alphabet, Meta Platforms, Nvidia, and Tesla. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nPrediction: This AI Stock Could Be the First New $2 Trillion Company in 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-28",
      "Time": "17:15:00",
      "Source": "Motley Fool",
      "Title": "The Best Artificial Intelligence (AI) Stocks to Buy Ahead of 2026, According to Wall Street Analysts (Hint: Not Palantir)",
      "URL": "https://finance.yahoo.com/m/32a856c7-f936-3b66-b577-8c497c7d7178/the-best-artificial.html",
      "Content": "The Best Artificial Intelligence (AI) Stocks to Buy Ahead of 2026, According to Wall Street Analysts (Hint: Not Palantir)\n\nTrevor Jennewine, The Motley Fool\nSun, December 28, 2025 at 1:15 AM PST 5 min read\n\nIn this article: PLTR\n\nNVDA\n\nMSFT\n\nMETA\n\nAMZN\n\nKey Points Morningstar analysts recently ranked Nvidia and Microsoft as the two best artificial intelligence stocks to buy right now.\nBrian Colello at Morningstar says Nvidia has an economic moat due to its leadership in GPUs, networking, and software tools needed for artificial intelligence.\nDan Romanoff at Morningstar says Microsoft’s cloud computing unit has emerged as a leader in artificial intelligence due to investments in OpenAI.\n10 stocks we like better than Nvidia ›\n\nPalantir Technologies has been one of the best-performing artificial intelligence (AI) stocks in recent years. Shares have advanced 1,000% since January 2024, but many analysts worry about its valuation. That may explain why Palantir did not appear on Morningstar 's recent list detailing the best AI stocks to buy now.\nInstead, Nvidia (NASDAQ: NVDA) and Microsoft (NASDAQ: MSFT) took the top two spots, followed by Amazon , Broadcom , and Meta Platforms . But optimism concerning Nvidia and Microsoft is not limited to Morningstar. Most Wall Street analysts believe the stocks are undervalued.\nAmong 69 analysts, Nvidia has a median target price of $250 per share. That implies 31% upside from its current share price of $190.\nAmong 63 analysts, Microsoft has a median target price of $631 per share. That implies 29% upside from its current share price of $488.\nHere's what investors should know about Nvidia and Microsoft.\n1. Nvidia Morningstar analyst Brian Colello writes:\nTo summarize, Nvidia has an important competitive advantage in its full-stack strategy. The company is best known for its GPUs, chips that accelerate demanding data center workloads like AI training and AI inference. But Nvidia is truly formidable because it pairs best-in-class GPUs with CPUs, high-speed interconnects, and networking platforms, such that the company essentially builds entire data centers.\n\nAdditionally, Nvidia has spent the better part of two decades creating its CUDA software platform, which comprises an unparalleled number of code libraries, pretrained models, and application frameworks that assist developers. While custom AI chips developed by Broadcom may be cheaper, the total cost of ownership is often higher because they lack pre-built software tools.\n\nStory Continues\nNvidia has over 90% market share in data center GPUs, a market where sales are projected to grow at 36% annually through 2033, and the company is likely to maintain its dominant position due to its full-stack strategy. Wall Street estimates Nvidia's adjusted earnings will increase at 48% annually through the fiscal year ending in January 2028. That makes the current valuation of 47 times earnings look cheap.\n\n2. Microsoft Microsoft is the largest enterprise software company in the world. While best known for Microsoft 365 (a suite that includes office applications like Excel, PowerPoint, and Word), the company also has a strong position in other software verticals, including business intelligence, cybersecurity, and enterprise resource planning.\n\nMicrosoft has added generative AI copilots to several software products and monthly active users surpassed 150 million in the September quarter, up from 100 million in the June quarter. And CEO Satya Nadella told analysts, \"Customers continue to adopt Microsoft 365 Copilot faster than any other Microsoft 365 suite. All up, more than 90% of the Fortune 500 now use Microsoft 365 Copilot.\"\nMeanwhile, Microsoft Azure is the second-largest public cloud in terms of infrastructure and platform services sales. \"Azure has several distinct advantages, including that it offers customers a painless way to experiment and move select workloads to the cloud,\" according to Morningstar analyst Dan Romanoff. \"Based on its investment in OpenAI, the company has also emerged as a leader in AI.\"\n\nMicrosoft owns a 27% equity stake in OpenAI and it has exclusive rights to the AI start-up's most advanced models (e.g., GPT-4 and GPT-5). Also, The Information reports that OpenAI shares 20% of its revenue with Microsoft under the agreement. Those payments will top $1 billion this year, up from about $500 million last year, according to TechCrunch.\nWall Street estimates Microsoft's adjusted earnings will increase at 16% annually through the fiscal year ending in June 2027. That makes the current valuation of 34 times earnings look somewhat expensive. But Microsoft topped the consensus earnings estimate by an average of 8% during the last four quarters, which makes the current valuation look more reasonable. Nvidia is still the more attractive option, but I think patient investors should consider buying a small position in both stocks.\n\nShould you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nTrevor Jennewine has positions in Nvidia and Palantir Technologies. The Motley Fool has positions in and recommends Microsoft, Nvidia, and Palantir Technologies. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nThe Best Artificial Intelligence (AI) Stocks to Buy Ahead of 2026, According to Wall Street Analysts (Hint: Not Palantir) was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-28",
      "Time": "01:57:00",
      "Source": "Motley Fool",
      "Title": "Billionaire Chase Coleman Has Formed His Own \"Magnificent Seven\" and It's Even Better Than the Original",
      "URL": "https://finance.yahoo.com/m/8acc8d83-f1c7-3ebb-a71b-5848b544b190/billionaire-chase-coleman-has.html",
      "Content": "Billionaire Chase Coleman Has Formed His Own \"Magnificent Seven\" and It's Even Better Than the Original\n\nKeithen Drury, The Motley Fool\nSat, December 27, 2025 at 9:57 AM PST 5 min read\n\nIn this article: AAPL\n\nTSLA\n\nGOOG\n\nMSFT\n\nAMZN\n\nKey Points Apple and Tesla are excluded from the new grouping.\nBroadcom and Taiwan Semiconductor are key additions.\nProspects for Coleman's new grouping look promising.\n10 stocks we like better than Nvidia ›\nThe \"Magnificent Seven\" is a common grouping of stocks used to describe some of the largest and most influential stocks in the market today. The Magnificent Seven consists of these familiar names:\n\nNvidia (NASDAQ: NVDA)\nApple (NASDAQ: AAPL)\nAlphabet (NASDAQ: GOOG) (NASDAQ: GOOGL)\nMicrosoft (NASDAQ: MSFT)\nAmazon (NASDAQ: AMZN)\nMeta Platforms (NASDAQ: META)\nTesla (NASDAQ: TSLA)\nHowever, billionaire hedge fund manager Chase Coleman has created an alternative Magnificent Seven, and I think it's even better than the original. Which companies were cut and which ones were added? Let's take a look.\nAI is the theme in the new Magnificent Seven Investors have access to what hedge fund managers own. This is thanks to the Securities and Exchange Commission (SEC) requirement that managers with $100 million or more in assets must disclose their end-of-quarter holdings to the public 45 days after the quarter ends in a Form 13F . While this isn't up-to-date information, it's better than nothing.\n\nIn Tiger Global Management's third-quarter portfolio, we can see that Chase Coleman has heavily positioned his portfolio to take advantage of the massive artificial intelligence buildout. Some of his major holdings are:\nMicrosoft (10.5% of portfolio)\nAlphabet (8% of portfolio)\nAmazon (7.5% of portfolio)\nNvidia (6.8% of portfolio)\nMeta Platforms (6.4% of portfolio)\nTaiwan Semiconductor Manufacturing (NYSE: TSM) (4% of portfolio)\nBroadcom (NASDAQ: AVGO) (3% of portfolio)\nAltogether, these stocks make up 46.2% of Coleman's portfolio, which is a massive concentration. However, the track record of each company speaks for itself, and all of these have been great investments over the past few years.\nWhat's notable is that Apple and Tesla aren't included. I think there are a few reasons why, and I like the inclusion of Taiwan Semiconductor and Broadcom over these two in the new Magnificent Seven.\n\nApple lacks an AI focus, and Tesla's business model took a hit this year Apple has been a notable AI laggard in recent years. Its AI technology is really non-existent, and many of the features Apple promised users years ago still haven't been released. The only step left is for Apple to become a client of one of the major generative AI providers, which doesn't bode well for the future.\nFurthermore, Apple is surviving on past innovations, and hasn't released anything groundbreaking in the past few years. All the companies on this list have had incredible results, leaving Apple in the dust in terms of growth.\n\nStory Continues\nTesla is a bit different. It has an AI strategy for implementing self-driving capabilities in its cars. It also has a close partnership with xAI, another one of Elon Musk's companies. I think it shouldn't be excluded from the new Magnificent Seven based on AI alone.\nYet, it's impossible to ignore the shifting landscape in Tesla's primary market. Electric vehicles aren't as hot as they used to be, and with U.S. government subsidies ending, they aren't as attractive to consumers. This isn't to say the EV market is dead, but growth will be more difficult to come by in the future.\n\nAn investment in Tesla is a bet that its various aspirations, like robotaxis and humanoid robots, will be successful. These are far from surefire bets, unlike the other seven companies that are making money right now.\nTaiwan Semiconductor and Broadcom are great inclusions, as they are each thriving in the AI market. They are also large businesses, with Broadcom and Tesla often swapping places as the seventh and eighth largest companies, while Taiwan Semiconductor is the 10th largest in the world at a $1.5 trillion market cap.\nBroadcom is competing in the AI race with its custom AI accelerator chips, which are starting to grow in popularity as an alternative to Nvidia's graphics processing units (GPUs). Taiwan Semiconductor is a key provider of chips to nearly every company on this list. As long as more data centers keep being built, Taiwan Semiconductor will be an excellent stock pick.\n\nI'm confident that Chase Coleman's new Magnificent Seven will outperform the old Magnificent Seven in 2026. I think investors should consider moving on from Apple and Tesla and into Broadcom and Taiwan Semiconductor, as they are better positioned for the next few years.\nShould you buy stock in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nKeithen Drury has positions in Alphabet, Amazon, Broadcom, Meta Platforms, Nvidia, Taiwan Semiconductor Manufacturing, and Tesla. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, Taiwan Semiconductor Manufacturing, and Tesla. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nBillionaire Chase Coleman Has Formed His Own \"Magnificent Seven\" and It's Even Better Than the Original was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "23:21:59",
      "Source": "24/7 Wall St.",
      "Title": "3 Reasons Broadcom Crashed 15% on Blockbuster Earnings — And the Real Reason to Load Up Now",
      "URL": "https://finance.yahoo.com/m/66759db0-77a0-3032-b2b0-f2da74fc33f7/3-reasons-broadcom-crashed.html",
      "Content": "3 Reasons Broadcom Crashed 15% on Blockbuster Earnings — And the Real Reason to Load Up Now\n\nRich Duprey\nSat, December 27, 2025 at 7:21 AM PST 4 min read\n\nIn this article: AVGO\n\nQuick Read Broadcom ( AVGO ) reported Q4 revenue of $18B with AI semiconductor revenue up 74% to $6.5B. Broadcom stock dropped 21% post-earnings despite beating estimates.\nBroadcom’s AI revenue is expected to double in Q1 to $8.2B. The company added a fifth custom chip customer with $1B in initial orders.\nGross margins of 77.9% are expected to decline 100 basis points in Q1 due to higher AI revenue mix and lower-margin rack solutions.\nIf you’re thinking about retiring or know someone who is, there are three quick questions causing many Americans to realize they can retire earlier than expected. take 5 minutes to learn more here\n\nBroadcom ( NASDAQ:AVGO ) delivered stellar fiscal fourth-quarter results earlier this month, with record revenue, beating analyst estimates. AI-driven growth powered the performance, yet the stock tumbled sharply afterward, dropping as much as 21% from $405 per share before the report to $321 per share in the following days.\nWhile Broadcom shares have since recovered some ground, they remain approximately 15% below their pre-earnings levels. This selloff is the result of a disconnect between strong fundamentals and the market's reaction.\nThere are three key reasons behind the decline in Broadcom stock, but these concerns open up an opportunity for investors to buy at a lower price.\nBroadcom Shows Exceptional Strength Broadcom reported net revenue of $18 billion for the period, a 28% increase from $14 billion a year earlier. Semiconductor solutions revenue reached $11.1 billion, up 35% year-over-year, while infrastructure software contributed $6.9 billion, up 19%. AI semiconductor revenue was exceptionally strong, rising 74% year-over-year to $6.5 billion. Adjusted earnings came in at $1.95 per share, up 37% from the year-ago quarter, with adjusted EBITDA at $12.1 billion, for margins of 68%, which was also 34% higher than last year, allowing Broadcom to generate a 36% increase in free cash flow to $7.5 billion.\n\nCEO Hock Tan highlighted the momentum, noting AI revenue growth drove the results. Broadcom also offered robust guidance for Q1, projecting revenue of $19.1 billion, up 28% year-over-year, with AI semiconductor revenue expected to double to $8.2 billion. Semiconductor revenue is forecast at about $12.3 billion, up 50%, underscoring continued demand acceleration.\nReason 1 For the Selloff: AI Backlog While AI-related order backlog of over $73 billion -- deliverable over 18 months -- was substantial, representing nearly half of the consolidated $162 billion backlog, was lower than anticipated for the pace of AI demand. This backlog includes custom AI accelerators (XPUs) and networking components like the Tomahawk 6 switch, with over $10 billion in orders for the latter alone. Management described bookings as \"unprecedented\" in recent months, but the specific backlog number contributed to perceptions of moderating momentum.\n\nStory Continues\nReason 2: Expected Margin Pressure Where gross margins were 77.9%, management said it expected a sequential decline of about 100 basis points in Q1 due to a higher mix of AI revenue, including passthrough costs in rack-level solutions. AI semiconductors, particularly custom chips and systems, carry lower margins than traditional products. Semiconductor gross margins are around 68%, compared to 93% for infrastructure software. As AI becomes a larger portion of revenue, this mix shift is expected to dilute overall margins slightly, even as absolute operating profit dollars grow.\n\nReason 3: Slowing Growth in Infrastructure Software A third concern was the outlook for infrastructure software, primarily from VMware. Although segment revenue grew 19%, guidance called for low double-digit growth next year, with Q1 at $6.8 billion, only 2% higher year-over-year. This deceleration from prior rates raised questions about sustained momentum in the software segment, which has offered high-margin stability.\n\nWhy This Is a Buying Opportunity Despite the stock's tumble, Broadcom's outlook remains robust, driven by accelerating AI demand that management describes as a multiyear trend. AI revenue is on track to double in Q1, fueled by custom accelerators and Ethernet networking.\nThe company has also diversified its customer base, adding a fifth XPU client with a $1 billion initial order for delivery in late 2026, alongside follow-on commitments worth $11 billion from existing hyperscalers. Networking backlog for AI switches exceeds $10 billion, reflecting strong deployment needs.\n\nMoreover, bookings have surged recently, with visibility into leading-edge nodes and advanced packaging secured through facility expansions. Non-AI semiconductors remain stable, supported by a recovery in broadband.\nBroadcom continues to deliver strong capital returns, raising its dividend 10% and extending a $7.5 billion repurchase program. These factors point to sustained growth in 2026 and beyond. Broadcom is likely to surprise the market in future earnings reports with its strength, making the drop in its stock today the time to buy.\nThe New Report Shaking Up Retirement Plans You may think retirement is about picking the best stocks or ETFs, but you’d be wrong. Even great investments can be a liability in retirement. It’s a simple difference between accumulating vs distributing, and it makes all the difference.\nThe good news? After answering three quick questions many Americans are reworking their portfolios and finding they can retire earlier than expected. If you’re thinking about retiring or know someone who is, take 5 minutes to learn more here .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "23:00:19",
      "Source": "Yahoo Finance",
      "Title": "6 under-the-radar stocks to play the AI boom in 2026: BofA",
      "URL": "https://finance.yahoo.com/news/6-under-the-radar-stocks-to-play-the-ai-boom-in-2026-bofa-150019301.html",
      "Content": "6 under-the-radar stocks to play the AI boom in 2026: BofA\n\nFrancisco Velasquez\nSat, December 27, 2025 at 7:00 AM PST 3 min read\n\nIn this article: NVDA\n\nCRDO\n\nALAB\n\nMTSI\n\nTER\n\nWhile players like Nvidia ( NVDA ) and Broadcom ( AVGO ) are at the forefront of investors’ minds, smaller specialized players are grabbing a slice of the AI spending behind the scenes.\nIn a recent report, Bank of America analyst Vivek Arya named a handful of small- to mid-cap companies as the unsung heroes of the semiconductor surge.\n\n\"We mentioned a few companies on the smid-cap side, Credo, MKS, Advanced Energy, MACOM, and Teradyne,\" Arya told reporters on a Dec. 19 call.\nWhile these companies lack the massive margins of Nvidia, Arya suggests they are currently benefitting from being the primary providers of essential technologies.\nThe scale of the unsung opportunity is staggering. BofA predicts the total addressable market for AI data center systems will exceed $1.2 trillion by 2030, fueled by a 38% compound annual growth rate. Within that, AI accelerators will grab around $900 billion, but that leaves a massive $300 billion slice — one that depends on secondary technologies like networking, cables, and power systems.\nArya breaks down how the pie is divided. For every $100 spent on AI hardware, $15 to $20 goes into networking. A third flows directly into interconnects — the wires and optical components that let GPUs talk to each other. As AI clusters expand, these bits and bolts of the trillion-dollar build-out are seeing a direct benefit.\n\nArya highlights Credo ( CRDO ) for its leadership in active electrical cables. As data centers prioritize \"performance per watt,\" Credo's niche technology is critical. \"They want to make sure that all these GPUs talk to each other, very effectively,\" he said.\nHe also pointed to Astera Labs ( ALAB ) and its robust high-speed connectivity efforts via PCIe 6.0, the standard for moving data between a computer's motherboard and its hardware.\n\"They were the ones who invested in specific technologies ... nobody cared about these categories,\" he said. \"So now, they are benefitting from being the only people standing in those specific niche technologies.\"\nOther key players, such as MKS Instruments ( MKSI ) and Advanced Energy ( AEIS ), provide the precision power and vacuum systems needed to actually build chips. If Nvidia is the architect, these companies provide the machinery and high-voltage power to keep the site running.\nMeanwhile, MACOM ( MTSI ) provides high-speed analog and optical components that let these \"brains\" interact, while Teradyne ( TER ) serves as a final checkpoint. The company's automated testing equipment ensures these expensive components actually work before they are shipped.\n\nStory Continues\nStill, a healthy dose of skepticism is required. Unlike Nvidia, which can sell a single GPU for $30,000, the interconnect players like Credo and Astera face a brutal reality: pricing compression.\n\"Of course, they are not going to get these multiples forever,\" Arya said.\nArya warns that transceiver prices often fall from $1 per gigabit to $0.50 in just a few months.\n\n\"They can never hold pricing right, so you will never see them quite grow as fast as the accelerator or the logic companies,\" he explained. While their gross margins are currently 35%-40%, they are nowhere near Nvidia's \"different galaxy\" levels of 70% plus.\nFrancisco Velasquez is a Reporter at Yahoo Finance. Follow him on LinkedIn , X , and Instagram . Story tips? Email him at francisco.velasquez@yahooinc.com.\nClick here for the latest technology news that will impact the stock market\nRead the latest financial and business news from Yahoo Finance\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "20:35:00",
      "Source": "Motley Fool",
      "Title": "3 Stock-Split Stocks to Buy that Could Soar As Much as 40%, 35%, and 640%, According to Wall Street",
      "URL": "https://finance.yahoo.com/m/7c394f77-f849-33ce-893d-5bb9975070b8/3-stock-split-stocks-to-buy.html",
      "Content": "3 Stock-Split Stocks to Buy that Could Soar As Much as 40%, 35%, and 640%, According to Wall Street\n\nRachel Warren, The Motley Fool\nSat, December 27, 2025 at 4:35 AM PST 8 min read\n\nIn this article: NFLX\n\nWSFX.BO\n\nAVGO\n\nNOW\n\nKey Points Netflix is the indomitable leader in streaming, and its advertising segment is gaining steam.\nBroadcom supplies infrastructure to hyperscalers, and it backlog of AI revenue is growing.\nServiceNow's cloud business is robust and its AI solutions serve major customers.\n10 stocks we like better than Netflix ›\n\nA stock split is a corporate action where a company divides its existing shares into multiple new shares, which increases the total share count while proportionally decreasing the price per share. This can make the stock more affordable and liquid for investors without changing the total market value of the company or an investor's stake.\nPlenty of stocks have initiated splits over the last several years, and some of those are quality businesses that could be poised to soar significantly in the coming years. If you have cash to put to work in stocks right now, here are three stock-split stocks to buy and hold for the long run that look to have significant upside potential.\n1. Netflix Netflix (NASDAQ: NFLX) enacted a 10-for-1 stock split that went into effect on Nov. 17, 2025. At the time of this writing, shares are trading around $94. Currently, the median 12-month price target from analysts on Wall Street is around $133, which would represent upside of about 40% from its current price. The high end of the available price estimate anticipates as much as 62% upside in the next 12 months.\n\nNetflix is increasingly benefiting from the growth engine of the ad-supported tier it launched in late 2022. The company is on pace to double its advertising business revenue in 2025 and its ads now reach 190 million monthly active viewers. This high- margin revenue stream provides a significant new path to profitability beyond traditional subscriptions.\nNetflix's expansion into live programming, featuring the NFL and WWE, has proven highly successful in driving both subscriber acquisition and retention, as well as breaking viewership records. These events also command premium advertising rates, helping the company gain market share in areas where it previously lagged. Regions such as the Asia-Pacific and Latin America are also experiencing faster subscriber growth, offering a large, unsaturated addressable market.\n\nIn Q3 2025, Netflix's growth and engagement reached record highs, thanks to a diversified content slate including breakout original films, returning series, and massive live sports events. The animated film KPop Demon Hunters was the primary growth driver of the quarter and became Netflix's most-watched film ever with 325 million views. The second season of Wednesday was a major tentpole that recorded over 1 billion viewing minutes in Q3. Black Rabbit was also a top-performing original series for the quarter that generated over 1.2 billion minutes of viewing.\n\nStory Continues\nThese hits contributed to a 17% year-over-year revenue increase (reaching $11.5 billion) and record viewing shares of 8.6% in the U.S. and 9.4% in the U.K. The content strength also fueled a record-breaking quarter for Netflix's advertising tier, with U.S. upfront commitments doubling from last year. Netflix continues to invest heavily in a diverse content pipeline and leverages its in-house adtech and data-driven recommendation algorithms to enhance user engagement and loyalty. The company is in the process of acquiring Warner Bros. Discovery in a massive $82.7 billion deal announced in early December 2025.\n\nAlthough regulatory scrutiny and industry concerns about monopolies are significant hurdles, this acquisition would bring HBO, Warner Bros. Discovery's film/TV studios, and streaming service under Netflix's umbrella. As Netflix transitions into a mature, cash-generating business model, it remains the undisputed leader in streaming, with its scale and brand power providing a significant competitive advantage over rivals. Long-term investors would do well to capitalize on that growth trajectory.\n2. Broadcom Broadcom (NASDAQ: AVGO) executed a 10-for-1 stock split on July 15, 2024. At the time of this writing, shares trade for approximately $350 each, but some Wall Street analysts think the stock could realize an upside of 35% over the next 12 months, or even 58% on the high end. Since we're talking about stock splits, as a a side note, Broadcom's Canadian Depositary Receipts (CDRs), enacted a 6-for-1 stock split that took effect for trading on Nov. 14, 2025.\n\nBroadcom is a leading supplier of custom AI accelerators (ASICs) and Ethernet switches for hyperscale data centers. Its customers include the likes of Alphabet 's Google, Meta Platforms , Anthropic, and OpenAI. Broadcom reported a record revenue of $64 billion for fiscal year 2025. This represented a 24% increase compared to fiscal year 2024 revenue of $51.6 billion.\nAI semiconductor revenue for fiscal year 2025 was $20 billion, representing a 65% year-over-year growth, and management expects this figure to double in Q1 of its fiscal year 2026. Meanwhile, semiconductor solutions generated $37 billion in revenue during the fiscal year, representing a 58% increase from the previous year. Infrastructure software revenue increased 26% year over year to $27 billion, primarily driven by the adoption of VMware Cloud Foundation.\n\nThe acquisition of VMware in November 2023 positioned Broadcom as a full-stack AI infrastructure vendor with a significant presence in enterprise software. This segment provides stable, high-margin, recurring revenue that helps offset potential margin pressures from AI hardware.\nThe company ended fiscal 2025 with a robust backlog of $73 billion in AI-related hardware orders. Profitability also soared in fiscal 2025, with adjusted EBITDA (earnings before interest, taxes, depreciation, and amortization) hitting $43 billion (up 35%) and Broadcom reported significant free cash flow of $26.9 billion.\nBroadcom's dominant position in AI networking hardware, strong cash flow, high-margin software, and persistent AI demand are all positive indicators of where this business currently stands and where it's headed. This could be a compelling stock for long-term investors seeking to capitalize on a 'pick-and-shovel' play in the AI space.\n\n3. ServiceNow ServiceNow (NYSE: NOW) executed a 5-for-1 stock split on Dec. 18, 2025, with shares trading on a split-adjusted basis starting that day. This means that shares trade now for roughly $155 each. Wall Street analysts seem to be particularly enthusiastic about ServiceNow's growth prospects, with the median 12-month price target coming in at 640% above its current share price. The high 12-month stock price forecast is approximately 735%.\n\nServiceNow is a cloud-based enterprise platform that helps businesses automate and manage their digital workflows across IT, HR, customer service, security, and other departments. Essentially, the business acts as a central control tower, connecting people, processes, and systems and replacing manual tasks with streamlined, AI-powered processes. The company is strategically positioned to capitalize on the generative AI boom with its Now Assist suite of products.\nThese AI solutions are gaining strong traction and are targeted to reach $1 billion in annual contract value by the end of 2026. ServiceNow's platform is used by over 85% of Fortune 500 companies. This deep integration creates high switching costs and it boasts a high renewal rate of around 96% or higher.\n\nServiceNow's customers are large enterprises and organizations across nearly every major industry, including Walmart , Amazon , Microsoft , Apple , JPMorgan Chase , and the U.S. Department of Defense. ServiceNow has recently made major acquisition moves, buying AI firm Moveworks for $2.85 billion in March 2025. The company is also reportedly nearing a potential $7 billion acquisition of cybersecurity firm Armis, which would add critical device security and asset intelligence to its offerings and address the growing need for AI governance.\nIn Q3 2025, ServiceNow reported subscription revenue of $3.3 billion, up 22% from one year ago. The current remaining performance obligations stood at $11.4 billion as of Q3 2025, representing a 21% year-over-year growth. ServiceNow also delivered adjusted EPS of $4.82 and adjusted free cash flow of $592 million with a 17.5% margin.\n\nAn analyst downgrade and news of ServiceNow's acquisition ambitions for Armis, which would be its largest-ever deal, have weighed on the stock recently. There has also been generally more volatility among tech stocks lately. However, investors who believe in the company's future as a key player in AI workflow automation may want to take a second look.\nShould you buy stock in Netflix right now? Before you buy stock in Netflix, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Netflix wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $504,994 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,156,218 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 986 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nJPMorgan Chase is an advertising partner of Motley Fool Money. Rachel Warren has positions in Alphabet, Amazon, and Apple. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, JPMorgan Chase, Meta Platforms, Microsoft, Netflix, ServiceNow, Walmart, and Warner Bros. Discovery. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\n3 Stock-Split Stocks to Buy that Could Soar As Much as 40%, 35%, and 640%, According to Wall Street was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "07:45:00",
      "Source": "MarketBeat",
      "Title": "Broadcom’s Margin Warning Spooked Wall Street—But Cash Flow Could Still Win",
      "URL": "https://finance.yahoo.com/m/fa58ccf8-be2b-3115-9b8f-097844b6d048/broadcom%E2%80%99s-margin-warning.html",
      "Content": "Broadcom’s Margin Warning Spooked Wall Street—But Cash Flow Could Still Win\n\nLeo Miller, MarketBeat\nFri, December 26, 2025 at 3:45 PM PST 4 min read\n\nIn this article: AVGO\n\nGOOG\n\nNVDA\n\nKey Points Markets have crushed Broadcom's shares since the firm reported earnings on Dec. 11.\nForecasts regarding gross margin pressure are driving serious concerns.\nBroadcom's proven track record outweighs the uncertainty many investors are feeling, supporting the stock's positive outlook.\nInterested in Broadcom Inc.? Here are five stocks we like better.\n\nInvestors are feeling more uncertainty around semiconductor giant Broadcom (NASDAQ: AVGO) than they have in quite a while.\nShares are down nearly 14% since the company reported its fiscal Q4 2025 earnings report on Dec. 11.\n→ Why Kratos and AeroVironment Are Suddenly Moving Like Tech Stocks\nBroadcom’s post-earnings sell-off is really a debate over one question: will the company’s fast-growing AI “system” revenue dilute margins—or expand operating profit and free cash flow anyway?\nThe answer could determine whether the sell-off is a short-term sentiment hit or a broader reassessment of Broadcom’s longer-term earnings power.\n→ These 3 Household Names Are Flashing Rare Oversold Signals\nGross Margin Concerns Weigh on AVGO Stock The primary issue plaguing Broadcom shares after earnings was management's gross margin outlook.\nNext quarter, Broadcom expects its gross margin to fall 100 basis points due to a higher mix of artificial intelligence (AI) revenue. With a 78% gross margin last quarter, management signaled that margins may continue trending lower throughout 2026 as Broadcom increases AI system shipments.\n\n→ MarketBeat Week in Review – 12/22 - 12/26\nInstead of simply selling its chips, Broadcom is combining them with third-party components, such as memory and delivering them to customers as systems. This strategy increases total revenue but lowers overall margins because those third-party components add costs that Broadcom passes on to customers.\nIt also leads to concerns about the profitability of Broadcom’s $73 billion AI backlog, which it expects to convert into revenue over the next 18 months. Analysts believe Broadcom’s orders from Anthropic, totaling $21 billion, are system sales. That is certainly a significant portion of the company’s AI backlog, adding weight to margin-related concerns.\nHowever, Broadcom emphasized that while gross margins will deteriorate, operating margins will only come down slightly in 2026 because the company can spread its higher revenues over a larger base of fixed costs. Ultimately, operating margin is more important than gross margin, as it correlates much more closely with free cash flow (FCF) generation. Thus, it is a very positive sign that Broadcom believes it can protect its operating margin.\n\nStory Continues\nLower Margins Can Still Mean Higher Profits Until recently, Broadcom had not engaged in system sales on a large scale. Although investors typically dislike margin deterioration, companies will often pursue new lines of business that have this effect. Entering lower-margin markets often drives revenue growth that offsets thinner margins—a tradeoff that Broadcom believes will play out in 2026.\n\nThere are also clear reasons why, in the case of Anthropic, it would make sense for Broadcom to pursue system sales. Broadcom is not developing a specific chip for Anthropic. Instead, Anthropic will use tensor processing units (TPUs), which Broadcom originally developed for Alphabet (NASDAQ: GOOGL). Broadcom’s deep experience with TPUs positions it to deliver ready-made AI systems faster than Anthropic could build them independently.\nBy providing turnkey systems, Broadcom captures billions in new revenue opportunities and strengthens relationships in the fast-growing AI infrastructure market. Still, investors should monitor whether system sales become a long-term structural shift or remain a short-term growth lever. Overextending into lower-margin segments could pressure profitability if not managed carefully.\n\nDespite Uncertainty, the Long-Term Case Remains Strong Ultimately, the disappointment in Broadcom’s earnings release stems from one key dynamic: the introduction of uncertainty.\nIn not knowing how far Broadcom's gross margins could fall, markets ran for cover.\nHowever, what investors do know is that Broadcom’s demonstrated success in the AI chip design space is second only to NVIDIA (NASDAQ: NVDA).\nThey also know Alphabet solely used TPUs to develop its highly advanced Gemini 3 model, and that analysts still see big-time upside in this stock.\nAmid the uncertainty, these factors support the continued bullish outlook on Broadcom shares.\nThe article \" Broadcom’s Margin Warning Spooked Wall Street—But Cash Flow Could Still Win \" was originally published by MarketBeat.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "02:58:00",
      "Source": "Zacks",
      "Title": "3 Leading AI Stocks Investors Can Buy for 2026 (NVDA, AVGO, VRT)",
      "URL": "https://finance.yahoo.com/news/3-leading-ai-stocks-investors-185800576.html",
      "Content": "3 Leading AI Stocks Investors Can Buy for 2026 (NVDA, AVGO, VRT)\n\nEthan Feller\nFri, December 26, 2025 at 10:58 AM PST 7 min read\n\nIn this article: VRT\n\nNVDA\n\nAVGO\n\nThe market, and many leading AI stocks, are at an inflection point. In the near term, further volatility or even a pullback is possible. However, the longer-term opportunity remains compelling, with upside potential that extends well into 2026 and beyond.\nAI capital spending is projected to reach an estimated $571 billion in 2026, and Nvidia ( NVDA ), Broadcom ( AVGO ), and Vertiv ( VRT ) sit at the center of this historic infrastructure buildout. These companies are among the most critical enablers of the AI expansion.\n\nAfter running multiple screens focused on growth, valuation, and margin strength, these three names consistently rose to the top. Collectively, they represent exceptional businesses with durable competitive advantages and strong earnings power.\nDespite their leadership positions, these stocks are not stretched on valuation and in recent weeks have experienced earnings upgrades, giving two of them top Zacks Ranks.\nRecent months have been choppy in these stocks, with prices moving sideways to lower, leaving shares near technically important levels. Whether those levels hold or break in the short term is uncertain, but the risk-reward profile remains attractive at current prices regardless.\nEven if further downside materializes and bearish narratives resurface, any weakness is unlikely to persist given the scale and durability of AI-driven demand. If support holds, these stocks may already be positioning for their next leg higher.\nBelow, I will break down the recent developments, fundamental strength of these businesses and highlight a tactical trading plan using the technical charts.\n\nImage Source: Zacks Investment Research\nNvidia Stocks Breaks Out on Bullish Developments Nvidia continues to anchor the AI boom as the critical infrastructure provider through its leadership in GPU technology. While 2025 was comparatively subdued for the now roughly $4.5 trillion semiconductor giant, with shares delivering a tidy 42% return, the company has remained firmly on offense.\nOver the past week, Nvidia advanced its largest acquisition to date, agreeing to acquire assets from AI chip startup Groq in a deal valued at approximately $20 billion. Groq, founded by former Google TPU architects, develops high-performance inference-focused silicon that competes in certain AI workloads. While Groq described the transaction as a “non-exclusive licensing agreement,” the deal includes the integration of Groq’s CEO and senior leadership into Nvidia, signaling deeper strategic alignment.\nFrom a competitive standpoint, the acquisition strengthens Nvidia’s already formidable moat at the leading edge of AI semiconductors.\n\nStory Continues\nFundamentals also continue to move in the right direction. Analysts have resumed raising earnings estimates, earning Nvidia a Zacks Rank #2 (Buy) . Consensus forecasts for next year’s earnings have climbed nearly 16% over the past two months, and longer-term projections call for 46.3% annual EPS growth over the next three to five years. At roughly 40.6x forward earnings, the valuation remains reasonable given Nvidia’s growth profile and its central role in the most powerful technology cycle in more than a decade.\n\nThe technical picture has also improved meaningfully. After months of choppy, volatile trading marked by sharp rallies and pullbacks, NVDA has made a decisive bullish turn. During the low-volume holiday period, the stock broke out from a clear descending bullish wedge, marking its most constructive advance in several months. As long as shares hold above the breakout level, the setup points to further upside as 2026 begins.\n\nImage Source: TradingView\nBroadcom Shares Consolidate at Key Price Level Broadcom has been a core beneficiary of the AI boom since the trend began, but its importance has become even more apparent in recent months. After being viewed as a relative laggard for several years, Alphabet ( GOOGL ) has reasserted itself as a leader in AI and large language models. A major driver of that shift has been renewed appreciation for Alphabet’s proprietary hardware stack, most notably its Tensor Processing Units (TPUs), which Google has deployed internally for nearly a decade.\n\nBroadcom plays a critical role in that ecosystem. While TPUs are branded as Google-designed chips, Broadcom provides the underlying expertise in ASIC design, networking, and high-speed I/O, effectively enabling Google to scale these systems reliably at hyperscale. As Alphabet rapidly expands AI infrastructure across Search, cloud services, and generative AI models, custom silicon becomes economically unavoidable. Broadcom sits squarely at the center of that transition, helping design chips optimized for inference, training, and internal workloads, areas where generic GPUs are often less cost-efficient. As Alphabet’s AI leadership has become clearer, Broadcom’s strategic importance has risen alongside it.\nFrom a fundamentals perspective, Broadcom currently carries a Zacks Rank #3 (Hold) , reflecting a pause in earnings revisions rather than any deterioration in outlook. Consensus estimates still call for 35.7% annual EPS growth over the next three to five years, and the stock trades at roughly 36x one-year forward earnings. Given that growth profile and Broadcom’s deep entrenchment in the AI infrastructure stack, valuation remains reasonable relative to peers.\n\nTechnically, Broadcom had been outperforming much of the AI complex in recent months as investors increasingly recognized its role within the Alphabet AI ecosystem. The sharp selloff following its most recent earnings report was less about weakening fundamentals and more about positioning and nuanced guidance, a classic “sell-the-news” event after a strong run. Importantly, shares found support at a level that has held up the stock since late summer. As long as that support holds, the consolidation looks constructive, and the near-term technical outlook remains encouraging.\n\nImage Source: TradingView\nVertiv Stock Sits Within Trading Range Vertiv remains one of the purest plays on the physical backbone of the AI buildout, supplying critical power, cooling, and thermal-management solutions to hyperscale and enterprise data centers. Recent developments continue to reinforce that positioning. Over the past several months, Vertiv has announced expanded partnerships with large data center operators and hyperscalers, while management has highlighted strong backlog growth and improving visibility tied directly to AI-driven capacity expansion. Demand for high-density cooling solutions continues to exceed expectations as next-generation AI workloads push power and thermal limits higher.\n\nFundamentally, the story remains compelling. Vertiv currently carries a Zacks Rank #2 (Buy) as earnings estimates continue to trend higher. Consensus forecasts call for 30.2% annual EPS growth over the next three to five years, reflecting operating leverage, improving margins, and sustained AI-related demand. While the stock trades at a 40.6x forward earnings multiple, that valuation appears justified given Vertiv’s growth rate, expanding addressable market, and increasingly important role in AI infrastructure.\nThe technical setup adds another layer of appeal. After a sharp advance earlier in the cycle, VRT has spent recent months consolidating within a well-defined trading range. Importantly, the stock recently bounced cleanly off support within its rising channel. The key level to watch on the upside is the ~$180 area, which marks the top of the current range. A decisive breakout above that level would likely signal the next leg higher, while continued support near the lower end of the channel keeps the risk-reward profile attractive.\n\nTaken together, Vertiv offers a differentiated way to participate in the AI boom—not through chips or software, but through the indispensable infrastructure that makes large-scale AI deployment possible. With fundamentals strengthening and the technical picture improving, VRT remains well positioned as investors look ahead to 2026.\n\nImage Source: TradingView\nShould Investors Buy Shares in VRT, NVDA and AVGO? Taken together, Nvidia, Broadcom, and Vertiv offer complementary exposure to the core layers of the AI buildout—compute, custom silicon and networking, and physical infrastructure. While near-term volatility is always possible, fundamentals, earnings momentum, and long-term demand visibility remain firmly intact. With each stock positioned at a critical point in the AI value chain and trading near technically important levels, the current setup favors accumulation opportunistically as the AI investment cycle extends into 2026 and beyond.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nVertiv Holdings Co. (VRT) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "01:50:00",
      "Source": "Barrons.com",
      "Title": "A Stock Market Priced for Perfection Can Still Have a Very Good Year",
      "URL": "https://finance.yahoo.com/m/bf595d08-7ab1-34b3-91ad-ec5c467017c5/a-stock-market-priced-for.html",
      "Content": "A Stock Market Priced for Perfection Can Still Have a Very Good Year\n\nJosh Schafer\nFri, December 26, 2025 at 9:50 AM PST 3 min read\n\nIn this article: FDS\n\n^GSPC\n\nChristmas week sparked a Santa Claus rally, but a stock market that’s posted three straight years of above-average gains will have to wrestle with a simple fact of life—it’s incredibly hard to stay perfect. The S&P 500 is expected to grow earnings by 15% in 2026, per FactSet, while net profit margins are forecast to hit 13.9%, the highest since FactSet began tracking the metric in 2008. Meanwhile, economic growth forecasts are moving higher after a stellar third-quarter gross-domestic-product reading, inflation isn’t expected to be a problem, and the labor market should be able to hold on.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "23:35:00",
      "Source": "Zacks",
      "Title": "QCOM Rides on Strength in Premium Handset Market: Will it Sustain?",
      "URL": "https://finance.yahoo.com/news/qcom-rides-strength-premium-handset-153500215.html",
      "Content": "QCOM Rides on Strength in Premium Handset Market: Will it Sustain?\n\nZacks Equity Research\nFri, December 26, 2025 at 7:35 AM PST 3 min read\n\nIn this article: QCOM\n\n2454.TW\n\nAAPL\n\nSSNLF\n\nQualcomm Incorporated ( QCOM ) generated about $6.96 billion in handset revenues in the latest quarter, with a year-over-year increase of 14% and an estimated $27.8 billion in fiscal 2025, contributing roughly 63% of the total company’s revenues. Qualcomm’s strong handset revenues are driven by its increased customer demand for Snapdragon-powered premium Android smartphones.\n\nQualcomm faces strong competition from rivals like MediaTek, especially in mid-range and budget smartphones, which puts pressure on its market share and pricing. U.S.-China trade tensions have reduced companies' handset demand to a great extent. Qualcomm's handset business experienced ongoing challenges as global smartphone demand slowed down day by day. Moreover, major handset manufacturers, such as Apple and Samsung, are moving toward in-house chip development. This is a major challenge for Qualcomm.\nTo overcome challenges in the smartphone business, Qualcomm is focusing on premium Snapdragon chips to stay competitive in flagship devices. Qualcomm recently launched the Snapdragon 8 Gen 5, offering high-speed performance, advanced AI, improved graphics, and enhanced camera capabilities for flagship smartphones from global brands like iQOO , Honor, ASUS, OnePlus, and Vivo.\n\nPer a report from Precedence Research, the global 5G chipset market is expected to reach $126.4 billion by 2030 from $18.7 billion in 2022, with a CAGR of 27%, indicating strong underlying growth potential for Qualcomm’s handset segment in the near future. QCOM’s continuous innovation in powering flagship devices with cutting-edge features helps to boost its handset revenues, maintain leadership in the premium segment, and drive future revenue growth.\nOther Tech Companies Focused on Handset Chip Development Qualcomm faces competition from Apple, Inc. ( AAPL ) and Broadcom, Inc. ( AVGO ). Apple recently launched the new iPad Pro, MacBook Pro, and upgraded Vision Pro, all powered by their M5 chip. Apple’s iPhone 17 series uses the A19 chip, and the iPhone Air features the A19 Pro chip, both offering faster performance, better graphics, and advanced AI capabilities. These recent chips strengthen Apple’s position in the smartphone market and reduce its reliance on third-party suppliers.\n\nBroadcom recently launched Wi Fi 8 chips for smartphones and connected devices, improving speed, reliability, and efficiency. Broadcom, by providing essential smartphone components like Wi Fi, Bluetooth, and RF chips for major brands, remains important in the handset market. The company also focuses on affordable LTE chips for emerging markets, helping OEMs bring affordable smartphones to countries like India.\n\nStory Continues\nQCOM’s Price Performance, Valuation and Estimates Qualcomm shares have gained 11.1% over the past year compared with the industry ’s growth of 35.3%.\n\nImage Source: Zacks Investment Research\nGoing by the price/earnings ratio, the company's shares currently trade at 14.26 forward earnings, lower than 34.54 for the industry.\n\nImage Source: Zacks Investment Research\nEarnings estimates for 2025 have increased 2% to $12.15 over the past 60 days, while those for 2026 have risen 3.4% to $12.60.\n\nImage Source: Zacks Investment Research\nQualcomm stock currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nApple Inc. (AAPL) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "22:00:05",
      "Source": "Zacks",
      "Title": "Broadcom Inc. (AVGO) is Attracting Investor Attention: Here is What You Should Know",
      "URL": "https://finance.yahoo.com/news/broadcom-inc-avgo-attracting-investor-140005180.html",
      "Content": "Broadcom Inc. (AVGO) is Attracting Investor Attention: Here is What You Should Know\n\nZacks Equity Research\nFri, December 26, 2025 at 6:00 AM PST 5 min read\n\nIn this article: AVGO\n\n^GSPC\n\nBroadcom Inc. (AVGO) has recently been on Zacks.com's list of the most searched stocks. Therefore, you might want to consider some of the key factors that could influence the stock's performance in the near future.\nOver the past month, shares of this chipmaker have returned -11.9%, compared to the Zacks S&P 500 composite's +2.6% change. During this period, the Zacks Electronics - Semiconductors industry, which Broadcom Inc. falls in, has lost 3.9%. The key question now is: What could be the stock's future direction?\n\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nRevisions to Earnings Estimates Rather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nFor the current quarter, Broadcom Inc. is expected to post earnings of $2.01 per share, indicating a change of +25.6% from the year-ago quarter. The Zacks Consensus Estimate has changed +5.6% over the last 30 days.\nFor the current fiscal year, the consensus earnings estimate of $9.69 points to a change of +42.1% from the prior year. Over the last 30 days, this estimate has changed +6.3%.\nFor the next fiscal year, the consensus earnings estimate of $13.68 indicates a change of +41.2% from what Broadcom Inc. is expected to report a year ago. Over the past month, the estimate has changed +17.3%.\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Broadcom Inc. is rated Zacks Rank #3 (Hold).\n\nStory Continues\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS Projected Revenue Growth While earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\n\nFor Broadcom Inc., the consensus sales estimate for the current quarter of $19.23 billion indicates a year-over-year change of +28.9%. For the current and next fiscal years, $92.57 billion and $130.01 billion estimates indicate +44.9% and +40.4% changes, respectively.\nLast Reported Results and Surprise History Broadcom Inc. reported revenues of $18.02 billion in the last reported quarter, representing a year-over-year change of +28.2%. EPS of $1.95 for the same period compares with $1.42 a year ago.\nCompared to the Zacks Consensus Estimate of $17.5 billion, the reported revenues represent a surprise of +2.94%. The EPS surprise was +4.28%.\n\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\nValuation No investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\n\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nBroadcom Inc. is graded D on this front, indicating that it is trading at a premium to its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nConclusion The facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Broadcom Inc.. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "19:44:44",
      "Source": "GuruFocus.com",
      "Title": "Top Analyst Says Nvidia and Broadcom May Explode on Next-Gen AI Rollout",
      "URL": "https://finance.yahoo.com/news/cantor-fitzgerald-nvidia-broadcom-may-114444609.html",
      "Content": "Top Analyst Says Nvidia and Broadcom May Explode on Next-Gen AI Rollout\n\nNauman Khan\nFri, December 26, 2025 at 3:44 AM PST 1 min read\n\nIn this article: AVGO\n\nNVDA\n\nGOOG\n\nThis article first appeared on GuruFocus .\nNvidia ( NASDAQ:NVDA ) and Broadcom ( NASDAQ:AVGO ) may be positioned for potential gains in 2026, Cantor Fitzgerald said Wednesday, following a period of recent weakness in semiconductor stocks.\nAnalyst C.J. Muse noted that AI-related stocks have faced pressure since early November amid broader market caution and concerns over an AI valuation bubble. Muse said these concerns might be overstated, given growing demand tied to AI infrastructure.\n\nWarning! GuruFocus has detected 2 Warning Sign with AVGO.\nIs AVGO fairly valued? Test your thesis with our free DCF calculator.\nNvidia shares are trading at roughly 16 times Cantor's earnings estimates. The rollout of next-generation hardware, the Rubin GPU architecture and the custom Vera CPU, which together form the Vera Rubin platform, is expected to support massive-context AI workloads and data center growth.\nBroadcom is valued around 26 times Cantor's earnings estimates. Muse highlighted the company's networking business and its role in supporting Google ( NASDAQ:GOOG ) tensor processing units, which could further benefit from AI-driven infrastructure spending.\nThe firm reiterated Nvidia and Broadcom as top picks for 2026, suggesting investors consider establishing positions ahead of anticipated AI-related growth, according to a Wednesday press release.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "19:44:44",
      "Source": "GuruFocus.com",
      "Title": "Cantor Fitzgerald: Nvidia and Broadcom May Explode on Next-Gen AI Rollout",
      "URL": "https://finance.yahoo.com/news/cantor-fitzgerald-nvidia-broadcom-may-114444609.html",
      "Content": "Cantor Fitzgerald: Nvidia and Broadcom May Explode on Next-Gen AI Rollout\n\nNauman Khan\nFri, December 26, 2025 at 3:44 AM PST 1 min read\n\nIn this article: AVGO\n\nNVDA\n\nGOOG\n\nThis article first appeared on GuruFocus .\nNvidia ( NASDAQ:NVDA ) and Broadcom ( NASDAQ:AVGO ) may be positioned for potential gains in 2026, Cantor Fitzgerald said Wednesday, following a period of recent weakness in semiconductor stocks.\nAnalyst C.J. Muse noted that AI-related stocks have faced pressure since early November amid broader market caution and concerns over an AI valuation bubble. Muse said these concerns might be overstated, given growing demand tied to AI infrastructure.\n\nWarning! GuruFocus has detected 2 Warning Sign with AVGO.\nIs AVGO fairly valued? Test your thesis with our free DCF calculator.\nNvidia shares are trading at roughly 16 times Cantor's earnings estimates. The rollout of next-generation hardware, the Rubin GPU architecture and the custom Vera CPU, which together form the Vera Rubin platform, is expected to support massive-context AI workloads and data center growth.\nBroadcom is valued around 26 times Cantor's earnings estimates. Muse highlighted the company's networking business and its role in supporting Google ( NASDAQ:GOOG ) tensor processing units, which could further benefit from AI-driven infrastructure spending.\nThe firm reiterated Nvidia and Broadcom as top picks for 2026, suggesting investors consider establishing positions ahead of anticipated AI-related growth, according to a Wednesday press release.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "00:47:26",
      "Source": "Investor's Business Daily",
      "Title": "Nvidia Licenses Groq's AI Chip Tech, Grabs Top Execs In Not-Quite Takeover",
      "URL": "https://finance.yahoo.com/m/ba65cea8-f694-3370-b38a-aeedb9f7b0cf/nvidia-licenses-groq%27s-ai.html",
      "Content": "Nvidia Licenses Groq's AI Chip Tech, Grabs Top Execs In Not-Quite Takeover\n\nED CARSON\nThu, December 25, 2025 at 8:47 AM PST 2 min read\n\nIn this article: NVDA\n\nAVGO\n\nGOOG\n\nGROQ.PVT\n\nNvidia will license key technology from AI chip startup Groq, hiring top personnel. It's not a full takeover, but might be close.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "21:30:21",
      "Source": "Investor's Business Daily",
      "Title": "These 7 Stocks Are Analyst Favorites For Magnificent Earnings Growth; GE, Google Among Winners",
      "URL": "https://finance.yahoo.com/m/2b47c372-177e-3051-aa01-406a8d82b220/these-7-stocks-are-analyst.html",
      "Content": "These 7 Stocks Are Analyst Favorites For Magnificent Earnings Growth; GE, Google Among Winners\n\nJUAN CARLOS ARANCIBIA\nThu, December 25, 2025 at 5:30 AM PST 9 min read\n\nIn this article: SCHW\n\nAPH\n\nAVGO\n\nLRCX\n\nGOOG\n\nAmong the best stocks in earnings performance, Broadcom boasts a 98 EPS Rating, one of the highest in the chip sector.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "21:00:15",
      "Source": "Simply Wall St.",
      "Title": "Broadcom's (NASDAQ:AVGO) five-year earnings growth trails the 55% YoY shareholder returns",
      "URL": "https://finance.yahoo.com/news/broadcoms-nasdaq-avgo-five-earnings-130015332.html",
      "Content": "Broadcom's (NASDAQ:AVGO) five-year earnings growth trails the 55% YoY shareholder returns\n\nSimply Wall St\nThu, December 25, 2025 at 5:00 AM PST 3 min read\n\nIn this article: AVGO\n\nBuying shares in the best businesses can build meaningful wealth for you and your family. And we've seen some truly amazing gains over the years. For example, the Broadcom Inc. ( NASDAQ:AVGO ) share price is up a whopping 705% in the last half decade, a handsome return for long term holders. This just goes to show the value creation that some businesses can achieve. And in the last week the share price has popped 7.4%. But this could be related to the buoyant market which is up about 3.1% in a week. It really delights us to see such great share price performance for investors.\n\nThe past week has proven to be lucrative for Broadcom investors, so let's see if fundamentals drove the company's five-year performance.\nTrump has pledged to \"unleash\" American oil and gas and these 15 US stocks have developments that are poised to benefit.\nTo quote Buffett, 'Ships will sail around the world but the Flat Earth Society will flourish. There will continue to be wide discrepancies between price and value in the marketplace...' One imperfect but simple way to consider how the market perception of a company has shifted is to compare the change in the earnings per share (EPS) with the share price movement.\nOver half a decade, Broadcom managed to grow its earnings per share at 49% a year. This EPS growth is reasonably close to the 52% average annual increase in the share price. That suggests that the market sentiment around the company hasn't changed much over that time. In fact, the share price seems to largely reflect the EPS growth.\nYou can see below how EPS has changed over time (discover the exact values by clicking on the image).\nIt's probably worth noting we've seen significant insider buying in the last quarter, which we consider a positive. On the other hand, we think the revenue and earnings trends are much more meaningful measures of the business. Before buying or selling a stock, we always recommend a close examination of historic growth trends, available here. .\n\nWhat About Dividends? When looking at investment returns, it is important to consider the difference between total shareholder return (TSR) and share price return . The TSR incorporates the value of any spin-offs or discounted capital raisings, along with any dividends, based on the assumption that the dividends are reinvested. So for companies that pay a generous dividend, the TSR is often a lot higher than the share price return. We note that for Broadcom the TSR over the last 5 years was 795%, which is better than the share price return mentioned above. The dividends paid by the company have thusly boosted the total shareholder return.\n\nStory Continues\nA Different Perspective It's nice to see that Broadcom shareholders have received a total shareholder return of 47% over the last year. And that does include the dividend. However, the TSR over five years, coming in at 55% per year, is even more impressive. I find it very interesting to look at share price over the long term as a proxy for business performance. But to truly gain insight, we need to consider other information, too. For instance, we've identified 2 warning signs for Broadcom that you should be aware of.\n\nThere are plenty of other companies that have insiders buying up shares. You probably do not want to miss this free list of undervalued small cap companies that insiders are buying.\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "20:22:33",
      "Source": "Investor's Business Daily",
      "Title": "Nvidia Licenses Groq's AI Chip Tech, Grabs Top Execs",
      "URL": "https://finance.yahoo.com/m/ba65cea8-f694-3370-b38a-aeedb9f7b0cf/nvidia-licenses-groq%27s-ai.html",
      "Content": "Nvidia Licenses Groq's AI Chip Tech, Grabs Top Execs\n\nED CARSON\nThu, December 25, 2025 at 4:22 AM PST 1 min read\n\nIn this article: GROQ.PVT\n\nNVDA\n\nGOOG\n\nAVGO\n\nNvidia will license key technology from AI chip startup Groq, hiring top personnel. But it's not a full takeover, as previously reported.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "06:08:28",
      "Source": "Investor's Business Daily",
      "Title": "Nvidia Licenses Groq's AI Chip Tech, Grabs Top Execs, But Not A Takeover",
      "URL": "https://finance.yahoo.com/m/ba65cea8-f694-3370-b38a-aeedb9f7b0cf/nvidia-licenses-groq%27s-ai.html",
      "Content": "Nvidia Licenses Groq's AI Chip Tech, Grabs Top Execs, But Not A Takeover\n\nED CARSON\nWed, December 24, 2025 at 2:08 PM PST 1 min read\n\nIn this article: GROQ.PVT\n\nNVDA\n\nAVGO\n\nGOOG\n\nNvidia will license key technology from AI chip startup Groq, hiring top personnel. But it's not a full takeover, as previously reported.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "03:36:00",
      "Source": "Barrons.com",
      "Title": "This Tech Investor Likes Broadcom, Bloom Energy, and Other AI Bargains",
      "URL": "https://finance.yahoo.com/m/c40c62e1-2a05-3341-b072-3b8d8254886f/this-tech-investor-likes.html",
      "Content": "This Tech Investor Likes Broadcom, Bloom Energy, and Other AI Bargains\n\nAvi Salzman\nWed, December 24, 2025 at 11:36 AM PST 8 min read\n\nIn this article: BE\n\nNVDA\n\nCRWV\n\nGEV\n\nAVGO\n\nPaul Wick of Seligman Investments has piloted his winning fund through numerous technology cycles. How he is playing AI, and why he is skeptical of quantum computing stocks.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "02:30:00",
      "Source": "Yahoo Finance Video",
      "Title": "AI trade: Broadcom has 'one of the great' recurring revenues in tech",
      "URL": "https://finance.yahoo.com/video/ai-trade-broadcom-one-great-183000079.html",
      "Content": "AI trade: Broadcom has 'one of the great' recurring revenues in tech\n\nYahoo Finance Video and Josh Lipton\nWed, December 24, 2025 at 10:30 AM PST\n\nIn this video: AVGO\n\n^IXIC\n\nNVDA\n\n^DJI\n\n^GSPC\n\nRainwater Equity founder and portfolio manager Joseph Shaposhnik discusses what he expects from the AI trade in 2026 — highlighting underlying conditions like the interest rate environment and the state of the US economy — and why semiconductor manufacturer Broadcom ( AVGO ) is among his top stock picks for 2026.\nAlso catch Joseph Shaposhnik explain why he expects the S&P 493 to benefit from outsized returns in 2026.\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination .\n\nVideo Transcript\n\n00:00 Speaker A\nThere was a story out there, Joseph, sort of a narrative that had built that, you know, well, the AI trade and trend had better stay intact. If it doesn't, you know, the market's going to come off its wheels. But having said that, I mean, recently, you can look at, you know, some poster childs of the AI trade. You know, I think of an AI heavy name like an Nvidia. It's well off its 52-week high, Joseph, but this market has continued to grind higher. I'm just curious what you make of that.\n00:23 Joseph\nWell, I think that it it it bolsters the the thesis that the 493 certainly have legs. And I think that I think more broadly, the economy is stronger than people thought it would be when we started the year. Uh, rates are probably lower than uh, lower today than where where we thought they would be. Inflation is probably a tick lower uh, than we thought it would be. So the underlying conditions are somewhat better for the broad market and the broad market has been able to weather as you talked about, the bumps in the road that are inevitable uh uh with regard to the Mag 7 and and the AI trade. So, I think it's positive for the index as we enter 2026 that we've seen some level of broadening. And obviously, we see opportunities uh in the defense sector, uh in in healthcare and selectively in technology as well as as this rally continues to broaden.\n01:21 Speaker A\nYeah, let's get to some of those specific names and picks, Joseph. Uh you like Broadcom here for example. How come? What do you like about C.O. Hock Tan's company specifically? Is it the business model, margins, his AI story?\n01:40 Joseph\nWell, you know, our strategy is to invest in recurring revenue businesses and Broadcom has one of the great uh technology recurring revenue businesses. When you think about how they're positioned with regard to AI, they're really very, very well positioned uh in a category where the product, the GPU is 90% of the cost of the solution. And Broadcom with their XPUs is dramatically reducing the cost of effectuating the outcome that AI provides. And so we think that they'll continue to take market share among the hyperscalers, which is going to drive fantastic revenue growth in the AI business. We see the AI business doubling uh in 2026 for Broadcom and we see it growing very, very rapidly uh after 2026. So long-term, they're very, very well positioned with a product that is that is highly efficient for their customers.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "00:57:54",
      "Source": "Barchart",
      "Title": "1 Broadcom Insider Just Dumped $12 Million in AVGO Stock. Should You Sell Too?",
      "URL": "https://finance.yahoo.com/m/7d48f04b-43d1-35a8-a5dc-b4b24a25fc33/1-broadcom-insider-just.html",
      "Content": "1 Broadcom Insider Just Dumped $12 Million in AVGO Stock. Should You Sell Too?\n\nAditya Raghunath\nWed, December 24, 2025 at 8:57 AM PST 4 min read\n\nIn this article: AVGO\n\nBroadcom's (AVGO) Chief Legal and Corporate Affairs Officer, Mark David Brazeal, recently sold 38,281 AVGO shares valued at $12.54 million, unloading stock in the $322.29 to $345.01 per share range.\nThe timing of the sale is notable as it came amid growing investor skepticism about returns on massive AI infrastructure investments, even as Broadcom reported strong quarterly results that beat analyst expectations.\n\nMore News from Barchart 2 Dividend Kings Quietly Beating the Market This Year\n$800 for Tesla Stock Could Be Reality in 2026. Here’s Why.\nApple Just Released a New AI Model. Should You Buy AAPL Stock Here?\nOur exclusive Barchart Brief newsletter is your FREE midday guide to what's moving stocks, sectors, and investor sentiment - delivered right when you need the info most. Subscribe today!\n\nThe semiconductor giant's stock has experienced unusual volatility despite posting impressive numbers. Broadcom delivered fourth-quarter earnings of $1.95 per share on revenue of $18.02 billion, both exceeding Wall Street forecasts.\nCEO Hock Tan projected AI chip sales would double year-over-year (YoY) to $8.2 billion in the current quarter, driven by custom chips and AI networking semiconductors. The company also disclosed a massive $73 billion backlog for custom chips and data center components over the next 18 months.\nYet shares initially climbed in after-hours trading before reversing course during the earnings call, ultimately plunging around 17% over two trading sessions. Valued at a market cap of $1.65 trillion, AVGO stock is down 18% below all-time highs.\nInvestors are concerned about potential margin compression as Broadcom scales production. In the recent earnings call, company CFO Kirsten Spears warned that gross margins could decline for some AI chip systems.\n\nLet’s see if you should buy, sell, or hold AVGO stock at the current multiples.\nBroadcom Stock Benefits From a Widening AI Moat Broadcom CEO Hock Tan dropped a bombshell during a recent investor presentation, disclosing that his 2030 compensation incentives are tied to growing AI revenue to more than $120 billion. Comparatively, in fiscal 2025, Broadcom’s AI sales were around $20 billion.\nManagement expects explosive growth despite recent stock weakness and insider selling activity. Tan clarified that Broadcom is laser-focused on just seven customers creating large language models and dismissed the broader enterprise market as irrelevant to the company's core AI strategy.\nThese hyperscalers and AI labs are engaged in a race toward super intelligence, which requires massive investments in compute infrastructure that Broadcom supplies through custom accelerator chips and advanced networking equipment.\n\nStory Continues\nThe CEO emphasized that custom ASICs and networking infrastructure represent Broadcom's competitive moat rather than merchant GPUs sold to thousands of smaller enterprises. He highlighted that networking becomes the critical bottleneck as AI clusters scale from 100,000 to potentially 1 million GPUs working simultaneously.\n\nBroadcom's intellectual property in orchestrating these massive parallel workloads through Ethernet-based networks provides differentiation that competitors struggle to match.\nTan revealed that fiscal 2026 AI revenue growth would accelerate materially beyond the previously guided 60% rate, driven by a recently converted customer focused on inference workloads.\nHe confirmed Anthropic as the mystery customer who placed a $10 billion order for Google's (GOOG) (GOOGL) tensor processing units during the quarter. Broadcom now has five customers for custom chips, with two additional prospects in the pipeline.\nThe networking business stands to benefit as customers transition from copper-based connections to optical networking capable of 100 terabits per second bandwidth. This shift enables memory sharing across 512 or even 1,024 accelerator chips within a single rack, which improves training convergence times. Tan expects this optical transition to accelerate in 2027 as cluster sizes expand.\n\nDespite a bullish long-term vision, Broadcom acknowledged near-term margin pressure as it scales production of AI chip systems.\nIs AVGO Stock Overvalued Right Now? Analysts tracking AVGO stock forecast revenue to increase from $64 billion in fiscal 2025 (ended in October) to $227 billion in fiscal 2030. In this period, adjusted earnings are forecast to expand from $6.82 per share to $23.37 per share.\nIf Broadcom stock is priced at 27x forward earnings, which is similar to its three-year average, the stock should trade around $630 in late 2028, indicating an upside potential of 70% from current levels.\nOut of the 40 analysts covering AVGO stock, 34 recommend “Strong Buy,” three recommend “Moderate Buy,” and three recommend “Hold.” The average AVGO stock price target is $456.20, above the current price of $351.\nOn the date of publication, Aditya Raghunath did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "00:57:13",
      "Source": "24/7 Wall St.",
      "Title": "Uh-Oh! Did Nvidia Just Signal Problems with Intel’s Comeback?",
      "URL": "https://finance.yahoo.com/m/7543d356-0a38-3696-b5bf-15da91a3ccb7/uh-oh%21-did-nvidia-just-signal.html",
      "Content": "Uh-Oh! Did Nvidia Just Signal Problems with Intel’s Comeback?\n\nRich Duprey\nWed, December 24, 2025 at 8:57 AM PST 4 min read\n\nIn this article: INTC\n\nNVDA\n\nAVGO\n\nTSM\n\nQuick Read Intel ( INTC ) secured $8.9B from the U.S. government and $5B from Nvidia ( NVDA ) to revive its foundry business.\nNvidia halted testing of Intel’s 18A chip manufacturing process and stopped moving forward with production plans.\nIntel’s foundry turnaround depends on 18A attracting major customers beyond smaller deals with Microsoft and Amazon .\nIf you’re thinking about retiring or know someone who is, there are three quick questions causing many Americans to realize they can retire earlier than expected. take 5 minutes to learn more here\n\nIntel ( NASDAQ: INTC ) has experienced a dramatic shift in fortunes over the past year. Once viewed as a failing chipmaker losing ground to competitors like Broadcom ( NASDAQ: AVGO ), Taiwan Semiconductor Manufacturing ( NYSE: TSM ), and Nvidia ( NASDAQ: NVDA ), Intel faced speculation that rivals were circling its foundry business and other assets.\nBy the middle of the year, however, Intel regained momentum through significant backing from the Trump administration, which converted CHIPS Act grants into an equity stake worth approximately $8.9 billion, or 10% of the company, making the U.S. government its largest shareholder. This was followed by a $5 billion investment from Nvidia, giving it roughly a 4% stake, as well as partnerships aimed at joint product development in data centers and PCs.\n\nThese moves indicated renewed confidence, positioning Intel as a key player in U.S. semiconductor manufacturing once again. Yet, a Reuters report today suggests a big potential setback, raising questions about whether Intel's revival is beginning to falter.\nA Promising Rebound Built on Execution Intel's recent progress has been notable, driven by strategic investments and a focus on revitalizing its core businesses. The Trump administration's equity stake provided essential capital and aligned Intel with national priorities for domestic chip production.\nWeeks later, Nvidia's $5 billion commitment further supported Intel's turnaround, with the two firms agreeing to collaborate on custom x86 CPUs for Nvidia's AI platforms and integrated system-on-chips for PCs. An Intel spokesperson emphasized that 18A technologies are \"progressing well.\"\n\nDespite these positive developments, the rebound has always hinged on Intel's ability to execute, particularly in its foundry business. The 18A process node has been central to its plans for regaining manufacturing leadership, as it is intended to enable high-volume production of advanced chips and attract customers.\nNvidia's Decision Raises Questions About 18A According to the Reuters article, Nvidia recently evaluated whether to manufacture its next-generation chips using Intel's 18A process but halted the testing and stopped moving forward. Two sources familiar with the matter confirmed this to Reuters, though Nvidia declined to comment.\n\nStory Continues\nThis development comes despite Nvidia's earlier investment and ongoing product collaborations, which explicitly did not include commitments to use Intel's foundry. Intel has previously noted strong interest in 18A, and the company continues to highlight progress on the node, with products like Panther Lake and Clearwater Forest ramping up toward production.\n\nThe reasons for Nvidia's decision remain unclear, but earlier reports indicated both Nvidia and Broadcom conducted tests on 18A. While testing is a standard step, not all evaluations lead to production commitments.\nIf technical or yield issues contributed to the halt, it could signal challenges for Intel in convincing major designers to shift volume from established leaders like Taiwan Semiconductor. Intel's foundry has faced scrutiny over quality and scalability before, though the company maintains that 18A is on track and sees interest shifting to the subsequent 14A node for even more advanced applications.\nBroader Implications for Intel's Foundry Strategy Winning high-profile customers has been a key goal for Intel Foundry, which has invested heavily to compete as a contract manufacturer. Deals with Microsoft ( NASDAQ:MSFT ) and Amazon ( NASDAQ:AMZN ) for custom chips on 18A have been announced, and Apple ( NASDAQ:AAPL ) might go with Intel for its entry-level M-series chips in 2027, but volumes from such clients are relatively small compared to demands from AI leaders like Nvidia.\n\nNvidia halting the testing -- while not a definitive rejection -- underscores the high bar set for advanced nodes. Competitors continue to dominate high-end production, and Intel must demonstrate reliable yields and performance to secure larger commitments.\nKey Takeaway Investors should not read too much into Nvidia's decision to pause 18A testing at this stage, as qualification processes are lengthy and multifaceted. However, greater caution is warranted moving forward.\nMuch of Intel's turnaround depends on the success of the 18A process in delivering competitive manufacturing capabilities. If the node falls short of expectations in attracting major business from customers, it could complicate the company's path to foundry profitability and an overall recovery.\nThe New Report Shaking Up Retirement Plans You may think retirement is about picking the best stocks or ETFs, but you’d be wrong. Even great investments can be a liability in retirement. It’s a simple difference between accumulating vs distributing, and it makes all the difference.\nThe good news? After answering three quick questions many Americans are reworking their portfolios and finding they can retire earlier than expected. If you’re thinking about retiring or know someone who is, take 5 minutes to learn more here .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "00:02:00",
      "Source": "Zacks",
      "Title": "Broadcom's Semiconductor Growth Picks Up: A Sign of More Upside?",
      "URL": "https://finance.yahoo.com/news/broadcoms-semiconductor-growth-picks-sign-160200093.html",
      "Content": "Broadcom's Semiconductor Growth Picks Up: A Sign of More Upside?\n\nAniruddha Ganguly\nWed, December 24, 2025 at 8:02 AM PST 3 min read\n\nIn this article: AVGO\n\nGOOG\n\nANTH.PVT\n\nMETA\n\nBroadcom ’s AVGO Semiconductor revenues are benefiting from strong demand for XPUs, which are a type of application-specific integrated circuit (ASIC) necessary to train Generative AI (Gen AI) models. In the fourth quarter of fiscal 2025, AI revenues surged 74% year over year to $6.5 billion. XPU adoption accelerated in the reported quarter as enterprises continue to use these to train their large language models and monetize their platforms through inference APIs and applications. Alphabet and Meta Platforms are major users of these XPUs.\n\nAVGO’s expanding clientele, which now includes Anthropic, is driving growth. In the third quarter of fiscal 2025, Broadcom received a $10 billion order to sell Alphabet’s latest TPU Ironwood racks to Anthropic. In the fourth quarter of fiscal 2025, Broadcom received an additional order worth $11 billion from the same customer. The company’s current order backlog for AI switches exceeds $10 billion as AVGO’s latest 102-terabit per second Tomahawk 6 switch continues to gain traction. AVGO now expects first-quarter fiscal 2026 AI revenues to double year over year to $8.2 billion.\n\nAVGO’s networking portfolio is gaining from strong demand for Tomahawk 6 products, as well as the Jericho 4 Ethernet fabric router. Broadcom also has a rich partner base that includes the likes of OpenAI, Walmart, NVIDIA, Canonical, Arista Networks, Alphabet, Dell Technologies, Meta Platform, Juniper and Supermicro, among others. AVGO expects first-quarter fiscal 2026 Semiconductor revenues of $12.3 billion, suggesting 50% year-over-year growth. Infrastructure Software revenues are expected to grow 2% year over year to $6.8 billion.\n\nAVGO Faces Tough Competition in the Semiconductor Market Broadcom is a major player in the semiconductor market, but is facing stiff competition from NVIDIA NVDA and Marvell Technology MRVL.\n\nNVIDIA is benefiting from the strong growth of AI and high-performance accelerated computing. The growing demand for Gen AI and large language models using GPUs based on NVIDIA’s Hopper and Blackwell architectures is aiding data center revenues. In the third quarter of fiscal 2026, revenues from Data Center (accounted for 89.8% of NVDA revenues) jumped 66% year over year and 25% sequentially to $51.22 billion.\n\nMarvell Technology is benefiting from the strong demand environment across the data center end market. MRVL’s data center end-market revenues jumped 39% year over year in the third quarter of fiscal 2026, propelled by strong growth across AI-driven demand for custom XPU silicon and electro-optics interconnect products. Marvell Technology’s AI-driven custom silicon business has secured more than 20 multi-generational XPU and XPU-attach socket wins. MRVL’s design pipeline has expanded to more than 50 opportunities worth $75 billion, underscoring hyperscalers’ growing reliance on Marvell’s differentiated capabilities.\n\nStory Continues\nAVGO’s Share Price Performance, Valuation & Estimates Broadcom shares have appreciated 45.7% in a year, outperforming the broader Zacks Computer and Technology sector’s return of 21.6%.\nAVGO Stock Outperforms Sector\n\nImage Source: Zacks Investment Research\n\nThe AVGO stock is trading at a premium, with a forward 12-month price/earnings of 33.89X compared with the broader sector’s 27.78X. Broadcom has a Value Score of D.\nAVGO Stock has a Stretched Valuation\n\nImage Source: Zacks Investment Research\n\nThe Zacks Consensus Estimate for fiscal 2026 earnings is pegged at $9.69 per share, 5.7% over the past 30 days, suggesting 42.1% growth from fiscal 2025’s reported figure.\n\nBroadcom Inc. Price and Consensus Broadcom Inc. price-consensus-chart | Broadcom Inc. Quote\n\nBroadcom currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nMarvell Technology, Inc. (MRVL) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "23:17:00",
      "Source": "Zacks",
      "Title": "MRVL's Data Center Revenues Hit $1.5B: Can the Momentum Continue?",
      "URL": "https://finance.yahoo.com/news/mrvls-data-center-revenues-hit-151700765.html",
      "Content": "MRVL's Data Center Revenues Hit $1.5B: Can the Momentum Continue?\n\nOm Jaiswal\nWed, December 24, 2025 at 7:17 AM PST 3 min read\n\nMarvell Technology MRVL posted strong results in the third quarter of fiscal 2026, which was led by its data center business. Revenues from the data center business reached $1.52 billion, up 38% from a year ago. This segment made up about 73% of total revenues, showing that data centers are now becoming the main growth engine for the company.\n\nThe main growth driver for the data center business is rapidly rising artificial intelligence (AI) spending by large cloud customers. As these customers add more AI servers, they need faster and more reliable networking. This is helping demand for Marvell Technology’s interconnect products, such as optical digital signal processors, drivers and Transimpedance Amplifiers. Management said revenues from optical interconnect products grew at a double-digit rate from the previous quarter, pointing to healthy demand.\nMarvell Technology is also seeing solid growth in its data center switching and storage business. Demand for 12.8T switches remains strong, and the company has started shipping newer 51.2T switches. As a result, Marvell Technology now expects data center switch revenues to exceed $500 million in fiscal 2027.\n\nThe custom silicon business is another key growth area. Marvell Technology already has purchase orders covering the full fiscal-year forecast for a major next-generation XPU program at a large customer. While custom revenues can move up and down each quarter, Marvell technology expects this business to grow at least 20% in fiscal 2027.\n\nLooking ahead, Marvell Technology expects data center revenues to grow more than 25% in fiscal 2027. This outlook is supported by continued AI investments, higher product use inside AI systems and strong customer demand. Overall, MRVL’s wide data center product lineup puts it in a good position to benefit if AI infrastructure spending continues. The Zacks Consensus Estimate for MRVL's fiscal 2026 and 2027 revenues suggests a year-over-year increase of 41.9% and 22.4%, respectively.\n\nHow Competitors Fare Against MRVL Marvell Technology competes with Broadcom AVGO and NVIDIA NVDA in the data center market.\nBroadcom benefits from AI through its networking chips and custom silicon used by large cloud customers. AVGO’s AI revenues grew 65% year over year to $20 billion in fiscal 2025 and 74% year over year in the fourth quarter of fiscal 2025. Furthermore, Broadcom expects its AI revenues to double year over year in the first quarter of fiscal 2026 to around $8.2 billion.\n\nNVIDIA sits at the center of AI data centers with its graphics processing units (GPUs), which power most AI workloads today. The company reported $51 billion in data center revenues in the third quarter of fiscal 2026, up 66% year over year. NVIDIA also benefits indirectly from higher spending on networking and connectivity around AI clusters, which raises demand for GPUs.\n\nStory Continues\nMRVL's Price Performance, Valuation and Estimates Shares of Marvell Technology have gained 16.6% in the past six months compared with the Zacks Electronics - Semiconductors industry’s growth of 25.8%.\nMRVL 6-Month Performance Chart\nImage Source: Zacks Investment Research\nFrom a valuation standpoint, Marvell Technology trades at a forward price-to-sales ratio of 7.33X, higher than the industry’s average of 6.42X.\nMRVL Forward 12-Month (P/S) Valuation Chart\nImage Source: Zacks Investment Research\nThe Zacks Consensus Estimate for MRVL’s fiscal 2026 and 2027 earnings implies year-over-year growth of 80.9% and 26.1%, respectively. The estimates for fiscal 2026 have been revised upward by a penny over the past 30 days, while the estimates for fiscal 2027 have been revised upward by a cent over the past seven days.\n\nImage Source: Zacks Investment Research\nMarvell Technology currently sports a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nMarvell Technology, Inc. (MRVL) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "22:34:54",
      "Source": "GuruFocus.com",
      "Title": "INTC: Intel Stock Falls After Nvidia Backs Out of 18A Chip Deal",
      "URL": "https://finance.yahoo.com/news/intc-intel-stock-falls-nvidia-140806180.html",
      "Content": "INTC: Intel Stock Falls After Nvidia Backs Out of 18A Chip Deal\n\nNauman Khan\nWed, December 24, 2025 at 6:34 AM PST 1 min read\n\nIn this article: NVDA\n\nINTC\n\nAVGO\n\nTSM\n\nThis article first appeared on GuruFocus .\nIntel ( NASDAQ:INTC ) stock slipped about 2% on early Wednesday after reports indicated that Nvidia ( NASDAQ:NVDA ) chose not to use Intel's 18A manufacturing process.\nThe two companies had tested the process earlier this year, but Nvidia reportedly decided against moving forward. Broadcom ( NASDAQ:AVGO ) also took part in similar trials.\n\nWarning! GuruFocus has detected 5 Warning Signs with INTC.\nIs INTC fairly valued? Test your thesis with our free DCF calculator.\nIntel's 18A technology is part of its effort to attract external chipmakers as customers, but early evaluations faced technical challenges, which may be affecting demand.\nShares of Nvidia remained mostly steady, suggesting minimal immediate impact on its production plans.\nThe company continues to rely heavily on Taiwan Semiconductor Manufacturing Company (TSM) for advanced chip fabrication.\nFor Intel, the decision underscores the competitive hurdles in winning high-profile foundry clients while trying to scale its advanced manufacturing capabilities.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "21:00:08",
      "Source": "Yahoo Finance",
      "Title": "These 6 stocks will lead the $1 trillion chip surge in 2026, BofA says",
      "URL": "https://finance.yahoo.com/news/these-6-stocks-will-lead-the-1-trillion-chip-surge-in-2026-bofa-says-130008431.html",
      "Content": "These 6 stocks will lead the $1 trillion chip surge in 2026, BofA says\n\nFrancisco Velasquez\nWed, December 24, 2025 at 5:00 AM PST 4 min read\n\nIn this article: NVDA\n\nAVGO\n\n^GSPC\n\nLRCX\n\nKLAC\n\nThe artificial intelligence boom isn't cooling off — it's getting bigger, Bank of America analyst Vivek Arya contends.\nWhile AI skeptics have pointed to eye-popping valuations as a reason to run, Arya said the industry is only at the \"midpoint\" of a decade-long transformation, and it's being led by Nvidia ( NVDA ) and Broadcom ( AVGO ).\n\nIn a report titled \"2026 Year Ahead: choppy, still cheerful,\" Arya forecast a 30% year-over-year surge in global semiconductor sales that will finally push the sector past a historic $1 trillion annual sales milestone in 2026.\nArya noted a strong belief in companies with \"moats that are quantified by their margin structure.\" In addition to Nvidia and Broadcom, he highlighted four other large-cap semiconductor companies — Lam Research ( LRCX ), KLA ( KLAC ), Analog Devices ( ADI ), and Cadence Design Systems ( CDNS ) — as his top picks for 2026.\n\"I often say that investing in semis is very simple,\" Arya told reporters on a Dec. 19 call. \"You don't need any sell-side analyst to do that. Just take all your companies, sort them by gross margins, and buy the top five, and you're not going to be that wrong.\"\nBofA estimates that the total addressable market for AI data center systems will reach over $1.2 trillion by 2030, representing a compound annual growth rate of 38%. AI accelerators alone represent a $900 billion opportunity.\nDespite these staggering figures, the market remains cautious because AI data centers are expensive. A typical 1 gigawatt facility requires upwards of $60 billion in capital expenditures, with roughly half of that going directly to hardware, per Bank of America.\n\nThat raises the question: Will the return on investment ever materialize?",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "20:18:00",
      "Source": "Barrons.com",
      "Title": "Intel Stock Drops. Blame Nvidia.",
      "URL": "https://finance.yahoo.com/m/55f3a67f-ab89-3ac2-96a9-e86bd28f1318/intel-stock-drops.-blame.html",
      "Content": "Intel Stock Drops. Blame Nvidia.\n\nJack Denton\nWed, December 24, 2025 at 4:18 AM PST 1 min read\n\nIn this article: NVDA\n\n^GSPC\n\nINTC\n\nAVGO\n\nIntel stock was falling on Wednesday following a report that Nvidia had abandoned prospective plans to use the company’s chip production process. Shares of Intel retreated 3.5% in premarket trading ahead of a holiday-shortened Christmas Eve session. Nvidia stock was down 0.5%.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "19:20:00",
      "Source": "Motley Fool",
      "Title": "Prediction: These 3 Artificial Intelligence (AI) Stocks Will Be Big Winners Again in 2026",
      "URL": "https://finance.yahoo.com/m/0b954eed-e4d9-39b2-b35e-1eb8792e4ded/prediction%3A-these-3.html",
      "Content": "Prediction: These 3 Artificial Intelligence (AI) Stocks Will Be Big Winners Again in 2026\n\nBeth McKenna, The Motley Fool\nWed, December 24, 2025 at 3:20 AM PST 5 min read\n\nIn this article: NVDA\n\nAVGO\n\nTSM\n\nKey Points Nvidia stock is a top buy for tech investors, as the company's AI-enabling GPUs are largely powering the AI revolution.\nBroadcom stock is a top buy, thanks largely to the strong demand for the company's custom AI chips.\nTaiwan Semiconductor Manufacturing stock is a top buy because the world's largest chip foundry is profiting significantly from the powerful demand for AI chips, both GPUs and custom chips.\n10 stocks we like better than Nvidia ›\n\nArtificial intelligence (AI) stocks, as a group, have been among the best-performing groups in 2025, just as they were in 2024.\nThree AI stocks that were big winners in 2025, as of Dec. 23, and that I believe will be big winners again in 2026, are Nvidia (NASDAQ: NVDA) , Broadcom (NASDAQ: AVGO) , and Taiwan Semiconductor Manufacturing , or TSM (NYSE: TSM) .\n3 Top AI stocks to buy for 2026 Stocks are listed in order of 5-year return.\nCompany\nMarket Cap\nForward P/E\nWall Street's Estimated Annualized 5-Year EPS Growth\nYear-to-Date 2025 Stock Return\n5-Year Stock Return\nNvidia\n$4.8 trillion\n24.0\n48.5%\n40.9%\n1,359%\nBroadcom\n$1.7 trillion\n34.4\n35.9%\n52%\n813%\nTaiwan Semiconductor Manufacturing\n$1.2 trillion\n24.5\n30.4%\n52.4%\n211%\nS&P 500 Index\n--\n--\n--\n19%\n102%\n\nData sources: Yahoo! Finance and YCharts. P/E = price-to-earnings ratio . EPS = earnings per share. Data as of Dec. 23, 2025.\nNvidia: The dominant maker of AI chips and related tech Nvidia's graphics processing units (GPUs), its flagship semiconductors, are considered the gold standard for training artificial intelligence (AI) models and deploying AI applications.\nThe company's data center platform had been performing well for quite some time. But demand began skyrocketing for its AI-enabling products -- its GPUs and high-performance networking products -- soon after OpenAI released its ChatGPT chatbot in late 2022. This event demonstrated to company leaders and the general public the phenomenal capabilities of generative AI.\n\nIn late October at the company's GTC (GPU Technology Conference) in Washington, D.C., CEO Jensen Huang said that management has \"visibility\" into $500 billion of demand for its key data center technology over the next five quarters . This demand of $100 billion per quarter, on average, is truly mind-blowing. As context, in its fiscal third quarter (ended late October), Nvidia's total revenue was $57.0 billion, of which $51.2 billion was from the data center platform.\nBroadcom: The leading maker of custom AI chips Broadcom develops semiconductors for various end markets and also develops infrastructure software.\n\nStory Continues\nThe company's robust growth is being drven by strong demand for its custom AI-enabling application-specific integrated circuits (ASICs) and Ethernet networking products, both for data centers. Its acquisition of software maker VMware in late 2023 is proving to be a shrewd move, as this business is also growing nicely.\n\nBroadcom is the top partner for big tech companies seeking custom ASICs. As the name suggests, these chips are designed for specific applications. These include internal uses and, in some cases, for availability in their cloud computing services. By contrast, Nvidia's GPUs can be considered more general-purpose AI chips. There is a need for both GPUs and ASICs, so investors shouldn't be concerned that one of these types of chips will fully win out over the other.\nTSM: The world's largest chip foundry Taiwan Semiconductor Manufacturing is the world's largest chip foundry. That means it produces chips of various types for companies that contract out all or some of the manufacturing of chips they design.\nTSM is the largest producer of AI chips worldwide, which has led to significant financial growth in recent years, driven by surging demand for these chips.\n\nTSM's customers include nearly every major chip company, such as Nvidia, Broadcom, and Advanced Micro Devices (AMD), which is Nvidia's main rival in the AI-enabling GPU market. Moreover, it also manufactures chips, including AI chips, for major tech companies that have designed their own chips. This includes Apple , widely considered the company's largest customer, though some Wall Street analysts expect Nvidia to soon overtake Apple as TSM's top customer.\nAn added benefit for some investors is that TSM pays a decent dividend for a tech company. The dividend yield was 1.13%, as of the close of the market on Dec. 23.\nShould you buy stock in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $502,783 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,126,057 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 975 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nBeth McKenna has positions in Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Apple, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nPrediction: These 3 Artificial Intelligence (AI) Stocks Will Be Big Winners Again in 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "18:56:24",
      "Source": "Barchart",
      "Title": "Stock Index Futures Muted in Thin Pre-Christmas Trade, U.S. Jobless Claims Data on Tap",
      "URL": "https://finance.yahoo.com/m/1e16e8cd-5295-3f00-9936-f4f0210746e8/stock-index-futures-muted-in.html",
      "Content": "Stock Index Futures Muted in Thin Pre-Christmas Trade, U.S. Jobless Claims Data on Tap\n\nOleksandr Pylypenko\nWed, December 24, 2025 at 2:56 AM PST 7 min read\n\nIn this article: ZIM\n\nINTC\n\nNOW\n\nNKE\n\nMRVL\n\nMarch S&P 500 E-Mini futures (ESH26) are down -0.03%, and March Nasdaq 100 E-Mini futures (NQH26) are down -0.01% this morning ahead of a holiday-shortened pre-Christmas trading session.\nThe U.S. stock markets will close early at 1 p.m. Eastern Time today and remain closed on Thursday in observance of the Christmas holiday.\n\nMore News from Barchart 2 Dividend Kings Quietly Beating the Market This Year\nApple Just Released a New AI Model. Should You Buy AAPL Stock Here?\nBroadcom (AVGO) Stock Options Are Signaling Pensiveness. Here’s Why the Fear Might Be Unwarranted.\nStop Missing Market Moves: Get the FREE Barchart Brief – your midday dose of stock movers, trending sectors, and actionable trade ideas, delivered right to your inbox. Sign Up Now!\n\nIn yesterday’s trading session, Wall Street’s major indexes ended in the green, with the S&P 500 notching a new record high. Most members of the Magnificent Seven stocks advanced, with Nvidia (NVDA) rising over +3% to lead gainers in the Dow and Amazon.com (AMZN) gaining more than +1%. Also, some chip stocks gained ground, with Marvell Technology (MRVL) climbing over +3% to lead gainers in the Nasdaq 100 and Broadcom (AVGO) rising more than +2%. In addition, ZIM Integrated Shipping Services (ZIM) climbed over +5% after the company said it had received multiple acquisition offers as part of its ongoing review of strategic alternatives. On the bearish side, ServiceNow (NOW) fell more than -1% after agreeing to acquire cybersecurity firm Armis for $7.75 billion in cash.\n\nThe U.S. Bureau of Economic Analysis, in its initial estimate of Q3 GDP growth, said on Tuesday that the economy grew at a +4.3% annualized rate, stronger than expectations of +3.3%. Also, U.S. November industrial production rose +0.2% m/m, stronger than expectations of +0.1% m/m. At the same time, U.S. durable goods orders fell -2.2% m/m in October, weaker than expectations of -1.5% m/m, and core durable goods orders, which exclude transportation, rose +0.2% m/m, weaker than expectations of +0.3% m/m. In addition, the U.S. Conference Board’s consumer confidence index fell to 89.1 in December, weaker than expectations of 91.7.\n“The strongest pace of economic growth in two years is bolstering confidence that corporate earnings will continue to expand robustly in 2026,” said Jose Torres at Interactive Brokers. At the same time, U.S. money markets continue to price in at least two Federal Reserve rate cuts in 2026.\nMeanwhile, the much-anticipated Santa Claus Rally period officially kicks off today. Since 1950, the S&P 500 has delivered an average return of 1.3%, posting gains 78% of the time, according to Adam Turnquist at LPL Financial.\n\nStory continues\nToday, investors will focus on U.S. Initial Jobless Claims data, which is set to be released in a couple of hours. Economists estimate this figure will come in at 224K, the same as last week.\nU.S. rate futures have priced in an 86.7% chance of no rate change and a 13.3% chance of a 25 basis point rate cut at the January FOMC meeting.\n\nIn the bond market, the yield on the benchmark 10-year U.S. Treasury note is at 4.160%, down -0.22%.\nThe Euro Stoxx 50 Index is up +0.03% this morning, struggling for direction in quiet pre-holiday trading, with major markets like Germany shut and others, including London and Paris, set for early closures. Energy stocks advanced on Wednesday, as oil prices climbed for a sixth straight session. Luxury stocks also gained ground. Meanwhile, the regional Stoxx 600 index hit a new record high on Tuesday and is on track for its best annual performance since 2021, underpinned by lower interest rates, Germany’s fiscal spending push, and investor rotation away from expensive U.S. technology stocks. In other news, the Bank of Spain raised its economic growth forecast to 2.9% from 2.6% for this year and to 2.2% from 1.8% for 2026. In corporate news, BP Plc (BP-.LN) rose as much as +1.4% before paring gains after agreeing to sell a 65% stake in its Castrol unit to investment firm Stonepeak for about $8 billion.\n\nThe European economic data slate is empty on Wednesday.\nAsian stock markets today settled mixed. China’s Shanghai Composite Index (SHCOMP) closed up +0.53%, and Japan’s Nikkei 225 Stock Index (NIK) closed down -0.14%.\nChina’s Shanghai Composite Index closed higher today, extending its gains for a sixth consecutive session. The benchmark index notched its longest winning streak since July. Technology stocks gained ground on Wednesday. Global investors are ramping up bets on Chinese AI-related companies, wagering on the next DeepSeek and looking to diversify. Earlier this week, Moore Threads Technology, often referred to by analysts as “China’s Nvidia,” introduced a range of new products, including its next-generation chip architecture and AI chips. Meanwhile, the yuan extended its gains on Wednesday, moving closer to the key 7-per-dollar level after the People’s Bank of China set a firmer fixing. In other news, the Trump administration said on Tuesday it will impose tariffs on Chinese semiconductor imports over Beijing’s “unreasonable” push for chip industry dominance, but will delay the move until June 2027. Hong Kong’s market will be closed on Thursday and Friday for the Christmas holidays, while mainland China’s financial markets will remain open as usual.\n\nJapan’s Nikkei 225 Stock Index gave up earlier gains and closed slightly lower today, marking its first decline in four sessions. Japanese equities were pressured by a stronger yen. A stronger yen reduces the value of overseas sales for the country’s heavyweight exporters, with automakers among the notable underperformers on the day. The Japanese currency rose for a third day as traders stayed alert for signs of intervention following Tokyo’s warning against excessive moves. Financial stocks also slumped, paring some of the sharp gains that followed the Bank of Japan’s interest-rate hike last Friday. Limiting losses, some chip stocks climbed, tracking overnight gains in their U.S. peers. Data from the Cabinet Office released on Wednesday showed that Japan’s October leading economic indicators index, which gauges the economic outlook for a few months ahead based on data such as job offers and consumer sentiment, was revised slightly lower. Meanwhile, minutes from the Bank of Japan’s October meeting released on Wednesday showed that policymakers debated the need to keep raising interest rates toward levels seen as neutral for the economy. A few members of the nine-member board also said recent yen declines could risk an inflation overshoot by driving up import costs. In other news, a draft seen by Reuters showed that Japan plans to issue new government bonds worth about $189 billion to finance a record-sized budget for the next fiscal year. Investor focus is now squarely on a raft of Japan’s economic data, scheduled for release on Friday, including Tokyo core CPI, industrial production, retail sales, and employment figures. Investors also await BOJ Governor Kazuo Ueda’s speech on Thursday, as they seek guidance on the central bank’s policy path. The Nikkei Volatility Index, which takes into account the implied volatility of Nikkei 225 options, closed up +0.36% to 22.38.\n\nThe Japanese November Corporate Services Price Index rose +2.7% y/y, in line with expectations.\nThe Japanese October Leading Index came in at 109.8, weaker than expectations of 110.0.\nPre-Market U.S. Stock Movers\nDynavax (DVAX) jumped over +37% in pre-market trading after Sanofi agreed to buy the vaccine maker for about $2.2 billion.\nUiPath (PATH) climbed more than +8% in pre-market trading after S&P Dow Jones Indices announced that the software company would be added to the S&P MidCap 400 index on January 2nd.\nNike (NKE) rose over +2% in pre-market trading after a regulatory filing revealed that Apple CEO Tim Cook purchased 50,000 shares of the footwear maker on Monday.\nIntel (INTC) slid more than -2% in pre-market trading after Reuters reported that Nvidia has paused testing to manufacture on Intel’s 18A chipmaking node following initial tests.\n\nKB Home (KBH) fell about -0.8% in pre-market trading after Raymond James downgraded the stock to Market Perform from Outperform.\nYou can see more pre-market stock movers here\nToday’s U.S. Earnings Spotlight: Wednesday - December 24th\nNone.\nOn the date of publication, Oleksandr Pylypenko did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "14:23:12",
      "Source": "GuruFocus.com",
      "Title": "Broadcom CEO Dumps $42 Million in Stock -- Insider Sales Top $100 Million",
      "URL": "https://finance.yahoo.com/news/broadcom-insider-selling-tops-100-151314392.html",
      "Content": "Broadcom CEO Dumps $42 Million in Stock -- Insider Sales Top $100 Million\n\nNauman Khan\nTue, December 23, 2025 at 10:23 PM PST 1 min read\n\nIn this article: AVGO\n\nThis article first appeared on GuruFocus .\nBroadcom ( NASDAQ:AVGO ) Chief Executive Officer and President Hock Tan sold 130,000 shares , generating about $42.38 million in proceeds, according to a SEC filing.\nThe sale, executed on Dec. 18 and reported in a Form 4 filed Dec. 22, trimmed Tan's direct stake to roughly 595,638 shares, regulatory records show.\n\nWarning! GuruFocus has detected 3 Warning Sign with AVGO.\nIs AVGO fairly valued? Test your thesis with our free DCF calculator.\nThat single trade is the latest in a string of disposals by Tan and other executives this year. When combined with earlier sales, the cumulative total of insider disposals tied to Broadcom's senior ranks rises above $100 million.\nCompany filings and market data indicate Tan has periodically reduced holdings this year through scheduled transactions and transfer plans that help manage concentrated positions.\nAnalysts say insider sales often reflect personal or tax planning rather than a view on fundamentals, but clustered disposals can attract investor attention.\nBroadcom remains a major supplier to data-center and AI customers, and the stock has rallied this year on strong demand for chips tied to artificial intelligence.\nThe SEC Form 4 provides routine transparency on executive trades and does not imply wrongdoing. Market participants say such disclosures are part of normal governance overall.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "11:33:37",
      "Source": "StockStory",
      "Title": "Processors and Graphics Chips Stocks Q3 Results: Benchmarking Broadcom (NASDAQ:AVGO)",
      "URL": "https://finance.yahoo.com/news/processors-graphics-chips-stocks-q3-033337927.html",
      "Content": "Processors and Graphics Chips Stocks Q3 Results: Benchmarking Broadcom (NASDAQ:AVGO)\n\nRadek Strnad\nTue, December 23, 2025 at 7:33 PM PST 5 min read\n\nIn this article: AVGO\n\nAs the craze of earnings season draws to a close, here’s a look back at some of the most exciting (and some less so) results from Q3. Today, we are looking at processors and graphics chips stocks, starting with Broadcom (NASDAQ:AVGO).\nThe biggest demand drivers for processors (CPUs) and graphics chips at the moment are secular trends related to 5G and Internet of Things, autonomous driving, and high performance computing in the data center space, specifically around AI and machine learning. Like all semiconductor companies, digital chip makers exhibit a degree of cyclicality, driven by supply and demand imbalances and exposure to PC and Smartphone product cycles.\n\nThe 9 processors and graphics chips stocks we track reported a strong Q3. As a group, revenues beat analysts’ consensus estimates by 2.5% while next quarter’s revenue guidance was 12,447% above.\nAmidst this news, share prices of the companies have had a rough stretch. On average, they are down 7.5% since the latest earnings results.\nBroadcom (NASDAQ:AVGO) Originally the semiconductor division of Hewlett Packard, Broadcom (NASDAQ:AVGO) is a semiconductor conglomerate spanning wireless communications, networking, and data storage as well as infrastructure software focused on mainframes and cybersecurity.\nBroadcom reported revenues of $18.02 billion, up 28.2% year on year. This print exceeded analysts’ expectations by 3%. Overall, it was a very strong quarter for the company with a significant improvement in its inventory levels and revenue guidance for next quarter beating analysts’ expectations.\n\"In Q4, record revenue of $18.0 billion grew 28% year-over-year, driven primarily by AI semiconductor revenue increasing 74% year-over-year,\" said Hock Tan, President and CEO of Broadcom Inc.\nThe stock is down 13.8% since reporting and currently trades at $350.35.\nRead why we think that Broadcom is one of the best processors and graphics chips stocks, our full report is free.\nBest Q3: Qorvo (NASDAQ:QRVO) Formed by the merger of TriQuint and RF Micro Devices, Qorvo (NASDAQ: QRVO) is a designer and manufacturer of RF chips used in almost all smartphones globally, along with a variety of chips used in networking equipment and infrastructure.\nQorvo reported revenues of $1.06 billion, up 1.1% year on year, outperforming analysts’ expectations by 1.9%. The business had an exceptional quarter with a significant improvement in its inventory levels and revenue guidance for next quarter exceeding analysts’ expectations.\nAlthough it had a fine quarter compared its peers, the market seems unhappy with the results as the stock is down 9% since reporting. It currently trades at $86.27.\n\nStory Continues\nIs now the time to buy Qorvo? Access our full analysis of the earnings results here, it’s free for active Edge members .\nWeakest Q3: Allegro MicroSystems (NASDAQ:ALGM) The result of a spinoff from Sanken in Japan, Allegro MicroSystems (NASDAQ:ALGM) is a designer of power management chips and distance sensors used in electric vehicles and data centers.\nAllegro MicroSystems reported revenues of $214.3 million, up 14.4% year on year, exceeding analysts’ expectations by 1.4%. Still, it was a mixed quarter as it posted EPS in line with analysts’ estimates.\n\nAs expected, the stock is down 10.6% since the results and currently trades at $27.47.\nRead our full analysis of Allegro MicroSystems’s results here.\nQualcomm (NASDAQ:QCOM) Having been at the forefront of developing the standards for cellular connectivity for over four decades, Qualcomm (NASDAQ:QCOM) is a leading innovator and a fabless manufacturer of wireless technology chips used in smartphones, autos and internet of things appliances.\nQualcomm reported revenues of $11.27 billion, up 10% year on year. This number topped analysts’ expectations by 4.8%. It was an exceptional quarter as it also put up a significant improvement in its inventory levels and revenue guidance for next quarter exceeding analysts’ expectations.\n\nThe stock is flat since reporting and currently trades at $174.75.\nRead our full, actionable report on Qualcomm here, it’s free for active Edge members.\nAMD (NASDAQ:AMD) Founded in 1969 by a group of former Fairchild semiconductor executives led by Jerry Sanders, Advanced Micro Devices (NASDAQ:AMD) is one of the leading designers of computer processors and graphics chips used in PCs and data centers.\nAMD reported revenues of $9.25 billion, up 35.6% year on year. This result beat analysts’ expectations by 5.6%. Overall, it was a strong quarter as it also logged an impressive beat of analysts’ revenue estimates and revenue guidance for next quarter beating analysts’ expectations.\n\nAMD achieved the biggest analyst estimates beat among its peers. The stock is down 13.9% since reporting and currently trades at $215.25.\nRead our full, actionable report on AMD here, it’s free for active Edge members.\nMarket Update As a result of the Fed’s rate hikes in 2022 and 2023, inflation has come down from frothy levels post-pandemic. The general rise in the price of goods and services is trending towards the Fed’s 2% goal as of late, which is good news. The higher rates that fought inflation also didn't slow economic activity enough to catalyze a recession. So far, soft landing. This, combined with recent rate cuts (half a percent in September 2024 and a quarter percent in November 2024) have led to strong stock market performance in 2024. The icing on the cake for 2024 returns was Donald Trump’s victory in the U.S. Presidential Election in early November, sending major indices to all-time highs in the week following the election. Still, debates around the health of the economy and the impact of potential tariffs and corporate tax cuts remain, leaving much uncertainty around 2025.\nWant to invest in winners with rock-solid fundamentals? Check out our Strong Momentum Stocks and add them to your watchlist. These companies are poised for growth regardless of the political or macroeconomic climate.\nStockStory’s analyst team — all seasoned professional investors — uses quantitative analysis and automation to deliver market-beating insights faster and with higher quality.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "09:29:00",
      "Source": "Barrons.com",
      "Title": "Review & Preview: Next Stop? S&P 7000.",
      "URL": "https://finance.yahoo.com/m/41558feb-3fd1-3bfb-97c9-9e755a105b13/review-%26-preview%3A-next-stop%3F.html",
      "Content": "Review & Preview: Next Stop? S&P 7000.\n\nConnor Smith\nTue, December 23, 2025 at 5:29 PM PST 3 min read\n\nIn this article: SCHW\n\nHOOD\n\n^GSPC\n\n^DJI\n\n^IXIC\n\nThin volume paved the way to another stock market milestone. The Nasdaq Composite rose 0.6%. Only 3.82 billion shares traded on the New York Stock Exchange, which made for the lowest volume day since Jan. 3, according to Dow Jones Market Data.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "05:48:53",
      "Source": "Investor's Business Daily",
      "Title": "Stock Market Today: Dow Higher As S&P 500 Scores Record; Nvidia Clears Key Level (Live Coverage)",
      "URL": "https://finance.yahoo.com/m/5a383c8e-3746-3d0b-a3a7-f2e765786c9c/stock-market-today%3A-dow.html",
      "Content": "Stock Market Today: Dow Higher As S&P 500 Scores Record; Nvidia Clears Key Level (Live Coverage)\n\nSCOTT LEHTONEN and VIDYA RAMAKRISHNAN\nTue, December 23, 2025 at 1:48 PM PST 7 min read\n\nIn this article: NVDA\n\n^GSPC\n\nNOW\n\n^DJI\n\n^IXIC\n\nStock Market Today: The Dow Jones index and the S&P 500 rise, aided by tech stock. Novo stock soared on FDA approval for a weight-loss pill.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "05:45:11",
      "Source": "MT Newswires",
      "Title": "S&P 500 Hits New High After Strong GDP Data",
      "URL": "https://finance.yahoo.com/news/p-500-hits-high-strong-214511110.html",
      "Content": "PREMIUM\nS&P 500 Hits New High After Strong GDP Data\n\nMT Newswires\nTue, December 23, 2025 at 1:45 PM PST 4 min read\n\nIn this article: ^GSPC\n\n^DJI\n\n^IXIC\n\nWall Street's main equity benchmarks rose Tuesday, with the S&P 500 hitting an all-time high as data\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "05:28:42",
      "Source": "Investor's Business Daily",
      "Title": "Citi Makes Left-Field Choice For Top Pick Among Chip Stocks",
      "URL": "https://finance.yahoo.com/m/526df099-d234-3f58-90af-85f708e57ffa/citi-makes-left-field-choice.html",
      "Content": "Citi Makes Left-Field Choice For Top Pick Among Chip Stocks\n\nPATRICK SEITZ\nTue, December 23, 2025 at 1:28 PM PST 1 min read\n\nIn this article: C\n\nMCHP\n\nMCHPP\n\nNVDA\n\nAVGO\n\nInvestment bank Citi named Microchip as its top pick among chip stocks as it forecasts a resurgence for analog semiconductors in 2026.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "04:59:29",
      "Source": "Investor's Business Daily",
      "Title": "Stock Market Today: S&P 500 Eyes Record High; Analyst Names Reddit 2026 Top Pick (Live Coverage)",
      "URL": "https://finance.yahoo.com/m/5a383c8e-3746-3d0b-a3a7-f2e765786c9c/stock-market-today%3A-s%26p-500.html",
      "Content": "Stock Market Today: S&P 500 Eyes Record High; Analyst Names Reddit 2026 Top Pick (Live Coverage)\n\nSCOTT LEHTONEN and VIDYA RAMAKRISHNAN\nTue, December 23, 2025 at 12:59 PM PST 7 min read\n\nIn this article: ^GSPC\n\nNVO\n\nTSLA\n\nGOOG\n\n^IXIC\n\nStock Market Today: The Dow Jones index rises Tuesday on surprise Q3 GDP data. Novo stock soared on FDA approval for a weight loss pill.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "04:00:00",
      "Source": "Zacks",
      "Title": "Quantum Enablers Poised for 40% Plus Growth in 2026: INTC, AVGO & TER",
      "URL": "https://finance.yahoo.com/news/quantum-enablers-poised-40-plus-200000520.html",
      "Content": "Quantum Enablers Poised for 40% Plus Growth in 2026: INTC, AVGO & TER\n\nUrmimala Biswas\nTue, December 23, 2025 at 12:00 PM PST 4 min read\n\nIn this article: QBTS\n\nLMT\n\nINTC\n\nAVGO\n\nIONQ\n\nThe pure quantum hardware sector, featuring companies like IonQ and D-Wave, has garnered significant attention. These firms have made tangible progress, securing government contracts, enterprise pilots and cloud integrations. Analysts characterize these pure plays as long-term prospects with growth potential but not guaranteed near-term earnings drivers for 2026.\n\nHowever, this does not mean that quantum offers no near-term investment opportunity. Instead, the more compelling path lies in quantum enablers - companies already generating revenues today by supplying the infrastructure, semiconductors, testing tools, cloud platforms and security frameworks required for quantum adoption at scale.\nSo, if the goal is to participate in quantum’s growth story with measurable financial outcomes in 2026, it makes sense to look beyond the flagship hardware makers and toward the ecosystem enabling quantum adoption today.\nHere in this article, we have discussed three such quantum computing enablers, Intel INTC, Broadcom AVGO and Teradyne TER, which are projected to report more than 40% earnings growth in 2026.\nThe Enabler Advantage: Real Revenues, Not Future Promises At present, several established semiconductor and enterprise technology companies are positioned to benefit from quantum development while being simultaneously projected to report solid earnings growth in 2026.\nAdvanced Micro Devices AMD, for example, is collaborating with IBM on hybrid high-performance computing and quantum workloads, leveraging its CPUs and accelerators within quantum-adjacent systems. The Zacks Consensus Estimate for AMD suggests roughly 58% earnings growth in 2026, driven primarily by data center demand rather than speculative quantum revenues.\n\nPost-Quantum Cryptography: Demand is Already Here Perhaps the most immediate quantum-linked opportunity lies in post-quantum cryptography. Governments and enterprises are racing to secure data against future quantum decryption risks, often referred to as “Q-Day.” Industry research and regulatory guidance increasingly emphasize early migration to quantum-resilient encryption standards.\n\nSEALSQ Corp. illustrates this trend. The company has commercialized secure chips with embedded post-quantum cryptography and expanded partnerships in defense and critical infrastructure, demonstrating real-world adoption rather than experimental pilots. The stock is projected to report 66.7% earnings growth in 2026.\nIn 2025, Lockheed Martin LMT advanced its role as a quantum enabler by moving quantum technologies closer to real defense applications, including a U.S. Department of Defense Innovation Unit contract to prototype a quantum-enabled inertial navigation system (QuINS) that can operate without GPS, in partnership with Q-CTRL and AOSense. The stock is projected to report 34.8% earnings growth in 2026.\n\nStory Continues\n2025 Stock Comparison of Quantum Enablers\nImage Source: Zacks Investment Research\n3 Quantum Computing Enablers With Strong Growth Potential Intel : Its positioning as a quantum enabler rests on continued progress in scaling qubit counts and improving device performance using its legacy CMOS manufacturing infrastructure. By applying its 300 mm fabrication techniques to silicon spin qubits, Intel expects to incrementally increase qubit connectivity and fidelity, essential steps toward larger, more uniform qubit arrays while refining control and interconnect technologies. Continued collaboration with research institutions in 2026 should further accelerate collective understanding of qubit behavior and materials interface challenges, helping Intel contribute to the broader quantum ecosystem even as commercial fault-tolerant systems remain on a multi-year horizon.\n\nIntel, a Zacks Rank #3 (Hold) stock, is expected to report earnings growth of 83.4% in 2026 on revenue growth of 3.3%. The stock has skyrocketed 81.4% in 2025.\nBroadcom : In 2025, Broadcom strengthened its position as a quantum enabler by embedding post-quantum cryptography (PQC) into enterprise networking and storage products, turning future quantum security risks into near-term demand. The company rolled out quantum-safe Fibre Channel and SAN solutions, including Emulex secure host bus adapters and Brocade Gen 8 Fibre Channel platforms, which integrate PQC and 256-bit encryption to protect data in motion across mission-critical infrastructure.\nIn 2026, Broadcom is positioned to benefit from rising demand for quantum-resilient infrastructure, driven by regulatory mandates such as CNSA 2.0, NIS2 and DORA and growing AI-led data center workloads, enabling quantum-linked growth without dependence on commercial quantum computers.\n\nBroadcom, a Zacks Rank #3 stock, is expected to report earnings growth of 42.5% in fiscal 2026 (ending October 2026) on revenue growth of 44.8%. The stock has gained 47.3% in 2025.\nTeradyne : In 2025, Teradyne strengthened its role as a quantum enabler by expanding its photonics and semiconductor test capabilities, highlighted by its acquisition of Quantifi Photonics, a specialist in photonic integrated circuit (PIC) testing.\nThe deal enhances Teradyne’s ability to deliver scalable PIC test solutions essential for optical interconnects used in high-performance and hybrid computing systems. Teradyne also introduced a high-volume, double-sided wafer probe test cell for silicon photonics with ficonTEC, supporting advanced electro-optical testing. These investments position Teradyne to benefit from rising demand for photonics, AI infrastructure, and high-performance computing test solutions, which underpin future quantum-adjacent ecosystems.\n\nTeradyne, a Zacks Rank #2 (Buy) stock, is expected to report earnings growth of nearly 45% in 2026 on revenue growth of 22%. The stock has gained 56.7% in 2025. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\nIntel Corporation (INTC) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nTeradyne, Inc. (TER) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "03:51:00",
      "Source": "Motley Fool",
      "Title": "Applied Digital Is Building the Compute Power That AI Needs. Could the Stock Surge Next?",
      "URL": "https://finance.yahoo.com/m/ad572a6b-ca6b-3565-991d-51d80f30730a/applied-digital-is-building.html",
      "Content": "Applied Digital Is Building the Compute Power That AI Needs. Could the Stock Surge Next?\n\nMarc Guberti, The Motley Fool\nTue, December 23, 2025 at 11:51 AM PST 5 min read\n\nIn this article: APLD\n\nNVDA\n\nOPAI.PVT\n\nAVGO\n\nKey Points Applied Digital is in the right place at the right time as AI spending ramps up.\nIts ability to achieve projects on time and on budget may help it win over the trust of big tech companies.\nA single deal could add billions of dollars to Applied Digital's balance sheet, and the company is in a position to sign several big deals.\n10 stocks we like better than Applied Digital ›\n\nArtificial intelligence is revolutionizing the world. AI models like OpenAI's ChatGPT quickly became mainstream, with autonomous vehicles and humanoid robots on the way. All of these innovations require AI chips, which is why investors have been loading up on semiconductor stocks like Nvidia and Broadcom .\nThese AI chips work, but there's one big problem. They all require significant power to operate. AI models and innovations require gigawatts to operate, and traditional data centers aren't cutting it. Those buildings aren't optimized for AI workloads, and that's where AI data center providers like Applied Digital (NASDAQ: APLD) come in.\nApplied Digital has roughly 4 gigawatts worth of data center capacity at the moment, and that could translate into billions of dollars in annual recurring revenue once it's all set up and deals have been established. Applied Digital has already entered three lease agreements with CoreWeave (NASDAQ: CRWV) , with the total revenue coming to approximately $11 billion over 15 years.\nThe leases cover 400 megawatts, and Applied Digital's 4 gigawatt pipeline suggests the company could support nine additional deals like the CoreWeave contract. Here's why Applied Digital could expand beyond CoreWeave and continue to win over tech giants.\nThe AI race is intense The key players in the AI race have all committed to spending more money on this technology. Alphabet , Microsoft , Amazon , and Meta Platforms are some of the top players in the industry. These companies generate billions of dollars in quarterly profits and view AI as the next internet boom.\nAI models, autonomous vehicles , and humanoid robots have the potential to change how people shop and interact with the world. Companies know the potential of AI and have already thrown a lot of money at Nvidia. Now, they are increasingly looking at the energy bottleneck that companies like Applied Digital solve.\n\nRight now, Applied Digital makes almost all of its AI revenue from CoreWeave. Other AI data center providers like Iren (NASDAQ: IREN) and Cipher Mining (NASDAQ: CIFR) have made deals with Microsoft, Amazon, Alphabet, and other tech companies. It's fair to assume Applied Digital will land deals like that in the future, especially since it has proven to be a trustworthy option for CoreWeave.\n\nStory Continues\nApplied Digital is a leading data center builder Timelines are critical for maintaining a lead in the AI race, and Applied Digital is doing its part. The AI data center provider told investors that its 100 MW building at Polaris Forge 1 is nearing completion while remaining on time and on budget.\nFulfilling project benchmarks will help Applied Digital build more trust with tech giants. Applied Digital Chairman and CEO Wes Cummins also views it that way.\n\n\"We feel this third lease validates our platform and execution, positioning Applied Digital as a trusted strategic partner to the world's largest technology companies,\" Cummins said in the Q3 press release. \"With hyperscalers expected to invest approximately $350 billion into AI deployment this year, we believe we are in a prime position to serve as the modern-day picks and shovels of the intelligence era.\"\nApplied Digital's 4-gigawatt pipeline also puts it ahead of most AI data center stocks. Iren has approximately 3 gigawatts in its pipeline, while Cipher Mining has 3.2 gigawatts in its pipeline. Applied Digital has the lead, which will come in handy once data centers are built and tech companies scramble to sign big deals.\n\nNew deals can happen quickly and suddenly change the long-term view Applied Digital has a 15-year contract with CoreWeave for $11 billion that covers 400 megawatts. It's a big contract, but it's not the only one in the industry. Iren signed a five-year, $9.7 billion deal with Microsoft for 200 megawatts. Cipher Mining also signed a 15-year deal with Amazon Web Services for $5.5 billion, and that contract covers 300 megawatts.\n\nA single deal adds billions of dollars to an AI data center provider's revenue. These are long-term agreements that result in steady recurring revenue. When Applied Digital has all 4 gigawatts ready to go, it can support enough deals to make billions of dollars each year. The company may have only made $64 million in Q1 FY26, but revenue growth should compound quickly based on the CoreWeave leases and future deals. That development sets the stage for Applied Digital stock to continue its rally.\nShould you buy stock in Applied Digital right now? Before you buy stock in Applied Digital, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Applied Digital wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $502,783 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,126,057 !*\nNow, it’s worth noting Stock Advisor’s total average return is 975 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nMarc Guberti has positions in Broadcom, Cipher Mining, and Iren. The Motley Fool has positions in and recommends Alphabet, Amazon, Meta Platforms, Microsoft, and Nvidia. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nApplied Digital Is Building the Compute Power That AI Needs. Could the Stock Surge Next? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "03:38:00",
      "Source": "Motley Fool",
      "Title": "3 Brilliant Growth Stocks to Buy Now and Hold for the Long Term",
      "URL": "https://finance.yahoo.com/m/00661aea-05f1-3bd8-bee9-a4d7d47b2ef4/3-brilliant-growth-stocks-to.html",
      "Content": "3 Brilliant Growth Stocks to Buy Now and Hold for the Long Term\n\nJames Brumley, The Motley Fool\nTue, December 23, 2025 at 11:38 AM PST 7 min read\n\nIn this article: CRSP\n\nAVGO\n\nKey Points CRISPR Therapeutics has figured out a way to successfully repair genetic code. Monetizing this know-how is the next step.\nArtificial intelligence (AI) data center interconnectivity powerhouse Broadcom hasn’t had much competition … until now.\nChina’s AI industry is mostly developing in its own silo. One company is positioned to dominate it.\n10 stocks we like better than CRISPR Therapeutics ›\n\nAll investors would love to get rich overnight. As anyone who's been in the market for a while can attest, however, that's just not how things work. Growing wealth takes time. And, the more time you're willing and able to give your picks, the better your returns tend to be.\nWith that as the backdrop, here's a closer look at three stocks that are not only solid long-term prospects. Granted, they will require lengthy holding periods to reach their full potential and pay off in full. This, of course, means taking the risk of stepping into a name with a future that's still a bit fuzzy and far from guaranteed. If things pan out the way they appear to, though, this risk will be well worth it.\n1. CRISPR Therapeutics The premise of repairing damaged or faulty DNA has long been on the healthcare industry's mind. It didn't become a commercial reality, however, until late 2023, when CRISPR Therapeutics ' (NASDAQ: CRSP) Casgevy became the first-ever FDA-approved gene therapy. Although it's only approved to treat sickle cell disease, it's a tacit but important validation of the underlying science.\n\nThat science is the use of the clustered regularly interspaced short palindromic repeats -- or CRISPR -- found in human DNA to cut out damaged genetic code and then replace it with the correct one. Or, more specifically, removing a segment of faulty DNA forces the body to use its own self-repair process to create a permanent, healthy fix.\nThe idea has near-term promise as the basis for treating diabetes and autoimmune diseases, as well as for cardiovascular diseases -- all of which CRISPR Therapeutics is working on in clinical trials now underway. Further down the road, though, this approach could conceivably be refined to treat cancer, Alzheimer's, muscular dystrophy, and more. That's why Precedence Research believes the global CRISPR therapy market is poised to grow at an average annualized pace of nearly 17% through 2034.\n\nGiven that one of the company's co-founders (Emmanuelle Charpentier, Ph.D.) won a Nobel Prize in 2020 for her discovery and creation of this CRISPR-based approach to gene editing, it's not a stretch to suggest CRISPR Therapeutics itself is very well positioned to capture at least its fair share of the medical science's future growth.\n\nStory Continues\nJust understand that medical science moves incredibly slowly, requiring a long-term mindset from investors.\nThis might put things in perspective, as well as help you stick with it in the meantime: Although Casgevy was approved as a treatment for sickle cell a little over two years ago, its revenue isn't expected to truly explode until next year, ramping up from this year's projection of just a few million dollars to a little over $100 million next year to nearly $300 million after that. By then, progress on fronts other than sickle cell disease should start driving the stock on a more consistent basis.\n\n2. Astera Labs To date, Broadcom has been one of the big names other than Nvidia to soar thanks to the advent of artificial intelligence (AI). Nvidia makes the computing processors used in most AI data centers. Broadcom then provides the technology that connects them to turn them into a true neural network.\nAs is so often the case, though, smaller and newer competitors watched what Broadcom did to become the dominant name in this sliver of the AI business, and then figured out a way to do it better.\n\nAstera Labs (NASDAQ: ALAB) is one of those smaller and newer competitors. It makes a range of interconnectivity solutions purpose-built for artificial intelligence data centers. For instance, its Aries line of PCIe Smart Gearboxes allows data center owners/operators to connect next-generation processors with previous-generation motherboards, extending the useful life of the latter while allowing the utilization of the former.\nAt the same time, Astera's Leo CXL Smart Memory Controllers are \"the industry's first purpose-built solution that supports both memory expansion and memory pooling,\" according to the company's website, offering access to memory in a way that gets the most out of an artificial intelligence platform, and inference platforms in particular.\n\nPriced at nearly 90 times this year's projected profits of $1.78 per share, Astera Labs stock isn't cheap. That's the chief reason the stock's peeled back so much from its September peak, outpacing the overall market's weakness for this time frame.\nJust take a step back and see the bigger picture. After more than doubling this year, analysts are calling for revenue growth of more than 40% next year, driving per-share profits up from $1.78 to $2.37 as a result. This is likely just a glimpse of the kind of demand we're going to see for specialized AI interconnectivity solutions for a long, long while.\n3. Alibaba Finally, add Alibaba Group (NYSE: BABA) to your list of brilliant growth stocks to buy and hold for the long haul.\nIt's an addition that might surprise some investors who have kept loose tabs on the company. Although no one denies it dominates China's e-commerce market, it's a market that's as saturated as it is mature. It's also running into an economic headwind.\n\nFor perspective, the country's retail sales only grew 1.3% in November, slowing from October's pace of 2.9%, as well as falling short of estimates for growth of 2.8%. Concern isn't entirely unmerited.\nExcept that e-commerce isn't going to be Alibaba's big growth engine for the foreseeable future. It's going to be artificial intelligence. In August, the company unveiled an AI processor chip that's surprisingly competitive with Nvidia's powerful H2O processors designed for overseas customers. Less than a month later, it had already lined up its first customer: telecom giant China Unicom. More are sure to be in the works, too.\nIt's not just powerful AI processors, though. Unlike many of the Western Hemisphere's hardware makers and software companies, Alibaba jointly brings both to the table, with a deep lineup of open-source software offerings that work well with its conventional cloud computing service and its home-grown artificial intelligence model called Qwen. Indeed, just last month, the company introduced its consumer-oriented chat-based AI assistant Qwen App. It's yet another way Alibaba is widening its digital ecosystem's net, even if it doesn't yet know exactly how it's going to monetize every aspect of this deep reach.\n\nIt matters simply because China's artificial intelligence industry is apt to grow there, like other AI platforms are growing elsewhere. Morgan Stanley expects the country's AI industry will be worth $140 billion by 2030, while Goldman Sachs believes more than 30% of China's corporations will be utilizing some sort of artificial intelligence tech by the end of the same time frame. Alibaba is readier than any other to help make that happen.\nShould you buy stock in CRISPR Therapeutics right now? Before you buy stock in CRISPR Therapeutics, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and CRISPR Therapeutics wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $502,783 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,126,057 !*\nNow, it’s worth noting Stock Advisor’s total average return is 975 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nJames Brumley has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends CRISPR Therapeutics, Goldman Sachs Group, and Nvidia. The Motley Fool recommends Alibaba Group, Astera Labs, and Broadcom. The Motley Fool has a disclosure policy .\n3 Brilliant Growth Stocks to Buy Now and Hold for the Long Term was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "03:12:08",
      "Source": "MT Newswires",
      "Title": "Equities Rise Intraday; Gold, Silver Continues Record Run",
      "URL": "https://finance.yahoo.com/news/equities-rise-intraday-gold-silver-191208511.html",
      "Content": "PREMIUM\nEquities Rise Intraday; Gold, Silver Continues Record Run\n\nMT Newswires\nTue, December 23, 2025 at 11:12 AM PST 3 min read\n\nIn this article: GC=F\n\nSI=F\n\n^GSPC\n\n^DJI\n\n^IXIC\n\nUS benchmark equity indexes were higher intraday as traders assessed the latest economic data, while\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "02:30:02",
      "Source": "Barchart",
      "Title": "Broadcom (AVGO) Stock Options Are Signaling Pensiveness. Here’s Why the Fear Might Be Unwarranted.",
      "URL": "https://finance.yahoo.com/m/1e5c58a7-1a75-3dd7-adfd-7a23ef892dbd/broadcom-%28avgo%29-stock-options.html",
      "Content": "Broadcom (AVGO) Stock Options Are Signaling Pensiveness. Here’s Why the Fear Might Be Unwarranted.\n\nJosh Enomoto\nTue, December 23, 2025 at 10:30 AM PST 5 min read\n\nIn this article: AVGO\n\nWith fears of a bubble brewing in artificial intelligence consistently wreaking havoc on tech players in the fourth (calendar) quarter, semiconductor and software giant Broadcom (AVGO) has been put through the ringer. True, on a year-to-date basis, AVGO stock is doing well, gaining over 47%. However, in the trailing month, the security is down almost 10%.\n\nWhat has regular, everyday investors freaked out is that even the smart money appears pensive. Take a look at Barchart’s options flow screener, which focuses exclusively on big block transactions likely placed by major institutions. On Dec. 8, a few days before its fiscal-fourth-quarter earnings disclosure, net trade sentiment stood at over $151.16 million. However, just 10 days later, net trade sentiment slipped to $148.84 million below parity.\nMore News from Barchart This Michael Burry Stock Spiked on a $1B Activist Stake. How Our Top Analyst Found the Trade Early.\nValero (VLO) Stock Just Triggered a Rare Quant Signal the Options Market Is Missing\nPalo Alto Networks Stock Is Down But Not Out - Worth Buying PANW Here?\nGet exclusive insights with the FREE Barchart Brief newsletter. Subscribe now for quick, incisive midday market analysis you won't find anywhere else.\n\nEven though Broadcom beat on both the top and bottom lines, disappointments over a less-than-expected AI backlog, combined with concerns about operating margins, weighed heavily on AVGO stock. Basically, the central anxiety is that, with the low-hanging AI fruit being plucked, Broadcom and its ilk need to prove viability.\nBecause of this great overhang, it’s not terribly surprising that AVGO’s unusual options activity screener also shows structural pensiveness. While it’s important not to read too deeply into any one metric, here’s what we can largely infer. Due to very long-dated out-the-money (OTM) calls being paired with long-dated, deep in-the-money (ITM) puts, the smart money is effectively hedged for kinetic uncertainty.\nIf the transactions symbolized directional bets, you would expect the bulk of the transactions to feature more realistic call and put strike prices. Instead, what’s happening here is that most of these strikes are positioned to respond only at the tails of the underlying outcome distribution.\n\nWhile I’m not going to sit here and pretend that I know what the smart money is thinking about, the unusual options activity points to net protection against unusual behaviors. Otherwise, the structure of activity points to a lack of confidence in where AVGO stock may go.\nUsing Risk Geometry to Narrow Down the Possibilities for AVGO Stock Another clue regarding the hedging activity that’s occurring right now is the relatively heightened implied volatility (IV). If we look at Barchart’s Expected Move calculator, you’ll notice that for the options chain expiring Feb. 20, 2026, the expected range of outcomes goes from $302.85 to $380.05, thus representing an 11.3% move in either direction relative to Monday’s close.\n\nStory Continues\nThat’s a very wide dispersion, which stems in large part from IV, which is a residual value based on actual order flows. Therefore, we have a situation where AVGO stock could shoot quite high over the next two months or it could sharply correct.\nFor traders, you have two basic paths: you can either play the volatility game or you can take a directional wager. Personally, I prefer the latter because betting on volatility is a tricky business when IV is already heightened due to substantial hedging activities.\n\nTo make an informed decision, we must calculate the risk geometry of AVGO stock. This can be accomplished through a hierarchical distribution. If we took a single 10-week strand of AVGO’s price data, the return during this period won’t tell us much about the probability of performance for the other weeks in the dataset.\nBut what if we took hundreds of rolling 10-week trials and stacked them in a fixed-time distribution? Under this framework, the most consistent behaviors would create a bulge in probability mass. This bulge represents risk geometry, which tells us how buyers become more aggressive in their speculative fervor.\nMore importantly, risk geometry also shows us where buyers are tempted to become sellers. In this manner, we can identify both upside profit opportunities and help curtail opportunity costs.\nUsing this hierarchical approach, we note that the typical 10-week distribution would land AVGO stock somewhere between $330 and $380, assuming an anchor price of $341.48, Monday’s close. However, the current quantitative signal is the 4-6-D sequence; that is, in the trailing 10 weeks, AVGO printed only four up weeks, leading to an overall downward slope.\n\nUnder this setup, the forward 10-week returns would typically range between $322 and $404. Further, probability mass would be thickest between $350 and $380.\nTwo Enticing Wagers Available to Consider Given the market intelligence above, perhaps the most obvious trade is the 350/360 bull call spread expiring Feb. 20, 2026. With the strike price sitting right on the center of probability mass, there would seem to be a solid chance for this trade to be fully profitable.\nPlus, if AVGO stock rises through the second-leg strike ($360) at expiration, the maximum payout would be roughly 133%. That’s an awfully nice reward. However, one thing to keep in mind is probability decay (or lack thereof).\nBetween $350 and $380, probability density only drops by 7.48%. Based on the statistical evidence, there’s a good chance that if AVGO stock is going to hit $360, it can reasonably hit $380. Therefore, capping the reward at $360 may risk absorbing a hefty opportunity cost.\n\nNow, the thing is, from $380 to $390, probability density drops by 64.14%. In other words, if we cap our reward at the $380 strike, the chance of us absorbing an opportunity cost is exponentially less than at $360, assuming that the same sentiment regime assumption holds.\nIf it does hold, you could be leaving money on the table with the 350/360 spread. Instead, the boldest idea is the 370/380 bull spread, also expiring Feb. 20.\nRisky? Extremely. But you’re also looking at a payout of nearly 228%.\nOn the date of publication, Josh Enomoto did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "00:35:06",
      "Source": "Investor's Business Daily",
      "Title": "Citi Makes Left Field Choice For Top Pick Among Chip Stocks",
      "URL": "https://finance.yahoo.com/m/526df099-d234-3f58-90af-85f708e57ffa/citi-makes-left-field-choice.html",
      "Content": "Citi Makes Left Field Choice For Top Pick Among Chip Stocks\n\nPATRICK SEITZ\nTue, December 23, 2025 at 8:35 AM PST 1 min read\n\nIn this article: C\n\nMCHPP\n\nMCHP\n\nNVDA\n\nAVGO\n\nInvestment bank Citi named Microchip as its top pick among chip stocks as it forecasts a resurgence for analog semiconductors in 2026.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "23:13:14",
      "Source": "GuruFocus.com",
      "Title": "Broadcom Insider Selling Tops $100 Million as CEO Trims Stake Again",
      "URL": "https://finance.yahoo.com/news/broadcom-insider-selling-tops-100-151314392.html",
      "Content": "Broadcom Insider Selling Tops $100 Million as CEO Trims Stake Again\n\nNauman Khan\nTue, December 23, 2025 at 7:13 AM PST 1 min read\n\nIn this article: AVGO\n\nThis article first appeared on GuruFocus .\nBroadcom ( NASDAQ:AVGO ) Chief Executive Officer and President Hock Tan sold 130,000 shares , generating about $42.38 million in proceeds, according to a SEC filing.\nThe sale, executed on Dec. 18 and reported in a Form 4 filed Dec. 22, trimmed Tan's direct stake to roughly 595,638 shares, regulatory records show.\n\nWarning! GuruFocus has detected 3 Warning Sign with AVGO.\nIs AVGO fairly valued? Test your thesis with our free DCF calculator.\nThat single trade is the latest in a string of disposals by Tan and other executives this year. When combined with earlier sales, the cumulative total of insider disposals tied to Broadcom's senior ranks rises above $100 million.\nCompany filings and market data indicate Tan has periodically reduced holdings this year through scheduled transactions and transfer plans that help manage concentrated positions.\nAnalysts say insider sales often reflect personal or tax planning rather than a view on fundamentals, but clustered disposals can attract investor attention.\nBroadcom remains a major supplier to data-center and AI customers, and the stock has rallied this year on strong demand for chips tied to artificial intelligence.\nThe SEC Form 4 provides routine transparency on executive trades and does not imply wrongdoing. Market participants say such disclosures are part of normal governance overall.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "23:05:18",
      "Source": "GuruFocus.com",
      "Title": "Nvidia and Broadcom Executives Cash Out Millions in Stock Sales",
      "URL": "https://finance.yahoo.com/news/nvidia-broadcom-executives-cash-millions-150518739.html",
      "Content": "Nvidia and Broadcom Executives Cash Out Millions in Stock Sales\n\nFaizan Farooque\nTue, December 23, 2025 at 7:05 AM PST 1 min read\n\nIn this article: AVGO\n\nNVDA\n\nThis article first appeared on GuruFocus .\nNvidia ( NVDA , Financials ) and Broadcom ( AVGO , Financials ) executives have sold off a lot of their shares . This makes people wonder how insiders feel about semiconductor stocks, which are at all-time highs.\nWarning! GuruFocus has detected 4 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\n\nAccording to recent disclosures, Nvidia Director Mark Stevens sold 222,500 shares for over $40 million on December 19. This was the eighth time he had done business this year. On December 18, Hock Tan, the CEO of Broadcom, sold 130,000 shares for almost $42 million, which lowered his stake by more than 18%.Insiders at Nvidia have sold roughly $219 million worth of company stock in the previous three months, while executives at Broadcom have sold about $100 million worth. Right present, insiders don't seem very confident in either stock.Even if the transactions went through, analysts still believe both companies are attractive investments. They claim this is because there is still a lot of need for chips for AI and data centers. Shares of Nvidia and Broadcom have gone up by 4.3% and 1.9% in the last week, respectively.As 2026 approaches closer, investors will keep a watch on whether more insiders selling implies the sector is beginning to slow down.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "22:52:43",
      "Source": "24/7 Wall St.",
      "Title": "Where Will Broadcom (AVGO) Stock Be in 5 Years?",
      "URL": "https://finance.yahoo.com/m/da6af06c-b2d9-3738-853e-51aa5e9dc29c/where-will-broadcom-%28avgo%29.html",
      "Content": "Where Will Broadcom (AVGO) Stock Be in 5 Years?\n\nDavid Moadel\nTue, December 23, 2025 at 6:52 AM PST 5 min read\n\nIn this article: AVGO\n\nQuick Read Broadcom (AVGO) has a P/E ratio exceeding 70x and pays a small dividend.\nOn the other hand, Broadcom’s expected $73 billion AI product backlog should jump-start AVGO stock to new heights.\nIf you’re thinking about retiring or know someone who is, there are three quick questions causing many Americans to realize they can retire earlier than expected. take 5 minutes to learn more here\n\nSometimes in discussions about artificial intelligence (AI) hardware providers, Broadcom ( NASDAQ:AVGO ) gets left out of the conversation. Yet, it's a mistake for technology investors to overlook Broadcom and AVGO stock.\nAlong with the potential for a Broadcom stock split, there may be a value proposition for investors here. In five years, unless there's a catastrophic event, Broadcom shares could trade much higher than they do today.\nIf that happens, you'll wish you had gotten in before the rocket ride started. When all is said and done, value investors should open their minds and consider AVGO stock a bargain even if it's not immediately obvious.\nNot an Obviously Attractive Stock At first glance, some investors might not be immediately find Broadcom stock attractive. For one thing, the share price recently pulled back from nearly $415 to $340, representing a scary 18% drawdown.\nThat's not necessarily a bad thing, though, if you're a value investor looking to hold AVGO stock for five years. Maybe the 18% share-price correction was needed in order to bring Broadcom down to a low valuation.\n\nThis theory is difficult to support with old-school metrics, however. For example, Broadcom has a trailing 12-month price-to-earnings (P/E) ratio of 71x to 72x , which doesn't look like a bargain.\nFurthermore, Broadcom's forward annual dividend yield of 0.76% probably won't impress many income investors. Sometimes a share-price pullback will set the stage for a high dividend yield, but this apparently hasn't happened with AVGO stock.\nBroadcom's Knockout Quarter In order to justify a five-year buy-and-hold with Broadcom stock, the company really needs to demonstrate its growth potential. From a financial standpoint at least, Broadcom definitely checked the right boxes with its fourth-quarter fiscal year 2025 results.\nBroadcom CEO Hock Tan had every right to brag when he announced the company's record quarterly revenue of $18 billion, up 28% year over year. Tan further clarified that Broadcom's revenue growth was \"driven primarily by AI semiconductor revenue increasing 74%\" year over year.\n\nStory Continues\nIt's difficult to extrapolate five years out, but clearly Broadcom's growth trajectory is on a powerful uptrend. If you can believe it, Broadcom's Q4 FY2025 GAAP-measured net income nearly doubled year over year, increasing 97% to $8.518 billion.\nAlso on a year-over-year basis, Broadcom's free cash flow (FCF) grew 36% to $7.466 billion while the company's adjusted EBITDA expanded 34% to $12.218 billion. Given these figures, it's surprising that Broadcom isn't a darling of the financial market.\n\nSo maybe value investors ought to be willing to overlook Broadcom's seemingly high P/E ratio. Given AVGO stock's five-year trajectory and the company's growth pathway, a $500 share price in a couple of years and $800 in five years is entirely possible.\nGreat Expectations Besides, even if the company doesn't get all of the attention on Wall Street, Broadcom is a power player among AI hardware producers. To cite one example, Broadcom recently introduced the Brocade X8 Directors and Brocade G820 storage network products.\nThe company describes these products as the \"industry’s first 128G Fibre Channel platforms designed for today’s mission-critical workloads and enterprise AI applications.\" Only time will tell, but these could prove to be major revenue generators as Broadcom expands its array of enterprise AI hardware offerings.\n\nLooking ahead, Broadcom anticipates $73 billion worth of AI product backlog over the next year and a half. Deliveries of these products, moreover, should drive 150% year-on-year AI revenue growth for Broadcom in fiscal year 2026.\nGranted, these are only expectations and not all predictions work out as planned. Ultimately, Broadcom will only succeed and thrive over the next five years if enterprise AI product demand remains robust.\nCould AVGO Stock Hit $800 in Five Years? The point is that if you see an AI bubble and expect it to burst, then you probably shouldn't buy and hold Broadcom stock. As the old saying goes, scared money doesn't make money.\nHowever, without an AI hardware market collapse, the runway is clear for AVGO stock to hit $800 in five years. Broadcom knocked it out of the part in Q4 FY2025, and the company's AI product backlog prediction should boost investors' confidence.\n\nTherefore, it's fine to keep track of Broadcom's seemingly high P/E ratio and small dividend, but there's no need to obsess over these figures. Instead, consider owning AVGO stock after the recent 18% dip and holding your Broadcom shares for five years or longer.\nThe New Report Shaking Up Retirement Plans You may think retirement is about picking the best stocks or ETFs, but you’d be wrong. Even great investments can be a liability in retirement. It’s a simple difference between accumulating vs distributing, and it makes all the difference.\nThe good news? After answering three quick questions many Americans are reworking their portfolios and finding they can retire earlier than expected. If you’re thinking about retiring or know someone who is, take 5 minutes to learn more here .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "21:55:00",
      "Source": "Zacks",
      "Title": "CLS Rides on Steady Revenue Growth: Will the Uptrend Persist?",
      "URL": "https://finance.yahoo.com/news/cls-rides-steady-revenue-growth-135500007.html",
      "Content": "CLS Rides on Steady Revenue Growth: Will the Uptrend Persist?\n\nAritra Chatterjee\nTue, December 23, 2025 at 5:55 AM PST 3 min read\n\nIn this article: CLS\n\nJBL\n\nAMD\n\nAVGO\n\nCelestica, Inc. CLS reported quarterly revenues of $3.19 billion, up 27.8% year over year. The figure exceeded management’s guidance of $2.875 billion to $3.125 billion and beat the Zacks Consensus Estimate by $170 million. The growth was driven by multiple factors.\n\nThe company boasts a robust portfolio of enterprise-level data communications and information processing infrastructure products, such as routers, switches, data center interconnects, edge solutions and servers. Such a comprehensive product suite, combined with a strong focus on innovation, is allowing Celestica to tap into the expanding AI infrastructure market. The company is actively collaborating with other industry leaders such as AMD and Broadcom to further augment its portfolio offerings.\n\nDuring the third quarter, net sales from the company’s Connectivity and Cable Solution portfolio surged 43.2% year over year to $2.41 billion. The growth was primarily driven by healthy demand for 800G and 400G switching products in the data center networking vertical.\n\nPer a report from Grand View Research, the global data center networking market is valued at $38.49 billion in 2024. The market is projected to witness a 17.2% compound annual growth rate from 2025 to 2033. This presents a solid growth opportunity for Celestica. Management is bullish about its revenue growth outlook. The company expects to generate revenue between $3.325-$3.575 billion, indicating 36% year over year growth backed by continuous momentum in the data center market.\n\nHow Are Competitors Faring? Celestica faces competition from Jabil, Inc. JBL and Flex Ltd . FLEX in the Electronics Manufacturing Services industry. In the fiscal fourth quarter, Jabil reported revenues of $8.3 billion, up from $6.96 billion a year ago, beating the Zacks Consensus Estimate by $227 million. The uptick was driven by healthy demand in the Capital Equipment and AI-related Cloud and Data Center Infrastructure verticals. Jabil is steadily expanding its portfolio offering to gain a competitive edge in the AI data center vertical.\n\nIn the September quarter, Flex generated $6.8 billion in revenues, up 4% year over year, beating the Zacks Consensus Estimate by $142 million. The uptick was driven by strong data center growth in both the cloud and power end markets. Flex’s diversified portfolio, spanning multiple industries — from cloud infrastructure and AI data centers to automotive and healthcare — continues to be a key strength.\n\nCelestica's Price Performance, Valuation & Estimates Celestica’s shares have soared 215.6% over the past year compared with the industry’s growth of 93.7%.\n\nStory Continues\n\nImage Source: Zacks Investment Research\nFrom a valuation standpoint, Celestica trades at a forward price-to-earnings ratio of 37.68, up from the industry average of 24.13.\n\nImage Source: Zacks Investment Research\nEarnings estimates for 2025 have increased 6.3% to $5.90 over the past 60 days, while the same for 2026 have also increased 20.9% to $8.20.\n\nImage Source: Zacks Investment Research\nCelestica currently sports a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nJabil, Inc. (JBL) : Free Stock Analysis Report\nFlex Ltd. (FLEX) : Free Stock Analysis Report\nCelestica, Inc. (CLS) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "20:28:21",
      "Source": "GuruFocus.com",
      "Title": "Insider Alert: Nvidia Director Cashes Out $40 Million in Stock Amid Rally",
      "URL": "https://finance.yahoo.com/news/insider-alert-nvidia-director-sells-122257558.html",
      "Content": "Insider Alert: Nvidia Director Cashes Out $40 Million in Stock Amid Rally\n\nNauman Khan\nTue, December 23, 2025 at 4:28 AM PST 1 min read\n\nIn this article: NVDA\n\nAVGO\n\nThis article first appeared on GuruFocus .\nNvidia ( NASDAQ:NVDA ) and Broadcom (AVGO) insiders sold millions of dollars of stock this week, according to Form 4 filings with the U.S. Securities and Exchange Commission.\nNvidia director Mark Stevens sold 222,500 shares for about $40 million on Dec. 19, the filings show.\n\nThe moves come amid strong recent trading in both chip names. Over the past five days Nvidia gained about 4%.\nWarning! GuruFocus has detected 4 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nInsider sales can signal caution but do not necessarily reflect company's outlook. Executives often sell for personal or tax reasons, financial planning or diversification, analysts say.\nInvestors will watch upcoming earnings closely for confirmation.\nNvidia is a major supplier to the fast-growing artificial intelligence and data-center markets, and its shares have attracted heightened retail and institutional attention.\nMarket observers say clustered sales by insiders are notable, but not proof of deteriorating business trends.\nThe SEC filings record the trades and are routine reporting mechanisms for insider activity.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "19:23:10",
      "Source": "Argus Research",
      "Title": "Daily – Vickers Top Buyers & Sellers for 12/23/2025",
      "URL": "https://finance.yahoo.com/m/a59e3a67-5b09-3854-855e-45a07983c9d2/daily-%E2%80%93-vickers-top-buyers-%26.html",
      "Content": "Daily – Vickers Top Buyers & Sellers for 12/23/2025\n\nArgus Research\nTue, December 23, 2025 at 3:23 AM PST\n\nIn this article: IMNM\n\nAVGO\n\nXZO\n\nWTM\n\nAZO\n\nThe Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "19:20:55",
      "Source": "GuruFocus.com",
      "Title": "TSMC Extends Foundry Lead in Q3",
      "URL": "https://finance.yahoo.com/news/tsmc-extends-foundry-lead-q3-112055714.html",
      "Content": "TSMC Extends Foundry Lead in Q3\n\nMoz Farooque ACCA\nTue, December 23, 2025 at 3:20 AM PST 1 min read\n\nIn this article: TSM\n\nTSMWF\n\nNVDA\n\nAMD\n\nAVGO\n\nThis article first appeared on GuruFocus .\nTaiwan Semiconductor Manufacturing ( NYSE:TSM ) continued to pull away from rivals in Q3 as the AI boom kept foundry demand humming.\nGlobal foundry revenue climbed 17% year over year to $84.8billion in the third quarter, Counterpoint Research said, with AI workloads driving heavy use of advanced manufacturing nodes. TSMC stood out again, growing revenue 41% from a year earlier and lifting its market share to 39%. The gains were fueled by a faster ramp in 3nm production and near-full utilization of 4nm and 5nm lines, largely tied to AI chip demand from Nvidia ( NASDAQ:NVDA ), AMD ( NASDAQ:AMD ), and Broadcom.\n\nWarning! GuruFocus has detected 1 Warning Sign with NVO.\nIs TSM fairly valued? Test your thesis with our free DCF calculator.\nElsewhere, growth was far more muted. Non-TSMC foundries posted just 6% growth as tariff-related pull-forward orders faded, even with help from China's subsidies. Analysts say the next challenge is capacity, with advanced nodes and CoWoS packaging already running close to full. AI demand is still strong, but physical limits could start slowing growth as 2026 approaches.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "15:51:36",
      "Source": "Insider Monkey",
      "Title": "Truist Reaffirms Buy on NVIDIA (NVDA), Raises PT to $275 on AI Infrastructure Upside",
      "URL": "https://finance.yahoo.com/news/truist-reaffirms-buy-nvidia-nvda-075136854.html",
      "Content": "Truist Reaffirms Buy on NVIDIA (NVDA), Raises PT to $275 on AI Infrastructure Upside\n\nGhazal Ahmed\nMon, December 22, 2025 at 11:51 PM PST 1 min read\n\nIn this article: TFC\n\nNVDA\n\nAMD\n\nAVGO\n\nTTMI\n\nNVIDIA Corporation (NASDAQ: NVDA ) is one of the AI Stocks in the Spotlight for Investors. On December 19, Truist reiterated the stock at “Buy” and raised its price target to $275 per share from $255. The firm revised price targets in the semiconductor and artificial intelligence group after establishing 2027 projections.\nWhile Truist acknowledges that there are challenges in finding power to run AI infrastructure and sourcing the funds, it believes AI infrastructure stocks remain cheap compared to their growth.\nThe firm also sees more upside pressure to estimates for the group compared to more diversified analog semis heading into 2026. Analysts also noted how AI capital expenditure upside will continue in 2026.\nNVIDIA Corporation (NASDAQ:NVDA) specializes in AI-driven solutions, offering platforms for data centers, self-driving cars, robotics, and cloud services.\nWhile we acknowledge the potential of NVDA as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 10 Trending AI Stocks on Wall Street and 10 AI Stocks on the Market’s Radar\nDisclosure: None.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "13:16:14",
      "Source": "Insider Monkey",
      "Title": "Jim Cramer Says Eli Lilly’s GLP-1 Pill Is “Going to Revolutionize Everything”",
      "URL": "https://finance.yahoo.com/news/jim-cramer-says-eli-lilly-051614791.html",
      "Content": "Jim Cramer Says Eli Lilly’s GLP-1 Pill Is “Going to Revolutionize Everything”\n\nSyeda Seirut Javed\nMon, December 22, 2025 at 9:16 PM PST 2 min read\n\nIn this article: LLY\n\nCVX\n\nSLG\n\nAVGO\n\nAMD\n\nEli Lilly and Company (NYSE: LLY ) is one of the stocks Jim Cramer answered questions about . Inquiring if their portfolio is diversified, a caller highlighted that their top five holdings are LLY, SLG, MSFT, CVX, and TSM. Cramer said:\nPixabay/Public Domain\nEli Lilly and Company (NYSE:LLY) develops and markets medicines for diabetes, obesity, oncology, immunology, neuroscience, and other chronic conditions.\nWhile we acknowledge the potential of LLY as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "13:16:10",
      "Source": "Insider Monkey",
      "Title": "Jim Cramer Highlights Alphabet’s Diverse Portfolio",
      "URL": "https://finance.yahoo.com/news/jim-cramer-highlights-alphabet-diverse-051610017.html",
      "Content": "Jim Cramer Highlights Alphabet’s Diverse Portfolio\n\nSyeda Seirut Javed\nMon, December 22, 2025 at 9:16 PM PST 2 min read\n\nIn this article: GOOG\n\nBA\n\nJPM\n\nAVGO\n\nAlphabet Inc. (NASDAQ: GOOGL ) is one of the stocks Jim Cramer answered questions about . Starting the round of “Am I Diversified?”, a caller mentioned that their top five portfolio holdings are JPM, GOOGL, BA, PG, and AVGO. Cramer commented:\nPhoto by Kai Wenzel on Unsplash\nAlphabet Inc. (NASDAQ:GOOGL) provides tech-related products and services, including search, advertising, cloud computing, AI tools, and digital content platforms like YouTube and Google Play.\nWhile we acknowledge the potential of GOOGL as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "11:30:00",
      "Source": "Motley Fool",
      "Title": "1 Stock I'd Buy Before Tesla in 2026",
      "URL": "https://finance.yahoo.com/m/f7144b80-bc73-3cfb-bcce-30de587112e2/1-stock-i%27d-buy-before-tesla.html",
      "Content": "1 Stock I'd Buy Before Tesla in 2026\n\nDaniel Foelber, The Motley Fool\nMon, December 22, 2025 at 7:30 PM PST 5 min read\n\nIn this article: TSLA\n\nNVDA\n\nGOOG\n\nAAPL\n\nMSFT\n\nKey Points Tesla is hovering around an all-time high despite its core automotive business posting poor results.\nNvidia’s high margins enable it to invest aggressively in research and development without draining its cash flows.\nNvidia is a far better value than Tesla.\n10 stocks we like better than Nvidia ›\nTesla (NASDAQ: TSLA) stock has been on a tear -- hitting an all-time high on Dec. 15 . Tesla is now within striking distance of surpassing Meta Platforms and Broadcom (NASDAQ: AVGO) in market capitalization to become the sixth-most-valuable U.S. company, behind only Nvidia (NASDAQ: NVDA) , Apple , Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) , Microsoft , and Amazon .\n\nTesla is surging due to investor excitement over the company's robotics and artificial intelligence (AI) investments -- particularly its autonomous driving technology through its expanding robotaxi project. Investors are betting that Tesla's future will depend less on selling electric vehicles (EVs) to households and more on self-driving cars, Optimus robots, etc.\nBut to fund these efforts, Tesla relies on cash flows from its automotive and energy generation and storage segments. Tesla's profitability has taken a massive hit, as growth is slowing and its costs are rising. Its operating margins in the third quarter of 2025 were just 5.8% compared to 10.8% in the same quarter of 2024.\nTesla is being valued for what it could earn in the future rather than what it is earning today. Even if Tesla delivers exceptional results, it could still be a poorly performing stock over the next three to five years because so much optimism is already being factored into the valuation. A much better opportunity for 2026 and beyond is a company with plenty of growth potential but a much more realistic valuation -- Nvidia.\nNvidia's cash flows fuel its innovation Unlike Tesla, Nvidia is already capitalizing on a massive opportunity in AI by selling graphics processing units (GPUs) and associated software and hardware to data centers -- a significant change from Nvidia's previous key end markets in gaming, professional visualization, and automotive.\nNvidia has been in the spotlight lately due to mounting competition from Advanced Micro Devices and Broadcom. Broadcom works with hyperscalers like Alphabet to develop custom AI chips. Broadcom and Alphabet have been collaborating for several years, but the relationship has entered a new gear as Alphabet uses these custom chips to train AI models. Alphabet is considering selling its custom chips, called tensor processing units, to other hyperscalers like Meta Platforms. If Alphabet can rival Nvidia with a customer-built full-stack solution that doesn't depend on its GPUs, it could erode Nvidia's margins. That threat has been reflected in the stock prices of both companies -- Nvidia is up just a couple of percentage points over the last three months, compared to a 21% gain for Alphabet.\n\nStory Continues\nNvidia's margins could fall, and it could still become the most profitable company (in addition to being the most valuable) in the world in the coming years. Nvidia has an exceptional balance sheet and generates tons of free cash flow that it can use to invest in long-term projects and ramp up research and development (R&D) spending.\n\nNvidia's cash-supported R&D gives it a rapidly evolving product pipeline. It could have easily rested on its laurels after developing its Blackwell architecture. Instead, Nvidia plans to release its new class of GPUs, called Rubin, which are specifically engineered for AI systems. Rubin will use Taiwan Semiconductor Manufacturing 's highly advanced 3-nanometer process, which packs more transistors into each microchip to increase performance.\nNvidia's valuation is reasonable, while Tesla's is built on speculation With Tesla's EV business under pressure, the company needs to begin generating positive cash flow from its other efforts to support long-term growth projects. Nvidia, on the other hand, is already a high-margin cash cow that is well-positioned to address mounting competition.\nAdditionally, Nvidia trades at a much more reasonable 37.2 times forward earnings. Tesla's is a mind-numbing 292.9.\n\nNvidia and Tesla have both delivered impeccable returns for long-term investors. But for 2026, Nvidia has a far better profile of risk to potential reward than Tesla, which has a mountain to climb just to meet investor expectations and could get punished for even minor missteps.\nShould you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,039 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,109,506 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 972 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nDaniel Foelber has positions in Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, Taiwan Semiconductor Manufacturing, and Tesla. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\n1 Stock I'd Buy Before Tesla in 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "06:37:39",
      "Source": "MT Newswires",
      "Title": "Broadcom Insider Bought Shares Worth $325,129, According to a Recent SEC Filing",
      "URL": "https://finance.yahoo.com/news/broadcom-insider-bought-shares-worth-223739471.html",
      "Content": "PREMIUM\nBroadcom Insider Bought Shares Worth $325,129, According to a Recent SEC Filing\n\nMT Newswires\nMon, December 22, 2025 at 2:37 PM PST\n\nIn this article: AVGO\n\nHarry L. You, Director, on December 18, 2025, executed a purchase for 1,000 shares in Broadcom (AVGO\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 66
}