{
  "stock_id": "AVGO",
  "last_updated": "2025-12-17T17:11:34.623Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-18",
      "Time": "00:44:20",
      "Source": "Investor's Business Daily",
      "Title": "Stock Market Today: Dow Turns Lower As Nasdaq Loss Deepens; Oracle Tumbles (Live Coverage)",
      "URL": "https://finance.yahoo.com/m/08034984-b2ec-32ee-b4d6-81730f186925/stock-market-today%3A-dow-turns.html",
      "Content": "Stock Market Today: Dow Turns Lower As Nasdaq Loss Deepens; Oracle Tumbles (Live Coverage)\n\nSCOTT LEHTONEN and CARLA MOZEE\nWed, December 17, 2025 at 8:44 AM PST 4 min read\n\nIn this article: ORCL\n\n^DJI\n\nCAT\n\n^GSPC\n\nTSLA\n\nStock Market Today: The Dow Jones index rose Wednesday after the indexes dropped Tuesday. Tesla stock wavered.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "00:31:10",
      "Source": "GuruFocus.com",
      "Title": "Micron's Make-or-Break Moment: Can AI Hype Justify a 176% Surge?",
      "URL": "https://finance.yahoo.com/news/microns-break-moment-ai-hype-163110049.html",
      "Content": "Micron's Make-or-Break Moment: Can AI Hype Justify a 176% Surge?\n\nKhac Phu Nguyen\nWed, December 17, 2025 at 8:31 AM PST 2 min read\n\nIn this article: MU\n\nAVGO\n\nNVDA\n\nAMD\n\n^GSPC\n\nThis article first appeared on GuruFocus .\nMarket participants are bracing for Micron Technology ( NASDAQ:MU ) to report earnings after Wednesday's close, with the bar set high as skepticism around the AI trade begins to surface. The shares have surged 176% in 2025, ranking as the fifth-best performer in the S&P 500 and marking Micron's strongest year since 2013, well ahead of the roughly 40% gain in the Philadelphia Semiconductor Index. That momentum has softened in recent sessions, with the stock down about 12% over the past four days following a Dec. 10 high, suggesting investors may be reassessing expectations ahead of the report.\n\nWarning! GuruFocus has detected 9 Warning Sign with MU.\nIs MU fairly valued? Test your thesis with our free DCF calculator.\nThe company is expected to post strong growth as sustained spending on AI data centers supports demand for its high-bandwidth memory chips, but the market appears focused on whether that momentum is still accelerating. Recent sharp declines in Oracle and Broadcom, both of which fell 11% in a single session last week, have highlighted how quickly sentiment can turn on perceived AI beneficiaries. Some investors may now be adopting a more cautious stance, waiting for clearer signals on how durable data-center growth could be before re-engaging with the sector.\nValuation remains a central part of the Micron debate. Despite this year's rally, the shares trade at roughly 11 times estimated earnings over the next 12 months, the lowest multiple among the 30 stocks in the semiconductor index, which trades closer to 25 times forward earnings. That discount stands out against peers such as Nvidia ( NASDAQ:NVDA ), Broadcom ( NASDAQ:AVGO ), and Advanced Micro Devices ( NASDAQ:AMD ), which command significantly higher multiples. At the same time, expectations for Micron's fundamentals have been moving higher, with consensus forecasts for fiscal 2026 net earnings up 16% over the past month and more than 50% over the past quarter, while revenue estimates have risen by more than 20% over the past three months. With enthusiasm elevated and memory demand still cyclical, the upcoming earnings report could either reinforce the view that Micron is reasonably valued or test how much optimism is already reflected in the shares.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:55:02",
      "Source": "Zacks",
      "Title": "Does Broadcom Inc. (AVGO) Have the Potential to Rally 33.58% as Wall Street Analysts Expect?",
      "URL": "https://finance.yahoo.com/news/does-broadcom-inc-avgo-potential-145502998.html",
      "Content": "Does Broadcom Inc. (AVGO) Have the Potential to Rally 33.58% as Wall Street Analysts Expect?\n\nZacks Equity Research\nWed, December 17, 2025 at 6:55 AM PST 4 min read\n\nIn this article: AVGO\n\nBroadcom Inc. (AVGO) closed the last trading session at $341.3, gaining 0.2% over the past four weeks, but there could be plenty of upside left in the stock if short-term price targets set by Wall Street analysts are any guide. The mean price target of $455.92 indicates a 33.6% upside potential.\nThe average comprises 36 short-term price targets ranging from a low of $375.00 to a high of $535.00, with a standard deviation of $40.01. While the lowest estimate indicates an increase of 9.9% from the current price level, the most optimistic estimate points to a 56.8% upside. More than the range, one should note the standard deviation here, as it helps understand the variability of the estimates. The smaller the standard deviation, the greater the agreement among analysts.\n\nWhile the consensus price target is a much-coveted metric for investors, solely banking on this metric to make an investment decision may not be wise at all. That's because the ability and unbiasedness of analysts in setting price targets have long been questionable.\nHowever, an impressive consensus price target is not the only factor that indicates a potential upside in AVGO. This view is strengthened by the agreement among analysts that the company will report better earnings than what they estimated earlier. Though a positive trend in earnings estimate revisions doesn't give any idea as to how much the stock could surge, it has proven effective in predicting an upside.\nPrice, Consensus and EPS Surprise Here's What You Should Know About Analysts' Price Targets According to researchers at several universities across the globe, a price target is one of many pieces of information about a stock that misleads investors far more often than it guides. In fact, empirical research shows that price targets set by several analysts, irrespective of the extent of agreement, rarely indicate where the price of a stock could actually be heading.\n\nWhile Wall Street analysts have deep knowledge of a company's fundamentals and the sensitivity of its business to economic and industry issues, many of them tend to set overly optimistic price targets. Are you wondering why?\nThey usually do that to drum up interest in shares of companies that their firms either have existing business relationships with or are looking to be associated with. In other words, business incentives of firms covering a stock often result in inflated price targets set by analysts.\nHowever, a tight clustering of price targets, which is represented by a low standard deviation, indicates that analysts have a high degree of agreement about the direction and magnitude of a stock's price movement. While that doesn't necessarily mean the stock will hit the average price target, it could be a good starting point for further research aimed at identifying the potential fundamental driving forces.\n\nStory Continues\nThat said, while investors should not entirely ignore price targets, making an investment decision solely based on them could lead to disappointing ROI. So, price targets should always be treated with a high degree of skepticism.\nWhy AVGO Could Witness a Solid Upside Analysts' growing optimism over the company's earnings prospects, as indicated by strong agreement among them in revising EPS estimates higher, could be a legitimate reason to expect an upside in the stock. That's because empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nOver the last 30 days, the Zacks Consensus Estimate for the current year has increased 9.3%, as 10 estimates have moved higher compared to no negative revision.\nMoreover, AVGO currently has a Zacks Rank #2 (Buy), which means it is in the top 20% of more than 4,000 stocks that we rank based on four factors related to earnings estimates. Given an impressive externally-audited track record, this is a more conclusive indication of the stock's potential upside in the near term. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>> .\nTherefore, while the consensus price target may not be a reliable indicator of how much AVGO could gain, the direction of price movement it implies does appear to be a good guide.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:49:03",
      "Source": "Investor's Business Daily",
      "Title": "OpenAI In Talks To Get $10 Billion Amazon Investment, Use Its Chips: The Information",
      "URL": "https://finance.yahoo.com/m/2726b9b8-789b-3d00-8ef3-494b9b80d8bf/openai-in-talks-to-get-%2410.html",
      "Content": "OpenAI In Talks To Get $10 Billion Amazon Investment, Use Its Chips: The Information\n\nED CARSON\nWed, December 17, 2025 at 6:49 AM PST 1 min read\n\nIn this article: AMZN\n\nNVDA\n\nAVGO\n\nAMD\n\nORCL\n\nAmazon is in talks to invest at least $10 billion in OpenAI, which would use the e-commerce giant's in-house AI chips.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:13:34",
      "Source": "Simply Wall St.",
      "Title": "Has Broadcom’s AI Fueled Surge Run Ahead of Its Fundamentals in 2025?",
      "URL": "https://finance.yahoo.com/news/broadcom-ai-fueled-surge-run-141334186.html",
      "Content": "Has Broadcom’s AI Fueled Surge Run Ahead of Its Fundamentals in 2025?\n\nSimply Wall St\nWed, December 17, 2025 at 6:13 AM PST 5 min read\n\nIn this article: AVGO\n\nIf you are wondering whether Broadcom is still attractive after its massive run, or if the market has already priced in the story, this article will unpack whether the current share price lines up with the fundamentals.\nEven after a recent pullback of around 16.0% over the last week and a flat 30 day move, Broadcom is still up about 47.1% year to date and roughly 43.5% over the past year, following multi year gains north of 500% over three years and more than 770% over five.\nThose swings have come against a backdrop of big headlines around Broadcom's role in powering AI data centers and its ongoing integration of VMware. Together, these have sharpened the market's focus on its long term growth runway and execution risks. At the same time, investors are weighing how much of that optimism is already embedded in the price as chip and infrastructure names re rate across the sector.\nAccording to our checks, Broadcom scores a 1 out of 6 valuation score , which suggests that on most traditional measures it is not obviously cheap, but that is only part of the story. Next, we will break down the different valuation approaches behind that score and then circle back at the end to a more holistic way of thinking about what the stock may be worth.\n\nBroadcom scores just 1/6 on our valuation checks. See what other red flags we found in the full valuation breakdown .\nApproach 1: Broadcom Discounted Cash Flow (DCF) Analysis The Discounted Cash Flow, or DCF, model estimates what a company is worth by projecting its future cash flows and then discounting them back to today in dollar terms. For Broadcom, the model starts with last twelve month free cash flow of roughly $26.9 billion and then builds in expectations for strong growth as AI and infrastructure demand scale.\n\nAnalyst estimates and Simply Wall St extrapolations suggest free cash flow could rise to about $107.1 billion by 2030, with further increases beyond that as growth gradually tapers. These ten year cash flow projections are then discounted back using a 2 Stage Free Cash Flow to Equity framework to arrive at an intrinsic value of roughly $290.56 per share.\nCompared with the current share price, this DCF implies Broadcom is about 17.5% overvalued, meaning much of the anticipated cash flow growth already appears to be reflected in the market price.\nResult: OVERVALUED\nOur Discounted Cash Flow (DCF) analysis suggests Broadcom may be overvalued by 17.5%. Discover 915 undervalued stocks or create your own screener to find better value opportunities.\nHead to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for Broadcom.\n\nStory Continues\nApproach 2: Broadcom Price vs Earnings For a mature, highly profitable business like Broadcom, the price to earnings ratio is a useful way to gauge how much investors are paying today for each dollar of current profits. In broad terms, faster growth and lower perceived risk justify a higher normal PE, while slower growth or higher uncertainty usually warrant a lower one.\n\nBroadcom currently trades on a PE of about 69.7x. This is almost double the broader Semiconductor industry average of roughly 36.8x and also well above the peer group average of around 54.2x. To put that into better context, Simply Wall St calculates a proprietary Fair Ratio for each stock, which estimates what its PE should be given its specific earnings growth outlook, industry, profit margins, market value and risk profile. This is more precise than a simple peer or industry comparison because it adjusts for the fact that not all chip companies grow, earn or risk the same way.\nFor Broadcom, the Fair Ratio is around 54.8x, noticeably below the current 69.7x. This points to the shares trading at a premium to what its fundamentals alone would suggest.\nResult: OVERVALUED\nPE ratios tell one story, but what if the real opportunity lies elsewhere? Discover 1460 companies where insiders are betting big on explosive growth .\nUpgrade Your Decision Making: Choose your Broadcom Narrative Earlier we mentioned that there is an even better way to understand valuation, so let us introduce you to Narratives, which are simply your own story about a company linked directly to numbers like fair value, and forecasts for future revenue, earnings and margins. A Narrative on Simply Wall St turns your view of Broadcom’s AI opportunity, VMware integration, customer concentration and competitive risks into a structured financial forecast, then connects that forecast to an explicit fair value you can compare with today’s share price to consider whether you think it is a buy, hold or sell. Narratives live on the Community page of Simply Wall St, are easy to create and follow, and are dynamically updated when fresh information such as earnings, guidance or major news arrives. For example, one Broadcom Narrative might assume rapid AI chip adoption, a smooth VMware ramp and premium profitability, giving a fair value above the current analyst consensus of about $403 per share. A more cautious Narrative might lean on the bearish analyst view near $218 if you expect slower growth, more intense competition and bumpier integration.\nDo you think there's more to the story for Broadcom? Head over to our Community to see what others are saying!\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include AVGO .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:00:00",
      "Source": "Zacks",
      "Title": "AI Overvaluation Bothering You? Try Buffer ETFs",
      "URL": "https://finance.yahoo.com/news/ai-overvaluation-bothering-try-buffer-140000271.html",
      "Content": "AI Overvaluation Bothering You? Try Buffer ETFs\n\nSanghamitra Saha\nWed, December 17, 2025 at 6:00 AM PST 3 min read\n\nIn this article: ORCL\n\nDECW\n\nSPY\n\n^GSPC\n\nNVDA\n\nThe overvaluation concerns in the red-hot artificial intelligence (AI) space, the fear of timing mismatch between massive AI investments and their payoffs, and uncertainty in circular financing in the AI space have been bothering Wall Street for quite some time now. The tech stocks were beaten down last week, taking a toll on the Nasdaq-100 as well as the S&P 500.\n\nOracle 's ORCL shares plummeted 14% last week as revenues missed expectations, dragging down related AI names like NVIDIA and Micron. Broadcom AVGO fell about 11% despite strong earnings and guidance, intensifying concerns over high capital spending and delayed AI revenue payoffs (read: ETFs to Watch as Oracle Dips Despite Beating on Q2 Earnings).\nAre You Worried? Although many bullish analysts believe that the AI bubble is yet to burst, due to its immense potential for growth and rapid adoption in various industries, sudden, steep, occasional selloffs in the tech space are likely to unnerve retail investors.\nAgainst this backdrop, investors may consider some investment vehicles that strike a balance between growth and protection. One such solution gaining traction is Defined Outcome ETFs. These ETFs normally offer investors downside protection while allowing them to participate in upside market returns, making them a lucrative bet in 2026.\n\nHow Are Defined Outcome ETFs Structured? Defined Outcome ETFs, also known as buffer ETFs or structured outcome ETFs, use options to create a structured payoff profile over a set investment period, typically one year. These ETFs aim to cap the maximum return an investor can achieve in market participation, buffer a specific percentage of losses, usually 10%, 15%, or 20%, and provide transparent outcomes at the start of the investment period.\n\nChief Investment Officer of Kathmere Capital Management Nick Ryder said defined outcome ETFs are incorporated into some equity strategies to help reduce downside risk. They are often paired with trend-following approaches and covered-call strategies, as mentioned in CNBC.\nGoldman Makes Strategic Push Into Buffer ETFs Goldman Sachs Asset Management is doubling down on defined outcome exchange-traded funds. This month, Goldman has agreed to acquire Innovator Capital Management, a pioneer in defined outcome ETFs, in a deal valued at $2 billion, as quoted on CNBC. The transaction is expected to be sealed in the first half of next year.\n\nDefined Outcome Exchange-Traded Funds (ETFs) in Focus FT Vest Laddered Buffer ETF BUFR\nThe FT Vest Laddered Buffer ETF seeks to provide investors with capital appreciation by providing U.S. large-cap equity market exposure while attempting to limit downside risk through a laddered portfolio of 12 FT Vest U.S. Equity Buffer ETFs. It charges 95 bps in fees. BUFR is up 9.7% over the past six months versus 13.6% returns offered by the SPDR S&P 500 ETF Trust SPY.\n\nStory Continues\nFT Vest Laddered Nasdaq Buffer ETF BUFQ\nThe FT Vest Laddered Nasdaq Buffer ETF seeks to provide investors with capital appreciation by providing investors with large-cap equity market exposure while attempting to limit downside risk through a laddered portfolio of four FT Vest Nasdaq-100 Buffer ETFs. The fund charges 100 bps in fees. BUFQ has added about 9.8% over the past six months.\n\nAllianzIM U.S. Large Cap Buffer20 Dec ETF DECW\nThe AllianzIM U.S. Large Cap Buffer20 Dec ETF matches the share price returns of the SPDR S&P 500 ETF Trust, up to a specified upside Cap, while providing a Buffer against the first 20% of Underlying ETF losses. The Cap and the Buffer will be reduced after management and other Fund fees and expenses. The current Outcome Period is from Dec. 1, 2024, to Nov. 30, 2025. The fund charges 74 bps in fees. DECW has added about 11.3% over the past six months.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nOracle Corporation (ORCL) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nSPDR S&P 500 ETF (SPY): ETF Research Reports\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "21:37:00",
      "Source": "Barrons.com",
      "Title": "Amazon in Talks Over $10 Billion OpenAI Move: Report. That’s Bad for Nvidia, Broadcom.",
      "URL": "https://finance.yahoo.com/m/b42fe308-59b5-32c1-bf2a-65c9908a7a1f/amazon-in-talks-over-%2410.html",
      "Content": "Amazon in Talks Over $10 Billion OpenAI Move: Report. That’s Bad for Nvidia, Broadcom.\n\nAdam Clark\nWed, December 17, 2025 at 5:37 AM PST 2 min read\n\nIn this article: AMZN\n\nMRVL\n\nNVDA\n\nAVGO\n\nOPAI.PVT\n\nAmazon’s investment would be tied to an agreement for OpenAI to use the e-commerce company’s in-house Trainium chips, according to a report.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "21:00:55",
      "Source": "Investing.com",
      "Title": "Nvidia vs. Broadcom: Which AI chip stock to own for 2026? Analyst answers",
      "URL": "https://finance.yahoo.com/news/nvidia-vs-broadcom-ai-chip-130055434.html",
      "Content": "Nvidia vs. Broadcom: Which AI chip stock to own for 2026? Analyst answers\n\nSam Boughedda\nWed, December 17, 2025 at 5:00 AM PST 2 min read\n\nIn this article: AVGO\n\nNVDA\n\nInvesting.com -- The debate over which AI chip stock to own heading into 2026 remains central for investors, and Morgan Stanley says the outlook for next year still strongly favors the sector’s leaders.\nIn a 2026 semiconductor outlook, Morgan Stanley analyst Joseph Moore wrote that “the picture for CY26 appears very strong,” with AI spending supported by “the scaling up of token growth for complex inference, around usage of the models, not training.”\n\nMoore acknowledged ongoing skepticism around longer-term AI assumptions, noting it has “some skepticism on the 5-year views that make 2025 strength look like a rounding error.”\nStill, the bank said visibility for 2026 remains solid, helped by recent capital raises among major model developers and sustained demand for compute.\nWithin processors, Morgan Stanley “remain[s] OW NVDA and AVGO, maintaining a preference for NVDA.”\n“[Nvidia is] still the nucleus for the AI trade, and at an undemanding multiple we think it’s hard to look elsewhere in AI,” said Moore.\nThe analyst highlighted “growing enthusiasm for ASIC, where growth will be strong,” but added that “as various bottlenecks emerge we continue to think that NVIDIA will be the highest ROI solution in cloud, particularly as Vera Rubin ramps in 2h26.”\n\nMorgan Stanley also believes “the market is underestimating NVIDIA’s position.”\nBroadcom remains favored as part of Morgan Stanley’s overweight positioning, but Nvidia stands out as the preferred name.\nHowever, the bank wrote that “on the GPU alternatives debate, we prefer AVGO as the proven and enduring accelerator story beyond CY2026.”\n“We really like the growth story here, and while we tend to be vocal on GPUs maintaining market share leadership, we still see very strong growth potential for both custom silicon and networking at Broadcom ,” Moore added.\nRelated articles\nNvidia vs. Broadcom: Which AI chip stock to own for 2026? Analyst answers\n10 Beaten-Down Large-Cap Tech Stocks Offering Solid Upside Potential\nLoading Up HEAVY on These 3 Stocks by End of 2025 (+ 1 New ETF)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "21:00:00",
      "Source": "Motley Fool",
      "Title": "Nvidia vs AMD: Which AI Chipmaker Will Lead the Next Decade of Compute?",
      "URL": "https://finance.yahoo.com/m/4d09bc4e-1434-3959-9bee-1d77685550e3/nvidia-vs-amd%3A-which-ai.html",
      "Content": "Nvidia vs AMD: Which AI Chipmaker Will Lead the Next Decade of Compute?\n\nAdria Cimino, The Motley Fool\nWed, December 17, 2025 at 5:00 AM PST 5 min read\n\nIn this article: NVDA\n\nAMD\n\nAVGO\n\nAMZN\n\nKey Points Nvidia has been the leading AI chip designer since the start of the AI boom, but AMD has been gaining ground.\nBoth companies design the chips powering crucial AI tasks.\n10 stocks we like better than Nvidia ›\nNvidia (NASDAQ: NVDA) has been the \"go-to\" source for artificial intelligence (AI) chips since the start of the AI boom, and this is thanks to two things: the company's first-to-market advantage and the strong performance of its chips. All of this has generated enormous earnings growth, with revenue and profit reaching record levels, and mind-boggling share price gains -- the stock has advanced more than 900% over three years.\n\nBut Nvidia isn't alone in the exciting AI space. It faces competition from other chip designers such as Broadcom and even some of its own customers that have developed their own chips, like Amazon , for example. But one name in particular represents perhaps the biggest threat to Nvidia's dominance, and that's Advanced Micro Devices (NASDAQ: AMD) , a company that's been quickly advancing with new high-powered chips and attractive pricing. And the coming years could represent a crucial moment for chip companies, as Nvidia predicts AI infrastructure spending may reach as much as $4 trillion.\nWhich of these two AI chip designers will lead the next decade of compute? Let's find out.\nNvidia's path to leadership First, let's consider Nvidia's path to leadership and how it's managed to stay ahead of rivals so far. As mentioned, Nvidia entered the market first with its supercharged graphics processing units (GPUs), AI chips that power the most crucial of AI tasks from training to inferencing . This offered the company the opportunity to build relationships with customers, and for customers to be won over by the quality of Nvidia's products.\n\nNvidia maintained this leadership by continuing to innovate on a regular basis, and in recent years, it committed to annual updates to its top chips.\nAMD made AI a focus with the launch of its Instinct line of accelerators back in 2017, and since then has added to GPU offerings, gaining in performance and therefore becoming a stronger rival for AI powerhouse Nvidia.\nIn the most recent earnings report, the company delivered a 36% increase in revenue to a record level of $9.2 billion, and chief executive officer Lisa Su said quarterly performance and guidance for the next quarter marked \"a clear step up in our growth trajectory.\" Demand from data center customers for the company's EPYC processors and Instinct AI accelerators drove gains in the period.\n\nStory Continues\nAMD and OpenAI It's also important to note that AMD recently signed a deal with OpenAI for the deployment of six gigawatts of AMD GPUs, with the first gigawatt set to roll out in the second half of next year. (OpenAI also has a deal with Nvidia for the deployment of 10 gigawatts of Nvidia GPUs.)\nThough AMD has come a long way in a short period of time and surely will continue to gain many orders for its GPUs, I don't see the company unseating Nvidia and driving compute in the coming decade. And here's why: Nvidia truly has built out a massive ecosystem within the world of AI, offering everything needed to do the AI job, from GPUs to high-performance networking equipment and software, as well as platforms for specific industries like autonomous vehicles, healthcare, and robotics. And within those industry platforms, Nvidia's built tools designed to help customers reach their goals.\n\nThough AMD also offers a significant array of products and services, it's not as far-reaching as that of its bigger competitor.\nLeading the next decade of AI All of this makes Nvidia better positioned to lead the next decade of compute -- but this doesn't mean AMD won't benefit from the upcoming phases of AI growth. AMD's chips and systems are powerful, pricing is competitive, and the company has seen demand take off in recent quarters. Major chip customers, like Amazon, just to name one, buy GPUs from a variety of chip designers -- not just from Nvidia. In its recent earnings call, Amazon chief Andy Jassy said Amazon Web Services continues \"to work closely with chip partners like Nvidia, with whom we continue to order very significant amounts as well as with AMD and Intel .\"\n\nAll of this means that AMD may have plenty of very of bright days ahead, but considering the empire Nvidia has carefully built over time and its commitment to innovation, I expect this AI giant to keep powering the AI revolution.\nShould you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $505,695 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,080,694 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 962 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nAdria Cimino has positions in Amazon. The Motley Fool has positions in and recommends Advanced Micro Devices, Amazon, Intel, and Nvidia. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nNvidia vs AMD: Which AI Chipmaker Will Lead the Next Decade of Compute? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "20:47:10",
      "Source": "GuruFocus.com",
      "Title": "Cantor Sees Semiconductors Outperforming in 2026 as AI Spending Heats up",
      "URL": "https://finance.yahoo.com/news/cantor-sees-semiconductors-outperforming-2026-124710345.html",
      "Content": "Cantor Sees Semiconductors Outperforming in 2026 as AI Spending Heats up\n\nMoz Farooque ACCA\nWed, December 17, 2025 at 4:47 AM PST 1 min read\n\nIn this article: NVDA\n\n^GSPC\n\nAVGO\n\nMU\n\nWDC\n\nThis article first appeared on GuruFocus .\nNVIDIA Corporation ( NVDA , Financials ) and the broader semiconductor sector may be poised for another strong year, according to a new outlook from Cantor. The firm expects chip stocks to outperform in 2026 as demand for AI infrastructure continues to surge and memory supply remains tight.\n\nWarning! GuruFocus has detected 4 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nCantor noted that the Philadelphia Semiconductor Index has climbed 40% this year, significantly outpacing the S&P 500 and Nasdaq. Analysts believe the same dynamics that powered this year's rally heavy investment from cloud providers, rapid adoption of AI compute, and ongoing supply constraints will carry into next year.\nThe firm highlighted several areas of strength, including AI processors, memory, storage, and semiconductor equipment. Companies tied to hyperscale data center spending, such as Nvidia and Broadcom, remain central to the buildout. At the same time, memory makers like Micron and Western Digital continue to benefit from constrained supply conditions that support pricing.\nCantor argued that the investment cycle behind AI is still in its early stages and should offer multi-year growth potential rather than the short-lived surge some investors feared. With cloud providers reporting strong returns on AI infrastructure, analysts see little sign that demand will taper in the near term.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "20:11:28",
      "Source": "MT Newswires",
      "Title": "Social Buzz: Wallstreetbets Stocks Mostly Higher Pre-Bell Wednesday; Amazon, Hood to Advance",
      "URL": "https://finance.yahoo.com/news/social-buzz-wallstreetbets-stocks-mostly-121128842.html",
      "Content": "PREMIUM\nSocial Buzz: Wallstreetbets Stocks Mostly Higher Pre-Bell Wednesday; Amazon, Hood to Advance\n\nMT Newswires\nWed, December 17, 2025 at 4:11 AM PST 1 min read\n\nIn this article: AMZN\n\nDTE\n\nTSLA\n\nNVDA\n\nHOOD\n\nThe most-talked-about stocks in the Reddit subforum Wallstreetbets were mostly higher hours before W\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "20:00:00",
      "Source": "Zacks",
      "Title": "6 Top-Performing ETF Areas of Last Week",
      "URL": "https://finance.yahoo.com/news/6-top-performing-etf-areas-120000857.html",
      "Content": "6 Top-Performing ETF Areas of Last Week\n\nSanghamitra Saha\nWed, December 17, 2025 at 4:00 AM PST 3 min read\n\nIn this article: AVGO\n\nSIL\n\nGDXJ\n\nSILJ\n\nCNBS\n\nWall Street was upbeat last week. The S&P 500 lost 0.6%, the Dow Jones advanced 1.1% and the Nasdaq retreated about 1.6% last week. The tech stocks were beaten down, taking a toll on the Nasdaq-100 as well as the S&P 500. Roundhill Magnificent Seven ETF MAGS lost 1.7% last week, while State Street Technology Select Sector SPDR ETF XLK was off 2.5%.\n\nInside the Tech Sell-off Oracle 's ORCL shares plummeted 14% last week as revenues missed expectations, dragging down related AI names like NVIDIA and Micron. Broadcom AVGO fell about 11% despite strong earnings and guidance, intensifying concerns over high capital spending and delayed AI revenue payoffs (read: ETFs to Watch as Oracle Dips Despite Beating on Q2 Earnings).\n\nFed Rate Cut The Fed enacted its final rate cut of the year last week. The move brings the benchmark federal funds rate to a range of 3.5% to 3.75% after a closely divided vote among policymakers.The Fed will now conclude the year facing a softer labor market and inflation still about one percentage point above its 2% target.\n\nAfter three rate cuts in 2025 totaling three-quarters of a percentage point, the Fed&rsquo;s outlook for 2026 looks more restrained. Policymakers continue to project just one rate cut next year, consistent with their September forecast (read: 'A Hawkish Cut' From Fed? ETFs to Gain).\nAgainst this backdrop, below we highlight a few winning exchange-traded fund (ETF) areas of last week.\nWinning ETF Areas in Focus Cannabis\nRoundhill Cannabis ETF WEED &ndash; Up 51.2%\nAmplify Seymour Cannabis ETF CNBS &ndash; Up 51.0%\nCannabis stocks surged significantly on Dec. 12, 2025, thanks to reports of President Trump's plans to ease federal marijuana regulations by reclassifying it to Schedule III from a Schedule I. This news sparked gains across major players, boosting investor optimism despite no final policy confirmation, as mentioned in CNBC.\n\nSilver Miners\nGlobal X Silver Miners ETF SIL &ndash; Up 8.4%\nAmplify Junior Silver Miners ETF SILJ &ndash; Up 7.6%\nSilver is often considered an industrial metal. Rising industrial usage in solar panels, electric vehicles, electronics, and AI data centers has fueled demand. Plus, persistent supply shortages have now been boosting silver prices. As a result, silver mining stocks soared in recent tradings.\nSpace Economy\nProcure Space ETF UFO &ndash; Up 7.8%\nRocket Lab Corp RKLB surged 22.8% last week. The stock is benefiting from the uptick in investors&rsquo; attention in the overall space economy.Rocket Lab&rsquo;s successful move in the next-gen Neutron rocket and securing of new funding from the Canadian Space Agency were other positives. There has been a report about a potential $1.5 trillion SpaceX IPO for 2026 (per Bloomberg, as quoted on Yahoo Finance). SpaceX news acted as a cornerstone for the entire space investing arena.\n\nStory Continues\nGold Miners\nVanEck Junior Gold Miners ETF GDXJ &ndash; Up 7.1%\nSPDR Gold Trust GLD gained 2.2% last week as the greenback weakened further. Since gold mining stocks act as leveraged plays of the underlying metal, GDXJ surged materially.\nPlatinum\nGraniteShares Platinum Trust PLTM &ndash; Up 6.3%\nPlatinum surged above $1,700 per ounce, touching its strongest level since 2011, per Tradingeconomics. The World Platinum Investment Council forecasts a 2025 deficit of 69,200 ounces, marking a third successive annual shortfall. However, 2026 could see a balance in the platinum market with a modest surplus of about 20,000 ounces, as quoted on Tradingeconomics.\n\nHealth Care\nRoundhill GLP-1 & Weight Loss ETF OZEM &ndash; Up 6.3%\nThe Roundhill GLP-1 & Weight Loss ETF is the world&rsquo;s first GLP-1 ETF. OZEM is an actively-managed ETF. The fund charges 59 bps and yields 0.16% annually. Roundhill believes that weight loss drugs, including GLP-1 agonists, offer one of the most groundbreaking advancements in the global pharmaceuticals industry (read: Best-Performing ETFs of November).\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nOracle Corporation (ORCL) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nSPDR Gold Shares (GLD): ETF Research Reports\nState Street Technology Select Sector SPDR ETF (XLK): ETF Research Reports\n\nVanEck Junior Gold Miners ETF (GDXJ): ETF Research Reports\nGlobal X Silver Miners ETF (SIL): ETF Research Reports\nAmplify Junior Silver Miners ETF (SILJ): ETF Research Reports\nProcure Space ETF (UFO): ETF Research Reports\nAmplify Seymour Cannabis ETF (CNBS): ETF Research Reports\nRocket Lab Corporation (RKLB) : Free Stock Analysis Report\nRoundhill Cannabis ETF (WEED): ETF Research Reports\nRoundhill GLP-1 & Weight Loss ETF (OZEM): ETF Research Reports\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "15:34:17",
      "Source": "Insider Monkey",
      "Title": "Cantor Maintains Overweight on Broadcom (AVGO), Citing Strong AI Momentum",
      "URL": "https://finance.yahoo.com/news/cantor-maintains-overweight-broadcom-avgo-073417737.html",
      "Content": "Cantor Maintains Overweight on Broadcom (AVGO), Citing Strong AI Momentum\n\nGhazal Ahmed\nTue, December 16, 2025 at 11:34 PM PST 2 min read\n\nIn this article: AVGO\n\nGOOG\n\nANTH.PVT\n\nOPAI.PVT\n\nBroadcom Inc. (NASDAQ: AVGO ) is one of the Trending AI Stocks on Wall Street . On December 12, Cantor Fitzgerald maintained its “Overweight” rating on the stock with a $525 price target. The firm has reiterated its “Top Pick” status on Broadcom based on AI infrastructure momentum and expanding silicon footprint.\n\nThe fabless chip and software maker reported a top-and-bottom-line earnings beat. Besides strong results for the October quarter, the company also provided a modest raise for January quarter guidance.\nHowever, this was partially affected by a higher tax rate forecast for fiscal year 2026. There was also a $73 billion of AI backlog, including $53 billion in custom silicon, which is anticipated to convert to revenue over the next six quarters.\nBroadcom also announced a fifth customer, bringing its total AI customer count to six, including Google, Anthropic, META, Bytedance, and OpenAI. The firm estimates AI semiconductor revenue to grow by more than 100% in calendar year 2026, leading to an earnings per share of at least $10.70.\nBroadcom is a technology company uniquely positioned in the AI revolution owing to its custom chip offerings and networking assets.\nWhile we acknowledge the potential of AVGO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 12 Must-Watch AI Stocks on Wall Street and 11 AI Stocks Analysts Are Watching Closely .\nDisclosure: None.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "09:37:00",
      "Source": "TheStreet",
      "Title": "Bank of America updates Palantir stock forecast after private meeting",
      "URL": "https://finance.yahoo.com/m/497d2e7e-b89d-3c6c-b35d-13a1a3781785/bank-of-america-updates.html",
      "Content": "Bank of America updates Palantir stock forecast after private meeting\n\nVuk Zdinjak\nTue, December 16, 2025 at 5:37 PM PST 4 min read\n\nIn this article: PLTR\n\nORCL\n\nAVGO\n\nPalantir stock has gained about 20% since its November slump. It appears that the stock has weathered the storm of the AI sell-off, which was triggered by investor fears that AI is a bubble.\nLast week was especially difficult, as Oracle and Broadcom both took a sharp drop after reporting earnings, dragging other AI companies down with them.\nBank of America analyst Mariana Perez Mora and her team hosted investor meetings last week, featuring Palantir CFO Dave Glazer, Deployment Strategists Hind Kraytem and Austin Lee, and Investor Relations representative Cary Li, in South Korea. They updated their opinion on the stock afterward.\nBank of America says “PLTR still in a league of its own” The team said they came back confident from the meetings, as Palantir’s ( PLTR ) growth continues to build momentum in tandem with enterprise-level AI adoption.\nThey noted that U.S. Commercial growth continues to show the strongest momentum, thanks to strengthening backlog and lower contract duration. Palantir recently received a two-year contract with the U.S. Navy for ShipOS, worth $448 million, and Mora said that it further aligns the company with the Trump administration’s priorities regarding reindustrialization of America.\n\nThe team believes Palantir has an opportunity for margin expansion, as operating leverage grows with each use case across the businesses.\nRelated: Bank of America resets Broadcom stock price target\nMora wrote: “We continue to see PLTR unmatched in their ability to rapidly achieve in-production solutions and provide human-machine teams with the ability to make the most informed decisions.”\nIn a research note shared with TheStreet, Mora reiterated a buy rating and the target price of $255 for PLTR stock, based on a 15 enterprise multiple estimate for 2035. She used a longer-term valuation methodology to reflect the sustained high-growth and profitability profile of the company.\nMora believes this valuation fairly captures the beneficial position to national security and U.S. government, reflecting a leading role in artificial intelligence platforms, strong balance sheet , and strong profitability.\n\nAnalysts noted downside risk factors for Palantir: Lower-than-expected AI-platforms market growth\nFaster-than-expected commoditization\nCompetitors catching up with technologies,\nStronger-than-expected resistance from government customers to use commercial\noff-the-shelf solutions\nUpside risk factors for Palantir are: Stronger-than-expected growth of the AI-platforms market\nHigher-than-expected Palantir penetration\nBetter-than-expected profitability\nBetter-than-expected successful agreements and investments\nOther opinions on Palantir stock Wedbush analyst Dan Ives and his team rate Palantir with a buy rating and a target price of $230. TheStreet Pro ’s veteran analyst Stephen Guilfoyle rates Palantir with a buy rating and a target price of $215.\nMorgan Stanley reiterated a hold rating and raised Palantir’s price target from $155 to $205 in November, according to TipRanks .\n\nMotley Fool's Keithen Drury believes Palantir is “grossly overvalued.” He sees a big problem for Palantir in Wall Street ’s estimates for Palantir’s revenue growth rate for next year of 41%, because if they are correct, this will be a slowdown.\nIn turn, this slowdown will increase the number of years required for growth to bring Palantir’s valuation to a reasonable level.\nPalantir’s recent activity Palantir announced a three-year renewal of its contract with the DGSI, France’s domestic intelligence agency. The company will supply its proprietary software platform to the agency, along with the necessary integration, support, and assistance services for the software’s deployment and operational use.\n\n“We are very proud to support the DGSI in its crucial work in the service of France and its fight against terrorism,\" said Palantir CEO Alex Karp . \"This contract renewal reaffirms Palantir’s commitment to serving the interests of France since 2016, and ensuring the security of the French people.”\nMore AI Stocks:\nIs Nvidia’s AI boom already priced in? Oppenheimer doesn’t think so\nWindows president told ‘Stop this nonsense. No one wants this’\nMichael Burry turns up heat on anti-AI bet\nAI plays expanding role in predicting natural disasters\nMorgan Stanley revamps Nvidia’s price target ahead of big Q3\nCathie Wood buys $16.2 million of sinking AI stock\nThe company unveiled Chain Reaction , a platform it describes as “the operating system for American AI infrastructure.” Chain Reaction is designed to accelerate the AI buildout with energy producers, power distributors, data centers, and infrastructure builders. The platform’s founding partners include CenterPoint Energy and Nvidia .\n\n\"We have spent years quietly deploying systems that keep power plants running and grids reliable,\" Tristan Gruska, Palantir’s head of energy and infrastructure, stated. \"Chain Reaction is the result of building from the ground up for the demands of AI.”\nAfter spending more than 12 years at Palantir, Jim Siders has stepped down from his most recent position of CIO and joined Shield Technology Partners to serve as CEO, according to CNBC .\nRelated: Bank of America resets Oracle stock price target\nThis story was originally published by TheStreet on Dec 16, 2025, where it first appeared in the Investing section. Add TheStreet as a Preferred Source by clicking here.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 14
}