{
  "stock_id": "GFS",
  "last_updated": "2026-01-04T09:11:30.448Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2026-01-04",
      "Time": "17:10:10",
      "Source": "Business Insider",
      "Title": "A group of about 20 US investors is already planning a trip to Venezuela in March",
      "URL": "https://finance.yahoo.com/m/35c7d620-9dfa-3989-ae79-a2725c5c1609/a-group-of-about-20-us.html",
      "Content": "A group of about 20 US investors is already planning a trip to Venezuela in March\n\nKatherine Tangalakis-Lippert\nSun, January 4, 2026 at 1:10 AM PST 2 min read\n\nInvestors are already eyeing financial opportunities in Venezuela following Maduro's ouster.\nCharles Myers, chairman of Signum Global Advisors, said he's preparing to visit Venezuela in March.\nForeign investment in oil and tourism will be the \"centerpiece\" of Venezuela's recovery, Myers said.\n\nA group of about 20 US investors is already planning to travel to Venezuela in March, following Saturday's news that the country's president, Nicolás Maduro , had been taken into US custody.\nCharles Myers, the chairman of the political risk advisory firm Signum Global Advisors and a former vice-chairman of the investment advisory firm Evercore, told Business Insider that the mood among investors he has spoken to is one of \"cautious optimism\" following news of Maduro's ouster .\n\"I think the centerpiece of Venezuela's success, looking out 12 months or even 24 months, is foreign investment,\" Myers said. \"A big part of the Venezuela story, starting today, is foreign investment, especially in oil and gas, which is pretty straightforward, but there are massive opportunities in construction, in tourism.\"\n\nMyers said it's not the responsibility of his firm to take a \"moral position\" on whether it was right or wrong for the US to involve itself in Venezuela's government, but rather to help the firm's clients anticipate investment opportunities or mitigate risk due to geopolitical events.\nHowever, he added, his firm \"very much expected\" the situation in Venezuela would unfold as it has, and has been preparing investor groups to be ready to travel to the country when the opportunity presents itself. Signum previously hosted similar trips for asset managers and hedge funds to visit Syria and Ukraine.\n\"People have seen this coming, especially very smart investors, and many of them have actually bought bonds in anticipation of this,\" Myers said. \"But there's a very strong degree of cautious optimism, even more so than we saw with Syria, just because this is a United States-directed action .\"\n\"The United States will play a pivotal role in everything, especially the Venezuelan economy, starting today,\" Myers added, \"So, I think the reaction has been more enthusiastic than perhaps other situations like this.\"\nRead the original article on Business Insider\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-04",
      "Time": "16:55:00",
      "Source": "Motley Fool",
      "Title": "Think It's Too Late to Buy Micron Stock? Here's the 1 Reason Why There's Still Time.",
      "URL": "https://finance.yahoo.com/m/079de05c-8033-3746-a997-e15360580cf8/think-it%27s-too-late-to-buy.html",
      "Content": "Think It's Too Late to Buy Micron Stock? Here's the 1 Reason Why There's Still Time.\n\nJohn Ballard, The Motley Fool\nSun, January 4, 2026 at 12:55 AM PST 3 min read\n\nIn this article: MU\n\nKey Points Micron is trading at a tempting valuation, despite the stock's monster run in 2025.\nMemory prices are increasing due to strong data center demand.\nThere are risks, but Micron is riding the growth in data center spending.\n10 stocks we like better than Micron Technology ›\nMicron Technology (NASDAQ: MU) stock exploded to new highs in the second half of 2025. The memory chip supplier looks very tempting from a valuation perspective, trading at just about 9 times this year's earnings estimates.\nHowever, this is historically a very cyclical business, with swings in demand and selling prices causing lumpy financial results. Nonetheless, there is one reason that Micron stock might have more upside for investors in 2026, and maybe beyond.\nWhy buy Micron stock? The stock soared following record revenue and robust year-over-year earnings growth. Analysts expect earnings to reach $32.14 in the current fiscal year, according to Yahoo! Finance, up from just $8.29 in the previous year. Micron's profits are soaring as data center demand is driving up prices for dynamic random access memory (DRAM), which increased 20% quarter over quarter recently.\n\nDuring the company's fiscal first-quarter 2026 earnings call, management highlighted that demand for memory continues to exceed supply. These conditions could extend through 2026. Micron has already sold out of its entire 2026 supply of high-bandwidth memory products. Management expects the addressable market for these advanced memory chips to grow at a 40% annual rate, reaching $100 billion by 2028.\nInvestors should be mindful of Micron's cyclical history, which is the greatest risk in buying the stock at these highs. Still, the stock is not pricing in the shortage to persist, even though demand for AI cloud services exceeds data center capacity at nearly every leading cloud services provider. Further investment in data center infrastructure could still send the stock higher in 2026.\n\nShould you buy stock in Micron Technology right now? Before you buy stock in Micron Technology, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Micron Technology wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $490,703 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,157,689 !*\n\nStory Continues\nNow, it’s worth noting Stock Advisor’s total average return is 966 % — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of January 4, 2026.\nJohn Ballard has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy .\nThink It's Too Late to Buy Micron Stock? Here's the 1 Reason Why There's Still Time. was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-04",
      "Time": "16:51:51",
      "Source": "Simply Wall St.",
      "Title": "With EPS Growth And More, Vianet Group (LON:VNET) Makes An Interesting Case",
      "URL": "https://finance.yahoo.com/news/eps-growth-more-vianet-group-085151554.html",
      "Content": "With EPS Growth And More, Vianet Group (LON:VNET) Makes An Interesting Case\n\nSimply Wall St\nSun, January 4, 2026 at 12:51 AM PST 4 min read\n\nIn this article: VNET.L\n\nFor beginners, it can seem like a good idea (and an exciting prospect) to buy a company that tells a good story to investors, even if it currently lacks a track record of revenue and profit. But as Peter Lynch said in One Up On Wall Street , 'Long shots almost never pay off.' A loss-making company is yet to prove itself with profit, and eventually the inflow of external capital may dry up.\n\nIf this kind of company isn't your style, you like companies that generate revenue, and even earn profits, then you may well be interested in Vianet Group ( LON:VNET ). Even if this company is fairly valued by the market, investors would agree that generating consistent profits will continue to provide Vianet Group with the means to add long-term value to shareholders.\nThis technology could replace computers: discover the 20 stocks are working to make quantum computing a reality.\nHow Quickly Is Vianet Group Increasing Earnings Per Share? Generally, companies experiencing growth in earnings per share (EPS) should see similar trends in share price. That makes EPS growth an attractive quality for any company. Shareholders will be happy to know that Vianet Group's EPS has grown 35% each year, compound, over three years. If growth like this continues on into the future, then shareholders will have plenty to smile about.\n\nCareful consideration of revenue growth and earnings before interest and taxation (EBIT) margins can help inform a view on the sustainability of the recent profit growth. It was a year of stability for Vianet Group as both revenue and EBIT margins remained have been flat over the past year. While this doesn't ring alarm bells, it may not meet the expectations of growth-minded investors.\nYou can take a look at the company's revenue and earnings growth trend, in the chart below. To see the actual numbers, click on the chart.\nView our latest analysis for Vianet Group\nSince Vianet Group is no giant, with a market capitalisation of UK£21m, you should definitely check its cash and debt before getting too excited about its prospects.\nAre Vianet Group Insiders Aligned With All Shareholders? Investors are always searching for a vote of confidence in the companies they hold and insider buying is one of the key indicators for optimism on the market. Because often, the purchase of stock is a sign that the buyer views it as undervalued. However, small purchases are not always indicative of conviction, and insiders don't always get it right.\n\nOne positive for Vianet Group, is that company insiders spent UK£33k acquiring shares in the last year. While this isn't much, we also note an absence of sales. We also note that it was the Chairman & CEO, James Dickson, who made the biggest single acquisition, paying UK£29k for shares at about UK£0.72 each.\n\nStory Continues\nIt's commendable to see that insiders have been buying shares in Vianet Group, but there is more evidence of shareholder friendly management. Specifically, the CEO is paid quite reasonably for a company of this size. Our analysis has discovered that the median total compensation for the CEOs of companies like Vianet Group with market caps under UK£149m is about UK£304k.\n\nVianet Group offered total compensation worth UK£219k to its CEO in the year to March 2025. That comes in below the average for similar sized companies and seems pretty reasonable. While the level of CEO compensation shouldn't be the biggest factor in how the company is viewed, modest remuneration is a positive, because it suggests that the board keeps shareholder interests in mind. Generally, arguments can be made that reasonable pay levels attest to good decision-making.\nShould You Add Vianet Group To Your Watchlist? If you believe that share price follows earnings per share you should definitely be delving further into Vianet Group's strong EPS growth. But wait, it gets better . We have seen insider buying and the executive pay seems on the modest side of things. All in all, this stock is worth the time to delve deeper into the details. You still need to take note of risks, for example - Vianet Group has 1 warning sign we think you should be aware of.\n\nKeen growth investors love to see insider activity. Thankfully, Vianet Group isn't the only one. You can see a a curated list of British companies which have exhibited consistent growth accompanied by high insider ownership .\nPlease note the insider transactions discussed in this article refer to reportable transactions in the relevant jurisdiction.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-04",
      "Time": "16:50:00",
      "Source": "Motley Fool",
      "Title": "A Once-in-a-Decade Investment Opportunity: The 3 Best AI Stocks to Buy in January 2026",
      "URL": "https://finance.yahoo.com/m/debb8a92-c4aa-34e8-ab80-57e6aa3a3473/a-once-in-a-decade-investment.html",
      "Content": "A Once-in-a-Decade Investment Opportunity: The 3 Best AI Stocks to Buy in January 2026\n\nTrevor Jennewine, The Motley Fool\nSun, January 4, 2026 at 12:50 AM PST 5 min read\n\nIn this article: NVDA\n\nMETA\n\nPSTG\n\nJPM\n\nKey Points Nvidia's graphics processing units are the industry standard in artificial intelligence infrastructure, but the company is truly formidable due to its full-stack strategy.\nMeta Platforms is using artificial intelligence to improve engagement and advertising conversion rates across its portfolio of industry-leading social media properties.\nPure Storage is a leader in enterprise storage solutions, and its all-flash arrays pack more storage density and greater power efficiency than any competing product.\n10 stocks we like better than Nvidia ›\n\nArtificial intelligence (AI) promises to be the most transformative technology of the decade, if not all of human history. Analysts have compared the AI revolution to other major inflection points, including the advent of the internet, the introduction of the smartphone, and the invention of the microprocessor.\nHowever, AI is being adopted much more quickly than all of those technologies. Indeed, Stephanie Aliaga at JPMorgan Chase writes, \"In the first half of 2025, AI-related capital expenditures contributed 1.1% to GDP growth, outpacing the U.S. consumer as an engine of expansion.\"\nHere's why Nvidia (NASDAQ: NVDA) , Meta Platforms (NASDAQ: META) , and Pure Storage (NYSE: PSTG) are my picks for the three best AI stocks to buy in January 2026.\nNvidia: 32% upside implied by the median target price Nvidia is best known for its graphics processing units (GPUs), chips that speed up compute-intensive data center workloads like analytics and artificial intelligence (AI). But the company is truly formidable because it complements its GPUs with CPUs, networking platforms, and an unparalleled ecosystem of software tools that assist developers with building applications.\n\nConsequently, while custom AI accelerators developed by competitors like Broadcom are generally cheaper, Nvidia systems frequently have a lower total cost of ownership because the company can optimize performance across most facets of the data center computing stack. Additionally, custom chips lack pre-built software tools, which means they must be built from scratch.\nMorningstar analyst Brian Colello says Nvidia's vertically integrated business model that spans data center hardware and software affords the company a wide economic moat. \"In the long run, we expect tech titans to strive to find second sources or in-house solutions to diversify away from Nvidia in AI, but these efforts will, at best, only chip away at Nvidia's AI dominance.\"\n\nNvidia's adjusted earnings increased 60% in the third quarter, and Wall Street estimates earnings will increase at 67% annually through the fiscal year ending in January 2027. That makes the current valuation of 46 times earnings look cheap. Indeed, among 69 analysts, Nvidia has a median target price of $250 per share, implying 32% upside from its current share price of $189.\n\nStory Continues\nMeta Platforms: 29% upside implied by the median target price Meta Platforms is the second-largest ad tech company in the world. The company has an almost unparalleled ability to source consumer data because it owns four of the six most popular social media properties as measured by monthly active users. That data continuously informs content ranking and ad targeting systems to improve the user experience.\n\nMeta has developed several artificial intelligence products, from custom AI chips that reduce dependence on Nvidia GPUs to proprietary machine learning models that optimize the performance of ad impressions. CEO Mark Zuckerberg says \"higher quality and more relevant content\" has led to deeper engagement across Facebook and Instagram.\nMeta's earnings increased 20% in the third quarter (excluding a one-time tax charge) and Wall Street estimates adjusted earnings will increase 21% in 2026. That makes the current valuation of 29 times earnings a fair price for patient investors. Among 71 analysts, Meta has a median target price of $840 per share, implying 29% upside from its current share price of $650.\nPure Storage: 45% upside implied by the median target price Pure Storage builds all-flash storage systems and adjacent software that lets enterprises manage file, block, and object storage across private and public clouds. The company has distinguished itself with DirectFlash technology, which eliminates many inefficiencies and bottlenecks associated with traditional solid-state drives by managing raw flash memory at the array level rather than the device level.\n\n\"Our DirectFlash modules deliver two to three times the storage density and consume from 39% to 54% fewer watts per terabyte than our closest competitors today,\" according to the company. Consultancy Gartner recently recognized Pure Storage as the technology leader in enterprise storage platforms, listing automation features, data management capabilities, and strong customer satisfaction as key strengths.\nThe all-flash array market is forecast to grow at 16% annually through 2033 as the AI boom continues. Pure Storage's adjusted earnings increased 16% during the third quarter, but Wall Street anticipates an acceleration to 23% annually through the fiscal year ending in February 2027. That makes the current valuation of 39 times earnings look reasonable.\n\nIndeed, among 23 Wall Street analysts, Pure Storage has a median target price of $100 per share. That implies 45% upside from its current share price of $69.\nShould you buy stock in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $490,703 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,157,689 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 966 % — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of January 4, 2026.\nJPMorgan Chase is an advertising partner of Motley Fool Money. Trevor Jennewine has positions in Nvidia. The Motley Fool has positions in and recommends JPMorgan Chase, Meta Platforms, Nvidia, and Pure Storage. The Motley Fool recommends Broadcom and Gartner. The Motley Fool has a disclosure policy .\nA Once-in-a-Decade Investment Opportunity: The 3 Best AI Stocks to Buy in January 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-04",
      "Time": "16:43:15",
      "Source": "Simply Wall St.",
      "Title": "Several Insiders Invested In Eleco Flagging Positive News",
      "URL": "https://finance.yahoo.com/news/several-insiders-invested-eleco-flagging-084315329.html",
      "Content": "Several Insiders Invested In Eleco Flagging Positive News\n\nSimply Wall St\nSun, January 4, 2026 at 12:43 AM PST 2 min read\n\nIn this article: ELCO.L\n\nWhen a single insider purchases stock, it is typically not a major deal. However, when multiple insiders purchase stock, like in Eleco plc's ( LON:ELCO ) instance, it's good news for shareholders.\nAlthough we don't think shareholders should simply follow insider transactions, we do think it is perfectly logical to keep tabs on what insiders are doing.\n\nWe've found 21 US stocks that are forecast to pay a dividend yield of over 6% next year. See the full list for free.\nEleco Insider Transactions Over The Last Year Over the last year, we can see that the biggest insider purchase was by Independent Non-Executive Chairman Mark Castle for UK£75k worth of shares, at about UK£1.62 per share. That means that an insider was happy to buy shares at above the current price of UK£1.26. While their view may have changed since the purchase was made, this does at least suggest they have had confidence in the company's future. To us, it's very important to consider the price insiders pay for shares. Generally speaking, it catches our eye when insiders have purchased shares at above current prices, as it suggests they believed the shares were worth buying, even at a higher price.\n\nWhile Eleco insiders bought shares during the last year, they didn't sell. You can see the insider transactions (by companies and individuals) over the last year depicted in the chart below. If you click on the chart, you can see all the individual transactions, including the share price, individual, and the date!\nCheck out our latest analysis for Eleco\nThere are plenty of other companies that have insiders buying up shares. You probably do not want to miss this free list of undervalued small cap companies that insiders are buying.\nInsider Ownership Many investors like to check how much of a company is owned by insiders. Usually, the higher the insider ownership, the more likely it is that insiders will be incentivised to build the company for the long term. It appears that Eleco insiders own 20% of the company, worth about UK£21m. This level of insider ownership is good but just short of being particularly stand-out. It certainly does suggest a reasonable degree of alignment.\n\nSo What Do The Eleco Insider Transactions Indicate? There haven't been any insider transactions in the last three months -- that doesn't mean much. But insiders have shown more of an appetite for the stock, over the last year. Insiders own shares in Eleco and we see no evidence to suggest they are worried about the future. Of course, the future is what matters most . So if you are interested in Eleco, you should check out this free report on analyst forecasts for the company .\n\nStory Continues\nOf course, you might find a fantastic investment by looking elsewhere. So take a peek at this free list of interesting companies.\nFor the purposes of this article, insiders are those individuals who report their transactions to the relevant regulatory body. We currently account for open market transactions and private dispositions of direct interests only, but not derivative transactions or indirect interests.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-04",
      "Time": "16:40:02",
      "Source": "Investing.com",
      "Title": "Which S&P 500 sectors do you want to own into 2026? BofA answers",
      "URL": "https://finance.yahoo.com/news/p-500-sectors-want-own-084002159.html",
      "Content": "Which S&P 500 sectors do you want to own into 2026? BofA answers\n\nSam Boughedda\nSun, January 4, 2026 at 12:40 AM PST 1 min read\n\nIn this article: BAC\n\nXLRE\n\nXLV\n\nInvesting.com -- In a note to clients this week, analysts at Bank of America highlighted the sectors it model believes investors should own into 2026.\nThe bank told investors to prioritise Health Care and Real Estate, arguing that both sectors now screen as attractive on valuation and momentum metrics.\n\nBofA writes that its Momentum and Value model “now ranks Health Care as #1 and Real Estate as #3 – and we are overweight both sectors … for investors with a medium term (~12m) outlook.”\nThe bank adds that it is market-weight Technology, which ranks second this month.\nThe appeal of Health Care and Real Estate is said ot be partly down to valuation support.\nThe note states the two sectors “are inexpensive relative to historical market multiples.”\nBut the bank emphasises that cheapness alone is not the only driver. It highlights “positive trends in revisions compared to the broader market, plus a three month run of outperformance,” which together “indicate good value.”\nBy contrast, BofA is more cautious on Consumer Staples despite being overweight the sector in its strategy work.\nBofA warns it may be “less likely to rally in the near-term” because it currently “screens as a ‘Value Trap’ – cheap only because its relative price has fallen faster than analysts have cut earnings estimates.”\nRelated articles\nWhich S&P 500 sectors do you want to own into 2026? BofA answers\nThese Under-$10 Stocks Are Up 100%+ This Quarter - And Some Still Have Room to Run\n3 Strategies to Make the Most of Dow's Record-Breaking Run\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-04",
      "Time": "16:35:00",
      "Source": "Motley Fool",
      "Title": "Down 10%, Should You Buy the Dip on Palantir?",
      "URL": "https://finance.yahoo.com/m/f531b93e-1486-38d8-8388-8e2d13dd2299/down-10%25%2C-should-you-buy-the.html",
      "Content": "Down 10%, Should You Buy the Dip on Palantir?\n\nPatrick Sanders, The Motley Fool\nSun, January 4, 2026 at 12:35 AM PST 5 min read\n\nIn this article: PLTR\n\nKey Points Palantir's unique artificial intelligence (AI) platforms give it a key advantage over other data companies.\nThe stock has a high valuation, but it is also attracting clients at a breathtaking pace.\n10 stocks we like better than Palantir Technologies ›\nPalantir Technologies (NASDAQ: PLTR) , the data analytics company revolutionizing both government and commercial businesses with its powerful artificial intelligence (AI)-powered insights, reached all-time highs multiple times in 2025. It was another very good year for the company, which now sports a market capitalization of roughly $440 billion.\n\nBut as AI companies saw some downward pressure in the fourth quarter, Palantir's stock suffered as well. Shares are trading about 10% below their all-time highs, and Palantir heads into 2026 with muted momentum.\nShould investors give Palantir another look in advance of the fourth-quarter and full-year earnings report, which is likely to drop in early February? Or is the bloom starting to fade from Palantir stock?\nWhat makes Palantir unique? Palantir embraces being different -- the company promotes that it was created more than two decades ago because it identified software platforms that it said were too rigid and difficult to maintain or improve. \"We saw a need for a different kind of technology,\" management says on its website.\n\nPalantir's solution is its innovative platforms that draw in information from thousands of data points simultaneously. It has integrated artificial intelligence into its Foundry and Gotham platforms, and uses AI agents to automate decisions, analyze situations, and suggest solutions.\nThe Foundry platform is designed for commercial clients, helping them to make decisions, simplify workflows, automate processes, and manage supply chains. The Gotham platform is primarily used for government work, including by military units and intelligence agencies, to provide real-time tactical information.\nBoth platforms are integrated with Palantir's Artificial Intelligence Platform (AIP), which allows users to quickly build workflows and perform actions with minimal training -- allowing new customers to adapt to the platform quickly.\n\nAll that gives Palantir a key advantage over contractors such as BigBear.ai , which creates custom software solutions for its government clients. Because Palantir's platform is more adaptable, Palantir is able to sign up new clients much faster than BigBear.ai -- and bring in more revenue.\nPalantir's revenue is soaring Palantir's business model has allowed it to scale exceptionally fast -- particularly after it launched the AIP platform in April 2023. Since then, the company's quarterly revenue more than doubled to $1.18 billion, and it started turning a quarterly profit for the first time.\n\nStory Continues\nThird-quarter revenue was up 63% from a year ago, and net income of $476 million translates to a 40% profit margin.\nMore tellingly, Palantir is signing on average more than one deal per day that's valued at more than $1 million. In the third quarter, it brought in 204 such deals, with 91 of them valued at least $5 million and 53 valued at least $10 million.\n\nU.S. government revenue remains the largest component of Palantir's business, accounting for $486 million in revenue during the quarter, a 52% increase from the same period last year. But the commercial business is growing even faster, with U.S. commercial revenue of $397 million, up 121% from the previous year.\nThe downside -- if you can call it that -- to Palantir's rapid growth is that its valuation is completely unsustainable. Palantir's forward price-to-earnings ratio of 254 and the forward price-to-sales ratio of 99 have been steadily increasing during 2025. There are plenty of Palantir bears who would argue Palantir is a dangerous stock for investors because it appears destined for a correction.\nWhy I still like Palantir today I remember when Amazon (NASDAQ: AMZN) was much like Palantir. More than a decade ago, Amazon had a P/E of more than 240, and analysts at the time predicted the stock's demise.\nBut it never happened -- sure, Amazon had its losing streaks, such as during the COVID-19 pandemic, but in general, the stock market misjudged Amazon because it didn't yet understand the vast potential of the e-commerce giant. And since then, Amazon's stock has continued to climb, and the P/E ratio stabilized.\nI believe that Palantir is experiencing the same phenomenon. Its AIP platform is a true game changer that has allowed Palantir to quickly bring AI-powered insights to hundreds of companies. And I think that's just beginning.\nWhen Palantir next files its earnings report, I expect the stock to take another leap higher and for the company's rapid growth to continue. That's why Palantir stock is still a buy for me, even though it's 10% off its all-time highs. It won't be down for long.\n\nShould you buy stock in Palantir Technologies right now? Before you buy stock in Palantir Technologies, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Palantir Technologies wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $490,703 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,157,689 !*\nNow, it’s worth noting Stock Advisor’s total average return is 966 % — a market-crushing outperformance compared to 194% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of January 4, 2026.\nPatrick Sanders has positions in Palantir Technologies. The Motley Fool has positions in and recommends Amazon and Palantir Technologies. The Motley Fool has a disclosure policy .\nDown 10%, Should You Buy the Dip on Palantir? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-04",
      "Time": "16:34:41",
      "Source": "Simply Wall St.",
      "Title": "Capital Allocation Trends At InnoTec TSS (FRA:TSS) Aren't Ideal",
      "URL": "https://finance.yahoo.com/news/capital-allocation-trends-innotec-tss-083441405.html",
      "Content": "Capital Allocation Trends At InnoTec TSS (FRA:TSS) Aren't Ideal\n\nSimply Wall St\nSun, January 4, 2026 at 12:34 AM PST 2 min read\n\nIn this article: TSS.F\n\nWhen it comes to investing, there are some useful financial metrics that can warn us when a business is potentially in trouble. When we see a declining return on capital employed (ROCE) in conjunction with a declining base of capital employed, that's often how a mature business shows signs of aging. Basically the company is earning less on its investments and it is also reducing its total assets. In light of that, from a first glance at InnoTec TSS ( FRA:TSS ), we've spotted some signs that it could be struggling, so let's investigate.\n\nAI is about to change healthcare. These 20 stocks are working on everything from early diagnostics to drug discovery. The best part - they are all under $10bn in marketcap - there is still time to get in early.\nWhat Is Return On Capital Employed (ROCE)? For those that aren't sure what ROCE is, it measures the amount of pre-tax profits a company can generate from the capital employed in its business. To calculate this metric for InnoTec TSS, this is the formula:\nReturn on Capital Employed = Earnings Before Interest and Tax (EBIT) ÷ (Total Assets - Current Liabilities)\n0.082 = €8.0m ÷ (€115m - €17m) (Based on the trailing twelve months to June 2025) .\nTherefore, InnoTec TSS has an ROCE of 8.2%. Ultimately, that's a low return and it under-performs the Building industry average of 10%.\nCheck out our latest analysis for InnoTec TSS\nWhile the past is not representative of the future, it can be helpful to know how a company has performed historically, which is why we have this chart above. If you want to delve into the historical earnings , check out these free graphs detailing revenue and cash flow performance of InnoTec TSS .\nWhat Does the ROCE Trend For InnoTec TSS Tell Us? There is reason to be cautious about InnoTec TSS, given the returns are trending downwards. To be more specific, the ROCE was 13% five years ago, but since then it has dropped noticeably. Meanwhile, capital employed in the business has stayed roughly the flat over the period. This combination can be indicative of a mature business that still has areas to deploy capital, but the returns received aren't as high due potentially to new competition or smaller margins. If these trends continue, we wouldn't expect InnoTec TSS to turn into a multi-bagger.\n\nThe Bottom Line On InnoTec TSS' ROCE All in all, the lower returns from the same amount of capital employed aren't exactly signs of a compounding machine. And long term shareholders have watched their investments stay flat over the last five years. With underlying trends that aren't great in these areas, we'd consider looking elsewhere.\n\nStory Continues\nInnoTec TSS does come with some risks though, we found 3 warning signs in our investment analysis, and 1 of those doesn't sit too well with us...\nWhile InnoTec TSS isn't earning the highest return, check out this free list of companies that are earning high returns on equity with solid balance sheets.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-04",
      "Time": "16:26:05",
      "Source": "Simply Wall St.",
      "Title": "Here's What's Concerning About Water Intelligence's (LON:WATR) Returns On Capital",
      "URL": "https://finance.yahoo.com/news/heres-whats-concerning-water-intelligences-082605650.html",
      "Content": "Here's What's Concerning About Water Intelligence's (LON:WATR) Returns On Capital\n\nSimply Wall St\nSun, January 4, 2026 at 12:26 AM PST 2 min read\n\nIn this article: WTLLF\n\nWhat trends should we look for it we want to identify stocks that can multiply in value over the long term? Firstly, we'll want to see a proven return on capital employed (ROCE) that is increasing, and secondly, an expanding base of capital employed. If you see this, it typically means it's a company with a great business model and plenty of profitable reinvestment opportunities. However, after briefly looking over the numbers, we don't think Water Intelligence ( LON:WATR ) has the makings of a multi-bagger going forward, but let's have a look at why that may be.\n\nWe've found 21 US stocks that are forecast to pay a dividend yield of over 6% next year. See the full list for free.\nUnderstanding Return On Capital Employed (ROCE) Just to clarify if you're unsure, ROCE is a metric for evaluating how much pre-tax income (in percentage terms) a company earns on the capital invested in its business. Analysts use this formula to calculate it for Water Intelligence:\nReturn on Capital Employed = Earnings Before Interest and Tax (EBIT) ÷ (Total Assets - Current Liabilities)\n0.069 = US$7.2m ÷ (US$121m - US$17m) (Based on the trailing twelve months to June 2025) .\nSo, Water Intelligence has an ROCE of 6.9%. Ultimately, that's a low return and it under-performs the Commercial Services industry average of 9.4%.\nView our latest analysis for Water Intelligence\nIn the above chart we have measured Water Intelligence's prior ROCE against its prior performance, but the future is arguably more important. If you'd like to see what analysts are forecasting going forward, you should check out our free analyst report for Water Intelligence .\nSo How Is Water Intelligence's ROCE Trending? On the surface, the trend of ROCE at Water Intelligence doesn't inspire confidence. Over the last five years, returns on capital have decreased to 6.9% from 12% five years ago. However, given capital employed and revenue have both increased it appears that the business is currently pursuing growth, at the consequence of short term returns. If these investments prove successful, this can bode very well for long term stock performance.\n\nThe Bottom Line On Water Intelligence's ROCE Even though returns on capital have fallen in the short term, we find it promising that revenue and capital employed have both increased for Water Intelligence. These growth trends haven't led to growth returns though, since the stock has fallen 42% over the last five years. As a result, we'd recommend researching this stock further to uncover what other fundamentals of the business can show us.\n\nStory Continues\nWater Intelligence does have some risks though, and we've spotted 1 warning sign for Water Intelligence that you might be interested in.\nIf you want to search for solid companies with great earnings, check out this free list of companies with good balance sheets and impressive returns on equity.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-04",
      "Time": "16:23:00",
      "Source": "Cryptonews",
      "Title": "Bitcoin Holds Near $90K Despite US–Venezuela Military Shock",
      "URL": "https://finance.yahoo.com/m/1dfb1168-feba-3709-ae60-5e57e48230e1/bitcoin-holds-near-%2490k.html",
      "Content": "Bitcoin Holds Near $90K Despite US–Venezuela Military Shock BTC staying above its 21-day moving average signals short-term support and potential January upside.\n\nAmin Ayan\nSun, January 4, 2026 at 12:23 AM PST 3 min read\n\nIn this article: BTC-USD\n\nThe price of Bitcoin held near the $90,000 level on Saturday, even as geopolitical tensions between the United States and Venezuela escalated sharply following overnight military action.\nKey Takeaways:\nBitcoin held near $90K despite a major US–Venezuela military escalation that dominated headlines.\nBTC staying above its 21-day moving average signals short-term support and potential January upside.\nAnalysts warn volatility could rise once institutional traders return when US markets reopen.\n\nBitcoin briefly dipped below $90,000 in early trading before recovering, showing limited reaction to an event that dominated global headlines.\n“The US bombed a country and captured its leader, on a weekend no less, and yet Bitcoin has barely moved,” said Nic Puckrin , founder of crypto media firm Coin Bureau, in a post on X.\nBitcoin’s Calm Amid Geopolitical Shock Puts Focus on Key Support Level The muted response stood out in a market where risk assets often see sharp sell-offs during geopolitical crises.\nFrom a technical perspective, analysts point to encouraging signals. Michaël van de Poppe noted that Bitcoin remains above its 21-day moving average, a level often viewed as short-term support.\n\nHolding above that threshold could open the door to further price gains in January, assuming broader market conditions remain stable.\nThe resilience is notable given Bitcoin’s recent volatility.\nHistorically, sudden geopolitical shocks or macroeconomic stress have triggered abrupt drawdowns in risk-on assets, including cryptocurrencies. This time, the response has been restrained, at least so far.\nThe situation stems from an announcement by US President Donald Trump, who confirmed airstrikes on Venezuela’s capital, Caracas, that led to the capture of Venezuelan President Nicolás Maduro.\nWhile the news sparked intense debate online, financial markets appeared largely unfazed over the weekend.\nSome analysts caution that the calm may not last. “There’s a lot of geopolitical tension, and next week the big players will return,” said crypto trader Lennaert Snyder, warning that volatility could increase once traditional markets reopen.\n\nInstitutional investors typically sit out weekends, meaning reactions may still come when US markets open on Monday.\nAny renewed selling pressure would add to Bitcoin’s recent corrective phase. After a flash crash in October, Bitcoin fell more than 30% from an all-time high above $125,000 to around $80,000 in November, before rebounding toward current levels.\nBitcoin Seen Entering Accumulation Phase in Early 2026 Analyst Linh Tran believes Bitcoin entered a corrective phase in late 2025 after peaking near $126,000 and falling roughly 35% to around $80,000.\n\nStory Continues\nIn a note shared with Cryptonews.com, she said this pullback reflects a structural shift in the market, with Bitcoin now driven less by retail speculation and more by macroeconomic conditions, institutional flows, and regulatory developments.\nMeanwhile, Abra CEO Bill Barhydt believes Bitcoin could benefit in 2026 as easing monetary policy injects fresh liquidity into global markets, reviving risk appetite after a prolonged period of tight financial conditions.\nBarhydt said the US central bank is already laying the groundwork for looser policy.\nHe pointed to early signs of renewed balance sheet support, describing the current environment as “quantitative easing light,” with the Federal Reserve stepping in to support demand for government debt.\nRead original story Bitcoin Holds Near $90K Despite US–Venezuela Military Shock by Amin Ayan at Cryptonews.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "05:53:53",
      "Source": "MT Newswires",
      "Title": "US Equities Fall in Final 2025 Session; Indexes Still Post Solid Annual Gains",
      "URL": "https://finance.yahoo.com/news/us-equities-fall-final-2025-215353579.html",
      "Content": "PREMIUM\nUS Equities Fall in Final 2025 Session; Indexes Still Post Solid Annual Gains\n\nMT Newswires\nWed, December 31, 2025 at 1:53 PM PST 2 min read\n\nIn this article: ^DJI\n\nTDG\n\nGFS\n\n^SPX\n\nAXSM\n\nUS equity benchmarks fell Wednesday in the final session of 2025 as stock gauges still logged solid\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "04:59:33",
      "Source": "MT Newswires",
      "Title": "Sector Update: Tech Stocks Fall Late Afternoon",
      "URL": "https://finance.yahoo.com/news/sector-tech-stocks-fall-afternoon-205933305.html",
      "Content": "PREMIUM\nSector Update: Tech Stocks Fall Late Afternoon\n\nMT Newswires\nWed, December 31, 2025 at 12:59 PM PST 1 min read\n\nIn this article: MSFT\n\nTDG\n\nGFS\n\nTSM\n\nXLK\n\nTech stocks declined late Wednesday afternoon with the State Street Technology Select Sector SPDR ET\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "02:56:44",
      "Source": "MT Newswires",
      "Title": "Sector Update: Tech Stocks Lower in Wednesday Afternoon Trading",
      "URL": "https://finance.yahoo.com/news/sector-tech-stocks-lower-wednesday-185644869.html",
      "Content": "PREMIUM\nSector Update: Tech Stocks Lower in Wednesday Afternoon Trading\n\nMT Newswires\nWed, December 31, 2025 at 10:56 AM PST 1 min read\n\nIn this article: TSM\n\nGFS\n\nNVDA\n\nXLK\n\nTDG\n\nTech stocks declined Wednesday afternoon, with the State Street Technology Select Sector SPDR ETF (X\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "02:54:26",
      "Source": "MT Newswires",
      "Title": "US Equities Fall Intraday as Losing Streak Grows But Wall Street Eyes 2025 Gains",
      "URL": "https://finance.yahoo.com/news/us-equities-fall-intraday-losing-185426569.html",
      "Content": "PREMIUM\nUS Equities Fall Intraday as Losing Streak Grows But Wall Street Eyes 2025 Gains\n\nMT Newswires\nWed, December 31, 2025 at 10:54 AM PST 2 min read\n\nIn this article: ^GSPC\n\n^DJI\n\n^IXIC\n\nNVDA\n\nUS equity benchmarks were lower intraday with 2025 drawing to a close amid a four-day run of losses,\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "02:18:29",
      "Source": "MT Newswires",
      "Title": "Sector Update: Tech",
      "URL": "https://finance.yahoo.com/news/sector-tech-181829035.html",
      "Content": "PREMIUM\nSector Update: Tech\n\nMT Newswires\nWed, December 31, 2025 at 10:18 AM PST 1 min read\n\nIn this article: GFS\n\nXLK\n\nTech stocks were lower Wednesday afternoon, with the State Street Technology Select Sector SPDR ETF\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "00:07:47",
      "Source": "GuruFocus.com",
      "Title": "Wedbush Downgrades GlobalFoundries on Timing",
      "URL": "https://finance.yahoo.com/news/wedbush-downgrades-globalfoundries-timing-160747604.html",
      "Content": "Wedbush Downgrades GlobalFoundries on Timing\n\nMoz Farooque ACCA\nWed, December 31, 2025 at 8:07 AM PST 1 min read\n\nIn this article: GFS\n\nThis article first appeared on GuruFocus .\nGlobalFoundries ( NASDAQ:GFS ) got knocked around Wednesday after Wedbush basically said the chip slowdown isn't over yet, and that patience is going to be required.\nWedbush cut the stock to Neutral and lowered its price target to $40, which pushed shares about 2.2% lower in premarket trading. The key issue isn't that the long-term story is broken. It's timing. Analyst Matt Bryson said the recovery GlobalFoundries needs is taking longer than expected, and investors shouldn't expect a quick turnaround.\n\nWarning! GuruFocus has detected 3 Warning Sign with GFS.\nIs GFS fairly valued? Test your thesis with our free DCF calculator.\nDemand is the problem right now. Smartphone makers are cutting build plans as rising memory prices push costs higher and buyers get more cautious. Industrial and auto demand isn't helping either, with no clear rebound in sight. That matters because about half of GlobalFoundries' revenue comes from those areas.\nThere are still positives. Its U.S. and European footprint is a real advantage, and margins are holding up better than expected. But for now, this is a waiting game, not a momentum story.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "23:23:39",
      "Source": "MT Newswires",
      "Title": "GlobalFoundries Faces Longer Timeframe for Catalysts Like Improved End Market to Play Out, Wedbush Says",
      "URL": "https://finance.yahoo.com/news/globalfoundries-faces-longer-timeframe-catalysts-152339713.html",
      "Content": "PREMIUM\nGlobalFoundries Faces Longer Timeframe for Catalysts Like Improved End Market to Play Out, Wedbush Says\n\nMT Newswires\nWed, December 31, 2025 at 7:23 AM PST 1 min read\n\nIn this article: GFS\n\nGlobalFoundries (GFS) faces an elongated timeframe around when catalysts like an improved end market\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "22:36:47",
      "Source": "The Fly",
      "Title": "GlobalFoundries downgraded, TeraWulf upgraded: Wall Street's top analyst calls",
      "URL": "https://finance.yahoo.com/news/globalfoundries-downgraded-terawulf-upgraded-wall-143647653.html",
      "Content": "GlobalFoundries downgraded, TeraWulf upgraded: Wall Street's top analyst calls\n\nThe Fly\nWed, December 31, 2025 at 6:36 AM PST 3 min read\n\nIn this article: WULF\n\nDBRG-PH\n\nDBRG-PI\n\nDBRG-PJ\n\nGFS\n\nThe most talked about and market moving research calls around Wall Street are now in one place. Here are today's research calls that investors need to know, as compiled by The Fly.\n\nTop Upgrades:\n\nKeefe Bruyette upgraded TeraWulf (WULF) to Outperform from Market Perform with a price target of $24, up from $9.50. The firm believes investors are underestimating the magnitude of TeraWulf's bitcoin mining to high performance compute leasing mix shift in 2026 and 2027.\nClear Street upgraded Plug Power (PLUG) to Buy from Hold with a price target of $3, down from $3.50. The firm sees more attractive upside in the shares following the recent selloff. It cites dilution from Plug Power's convertible refinancing in late November for the target drop.\n\nTop Downgrades:\n\nWedbush downgraded GlobalFoundries (GFS) to Neutral from Outperform with a price target of $40, down from $42. While the firm believes that GlobalFoundries has a path to a model with stronger revenues, improved utilization, and better margins on improved end market fundamentals and a shift towards local supply chains, it also believes recent developments have elongated the timeframe around when those catalysts might play out, the firm tells investors.\nWedbush downgraded Tower Semiconductor (TSEM) to Neutral from Outperform with a $125 price target. The firm cites valuation for the downgrade, noting that the stock is approaching the firm's target price and the 25-times multiple it uses to value Tower Semiconductor ostensibly already assumes some upside vs. its current estimates.\nTruist downgraded DigitalBridge (DBRG) to Hold from Buy with an unchanged price target of $16 following the announced all-cash acquisition by SoftBank Group (SFTBY) at $16 per share. The firm sees a low probability of a competing bid emerging.\nRaymond James double downgraded OceanFirst Financial (OCFC) to Market Perform from Strong Buy without a price target following the company's announcement to acquire Flushing Financial (FFIC) . The firm expects \"significant\" dilution and says the deal slows the benefit of OceanFirst's shift to a stronger core deposit franchise.\nRaymond James downgraded Flushing Financial (FFIC) to Market Perform from Outperform without a price target after the company agreed to be acquired by OceanFirst Financial (OCFC) . The deal was done at a fair price given the earnings challenges Flushing has faced due to the challenging rate environment for the past several years, the firm tells investors in a research note.\n\nTop Initiations:\n\nFreedom Capital initiated coverage of Serve Robotics (SERV) with a Buy rating and $16 price target. The firm believes Serve is positioned for \"strong growth and eventual profitability.\"\nFreedom Capital initiated coverage of International Bancshares (IBOC) with a Buy rating and $85 price target. While the bank has elevated commercial real estate concentration, interest-rate sensitivity, and exposure to cross-border activity, the firm sees these factors being balanced by strong profitability supported by \"best-in-class\" efficiency and conservative balance sheet positioning.\nFreedom Capital initiated coverage of Butterfly Network (BFLY) with a Buy rating and $5 price target. The firm sees continued revenue expansion for Butterfly, driven by iQ3 probe and enterprise software adoption.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "22:04:15",
      "Source": "MT Newswires",
      "Title": "GlobalFoundries Path to Stronger Revenue Likely to Take Time Amid Industry Challenges, Wedbush Says",
      "URL": "https://finance.yahoo.com/news/globalfoundries-path-stronger-revenue-likely-140415954.html",
      "Content": "PREMIUM\nGlobalFoundries Path to Stronger Revenue Likely to Take Time Amid Industry Challenges, Wedbush Says\n\nMT Newswires\nWed, December 31, 2025 at 6:04 AM PST 2 min read\n\nIn this article: GFS\n\nGlobalFoundries' (GFS) catalysts for stronger revenue and improved margins may take some time to mat\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "21:20:56",
      "Source": "Investing.com",
      "Title": "Wedbush downgrades GlobalFoundries: Sees ‘more elongated’ industry downturn",
      "URL": "https://finance.yahoo.com/news/wedbush-downgrades-globalfoundries-sees-more-132056656.html",
      "Content": "Wedbush downgrades GlobalFoundries: Sees ‘more elongated’ industry downturn\n\nSam Boughedda\nWed, December 31, 2025 at 5:20 AM PST 1 min read\n\nIn this article: GFS\n\nInvesting.com -- Wedbush downgraded GlobalFoundries to Neutral from Outperform in a note on Wednesday, warning that the chipmaker is facing an industry down cycle “more elongated than anticipated” and lowering its price target to $40 from $42.\nAnalyst Matt Bryson said Wedbush still believes GlobalFoundries has “a path to a better future model” driven by improved end-market fundamentals and stronger local supply chains, but recent data suggests those catalysts are further away.\n\nWedbush highlighted “near-term risk to CE device builds and particularly handset units,” citing higher costs tied to rising memory prices that are already prompting original equipment manufacturers to reduce production.\nBryson also pointed to weakness beyond consumer electronics. “Our recent checks in Taiwan suggested that industrial/auto demand remains relatively weak with no anticipation of any near-term recovery,” he wrote.\nWith around half of GlobalFoundries’ revenue linked to smart mobile devices and IoT categories, Wedbush believes the backdrop “limits near-term upside” and could create risks for its 2026 sales outlook.\nWhile the firm still views the company’s U.S. and European footprint as a strategic advantage, it stated that political momentum for domestic chip incentives has waned.\n\nWedbush noted that recently published federal guidance showed China semiconductor tariffs won’t take effect until June 2027, adding that more aggressive Section 232 measures now appear “a less probable near-term outcome.”\nBryson added that GlobalFoundries should still deliver margins “close to historically high” this quarter despite lower utilization, but added that a meaningful lift from edge AI adoption is “more likely 12+ months out.”\nRelated articles\nWedbush downgrades GlobalFoundries: Sees ‘more elongated’ industry downturn\nLoading Up HEAVY on These 3 Stocks by End of 2025 (+ 1 New ETF)\nGold: $4K Breakout Faces First Real Test as Stocks and Sentiment Rise Together\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "21:08:47",
      "Source": "MT Newswires",
      "Title": "Top Premarket Decliners",
      "URL": "https://finance.yahoo.com/news/top-premarket-decliners-130847664.html",
      "Content": "PREMIUM\nTop Premarket Decliners\n\nMT Newswires\nWed, December 31, 2025 at 5:08 AM PST\n\nIn this article: EKSO\n\nNIO\n\nGFS\n\nXPEV\n\nEkso Bionics (EKSO) shares were down 12% in recent Wednesday premarket activity, shaving Tuesday's r\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "19:55:29",
      "Source": "MT Newswires",
      "Title": "Wedbush Downgrades GlobalFoundries to Neutral From Outperform, Trims Price Target to $40 From $42",
      "URL": "https://finance.yahoo.com/news/wedbush-downgrades-globalfoundries-neutral-outperform-115529788.html",
      "Content": "PREMIUM\nWedbush Downgrades GlobalFoundries to Neutral From Outperform, Trims Price Target to $40 From $42\n\nMT Newswires\nWed, December 31, 2025 at 3:55 AM PST\n\nIn this article: GFS\n\nGlobalFoundries (GFS) has an average rating of overweight and mean price target of $39.73, according\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 22
}