{
  "stock_id": "GFS",
  "last_updated": "2025-12-31T14:12:35.052Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-31",
      "Time": "22:04:15",
      "Source": "MT Newswires",
      "Title": "GlobalFoundries Path to Stronger Revenue Likely to Take Time Amid Industry Challenges, Wedbush Says",
      "URL": "https://finance.yahoo.com/news/globalfoundries-path-stronger-revenue-likely-140415954.html",
      "Content": "PREMIUM\nGlobalFoundries Path to Stronger Revenue Likely to Take Time Amid Industry Challenges, Wedbush Says\n\nMT Newswires\nWed, December 31, 2025 at 6:04 AM PST 2 min read\n\nIn this article: GFS\n\nGlobalFoundries' (GFS) catalysts for stronger revenue and improved margins may take some time to mat\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "21:20:56",
      "Source": "Investing.com",
      "Title": "Wedbush downgrades GlobalFoundries: Sees ‘more elongated’ industry downturn",
      "URL": "https://finance.yahoo.com/news/wedbush-downgrades-globalfoundries-sees-more-132056656.html",
      "Content": "Wedbush downgrades GlobalFoundries: Sees ‘more elongated’ industry downturn\n\nSam Boughedda\nWed, December 31, 2025 at 5:20 AM PST 1 min read\n\nIn this article: GFS\n\nInvesting.com -- Wedbush downgraded GlobalFoundries to Neutral from Outperform in a note on Wednesday, warning that the chipmaker is facing an industry down cycle “more elongated than anticipated” and lowering its price target to $40 from $42.\nAnalyst Matt Bryson said Wedbush still believes GlobalFoundries has “a path to a better future model” driven by improved end-market fundamentals and stronger local supply chains, but recent data suggests those catalysts are further away.\n\nWedbush highlighted “near-term risk to CE device builds and particularly handset units,” citing higher costs tied to rising memory prices that are already prompting original equipment manufacturers to reduce production.\nBryson also pointed to weakness beyond consumer electronics. “Our recent checks in Taiwan suggested that industrial/auto demand remains relatively weak with no anticipation of any near-term recovery,” he wrote.\nWith around half of GlobalFoundries’ revenue linked to smart mobile devices and IoT categories, Wedbush believes the backdrop “limits near-term upside” and could create risks for its 2026 sales outlook.\nWhile the firm still views the company’s U.S. and European footprint as a strategic advantage, it stated that political momentum for domestic chip incentives has waned.\n\nWedbush noted that recently published federal guidance showed China semiconductor tariffs won’t take effect until June 2027, adding that more aggressive Section 232 measures now appear “a less probable near-term outcome.”\nBryson added that GlobalFoundries should still deliver margins “close to historically high” this quarter despite lower utilization, but added that a meaningful lift from edge AI adoption is “more likely 12+ months out.”\nRelated articles\nWedbush downgrades GlobalFoundries: Sees ‘more elongated’ industry downturn\nLoading Up HEAVY on These 3 Stocks by End of 2025 (+ 1 New ETF)\nGold: $4K Breakout Faces First Real Test as Stocks and Sentiment Rise Together\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "21:08:47",
      "Source": "MT Newswires",
      "Title": "Top Premarket Decliners",
      "URL": "https://finance.yahoo.com/news/top-premarket-decliners-130847664.html",
      "Content": "PREMIUM\nTop Premarket Decliners\n\nMT Newswires\nWed, December 31, 2025 at 5:08 AM PST\n\nIn this article: EKSO\n\nNIO\n\nGFS\n\nXPEV\n\nEkso Bionics (EKSO) shares were down 12% in recent Wednesday premarket activity, shaving Tuesday's r\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "19:55:29",
      "Source": "MT Newswires",
      "Title": "Wedbush Downgrades GlobalFoundries to Neutral From Outperform, Trims Price Target to $40 From $42",
      "URL": "https://finance.yahoo.com/news/wedbush-downgrades-globalfoundries-neutral-outperform-115529788.html",
      "Content": "PREMIUM\nWedbush Downgrades GlobalFoundries to Neutral From Outperform, Trims Price Target to $40 From $42\n\nMT Newswires\nWed, December 31, 2025 at 3:55 AM PST\n\nIn this article: GFS\n\nGlobalFoundries (GFS) has an average rating of overweight and mean price target of $39.73, according\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "14:37:48",
      "Source": "Simply Wall St.",
      "Title": "3 UK Stocks Estimated To Be Trading At Up To 48% Discount",
      "URL": "https://finance.yahoo.com/news/3-uk-stocks-estimated-trading-063748859.html",
      "Content": "3 UK Stocks Estimated To Be Trading At Up To 48% Discount\n\nSimply Wall St\nThu, December 25, 2025 at 10:37 PM PST 4 min read\n\nIn this article: AMS.L\n\nWIX.L\n\nGBGPF\n\n^FTSE\n\nBVHMF\n\nThe United Kingdom's stock market has recently faced challenges, with the FTSE 100 and FTSE 250 indices experiencing declines due to weak trade data from China, a key trading partner. In this environment of uncertainty, identifying undervalued stocks can be crucial for investors seeking potential opportunities, as these stocks may offer value despite broader market pressures.\n\nTop 10 Undervalued Stocks Based On Cash Flows In The United Kingdom Name\nCurrent Price\nFair Value (Est)\nDiscount (Est)\nVistry Group (LSE:VTY)\n£6.266\n£12.30\n49%\nTortilla Mexican Grill (AIM:MEX)\n£0.425\n£0.78\n45.5%\nPageGroup (LSE:PAGE)\n£2.266\n£4.51\n49.8%\nMotorpoint Group (LSE:MOTR)\n£1.34\n£2.67\n49.8%\nIbstock (LSE:IBST)\n£1.396\n£2.67\n47.7%\nGym Group (LSE:GYM)\n£1.47\n£2.94\n49.9%\nFintel (AIM:FNTL)\n£2.09\n£3.81\n45.1%\nFevertree Drinks (AIM:FEVR)\n£8.16\n£15.87\n48.6%\nAnglo Asian Mining (AIM:AAZ)\n£2.65\n£5.15\n48.6%\nAdvanced Medical Solutions Group (AIM:AMS)\n£2.175\n£4.18\n48%\n\nClick here to see the full list of 57 stocks from our Undervalued UK Stocks Based On Cash Flows screener.\nWe'll examine a selection from our screener results.\nAdvanced Medical Solutions Group Overview: Advanced Medical Solutions Group plc, with a market cap of £469.13 million, develops, manufactures, and distributes products for the surgical, woundcare, and wound-closure markets across the United Kingdom, Germany, Europe, the United States, and internationally.\nOperations: The company's revenue is primarily derived from its surgical segment, contributing £175.23 million, and its woundcare segment, which adds £45.07 million.\n\nEstimated Discount To Fair Value: 48%\nAdvanced Medical Solutions Group is trading at £2.18, significantly below its estimated fair value of £4.18, suggesting it may be undervalued based on cash flows. Despite a decrease in profit margins from 8.5% to 4.1%, the company's earnings are forecasted to grow significantly at 33.8% per year, outpacing the UK market's growth rate of 14.2%. Revenue growth is also expected to surpass the market average, indicating potential for future value realization.\nOur comprehensive growth report raises the possibility that Advanced Medical Solutions Group is poised for substantial financial growth.\nDive into the specifics of Advanced Medical Solutions Group here with our thorough financial health report.\nGB Group Overview: GB Group plc offers identity data intelligence products and services across the United Kingdom, the United States, Australia, and internationally, with a market cap of £608.22 million.\nOperations: The company's revenue is derived from three main segments: Identity (£156.59 million), Location (£86.87 million), and Global Fraud Solutions (GFS) (£37.90 million).\n\nStory continues\nEstimated Discount To Fair Value: 39.2%\nGB Group is trading at £2.57, well below its estimated fair value of £4.22, highlighting potential undervaluation based on cash flows. Despite a modest revenue growth forecast of 4.6% annually, the company's earnings are projected to grow significantly at 38.8% per year, outpacing the UK market's average growth rate of 14.2%. Recent inclusion in multiple FTSE indices and an expanded buyback plan further underscore confidence in its financial health and future prospects.\nOur expertly prepared growth report on GB Group implies its future financial outlook may be stronger than recent results.\nUnlock comprehensive insights into our analysis of GB Group stock in this financial health report.\nWickes Group Overview: Wickes Group plc is a UK-based retailer specializing in home improvement products and services with a market cap of approximately £548.54 million.\nOperations: The company generates revenue of £1.58 billion from its segment focused on retailing home improvement products and services in the UK.\n\nEstimated Discount To Fair Value: 22.5%\nWickes Group is trading at £2.36, significantly below its estimated fair value of £3.04, suggesting potential undervaluation based on cash flows. Despite a slower revenue growth forecast of 4.5% annually, earnings are expected to grow substantially at 25.6% per year, surpassing the UK market's average growth rate of 14.2%. Recent financial results show group revenue reaching £1.27 billion year-to-date, with large one-off items impacting earnings quality and a dividend not well covered by earnings.\nThe growth report we've compiled suggests that Wickes Group's future prospects could be on the up.\nClick here and access our complete balance sheet health report to understand the dynamics of Wickes Group.\nNext Steps Gain an insight into the universe of 57 Undervalued UK Stocks Based On Cash Flows by clicking here.\nAlready own these companies? Bring clarity to your investment decisions by linking up your portfolio with Simply Wall St , where you can monitor all the vital signs of your stocks effortlessly.\nMaximize your investment potential with Simply Wall St, the comprehensive app that offers global market insights for free.\n\nInterested In Other Possibilities? Explore high-performing small cap companies that haven't yet garnered significant analyst attention.\nDiversify your portfolio with solid dividend payers offering reliable income streams to weather potential market turbulence.\nFuel your portfolio with companies showing strong growth potential, backed by optimistic outlooks both from analysts and management .\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include AIM:AMS LSE:GBG and LSE:WIX.\nThis article was originally published by Simply Wall St .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "14:33:00",
      "Source": "PR Newswire",
      "Title": "Samriddhi Tripathy of Karnataka crowned KIIT NanhiPari Little Miss India 2025",
      "URL": "https://finance.yahoo.com/news/samriddhi-tripathy-karnataka-crowned-kiit-063300879.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nSamriddhi Tripathy of Karnataka crowned KIIT NanhiPari Little Miss India 2025\n\nPR Newswire\nThu, December 25, 2025 at 10:33 PM PST 2 min read\n\nBHUBANESWAR, India , Dec. 26, 2025 /PRNewswire/ -- The grand finale of the Silver Jubilee edition of KIIT NanhiPari Little Miss India ( https://kiitnanhipari.in/ ) 2025 concluded on a dazzling note at the KIIT University ( https://kiit.ac.in/ ) campus with Samriddhi Tripathy of Karnataka being crowned the KIIT NanhiPari Little Miss India 2025 champion.\nThe glittering event was held in the esteemed presence of Femina Miss India World 2024 Nikita Porwal, 1st Runner-Up Rekha Pandey, and Nandini Gupta, Femina Miss India World 2023.\nSamriddhi stood out among contestants for her style, talent, intelligence, elegance, and compassion as she took the centre stage in the 25th edition of this celebrated competition.\n\nThe first runner up title was won by Pranjal Sharma of Madhya Pradesh while P Prardhini of Telengana was adjudged the second runner up.\nDr. Achyuta Samanta, Chief Patron of KIIT NanhiPari and Founder of KIIT and KISS ( https://achyutasamanta.com/ ); Malay Mohapatra, Patron along with the other guests, crowned the winners.\nThe KIIT NanhiPari Little Miss India 2025, offered scholarships worth a total of Rs 56 lakh to the winners. The Winner received scholarships worth Rs 28 lakh, including a cash prize of Rs 10 lakh along with a 100 per cent academic fee waiver for pursuing any discipline at KIIT University. The First Runner-Up was awarded scholarships worth Rs 14 lakh, comprising a Rs 5 lakh cash prize and a 50 per cent academic fee waiver. The Second Runner-Up received scholarships worth Rs 12 lakh, including a Rs 3 lakh cash prize along with a 50 per cent academic fee waiver.\n\nSeveral contestants were also recognised with special category awards for their exceptional talent and personality. Miss Photogenic was awarded to Pranjal Sharma (Madhya Pradesh), while Sudeshna Gurung (Sikkim) won the Miss Selfie title. Miss Rapunzel went to Trisha Jain (Rajasthan) and Miss Monalisa was claimed by Khushali Gurjar (Rajasthan). Samrudhi Tripathy (Karnataka) was adjudged Miss Urvashi, and Swarnika Kholia (Odisha) received the Miss Fashion award. Miss Cinderella was conferred on Sharmistha Saikia (Assam), while Jiya Nebhani (Rajasthan) won Miss Personality. The Miss Whiz Kid title was secured by Aahana Singh Chauhan (Delhi), and Yashashree Sagarika (Odisha) was honoured with the Miss Fit award. Each category carried a cash prize of Rs 20,000.\nPhoto: https://mma.prnewswire.com/media/2851877/KIITNanhiPari_2025.jpg\nLogo: https://mma.prnewswire.com/media/2851905/KIIT_Logo.jpg\n\nView original content to download multimedia: https://www.prnewswire.com/in/news-releases/samriddhi-tripathy-of-karnataka-crowned-kiit-nanhipari-little-miss-india-2025-302649550.html\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "14:32:45",
      "Source": "Simply Wall St.",
      "Title": "Three Undiscovered Gems In The United Kingdom Market",
      "URL": "https://finance.yahoo.com/news/three-undiscovered-gems-united-kingdom-063245164.html",
      "Content": "Three Undiscovered Gems In The United Kingdom Market\n\nSimply Wall St\nThu, December 25, 2025 at 10:32 PM PST 4 min read\n\nIn this article: ^FTSE\n\nMHA.L\n\nSAG.L\n\nMSI.L\n\nBPM.L\n\nThe United Kingdom market has recently faced challenges, with the FTSE 100 and FTSE 250 indices experiencing declines due to concerns over weak trade data from China and its impact on global demand. Amidst this backdrop of uncertainty, identifying stocks that demonstrate resilience and potential for growth becomes crucial, especially those that may be undervalued or overlooked in the broader market landscape.\n\nTop 10 Undiscovered Gems With Strong Fundamentals In The United Kingdom Name\nDebt To Equity\nRevenue Growth\nEarnings Growth\nHealth Rating\nB.P. Marsh & Partners\nNA\n42.17%\n45.70%\n★★★★★★\nAndrews Sykes Group\nNA\n2.01%\n5.12%\n★★★★★★\nBioPharma Credit\nNA\n7.73%\n7.94%\n★★★★★★\nGeorgia Capital\nNA\n2.23%\n16.34%\n★★★★★★\nVectron Systems\nNA\n2.48%\n28.82%\n★★★★★★\nNationwide Building Society\n282.42%\n9.69%\n21.24%\n★★★★★☆\nLaw Debenture\n15.39%\n21.17%\n19.12%\n★★★★★☆\nFW Thorpe\n2.12%\n10.94%\n13.25%\n★★★★★☆\nDistribution Finance Capital Holdings\n9.37%\n48.09%\n66.49%\n★★★★★☆\nForesight Environmental Infrastructure\nNA\n-24.80%\n-27.25%\n★★★★★☆\n\nClick here to see the full list of 55 stocks from our UK Undiscovered Gems With Strong Fundamentals screener.\nLet's uncover some gems from our specialized screener.\nMha Simply Wall St Value Rating: ★★★★★☆\nOverview: Mha Plc provides financial and business strategy services to enterprises and individuals, with a market capitalization of £393.26 million.\nOperations: The company generates revenue primarily from the provision of professional services, amounting to £238.26 million.\n\nMha Plc, a smaller player in the UK market, has shown mixed performance recently. Despite high-quality earnings and trading at a favorable price-to-earnings ratio of 6.9x compared to the UK's 16.1x, its net profit margin dropped from 36.9% to 23.8%. The company reported sales of £121.31 million for H1 2026, up from £107.2 million last year, but net income fell significantly to £18.05 million from £44.34 million due to rising costs and strategic acquisitions like Baker Tilly South-East Europe Holdings Limited contributing only partially to revenue growth amidst broader economic challenges.\nClick here and access our complete health analysis report to understand the dynamics of Mha.\nExplore historical data to track Mha's performance over time in our Past section.\nMS INTERNATIONAL Simply Wall St Value Rating: ★★★★★★\nOverview: MS INTERNATIONAL plc, with a market cap of £243.53 million, operates globally in the design, manufacture, construction, and servicing of various engineering products and structures across multiple regions including the UK, Europe, the USA, Asia, and South America.\nOperations: The company generates revenue primarily from its Defence and Security segment (£82.45 million), followed by Forgings (£13.77 million) and Petrol Station Superstructures (£13.24 million). The Corporate Branding segment contributes £8.60 million to the overall revenue stream.\n\nStory Continues\nMS International, a nimble player in the Aerospace & Defense sector, showcases a compelling profile with its debt-free status and a price-to-earnings ratio of 16.8x, undercutting the industry average of 22.9x. Over five years, earnings have surged at an impressive annual rate of 53.2%, although last year's growth of 26.4% slightly lagged behind the industry's 28.4%. Recent developments include a $34.5 million contract with the US Navy for gun mounts, highlighting strong international ties and potential for sustained collaboration despite NAVSEA's preference for shorter contracts moving forward.\nClick here to discover the nuances of MS INTERNATIONAL with our detailed analytical health report.\nGain insights into MS INTERNATIONAL's past trends and performance with our Past report.\nScience Group Simply Wall St Value Rating: ★★★★★★\nOverview: Science Group plc is a science and technology consultancy and systems business operating in the United Kingdom, other European countries, North America, and Asia, with a market capitalization of £237.73 million.\nOperations: Science Group generates revenue primarily from Professional Services (£68.87 million) and Systems - Submarine Atmosphere Management (£31.53 million), with additional contributions from Systems - Audio Chips and Modules (£13.17 million) and Freehold Properties (£3.89 million).\n\nScience Group, a nimble player in the UK market, has seen its earnings soar by 410% over the past year, significantly outpacing the Professional Services industry's 1.7%. This impressive growth is partly due to a notable £24M one-off gain impacting recent financial results. The company seems well-positioned financially with its debt-to-equity ratio dropping from 45.4% to 11.5% over five years and holding more cash than total debt. Trading at about 10.7% below estimated fair value suggests potential for investors, although future earnings are projected to decline by an average of 60% annually over the next three years.\nNavigate through the intricacies of Science Group with our comprehensive health report here.\nEvaluate Science Group's historical performance by accessing our past performance report.\nSeize The Opportunity Unlock our comprehensive list of 55 UK Undiscovered Gems With Strong Fundamentals by clicking here.\nAlready own these companies? Link your portfolio to Simply Wall St and get alerts on any new warning signs to your stocks.\nUnlock the power of informed investing with Simply Wall St, your free guide to navigating stock markets worldwide.\n\nContemplating Other Strategies? Explore high-performing small cap companies that haven't yet garnered significant analyst attention.\nFuel your portfolio with companies showing strong growth potential, backed by optimistic outlooks both from analysts and management .\nFind companies with promising cash flow potential yet trading below their fair value .\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include AIM:MHA AIM:MSI and AIM:SAG.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "14:31:37",
      "Source": "Simply Wall St.",
      "Title": "Top 3 UK Dividend Stocks For Your Portfolio",
      "URL": "https://finance.yahoo.com/news/top-3-uk-dividend-stocks-063137152.html",
      "Content": "Top 3 UK Dividend Stocks For Your Portfolio\n\nSimply Wall St\nThu, December 25, 2025 at 10:31 PM PST 4 min read\n\nIn this article: ^FTSE\n\nLCSHF\n\nLCSHY\n\nIGGRF\n\nBZLFY\n\nAs the United Kingdom's FTSE 100 index faces headwinds due to weak trade data from China and faltering commodity prices, investors are keenly observing how these global economic shifts impact their portfolios. In such uncertain times, dividend stocks can offer a measure of stability and income, making them an attractive option for those looking to navigate market volatility while benefiting from regular payouts.\n\nTop 10 Dividend Stocks In The United Kingdom Name\nDividend Yield\nDividend Rating\nTreatt (LSE:TET)\n4.16%\n★★★★★☆\nSeplat Energy (LSE:SEPL)\n7.16%\n★★★★★☆\nRS Group (LSE:RS1)\n3.58%\n★★★★★☆\nMONY Group (LSE:MONY)\n6.83%\n★★★★★★\nKeller Group (LSE:KLR)\n3.10%\n★★★★★☆\nImpax Asset Management Group (AIM:IPX)\n7.98%\n★★★★★☆\nIG Group Holdings (LSE:IGG)\n3.60%\n★★★★★☆\nHargreaves Services (AIM:HSP)\n5.64%\n★★★★★☆\nBegbies Traynor Group (AIM:BEG)\n3.84%\n★★★★★☆\n4imprint Group (LSE:FOUR)\n4.55%\n★★★★★☆\n\nClick here to see the full list of 48 stocks from our Top UK Dividend Stocks screener.\nHere's a peek at a few of the choices from the screener.\nBunzl Simply Wall St Dividend Rating: ★★★★☆☆\nOverview: Bunzl plc is a distribution and services company operating in North America, Continental Europe, the United Kingdom, Ireland, and internationally with a market cap of £6.70 billion.\nOperations: Bunzl plc generates revenue primarily from its Packaging & Containers segment, amounting to £11.82 billion.\n\nDividend Yield: 3.6%\nBunzl's dividend payments have been volatile over the past decade, with occasional significant drops. Despite this, dividends have increased overall during this period and are well-covered by earnings and cash flows, with a payout ratio of 50.5% and a cash payout ratio of 29%. The company's dividend yield is lower than top-tier UK payers at 3.56%. Recent guidance suggests moderate revenue growth driven by acquisitions, though financial positioning includes high debt levels.\nUnlock comprehensive insights into our analysis of Bunzl stock in this dividend report.\nInsights from our recent valuation report point to the potential undervaluation of Bunzl shares in the market.\nIG Group Holdings Simply Wall St Dividend Rating: ★★★★★☆\nOverview: IG Group Holdings plc is a fintech company that operates in the online trading sector across various regions including the UK, Ireland, Asia-Pacific, Middle East, US, Europe, and emerging markets with a market cap of £4.47 billion.\nOperations: IG Group Holdings plc generates its revenue primarily from its brokerage segment, which amounts to £1.05 billion.\n\nDividend Yield: 3.6%\nIG Group Holdings has maintained stable and growing dividends over the last decade, supported by a low payout ratio of 44.4% and a cash payout ratio of 33.1%, ensuring coverage by both earnings and cash flows. The dividend yield stands at 3.6%, which is below the top UK dividend payers but reflects reliability with minimal volatility. Recent guidance indicates expected revenue growth to £1.1 billion for 2025, following a fiscal year-end change aligning with market practices.\n\nStory Continues\nDive into the specifics of IG Group Holdings here with our thorough dividend report.\nOur expertly prepared valuation report IG Group Holdings implies its share price may be lower than expected.\nLancashire Holdings Simply Wall St Dividend Rating: ★★★★☆☆\nOverview: Lancashire Holdings Limited, with a market cap of £1.52 billion, offers specialty insurance and reinsurance products through its operations in London, Bermuda, and Australia.\nOperations: Lancashire Holdings Limited generates revenue from its Insurance Segment, amounting to $173.20 million, and its Reinsurance Segment, totaling $454.20 million.\n\nDividend Yield: 14.4%\nLancashire Holdings offers a high dividend yield of 14.38%, placing it among the top UK dividend payers. However, its dividend history is marked by volatility and declines over the past decade. Despite this, dividends are well-covered by earnings with a low payout ratio of 23.6% and cash flows at a 75.3% cash payout ratio, suggesting sustainability from current operations. Recent events include an Analyst/Investor Day and a special ex-dividend date on November 5, 2025.\nClick here and access our complete dividend analysis report to understand the dynamics of Lancashire Holdings.\nOur comprehensive valuation report raises the possibility that Lancashire Holdings is priced lower than what may be justified by its financials.\nWhere To Now? Dive into all 48 of the Top UK Dividend Stocks we have identified here.\nAre these companies part of your investment strategy? Use Simply Wall St to consolidate your holdings into a portfolio and gain insights with our comprehensive analysis tools.\nStreamline your investment strategy with Simply Wall St's app for free and benefit from extensive research on stocks across all corners of the world.\n\nCurious About Other Options? Explore high-performing small cap companies that haven't yet garnered significant analyst attention.\nFuel your portfolio with companies showing strong growth potential, backed by optimistic outlooks both from analysts and management .\nFind companies with promising cash flow potential yet trading below their fair value .\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include LSE:BNZL LSE:IGG and LSE:LRE.\nThis article was originally published by Simply Wall St .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "14:25:00",
      "Source": "ACCESS Newswire",
      "Title": "Hearten AI to Release the World's First AI Relationship Coach with Built-In Somatic Tools",
      "URL": "https://finance.yahoo.com/news/hearten-ai-release-worlds-first-062500162.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nHearten AI to Release the World's First AI Relationship Coach with Built-In Somatic Tools\n\nHearten AI\nThu, December 25, 2025 at 10:25 PM PST 4 min read\n\nHearten AI integrates nervous system regulation videos directly into chat to transform how people process and heal relationship dynamics.\nHELSINKI, FI / ACCESS Newswire / December 26, 2025 / The new version of Hearten AI , now available on iOS and Android, offers a groundbreaking way to break free from toxic relationship cycles. Designed for anyone feeling trapped in recurring patterns with partners, friends, family, or colleagues, the app uses AI-assisted coaching and embedded somatic tools to help users create real emotional change. Unlike traditional therapy apps, Hearten AI isn't built for diagnosis - it's a supportive structure designed to meet people in the exact relationship difficulty they're facing, offering science-backed psychoeducation, reflective dialogue, and practical body-based exercises. The result is accessible, empathy-driven coaching without the bias or superficial advice found in generic self-help tools.\n\n\"As someone who's worked at the intersection of wellness, design thinking, and AI, my philosophy for Hearten is simple: accessible healing, personalized safety, and actionable tools,\" says founder Shanshan Gong. \"From breakup recovery to rebuilding after infidelity and shifting long-standing patterns, our roadmap is about giving people clear, guided pathways for the specific relationship challenges they are facing - not just generic advice.\"\nWho Hearten AI is for\nMany of these midlife users are not just looking for quick tips; they want to understand and actively rewire the relationship patterns that have followed them for years. They may be recovering from divorce or infidelity, juggling teenagers and aging parents, or questioning long-standing dynamics in their closest relationships. For people in this stage, a tool that only targets thoughts is not enough - they need support that reaches the nervous system, where so many of their automatic reactions and attachment patterns are stored.\n\nHearten AI's approach is grounded in growing research on the brain-body connection, which shows that emotional responses and relational habits are deeply tied to the state of the nervous system, not just to conscious thinking. Instead of asking users to simply \"think differently,\" the app is built to help them feel safer, calmer, and more regulated in the moments that matter most. This is where its embedded somatic exercises come in: short, guided practices that can be launched directly from the chat to help users downshift from fight-or-flight, reconnect with their body, and create enough internal space to choose a new response.\n\nStory Continues\nAround these tools, Hearten AI uses a framework called \"regulate, resonate, regenerate.\" First, the app helps users regulate their nervous system so they are not overwhelmed by emotion. Then it guides them to resonate more accurately with what they feel and need in a given relationship moment. Finally, it supports them in regenerating new patterns - turning insights into healthier boundaries, more honest communication, and different choices over time. By making this process available 24/7, one conversation and one somatic exercise at a time, the app aims to make meaningful change feel less like a breakthrough event and more like a series of accessible, repeatable steps.\n\nHow Hearten AI Supports Toxic Relationship Healing\nHearten AI is built for the harder side of relationship healing: breaking toxic patterns, recovering from breakups, and working through infidelity or long-standing dynamics, not just getting quick tips. It invites users to describe what happened in a difficult interaction and then guides them with structured prompts, psychoeducation, and suggestions for next steps in love, family, and work relationships.\nSomatic videos are embedded directly into the coaching chat, so users can launch short nervous-system regulation exercises at the exact moment they feel overwhelmed, shut down, or triggered. This combination of reflective conversation, science-backed guidance, and in-the-moment body-based tools turns each session into a focused mini-coaching experience that can fit into a busy day.\nThe Science Behind Somatic Relationship Coaching\nMany people stuck in toxic relationships carry unhealed attachment wounds or complex trauma from earlier in life, which show up as patterns like choosing unavailable partners, people-pleasing, or staying in one-sided relationships. These patterns live not only in thoughts but in the nervous system, which can react to conflict or intimacy as if it is still under threat.\n\nSomatic and trauma research suggests that real change comes from repeated experiences of safety and regulation, not mindset shifts alone. Hearten AI uses brief somatic exercises and just-in-time support to help users calm their system while processing painful relationship events, making it easier to practice new boundaries, communication, and choices in real time.\nWhere to Find Hearten AI\nHearten AI is available on iOS and Android .\nAbout Somabrain, the Company Behind Hearten AI\nHearten AI is developed by Somabrain, a Helsinki-based startup founded in April 2023 by relationship coach & wellness entrepreneur Shanshan Gong. Somabrain's work sits at the intersection of behavioral science, somatic practices, and AI, with a mission to make nervous-system-aware relationship support widely accessible.\n\nBefore founding Somabrain, Gong launched a web-based, gamified app in 2022 that combined somatic exercises with situational AI relationship advice, which laid the groundwork for Hearten AI's current approach. Since Somabrain's official launch, the team has focused on bringing this vision to mobile, rolling out Hearten AI on both iOS and Android so users can access somatic relationship coaching anytime, anywhere.\nMedia Contact:\nCompany: Somabrain Oy (Ltd)\nContact: Gong Shanshan\nEmail: shanshan@heartenapp.ai\nWebsite: www.heartenapp.ai\nSOURCE: Somabrain Oy (Ltd)\n\nView the original press release on ACCESS Newswire\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "14:20:00",
      "Source": "Motley Fool",
      "Title": "What Is the Smartest Quantum Computing Stock to Buy in 2026?",
      "URL": "https://finance.yahoo.com/m/be855455-62a9-32ac-b896-ea22d97f3747/what-is-the-smartest-quantum.html",
      "Content": "What Is the Smartest Quantum Computing Stock to Buy in 2026?\n\nAdam Spatacco, The Motley Fool\nThu, December 25, 2025 at 10:20 PM PST 5 min read\n\nIn this article: IONQ\n\nRGTI\n\nQBTS\n\nNVDA\n\n^GSPC\n\nKey Points Pure-play developers like IonQ, Rigetti Computing, and D-Wave Quantum are the hottest quantum computing stocks right now.\nBig tech giants are also exploring quantum computing in addition to their established generative artificial intelligence (AI) products.\nNvidia is quietly building a quantum AI ecosystem that stands to benefit, no matter which systems succeed in the long run.\n10 stocks we like better than Nvidia ›\n\nOne of the hottest pockets of the artificial intelligence (AI) realm in 2025 was quantum computing. Shares of pure-play quantum developers such as IonQ , Rigetti Computing , and D-Wave Quantum each handily trounced the S&P 500 this year.\nWhat many investors might not fully realize is that several members of the \"Magnificent Seven\" are also exploring quantum computing technology alongside their existing generative AI efforts. While Alphabet , Amazon , and Microsoft have received some notoriety around their custom quantum processors, I think there's a more lucrative opportunity hiding in plain sight.\nI'll detail how Nvidia (NASDAQ: NVDA) is quietly building a full-spectrum quantum computing suite, and explain why this could be a major catalyst for the company as the artificial intelligence (AI) infrastructure era begins.\nNvidia is laying the foundation between quantum and accelerated computing At the moment, quantum computing is an exploratory pursuit. While some businesses are assessing how the technology may be integrated within their existing AI framework, quantum technology has little use at the enterprise level today.\nAgainst this backdrop, pure-play developers are primarily focused on research and development right now. IonQ and Rigetti specialize in gate-based approaches leveraging trapped ions and superconducting techniques. D-Wave, for its part, is more niche -- focusing on quantum annealing processes for optimization tasks.\n\nThe main takeaway is that quantum pure plays are currently engaged with the actual physics behind the creation and configuration of quantum bits -- known as qubits -- within new computing architectures.\nAs mentioned, the big three cloud providers have each designed their own quantum processors -- dubbed Willow (Alphabet), Ocelot (Amazon), and Majorana (Microsoft). While quantum computing is not a meaningful contributor to their respective businesses at this time, it's clear that big tech is fascinated by how this emerging technology may eventually impact the broader AI opportunity.\nNvidia's approach is entirely different from that of its megacap counterparts, as well as the pure plays. Instead of building its own quantum computers, Nvidia is seeking to become a bridge between the software and hardware investments necessary to build these systems.\n\nStory Continues\nNvidia offers a software platform called CUDA-Q, within which developers can write applications that work across a network of CPUs, GPUs, and QPUs (quantum processing units). On the hardware side, Nvidia has built a high-speed interconnect called NVQLink. NVQLink represents a pathway for QPUs and GPUs to seamlessly communicate without straining latency and bandwidth.\n\nEssentially, Nvidia's decision to provide a software and hardware ecosystem allows programmers to easily test their AI workloads across a hybrid quantum-classical computing environment. This is a particularly smart move because it positions Nvidia to be a beneficiary regardless of which quantum processor designs or qubit architecture emerges as the market standard down the road.\nWill 2026 be a big year for Nvidia? Nvidia's growth trajectory is directly tied to the budgets of big tech. As the slope of the lines in the chart illustrate, AI hyperscalers are accelerating their capital expenditures (capex) -- suggesting that data center buildouts, networking equipment, and chip procurement remain high priorities.\nResearch from Goldman Sachs suggests that the hyperscalers alone will contribute nearly half a trillion dollars to AI infrastructure in 2026. While this is great news for Nvidia in the short term, AI infrastructure is expected to become a nearly $7 trillion opportunity by the end of the decade, according to management consulting firm McKinsey & Company.\n\nI bring this up to drive home a couple of key ideas. First, Nvidia appears well-positioned to benefit from rising data center spend going into next year. More importantly, however, AI infrastructure is shaping up to be a longer-term secular opportunity.\nGiven these dynamics, Nvidia could continue receiving outsized demand for its products as quantum computing becomes a more meaningful contributor to the broader AI narrative over the next several years. So while CUDA-Q and NVQLink may not yet be major contributors to Nvidia's business today relative to its core compute and networking services, I'm encouraged by the company's pursuit of quantum computing and see these products eventually becoming an important storyline in its evolution throughout the AI infrastructure chapter.\n\nIs Nvidia stock still a good buy? As of this writing (Dec. 22), Nvidia trades at a forward price-to-earnings (P/E) multiple of just 24. Considering Nvidia's current growth in combination with Wall Street's outlook, the stock is valued quite reasonably.\nIn my eyes, quantum computing represents just another pillar supporting Nvidia's growth arc as AI continues to dominate the market. For these reasons, I think Nvidia is headed for further valuation expansion heading into 2026 and well beyond -- making it a compelling buy-and-hold opportunity for investors with a long-term time horizon.\n\nShould you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $504,994 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,156,218 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 986 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nAdam Spatacco has positions in Alphabet, Amazon, Meta Platforms, Microsoft, and Nvidia. The Motley Fool has positions in and recommends Alphabet, Amazon, Goldman Sachs Group, IonQ, Meta Platforms, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nWhat Is the Smartest Quantum Computing Stock to Buy in 2026? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "14:19:44",
      "Source": "AFP",
      "Title": "'No winner': Kosovo snap poll unlikely to end damaging deadlock",
      "URL": "https://finance.yahoo.com/m/87ecb90f-70a2-3926-8db1-a6f771a29daa/%27no-winner%27%3A-kosovo-snap-poll.html",
      "Content": "'No winner': Kosovo snap poll unlikely to end damaging deadlock\n\nIsmet HAJDARI\nThu, December 25, 2025 at 10:19 PM PST 4 min read\n\nBefore the first vote is even cast in Kosovo's snap election on Sunday, experts predict it is unlikely to end the political crisis that has been gripping Europe's youngest country for almost a year.\nThe Balkan nation has been politically deadlocked since the inconclusive vote in February, which outgoing premier Albin Kurti's Vetevendosje (VV) party won but without enough seats to form a government.\n\nAfter months of wrangling in a stalled parliament, the caretaker prime minister is going back to the electorate in a vote that analysts say will change very little.\n\"I think that the December 28 elections will not bring any clarity,\" economist Mehmet Gjata told AFP as he predicted Kurti's party would come out on top again.\nPolitical analyst Fatime Hajdari agreed that \"chances were high\" that VV would secure the most votes, but said little else was clear.\n- Charismatic Kurti -\nIf anyone can secure a majority, Kurti, once dubbed Kosovo's Che Guevara for his radical past, has a rare record.\nHis party swept to power in 2021 in the largest electoral victory since the country's independence from Serbia in 2008, taking over 50 percent of the vote.\n\nFrom a student radical to a political prisoner, Kurti's long path to the prime ministership has made him one of the most recognisable and influential politicians in Kosovo.\nHis blend of nationalism and a reform agenda has proven popular in a country whose sovereignty is still contested by Serbia, more than two decades after its war for independence ended.\nBut Gjata says things may have changed since Kurti's last term.\n\"I'm afraid that the current political crisis will repeat itself, because VV will not get more than 50 percent of the votes,\" the economist said.\n\"We will have no winner again.\"\nThe largest opposition parties have refused to join a Kurti coalition, all but assuring a fragmented parliament.\nThe only realistic challenge to VV would be \"cooperation\" between the three major opposition parties, former foreign minister and opposition candidate Enver Hoxhaj said.\n\n\"I think that only they can offer stability,\" Hoxhaj said.\n- Popular Serb policy blamed for 'instability' -\nFor Kurti and his party, countering Serbian influence in Kosovo has long been a focus, drawing support at home but criticism abroad.\nWhen Serbian forces withdrew under NATO bombardment in 1999, it left many of its state structures in place for ethnic Serbs who live mainly in the north.\nKurti has labelled these services \"instruments of intimidation, threat and control\" and spent nearly his entire second term uprooting the system -- and angering Belgrade in the process.\n\nStory Continues\nThe resulting tensions in the north, which last flared into violence in 2023, have drawn sanctions from the European Union and caused Washington to accuse Kurti's government of increasing \"instability\".\nBut among his voters, the removal of Serbian influence remains popular, Hajdari said.\n\n\"The extension of sovereignty there is perceived by the citizens as a major success,\" Hajdari said.\nMost opposition parties avoid the issue, but the Serb List -- which contests and retains most of the ten reserved Serb seats in parliament -- regularly clashes with Kurti's agenda in the north.\nThe minor party, with close ties to Belgrade, has previously called the government's moves in the north \"ethnic cleansing\" and has said they are willing to work with other parties to keep Kurti out of power.\n- A year of 'colossal damage' -\nWithout a parliament, key international agreements have not been ratified, putting hundreds of millions of euros in assistance funds at risk.\nTwo national polls and a local election have cost one of Europe's poorest nations at least 30 million euros ($35 million) this year.\n\nOver a dozen government institutions and agencies have also been left leaderless, as the mandates of their managers expired without new ones being appointed.\nGjata said \"colossal damage\" had been done to the economy by divided lawmakers over the past months.\n\"They have put Kosovo in a state of anarchy,\" he said.\nWhile lawmakers bickered, the cost of the crisis would be felt by the Balkan nation's citizens, Hajdari warned.\n\"That is precisely why Kosovo needs a stable and functional government that would focus on development and welfare.\"\nih/al/fg\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "14:16:55",
      "Source": "AFP",
      "Title": "Culture being strangled by Kosovo's political crisis",
      "URL": "https://finance.yahoo.com/m/bd51bb6f-37e8-3e8a-9fbc-49a27ffb65c7/culture-being-strangled-by.html",
      "Content": "Culture being strangled by Kosovo's political crisis\n\nIsmet HAJDARI\nThu, December 25, 2025 at 10:16 PM PST 3 min read\n\nKosovo's oldest cinema has been dark and silent for years as the famous theatre slowly disintegrates under a leaky roof.\nSigns warn passers-by in the historic city of Prizren that parts of the Lumbardhi's crumbling facade could fall while it waits for its long-promised refurbishment.\n\"The city deserves to have the cinema renovated and preserved. Only junkies gathering there benefit from it now,\" nextdoor neighbour butcher Arsim Futko, 62, told AFP.\n\nFor seven years, it waited for a European Union-funded revamp, only for the money to be suddenly withdrawn with little explanation.\nNow it awaits similar repairs promised by the national government that has since been paralysed by inconclusive elections in February.\nAnd it is anyone's guess whether the new government that will come out of Sunday's snap election will keep the promise.\n\n- 'Collateral damage' -\nCinema director Ares Shporta said the cinema has become \"collateral damage\" in a broader geopolitical game after the EU hit his country with sanctions in 2023.\nThe delayed repairs \"affected our morale, it affected our lives, it affected the trust of the community in us,\" Shporta said.\n\nBrussels slapped Kosovo with sanctions over heightened tensions between the government and the ethnic Serb minority that live in parts of the country as Pristina pushed to exert more control over areas still tightly linked to Belgrade.\nCultural institutions have been among the hardest-hit sectors, as international funding dried up and local decisions were stalled by the parliamentary crisis.\nAccording to an analysis by the Kosovo think tank, the GAP Institute for Advanced Studies, sanctions have resulted in around 613 million euros ($719 million) being suspended or paused, with the cultural sector taking a hit of 15-million-euro hit.\n- 'Ground zero' -\nWith political stalemate threatening to drag on into another year, there are warnings that further funding from abroad could also be in jeopardy.\n\nSince February's election when outgoing premier Albin Kurti topped the polls but failed to win a majority, his caretaker government has been deadlocked with opposition lawmakers.\nMonths of delays, spent mostly without a parliament, meant little legislative work could be done.\nAhead of the snap election on Sunday, the government said that more than 200 million euros ($235 million) will be lost forever due to a failure to ratify international agreements.\nOnce the top beneficiary of the EU Growth Plan in the Balkans, Europe's youngest country now trails most of its neighbours, the NGO Group for Legal and Political Studies' executive director Njomza Arifi told AFP.\n\nStory Continues\n\"While some of the countries in the region have already received the second tranches, Kosovo still remains at ground zero.\"\nAlthough there have been some enthusiastic signs of easing a half of EU sanctions by January, Kurti's continued push against Serbian institutions and influence in the country's north continues to draw criticism from both Washington and Brussels.\n\n- 'On the edge' -\nAcross the river from the Lumbardhi, the funding cuts have also been felt at Dokufest, a documentary and short film festival that draws people to the region.\n\"The festival has had to make staff cuts. Unfortunately, there is a risk of further cuts if things don't change,\" Dokufest artistic director Veton Nurkollari said.\n\"Fortunately, we don't depend on just one source because we could end up in a situation where, when the tap is turned off, everything is turned off.\"\nHe said that many in the cultural sector were desperate for the upcoming government to get the sanctions lifted by ratification of the agreements that would allow EU funds to flow again.\n\"Kosovo is the only one left on the edge and without these funds.\"\nih/al/fg\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "14:16:38",
      "Source": "Business Insider",
      "Title": "8 million minimum wage workers are up for a raise in January. Some will hit a historic $15 milestone.",
      "URL": "https://finance.yahoo.com/m/9d5709fe-7fe3-3be7-a621-cf7db17853b9/8-million-minimum-wage.html",
      "Content": "8 million minimum wage workers are up for a raise in January. Some will hit a historic $15 milestone.\n\nJuliana Kaplan,Madison Hoff\nThu, December 25, 2025 at 10:16 PM PST 3 min read\n\nNineteen states will raise their minimum wages in January, affecting over 8 million workers.\nSix states will reach at least a $15 minimum wage for the first time, over double the federal $7.25 minimum.\nFor the first time, more workers will live in states with at least a $15 minimum wage than the federal minimum.\n\nFor workers in 19 states, New Year's won't just mean festivities and futile resolutions — they'll also be getting paid more as minimum wage increases kick in. For some, those raises will be historic: In six states, the minimum wage will reach at least $15 an hour for the first time.\nThe 19 states hiking wages will impact over 8 million workers, an analysis from the Economic Policy Institute, a left-leaning think tank, found. Women, Black, and Hispanic workers are set to be disproportionately affected by the new increases, per EPI's analysis, and workers in states like Missouri and Nebraska will see their annual wages increase by nearly $1,000 on average.\nThe map below shows which states are set for a raise in January, and what those increases will be. Most January increases are due to inflation adjustments , although some are tied to legislation or ballot measures, such as in Rhode Island , where legislation set a gradual increase from $15 in 2025 to $17 by 2027. The minimum wage there will reach $16 on January 1, 2026. A few states will hike their minimum wage later this year; Florida will increase its minimum by a dollar to $15 at the end of September.\n\nThe new round of raises will hit an \"important milestone for the minimum wage movement,\" according to EPI's Sebastian Martinez Hickey.\n\"What's really distinctive is that for the first time this January, there are going to be more workers that live in a state with at least a $15 minimum wage compared to those that live in a state with the federal minimum wage, which is still $7.25,\" Hickey said.\n\nHowever, the fresh round of statewide increases means an even greater discrepancy in some local wages and the federal minimum wage . The majority of states have stepped in to increase their pay beyond the federal minimum, although 20 states still either mandate $7.25 or default to the federal line.\nYannet Lathrop, a senior researcher and policy analyst at the National Employment Law Project, said that while the new spate of $15 minimum wages will likely be a boon for many — and reflects a long history of organizing — workers will still contend with affordability concerns.\n\"Even these wages, as good as they are, as positive as they are for workers, none of them are going to fully cover the cost of living for even single workers without families in any state or locality,\" Lathrop said. \"These workers are still going to be facing a crisis of affordability. It's just that in some places where minimum wages are going up much more, the pain of that gap between what the cost of living is and what the minimum wage is going to be a little bit better for workers.\"\n\nStory Continues\nAs states opt to hike pay on their own, a federal minimum increase still looks unlikely. Democrats failed to garner any Republican support for an effort to raise the minimum wage to $15 during President Joe Biden's term. President Donald Trump had previously opened the door to raising the wage beyond $7.25, but there has been no legislative movement toward making that a reality.\nAre you set to be affected by a minimum wage increase, or currently make the minimum wage? Contact these reporters at jkaplan@businessinsider.com and mhoff@businessinsider.com .\nRead the original article on Business Insider\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "14:14:16",
      "Source": "AFP",
      "Title": "Main contenders in Kosovo's snap election",
      "URL": "https://finance.yahoo.com/m/f877b845-e55b-33db-97f6-ad8a82bca0de/main-contenders-in-kosovo%27s.html",
      "Content": "Main contenders in Kosovo's snap election\n\nIsmet HAJDARI\nThu, December 25, 2025 at 10:14 PM PST 4 min read\n\nKosovo is heading for early elections Sunday after months of political deadlock and failure to form a government -- the only solution its deeply divided parties could agree on to break the stalemate.\nHere are the main contenders to be the Balkan nation's next prime minister:\n- Albin Kurti: eyeing fourth win -\n\nKosovo's caretaker prime minister, Albin Kurti, is widely seen as the unbeatable frontrunner in the race—even after a year of political paralysis during which he failed to form a coalition.\nIf he wins, it will mark the fourth consecutive time the 50-year-old left-wing leader has crossed the finish line first, securing his position at the helm of the small, landlocked country.\nKurti has left nothing to chance, pouring enormous energy into a two-week snap election campaign, travelling extensively and lobbying across the country.\nOnce nicknamed \"Che Guevara\" for his youthful radicalism, Kurti boasts long political experience rooted in Kosovo's independence movement during the war-torn 1990s and later in parliament.\nAfter a brief first term as prime minister from February to June 2020, Kurti's party, Vetevendosje (VV) -- which blends a leftist agenda with fervent nationalism -- won the 2021 snap elections with over half the vote.\n\nHe then became the first prime minister to complete a full term since Kosovo's independence. However, in February's election, his party fell short of the numbers needed to govern alone and failed to secure a coalition partner, triggering months of deadlock that ultimately led to Sunday's snap vote.\nKurti and VV still enjoy strong voter support, thanks largely to their reformist and anti-corruption platform. But if Kurti wins on Sunday, he will face intense international pressure to revive dialogue with Serbian President Aleksandar Vucic on normalizing relations between the two neighbours.\n- Bedri Hamza: the challenger -\nBedri Hamza, a former central bank governor and newly elected president of the Democratic Party of Kosovo (PDK), is seen as Kurti's strongest challenger.\n\nBorn out of a guerrilla movement during the war against rule from Belgrade, the PDK dominated Kosovo's political scene for years, riding the wave of wartime popularity. But its influence gradually waned as the country moved beyond the conflict.\nThe party has since reinvented itself with figures like Hamza, who blends national values with liberal economic policies championing free markets, economic growth, a stronger private sector and social protection.\nThe 62-year-old graduated from the Faculty of Economics at the University of Pristina and began his career in the late 1980s as head of accounting and finance at a lead metallurgy plant in Mitrovica.\n\nStory Continues\nMore than three decades later, Hamza returned to the ethnically divided city as mayor of its Albanian-majority south. His tenure is remembered for successfully implementing multi-ethnic projects with the Serb-majority north, including regulating the Ibar River. If elected prime minister, this experience could prove invaluable in building trust with Kosovo's Serb minority, which remains loyal to Belgrade.\n\nA prominent economist, Hamza has served as finance minister, central bank governor and has been a three-term MP.\nKnowing that in pro-American Kosovo, political ambitions often hinge on US support, Hamza's first major move after announcing his candidacy was a trip to Washington, where he met senior US officials.\nGenerally regarded as a man of integrity, Hamza declared after his election as PDK leader that the party \"is ready for victory\".\n- Lumir Abdixhiku: young pretender -\nLumir Abdixhiku is the youngest candidate for prime minister but leads the country's oldest political party, the Democratic League of Kosovo (LDK).\nThe 42-year-old economist was an academic focusing on tax evasion in transition economies before entering politics and served as Kosovo's infrastructure minister.\n\nAbdixhiku also spent several years as a newspaper columnist, penning the well-known \"Letters from Limbo\" column in the daily Koha Ditore.\nHe became LDK leader in 2021, just a month after the party suffered a crushing parliamentary defeat. Abdixhiku pledged reform and delivered, replacing much of its leadership with younger activists. Now the third-largest party in parliament, the LDK could play kingmaker in these elections, as both left and right seek its support for a coalition.\nAbdixhiku declared that LDK aims to \"take the leadership of Kosovo\" and offer \"a dignified and European government\" if it wins.\nih/fg\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 14
}