{
  "stock_id": "GFS",
  "last_updated": "2025-12-25T13:15:50.267Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-24",
      "Time": "06:02:12",
      "Source": "Barchart",
      "Title": "Stocks See Support from Economic Confidence After Strong US GDP Report",
      "URL": "https://finance.yahoo.com/m/55668af0-8c4d-3d96-8f74-ac9a96110cc7/stocks-see-support-from.html",
      "Content": "Stocks See Support from Economic Confidence After Strong US GDP Report\n\nRich Asplund\nTue, December 23, 2025 at 2:02 PM PST 4 min read\n\nIn this article: ^GSPC\n\n^IXIC\n\n^DJI\n\n^NDX\n\nThe S&P 500 Index ($SPX) (SPY) on Tuesday rose +0.46%, the Dow Jones Industrials Index ($DOWI) (DIA) rose +0.16%, and the Nasdaq 100 Index ($IUXX) (QQQ) rose +0.50%. March E-mini S&P futures (ESH26) rose +0.42%, and March E-mini Nasdaq futures (NQH26) rose +0.49%.\nStock indexes closed higher on Tuesday on reinforced confidence in US economic fundamentals after the stronger-than-expected US Q3 GDP report of +4.3%, although most of the other economic reports were weaker-than-expected. In any case, stocks were undercut as the odds for a Fed rate cut at the next meeting on Jan 27-28 dropped to 13% from 20%. Also, the 10-year T-note yield rose slightly.\n\nMore News from Barchart Will Tesla Stock Lose Its ‘Elon Musk Premium’ After the SpaceX IPO? And You Should Sell TSLA Here?\n‘Top Pick’ Amazon Had a Dismal Year: What’s AMZN Stock’s Forecast for 2026?\nApple Just Released a New AI Model. Should You Buy AAPL Stock Here?\nStop Missing Market Moves: Get the FREE Barchart Brief – your midday dose of stock movers, trending sectors, and actionable trade ideas, delivered right to your inbox. Sign Up Now!\n\nUS Q3 real GDP rose +4.3% (q/q annualized), stronger than expectations of +3.3% and the Q2 rate of +2.5%. The Q3 GDP Price Index rose +3.8% (q/q annualized), much stronger than expectations of +2.7% and up from Q2’s +2.1%. The Q3 core PCE Price Index rose +2.9% (q/q annualized), in line with expectations but up from Q2’s +2.6%.\nThe Conference Board’s Dec US consumer confidence index fell by -3.8 points to 89.1 from Nov’s revised level of 92.9 (preliminary 88.7), weaker than expectations for a report of 91.0.\nThe Dec Philadelphia Fed non-manufacturing index fell by -0.5 points to -16.8 from -16.3 in Nov, which was weaker than expectations for a rise to -15.0.\nOct durable goods orders fell -2.2% m/m, which was weaker than expectations of -1.5%. Oct durable goods orders ex-transportation rose +0.2% m/m, slightly weaker than market expectations of +0.3%. Oct core capital goods orders (ex transportation and defense), a proxy for capital spending, rose +0.5% m/m, which was slightly stronger than market expectations of +0.3%.\n\nNov US industrial production fell -0.1% m/m, slightly weaker than market expectations of +0.1%. Nov manufacturing production fell -0.4% m/m, weaker than market expectations of +0.1%.\nThe Dec Richmond Fed manufacturing index rose by +8 points to -7 from Nov’s -15, and was stronger than market expectations of -10.\nSeasonal factors are bullish for stocks. According to data from Citadel Securities, since 1928, the S&P 500 has risen 75% of the time in the last two weeks of December, climbing 1.3% on average.\n\nStory Continues\nThe markets are discounting a 13% chance that the FOMC will cut the fed funds target range by 25 bp at the next FOMC meeting on January 27-28.\nOverseas stock markets rose slightly on Tuesday. The Euro Stoxx 50 closed up +0.10%. China’s Shanghai Composite closed up +0.07% for the fifth consecutive daily gain. Japan’s Nikkei Stock 225 closed up +0.02%.\n\nInterest Rates\nMarch 10-year T-notes (ZNH6) on Tuesday fell by -1.5 ticks. The 10-year T-note yield rose by +0.2 bp to 4.165%. T-note prices fell on the stronger-than-expected US Q3 GDP report of +4.3%, although most of the other economic reports released Tuesday were mildly weaker than expected on balance.\nT-note prices were also undercut by supply overhang. The Treasury on Tuesday sold $70 billion of 5-year T-notes and $28 billion of 2-year floating rate notes. The Treasury will sell $44 billion of 7-year T-notes on Wednesday.\nEuropean government bond yields ended lower. The 10-year German bund yield on Tuesday fell back from Monday’s 9-month high and ended the day down -3.6 bp at 2.862%. The 10-year UK gilt yield fell by -2.7 bp to 4.509%.\n\nSwaps are discounting a 0% chance for a -25 bp rate cut by the ECB at its next policy meeting on February 5.\nUS Stock Movers\nThe Magnificent Seven stocks all closed higher on Tuesday except for Tesla. Nvidia (NVDA) rallied by more then +3%. Alphabet (GOOGL)and Amazon.com (AMZN) closed up by more than +1%.\nChip stocks closed mixed. Marvel Technology (MRVL) and Nvidia (NVDA) rallied by more than +3%, while Globalfoundries (GFS) was the weakest chip stock with a loss of -1.7%.\nCryptocurrency-exposed stocks traded lower, with Bitcoin (^BTCUSD) falling about -0.8%.\nRiot Platforms (RIOT) fell by more than -5%, and Strategy (MSTR) fell by nearly -4%. Coinbase Global (COIN) and Mara Holdings (MARA) fell by more than -2%.\n\nMiners saw support as gold, silver, and copper all posted new record highs on Tuesday. Freeport-McMoRan (FCX) closed up +2.5%, and Newmont Mining (NEM) closed up +0.35%.\nSable Offshore Corp (SOC) soared by +36% after news that the US Department of Transportation Pipeline and Hazardous Materials Safety Administration approved the company’s Las Flores pipeline restart plan.\nZim Integrated Shipping Services (ZIM) rallied more than +5% after news of buyout interest from multiple potential bidders.\nEarnings Reports(12/24/2025)\nNone.\nOn the date of publication, Rich Asplund did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "19:06:46",
      "Source": "Euronews",
      "Title": "Department stores fight TikTok and Amazon for beauty shoppers",
      "URL": "https://finance.yahoo.com/m/7cca09d5-f1a2-336e-8ac0-a84f830d4e96/department-stores-fight.html",
      "Content": "Department stores fight TikTok and Amazon for beauty shoppers\n\nEuronews\nMon, December 22, 2025 at 3:06 AM PST 7 min read\n\nChristmas shopping used to mean packed department store counters with last-minute gift seekers jostling beneath twinkling lights and towering holiday displays.\nNow, Christmas spending has moved indoors, with people filling stockings from the sofa, rather than being helped by sales associates in red-and-green sweaters.\n\nIt is consumers like Quinn Kelsey who keep department store executives up at night.\nThe 38-year-old Denver resident gets makeup ideas from TikTok videos and other social media content, not from beauty counter salespeople. She uses an AI chatbot to get product recommendations that fit her budget and to see how a specific foundation or lipstick would look on her. When she buys, it is usually from Amazon.\n“I use ChatGPT as my personal beauty consultant,” Kelsey said. “Department stores? I’ll walk through one for the decor, but they’ve basically lost me unless I can get the same product-research experience there that I can get scrolling through my phone at home.”\nOnce the ultimate beauty destination, department stores lost sales and their authority to skincare and makeup trendsetters starting in the late 1990s. That was when the growth of Sephora and Ulta Beauty made shopping for cosmetics more playful and self-service.\n\nBut fast-changing consumer preferences have retailers of all types racing to outdo one another for a slice of the $129 billion (€110bn) US beauty and personal care market. The competition is fiercer than ever due to the ease of e-commerce.\nAmazon, which has slowly added premium beauty brands to its massive selection, is the nation’s largest online seller of beauty and personal care products, according to market research company Euromonitor International.\nSocial media has also provided new sources of beauty guidance. Instead of store advisers, many consumers turn to videos from influencers, beauty brand founders, or dermatologists for advice. Shoppers also turn to TikTok and Instagram for information about “dupes\" — drugstore versions of more expensive products.\n\n“Stores are more of the showroom, but the spark itself is happening in TikTok,” Jake Bjorseth, founder of the Gen-Z advertising agency Trndsttrs, said.\nTo keep up, companies with both physical and online stores are investing in upgrades to deliver an experience beauty fans like Kelsey cannot get anywhere else.\nMacy’s and Nordstrom, for example, renovated the beauty floors of their flagship New York stores to add more space, ultra-luxury brands and cutting-edge technology. At Nordstrom, customers can book an appointment to get robot-applied eyelash extensions for $170 (€145).\n\nStory Continues\nThe makeovers were launched in time for the holiday shopping season, which accounts for about one-quarter of all US “prestige” beauty sales, according to market research firm Circana.\nThe chateau experience Department stores chasing beauty sales are introducing some of Sephora's self-service features — Nordstrom has installed a “beauty bar” with brightly lit mirrors where customers can try on makeup from different counters, while trying to distinguish themselves from speciality and online rivals.\nExecutives from Macy's and Nordstrom said the latest changes were designed to create an engaging atmosphere that encourages shoppers to stay longer and spend more. The overhaul at Macy's Herald Square included comfortable seating and skin-analysis devices to support products priced at hundreds of dollars.\nIn the Parfums de Marly section, customers sample scents while wearing a virtual reality headset that immerses them in an 18th-century chateau, the French fragrance maker cites as its inspiration.\n“This is the future of beauty,” Nicolette Bosco, Macy's vice president of beauty, said, referring to the interactive technology the department store considers central to offering shoppers an elevated experience.\nThe company expects to redesign the beauty departments of 40 more stores. The facelifts are intended to draw shoppers of all ages, Macy’s Inc CEO Tony Spring said.\n\n“We’re trying very hard to take the idea of a department store and make it intimate and friendly and convenient,” he said.\nSince becoming chief executive of the department store's parent company last year, Spring has focused on reviving Macy's by targeting higher-spending customers who drive sales at Bloomingdale's and the upscale beauty retailer Bluemercury, both of which Macy's owns.\nRelated\nWhere in the world do people spend the most as online shoppers?\nAmazon deploys 2,000 robots in UK's Bolton warehouse to meet Christmas demand\nNordstrom unwrapped the reimagined beauty floor of its midtown Manhattan store in September. It includes an area where shoppers can test beauty tools such as LED light-therapy masks and a “fragrance finder” machine that provides a dry whiff of up to 60 scents.\n\nNordstrom also expanded the beauty treatment area at the New York flagship and a few other stores to include a medical spa offering Botox and dermal filler injections priced at $575 (€490) to $1,050 (€900).\nWhat is the competition up to? Sephora redefined beauty shopping by installing mirrors and disposable applicators near compact displays of both tester products and ready-to-grab items.\nThe DIY concept was in significant contrast to department store counters staffed by beauty advisers who oversaw product sampling and retrieved fresh products from locked drawers.\n\nBut even innovators have to renovate. Sephora, a division of French luxury goods conglomerate LVMH, is updating its 720 stores in the US and Canada.\nThe stations where customers have their hair and makeup done are being moved to the side for greater privacy. The chain, known for long cash-register lines, plans to expedite checkouts by equipping salespeople with devices that accept card and contactless payments.\nUlta, which stocks drugstore beauty brands like Maybelline as well as high-end brands, has had in-store hair salons since its founding in 1990. It is adding ear piercing, testing robotic manicures, and plans to add robotic lash extensions, like Nordstrom’s, to its service menu next year.\nWalmart has moved into the turf of speciality retailers and department stores with products from higher-end and independent brands. The nation's largest retailer put beauty counters in 100 stores this year, where customers can try products.\n\nSocial media driving trends After working at a fashion event at Nordstrom's Manhattan flagship, Ivan Leon, a 35-year-old freelance stylist, headed to the Tom Ford fragrance counter.\nHe walked away an hour later having spent $537 (€460) on two bottles of perfume: a unisex scent named Bitter Peach and another named Vanilla Sex.\nLeon planned to wear them together, a practice known as “fragrance layering” that he heard about on social media. The Nordstrom salesperson caught his interest by suggesting Tom Ford scents could be applied in tandem.\n\n“It’s kind of cool when you combine two scents and it makes something new,” Leon said. “I think it helps the psyche and builds confidence.”\nLeon, who typically buys his fragrances online, offers department stores hope but also represents the uphill climb they face, given customers’ multidimensional shopping habits.\nTikTok is not only spawning trends like “tired girl” and “blurred skin” makeup, but is also becoming a place where users discover and buy from new brands.\nTikTok Shop, an e-commerce feature the social media platform launched in 2023, has emerged as the nation's seventh-largest online seller of beauty and personal care products, trailing only Target, according to Euromonitor.\nMacy’s and Nordstrom's online market shares are 1% and less than 0.5%, respectively, and both are declining, the market research firm said.\n\nRelated\nTikTok adds digital well-being features to help teens manage screen time and limit doomscrolling\nA new wave of DIY marketing: Small businesses take to TikTok\nAmazon, which accounts for almost half of online beauty and personal care sales, aims to replicate the in-store experience with virtual makeup try-on tools, such as Sephora's 2016 launch.\nSephora, meanwhile, unveiled in March an AI-powered online tool that uses selfies to identify potential skin concerns and make product recommendations.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "19:06:29",
      "Source": "Power Technology",
      "Title": "India adds 50GW renewables in 2025 with $22.32bn investment",
      "URL": "https://finance.yahoo.com/m/9899a9dd-b610-37a2-9936-e8dc6ca7be47/india-adds-50gw-renewables-in.html",
      "Content": "India adds 50GW renewables in 2025 with $22.32bn investment\n\nGlobalData\nMon, December 22, 2025 at 3:06 AM PST 3 min read\n\nIndia has reached a significant milestone in 2025 by adding 50 gigawatts (GW) of renewable energy capacity, supported by nearly Rs2tn ($22.32bn) in investment, reported PTI.\nThis expansion has raised the nation’s total non-fossil fuel capacity to around 262GW, putting India ahead of its climate commitments.\n\nNon-fossil fuel sources currently comprise half of India’s installed capacity, meeting the Paris Agreement’s 2030 goal five years ahead of schedule.\nThe country’s total installed power capacity currently stands at 510GW, including 247GW from fossil fuels and 262GW from non-fossil sources, of which renewables account for 254GW.\nUnion Minister for New and Renewable Energy Pralhad Joshi told PTI that 2025 recorded unprecedented growth, with around 45GW of renewable capacity added from January to November, driven mainly by nearly 35GW of new solar capacity.\nHe said: “By the end of December, we will reach nearly 48-50GW. The future is sunny and will be powered by renewables,” noting that this momentum is likely to carry into 2026.\nDespite the progress, hurdles such as land acquisition, right-of-way constraints, and delays in finalising power purchase agreements (PPAs) are still limiting the rollout of new projects.\n\nIndustry projections suggest capital costs of roughly Rs 40m per megawatt (MW), implying about Rs2tn for every 50GW of additional capacity.\nAn Indian Renewable Energy Development Agency (IREDA) analysis estimates that India will require around Rs30.54tn in investments from 2023 to 2030 to reach the 500GW non-fossil fuel capacity target.\nSince 2014, public sector financial institutions have collectively committed about Rs10.79tn to renewable energy, including approximately Rs2.68tn in the 2024-25 fiscal year alone.\nPralhad Joshi stated that between 2014 and 2024–25, public sector banks and institutions, such as IREDA, PFC, REC, IIFCL, SIDBI, and NaBFID, have deployed around Rs10.79tn (excluding private banks) for renewable energy projects, of which about Rs2.68tn was invested in the financial year (FY) 2024-25.\n\nAccording to Vinay Rustagi, chief business officer of Premier Energies, an integrated solar cell and solar module manufacturing company, 2025 has been an exceptionally active year for the renewable sector.\nHe noted that project commissioning increased by more than 50% compared to the previous year, largely propelled by the PM Surya Ghar Yojana and the PM-KUSUM programme.\nRustagi observed that the rapid scaling of renewable capacity is creating grid imbalances, leading to power curtailment, while delays in adding transmission infrastructure are hindering project timelines, especially in Rajasthan.\n\nStory Continues\nHitachi Energy’s MD and CEO for India and South Asia, N Venu, emphasised the need to reinforce the transmission grid, speeding up the rollout of renewable energy zones, boosting energy storage, and moving from project-centric to programme-driven approaches.\nVenu added that with targeted measures in 2026, India can improve its energy security and solidify its standing in the global clean energy arena.\n\n\"India adds 50GW renewables in 2025 with $22.32bn investment\" was originally created and published by Power Technology , a GlobalData owned brand.\n\nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "19:05:00",
      "Source": "PR Newswire",
      "Title": "Jay Walker Names The Jay Walker Show as the Flagship Anchor of REVIVE as Network Goes Live in Homes",
      "URL": "https://finance.yahoo.com/news/jay-walker-names-jay-walker-110500542.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nJay Walker Names The Jay Walker Show as the Flagship Anchor of REVIVE as Network Goes Live in Homes\n\nPR Newswire\nMon, December 22, 2025 at 3:05 AM PST 3 min read\n\nNASHVILLE, Tenn. , Dec. 22, 2025 /PRNewswire / -- Jay Walker , Founder and CEO of REVIVE , today announced that The Jay Walker Show has been officially named the flagship anchor program of the network, airing daily from 8:00–9:00 p.m. ET (7:00–8:00 p.m. CT) on REVIVE. The announcement comes as REVIVE expands distribution and is now live in Spectrum homes , bringing the creator-first network to audiences through traditional television access alongside streaming and digital.\nIn addition to the nightly TV hour, The Jay Walker Show will continue releasing daily across all major audio podcast platforms through AUDIO ONE , giving audiences the flexibility to watch nightly or listen on-demand wherever they get podcasts.\n\"REVIVE is my network — and I built it for this era,\" said Jay Walker , Founder & CEO of REVIVE and host of The Jay Walker Show . \"I'm excited to be back on TV daily because people are tired of the noise and the made-for-TV nonsense. This show is about bringing common sense back, addressing the issues that really matter, and putting the conversation where it belongs — with the people.\"\n\nThe Jay Walker Show is known for high-impact interviews, sharp cultural commentary, and real-time response to the stories driving the day. The program has featured major voices and cultural icons including Mo'Nique , D.L. Hughley , Steve Harvey , Keith Sweat , Tamela Mann , Doug Jones , and more, spanning entertainment, community leadership, faith, politics, and culture.\nAs REVIVE's flagship anchor hour, The Jay Walker Show will serve as the nightly front door to the network's broader content strategy: live news , original entertainment , and interactive programming created and curated by Jay Walker. REVIVE blends traditional entertainment with citizen journalism to deliver balanced, engaging content that puts viewers at the center of the conversation — elevating community perspectives, real-time feedback, and storytelling that reflects what audiences are actually living through.\n\nWhere to listen to The Jay Walker Show (Audio via AUDIO ONE):\nApple Podcasts: https://podcasts.apple.com/us/podcast/the-jay-walker-show/id1832337764\nSpotify: https://open.spotify.com/show/2tOoUbGBbyyyKM6wgqb2ht\nWhere to watch:\nREVIVE — Daily, 8:00–9:00 p.m. ET / 7:00–8:00 p.m. CT (now live in Spectrum homes)\nAbout REVIVE\nREVIVE is a next-generation network headquartered in the Nashville area, built for podcast creators and audiences who live in real conversation. Founded by Jay Walker, REVIVE features live news, original entertainment, and interactive programming that blends traditional media with citizen journalism — delivering balanced, engaging content that informs, entertains, and keeps viewers at the center of the conversation.\n\nStory Continues\nAbout Revive Media Co.\nRevive Media Co. is Jay Walker's latest media venture, launched in 2025 from the Nashville area. The multiplatform company combines traditional entertainment programming with live news, citizen journalism, and immersive viewer experiences. Through its national broadcasting network, streaming platform, and forthcoming app, Revive Media enables creators and community members to share stories while delivering curated content to audiences nationwide. Building on Walker's decade-long presence in television and media, Revive Media Co. is committed to balanced, purpose-driven programming that informs, empowers, and engages viewers.\nMedia Contact\nKhali West\nPress & Public Relations\nkwest@woahrae.com\nView original content to download multimedia: https://www.prnewswire.com/news-releases/jay-walker-names-the-jay-walker-show-as-the-flagship-anchor-of-revive-as-network-goes-live-in-homes-302647551.html\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "19:05:00",
      "Source": "Motley Fool",
      "Title": "3 Reasons to Buy Nu Holdings Stock Like There's No Tomorrow",
      "URL": "https://finance.yahoo.com/m/e2892945-9d48-34dc-8f02-edd71d2df594/3-reasons-to-buy-nu-holdings.html",
      "Content": "3 Reasons to Buy Nu Holdings Stock Like There's No Tomorrow\n\nCourtney Carlsen, The Motley Fool\nMon, December 22, 2025 at 3:05 AM PST 5 min read\n\nIn this article: NU\n\nKey Points Rising smartphone adoption in Latin America supports Nu Holdings' digital-first banking model.\nNu has disrupted the traditional banking system and now has more than 110 million customers in Brazil.\nWith a huge customer base, Nu is focused on increasing profitability through cross-selling financial and other services.\nThese 10 stocks could mint the next wave of millionaires ›\n\nNu Holdings (NYSE: NU) is making waves in the fintech investment sector. Since the start of the year, the Latin American financial services company has surged 58%. The bank has done a stellar job of serving regions starved for quality, affordable banking services, leveraging its digital platform to connect with hundreds of millions of customers.\nThe company's stock performance reflects investor optimism about Nu's growth trajectory and future prospects. The bank has a large customer base to sell to and is targeting other markets ripe for disruption. Here are three reasons to invest in Nu Holdings today.\n1. Nu has seen tremendous growth in Brazil For many years, Brazilian consumers faced a concentrated and predatory banking system dominated by just five banks. The situation was so severe that credit card interest rates reached 160%, and former finance minister Paulo Guedes described it as a \"cartel.\"\nChanges paved the way for Nu's neobank model. By operating a digital-only platform, Nu challenged the traditional banking model by offering free digital accounts and credit cards with no annual fees, attracting tens of millions of customers. Today, Nu serves more than 110 million customers in Brazil, or roughly 60% of the country's adult population.\nNu currently holds multiple regulatory licenses, letting it offer products and services in payments, credit, financing, investments, and securities. However, Brazil has made regulatory changes restricting the use of the term \"bank\" by those without a banking license, so Nu is aiming to acquire a small bank in Brazil sometime next year.\n\nBeing a fully licensed bank provides legitimacy with consumers, especially in a market where trust in financial institutions is paramount. This license could also make it easier for Nu to access markets reserved for banks, thereby lowering its cost of capital.\n2. It has a huge customer base to cross-sell to Nu has a huge customer base of 127 million, and sees this as an opportunity to create value and cross-sell to those customers. It views this as a means to enhance the profitability and economics of its overall business. Nu offers a range of financial services, including lending, investments, and insurance. It also offers travel and cellular services, along with an integrated marketplace platform.\n\nStory Continues\nOne way to assess how effective Nu is at cross-selling is to look at its average revenue per active customer (ARPAC). As customers adopt more of its products, the revenue per active user climbs. In the third quarter, Nu's ARPAC was $13.40, a 20% year-over-year increase on a foreign-exchange-neutral basis. For Nu's long-term customers who have been on the platform for eight years or more, the ARPAC was $27.30 as of the second quarter.\nNu's growing ARPAC demonstrates the long-term monetization potential as its customer base grows, matures, and adopts more of its products. This is a critical component that helps Nu grow efficiently and cost-effectively.\n3. Positive trends should fuel future growth A positive trend for Nu is smartphone adoption , which is projected to reach 400 million users across Latin America. This digital-native population increasingly prefers mobile apps to physical bank branches, a trend Nu leverages through its low-cost, digital-first model.\nNu's growth in Brazil has been excellent, and the company has begun its expansion into Mexico and Colombia. These are two of the largest regions in Latin America, with significant numbers of unbanked or underbanked consumers. In Mexico, Nu has over 13 million customers, representing about 14% of the country's adult population. It is also approaching nearly 4 million customers in Colombia.\n\nNu Mexico has been approved to convert into a bank in Mexico and is currently completing the final steps. It previously operated as a Popular Financial Society (SOFIPO). Once fully authorized as a bank, it will be able to offer a broader product portfolio, including payroll accounts. It will also increase its deposit insurance coverage by 16-fold, allowing Nu to attract high-net-worth individuals.\nBut that's not all. In September, Nu Holdings applied to the Office of the Comptroller of the Currency for a charter to establish a de novo national bank in the U.S. The charter would let the company offer a range of products, including deposit accounts, credit cards, loans, and potentially digital asset custody, under a single federal regulator.\n\nNu has demonstrated excellent growth across Brazil and is making strides in Mexico and Colombia. The company is effectively leveraging its scale and cross-selling to drive efficient growth. If you're looking for an attractively priced growth stock, Nu Holdings, trading at 20 times next year's earnings, appears to be an excellent buy today.\nDon’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $469,438 !*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $52,063 !*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $509,039 !*\nRight now, we’re issuing “Double Down” alerts for three incredible companies , available when you join Stock Advisor , and there may not be another chance like this anytime soon.\nSee the 3 stocks »\n*Stock Advisor returns as of December 15, 2025\nCourtney Carlsen has positions in Nu Holdings. The Motley Fool recommends Nu Holdings. The Motley Fool has a disclosure policy .\n3 Reasons to Buy Nu Holdings Stock Like There's No Tomorrow was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "19:02:47",
      "Source": "Milwaukee Journal Sentinel",
      "Title": "Whitefish Bay home recently sold for $1 million - 13% over asking price",
      "URL": "https://finance.yahoo.com/m/dde2007b-9e70-380d-b190-b03b5345d5c3/whitefish-bay-home-recently.html",
      "Content": "Whitefish Bay home recently sold for $1 million - 13% over asking price\n\nFrancesca Pica, Milwaukee Journal Sentinel\nMon, December 22, 2025 at 3:02 AM PST 2 min read\n\nHome sales in southeast Wisconsin dropped as the market continues to cool in winter.\nSoutheast Wisconsin home sales fell 10.6% in November 2025 compared to November 2024, according to a report from the Wisconsin Realtors Association released Dec. 18.\nHome prices have continued to rise, though at a smaller rate than earlier this year, the report said. High demand for Milwaukee-area homes could be keeping prices high in what would otherwise be a cooler real estate market, Greater Milwaukee Association of Realtors President Mike Ruzicka previously told the Journal Sentinel.\n\nHere are Milwaukee County's most expensive recent home sales, according to Milwaukee Metro Multiple Listing Services data:\nMid-century modern Whitefish Bay home sells for $1 million A mid-century modern Whitefish Bay home on East Colfax Place sold Dec. 10 for $1 million, 13% higher than the initial list price of $899,900.\nThe house spans 3,800 square feet with four bedrooms and three bathrooms, according to the listing. It sits on a 0.18-acre lot.\nThe home, built in 1965, features a newly renovated kitchen with white oak cabinetry and updated appliances, according to the listing. The basement was also recently renovated and includes a fireplace, vinyl flooring and laundry room space.\n\nCape Cod home in Fox Point sells for $825,000 A 3,000-square-foot Cape Cod on West Bergen Drive in Fox Point sold for $825,000 on Nov. 19.\nThe home was built in 1955 on a half-acre lot and includes four bedrooms and three bathrooms, according to the listing.\nIt features arched doorways, heated floors and an updated kitchen with quartz countertops, the listing says. The yard features a fire pit, flagstone patio, hot tub and treehouse.\n\nGreendale home sells for $670,000 A tri-level home in Greendale sold for $670,000 on Dec. 9.\nThe 3,400-square-foot home was built in 1965 on a 0.73-acre lot on Fairmount Lane, according to the listing. It has five bedrooms, four bathrooms and a three-car garage.\nThe home features a sun room, luxury kitchen and a dry bar, the listing says. It also has a natural fireplace and a patio with a built-in fire pit.\n\nMilwaukee home in Bay View neighborhood sells for $629,000 A home on South Superior Street in Milwaukee's Bay View neighborhood sold for just under $629,000 on Dec. 8.\nThe home spans just over 2,000 square feet with three bedrooms and three bathrooms, according to the listing. It was built in 1905 on a 0.14-acre lot.\nThe house features vaulted ceilings, a 2.5-car garage and a new deck overlooking the backyard. It's also a few blocks away from South Shore Park and Lake Michigan, according to the listing.\nThis article originally appeared on Milwaukee Journal Sentinel: Recent home sales -- $1 million in Whitefish Bay, $629,00 in Bay View\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "19:02:00",
      "Source": "GlobeNewswire",
      "Title": "Man Group PLC : Form 8.3 - American Axle & Manufacturing Holdings, Inc",
      "URL": "https://finance.yahoo.com/news/man-group-plc-form-8-110200069.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nMan Group PLC : Form 8.3 - American Axle & Manufacturing Holdings, Inc\n\nMan Group PLC\nMon, December 22, 2025 at 3:02 AM PST 4 min read\n\nIn this article: AXL\n\nMNGPF\n\nFORM 8.3\nPUBLIC OPENING POSITION DISCLOSURE/DEALING DISCLOSURE BY\nA PERSON WITH INTERESTS IN RELEVANT SECURITIES REPRESENTING 1% OR MORE\nRule 8.3 of the Takeover Code (the “Code”)\n1. KEY INFORMATION\n(a) Full name of discloser:\nMan Group PLC\n(b) Owner or controller of interests and short positions disclosed, if different from 1(a):\nThe naming of nominee or vehicle companies is insufficient. For a trust, the trustee(s), settlor and beneficiaries must be named.\n\n(c) Name of offeror/offeree in relation to whose relevant securities this form relates:\nUse a separate form for each offeror/offeree\nAmerican Axle & Manufacturing Holdings, Inc.\n(d) If an exempt fund manager connected with an offeror/offeree, state this and specify identity of offeror/offeree:\n\n(e) Date position held/dealing undertaken:\nFor an opening position disclosure, state the latest practicable date prior to the disclosure\n19/12/2025\n(f) In addition to the company in 1(c) above, is the discloser making disclosures in respect of any other party to the offer?\nIf it is a cash offer or possible cash offer, state “N/A”\nYES\nOfferee: Dowlais Group plc\n\n2. POSITIONS OF THE PERSON MAKING THE DISCLOSURE\nIf there are positions or rights to subscribe to disclose in more than one class of relevant securities of the offeror or offeree named in 1(c), copy table 2(a) or (b) (as appropriate) for each additional class of relevant security.\n(a) Interests and short positions in the relevant securities of the offeror or offeree to which the disclosure relates following the dealing (if any)\nClass of relevant security:\n\nUSD 0.01 common\n\nInterests\nShort positions\nNumber\n%\nNumber\n%\n(1) Relevant securities owned and/or controlled:\n258,414.00\n0.21\n\n(2) Cash-settled derivatives:\n\n1,975,889.00\n1.66\n(3) Stock-settled derivatives (including options) and agreements to purchase/sell:\n\nTOTAL:\n258,414.00\n0.21\n1,975,889.00\n1.66\n\nAll interests and all short positions should be disclosed.\nDetails of any open stock-settled derivative positions (including traded options), or agreements to purchase or sell relevant securities, should be given on a Supplemental Form 8 (Open Positions).\n\nStory Continues\n(b) Rights to subscribe for new securities (including directors’ and other employee options)\nClass of relevant security in relation to which subscription right exists:\n\nDetails, including nature of the rights concerned and relevant percentages:\n\n3. DEALINGS (IF ANY) BY THE PERSON MAKING THE DISCLOSURE\nWhere there have been dealings in more than one class of relevant securities of the offeror or offeree named in 1(c), copy table 3(a), (b), (c) or (d) (as appropriate) for each additional class of relevant security dealt in.\nThe currency of all prices and other monetary amounts should be stated.\n(a) Purchases and sales\nClass of relevant security\nPurchase/sale\n\nNumber of securities\nPrice per unit\nUSD 0.01 common\nSale\n522\n6.7112 USD\nUSD 0.01 common\nSale\n416\n6.7112 USD\nUSD 0.01 common\nSale\n8,200\n6.7112 USD\nUSD 0.01 common\nSale\n2,335\n6.7112 USD\nUSD 0.01 common\nSale\n834\n6.7112 USD\n\n(b) Cash-settled derivative transactions\nClass of relevant security\nProduct description\ne.g. CFD\nNature of dealing\ne.g. opening/closing a long/short position, increasing/reducing a long/short position\nNumber of reference securities\nPrice per unit\nUSD 0.01 common\nSwap\nIncreasing a short position\n1,905\n6.7650 USD\nUSD 0.01 common\nSwap\nIncreasing a short position\n150\n6.7650 USD\nUSD 0.01 common\nSwap\nIncreasing a short position\n13,338\n6.7720 USD\nUSD 0.01 common\nSwap\nIncreasing a short position\n1,047\n6.7720 USD\nUSD 0.01 common\nSwap\nIncreasing a short position\n3,811\n6.7450 USD\nUSD 0.01 common\nSwap\nIncreasing a short position\n299\n6.7450 USD\nUSD 0.01 common\nSwap\nIncreasing a short position\n1,905\n6.8102 USD\nUSD 0.01 common\nSwap\nIncreasing a short position\n150\n6.8102 USD\n\n(c) Stock-settled derivative transactions (including options)\n(i) Writing, selling, purchasing or varying\nClass of relevant security\nProduct description e.g. call option\nWriting, purchasing, selling, varying etc.\nNumber of securities to which option relates\nExercise price per unit\nType\ne.g. American, European etc.\nExpiry date\nOption money paid/ received per unit\n\n(ii) Exercise\nClass of relevant security\nProduct description\ne.g. call option\nExercising/ exercised against\nNumber of securities\nExercise price per unit\n\n(d) Other dealings (including subscribing for new securities)\nClass of relevant security\nNature of dealing\ne.g. subscription, conversion\nDetails\nPrice per unit (if applicable)\n\n4. OTHER INFORMATION\n(a) Indemnity and other dealing arrangements\nDetails of any indemnity or option arrangement, or any agreement or understanding, formal or informal, relating to relevant securities which may be an inducement to deal or refrain from dealing entered into by the person making the disclosure and any party to the offer or any person acting in concert with a party to the offer:\nIrrevocable commitments and letters of intent should not be included. If there are no such agreements, arrangements or understandings, state “none”\n\nNone\n\n(b) Agreements, arrangements or understandings relating to options or derivatives\nDetails of any agreement, arrangement or understanding, formal or informal, between the person making the disclosure and any other person relating to:\n(i) the voting rights of any relevant securities under any option; or\n(ii) the voting rights or future acquisition or disposal of any relevant securities to which any derivative is referenced:\nIf there are no such agreements, arrangements or understandings, state “none”\n\nNone\n\n(c) Attachments\nIs a Supplemental Form 8 (Open Positions) attached?\nNO\n\nDate of disclosure:\n22/12/2025\nContact name:\nMolly Childs\nTelephone number:\n+442071443714\n\nPublic disclosures under Rule 8 of the Code must be made to a Regulatory Information Service.\nThe Panel’s Market Surveillance Unit is available for consultation in relation to the Code’s disclosure requirements on +44 (0)20 7638 0129.\nThe Code can be viewed on the Panel’s website at www.thetakeoverpanel.org.uk.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "19:01:00",
      "Source": "GlobeNewswire",
      "Title": "Heineken Holding N.V. reports transactions under its current share buyback programme",
      "URL": "https://finance.yahoo.com/news/heineken-holding-n-v-reports-110100256.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nHeineken Holding N.V. reports transactions under its current share buyback programme\n\nHEINEKEN Holding NV\nMon, December 22, 2025 at 3:01 AM PST 2 min read\n\nIn this article: HKHHF\n\nHKHHY\n\nHeineken Holding N.V. reports transactions under its current\nshare buyback programme\nAmsterdam, 22 December 2025 - Heineken Holding N.V. (EURONEXT:HEIO; OTCQX: HKHHY), hereby reports transaction details related to the first tranche of up to circa €375 million tranche of its share buyback programme of up to circa €750 million as communicated on 12 February 2025.\n\nFrom 15 December 2025 up to and including 19 December 2025 a total of 179,037 shares were repurchased on exchange at an average price of € 62.05.\n\nUp to and including 19 December 2025, a total of 4,798,439 shares were repurchased under the share buyback programme for a total consideration of € 299,292,983.\nHeineken Holding N.V. publishes on a weekly basis, every Monday, an overview of the progress of the share buyback programme on its website: https://www.heinekenholding.com/investors/share-information/share-buyback-programme\n\nEnquiries\n\nMedia Heineken Holding N.V.\n\nKees Jongsma\n\ntel. +31 6 54 79 82 53\n\nE-mail: cjongsma@spj.nl\n\nMedia\n\nInvestors\nChristiaan Prins\n\nTristan van Strien\nDirector of Global Communications\n\nGlobal Director of Investor Relations\nMarlie Paauw\n\nLennart Scholtus / Chris Steyn\nGlobal Media Lead\n\nInvestor Relations Manager / Senior Analyst\nE-mail: pressoffice@heineken.com\n\nE-mail: investors@heineken.com\nTel: +31-20-5239355\n\nTel: +31-20-5239590\n\nRegulatory information:\nThis press release is issued in connection with the disclosure and reporting obligations as set out in Article 5(1)(b) Regulation (EU) 596/2014 and Article 2(2) of the Commission Delegated Regulation (EU) 2016/1052 that contains technical standards for buyback programs.\nEditorial information:\nHeineken Holding N.V. engages in no activities other than its participating interest in Heineken N.V. and the management or supervision of and provision of services to that company. HEINEKEN is the world's pioneering beer company. It is the leading developer and marketer of premium and non-alcoholic beer and cider brands. Led by the Heineken® brand, the Group has a portfolio of more than 340 international, regional, local and specialty beers and ciders. With HEINEKEN’s over 85,000 employees, HEINEKEN brews the joy of true togetherness to inspire a better world. HEINEKEN’s dream is to shape the future of beer and beyond to win the hearts of consumers. HEINEKEN is committed to innovation, long-term brand investment, disciplined sales execution and focused cost management. Through \"Brew a Better World\", sustainability is embedded in the business. HEINEKEN has a well-balanced geographic footprint with leadership positions in both developed and developing markets. HEINEKEN operates breweries, malteries, cider plants and other production facilities in more than 70 countries. Most recent information is available on www.heinekenholding.com and www.theheinekencompany.com and follow HEINEKEN on LinkedIn and Instagram .\n\nStory Continues\nAttachment\n20251222 HHNV SBB 2025 Weekly update 15 December - 19 December 2025\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "19:00:54",
      "Source": "Yahoo Personal Finance",
      "Title": "HELOC rates today, December 22, 2025: Rates dipping closer to 7%",
      "URL": "https://finance.yahoo.com/personal-finance/mortgages/article/heloc-interest-rates-today-monday-december-22-2025-110054719.html",
      "Content": "Personal Finance / Mortgages\nSome offers on this page are from advertisers who pay us, which may affect which products we write about, but not our recommendations. See our Advertiser Disclosure .\n\nHELOC rates today, December 22, 2025: Rates dipping closer to 7%\n\nHal Bundrick, CFP® · Senior Writer\n\nLaura Grace Tarpley · Lead Editor and Content Strategist, Mortgages\n\nMon, December 22, 2025 at 3:00 AM PST 4 min read\n\nThe current national average HELOC rate is dipping closer to 7%. In fact, Bank of America has a home equity line of credit rate as low as 7.3% in some states.\n\nFind out whether now is a good time to take out a HELOC.\nHELOC rates: Monday, December 22, 2025 According to Curinos data, the average weekly HELOC rate is 7.44% . This rate is based on applicants with a minimum credit score of 780 and a maximum combined loan-to-value ratio (CLTV) of 70%.\nHomeowners have a huge amount of value tied up in their houses — nearly $36 trillion at the end of the second quarter of 2025, according to the Federal Reserve. That's the largest amount of home equity on record.\nWith mortgage rates lingering just over 6%, homeowners may not want to let go of their primary mortgage anytime soon, so selling the house may not be an option. Why give up your 5%, 4% — or even 3% mortgage?\n\nAccessing some of the value locked into your house with a use-it-as-you-need-it HELOC can be an excellent alternative.\n\nHow lenders determine HELOC interest rates HELOC interest rates are different from primary mortgage rates. Second mortgage rates are based on an index rate plus a margin. That index is often the prime rate, which has just fallen to 6.75%. If a lender added 0.75% as a margin, the HELOC would have a rate of 7.50%.\nLenders have flexibility with pricing on a second mortgage product, such as a HELOC or home equity loan , so it pays to shop around. Your rate will depend on your credit score, the amount of debt you carry, and the amount of your credit line compared to the value of your home.\nAnd average national HELOC rates can include \"introductory\" rates that may only last for six months or one year. After that, your interest rate will become adjustable, likely beginning at a substantially higher rate.\nDiscover the details of how HELOC interest rates work.\nHow a HELOC works You don't have to give up your low-rate mortgage to access your home's equity. Keep your primary mortgage and consider a second mortgage , such as a home equity line of credit.\nThe best HELOC lenders offer low fees, a fixed-rate option, and generous credit lines. A HELOC allows you to easily use your home equity in any way and in any amount you choose, up to your credit line limit. Pull some out; pay it back. Repeat.\nMeanwhile, you're paying down your low-interest-rate primary mortgage.\n\nLook for introductory rates, but be aware of a rate adjustment later Today, FourLeaf Credit Union is offering a HELOC rate of 5.99% for 12 months on lines up to $500,000. That's an introductory rate that will convert to an adjustable rate later. When shopping for lenders, be aware of both rates. And as always, compare fees, repayment terms, and the minimum draw amount. The draw is the amount of money a lender requires you to initially take from your equity.\nThe power of a HELOC is tapping only what you need and leaving some of your line of credit available for future needs. You don't pay interest on what you don't borrow.\nHELOC rates today: FAQs What is a good interest rate on a HELOC right now? Rates vary so much from one lender to the next that it's hard to pin down a magic number. You may see rates from nearly 6% to as much as 18%. It really depends on your creditworthiness and how diligent a shopper you are.\nIs it a good idea to get a HELOC right now? For homeowners with low primary mortgage rates and a chunk of equity in their house, it's probably one of the best times to get a HELOC. You don't give up that great mortgage rate, and you can use the cash drawn from your equity for things like home improvements , repairs, and upgrades. Of course, you can use a HELOC for fun things too, like a vacation — if you have the discipline to pay it off promptly. A vacation is likely not worth taking on long-term debt.\nWhat is the monthly payment on a $50,000 home equity line of credit? If you withdraw the full $50,000 from a home equity line of credit and pay a 7.50% interest rate, your monthly payment during the 10-year draw period would be about $313. That sounds good, but remember that the rate is usually variable, so it changes periodically, and your payments will increase during the 20-year repayment period. A HELOC essentially becomes a 30-year loan. HELOCs are best if you borrow and repay the balance within a much shorter period.",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "19:00:52",
      "Source": "Yahoo Personal Finance",
      "Title": "Best high-yield savings interest rates today, December 22, 2025 (Earn up to 4.3% APY)",
      "URL": "https://finance.yahoo.com/personal-finance/article/best-high-yield-savings-interest-rates-today-monday-december-22-2025-110052222.html",
      "Content": "Personal Finance / Banking\nSome offers on this page are from advertisers who pay us, which may affect which products we write about, but not our recommendations. See our Advertiser Disclosure .\n\nBest high-yield savings interest rates today, December 22, 2025 (Earn up to 4.3% APY) Here’s a look at how today’s savings account rates stack up.\n\nCasey Bond · Lead Editor and Content Strategist, Banking\n\nMon, December 22, 2025 at 3:00 AM PST 3 min read\n\nToday’s savings account rates still hover well above the national average. The Federal Reserve cut the federal funds rate three times in 2024 and three times in 2025. This means deposit account rates are also on the decline. It's more important than ever to ensure you're earning the highest rate possible on your savings, and a high-yield savings account could be the solution.\nThese accounts pay more interest than the typical savings account — as much as 4% APY and higher in some cases. Not sure where to find the best savings interest rates today? Read on to find out which banks have the best offers.\n\nBest savings rates today In general, high-yield savings accounts offer better interest rates than traditional savings accounts . Still, rates vary widely across financial institutions. That’s why it’s important to shop around and compare rates before opening an account.\nAs of December 22, 2025, the highest savings account rate available from our partners is 4.3% APY. This rate is offered by SoFi.*\nAs you'll see, the majority of top savings rates come from online banks . These institutions have much lower overhead costs than traditional banks, so they can pass those savings on to customers in the form of higher rates and lower fees.\nHere is a look at some of the best savings rates available today from our verified partners:\n\nNational average savings account rates A high-yield savings account can be a good fit if you’re looking for a secure place to store your money and earn a competitive interest rate while maintaining liquidity. Traditional savings accounts and certificates of deposit (CDs) have some of the highest interest rates we’ve seen in more than a decade, despite several rate cuts by the Federal Reserve. Even so, the national average for these rates is fairly low compared to the top offers available.\nFor example, the average savings account rate is just 0.39%, while 1-year CDs pay 1.63%, on average, according to the FDIC. The Fed is also expected to lower rates even further in the coming months, which means now might be the last chance for savers to take advantage of today’s high rates.\n\nChoosing the best savings account for you Taking the time to compare accounts and rates from various financial institutions will help you secure the best deal available. However, interest rates aren’t the only factor to consider when choosing a savings account.\nFor example, some banks may require that you maintain a minimum balance to earn the highest advertised rate and avoid monthly fees. Other factors to evaluate include customer service options and hours, ATM and branch access, digital banking tools, and the overall financial stability of the institution. Additionally, before opening a savings account, be sure that it’s insured by the Federal Deposit Insurance Corporation (FDIC) — or the National Credit Union Administration (NCUA) if it’s held by a credit union — so your money is protected in case the institution fails.",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "19:00:45",
      "Source": "Yahoo Personal Finance",
      "Title": "Best CD rates today, December 22, 2025 (Lock in up to 4.1% APY)",
      "URL": "https://finance.yahoo.com/personal-finance/banking/article/best-cd-rates-today-monday-december-22-2025-110045970.html",
      "Content": "Personal Finance / Banking\nSome offers on this page are from advertisers who pay us, which may affect which products we write about, but not our recommendations. See our Advertiser Disclosure .\n\nBest CD rates today, December 22, 2025 (Lock in up to 4.1% APY) Today’s CD rates still hover well above the national average.\n\nCasey Bond · Lead Editor and Content Strategist, Banking\n\nMon, December 22, 2025 at 3:00 AM PST 2 min read\n\nToday’s CD rates still hover well above the national average. The Federal Reserve reduced its target interest rate three times in 2024 and recently announced its third rate cut of 2025. This has a ripple effect on deposit account rates, which means now could be your last chance to lock in today's high rates with a certificate of deposit (CD). Here’s a look at today’s best CD rates and where you can find the best offers.\nBest CD rates today As of December 22, 2025, the highest CD rate is 4.1% APY. This rate is offered by Sallie Mae Bank on its 15-month CD and LendingClub Bank on its 8-month CD.\nHere is a look at some of the best CD rates available today from our verified partners.\n\nNational average CD rates If you're considering a CD, these rates are some of the highest available, especially when compared to the national average rates, which are significantly lower. It's also worth noting that online banks and credit unions generally offer more competitive rates compared to traditional brick-and-mortar banks​.",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "16:09:00",
      "Source": "Simply Wall St.",
      "Title": "Does onsemi’s New FORVIA HELLA MOSFET Deal Reshape the Bull Case for ON Semiconductor (ON)?",
      "URL": "https://finance.yahoo.com/news/does-onsemi-forvia-hella-mosfet-080900680.html",
      "Content": "Does onsemi’s New FORVIA HELLA MOSFET Deal Reshape the Bull Case for ON Semiconductor (ON)?\n\nSimply Wall St\nSat, December 20, 2025 at 12:09 AM PST 3 min read\n\nIn this article: ON\n\nGFS\n\nIn December 2025, onsemi announced an expanded long-term engagement with FORVIA HELLA, which will adopt onsemi’s PowerTrench T10 MOSFET technology across advanced automotive platforms, with production at onsemi’s East Fishkill, New York facility.\nThe deal highlights how onsemi’s shielded gate trench MOSFETs, with lower losses and higher power density, could help FORVIA HELLA design more efficient and cost-effective electronic systems for a wide range of vehicle applications.\nNext, we’ll examine how onsemi’s GaN power collaboration with GlobalFoundries could influence its investment narrative and growth opportunities.\n\nFind companies with promising cash flow potential yet trading below their fair value .\nON Semiconductor Investment Narrative Recap To own onsemi, you have to believe its focus on high value power semiconductors for EVs, AI data centers and industrial systems can overcome cyclical softness and capacity underutilization. The FORVIA HELLA expansion and new GaN partnership both support that thesis, but do not materially change the near term risk that weaker auto demand, especially in North America and Europe, could keep margins under pressure.\n\nThe GaN power collaboration with GlobalFoundries is especially relevant here, as it ties directly into onsemi’s push into wide bandgap power for AI data centers, EVs and industrial applications. If customer adoption of these newer GaN and SiC products is slower than expected, it could compound near term revenue headwinds from exiting lower margin legacy businesses just as investors are watching utilization and earnings closely.\nYet behind the technology wins, investors should still be aware of the risk that ongoing manufacturing underutilization could continue to weigh on margins and cash generation...\nRead the full narrative on ON Semiconductor (it's free!)\nON Semiconductor’s narrative projects $7.5 billion revenue and $1.9 billion earnings by 2028. This requires 5.4% yearly revenue growth and about a $1.4 billion earnings increase from $465.8 million today.\n\nUncover how ON Semiconductor's forecasts yield a $58.70 fair value , a 6% upside to its current price.\nExploring Other Perspectives Eleven members of the Simply Wall St Community value onsemi between US$49.59 and US$70, reflecting a wide spread of individual expectations. Against that backdrop, the key question is whether onsemi’s push into GaN and high value automotive power devices can offset cyclically weak auto demand and utilization issues over time, so it is worth comparing several of these viewpoints before forming a view.\n\nStory Continues\nExplore 11 other fair value estimates on ON Semiconductor - why the stock might be worth as much as 27% more than the current price!\nBuild Your Own ON Semiconductor Narrative Disagree with existing narratives? Create your own in under 3 minutes - extraordinary investment returns rarely come from following the herd.\nA great starting point for your ON Semiconductor research is our analysis highlighting 1 key reward and 3 important warning signs that could impact your investment decision.\nOur free ON Semiconductor research report provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate ON Semiconductor's overall financial health at a glance.\n\nWant Some Alternatives? Opportunities like this don't last. These are today's most promising picks. Check them out now:\nThe end of cancer? These 29 emerging AI stocks are developing tech that will allow early identification of life changing diseases like cancer and Alzheimer's.\nThis technology could replace computers: discover 28 stocks that are working to make quantum computing a reality .\nOutshine the giants: these 25 early-stage AI stocks could fund your retirement .\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include ON .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "23:00:40",
      "Source": "Barchart",
      "Title": "Stocks Supported by Strength in Cloud Stocks and Chip Makers",
      "URL": "https://finance.yahoo.com/m/4fd7a5ad-a021-3b53-8bd8-9a6a32d1cf60/stocks-supported-by-strength.html",
      "Content": "Stocks Supported by Strength in Cloud Stocks and Chip Makers\n\nRich Asplund\nFri, December 19, 2025 at 7:00 AM PST 7 min read\n\nIn this article: ORCL\n\nAPLD\n\n$IUXX\n\nSATS\n\nAMD\n\nThe S&P 500 Index ($SPX) (SPY) today is up by +0.63%, the Dow Jones Industrials Index ($DOWI) (DIA) is up by +0.52%, and the Nasdaq 100 Index ($IUXX) (QQQ) is up by +1.08%. March E-mini S&P futures (ESH26) are up +0.61%, and March E-mini Nasdaq futures (NQH26) are up +1.09%.\n\nStock indexes are moving higher today as a rally in cloud infrastructure stocks improves market sentiment and lifts the broader market. Oracle is up by more than 7% after TikTok CEO Chew said his company has signed binding agreements to create a US joint venture owned by American investors, including Oracle. Also, strength in chipmakers today supports the broader market.\nMore News from Barchart Is Cathie Wood Jumping Ship on Tesla Stock?\nBeyond Nvidia: The AI Stock to Buy With 205% Upside Potential\nAs Nvidia Launches New Nemotron 3 Models, Should You Buy, Sell, or Hold NVDA Stock?\nTired of missing midday reversals? The FREE Barchart Brief newsletter keeps you in the know. Sign up now!\nHigher bond yields are limiting gains in stocks today, as the 10-year T-note yield is up +3 bp to 4.15%. Global bond yields are climbing today, led by a surge in the 10-year Japanese government bond yield to a 26-year high of 2.025% after the BOJ raised interest rates and said it will keep raising rates if its economic and price outlook is realized.\n\nUpbeat comments today from New York Fed President John Williams were supportive for stocks but negative for bonds, as he said some data we're seeing is \"pretty encouraging\" and he sees no sign of sharp deterioration in the jobs data. He added that he sees US GDP growth of 1.5% to 1.75% this year, with growth picking up next year, and that there's \"no urgency to need to act further on monetary policy right now, because I think the cuts we've made have positioned us really well.\"\nStock market moves may be exaggerated and more volatile than usual today due to the expiration of options, futures, and derivatives during the quarterly event known as triple witching. According to Citigroup, a record $7.1 trillion of notional open interest will roll off the US options market today.\n\nThis week's market focus will be on US economic news. Later today, Nov existing home sales are expected to be up +1.2% m/m to 4.15 million. Also, the University of Michigan Dec consumer sentiment index is expected to be revised upward by +0.2 to 53.5 from the previously reported 53.3.\nThe markets are discounting a 20% chance that the FOMC will cut the fed funds target range by 25 bp at the next FOMC meeting on January 27-28.\n\nStory Continues\nOverseas stock markets are higher today. The Euro Stoxx 50 is up +0.04%. China’s Shanghai Composite climbed to a 1-week high and closed up +0.36%. Japan’s Nikkei Stock 225 closed up +1.03%.\nInterest Rates\nMarch 10-year T-notes (ZNH6) today are down by -7 ticks. The 10-year T-note yield is up +2.7 bp to 4.149%. Today's strength in stocks has reduced safe-haven demand for government debt securities and is weighing on T-notes. Also, hawkish comments from New York Fed President John Williams are undercutting T-note prices after he said some of the data we're seeing is \"pretty encouraging\" and that he sees no sign of sharp deterioration in the jobs data. In addition, T-notes have a negative carryover from today’s jump in the 10-year Japan government bond yield to a 26-year high of 2.025%.\n\nThe steepening yield curve is also bearish for T-note prices. Steepening trades occur when bond investors buy short-term government debt and sell long-term debt. The yield curve has steepened since last Wednesday’s FOMC meeting, when the Fed said it would begin purchasing up to $40 billion of short-term T-bills a month to boost liquidity in the financial system. Longer-term Treasury securities are also under pressure from concerns about inflation and the Fed’s independence.\nEuropean government bond yields are moving higher today. The 10-year German bund yield is up +3.4 bp to 2.884%. The 10-year UK gilt yield is up +3.8 bp to 4.518%.\nGerman Nov PPI fell -2.3% y/y, weaker than expectations of -2.2% y/y and the steepest pace of decline in 20 months.\n\nThe German Jan GfK consumer confidence index unexpectedly fell -3.5 to a 1.75-year low of -26.9, weaker than expectations of an increase to -23.0.\nUK Nov retail sales ex-auto fuel unexpectedly fell -0.2% m/m, weaker than expectations of an increase of +0.1% m/m.\nSwaps are discounting a 1% chance for a -25 bp rate cut by the ECB at its next policy meeting on February 5.\nUS Stock Movers\nCloud infrastructure stocks are rallying today as they recover from a recent sell-off on financing concerns in the AI supply chain. CoreWeave (CRWV) is up +8%, and Oracle (ORCL) is up more than +7% to lead gainers in the S&P 500. Also, Applied Digital (APLD) is up more than +4%, and Nebius Group NV (NBIS) is up more than +3%.\nChip stocks are moving higher today, a supportive factor for the overall market. Micron Technology (MU) is up more than +6% to lead gainers in the Nasdaq 100. Also, Lam Research (LRCX) is up more than +3%, and Nvidia (NVDA) is up more than +2% to lead gainers in the Dow Jones Industrials. In addition, Advanced Micro Devices (AMD), Applied Materials (AMAT), KLA Corp (KLAC), NXP Semiconductors NV (NXPI), and Intel (INTC) are up more than +2%. Finally, GlobalFoundries (GFS), Broadcom (AVGO), and Marvell Technology (MRVL) are up more than +1%.\n\nCryptocurrency-exposed stocks are climbing today, with Bitcoin (^BTCUSD) up more than +2%. Galaxy Digital Holdings (GLXY) and Riot Platforms (RIOT) are up more than +4%. Also, Strategy (MSTR) and Mara Holdings (MARA) are up more than +2%, and Coinbase Global (COIN) is up more than +1%.\nWhitefiber Inc (WYFI) is up more than +16% following the announcement of a 10-year 40 megawatt co-location agreement between its subsidiary Enovum Data Centers Corp. and Nscale Global Holdings, representing around $865 million in contracted revenue.\nEchostar Corp (SATS) is up more than +4% after Deutsche Bank raised its price target on the stock to $131 from $97.\nGenerac Holdings (GNRC) is up more than +2% after Wells Fargo Securities upgraded the stock to overweight from equal weight with a price target of $195.\n\nStryker Corp (SYK) is up more than +1% after Citizens JMP Securities LLC upgraded the stock to outperform from market perform with a price target of $440.\nCummins Inc (CMI) is up more than +1% after Barclays upgraded the stock to overweight from equal weight with a price target of $546.\nLamb Weston Holdings (LW) is down more than -19% to lead losers in the S&P 500 after forecasting full-year net sales of $6.35 billion to $6.55 billion, the midpoint below the consensus of $6.52 billion.\nNike (NKE) is down more than -9% to lead losers in the Dow Jones Industrials after forecasting Q3 revenue down in the low single digits and gross margins down about 175 to 225 basis points, amid persistent weakness in China.\nKB Home (KBH) is down more than -7% after reporting Q4 EPS of $1.55, weaker than the consensus of $1.79, and forecasting 2026 housing revenue of $5.10 billion to $6.10 billion, the midpoint below the consensus of $5.83 billion.\n\nLyft Inc (LYFT) is down more than -4% after Wedbush Securities downgraded the stock to underperform from neutral with a price target of $16.\nKBR Inc (KBR) is down more than -4% after Truist Securities cut its price target on the stock to $50 from $62.\nPaychex (PAYX) is down more than -3% to lead losers in the Nasdaq 100 after BMO Capital Markets said the company’s Q2 earnings signaled an “okay quarter,” but management-solutions growth was softer.\nFedEx (FDX) is down more than -2% after Morgan Stanley downgraded the stock to underweight from neutral with a price target of $210.\nElevance Health (ELV) is down more than -1% after Deutsche Bank downgraded the stock to hold from buy, citing a challenging macro environment.\nEarnings Reports(12/19/2025)\nCarnival Corp (CCL), Conagra Brands Inc (CAG), Lamb Weston Holdings Inc (LW), Paychex Inc (PAYX).\nOn the date of publication, Rich Asplund did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:29:09",
      "Source": "MT Newswires",
      "Title": "Onsemi, GlobalFoundries Team Up to Develop Gallium Nitride Power Devices",
      "URL": "https://finance.yahoo.com/news/onsemi-globalfoundries-team-develop-gallium-142909332.html",
      "Content": "PREMIUM\nOnsemi, GlobalFoundries Team Up to Develop Gallium Nitride Power Devices\n\nMT Newswires\nThu, December 18, 2025 at 6:29 AM PST\n\nIn this article: ON\n\nGFS\n\nOnsemi (ON) said Thursday it has signed a collaboration agreement with GlobalFoundries (GFS) to deve\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:50:00",
      "Source": "GlobeNewswire",
      "Title": "onsemi to Develop Next-Generation GaN Power Devices with GlobalFoundries",
      "URL": "https://finance.yahoo.com/news/onsemi-develop-next-generation-gan-135000400.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nonsemi to Develop Next-Generation GaN Power Devices with GlobalFoundries\n\nonsemi\nThu, December 18, 2025 at 5:50 AM PST 4 min read\n\nIn this article: ON\n\nGFS\n\nCollaboration expands onsemi’s power portfolio to include high-performance 650V lateral GaN solutions for AI data centers, automotive, aerospace, and other critical markets\nSummary:\nonsemi expands its leadership in intelligent power through a new collaboration agreement with GlobalFoundries (GF) to develop and manufacture next-generation gallium nitride (GaN) power devices, beginning with 650V. onsemi products will combine GF’s 200mm eMode GaN-on-silicon process with onsemi’s industry-leading silicon drivers, controllers, and thermally enhanced packaging to deliver smaller, more efficient systems optimized for AI data centers, automotive, industrial, and aerospace, defense, and security applications.\n\nNews Highlights:\nonsemi collaborates with GlobalFoundries to develop state-of-the-art 200mm eMode lateral GaN-on-Silicon process technology for critical markets, starting with 650V.\nonsemi’s GaN portfolio is ideally suited for high-density systems where power demands continue to rise but physical size cannot, including AI data centers, electric vehicles, renewable energy, and aerospace, defense, and security systems.\nApplications include power supplies, DC-DC converters, onboard chargers, solar microinverters, energy storage systems, and motor drives across a range of high-growth markets.\n\nSCOTTSDALE, Ariz., and MALTA, N.Y., Dec. 18, 2025 (GLOBE NEWSWIRE) -- onsemi (Nasdaq: ON) today announced it has signed a collaboration agreement with GlobalFoundries (Nasdaq: GFS) (GF) to develop and manufacture advanced gallium nitride (GaN) power products using GF’s state-of-the-art 200mm eMode GaN-on-silicon process, starting with 650V. This collaboration accelerates onsemi’s roadmap for high-performance GaN devices and integrated power stages, expanding its portfolio with high-voltage products to meet the growing power demands of AI data centers, electric vehicles, renewable energy, industrial systems, and aerospace, defense and security.\n\n“This collaboration brings together onsemi’s system and product expertise with GlobalFoundries’ advanced GaN process to deliver new 650V power devices for high-growth markets. Paired with our silicon drivers and controllers, these GaN products will enable customers to innovate and build smaller, more efficient power systems for AI data centers, EVs, space applications, and beyond. We are on track to begin providing samples to customers in the first half of 2026, and scale rapidly to volume production.” – Dinesh Ramanathan, Senior Vice President of Corporate Strategy, onsemi.\n“By combining our 200mm GaN-on-Si platform and U.S.-based manufacturing with onsemi’s deep system and product expertise, we’re accelerating high-efficiency solutions and building resilient supply chains for data centers, automotive, industrial, aerospace and defense, and other critical markets. With onsemi as a key partner, we will continue to advance GaN semiconductors that meet the evolving demands of AI, electrification, and sustainable energy.” – Mike Hogan, Chief Business Officer, GlobalFoundries.\n\nStory Continues\nonsemi will pair its industry-leading silicon drivers, controllers, and thermally enhanced packages with GF’s 650V GaN technology platform to deliver optimized GaN devices with higher power density and efficiency. These include power supplies and DC-DC converters for AI data centers, onboard chargers and DC-DC converters for electric vehicles, solar microinverters and energy storage systems, motor drives and DC-DC converters, for industrial and aerospace, defense, and security applications.\n\nThis effort expands onsemi’s leading power semiconductor portfolio, which now includes the full spectrum of GaN technologies – from low, medium and high voltage lateral GaN to ultra high-voltage vertical GaN – enabling system designers to build next-generation power architectures that deliver more power in smaller footprints. These GaN advantages include:\nHigher Frequency Operation – By operating at higher switching frequencies, GaN allows designers to reduce component count, system size, and cost while improving efficiency and thermal performance.\nBidirectional Capability – Bidirectional GaN capabilities enable entirely new topologies that can replace up to four traditional unidirectional transistors, cutting costs and simplifying designs.\nIntegrated Functionality – Combining GaN FETs with drivers, controllers, isolation, and protection in a single package allows for faster design cycles and lower electromagnetic interference. The thermally enhanced packages and optimized gate drivers push performance and reliability even at high switching speeds.\n\nTiming and Availability\nonsemi will begin sampling in the first half of 2026.\nAbout onsemi\nonsemi (Nasdaq: ON) is driving disruptive innovations to help build a better future. With a focus on automotive and industrial end-markets, the company is accelerating change in megatrends such as vehicle electrification and safety, sustainable energy grids, industrial automation, and 5G and cloud infrastructure. onsemi offers a highly differentiated and innovative product portfolio, delivering intelligent power and sensing technologies that solve the world’s most complex challenges and leads the way to creating a safer, cleaner and smarter world. onsemi is included in the Nasdaq-100 Index ® and S&P 500 ® index. Learn more about onsemi at www.onsemi.com .\n\nonsemi and the onsemi logo are trademarks of Semiconductor Components Industries, LLC. All other brand and product names appearing in this document are registered trademarks or trademarks of their respective holders. Although the Company references its website in this news release, information on the website is not to be incorporated herein.\nAbout GF\nGlobalFoundries (GF) is a leading manufacturer of essential semiconductors the world relies on to live, work and connect. We innovate and partner with customers to deliver more power-efficient, high-performance products for automotive, smart mobile devices, internet of things, communications infrastructure and other high-growth markets. With our global manufacturing footprint spanning the U.S., Europe and Asia, GF is a trusted and reliable source for customers around the world. Every day our talented, global team delivers results with an unwavering focus on security, longevity and sustainability. For more information, visit www.gf.com\nContact:\nonsemi\nMichael Mullaney\nmichael.mullaney@onsemi.com\nGlobalFoundries\nStephanie Gonzalez\nstephanie.gonzalez@gf.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 15
}