{
  "stock_id": "GFS",
  "last_updated": "2025-12-17T15:09:29.118Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-16",
      "Time": "01:15:10",
      "Source": "TheStreet",
      "Title": "MicroStrategy retains place in key index despite delisting threats",
      "URL": "https://finance.yahoo.com/m/cba38cdd-9ba2-335b-b438-621ce5281418/microstrategy-retains-place.html",
      "Content": "MicroStrategy retains place in key index despite delisting threats\n\nAnand Sinha\nMon, December 15, 2025 at 9:15 AM PST 2 min read\n\nIn this article: MSTR\n\nBTC-USD\n\n^NDX\n\nALNY\n\nMPWR\n\nMichael Saylor 's Bitcoin (BTC) treasury company, Strategy (Nasdaq: MSTR), earlier known as MicroStrategy, has been successful in retaining its spot in the Nasdaq 100 (NDQ).\nA benchmark stock market index in the U.S., the Nasdaq 100 tracks hundred of the largest non-financial companies by market capitalization listed on the exchange.\n\nRelated: MicroStrategy sends sharp warning letter to MSCI\nNasdaq has added six companies to the benchmark:\nAlnylam Pharmaceuticals, Inc. (Nasdaq: ALNY)\nFerrovial SE (Nasdaq: FER)\nInsmed Inc. (Nasdaq: INSM)\nMonolithic Power Systems (Nasdaq: MPWR)\nSeagate Technology Holdings plc (Nasdaq: STX)\nWestern Digital Corp. (Nasdaq: WDC)\nNasdaq has removed six companies from the index:\nBiogen (Nasdaq: BIIB)\nCDW Corporation (Nasdaq: CDW)\nGlobalfoundries (Nasdaq: GFS)\nLululemon Athletica (Nasdaq: LULU)\nOn Semiconductor (Nasdaq: ON)\nThe Trade Desk, Inc. (Nasdaq: TTD)\nThe changes will take effect prior to market open on Dec. 22.\nFor Strategy, keeping the spot is a major achievement because the Bitcoin-focused company has recently been beset by the risk of delisting from popular stock indices.\n\nStrategy world's largest corporate Bitcoin holder Strategy began as a software company founded in 1989 but turned to Bitcoin in 2020 when founder Michael Saylor became fascinated with the digital asset amid the coronavirus pandemic.\nWith the latest digital asset buy, it continues to be the world's largest corporate Bitcoin treasury, with 671,268 coins worth approximately $60 billion on its balance sheet.\n\nHowever, the company's Bitcoin acquisition model has come under intense scrutiny amid the crypto market crash, which saw BTC falling from the peak of $126,000 to $90,000 in a matter of weeks.\nMore News: Former Trump ally praises Michael Saylor's new Bitcoin move\nMichael Saylor's MicroStrategy moves billions in Bitcoin\nAnalyst downgrades MicroStrategy amid higher dilution\nStrategy faces delisting risk Last month, Wall Street giant JPMorgan Chase warned that the company risks getting delisted from major equity indices, including the MSCI USA Index.\nThe MSCI USA Index is another popular benchmark that tracks the performance of large-cap and mid-cap U.S. companies and represents approximately 85% of the U.S. stock market.\nMSCI confirmed considering the exclusion of public companies with more than 50% of the assets on their balance sheets dedicated to digital assets.\nIf the plan goes through, Strategy could become the first casualty of the index reshuffle. The Bitcoin proxy and the MSCI are engaged in talks .\n\nLa historia continúa\nLast week, Strategy wrote a scathing letter to the members of the MSCI Equity Index Committee and called their proposal \"misguided,\" \"discriminatory,\" \"arbitrary,\" and \"unworkable.\"\nBitcoin was exchanging hands at $89,607.51 at the time of writing, almost flat since last day.\nThe MSTR stock fell 3.74% to close at $176.45 on Dec. 12 and was trading at $176.01 in pre-market hours on Dec. 15.\nThis story was originally published by TheStreet on Dec 15, 2025, where it first appeared in the MARKETS section. Add TheStreet as a Preferred Source by clicking here.\n\nCondiciones y Política de privacidad\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-15",
      "Time": "22:11:59",
      "Source": "Investing.com",
      "Title": "Western Digital stock rises after inclusion in Nasdaq-100 Index",
      "URL": "https://finance.yahoo.com/news/western-digital-stock-rises-inclusion-141159374.html",
      "Content": "Western Digital stock rises after inclusion in Nasdaq-100 Index\n\nLouis Juricic\nMon, December 15, 2025 at 6:11 AM PST 1 min read\n\nIn this article: WDC\n\nSTX\n\nALNY\n\nINSM\n\nMPWR\n\nInvesting.com -- Western Digital Corp. (NASDAQ:WDC) stock rose 1.7% Monday following the announcement of its inclusion in the Nasdaq-100 Index as part of the annual reconstitution.\nThe data storage company was among six firms added to the influential index, which tracks the performance of the 100 largest non-financial companies listed on the Nasdaq Stock Market. Other additions included Seagate Technology Holdings (NASDAQ:STX), which gained 2%, Alnylam Pharmaceuticals (NASDAQ:ALNY), up 0.9%, Ferrovial SE (NASDAQ:FER), rising 0.7%, Insmed (NASDAQ:INSM), up 1.2%, and Monolithic Power Systems (NASDAQ:MPWR), which climbed 1.3%.\n\nThe changes will take effect prior to market open on Monday, December 22, 2025, according to Nasdaq's announcement. The reconstitution occurs annually in December, coinciding with the quadruple witch expiration Friday of the quarter.\nSix companies will be removed from the index as part of the rebalancing: Biogen (NASDAQ:BIIB), CDW Corporation (NASDAQ:CDW), GlobalFoundries (NASDAQ:GFS), lululemon athletica (NASDAQ:LULU), ON Semiconductor (NASDAQ:ON), and The Trade Desk (NASDAQ:TTD). Lululemon shares fell 1.1% following the news.\nThe Nasdaq-100 Index is widely tracked by investors, with more than 200 products based on the index representing over $600 billion in assets under management globally. The most prominent of these is the Invesco QQQ Trust (NASDAQ:QQQ), which aims to track the index's performance before expenses.\nRelated articles\nWestern Digital stock rises after inclusion in Nasdaq-100 Index\nSilver's Bullish Pattern Points Higher — Keep an Eye on $52 Resistance Zone\nLoading Up HEAVY on These 3 Stocks by End of 2025 (+ 1 New ETF)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-15",
      "Time": "20:03:17",
      "Source": "GuruFocus.com",
      "Title": "200% Surge? These 6 Stocks Just Crashed the Nasdaq 100 Party",
      "URL": "https://finance.yahoo.com/news/200-surge-6-stocks-just-120317669.html",
      "Content": "200% Surge? These 6 Stocks Just Crashed the Nasdaq 100 Party\n\nKhac Phu Nguyen\nMon, December 15, 2025 at 4:03 AM PST 2 min read\n\nIn this article: ^NDX\n\nALNY\n\nINSM\n\nFER\n\nLULU\n\nThis article first appeared on GuruFocus .\nNasdaq officials have outlined a reshaping of the Nasdaq 100 that could redirect investor attention as the index approaches its annual reconstitution. Ahead of the market open on Dec. 22, Alnylam Pharmaceuticals ( NASDAQ:ALNY ), Ferrovial ( NASDAQ:FER ), Insmed ( NASDAQ:INSM ), Monolithic Power Systems ( NASDAQ:MPWR ), Seagate Technology ( NASDAQ:STX ) and Western Digital ( NASDAQ:WDC ) are set to join the benchmark, while Biogen, CDW, GlobalFoundries, Lululemon Athletica, ON Semiconductor and The Trade Desk are scheduled for removal. The Nasdaq 100 continues to represent the largest non-financial companies listed on the Nasdaq exchange, subject to liquidity and other eligibility requirements rather than a fixed market-capitalization threshold.\n\nWarning! GuruFocus has detected 2 Warning Sign with ALNY.\nIs ALNY fairly valued? Test your thesis with our free DCF calculator.\nThe performance backdrop behind the reshuffle highlights a widening gap inside the index. Shares of The Trade Desk ( NASDAQ:TTD ) and Lululemone ( NASDAQ:LULU ), both exiting the benchmark, have fallen roughly 70% and 45% year to date, making them the weakest performers in the Nasdaq 100 on a percentage basis, according to Bloomberg-compiled data. In contrast, all six incoming constituents have recorded at least double-digit gains in 2025, with Seagate and Western Digital each rising more than 200%, possibly reflecting renewed momentum in select technology hardware and infrastructure segments.\nInclusion in the Nasdaq 100 could carry important implications for the new entrants, given that large passive vehicles such as the $409 billion Invesco QQQ Trust Series 1 ETF are required to hold index members. The Nasdaq 100 is up about 20% this year, outperforming the S&P 500s 16% gain and the Dow Jones Industrial Averages 14% advance, suggesting that index composition continues to matter for capital flows. As the reconstitution takes effect, investors may increasingly focus on how these additions and removals could influence demand dynamics across both active and passive portfolios.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-13",
      "Time": "09:21:59",
      "Source": "Reuters",
      "Title": "Bitcoin hoarding company Strategy remains in Nasdaq 100",
      "URL": "https://finance.yahoo.com/news/bitcoin-hoarder-company-strategy-remains-012159080.html",
      "Content": "Bitcoin hoarding company Strategy remains in Nasdaq 100\n\nReuters\nUpdated Sat, December 13, 2025 at 5:02 AM PST 1 min read\n\nIn this article: MSTR\n\nBTC-USD\n\n^NDX\n\nALNY\n\nFER\n\nDec 12 (Reuters) - Bitcoin hoarding giant Strategy ( MSTR ) clung to its place in the Nasdaq 100 on ​Friday, continuing its year-long stint in the benchmark ‌at a time where analysts have raised questions over its business ‌model.\nSome market watchers have suggested Strategy's pioneering business model of buying-and-holding bitcoin, which has spawned dozens of copycats, more closely resembles that of an investment fund.\n\nConcerns have grown ⁠over the sustainability of ‌crypto treasury companies, whose shares have proved extremely sensitive to bitcoin's gyrations.\nNasdaq said Biogen, ‍CDW Corporation, Globalfoundries, Lululemon Athletica, On Semiconductor and Trade Desk were removed from the tech-heavy exchange's benchmark index.\n\nNew entrants included ​Alnylam Pharmaceuticals, Ferrovial, Insmed, Monolithic Power Systems, Seagate Technology ‌and Western Digital.\nStrategy started out as software company, MicroStrategy, but pivoted to bitcoin investing in 2020. It was included in the Nasdaq 100 last December under the index's technology sub-category.\nGlobal index provider MSCI has also raised ⁠concerns about the presence of digital-asset ​treasury companies in its benchmarks. ​MSCI is due to decide in January whether to exclude Strategy and similar companies.\nThe Nasdaq ‍changes are expected ⁠to take effect on December 22. The Nasdaq 100 index tracks the largest non-financial companies by market ⁠capitalization listed on the exchange.\n(Reporting by Shashwat Chauhan and Ruchika Khanna ‌in Bengaluru; Editing by Anil D'Silva and ‌Christian Schmollinger and William Mallard)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-12",
      "Time": "23:12:30",
      "Source": "CFO Dive",
      "Title": "GlobalFoundries interim CFO takes permanent seat",
      "URL": "https://finance.yahoo.com/m/6030dd1f-6ba8-3bab-a34d-f15961fd0784/globalfoundries-interim-cfo.html",
      "Content": "GlobalFoundries interim CFO takes permanent seat\n\nGrace Noto\nFri, December 12, 2025 at 7:12 AM PST 4 min read\n\nIn this article: GFS\n\nThis story was originally published on CFO Dive . To receive daily news and insights, subscribe to our free daily CFO Dive newsletter .\nDive Brief: Semiconductor manufacturer GlobalFoundries announced Sam Franklin will take on the role of finance chief on a permanent basis , after serving as its interim CFO since October, the company announced in a Wednesday press release.\nThe appointment comes approximately two months after Franklin stepped in as interim CFO for the Malta, New York-based business, following the departure of previous CFO John Hollister &mdash; who left his role after just over a year in the seat, citing personal reasons, CFO Dive previously reported.\nFranklin&rsquo;s &ldquo;proven leadership and financial expertise will accelerate GF&rsquo;s momentum and capitalize on the significant opportunities ahead,&rdquo; CEO Tim Breen said in a statement included in the release. &ldquo;As we continue to drive profitability and deliver differentiated technologies for the scaling of AI from the data center to the physical world, Sam&rsquo;s ability to deliver results and partner across the organization will be critical to our success.&rdquo;\n\nDive Insight: Prior to taking the interim CFO seat, Franklin served as GlobalFoundries&rsquo; senior vice president of business finance, operations and investor relations. He joined the company in September 2022 as its VP of capital markets, treasury and investor relations, according to his LinkedIn profile. Before GlobalFoundries, he served as SVP, direct investments for United Arab Emirates sovereign investor Mubadala and as a director for MUFG.\n\nThe company will look to tap Franklin&rsquo;s &ldquo;extensive financial leadership experience&rdquo; and &ldquo;deep understanding&rdquo; of its operations and finance functions as it seeks to capitalize on the artificial intelligence boom &mdash; aiming for a top slot in an increasingly competitive industry as growing AI needs push up the demand for chips globally.\n&ldquo;As the secular drivers and demand for semiconductors continue to ramp, GF is building a strong foundation for its next phase of robust, sustainable and profitable growth,&rdquo; Franklin said of his appointment in a statement included the release. &ldquo;I look forward to working with our talented teams across the world to advance our strategic priorities, drive operational excellence and create long-term value for our shareholders.&rdquo;\n\nIn past months, GlobalFoundries has announced a number of partnerships, investments and executive hires aimed at facilitating further growth. In October, a day after its announcement of Franklin&rsquo;s appointment as interim CFO, GlobalFoundries announced it would be investing approximately $1.3 billion into expanding its manufacturing site in Dresden, Germany, with the goal of increasing its production capacity to over one million wafers by the end of 2028.\n\nStory Continues\nOn Thursday, GlobalFoundries announced a team-up with German technology business Siemens AG to &ldquo;leverage each company&rsquo;s complementary AI-based capabilities to enhance performance of semiconductor manufacturing and advanced industries,&rdquo; it said in a press release.\nThe company has also made strategic leadership hires, tapping Matthew Zack as its chief corporate development officer &mdash; highlighting key areas of focus including mergers and acquisitions, strategic partnerships and targeted venture investments as GlobalFoundries looks to expand its global technology portfolio, it said in a Dec. 1 announcement.\n\nGlobalFoundries&rsquo; moves to foster growth and product come as rising chip demand has also sparked growing competition on the world stage, with government and business leaders in the U.S., China and the European Union vying to establish themselves as the dominant players in semiconductor manufacturing, according to a recent Bloomberg report.\nUnder President Donald Trump, for example, the U.S. government took a 10% stake in chipmaker Intel in a bid to bolster American manufacturing efforts. Chips have also emerged as a key battleground in the Trump administration&rsquo;s ongoing trade negotiations with China. Last month, the two countries reached an economic agreement, part of which includes China dropping investigations and restrictions on U.S. semiconductor companies , according to a Nov.1 fact sheet published by the White House.\n\nPlans touted by Trump in August to impose 100% tariffs on semiconductor imports, meanwhile, have reportedly been delayed, with Washington officials debating their timing and details, according to a Nov. 20 report by Reuters citing people familiar with the matter.\nIn a statement sent to Reuters, a White House spokesperson disputed the reports of the discussions, noting &ldquo;the Trump Administration remains committed to using every lever of executive power to reshore the manufacturing that&rsquo;s critical to our national and economic security. Any anonymously-sourced reports suggesting otherwise are simply Fake News.\"\nGlobalFoundries did not immediately respond to requests for comment.\nRecommended Reading\nTech firms hunt for ‘operating’ CFOs\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-12",
      "Time": "21:11:56",
      "Source": "Simply Wall St.",
      "Title": "Should Siemens AI Push Into GlobalFoundries Fabs Reshape Its Automation Story For (XTRA:SIE) Investors?",
      "URL": "https://finance.yahoo.com/news/siemens-ai-push-globalfoundries-fabs-131156043.html",
      "Content": "Should Siemens AI Push Into GlobalFoundries Fabs Reshape Its Automation Story For (XTRA:SIE) Investors?\n\nSimply Wall St\nFri, December 12, 2025 at 5:11 AM PST 3 min read\n\nIn this article: SIEGY\n\nSMAWF\n\nGFS\n\nSiemens and GlobalFoundries recently signed a memorandum of understanding to integrate AI-driven automation, electrification, and digital solutions across semiconductor manufacturing operations.\nThis collaboration positions Siemens more firmly within semiconductor production workflows, potentially deepening its role in high-value industrial AI and fab automation ecosystems.\nWe’ll now examine how this AI-focused semiconductor partnership could influence Siemens’ automation-led investment narrative and longer-term earnings profile.\n\nExplore 27 top quantum computing companies leading the revolution in next-gen technology and shaping the future with breakthroughs in quantum algorithms, superconducting qubits, and cutting-edge research.\nSiemens Investment Narrative Recap To own Siemens, you need to believe in its ability to turn its global automation, electrification and industrial software footprint into steadily growing, higher margin digital revenues. The new AI-driven GlobalFoundries partnership reinforces that narrative, but does not materially change the biggest short term swing factor, which remains demand weakness in core automation and software, nor the key risk from intensifying global competition, especially in China.\n\nAmong recent announcements, the expanded collaboration with Capgemini on AI native digital solutions is most relevant, as it underlines Siemens’ push to embed industrial AI and end to end automation across sectors beyond semiconductors. Together with the GlobalFoundries MoU, it speaks directly to the core catalyst many shareholders are watching: the shift toward more software, more recurring revenue and deeper integration into customers’ critical operations.\nYet, against this AI and automation optimism, investors should be aware that growing competition from aggressive local automation players in China could...\nRead the full narrative on Siemens (it's free!)\nSiemens' narrative projects €93.6 billion revenue and €10.5 billion earnings by 2028. This requires 6.1% yearly revenue growth and an earnings increase of about €2.6 billion from €7.9 billion today.\n\nUncover how Siemens' forecasts yield a €253.00 fair value , a 6% upside to its current price.\nExploring Other Perspectives Nine members of the Simply Wall St Community currently see Siemens’ fair value between €208.46 and €297.77, underscoring how far opinions can differ. Against this wide range, the key question is whether Siemens’ push into AI enabled automation can offset structural pressure on its Digital Industries division and support the kind of earnings profile many shareholders appear to be assuming.\n\nStory Continues\nExplore 9 other fair value estimates on Siemens - why the stock might be worth as much as 25% more than the current price!\nBuild Your Own Siemens Narrative Disagree with existing narratives? Create your own in under 3 minutes - extraordinary investment returns rarely come from following the herd.\nA great starting point for your Siemens research is our analysis highlighting 3 key rewards and 1 important warning sign that could impact your investment decision.\nOur free Siemens research report provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate Siemens' overall financial health at a glance.\n\nSeeking Other Investments? Don't miss your shot at the next 10-bagger. Our latest stock picks just dropped:\nThese 9 companies survived and thrived after COVID and have the right ingredients to survive Trump's tariffs . Discover why before your portfolio feels the trade war pinch.\nUncover the next big thing with financially sound penny stocks that balance risk and reward .\nThe best AI stocks today may lie beyond giants like Nvidia and Microsoft. Find the next big opportunity with these 25 smaller AI-focused companies with strong growth potential through early-stage innovation in machine learning, automation, and data intelligence that could fund your retirement.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include SIE.DE .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-12",
      "Time": "16:38:50",
      "Source": "Verdict",
      "Title": "Siemens and GF partner on AI-driven semiconductor manufacture",
      "URL": "https://finance.yahoo.com/m/c98f526c-af56-31f6-b250-d6a1996806ba/siemens-and-gf-partner-on.html",
      "Content": "Siemens and GF partner on AI-driven semiconductor manufacture\n\nBV Swagath\nFri, December 12, 2025 at 12:38 AM PST 3 min read\n\nIn this article: SIEGY\n\nGFS\n\nSiemens and GlobalFoundries (GF) have announced a new partnership to integrate AI-driven technologies into semiconductor manufacturing, targeting increased efficiency and reliability across production processes.\nThe collaboration, formalised through a memorandum of understanding (MoU), spans areas such as fab automation, electrification, and the deployment of digital solutions throughout the semiconductor lifecycle.\n\nThe companies will focus on implementing advanced AI-enabled software, sensors, and real-time control systems within semiconductor fabrication environments.\nThrough centralised automation and predictive maintenance, Siemens and GF plan to raise equipment availability and streamline chip production workflows.\nBoth organisations intend to pilot these solutions in their own manufacturing operations with the potential to extend successful approaches into other advanced technology sectors.\nAccording to the parties, this agreement comes as demand surges for semiconductors in critical domains including AI, defence, energy infrastructure, and global connectivity platforms.\nBy combining expertise, Siemens and GF seek to address industry requirements for secure and reliable supply chains while aiming to enhance industrial resilience through automation.\n\nSiemens brings to the table its suite of technologies for industrial, energy, and building automation, alongside software for chip design, manufacturing process management, fab automation, and product lifecycle management. These capabilities are expected to support seamless integration across multiple stages of semiconductor production and delivery.\nSiemens managing board member and digital industries CEO Cedrik Neike said: “Our economy runs on Silicon – one wafer at a time. Chips are critical for applications like robotics or connectivity and for bringing AI into the physical world and industry.\n“We are collaborating to make global semiconductor supply chains more resilient and to enable efficient localised manufacturing around the world.”\nThe Siemens-GF partnership is structured to allow both companies to leverage these tools in developing and manufacturing high-performance chips at scale.\n\nGF contributes specialised process technology and design expertise through its foundry operations as well as through MIPS, its subsidiary focused on RISC-V processor IP.\nTogether with Siemens’ technologies, this expertise will be applied to accelerate development cycles for custom semiconductor solutions tailored to applications such as autonomous systems and AI hardware platforms.\n\nStory Continues\nGF’s operational footprint includes manufacturing facilities across the US, Asia, and Europe. Its Dresden site remains the largest semiconductor production facility in Europe with approximately 3,000 employees.\nGF CEO Tim Breen said: “Secure, locally manufactured semiconductors are at the core of the AI transition – from cloud to the physical world, bringing intelligence into devices we use every day and enabling applications we couldn’t imagine a few years ago.\n\n“Our unique collaboration with Siemens allows us to go faster – to build the technologies that make this possible – differentiated, energy-efficient, connected and secure chips across a wide range of next-generation applications.”\nIn November 2025, GF entered into a separate long-term partnership with Navitas Semiconductor aimed at advancing gallium nitride (GaN) technology in the US.\nThe agreement covers the co-development and delivery of solutions for high-power applications including datacentres, high-performance computing infrastructure, grid systems, and industrial electrification initiatives. The move is designed to reinforce domestic GaN supply chains while supporting decarbonisation objectives in emerging energy and compute markets.\n\"Siemens and GF partner on AI-driven semiconductor manufacture\" was originally created and published by Verdict , a GlobalData owned brand.\n\nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-11",
      "Time": "20:07:55",
      "Source": "MT Newswires",
      "Title": "GlobalFoundries Secures $579.8 Million in German State Support to Build Chip Factory",
      "URL": "https://finance.yahoo.com/news/globalfoundries-secures-579-8-million-120755049.html",
      "Content": "PREMIUM\nGlobalFoundries Secures $579.8 Million in German State Support to Build Chip Factory\n\nMT Newswires\nThu, December 11, 2025 at 4:07 AM PST 1 min read\n\nIn this article: GFS\n\nGlobalFoundries (GFS) will receive 495 million euros ($579.8 million) in German state aid to support\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-11",
      "Time": "19:22:01",
      "Source": "MT Newswires",
      "Title": "GlobalFoundries Names Sam Franklin as Chief Financial Officer",
      "URL": "https://finance.yahoo.com/news/globalfoundries-names-sam-franklin-chief-112201205.html",
      "Content": "PREMIUM\nGlobalFoundries Names Sam Franklin as Chief Financial Officer\n\nMT Newswires\nThu, December 11, 2025 at 3:22 AM PST\n\nIn this article: GFS\n\nGlobalFoundries (GFS) said late Wednesday it appointed Sam Franklin as chief financial officer, effe\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-11",
      "Time": "07:25:12",
      "Source": "Reuters",
      "Title": "GlobalFoundries names Sam Franklin as CFO after interim stint",
      "URL": "https://finance.yahoo.com/news/globalfoundries-names-sam-franklin-cfo-232512088.html",
      "Content": "GlobalFoundries names Sam Franklin as CFO after interim stint\n\nReuters\nWed, December 10, 2025 at 3:25 PM PST 1 min read\n\nIn this article: GFS\n\nAMD\n\nQCOM\n\nNXPI\n\n(Corrects first paragraph to say Franklin replaced John Hollister, not David Reeder)\nDec 10 (Reuters) - ​GlobalFoundries on Wednesday appointed Sam Franklin ‌as its chief financial officer, succeeding John Hollister, who ‌stepped down earlier this year.\nFranklin, interim CFO since October, previously served as senior vice president of business finance and operations and investor relations ⁠at GlobalFoundries.\n\nPrior to ‌joining GlobalFoundries in 2022, Franklin held senior finance roles at Mubadala Investment ‍Company, MUFG Bank and Barclays.\nFranklin's leadership will help the company \"capitalize on significant opportunities ahead\" as demand for ​semiconductors accelerates with the rise of artificial ‌intelligence , said CEO Tim Breen.\nGlobalFoundries has been investing in differentiated technologies to support AI workloads from data centers.\nOne of the few large foundries with significant capacity outside China and Taiwan, GlobalFoundries ⁠makes chips for companies ​including Advanced Micro Devices, Qualcomm ​and NXP Semiconductors. It runs chip plants in Germany, Singapore, New York, and ‍Vermont.\nLast month, ⁠the company had forecast fourth-quarter revenue of $1.80 billion, plus or minus $25 million, a touch ⁠above estimates of $1.79 billion, according to data compiled by ‌LSEG.\n(Reporting by Kritika Lamba in Bengaluru; ‌Editing by Maju Samuel)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 10
}