{
  "stock_id": "GOOG",
  "last_updated": "2025-12-18T14:44:29.488Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-18",
      "Time": "22:35:06",
      "Source": "Yahoo Finance",
      "Title": "Stock market today: Dow, S&P 500, Nasdaq rise as CPI inflation eases in November, Micron boosts tech",
      "URL": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-rise-as-cpi-inflation-eases-in-november-micron-boosts-tech-143506528.html",
      "Content": "LIVE\n\nStock market today: Dow, S&P 500, Nasdaq rise as CPI inflation eases in November, Micron boosts tech\n\nKaren Friar and Brett LoGiurato\nUpdated Thu, December 18, 2025 at 6:35 AM PST 2 min read\n\nIn this article: MU\n\n^DJI\n\nGOOG\n\n^IXIC\n\nNVDA\n\nUS stocks rose on Thursday, eyeing a recovery from Wall Street's tech-fueled sell-off, as investors digested the easing inflation pressures from the latest reading on consumer prices that could help set expectations for the path of interest rates.\nThe tech-heavy Nasdaq Composite ( ^IXIC ) led the way up with a gain of 1.5%, pushed north by a strong earnings report from Micron ( MU ) after AI trade worries spurred another bruising session for tech on Wednesday. Shares in the benchmark S&P 500 ( ^GSPC ) and the blue chip-heavy Dow Jones Industrial Average ( ^DJI ) rose around 1% and 0.7%, respectively.\n\nHeadlining the morning was a cooler-than-expected Consumer Price Index (CPI) report, which showed inflation rose 2.7% in November over the prior year and 2.6% on a \"core\" basis — both figures coming in below economist estimates of 3% and 3.1%, respectively.\nAs with Tuesday's monthly jobs report , economists have noted that the inflation data may be less reliable than normal thanks to the US government shutdown. At the same time, the Federal Reserve seems more attentive to cracks in the labor market than to price pressures. On Wednesday, Fed governor Chris Waller signaled support for rate cuts before the release of the CPI update.",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:05:11",
      "Source": "Reuters",
      "Title": "Trump Media bets on fusion energy with $6 billion TAE deal",
      "URL": "https://finance.yahoo.com/m/feae638c-4bbb-3820-ba34-86fb071d46f7/trump-media-bets-on-fusion.html",
      "Content": "Trump Media bets on fusion energy with $6 billion TAE deal\n\nBy Deborah Mary Sophia and Timothy Gardner\nThu, December 18, 2025 at 6:05 AM PST 3 min read\n\nIn this article: TATE.PVT\n\nGOOGL\n\nBy Deborah Mary Sophia and Timothy Gardner\nDec 18 (Reuters) - U.S. President Donald Trump is getting into the fusion power business through a $6 billion merger of his social media firm and Google-backed TAE technologies, just days after industry representatives ​urged federal funding.\nThe all-stock deal announced on Thursday is an ambitious bet on the power boom spurred by artificial ‌intelligence datacenters and adds to the Trump family's growing roster of diverse ventures from cryptocurrency to real estate holdings and mobile services.\n\nGrowing electricity needs of the technology industry ‌has in recent months revived interest in nuclear power, including restarting fully shuttered reactors, expanding existing plants and signing contracts for future small modular reactors.\nBut despite decades of global efforts, nuclear fusion, often seen as a cleaner and reliable power source, has yet to produce a commercially viable reactor.\nTAE has been working with Google Research for more than a decade on fusion science and its backers include Chevron and Sumitomo Corporation ⁠of Americas.\nThe company, which was founded in 1998, ‌also operates an energy-storage business and a life sciences unit that develops biologically targeted radiotherapy to treat cancer.\nDEAL TERMS\nShareholders of both companies will own about 50% of the combined entity after the deal closes in ‍mid-2026. Trump Media and Technology Group will be the holding company for businesses including Truth Social platform, TAE Power Solutions and TAE Life Sciences.\n\nTrump Media shares jumped 33% in premarket trading, drawing traction on Stocktwits, a social media hub for retail investors. The money-losing company's stock has declined nearly 70% ​this year.\n\"TAE will also clearly have major political support from President Trump in our view,\" Wedbush analyst Dan Ives said.\nFUSION TECHNOLOGY\nCompanies and ‌physicists at national laboratories have been trying for decades to foster fusion reactions, in which light atoms are forced together under extreme temperatures to release huge amounts of energy, a process that fuels the sun.\nBig hurdles to commercialize fusion include getting more energy out of a reaction than what goes into it and developing plants that can withstand streams of fusion reactions to power the grid.\n\nTAE CEO Binderbauer and other fusion company leaders met with U.S. Energy Department officials this month, weeks after the department formed its first ever fusion ⁠office.\nThe company, which has raised more than $1.3 billion in private funding, is aiming ​to develop and sell next‑generation neutral beam systems for fusion and related applications ​in a more cost‑effective manner.\n\nStory Continues\nTrump Media has agreed to provide up to $200 million in cash to TAE at signing and $100 million more upon initial filing of the registration. The deal has been approved by the companies' boards.\nThe ‍two companies plan to begin construction ⁠on the world's first utility-scale fusion power plant after the deal closes.\n\nTrump Media CEO Devin Nunes will be the co-CEO of the new company, along with Binderbauer. The combined company will have a nine-member board, including Nunes, Binderbauer and Donald Trump ⁠Jr.\nThe company, which mainly generates revenue from advertising on the Truth Social platform, has consistently clocked losses since its inception. It posted a decline in revenue and ‌a loss of $54.8 million the third quarter ended September.\n(Reporting by Deborah Sophia and Vallari Srivastava in Bengaluru and Timothy ‌Gardner in Washington DC ; Editing by Shilpi Majumdar and Arun Koyyur)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:00:00",
      "Source": "Business Wire",
      "Title": "Dynatrace Expands Collaboration with Google Cloud to Help Power the Next Generation of AI Innovation",
      "URL": "https://finance.yahoo.com/news/dynatrace-expands-collaboration-google-cloud-140000141.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nDynatrace Expands Collaboration with Google Cloud to Help Power the Next Generation of AI Innovation\n\nBusiness Wire\nThu, December 18, 2025 at 6:00 AM PST 4 min read\n\nIn this article: DT\n\nGOOG\n\nAs a launch partner for Gemini Enterprise and Gemini CLI extensions, Dynatrace integrations are now available on Google Cloud Marketplace\nBOSTON, December 18, 2025 --( BUSINESS WIRE )-- Dynatrace , (NYSE: DT), the leading AI-powered observability platform, today announced it has expanded its collaboration with Google Cloud to help empower enterprises and developers to harness the full potential of agentic AI by becoming a launch partner for Gemini CLI extensions and Gemini Enterprise , a new agentic platform.\n\nThe Dynatrace Gemini CLI Extension gives developers immediate access to observability and root-cause analysis directly within their terminal, allowing them to monitor, debug, and optimize applications without leaving their workflow.\nComplementing this, Gemini Enterprise connects AI agents directly to Dynatrace’s observability platform via Google’s A2A protocol, enabling real-time collaboration between systems to help detect, resolve, and prevent issues across complex environments.\nTo simplify adoption, Dynatrace AI-driven integrations are now available through Google Cloud Marketplace, enabling customers to deploy and scale agentic AI solutions quickly and securely within their existing Google Cloud environments.\nDynatrace is among the first observability partners with a Google-validated A2A and Gemini Enterprise-compatible agent, demonstrating that its technology meets Google Cloud’s standards for performance and reliability. This achievement places Dynatrace within Google Cloud’s validated partner ecosystem, reinforcing its leadership in AI-powered observability and agentic architectures.\n\n\"Our expanded partnership with Google Cloud reflects Dynatrace’s leadership position in observability and our commitment to shaping how AI transforms cloud operations,\" said Jay Snyder, SVP of Partners and Alliances, Dynatrace. \"As a launch collaborator for both Gemini Enterprise and Gemini CLI extensions, we’re working with Google Cloud at the forefront of AI and observability innovation, helping customers build intelligent, reliable systems that adapt and optimize in real time.\"\n\"Accelerating AI across the enterprise requires a visibility that connects developer innovation directly with operational resilience,\" said Mitch Ashley, VP and Practice Lead, Futurum Research. \"Dynatrace's Gemini CLI Extension, combined with Dynatrace's Agent-to-Agent (A2A) integration into Gemini Enterprise, removes friction and increases velocity for operations to keep the enterprise in the flow of utilizing agentic AI as a scalable core business driver.\"\n\nStory Continues\nResources:\nPartners Powering the Gemini Enterprise Agent Ecosystem\nScaling AI Agents with Google Cloud Marketplace and Gemini Enterprise\nNow Open for Building: Introducing Gemini CLI Extensions\nWhen Your Service Won’t Wait: Troubleshooting EasyTrade with Dynatrace MCP and Gemini CLI\nAbout Dynatrace\nDynatrace is advancing observability for today’s digital businesses, helping to transform the complexity of modern digital ecosystems into powerful business assets. By leveraging AI-powered insights, Dynatrace enables organizations to analyze, automate, and innovate faster to drive their business forward. To learn more about how Dynatrace can help your business, visit www.dynatrace.com , visit our blog and follow us on LinkedIn and X @dynatrace .\n\nCurious to see how you can simplify your cloud and maximize the impact of your digital teams? Let us show you. Sign up for a 15-day Dynatrace trial .\nDynatrace and the Dynatrace logo are trademarks of the Dynatrace, Inc. group of companies. All other trademarks are the property of their respective owners. © 2025 Dynatrace LLC.\nCautionary Language Concerning Forward-Looking Statements\nThis press release includes certain \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995, including statements regarding Dynatrace’s and Google Cloud’s respective capabilities and the expected benefits to organizations from the partnership between Dynatrace and Google Cloud, and from using Dynatrace and Google Cloud. These forward-looking statements include all statements that are not historical facts and statements identified by words such as \"will,\" \"expects,\" \"anticipates,\" \"intends,\" \"plans,\" \"believes,\" \"seeks,\" \"estimates,\" and words of similar meaning. These forward-looking statements reflect our current views about our plans, intentions, expectations, strategies, and prospects, which are based on the information currently available to us and on assumptions we have made. Although we believe that our plans, intentions, expectations, strategies, and prospects as reflected in or suggested by those forward-looking statements are reasonable, we can give no assurance that the plans, intentions, expectations, or strategies will be attained or achieved. Actual results may differ materially from those described in the forward-looking statements and will be affected by a variety of risks and factors that are beyond our control, including the risks set forth under the caption \"Risk Factors\" in our Annual Report on Form 10-K, subsequent Quarterly Reports on Form 10-Q, and our other SEC filings. We assume no obligation to update any forward-looking statements contained in this document as a result of new information, future events, or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251218145344/en/\nContacts\nMedia Relations:\nDynatrace PR Team\npr-team@dynatrace.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:08:14",
      "Source": "Yahoo Finance",
      "Title": "AI data centers are eating the memory industry, and it could hurt your wallet",
      "URL": "https://finance.yahoo.com/news/ai-data-centers-are-eating-the-memory-industry-and-it-could-hurt-your-wallet-130814928.html",
      "Content": "AI data centers are eating the memory industry, and it could hurt your wallet\n\nDaniel Howley · Technology Editor\nUpdated Thu, December 18, 2025 at 5:09 AM PST 3 min read\n\nIn this article: MU\n\nGOOG\n\nOPAI.PVT\n\nSSNLF\n\n000660.KS\n\nMemory maker Micron ( MU ) reported a blowout first quarter earnings report on Wednesday, beating expectations on the top and bottom lines and offering a better-than-anticipated outlook for the second quarter, as data center builders look to grab as much of the company's memory chips as possible.\nMicron builds memory, known as DRAM, for data centers. And as data center construction booms in the US, that memory is selling at a premium.\n\nThere's just one problem: DRAM is also used in devices like smartphones and laptops.\nConsumer PCs and other systems use a type of DRAM called double data rate memory (DDR), while data centers use a version of DRAM called high-bandwidth memory, HBM.\nDRAM suppliers are currently focusing more on building HBM than DRAM, thanks to higher margins on data center parts. And that's starving the broader market.\nIt's not just PC buyers who are feeling the sting, either. Everything from cars to medical equipment could be impacted by the dearth of memory chips.\nCompounding that is the fact that, ahead of its earnings, Micron announced that it is exiting the consumer memory business to focus on providing memory to AI data centers.\n\"It's not going to be good for consumers, because it's driving prices up, and very soon,” Ryan Reith, group vice president for IDC's worldwide device tracker, told Yahoo Finance.\nA massive memory crunch While most of us tend to think of GPUs powering AI data centers, they're only part of the server clusters that run apps like OpenAI's ( OPAI.PVT ) ChatGPT and Google's ( GOOG , GOOGL ) Gemini. In addition to CPUs and storage, they also need large pools of memory.\nThe problem? There are only a few major memory manufacturers in the world. That includes big-name companies like Samsung, SK Hynix, and Micron ( MU ). And the incredible demand for data center equipment is driving up prices across the entire industry.\n\nAccording to Reuters , Samsung has increased the prices of some memory by as much as 60%. Enthusiast site PCPartPicker , which tracks the prices of various memory sticks, shows the cost of some memory climbing from $100 to nearly $450.\n\"I think the general consensus is that in the last month … this has gotten a lot more attention, and not in a positive way,\" Reith said, adding that the price impact will likely end up getting passed through to consumers, especially on low-cost laptops.\nThat's because companies that produce entry-level and midrange systems have less room to maneuver when it comes to pricing before they completely eat through their margins.\n\nStory continues\n\n\"All of those things are essentially PCs. Any embedded device, game consoles, specialized medical equipment, those are all embedded computers, and they all have memory, and they all have storage of some kind,\" TECHnalysis Research founder and chief analyst Bob O'Donnell told Yahoo Finance.\n\nBut memory companies don't necessarily mind if there's a shortage of components for PCs and other systems as long as they're raking in cash on HBM, especially because the margins on HBM are higher than other types of memory.\nThere are some ways device makers can try to offset the increased price of memory, including using cheaper, less powerful components elsewhere in their products or putting pressure on suppliers to reduce costs, explained Bernstein analyst Stacy Rasgon.\nThis isn't the first time the tech industry has had to contend with memory supply problems, however. It is, after all, a notoriously cyclical market.\n\"What happens is, there's huge demand, and capacity gets built out, but it's never smooth,\" O'Donnell said.\n\n\"So … you get to the point where all demand gets sucked up, so you build these new factories, then you end up with a ton more capacity, and then the prices drop precipitously because there's too much capacity,\" he added.\nBut with so many companies building data centers across the globe, it's difficult to tell when the memory market will come back down.\nEmail Daniel Howley at dhowley@yahoofinance.com. Follow him on Twitter at @DanielHowley .\nFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here\nRead the latest financial and business news from Yahoo Finan ce.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:08:00",
      "Source": "The Wall Street Journal",
      "Title": "Trump Media to Merge With Fusion Energy Firm in $6 Billion Deal",
      "URL": "https://finance.yahoo.com/m/ff675e29-27a3-38f2-ae04-2ea028d72682/trump-media-to-merge-with.html",
      "Content": "Trump Media to Merge With Fusion Energy Firm in $6 Billion Deal\n\nGareth Vipers\nThu, December 18, 2025 at 5:08 AM PST 2 min read\n\nIn this article: TATE.PVT\n\nGOOG\n\nShares in the president’s media company jumped premarket after it agreed to a tie-up with TAE Technologies in an all-stock deal.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:00:00",
      "Source": "PR Newswire",
      "Title": "Data Center Capex Up 59 Percent on Continued AI Investment in 3Q 2025, According to Dell'Oro Group",
      "URL": "https://finance.yahoo.com/news/data-center-capex-59-percent-130000640.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nData Center Capex Up 59 Percent on Continued AI Investment in 3Q 2025, According to Dell'Oro Group\n\nPR Newswire\nThu, December 18, 2025 at 5:00 AM PST 3 min read\n\nIn this article: AMZN\n\nGOOG\n\nORCL\n\nMETA\n\nMSFT\n\nAccelerated Server Demand and Hyperscale Cloud expansion Drive Broad-based Infrastructure Spending\nREDWOOD CITY, Calif. , Dec. 18, 2025 /PRNewswire/ -- According to a recently published report by Dell'Oro Group, the trusted source for market information about the telecommunications, security, networks, and data center industries, worldwide data center capital expenditures increased 59 percent year-over-year, marking the eighth consecutive quarter of double-digit growth as the AI investment cycle continues to broaden beyond early, training-focused deployments.\n\"The Top 4 US cloud service providers—Amazon, Google, Meta, and Microsoft—continue to raise data center capex expectations for 2025, supported by increased investments in both AI and general-purpose infrastructure. Oracle is also on track to double its data center capex this year as it expands capacity for the Stargate project,\" said Baron Fung, Senior Research Director at Dell'Oro Group. \"What is notable this cycle is not just the pace of spending, but the expanding scope of investment, as cloud providers simultaneously scale accelerated compute, general-purpose servers, and the supporting infrastructure required to deploy AI at production scale. Accelerated server spending surged in the quarter, driven by the ramp of NVIDIA Blackwell Ultra, along with custom accelerator platforms across US hyperscalers, neo cloud providers, and sovereign AI deployments. At the same time, cloud service providers are increasing emphasis on greater capex discipline by optimizing asset depreciation and lifecycles to ensure healthy cash flow,\" explained Fung.\n\nAdditional highlights from the 3Q 2025 Data Center IT Capex Quarterly Report:\nThe global data center capex growth outlook was raised through 2026, reflecting sustained hyperscale investment and continued prioritization of AI infrastructure.\nDemand for general-purpose servers strengthened as cloud providers expanded compute and storage capacity to support growing cloud services and inference-heavy AI workloads.\nDell led all server OEMs in revenue, followed by HPE and Lenovo, gaining share on strong NVIDIA Blackwell shipments and a refreshed x86 portfolio, while white-box vendors captured the majority of server shipments, supported by hyperscale AI deployments and elevated general-purpose server demand.\nAbout the Report\nDell'Oro Group's Data Center IT Capex Quarterly Report details the data center infrastructure capital expenditures of each of the ten largest Cloud service providers, as well as the Rest-of-Cloud, Telco, and Enterprise customer segments. Allocation of the data center infrastructure capex for general-purpose and accelerated servers, storage systems, and other auxiliary data center equipment is provided. The report also discusses market trends, drivers of the leading Cloud service providers' capex growth during the quarter, and the outlook for the next year. To purchase this report, please contact us at dgsales@delloro.com.\n\nLire la suite\nAbout Dell'Oro Group\nDell'Oro Group is a market research firm that specializes in strategic competitive analysis in the telecommunications, security, enterprise networks infrastructure, and data center markets. Our firm provides in-depth quantitative data and qualitative analysis to facilitate critical, fact-based business decisions. For more information, contact Dell'Oro Group at +1.650.622.9400 or visit www.delloro.com .\nView original content to download multimedia: https://www.prnewswire.com/news-releases/data-center-capex-up-59-percent-on-continued-ai-investment-in-3q-2025-according-to-delloro-group-302642624.html\n\nCGU et Politique de confidentialité\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:00:00",
      "Source": "PR Newswire",
      "Title": "Tech Mahindra Accelerates Enterprise AI Transformation with Gemini Enterprise",
      "URL": "https://finance.yahoo.com/news/tech-mahindra-accelerates-enterprise-ai-130000092.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nTech Mahindra Accelerates Enterprise AI Transformation with Gemini Enterprise\n\nPR Newswire\nThu, December 18, 2025 at 5:00 AM PST 2 min read\n\nIn this article: TECHM.BO\n\nTECHM.NS\n\nGOOG\n\nPUNE, India , Dec. 18, 2025 /PRNewswire/ -- Tech Mahindra (NSE: TECHM), a leading global provider of technology consulting and digital solutions to enterprises across industries, announced that it plans to accelerate enterprise adoption of Gemini Enterprise using Google's Gemini 2.5 multimodal models. Through this collaboration, Tech Mahindra will empower customers to harness the full potential of Gemini Enterprise to drive measurable outcomes through responsible, human-centered AI.\nThe collaboration combines Tech Mahindra's extensive implementation experience, AI-first engineering talent, and proven Orion framework with Google Cloud's advanced AI capabilities to help organizations design, deploy, and scale next-generation Agentic AI solutions. Gemini Enterprise will also enable the creation of specialized AI agents, embed governance and safety guardrails, and integrate them seamlessly with Google Cloud's ecosystem, including Google Cloud's Vertex AI platform, Google BigQuery, and advanced data-to-AI pipelines.\n\nAmol Phadke, Chief Transformation Officer , Tech Mahindra, said, \"As enterprises evolve from AI experimentation to AI-driven business transformation, they require secure, scalable, and enterprise-ready intelligence that can operate across diverse business environments. Through our collaboration with Google Cloud and Gemini Enterprise, we are equipping organizations to embed AI into core operations with confidence, enabling intelligent, connected, and secure ecosystems powered by next-generation Agentic AI.\"\nAs a Google Cloud Premier Partner, Tech Mahindra brings strong implementation credentials aligned with its 'AI Delivered Right' strategy. The AI adoption strategy emphasizes four key pillars, including Transformation Delivered, Productivity Delivered, Innovation Delivered, and Assurance Delivered, ensuring AI is embedded into enterprise processes with trust, governance, and business-aligned impact.\n\nVictor Morales, Vice President, Global Systems Integrator Partnerships at Google Cloud , said, \" Agentic AI offers a powerful opportunity to reshape business models and unlock greater efficiency across every enterprise. By combining their deep industry expertise with Google Cloud's leading AI solutions, Tech Mahindra helps businesses meet this opportunity and deploy powerful solutions to solve complex business challenges. \"\nTech Mahindra has further strengthened its capabilities through dedicated Centers of Excellence, a portfolio of ready-to-deploy Agentic AI solutions, and a certified talent pool skilled in Google Cloud AI technologies. Together, the organizations will enable enterprises to move confidently toward an Agentic AI-powered future, where connected, reasoning agents deliver business outcomes with speed, precision, and purpose.\n\nLa historia continúa\nOur Website & Social Media Channels\nWebsite | LinkedIn | X\nLogo: https://mma.prnewswire.com/media/2804444/5688431/Tech_Mahindra_New_Logo.jpg\n\nView original content: https://www.prnewswire.com/news-releases/tech-mahindra-accelerates-enterprise-ai-transformation-with-gemini-enterprise-302645549.html\n\nCondiciones y Política de privacidad\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:50:00",
      "Source": "Motley Fool",
      "Title": "Got $1,000? 3 Tech Stocks to Buy and Hold for Decades",
      "URL": "https://finance.yahoo.com/m/adb18838-b387-36b1-9ac8-0b5773144db8/got-%241%2C000%3F-3-tech-stocks-to.html",
      "Content": "Got $1,000? 3 Tech Stocks to Buy and Hold for Decades\n\nManali Pradhan, CFA, The Motley Fool\nThu, December 18, 2025 at 4:50 AM PST 6 min read\n\nIn this article: NVDA\n\nIONQ\n\nORCL\n\nGOOG\n\nKey Points Nvidia boasts of exceptional multiyear revenue visibility.\nAlphabet’s full-stack AI approach is proving to be a key competitive advantage.\nIonQ can prove to be a high-growth, high-risk addition to a large and well-diversified investment portfolio.\n10 stocks we like better than Nvidia ›\nThe Federal Reserve's much-awaited 25-basis-point interest rate cut, announced on Dec. 10, has not delivered the market relief many investors had hoped for. While tech stocks initially jumped, the optimism was quickly replaced as renewed concerns around artificial intelligence (AI)-powered stocks resurfaced. Investor sentiment has further deteriorated after AI cloud giant Oracle missed earnings estimates in the second quarter of fiscal 2026 (ended Nov. 30, 2025), raising concerns about its ability to convert high-level capital investment into sustained profits.\nWith markets swinging sharply in response to changing sentiment, long-term investors can convert today's uncertainty into an entry opportunity. In case you have $1,000 not required to pay bills and debt or kept aside for contingencies, then investing in any of these three stocks can help generate wealth in the long run.\n\nNvidia Nvidia (NASDAQ: NVDA) might seem like the most obvious buy-and-hold pick for decades, and for good reason.\nThe company's exceptional long-term order visibility, worth nearly $500 billion of Blackwell and Rubin systems through 2025 and 2026, is itself a strong indicator of the durability of its long-term growth trajectory. While $150 billion in orders have already shipped, $350 billion worth of orders remain. Nvidia has expanded its strategic partnership with Saudi Public Investment Fund-backed AI company HUMAIN to jointly deploy up to 600,000 of its latest GPU systems over the next three years. This, coupled with a new compute capacity supply agreement with Anthropic, has expanded Nvidia's multiyear demand in addition to the $500 billion.\n\nThe reopening of the Chinese market is also a significant growth catalyst, considering that Nvidia once earned nearly 20% to 25% of its data center revenue from this market. Recently, the U.S. government approved the export of Nvidia's H200 chips to China, provided that 25% of the revenue is paid to the U.S. Treasury. According to a Reuters report, the company has informed Chinese clients that it is evaluating options to expand H200 chip production to meet the surging demand. While the Chinese government has yet to formally approve the purchases of these chips, the report notes that several Chinese technology companies, including Alibaba and ByteDance, have already contacted Nvidia to secure supply.\n\nStory Continues\nDespite the stellar demand, visibility, and expanding market access, Nvidia stock trades at a forward earnings multiple of 23 and a price-to-earnings-to-growth (PEG) ratio of just 0.48. While the stock may experience short-term volatility due to changes in hyperscaler spending and policy shifts, its long-term growth story remains intact. Hence, investors should be picking up a stake in this stock, especially at its current reasonable valuation levels.\n\nAlphabet Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) has also become a crucial player in the global development of AI infrastructure. The company exited the third quarter of fiscal 2025 (ended Sept. 30, 2025) with a Google Cloud backlog of $155 billion, up 46% on a sequential basis. Customers also entered into a larger number of deals valued at over $1 billion in the first nine months of 2025, compared to the combined total of the previous two years. Additionally, nearly 70% of the company's cloud customers are already using the company's AI products.\n\nThe rapid pace of enterprise adoption and improved multiyear revenue visibility of Google Cloud can be partly attributed to the company's full-stack AI strategy, spanning AI infrastructure, proprietary chips, AI models, and enterprise platforms. The full-stack approach is helping Google Cloud support large-scale AI deployments more efficiently. This, in turn, is contributing to improving margins and deepening existing customer relationships.\nBeyond Cloud, Alphabet's strategy of embedding AI across its ecosystem is also delivering strong results. AI experiences are already driving higher engagement in Search through AI Mode and AI Overviews. The company is seeing a higher number of overall queries, including commercial queries, which present additional avenues for monetization. YouTube is also benefiting from AI-driven recommendation systems and is witnessing robust double-digit revenue growth from advertising and subscriptions.\n\nAlphabet is generating durable cash flows from its consumer products, while Google Cloud is well positioned to ride the multiyear enterprise AI wave. The company trades at 27.6 times forward earnings, which appears rich. However, considering its scale, diversified revenue base, and technological edge, Alphabet can be a solid long-term pick even at an elevated valuation level.\nIonQ IonQ (NYSE: IONQ) is too speculative to serve as a core holding in a diversified portfolio. However, this quantum computing specialist could still merit a small allocation for investors seeking exposure to its long-term growth optionality or those growth drivers that cannot be fully modeled.\nIonQ has delivered exceptional top-line performance in the third quarter of fiscal 2025 (ended Sept. 30, 2025), with revenue soaring 222% year over year to $39.9 million, exceeding even the upper end of its own guidance by 37%. IonQ also has $3.5 billion in cash and no debt on its balance sheet, allowing the company to invest in future growth initiatives.\n\nManagement has highlighted multiple technical and product-specific milestones. The company successfully deployed its #AQ 64 Tempo system (capable of running large and complex quantum circuits) three months ahead of schedule and achieved a record two-qubit fidelity of 99.99% (meaning the system executes two-qubit operations correctly 99.99% of the time).\nIonQ is focused on expanding its presence beyond quantum computing, into associated areas, such as quantum networking, sensing, and security, through targeted acquisitions, including that of Oxford Ionics, Vector Atomic, and a controlling stake in ID Quantique. The company is also exploring commercialization opportunities through large-scale solutions-based contracts and a land-and-expand strategy. The company is thus striving to build long-term and sticky client relationships.\n\nStill, investors should remain aware of IonQ's risks, considering that the company is loss-making and incurring significant expenses on innovation. IonQ stock trades at 208.3 times sales, which is also very rich. Yet, the stock can be a good addition provided it does not exceed 5% of a large diversified portfolio.\nShould you buy stock in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,955 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,089,460 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 968 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nManali Pradhan, CFA has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, IonQ, Nvidia, and Oracle. The Motley Fool recommends Alibaba Group. The Motley Fool has a disclosure policy .\nGot $1,000? 3 Tech Stocks to Buy and Hold for Decades was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:50:00",
      "Source": "Newsfile",
      "Title": "DesignRush Names December 2025's Top SEO Agencies Amid Google Changes",
      "URL": "https://finance.yahoo.com/news/designrush-names-december-2025s-top-125000318.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nDesignRush Names December 2025's Top SEO Agencies Amid Google Changes\n\nNewsfile\nThu, December 18, 2025 at 4:50 AM PST 4 min read\n\nIn this article: GOOG\n\nDesignRush today announced its December ranking of leading SEO agencies, recognizing firms that help businesses navigate Google's core updates and AI-driven search changes.\nNew York, New York--(Newsfile Corp. - December 18, 2025) - DesignRush , a leading B2B platform, today released its list of the Top SEO Agencies for December 2025 as search teams adjust to another round of platform changes.\n\nThe agency's latest SEO roundup reported that Google has confirmed a new core update in the coming weeks, clarified that smaller updates often roll out without notice, and expanded Search Console with AI-powered reporting and longer performance views.\nAt the same time, Google Discover is giving more visibility to smaller publishers, changing how brands approach content and rankings.\nThe agencies featured this month reflect the skills businesses now need , including clear site structure, accurate performance tracking, and content that performs across search results, AI-driven discovery, and Discover feeds.\nHere are the top SEO agencies for December 2025 :\n1. eDesign Interactive\nLocation: Morristown, New Jersey, USA\nIndustries: CPG / Consumer Goods, Higher Education, Healthcare, Software / Technology, Fintech, Engineering / Construction, Hospitality\nWebsite: edesigninteractive.com\nDescription: eDesign Interactive is a full-service digital agency known for transforming brands through powerful storytelling, high-impact design, and performance-driven digital experiences. Since 2004, their award-winning team of creatives, strategists, and technologists has partnered with organizations across industries to deliver standout web design, branding, motion graphics, and conversion-focused campaigns. With studios in the U.S. and Europe, eDesign helps brands captivate audiences and accelerate growth.\n\n2. Funnel Boost Media\nLocation: San Antonio, Texas, USA\nIndustries: Healthcare, Finance, Legal, Home Services, Automotive, Professional Services\nWebsite: funnelboostmedia.net\nDescription: Funnel Boost Media is focused on helping local and regional businesses improve online visibility and grow through SEO, PPC, web design, and data-driven marketing strategies. Founded in 2012, the agency uses white-hat practices and transparent performance tracking to build campaigns that drive qualified leads and measurable outcomes. Funnel Boost Media tailors its services to the needs of service-oriented companies and keeps clients informed with clear reporting and collaborative engagement throughout every project.\n3. Rock Salt Marketing Cooperative\nLocation: Salt Lake City, Utah, USA\nIndustries: Healthcare, Professional Services, Real Estate, Food & Beverage, Retail, Creative Services\nWebsite: rocksaltmarketing.com\nDescription: Rock Salt Marketing Cooperative is a digital marketing agency with offices in Salt Lake City, Utah, and Nashville, Tennessee, specializing in SEO, paid media, and modern web design to help businesses improve online visibility and grow. The agency works with a range of clients, from local service providers and small businesses to national brands and multi-location organizations, delivering data-driven strategies with transparent reporting. Rock Salt positions itself as a partner for businesses at all stages, from small local operations to Fortune 500 companies, offering the expertise of a boutique agency with the efficiency of a larger firm.\n\nStory Continues\n4. Searchbloom\nLocation: Draper, Utah, USA\nIndustries: eCommerce, Healthcare, Legal, Manufacturing, Technology, Franchise / Multi-Location\nWebsite: searchbloom.com\nDescription: Searchbloom is a results-focused SEO and PPC agency that helps businesses improve visibility, attract qualified traffic, and optimize conversions. The agency emphasizes technical SEO precision, data-driven strategies, and ongoing campaign refinement, using proprietary frameworks like A.R.T. for SEO and A.C.E. for PPC. Searchbloom works closely with clients as partners rather than just customers, providing dedicated analysts and transparent reporting to ensure measurable, scalable results.\n\n5. eSEOspace\nLocation: San Diego, California, USA\nIndustries: Automotive, Beauty & Cosmetics, Fitness, Healthcare, Technology\nWebsite: eseospace.com\nDescription: eSEOspace is a digital agency helping small businesses and professional service providers improve online visibility and engagement. The team builds WordPress, Shopify, and custom websites, provides on-page, local, and AI/Generative SEO, and supports ongoing optimization to boost search performance. The agency also offers app and software development, including CRM, database, and backend solutions, alongside analytics setup, conversion tracking, and content strategy guidance.\n6. Fair Marketing Inc\nLocation: Spring, Texas, USA\nIndustries: Law, Healthcare & Fitness, Industrial, technology, Finance, Real Estate, Home Services\nWebsite: fairmarketing.com\n\n7. Technische SEO\nLocation: Apeldoorn, Netherlands\nIndustries: Small and Medium Enterprises Across Local Service Sectors, Ecommerce, Professional Services, Tech-Driven Businesses\nWebsite: technische-seo.nl\nBrands can explore the top SEO agencies by location, size, average hourly rate, and portfolio - all on DesignRush.\nAbout DesignRush\nDesignRush.com is a B2B marketplace and media platform connecting businesses with agencies through expert reviews and agency ranking lists, awards, knowledge resources, and personalized agency recommendations for vetted projects.\nMedia Contact\nIlze-Mari Gründling\nilze@designrush.com\n+1 305-370-1017\nhttps://www.designrush.com\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/278342\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:46:31",
      "Source": "Investor's Business Daily",
      "Title": "Data Centers Are Booming. So Is A Backlash Over Electricity Rates.",
      "URL": "https://finance.yahoo.com/m/21efdd73-59b7-33fc-8e84-fd1b3ad8eb99/data-centers-are-booming.-so.html",
      "Content": "Data Centers Are Booming. So Is A Backlash Over Electricity Rates.\n\nALEXIS GARCIA and KIT NORTON\nThu, December 18, 2025 at 4:46 AM PST 16 min read\n\nIn this article: AMZN\n\nMSFT\n\nGOOG\n\nMETA\n\nORCL\n\nThe data centers critical to the nation's AI ambitions are spawning local political battles as rising energy costs frustrate communities. What investors need to know about data center NIMBYism.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 10
}