{
  "stock_id": "GOOG",
  "last_updated": "2025-12-18T18:13:00.542Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-19",
      "Time": "01:56:59",
      "Source": "Investor's Business Daily",
      "Title": "Google, Oracle, Amazon, Meta In Hot AI Race. But A Data Center Backlash Is Surging.",
      "URL": "https://finance.yahoo.com/m/21efdd73-59b7-33fc-8e84-fd1b3ad8eb99/google%2C-oracle%2C-amazon%2C-meta.html",
      "Content": "Google, Oracle, Amazon, Meta In Hot AI Race. But A Data Center Backlash Is Surging.\n\nALEXIS GARCIA and KIT NORTON\nThu, December 18, 2025 at 9:56 AM PST 16 min read\n\nIn this article: GOOG\n\nORCL\n\nAMZN\n\nMETA\n\nMSFT\n\nThe data centers critical to the nation's AI ambitions are spawning local political battles as rising energy costs frustrate communities. What investors need to know about data center NIMBYism.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "01:50:00",
      "Source": "Motley Fool",
      "Title": "3 Best AI ETF Picks for 2026",
      "URL": "https://finance.yahoo.com/m/12edd36f-20a0-3fe5-b43b-0c4d16a6fb86/3-best-ai-etf-picks-for-2026.html",
      "Content": "3 Best AI ETF Picks for 2026\n\nDavid Dierking, The Motley Fool\nThu, December 18, 2025 at 9:50 AM PST 5 min read\n\nIn this article: OPAI.PVT\n\nNVDA\n\nMSFT\n\nGOOG\n\nKey Points Quantum computing is an exciting theme, but one that's going to take some time to play out.\nInvestors should consider a broad spectrum of names beyond just the \"Magnificent Seven.\"\nThe three ETFs below offer a range of options for investors to gain exposure to the AI sector.\n10 stocks we like better than Defiance Quantum ETF ›\n\nArtificial intelligence (AI) is already well on its way to being the biggest technological revolution since the internet -- and it's still in the early innings.\nWhile names such as Nvidia , Microsoft , OpenAI , and Alphabet have emerged as the \"faces\" of AI, there are plenty of potential winners throughout the sector. Infrastructure builders, enterprise software creators, application developers, and cloud providers all play an integral part to the ecosystem. AI is far more than just semiconductor manufacturers.\nThat's why when it comes to investing in AI, it may be better to just buy the theme instead of trying to pick individual winners. Some of the biggest returns so far have been delivered by the \"Magnificent Seven\" stocks. But stretched valuations, evidence of slowing momentum, and questions surrounding whether all the AI development spending will be worth it are beginning to plague some companies.\nAn ETF that can maintain exposure to some of those megacap names but look beyond them for additional opportunities may be the way to play it in 2026. Here are the three artificial intelligence ETFs that I'm favoring as we head into the new year.\n1. Defiance Quantum ETF If you're interested in true futuristic tech, quantum computing is probably for you. If artificial intelligence is the next revolution, quantum is the rocket that could really propel it to the next level.\nQuantum computing involves developing the technology for processing and calculating at speeds far beyond what traditional computers can do today. It has potential applications in technology, medicine, energy, finance, scientific discovery, and more.\n\nThe Defiance Quantum ETF (NASDAQ: QTUM) invests in companies at the forefront of quantum development. Top holdings right now include Tower Semiconductor , Rigetti Computing , Teradyne , Coherent , and Micron Technology .\nThe only Magnificent Seven name among the top 10 holdings is Alphabet, and it only comes in at No. 10, with a weight of 1.8%. So there's good diversification here relative to the broader tech sector and the equity market in general.\nQuantum is a little more niche and a lot more appropriate for a long-term holding than traditional AI stocks. It may be years before quantum becomes anything close to having mainstream applications, so it should be considered an investment in potential more than concrete current results.\n\nStory Continues\n2. Global X Artificial Intelligence & Technology ETF The Global X Artificial Intelligence & Technology ETF (NASDAQ: AIQ) looks more like a traditional big tech ETF, but it's careful to include companies of all sizes and from all around the world. In that way, it's designed to be a more inclusive and comprehensive take on AI investing.\nThe fund's index starts by grouping companies in two categories:\n\nAI developers: Includes product and services developers and users, as well as companies that offer AI solutions as a service to customers.\nAI and big data analytics: Semiconductor, storage, and/or hardware manufacturers, as well as quantum computing developers.\nA minimum \"exposure score\" is required for inclusion. Qualifying components are weighted by market cap.\nAIQ is a nice middle ground between big and small companies, although it definitely tilts toward large caps. The AI exposure requirement is a nice way to build the portfolio and ensure that the fund is more of a pure AI play than just a generic megacap tech fund.\n3. Roundhill Generative AI & Technology ETF The Roundhill Generative AI & Technology ETF (NYSEMKT: CHAT) describes itself as the world's first generative AI ETF. It's unique in that it's the only actively managed fund among the three, which is advantageous in such a rapidly evolving space. But it also leans more toward the megacap names.\n\nTop holdings currently include Alphabet, Nvidia, Microsoft, Meta Platforms , and Palantir . Amazon , Broadcom , and Advanced Micro Devices also reside in the top 10, so there's very much a Nasdaq-100 index feel to this fund.\nIf you're looking for a straightforward, more \"conservative\" way to invest in AI, CHAT might not be a bad choice. You get the heavy large-cap exposure without a lot of the risk that comes from investing in newer or emerging names.\nShould you buy stock in Defiance Quantum ETF right now? Before you buy stock in Defiance Quantum ETF, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Defiance Quantum ETF wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $511,196 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,047,897 !*\nNow, it’s worth noting Stock Advisor’s total average return is 954 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nDavid Dierking has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Coherent, Meta Platforms, Microsoft, Nvidia, and Palantir Technologies. The Motley Fool recommends Broadcom and Teradyne and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\n3 Best AI ETF Picks for 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "01:45:00",
      "Source": "Yahoo Finance Video",
      "Title": "Hut 8 CEO explains Google's vital role in AI data center deal",
      "URL": "https://finance.yahoo.com/video/hut-8-ceo-explains-googles-174500593.html",
      "Content": "Hut 8 CEO explains Google's vital role in AI data center deal\n\nYahoo Finance Video and Brian Sozzi\nThu, December 18, 2025 at 9:45 AM PST\n\nIn this video: GOOG\n\nHUT\n\nHut 8 Corp. ( HUT ) unveiled its own partnership with Anthropic ( ANTH.PVT ) and Fluidstack to build an AI data center in Louisiana. Alphabet's Google ( GOOG , GOOGL ) is providing the backstop on this latter deal.\nHut 8 CEO Asher Genoot joins Yahoo Finance executive editor Brian Sozzi to explain how vital Google was to making this deal happen. Also watch Asher Genoot explain some of the details of the data center deal.\nHut 8 also owns a majority stake in American Bitcoin ( ABTC ), which was co-founded by Eric and Donald Trump, Jr.\nTo watch more expert insights and analysis on the latest market action, check out more Opening Bid .\n\nVideo Transcript\n\n00:00 Speaker A\nHow important was it that Google backstopped all this?\n00:03 Asher\nCritical. I mean, without Google, we would not be able to get JP Morgan, Goldman Sachs to commit the balance sheet financing to be able to give us up to 85% of the actual cost to build a data center for project financing, and at a really low rate of SOFR plus 2.25% target. And so overall, the the clarity of Google backstopping, and think about this.\n00:30 Asher\nIt's a $7 billion deal, that's roughly $450 million a year.\n00:33 Asher\n$450 million on average a year for 15 years for Hut 8 transforms the business. You look at mostly data center infrastructure multiples trade at a 15 to 20x multiple. That's somewhere between 7 and a half to 9 billion dollars of overall value. You take out the build costs, you're at 5 and a half to 7 billion dollars of equity value creation. And so overall, we're extremely excited because if you think about the company today, 330 megawatts alone is worth more than our full market cap today.\n01:10 Asher\nIn addition to that, we own 60% of American Bitcoin, which is another publicly traded company we have with the Trumps. That's worth about a billion dollars. We have about 10,000 Bitcoin on the balance sheet, that's worth another billion dollars. And then we have 9,000 megawatts, 1,000 that we currently operate, another 8,000 of new development megawatts that I haven't even counted. And so we're extremely excited that about the company, its future growth potential. I think this is the first step in showing the market we have an ability to take a site from the very, very beginning on a piece of land that we find to bring it to a commercialized AI data center.\n01:43 Speaker A\nAsher, what's the next step? Because if I, if it's, if I have this correct, you have a pipeline. What does that pipeline look like? And and are you just on the cusp of announcing more deals like you just announced?\n01:54 Asher\nYeah, so when we announced this deal, creating a program with partners that could scale is really important. You brought up Jacobs engineering. They have 40,000 contractors and engineers. You have Vertiv, one of the best equipment manufacturers within the whole data center space. Obviously, Goldman Sachs and JP Morgan have some of the largest balance sheets as banks. So we put together a group of partners that we believe could scale with us in our development pipeline. And so we spent this whole year creating that foundation, find the right customers who have the demand as well. And now it's about repeating this program again and again and again to start growing the value of this company. And we're extremely excited and we think, uh, if we're on here a year from today, we'll have uh had a lot of headway in the scale that we were able to deploy and develop for our shareholders.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "01:40:03",
      "Source": "decrypt",
      "Title": "What is Ethereum (ETH)? A Beginner's Guide to the Smart Contract Blockchain",
      "URL": "https://finance.yahoo.com/m/73b1bf83-705b-3ccc-bb88-7224d05ea345/what-is-ethereum-%28eth%29%3F-a.html",
      "Content": "What is Ethereum (ETH)? A Beginner's Guide to the Smart Contract Blockchain\n\nMatt Hussey,Jason Nelson\nThu, December 18, 2025 at 9:40 AM PST 9 min read\n\nIn this article: ETH-USD\n\nBTC-USD\n\nAMZN\n\nGOOGL\n\nMETA\n\nEthereum, the second-biggest cryptocurrency after Bitcoin, is a blockchain-powered platform for creating decentralized applications (dapps).\nEthereum is not just a cryptocurrency. It’s a global, decentralized network that enables smart contracts —self-executing programs on the blockchain—and decentralized applications, or dapps , that run without banks, governments, or big tech.\n\nWhen programmer Vitalik Buterin published a “whitepaper” in late 2013 proposing a new kind of blockchain —not just for money but for programmable code—a revolution in digital finance began. Today, the Ethereum blockchain hosts decentralized applications like smart contracts, games , digital art , and assets worth billions.\nUltimately, many believe that Ethereum could underpin a re-imagining of how the internet works, dubbed Web3, in which control of the internet is disintermediated away from big companies such as Amazon, Google, Facebook, and X.\nThis guide will help you understand the history of Ethereum, Buterin’s big idea, and the role Ether plays in that vision.\nSmart contracts: Ethereum’s breakthrough The feature that set Ethereum apart from Bitcoin early on was the smart contract. A smart contract is a code stored and executed on the blockchain that runs automatically once its conditions are met.\nSmart contracts are transparent, tamper-proof, and execute without relying on third parties. This makes them the backbone of everything built on Ethereum, from DeFi protocols to NFT marketplaces.\n\nWho Invented Ethereum? Russian/Canadian computer programmer Vitalik Buterin wrote the whitepaper that Ethereum is based on. However, the building of the network and community was helped along by a number of co-founders: Anthony Di Loria, Charles Hoskinson, Miha Alisie, Amir Chetrit, Joseph Lubin and Gavin Wood.\n\nDevelopment of the Ethereum network began in early 2014 under the Ethereum Foundation, with Gavin Wood publishing the technical “yellow paper” that defined the Ethereum Virtual Machine.\nA crowdfunded token sale followed in mid-2014, raising funds through an initial coin offering, or ICO, that exchanged Bitcoin for Ether. The ICO raised over $18 million.\n\nThe network officially went live on July 30, 2015, launching as “Frontier”—a platform for developers to test and deploy decentralized applications.\nThe switch from Proof-of-Work to Proof-of-Stake When it first launched, Ethereum used the same Proof-of-Work consensus mechanism as Bitcoin, with cryptocurrency miners securing the network by solving complex cryptographic puzzles.\nIn September 2022, Ethereum switchted to a Proof-of-Stake (PoS) consensus algorithm. Instead of mining, Ether is created through staking: validators lock up at least 32 ETH as collateral and are chosen to propose and verify new blocks. Honest participation earns them ETH rewards.\n\nStory Continues\nWhat is Proof of Stake? How it Differs From Proof of Work\nThis shift, known as “ The Merge ,” ended Proof-of-Work mining, making Ethereum more energy-efficient while allowing anyone with the required stake to help secure the network and earn rewards.\nBlocks are still added about every 12 seconds, but ETH is now distributed as staking rewards, not mining rewards.\n\nEther (ETH), Ethereum’s native cryptocurrency, pays for transactions, powers apps, and secures the network. Ether’s sub-units, Gwei and Wei, are named after Wei Dai, an early pioneer of cryptocurrencies.\nWhat applications have been built on Ethereum? 👥 Social Networks: Get paid for your posts on social media dapps.\n📁 File Storage: Decentralized file storage at a fraction of the price.\n💸 Overseas Payments: Dramatically reducing the cost of sending cash overseas.\n💳 Payment Cards: Contactless debit card to pay in Ethereum and other cryptocurrencies.\n👀 Online advertising: Cutting out the middlemen in online ads. Users get paid directly for watching online advertisements.\n💱 Exchanges: Decentralized exchanges ( DEXs ) such as Uniswap enable users to trade cryptocurrencies peer-to-peer, without middlemen.\n🏦 Loans: Blockchain-backed loans with no credit checks.\n\nTimeline: Major milestones in Ethereum Late 2013: Vitalik Buterin publishes the Ethereum white paper, introducing the idea of a programmable blockchain.\nMid-2014: Ethereum crowdsale (ICO) sells Ether for Bitcoin to fund development.\nJuly 30, 2015: Ethereum launches with the “Frontier” genesis block.\nSeptember 2015: “Frontier Thawing” update increases gas limits for more stability.\nMarch 2016: Homestead upgrade improves protocol security and usability.\nApril 2016: The DAO, a decentralized venture fund, launches via crowdsale.\nJune 2016: Hackers exploit The DAO and drain roughly $50 million in Ether. Community votes to hard-fork, creating Ethereum (ETH) and Ethereum Classic (ETC).\nOctober 2017: Byzantium hard fork enhances performance, privacy, and sets the stage for Proof-of-Stake.\nDecember 2017: CryptoKitties and CryptoPunk NFTs go viral, stressing network capacity and highlighting scalability issues.\nJanuary 2018: ERC-721 NFT standard is introduced, enabling unique digital assets.\nDecember 2020: Beacon Chain launches, beginning Ethereum’s transition to Proof-of-Stake.\nMarch 2020: Visa begins settling USD Coin (USDC) stablecoin transactions using Ethereum.\nApril 2021: Berlin hard fork reduces gas costs.\nAugust 2021: London hard fork activates EIP-1559 ; introduces fee burning, reducing inflation.\nSeptember 15, 2022: “The Merge” transitions Ethereum from Proof-of-Work to Proof-of-Stake, cutting energy use by more than 99 percent.\nApril 12, 2023: The Shanghai upgrade enables withdrawal of staked Ether from the Beacon Chain.\nMarch 13, 2024: The Dencun upgrade introduces proto-danksharding, a step toward reducing costs and increasing scalability.\nMay 7, 2025: The Pectra upgrade, combining Prague and Electra updates, aims to expand staking flexibility and improve Ethereum’s efficiency.\nDecember 3, 2025: The Fusaka upgrade introduces changes to Ethereum's data availability and block capacity.\n\nEthereum and DAOs One of Ethereum’s most radical innovations was the decentralized autonomous organization, or DAO. A DAO is a blockchain-based organization governed by smart contracts and community votes . Members typically hold tokens that grant them voting power on how the DAO operates and spends its funds.\nThe first major experiment was The DAO in 2016, which sought to operate as a decentralized venture capital fund. Investors pooled Ether, then voted collectively on how to allocate it. The project ended in disaster due to an infamous hack , but it demonstrated the potential of blockchains as platforms for decentralized governance.\n\nWhat Is a Decentralized Autonomous Organization (DAO)?\nSince then, DAOs have grown into a vibrant sector. They range from DAO frameworks like Moloch and Aragon , to investment collectives like Syndicate , and governance DAOs such as MakerDAO , which manages a stablecoin pegged to the U.S. dollar, to social DAOs that organize communities online.\nSupporters argue that DAOs could redefine corporate governance by replacing traditional hierarchies with code and community control. Critics warn that legal frameworks remain murky, and smart contract vulnerabilities pose risks. Still, DAOs remain one of the clearest examples of Ethereum enabling something that could not exist without it.\nA network tested by crisis If Bitcoin is the gold of the cryptocurrency world, Ethereum is the oil that machines are powered on—but it has not been all smooth sailing.\nEthereum’s first major crisis arrived in 2016 with the DAO hack, when attackers exploited a vulnerability to steal $50 million worth of Ether.\nThe community was split: some argued the blockchain’s ledger should remain immutable, while others pushed to undo the damage. The decision to hard fork created two parallel blockchains—Ethereum (ETH) and Ethereum Classic (ETC).\n\nEthereum and the NFT boom Ethereum also fueled the explosion of non-fungible tokens , or NFTs, unique digital assets that prove ownership of items like art, music, or collectibles.\nThe breakthrough came in 2017 with the ERC-721 token standard, which let developers create unique tokens on the Ethereum blockchain. NFTs began to clog the Ethereum network as users spent millions trading CryptoKitties , CryptoPunks , and more, showing both the appeal and the limits of the technology.\n\nBeginner's Guide to NFTs: What Are Non-Fungible Tokens?\nBy 2021, NFTs had gone mainstream. Digital artist Beeple sold an NFT artwork for $69 million , and the Bored Ape Yacht Club launched. One of the most prominent NFT collections, the Bored Ape Yacht Club, is a collection of 10,000 primate-themed NFTs that became a cultural phenomenon, drawing celebrities and selling for hundreds of thousands of dollars each. At its height, in May 2022, all 10,000 BAYC NFTs collectively were valued over $1 billion.\nEthereum’s smart contracts made this possible by encoding ownership and authenticity directly into the blockchain. The NFT boom exposed Ethereum’s energy inefficiency, accelerating its shift away from the more energy-intensive Proof-of-Work algorithm.\n\nThe race to scale Ethereum’s biggest weakness? Scalability. At about 15 transactions per second, it cannot match Visa’s tens of thousands. That bottleneck has often caused sky-high “gas fees,” or transaction costs.\nTo address this, developers began a years-long upgrade known as Ethereum 2.0 . The launch of the Beacon Chain in 2020, the Berlin and London upgrades in 2021, and the Merge in 2022 marked steps toward a more efficient, Proof-of-Stake network. Later upgrades, including Shanghai in 2023 and Dencun in 2024, tackled staking flexibility and lower transaction costs.\n\nVitalik Wants To Speed Up Ethereum By 100x, Make it as 'Simple as Bitcoin'\nEthereum and the Web3 vision Supporters see Ethereum as the foundation for “Web3”—an internet where users, not corporations, control data, money, and digital identities. Ethereum powers decentralized finance DeFi, non-fungible tokens, and decentralized autonomous organizations, each of which experiments with alternatives to traditional financial and governance systems.\n\nBut competition looms. Rival networks such as Solana , Cardano , and Polkadot have positioned themselves as faster, cheaper alternatives. Meanwhile, Ethereum scaling solutions like Polygon and Arbitrum aim to process transactions off-chain before anchoring them to Ethereum’s main blockchain, reducing lag time and cost.\nEthereum and privacy In 2025, privacy has become a key focus of the Ethereum project. In November, Vitalik Buterin stated that \"Privacy is not a feature. Privacy is hygiene,\" building on a narrative in which he framed it as a fundamental requirement for digital systems such as blockchain platforms.\nEthereum Foundation Launches New Cluster Focused on Privacy\n\nThe Ethereum Foundation has followed suit, launching a privacy cluster in October 2025 that includes 47 researchers, coordinators and cryptographers. The Foundation also launched Kohaku, a \"privacy-first\" toolkit for Ethereum, alongside a browser wallet and SDK. Upon its launch, Buterin commented that \"Full-stack privacy and security are first-class priorities in Ethereum.\"\nA decade in, Ethereum is still defining itself As Ethereum enters its second decade, it continues to test the boundaries of what a blockchain can do. Whether it will deliver on its vision of a decentralized internet—or cede ground to faster competitors—remains an open question.\nWhat’s certain is that Ethereum has already changed how we think about the internet, money, community, and governance.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "01:32:14",
      "Source": "MT Newswires",
      "Title": "Rivian Expands Gen 2 Driving Features; Shares Rise After Baird Upgrade",
      "URL": "https://finance.yahoo.com/news/rivian-expands-gen-2-driving-173214178.html",
      "Content": "PREMIUM\nRivian Expands Gen 2 Driving Features; Shares Rise After Baird Upgrade\n\nMT Newswires\nThu, December 18, 2025 at 9:32 AM PST 1 min read\n\nIn this article: RIVN\n\nGOOG\n\nAAPL\n\nSSNLF\n\nRivian Automotive (RIVN) is expanding hands-free assisted driving features for its Gen 2 lineup.\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "01:31:12",
      "Source": "Benzinga",
      "Title": "JPMorgan Warns: AI Hype Has Peaked — 2026 Is About Profits",
      "URL": "https://finance.yahoo.com/news/jpmorgan-warns-ai-hype-peaked-173112523.html",
      "Content": "JPMorgan Warns: AI Hype Has Peaked — 2026 Is About Profits\n\nSurbhi Jain\nThu, December 18, 2025 at 9:31 AM PST 2 min read\n\nIn this article: JPM\n\nGOOG\n\nMETA\n\nAMZN\n\nGenerative AI dominated narratives in 2025, but the financial payoff hasn't kept pace with the hype. JPMorgan's 2026 outlook, backed by new CEO survey data, suggests markets are now recalibrating expectations — shifting focus from AI adoption to whether it actually delivers profits.\nGenAI Fell Short Of CEO Expectations PwC's latest global CEO survey, covering more than 4,700 executives across 109 countries, shows a clear expectation gap. While over 40% of CEOs entered 2025 expecting GenAI to boost revenue and nearly half anticipated a lift in profitability, only about one-third reported meaningful gains in either metric by year-end. Efficiency improvements were more visible, but even those undershot initial expectations.\n\nDon't Miss:\nThe AI Marketing Platform Backed by Insiders from Google, Meta, and Amazon — Invest at $0.85/Share\nAn EA Co-Founder Shapes This VC Backed Marketplace— Now You Can Invest in Gaming's Next Big Platform\nJPMorgan's interpretation isn't that AI spending was misplaced — it's that monetization arrived slower than anticipated. Adoption moved quickly, but translating that into top-line and margin expansion proved harder than forecasts implied.\nFrom Experimentation To ROI Discipline That gap is now changing behavior. JPMorgan notes that boards and CFOs are pressing harder on return on investment, favoring projects with clearer financial outcomes over open-ended experimentation. Growth alone is no longer enough; it needs to come with margin discipline.\nAs a result, valuation frameworks are tightening. Metrics like the Rule of 40 — and JPMorgan's stricter Rule of X — are reasserting themselves as filters rather than afterthoughts.\n\nTrending: Earn While You Scroll: The Deloitte-Ranked #1 Software Company Growing 32,481% Is Opening Its $0.50/Share Round to Accredited Investors.\nWhy 2026 Will Look Different The implication for 2026 is straightforward. AI narratives still matter, but they no longer earn automatic premiums. Investors are rotating toward companies that can pair innovation with durable earnings power.\nIn the next phase of the cycle, belief won't be enough. The numbers will decide.\nRead Next:\n\nMissed Tesla? EnergyX Is Tackling the Next $200 Billion Opportunity — Lithium\n$100k+ in investable assets? Match with a fiduciary advisor for free to learn how you can maximize your retirement and save on taxes – no cost, no obligation.\nPhoto: Shutterstock\nUNLOCKED: 5 NEW TRADES EVERY WEEK. Click now to get top trade ideas daily , plus unlimited access to cutting-edge tools and strategies to gain an edge in the markets.\n\nStory Continues\nGet the latest stock analysis from Benzinga:\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article JPMorgan Warns: AI Hype Has Peaked — 2026 Is About Profits originally appeared on Benzinga.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "01:19:00",
      "Source": "Barrons.com",
      "Title": "These Stock Funds Are Crushing the Market. Here Are Their Picks for 2026.",
      "URL": "https://finance.yahoo.com/m/f6597c38-49fd-32c5-aa29-ba52f5e546f3/these-stock-funds-are.html",
      "Content": "These Stock Funds Are Crushing the Market. Here Are Their Picks for 2026.\n\nIan Salisbury\nThu, December 18, 2025 at 9:19 AM PST 8 min read\n\nIn this article: ^GSPC\n\nGOOG\n\nThese market-beating funds see bargains in stocks like AppLovin, Wells Fargo, and Boeing. Where they’re investing for 2026.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "00:59:00",
      "Source": "Newsfile",
      "Title": "CEO.CA's Inside the Boardroom: Nextech3D.AI Gains Netflix, Microsoft, and Google as Clients for 2026",
      "URL": "https://finance.yahoo.com/news/ceo-cas-inside-boardroom-nextech3d-165900394.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nCEO.CA's Inside the Boardroom: Nextech3D.AI Gains Netflix, Microsoft, and Google as Clients for 2026\n\nNewsfile\nThu, December 18, 2025 at 8:59 AM PST 2 min read\n\nIn this article: GOOG\n\nMSFT\n\nNEXCF\n\nSPOFF\n\nToronto, Ontario--(Newsfile Corp. - December 18, 2025) - CEO.CA Meet the Executive Shaping the Tech Landscape\n'Inside the Boardroom' is more than just an interview series - it's a chance to gain firsthand knowledge from industry leaders, understanding their vision, challenges, and strategy.\nWe caught up with Evan Gappelberg, CEO of Nextech3D.AI (CSE: NTAR) (OTCQX: NEXCF) (FSE: 1SS). Follow what investors are saying and join our community: https://ceo.ca/ntar .\n(OTCQX: NEXCF) (CSE: NTAR) (FSE: 1SS)\n\nCannot view this video? Visit:\nhttps://www.youtube.com/watch?v=Ku1K4E7mpWg\n(\"CEO.CA\") , the leading investor social network in junior resource and venture stocks, shares exclusive updates with CEOs of junior mining explorers.\nFounded in 2012, CEO.CA, a wholly owned subsidiary of EarthLabs, Inc. , is one of the most popular free financial websites and apps in Canada and for investors globally - with industry leading audience engagement and mobile functionality. Millions of people visit CEO.CA each year to connect with investors from around the world, share knowledge and view impactful stories about stocks, commodities, and emerging companies.\n\nTune in to 'Inside the Boardroom' each week and be part of the conversation that's shaping the business landscape. Visit CEO.CA or our YouTube page for hundreds more executive interviews from CEO.CA here .\nInterested in showcasing your company on 'Inside the Boardroom'? Get in touch with our team at sales@ceo.ca for further details and opportunities.\nAbout CEO.CA\nThe leading community for investors & traders in junior resource & venture stocks. CEO.CA is one of the most popular free financial websites and apps in Canada and for small-cap investors globally -- with industry leading audience engagement and mobile functionality. Since 2012, CEO.CA has brought millions of investors together from over 164 countries to discuss their portfolio holdings and find new investment opportunities. Download our App on iOS or Android marketplace or visit us today at CEO.CA to set up your free account.\n\nCEO.CA is a wholly owned subsidiary of EarthLabs, Inc.\nFor further information please contact:\nCEO.CA\nEmail: hello @ceo.ca\nWebsite: CEO.CA\nNeither the TSX Venture Exchange (\"TSXV\"), OTC Best Market \"(OTCQX\") nor its Regulation Services Provider (as that term is defined in the policies of the TSXV) accepts responsibility for the adequacy or accuracy of this release.\nCautionary Statement\nThe information regarding any issuer contained or referred to in any interviews conducted by CEO.CA has been furnished by such issuer directly, and neither CEO.CA nor any of its affiliates or principals assumes any responsibility for the accuracy or completeness of such information or for any failure by an issuer to ensure disclosure of events or facts which may affect the significance or accuracy of any such information.\n\nStory Continues\nNo stock exchange, securities commission or other regulatory authority has approved or disapproved the information contained herein. This news release contains forward-looking information which involves risks, uncertainties and other factors that could cause actual events, results, performance, prospects, and opportunities to differ materially from those expressed or implied by such forward-looking information. Forward-looking information in this news release may include, but is not limited to, the objectives, goals, future plans, statements regarding exploration results and exploration and/or development plans of companies featured on the CEO.CA platform. Factors that could cause actual results to differ materially from such forward-looking information include, but are not limited to, capital and operating costs varying significantly from estimates, the preliminary nature of metallurgical test results, delays in obtaining or failures to obtain required governmental, environmental or other project approvals, uncertainties relating to the availability and costs of financing needed in the future, changes in equity markets, inflation, fluctuations in commodity prices, delays in the development of projects, currency risk and the other risks involved in the applicable exploration and development industry, and those risks set out in the public documents of such companies filed on SEDAR or elsewhere from time to time. Undue reliance should not be placed on such information, which only applies as of the date of this news release, and no assurance can be given that such events will occur in the disclosed time frames or at all. CEO.CA disclaims any intention or obligation to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, other than as required by law.\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/278534\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "00:17:17",
      "Source": "GuruFocus.com",
      "Title": "Amazon Stock Climbs on Strong 2026 Outlook From Truist Securities",
      "URL": "https://finance.yahoo.com/news/amazon-stock-climbs-strong-2026-161717723.html",
      "Content": "Amazon Stock Climbs on Strong 2026 Outlook From Truist Securities\n\nNauman Khan\nThu, December 18, 2025 at 8:17 AM PST 1 min read\n\nIn this article: AMZN\n\nWMT\n\nTFC\n\nGOOG\n\nMETA\n\nThis article first appeared on GuruFocus .\nShares of Amazon ( NASDAQ:AMZN ) edged up more than 3% on Thursday, as Truist Securities projected robust growth for internet and digital media stocks in 2026, led by the e-commerce giant.\nAnalyst Youssef Squali cited durable secular growth drivers, AI-enhanced product offerings, and a supportive macroeconomic backdrop as key factors for Amazon's upside. Truist forecasts Amazon to grow 10.5% year-over-year in 2026, slightly below its 12.1% growth in 2025.\n\nWarning! GuruFocus has detected 4 Warning Sign with PYPL.\nIs WMT fairly valued? Test your thesis with our free DCF calculator.\nThe analyst firm highlighted mid-to-high single-digit growth for U.S. e-commerce next year, around 7%, supported by faster delivery capabilities and personalized offerings powered by generative AI.\nAmazon is part of Truist's top mega-cap picks alongside Meta Platforms (META) and Alphabet (GOOGL). Large-cap internet stocks are expected to outperform small and mid-caps in 2026, the firm said.\nTruist noted that sustained digital advertising growth and holiday-season sales momentum, including Cyber-5 week, contribute to the constructive outlook.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "00:15:00",
      "Source": "Yahoo Finance Video",
      "Title": "Hut 8 CEO discusses $7B AI data center deal with Anthropic",
      "URL": "https://finance.yahoo.com/video/hut-8-ceo-discusses-7b-161500452.html",
      "Content": "Hut 8 CEO discusses $7B AI data center deal with Anthropic\n\nYahoo Finance Video and Brian Sozzi\nThu, December 18, 2025 at 8:15 AM PST\n\nIn this video: GOOG\n\nANTH.PVT\n\nHUT\n\nTATE.PVT\n\nWhile Trump Media & Technology Group ( DJT , DJTWW ) announced a $6 billion merger with nuclear fusion startup TAE Technologies, Hut 8 Corp. ( HUT ) unveiled its own partnership with Anthropic ( ANTH.PVT ) and Fluidstack to build an AI data center in Louisiana. Alphabet's Google ( GOOG , GOOGL ) is providing the backstop on this latter deal.\nHut 8 CEO Asher Genoot joins Yahoo Finance executive editor Brian Sozzi to further discuss the deal.\nTo watch more expert insights and analysis on the latest market action, check out more Opening Bid .\n\nVideo Transcript\n\n00:00 Speaker A\nTrump media announcing a $6 billion merger with fusion power provider T Technologies, that has set the stock sharply higher. This, coming the day after crypto minor Hut 8 announced a $7 billion deal to build a massive data center complex in Louisiana. Hut 8, of course, partners with another Trump family enterprise, American Bitcoin. Joining me now for today's Power player, Asher Ganoot, Hut 8 CEO. Asher, good to see you again. Uh, congrats on this big uh moment for your company.\n00:23 Speaker A\nWalk us through the the process a bit because I sense you have been very disciplined on arriving to this point. It was very very important for you to not make just a bad deal.\n00:39 Asher Ganoot\nWe think that the value of energy will continue to go up. And so for us, we had to be patient and figure out what was a fair deal that added value to our customers but that drove a strong return to our shareholders. And so the announcement of our deal yesterday, we had actually two announcements. One was an announcement with Anthropic to have the opportunity to scale with them for 2,300 overall megawatts. Then the actual deal we signed itself that was $7 billion was only 330 megawatts, which is 245 megawatts of IT load.\n01:13 Asher Ganoot\nAnd so, for 245 megawatts of IT load, we announced a $7 billion deal that had a financial financial backstop with Google. And so, we're very, very excited because this is the first domino to fall. Um, if we're able to continue to scale and build up to that full uh strategic partnership on 2,300 megawatts, we see a lot of growth upside for the company. And the deal overall, not only did we announce that Google was creating a financial backstop, we had great partners like Fluidstack and Anthropic, but also that we had execution partners to deliver the data center.\n01:46 Asher Ganoot\nFrom JP Morgan to Goldman Sachs providing the financing, and to Jacob's Engineering and to Vertive providing the contracting and the supply chain. This deal is fully packaged and signed to be able to deliver for the customer.\n02:00 Speaker A\nYeah, Jacobs Jacobs is really a uh really one of those under the radar infrastructure plays. really enjoyed uh following their following their story. For the average investor out there, Asher, why would an Anthropic need this much power? Break that down for us.\n02:14 Asher Ganoot\nThey're growing month over month. I mean, if you look at some of the public reports, their revenue has been increasing by billion dollars ARR every single month. And so as they continue to grow, they need additional compute to keep up with the demand of their users. And so they're one of the fastest growing companies in the world right now, and we'd like to provide the our first infrastructure layer to be able to allow them to keep up with that demand and continue to build out those models and those inference and training solutions.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "00:07:05",
      "Source": "CBS News",
      "Title": "How will the stock market perform in 2026? Wall Street pros weigh in.",
      "URL": "https://finance.yahoo.com/m/96359a46-6ce3-3868-91eb-9a802a738c35/how-will-the-stock-market.html",
      "Content": "How will the stock market perform in 2026? Wall Street pros weigh in.\n\nMary Cunningham\nThu, December 18, 2025 at 8:07 AM PST 5 min read\n\nIn this article: ^GSPC\n\n^DJI\n\n^IXIC\n\nGOOG\n\nMSFT\n\nThe U.S. stock market scaled new heights in 2025, as investors largely tuned out concerns about the Trump administration's sharply higher tariffs and shrugged off fears of a financial market bubble among artificial intelligence companies.\nThe S&P 500 stock index is up roughly 15% this year through Dec. 17— a strong performance, although lower than the heady 23% jump posted by the broad-based index in 2024. The S&P 500 has climbed an average of 13% per year over the last decade, according to Mark Luschini, chief investment strategist at wealth management firm Janney Montgomery Scott.\n\nThe Nasdaq Composite, which includes tech heavy-hitters such as Alphabet, Microsoft and Nvidia, has climbed more than 18% this year, while the blue-chip Dow Jones Industrial Average is up more than 13%.\nThe key question: Will such investor exuberance spill over into 2026, especially as concerns about an AI bubble percolate?\n\"I think conditions remain relatively fertile for stock prices to do OK overall,\" Luschini told CBS News. \"The big risk is that the whole AI narrative starts to lose a little of its viscosity.\"\nOther forecasters are also expecting a strong stock market performance in 2026. David Lefkowitz, head of U.S. equities at UBS Global Wealth Management, expects the S&P 500, which closed Monday trading at 6,816 points, to reach 7,300 points by June of next year and 7,700 by the end of 2026. That would represent a roughly 15% gain over the next year.\n\nJ.P. Morgan said in a November research report that it expects the S&P 500 to rise 13% to 15% next year, boosted by robust corporate earnings growth, and to carry that strength into 2027.\nWhat will drive stocks in 2026?\nSeveral catalysts are expected to drive the stock market in 2026. Among them is another year of strong corporate earnings, particularly in tech, analysts say. BofA Global Research expects overall earnings to grow in the mid-double digits next year.\n\"Multiple expansion and earnings growth both pushed the S&P 500 up 15% this year,\" the securities firm said in a market forecast. \"In 2026, earnings will do the lift.\"\nThe AI boom should also help fuel the stock market, with a wave of capital investments likely to drive up tech stocks, analysts note. AI capital expenditures from major tech companies including Alphabet, Amazon, Meta, Microsoft and Oracle are expected to approach $520 billion in 2026, Jeff Buchbinder, chief equity strategist for LPL Financial, said in a research note.\nAnother area expected to benefit from the AI boom is the industrials sector, which is supplying the equipment necessary for data centers .\n\nStory Continues\nGrowth, however, won't be limited to tech or AI-adjacent sectors. Indeed, Bret Kenwell, a U.S. investment and options analyst at eToro, said a broadening of the bull market could be in the cards, with all 11 sectors in the S&P 500 expected to rise next year.\n\"If it happens, it'll have been five years since we've seen it,\" he said.\n\nAdam Crisafulli, head of Vital Knowledge, and Luschini both expect a good year for financial services stocks. Banks have traded very well this year amid an easier regulatory backdrop and a jump in mergers and acquisitions.\nAnother tailwind for the stock market could be softer monetary policy and a more dovish Federal Reserve, Kenwell said, with President Trump soon expected to nominate a new central bank chief before Jerome Powell's term ends in May.\n\"It's kind of a when, not if, rate-cut situation with the Fed,\" Kenwell said.\nStill, analysts and major banks expect a slowdown in the pace of interest rate cuts. In a November report, J.P. Morgan forecasts one more interest rate cut in January before an extended pause and said that if the central bank further eases monetary policy, the S&P 500 could surpass 8,000 points in 2026.\n\nIs my money safe?\nThe biggest shadow looming over the stock market next year is what will happen with artificial intelligence.\nAI and tech stocks have been the propelling force behind equity gains this year, with earnings growth from the \"Magnificent Seven\" far outpacing other companies in the S&P 500. That strength has been accompanied by a boom in capital expenditures, as investors rush to invest in data center construction and other technology infrastructure to meet rising demand for AI.\n\"Robust demand for cloud services and data center capacity shows no signs of slowing,\" Janus Henderson portfolio manager Jeremiah Buckley said in his company's 2026 outlook on capital investment.\nAmid all the hype, some investors are concerned about whether AI's ascendance could start to falter next year, leading to a market correction or the bursting of what some consider to be an AI bubble.\n\nIn its 2026 outlook, Vanguard said it expects U.S. technology stocks to maintain momentum given the rate of investment and anticipated earnings growth. At the same time, the investment management company noted that \"risks are growing\" amid all of the AI optimism.\nCrisafulli said tech gains have historically moved in unison, but that started to splinter in November, when Alphabet shares surged 14% following the release of Google Gemini 3, while the rest of the Nasdaq slumped . The continued fracturing of the AI narrative is one of the headwinds he expects investors will have to face in 2026.\n\"It's not so much the bubbles bursting,\" he said. \"It's more just people looking at it in a more nuanced way.\"\nStill, as usual investors should expect some turbulence. Minor pullbacks or flat trading periods are possible, especially after several months of consecutive growth in the S&P 500, according to Kenwell.\n\"When we look at 2025, it was a good reminder that volatility is in play, and that's something that certainly can be back in the cards in 2026,\" he said.\nWhat to expect from Trump's address to the nation\nMore details emerge about Rob Reiner and wife Michele's killings\nNew surveillance video shows Nick Reiner before his arrest\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "00:00:42",
      "Source": "MT Newswires",
      "Title": "Lovable Raises $330 Million to Scale Builder-Led Software",
      "URL": "https://finance.yahoo.com/news/lovable-raises-330-million-scale-160042384.html",
      "Content": "PREMIUM\nLovable Raises $330 Million to Scale Builder-Led Software\n\nMT Newswires\nThu, December 18, 2025 at 8:00 AM PST\n\nIn this article: GOOG\n\nNVDA\n\nLovable, a Swedish vibe-coding startup, said Thursday that it has raised $330 million in a series B\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:52:13",
      "Source": "Benzinga",
      "Title": "Charlie Munger Said, 'Find A Way To Get Your Hands On $100,000' Even If It Means Walking Everywhere — The Magic Number If You Want To Be Rich",
      "URL": "https://finance.yahoo.com/news/charlie-munger-said-way-hands-155213794.html",
      "Content": "Charlie Munger Said, 'Find A Way To Get Your Hands On $100,000' Even If It Means Walking Everywhere — The Magic Number If You Want To Be Rich\n\nJeannine Mancini\nThu, December 18, 2025 at 7:52 AM PST 4 min read\n\nIn this article: GOOG\n\nMETA\n\nAMZN\n\nBRK.A\n\nCharlie Munger didn't believe in shortcuts — but he did believe in thresholds. And if you ever asked how to get rich , he had a number ready: $100,000. Hit that, he said, and you'll have the momentum to keep going. Fail to hit it, and you'll spin your wheels forever.\nMunger, who died in 2023 just weeks shy of his 100th birthday, was best known as Warren Buffett's blunt, brilliant right hand — but he built a billion-dollar fortune of his own by focusing on what worked and ignoring what didn't.\n\nOne piece of wisdom that resonates with investors is his take on building wealth. In the late 1990s, during a shareholder meeting, Munger said, “The first $100,000 is a b****, but you gotta do it.”\nDon't Miss:\nThe AI Marketing Platform Backed by Insiders from Google, Meta, and Amazon — Invest at $0.85/Share\nAmericans With a Financial Plan Can 4X Their Wealth — Get Your Personalized Plan from a CFP Pro\nThis statement emphasizes the initial hurdle many face in accumulating savings. Munger’s bluntness highlights the challenge of reaching that critical first $100,000.\n“I don’t care what you have to do,\" he said. \"If it means walking everywhere and not eating anything that wasn’t purchased with a coupon, find a way to get your hands on $100,000.\"\n\nThe reason behind Munger’s focus on this initial amount? The power of compounding. Once you have that base, the path to greater wealth becomes smoother. With compounding returns, $100,000 can grow significantly over time, providing a strong foundation for long-term financial goals.\n“After that, you can ease off the gas a little bit,” he said.\nTrending: $100k+ in investable assets? Match with a fiduciary advisor for free to learn how you can maximize your retirement and save on taxes – no cost, no obligation.\nMunger made this statement in the mid-1990s, and when adjusted for inflation, $100,000 at the time is roughly equivalent to about $200,000 in 2025 dollars, based on U.S. consumer price index data. The number itself has shifted with time, but the idea behind it has not. The first meaningful pool of capital is still the hardest to assemble, and everything that follows depends on clearing that initial hurdle.\n\nThat belief stayed with Munger until the end of his life. In 2023, during one of his final long-form interviews discussed on the \" Acquired\" podcast, he summed up the payoff of that early grind in a single line: \"You only have to get rich once .\" The remark reflected a theme he returned to repeatedly over decades — build a durable financial base one time, and the rest of your decisions become less constrained.\n\nStory Continues\nThat perspective also helps explain why Munger's career did not begin with stocks. Before becoming Buffett's longtime partner at Berkshire Hathaway, Munger was a real estate attorney. He understood early on how property, cash flow, and patience could work together over long periods. Real estate was not a side note in his thinking. It was foundational.\n\nFor people trying to apply that lesson today, real estate remains one of the most common ways to build toward that first six-figure milestone. Rental income, equity growth, and long holding periods can create momentum that wages alone often struggle to provide. While not everyone can buy an entire property outright, access to real estate no longer requires that level of capital.\nSee Also: An EA Co-Founder Shapes This VC Backed Marketplace— Now You Can Invest in Gaming's Next Big Platform\nPlatforms like Arrived offer one example. Arrived allows investors to buy fractional shares of rental home s, giving them exposure to rental income and property appreciation without owning or managing a full property themselves. The best part? All you need is $100 to get started.\n\nFor people working toward their first $100,000, or its inflation-adjusted equivalent, steady real estate income can complement traditional saving and investing strategies.\nMunger never argued that the process was easy. He argued that it was worth it. The discipline required to build that first base — whether through work, saving, investing, or real estate — is the same discipline that keeps wealth intact later on. Once that base exists, compounding has room to operate, and the pressure to constantly scramble begins to fade.\nA financial adviser can help translate those principles into a plan that fits real life, weighing income, risk tolerance, time horizon, and how assets like stocks and real estate should work together. The goal is not to replicate Munger's fortune. It is to apply his logic: reach a solid foundation once, and let time do the rest.\n\nSome elements of this story were previously reported by Benzinga and it has been updated.\nRead Next: Buffett's Secret to Wealth? Private Real Estate— Get Institutional Access Yourself\nImage: Shutterstock\nUp Next: Transform your trading with Benzinga Edge's one-of-a-kind market trade ideas and tools. Click now to access unique insights that can set you ahead in today's competitive market.\nGet the latest stock analysis from Benzinga:\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Charlie Munger Said, 'Find A Way To Get Your Hands On $100,000' Even If It Means Walking Everywhere — The Magic Number If You Want To Be Rich originally appeared on Benzinga.com\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:50:26",
      "Source": "24/7 Wall St.",
      "Title": "OpenAI Could Start Using Amazon Chips. Time to Buy Amazon?",
      "URL": "https://finance.yahoo.com/m/662682fb-4f43-31a5-b44c-842665a8c227/openai-could-start-using.html",
      "Content": "OpenAI Could Start Using Amazon Chips. Time to Buy Amazon?\n\nJoey Frenette\nThu, December 18, 2025 at 7:50 AM PST 4 min read\n\nIn this article: AMZN\n\nOPAI.PVT\n\nANTH.PVT\n\nGOOG\n\nNVDA\n\nQuick Read Amazon is in talks with OpenAI for a $10B investment and a deal for OpenAI to use Amazon’s Trainium chips.\nAmazon stock trades at 31.4x trailing P/E despite AI chip development and ties to Anthropic and potentially OpenAI.\nThe deal could reveal how Amazon’s custom Trainium chips compare to Google TPUs and Nvidia GPUs in real workloads.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:39:50",
      "Source": "Simply Wall St.",
      "Title": "Hut 8 (HUT) Is Down 14.1% After $7 Billion AI Lease With Fluidstack and Anthropic Partners",
      "URL": "https://finance.yahoo.com/news/hut-8-hut-down-14-153950753.html",
      "Content": "Hut 8 (HUT) Is Down 14.1% After $7 Billion AI Lease With Fluidstack and Anthropic Partners\n\nSimply Wall St\nThu, December 18, 2025 at 7:39 AM PST 3 min read\n\nIn this article: HUT\n\nBTC-USD\n\nGOOG\n\nANTH.PVT\n\nHut 8 Corp. recently announced a 15-year, US$7.00 billion lease with Fluidstack for 245 megawatts of IT capacity at its River Bend AI data center campus in Louisiana, alongside a partnership with Anthropic to host large-scale model training workloads and a Right of First Offer over as much as 1,245 additional megawatts.\nThis combination of a long-duration, Google-backed lease and a multi-gigawatt AI infrastructure roadmap marks a major shift in Hut 8’s business mix away from pure Bitcoin mining toward contracted, hyperscale compute infrastructure.\nWe’ll now examine how this long-term, US$7.00 billion River Bend lease could reshape Hut 8’s investment narrative around growth and risk.\n\nThe latest GPUs need a type of rare earth metal called Terbium and there are only 36 companies in the world exploring or producing it . Find the list for free.\nHut 8 Investment Narrative Recap To own Hut 8 today, you need to believe it can evolve from a Bitcoin price sensitive miner into a contracted power and compute platform, while actually delivering its massive development pipeline. The 15 year, US$7.00 billion Fluidstack lease directly strengthens the near term catalyst of more predictable, infrastructure like cash flows, but it does not remove the key risks tied to Bitcoin exposure, project execution and the capital intensity of River Bend and other builds.\n\nThe most relevant recent announcement is the Anthropic and Fluidstack partnership, which sets a framework for Hut 8 to deploy at least 245 MW and potentially up to 2,295 MW of AI data center capacity. That context matters for this lease because it links the River Bend campus to an identified AI tenant ecosystem, reinforcing the idea that Hut 8’s growth runway increasingly depends on executing large, complex AI and high performance computing projects alongside Bitcoin focused operations.\nYet the biggest risk investors should be aware of is how quickly execution or Bitcoin volatility could pressure...\nRead the full narrative on Hut 8 (it's free!)\nHut 8’s narrative projects $767.3 million in revenue and $140.6 million in earnings by 2028. This requires 76.9% yearly revenue growth and a $13.4 million earnings decrease from $154.0 million today.\n\nUncover how Hut 8's forecasts yield a $56.12 fair value , a 40% upside to its current price.\nExploring Other Perspectives Four fair value estimates from the Simply Wall St Community span roughly US$24 to US$56.13, showing just how far apart individual views on Hut 8 can be. Against that backdrop, the scale of the new US$7.00 billion River Bend lease highlights how much of Hut 8’s future now hinges on successfully commercializing large AI and infrastructure projects, so it is worth exploring several alternative viewpoints before forming your own stance.\n\nStory Continues\nExplore 4 other fair value estimates on Hut 8 - why the stock might be worth 40% less than the current price!\nBuild Your Own Hut 8 Narrative Disagree with existing narratives? Create your own in under 3 minutes - extraordinary investment returns rarely come from following the herd.\nA great starting point for your Hut 8 research is our analysis highlighting 3 key rewards and 4 important warning signs that could impact your investment decision.\nOur free Hut 8 research report provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate Hut 8's overall financial health at a glance.\n\nLooking For Alternative Opportunities? Markets shift fast. These stocks won't stay hidden for long. Get the list while it matters:\nThe end of cancer? These 29 emerging AI stocks are developing tech that will allow early identification of life changing diseases like cancer and Alzheimer's.\nWe've found 13 US stocks that are forecast to pay a dividend yield of over 6% next year . See the full list for free.\nFind companies with promising cash flow potential yet trading below their fair value .\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include HUT .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:37:47",
      "Source": "Bloomberg",
      "Title": "Tesla’s ‘Musk Premium’ in Focus With SpaceX IPO in View",
      "URL": "https://finance.yahoo.com/news/tesla-musk-premium-focus-spacex-120001761.html",
      "Content": "Tesla’s ‘Musk Premium’ in Focus With SpaceX IPO in View\n\nJordan Fitzgerald\nThu, December 18, 2025 at 7:37 AM PST 6 min read\n\nIn this article: TSLA\n\n^GSPC\n\nPLTR\n\nMU\n\nOPAI.PVT\n\n(Bloomberg) -- (Updates stock price after Thursday’s open)\nElon Musk is selling investors a future of driverless cars, robot assistants and life on Mars. The problem for investors is there’s only one way to buy into his vision: Tesla Inc.’s stock.\nMost Read from Bloomberg\nHudson Tunnel Digging Work to Start as Boring Machines Ready\nNYC High Line-Area Building Floats $53 Million Bankruptcy Sale\nHow This Chameleon UK Location Became a Little-Known Hollywood Backdrop\nNew York Says Cab, Rideshare Insurance Rates to Rise 25%\nNew York Utility Says Queue for Large Power Users Has Tripled\n\nThe electric-vehicle maker’s shares were up nearly 3% on Thursday. They hit their first record of the year on Tuesday amid gains of more than 20% over the last four weeks. Since tumbling to a low on April 8 during the height of panic over the Trump administration’s tariffs, the stock has soared almost 120%, putting it among the 20 best performers in the S&P 500 Index.\nThe rally is a testament to Wall Street’s faith in Musk’s artificial intelligence ambitions, particularly since Tesla’s core auto business is struggling. But it has also made Tesla shares extremely expensive. At 214 times earnings over the next 12 months, the stock has the second highest valuation in the S&P 500, trailing only Warner Bros Discovery Inc. and far ahead of number three, Palantir Technologies Inc., another high-flyer that trades at 178 times forward earnings as of Wednesday’s close.\n\n“The valuation doesn’t make any sense,” said Vikram Rai, portfolio manager and macro trader at First New York, which sold its Tesla position earlier this year after Musk and President Donald Trump had a very public fallout on social media.\nA Tesla representative didn’t reply to a request for comment.\nWith Musk’s SpaceX possibly going public next year, stock traders looking for “Elon exposure” will likely have another way to get it before long. The space exploration company is planning an insider share sale that would value it at $800 billion, making it the most expensive privately held business in the world. Its initial public offering would be the largest ever.\n\n“A SpaceX IPO could lead to some selling pressure on Tesla shares,” said Dmitry Shlyapnikov, an analyst at Horizon Investments who works with portfolio managers. “There are investors that own Tesla for exposure to Elon’s ideas and not for the car company attached to the ticker.”\nOf course, there’s another school of thought that a SpaceX public stock offering would shine a spotlight on Musk, giving Tesla another jolt of momentum.\n\nStory Continues\n“Historically, when one of Musk’s companies achieves a major milestone, it tends to lift sentiment for the others,” said Adam Sarhan, chief executive officer of 50 Park Investments. “A high-profile SpaceX IPO could attract a fresh wave of investors who are drawn to his innovation story — and that enthusiasm often spills over into Tesla.”\n\nSo far, Tesla’s stock price is getting a boost from the hype surrounding SpaceX, according to Bloomberg Intelligence analyst Steve Man. The missions of the two companies are interlinked, he said, describing a future where Tesla’s Optimus robots help with Musk’s ambition to colonize Mars, and SpaceX’s Starlink satellite system bolsters vehicle connectivity on Earth.\nThe companies also share lofty valuations. But Tesla skeptics question whether the company’s fundamentals can support those numbers. Its sales are slowing and profits are falling, while regulations rise and consumers spend less on cars.\n“If you’ve been long Tesla stock, you’ve made money, there’s no denying it,” said Thomas Thornton, founder of Hedge Fund Telemetry, who has a small short position in Tesla. “It’s just bizarre to me because the fundamentals are so bad.”\n\n‘Double-Down on Elon’\nOptimists, on the other hand, point to Tesla’s growth prospects with opportunities in autonomous driving and robotaxis. Musk’s goal is to transform Tesla from an auto manufacturer to an artificial intelligence and robotics company. He wrote in a September X post that 80% of the firm’s profits will eventually come from robots.\n“We believe Tesla’s earnings are going to be growing at 30% to 35% over the next two to three years based on the innovation that they have in the automotive segment,” said Brian Mulberry, client portfolio manager at Zacks Investment Management, which owns the company’s shares.\nIf Musk can pull that off, Tesla’s stock market valuation would make more sense. If he can’t, that’s where SpaceX comes in. Publicly traded shares of SpaceX would give investors the opportunity to own a piece of Musk’s vision without Tesla’s baggage.\n\n“I think most investors will not want to double-down on Elon,” First New York’s Rai said. “That is a lot of risk to carry.”\nNeedham analyst Chris Pierce disagrees.\n“We don’t see investors making an either/or choice, but instead backing both companies,” he said. “Investors that have made money in Tesla are likely to want to back another Musk venture.”\nFor now, the reality for investors is Tesla is the only way to bet on Musk’s vision. The immediate risk is the stock’s valuation, which is getting close to dangerous territory. On a technical level, the shares had been close to being considered overbought earlier this week. When they last reached that level in early October, the stock fell 10% over the next seven sessions.\n“In the short term, it’s probably ready for a bit of a cooling off type of period after having that all-time high,” Mulberry said.\n\nBut to long-term Musk believers, the valuation may indeed be a short-term concern. Over the next few years, however, many see Tesla as a buy regardless of the price — possibly even more than SpaceX.\n“I fully believe that at some point there will be a commercial mission to Mars, but probably not in my lifetime,” said Mulberry, who is 51 years old. “Does that mean I want to invest in that stock today? You’d have to have a really long view of that, whereas you could see the impact of robotaxis and robots probably in the next three to five years.”\nTop Tech News\nMicron Technology Inc., the largest US maker of computer memory chips, gave an upbeat forecast for the current quarter, a sign that surging demand and supply shortages are allowing the company to charge more for products.\nThe growing acrimony over the biggest deal in Hollywood is spilling into the open. On Wednesday, Warner Bros. Discovery Inc., the parent of HBO and CNN, advised its shareholders to reject a hostile takeover bid by Paramount Skydance Corp. in favor of its original agreement with streaming giant Netflix Inc.\nOpenAI and Anthropic are looking to expand their office footprints in Dublin, a move that underscores both firms’ growing presence in Europe and the race to boost global uptake of their artificial intelligence services.\nApple Inc. is making changes to its iOS software in Japan to comply with a new local law aimed at fostering competition, part of broader efforts by the iPhone maker to adapt to regulations around the world.\nThe Academy Awards will move to Alphabet Inc.’s YouTube service in 2029, ending more than a half century on the ABC network and more than 70 years on broadcast TV.\n\nEarnings Due Thursday\nNo major earnings expected\n--With assistance from Matt Turner, David Watkins and Nathaniel Popper.\nMost Read from Bloomberg Businessweek\nThe Cracks in Crumbl’s Cookie Empire Are Showing\nUniqlo Founder and Japan’s Richest Man Loves a $32 Pair of Slacks\nPrivate Equity Is Ruining a Beloved Fly-Fishing Brand, Retailers Say\nDonald and Melania Trump’s Terrible, Tacky, Seemingly Legal Memecoin Adventure\nOracle’s $300 Billion AI Bet Has Fast Become a Bubble Barometer\n©2025 Bloomberg L.P.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:35:00",
      "Source": "Motley Fool",
      "Title": "3 Warren Buffett Stocks to Hold Forever",
      "URL": "https://finance.yahoo.com/m/3eaaa0a2-6db9-3faf-88be-3117e4313d8a/3-warren-buffett-stocks-to.html",
      "Content": "3 Warren Buffett Stocks to Hold Forever\n\nJames Brumley, The Motley Fool\nThu, December 18, 2025 at 7:35 AM PST 7 min read\n\nIn this article: BRK.A\n\nKO\n\nAMZN\n\nGOOG\n\nKey Points Beverage behemoth Coca-Cola is one of Berkshire Hathaway’s longest-held and biggest positions.\nYou know Amazon as an e-commerce powerhouse, but that’s not quite what makes it such a promising long-term prospect.\nGoogle’s parent Alphabet has proven it’s willing and able to successfully build or acquire businesses that expand its digital consumer-facing ecosystem.\n10 stocks we like better than Amazon ›\n\nThe end of an era is almost upon us. After 55 years at the helm, at the end of this year, Warren Buffett will be stepping down as Berkshire Hathaway 's (NYSE: BRK.A) (NYSE: BRK.B) CEO and chief stock-picker.\nAnd when he goes, many members of the investment community could find themselves at a loss. Although Berkshire isn't just a mutual fund, plenty of investors took Buffett's lead by copying Berkshire's trades; now the conglomerate's stock picks won't necessarily be Buffett-approved holdings. So, if you want to know for sure that you're following in his footsteps, you'd better act soon.\nTo this end, here's a rundown of three names currently in Berkshire Hathaway's portfolio that you not only know the Oracle of Omaha likes well enough to own them, but each of which could safely be bought and held forever.\n1. Coca-Cola Coca-Cola (NYSE: KO) isn't just one of Berkshire's longest-held positions at 19 years. It's also become the conglomerate's third-biggest holding, currently worth $28 billion. That's 10% of Berkshire's entire publicly traded portfolio.\nIt's not hard to see why Buffett's been such a long-term fan of the beverage giant, either. Not only is it the biggest and best-known name in the business, but it's a dividend machine! In addition to paying a dividend like clockwork for decades, The Coca-Cola Company has raised its per-share dividend payment for 63 consecutive years (and counting). This year, Berkshire's 400 million shares of KO will provide Buffett and his lieutenants with more than $200 million in cash. Never even mind the near-200% gain this stock's price alone has produced since Buffett first bought it back in late 2006.\n\nIt's also a great \"forever\" stock for two other reasons. One of these is simply that the world will always need something to drink. With brands like Gold Peak tea, Powerade sports drinks, Minute Maid juices, Dasani water, and, of course, its namesake cola, The Coca-Cola Company has something to offer everyone.\nAnd the other reason this name's got staying power worth buying into? Its sheer size (read \"deep pockets\") -- the drinks giant can afford to outspend its competitors. For perspective, Coca-Cola spent more than $5 billion on advertising last year alone.\n\nStory Continues\nNo, it may not be fair. Investors don't want a fair fight, however. They want the companies they own to have an unfair advantage over their competition.\n2. Amazon Yes, Berkshire Hathaway holds a stake in Amazon (NASDAQ: AMZN) . It's not a big stake, mind you -- just 10 million shares currently worth about $2.2 billion. That's less than 1% of the conglomerate's total stock holdings.\nStill, the fact that he's willing to let Berkshire hold any Amazon at all is noteworthy just because Buffett has typically eschewed such flashy technology stocks, explaining that he doesn't always fully understand their business models. And to be sure, the pick was likely encouraged by Todd Combs and/or Ted Weschler, who help oversee the conglomerate's equity holdings.\n\nThe pick also makes much more sense to Buffett now, however, than it would have several years ago.\nWhile Amazon may have been something of an unknown in its infancy (when the internet itself was still young and evolving, and when Buffett was forming his previous opinion on most technology stocks), even he would have to agree that uncertainty no longer applies. E-commerce is clearly here to stay, and Amazon clearly leads at least the U.S. e-commerce market; it isn't doing too badly overseas either. All told, despite its already-massive size, this company's product sales are up more than 8% through the first three quarters of this year. This growth rate accelerated last quarter, too, despite the lethargic economy here and abroad.\nAmazon isn't just e-commerce anymore, either. Although it only accounts for a minority of its revenue, its cloud computing arm, Amazon Web Services, contributes roughly 60% of the company's total operating income. And the cloud computing industry is here to stay as well. Indeed, Straits Research expects the worldwide cloud computing industry to grow from less than $1 trillion this year to nearly $3.7 trillion per year by 2033.\n\nWhat makes this name such a great forever holding, however, is that -- not unlike Berkshire Hathaway itself -- Amazon has proven that it's willing and able to adapt to an ever-changing marketplace of opportunities.\n3. Alphabet Finally, add Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) to your list of Warren Buffett stocks to buy and hold forever for yourself.\nThere are actually several clear parallels between Berkshire's positions in Amazon and Alphabet. Both are holdings that wouldn't have likely even been considered as potential picks a few years ago, for instance, yet both businesses have clearly solidified in the meantime. Both companies are also flexible; Amazon added cloud computing to its repertoire several years ago and is now turning its online shopping platform into an advertising medium, while Alphabet has moved well beyond its Google search engine with profit centers like YouTube and its own cloud computing service. Berkshire doesn't exactly have a huge stake in either outfit, only holding 17.8 million shares currently worth about $5.5 billion. That's less than 2% of the conglomerate's total stock holdings.\n\nIt's also a pretty safe bet that this position is the result of prodding from Todd Combs or Ted Weschler.\nWhatever the case, Buffett's pseudo-endorsement of Alphabet serves as a green light of sorts for you, plugging you into the company that still handles 90% of the world's web searches (according to Statcounter).\nThat's not the chief reason Alphabet is such a great long-term bet, though. The biggest and best bullish argument here is a more philosophical one. That's Alphabet's willingness and ability to build or buy a business, anything that allows it to expand its digital ecosystem.\nYouTube is one example; Google acquired it back in 2006. Alphabet's chat-based artificial intelligence platform Gemini is another example, as is 2004's launch of Gmail and 2005's acquisition of mobile operating system Android, which Statcounter says is installed on 72% of the world's mobile devices.\n\nMeanwhile, Alphabet's \"Other Bets\" arm is home to developing self-driving taxi service Waymo and life-science outfit Verily.\nSome of these projects pan out. Others don't. There's a reason, however, that Alphabet has only failed to produce year-over-year quarterly revenue growth once in the past 10 years. That's the beginning of the COVID-19 pandemic in early 2020 -- and that was a short-lived headwind. Its profit growth has been almost as persistent. There's no end in sight to this growth streak, either. There's just too much worldwide dependence on Alphabet's offerings.\nShould you invest $1,000 in Amazon right now? Before you buy stock in Amazon, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Amazon wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $511,196 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,047,897 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 954 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nJames Brumley has positions in Alphabet and Coca-Cola. The Motley Fool has positions in and recommends Alphabet, Amazon, and Berkshire Hathaway. The Motley Fool has a disclosure policy .\n3 Warren Buffett Stocks to Hold Forever was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:31:58",
      "Source": "Yahoo Finance",
      "Title": "Trump Media stock surges more than 30% on surprise merger with power firm TAE",
      "URL": "https://finance.yahoo.com/news/trump-media-stock-surges-more-than-30-on-surprise-merger-with-power-firm-tae-153158724.html",
      "Content": "Trump Media stock surges more than 30% on surprise merger with power firm TAE\n\nInes Ferré · Senior Business Reporter\nUpdated Thu, December 18, 2025 at 7:31 AM PST 2 min read\n\nIn this article: TATE.PVT\n\nGOOG\n\nGS\n\nCVX\n\nDJT\n\nTrump Media and Technology Group ( DJT ) stock surged more than 35% on Thursday after the parent company of Truth Social announced a merger with fusion power firm TAE Technologies ( TATE.PVT ).\nThe deal underscores a bet on the energy demands from AI and data centers and the technologies that could prevail. TAE's backers include tech giant Google ( GOOG , GOOGL ), Goldman Sachs ( GS ), and oil major Chevron ( CVX ).\n\nThe agreement, valued at more than $6 billion, is a bet on the future of fusion, a type of nuclear technology that mimics the way the sun produces light and heat. Fusion is carbon-free and produces significantly less radioactive waste than traditional nuclear power.\nThe technology is not yet commercially available, but the deal includes an immediate $200 million in cash at signing. This funding is intended to facilitate the start of construction of the company's first utility-scale fusion power plant in 2026.\nUnder the terms of the deal, TMTG and TAE shareholders will each own approximately 50% of the newly combined entity.\nUpon closing, TMTG, currently majority owned by President Trump's revocable trust, will serve as the holding company for Truth Social, Truth+, Truth.Fi, and TAE, among other entities.",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:15:49",
      "Source": "24/7 Wall St.",
      "Title": "China Prepares to Wreck US AI Industry",
      "URL": "https://finance.yahoo.com/m/52060673-6d88-33ef-9d62-758d25b5efeb/china-prepares-to-wreck-us-ai.html",
      "Content": "China Prepares to Wreck US AI Industry\n\nDouglas A. McIntyre\nThu, December 18, 2025 at 7:15 AM PST 4 min read\n\nIn this article: META\n\nGOOG\n\nNVDA\n\nORCL\n\nMSFT\n\nThe math is simple. It starts with three facts. China has spent massive amounts to create very low-priced electricity at a rate several times the U.S. pace. It has built massive dams. The best example is the Motuo Hydropower Station on the Yarlung Tsangpo River in Tibet. No other nation could build a colossal project so fast. And China has extraordinary solar power supply. Do the large Chinese artificial intelligence (AI) companies pay for these? No. The central government largely does. China is a dictatorship, so things happen that way.\n\n24/7 Wall St. Key Points There are three ways China is poised to leap ahead in artificial intelligence.\nThe United States faces many headwinds in creating AI infrastructure.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:11:42",
      "Source": "Reuters",
      "Title": "Lovable valued at $6.6 billion in latest funding round as AI coding demand surges",
      "URL": "https://finance.yahoo.com/news/lovable-valued-6-6-billion-151142662.html",
      "Content": "Lovable valued at $6.6 billion in latest funding round as AI coding demand surges\n\nReuters\nThu, December 18, 2025 at 7:11 AM PST 1 min read\n\nIn this article: NVDA\n\nDATB.PVT\n\nTEAM\n\nGOOG\n\nREPI.PVT\n\nDec 18 (Reuters) - AI software development startup Lovable said on Thursday it raised $330 million in an early-stage funding ​round that values the Stockholm-based company at $6.6 billion.\nAlphabet's CapitalG and ‌Menlo Ventures led the round, which nearly quadruples Lovable's valuation in less than ‌six months.\n\nThe deal also drew investment from Nvidia 's venture capital arm among others, underscoring investor demand for agentic AI tools that can handle complex software development work with minimal human input, as ⁠enterprises and hobbyists increasingly ‌adopt AI-assisted coding.\nLovable's sharp jump in value comes amid a boom in \"vibe coding,\" in which users describe ‍a project in plain language and expect AI to generate a full program.\nCompetitors including Replit, OpenAI , Google and Cursor offer similar products aimed at ​the growing market for agentic software development.\nThe company hit $100 ‌million in annual recurring revenue in the summer, about eight months after reaching its first $1 million, and now ranks among Europe's most valuable private technology firms. A funding round that closed in July valued it at $1.8 billion.\n\nA roster of strategic backers also joined ⁠in the latest funding round, including ​the venture arms of Salesforce, Databricks, ​and Atlassian.\nLovable said it will use the new capital to expand enterprise features, strengthen collaboration tools and scale ‍infrastructure as usage ⁠grows.\nFounded in late 2023 by Anton Osika and Fabian Hedin, Lovable quickly gained traction with users and venture capital ⁠alike by enabling non-technical founders and teams to build and iterate on digital ‌products without traditional coding expertise.\n(Reporting by Arnav Mishra in ‌Bengaluru; Editing by Tasim Zahid)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:10:26",
      "Source": "24/7 Wall St.",
      "Title": "Microsoft Looks Like a “Table Pounder” After Dipping on AI Worries",
      "URL": "https://finance.yahoo.com/m/86b3260d-c93c-323a-878a-958a2eeba1fc/microsoft-looks-like-a-%E2%80%9Ctable.html",
      "Content": "Microsoft Looks Like a “Table Pounder” After Dipping on AI Worries\n\nJoey Frenette\nThu, December 18, 2025 at 7:10 AM PST 5 min read\n\nIn this article: MSFT\n\nGOOG\n\nQuick Read Microsoft stock is down over 12% from recent highs amid AI spending concerns and competition from Google’s Gemini 3.0.\nThe company denied reports of reduced AI sales quotas following an article from The Information.\nMicrosoft has its own AI team led by Mustafa Suleyman and can reduce OpenAI dependence through Azure and its MAI model.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:59:41",
      "Source": "TechCrunch",
      "Title": "Trump Media is merging with fusion power company TAE Technologies in $6B+ deal",
      "URL": "https://finance.yahoo.com/news/trump-media-merging-fusion-power-145941117.html",
      "Content": "Trump Media is merging with fusion power company TAE Technologies in $6B+ deal\n\nTim De Chant, Amanda Silberling\nThu, December 18, 2025 at 6:59 AM PST 3 min read\n\nIn this article: TATE.PVT\n\nMETA\n\nGOOG\n\nPresident Donald Trump’s social media company, Trump Media and Technology Group (TMTG), said on Thursday that it’s merging with TAE Technologies , a Southern California-based company that has been chasing the dream of fusion power for nearly 30 years.\nThe all-stock transaction, valued at more than $6 billion, would expand Trump Media’s presence into the nascent fusion power space while data centers clamor for more electricity amid the ongoing AI boom.\n\nTMTG is the parent company of Truth Social, the microblogging platform that the president spun up after he was banned from platforms like YouTube, Twitter, and Facebook in the wake of the January 6 attacks on the U.S. Capitol. At launch , the president called it “a rival to the liberal media consortium,” and said he wanted to “fight back against the Big Tech companies.”\nTMTG went public last year via a merger with a special-purpose acquisition company (SPAC), a technique used to go public by private companies that want to raise money quickly but aren’t yet mature enough to take the traditional IPO route. In the quarter ended September 30, 2025, TMTG reported that it recorded a loss of $54.8 million on revenue of $972,900.\nTruth Social and the company’s streaming platform have failed to generate much revenue, but TMTG has nevertheless managed to amass $3.1 billion in assets, largely through its cryptocurrency investments and partnerships.\n\nTMTG CEO Devin Nunes, formerly a Republican congressman, stated that the company’s acquisition of TAE would “cement America’s global energy dominance for generations.” The companies said they plan to site and begin construction on “the world’s first utility-scale fusion power plant (50 MWe)” next year, and have plans for more fusion plants that are expected to generate between 350 megawatts to 500 megawatts of electricity.\nBut the path forward for fusion power remains uncertain.\nCurrently, only one experimental device has proven that controlled fusion reactions can generate more power than they consume. Several other companies, including Bill Gates-backed Commonwealth Fusion Systems and Sam Altman-backed Helion , are in the race to put fusion power on the grid sometime in the early 2030s.\n\nIf one or more fusion startups succeed, they could deliver gigawatts of clean, continuous power to the grid using nothing more than hydrogen isotopes filtered from seawater. Inside a fusion reactor, those isotopes are heated and compressed until they turn into a plasma. When particles in the plasma collide, they merge to form a new, heavier atom while releasing tremendous amounts of heat, which can be harvested to generate electricity.\n\nStory Continues\nTAE has been working on a range of fusion devices since the late 1990s. The company has raised nearly $2 billion in total, including a recent $150 million round from existing investors including Google, Chevron Technology Ventures, and New Enterprise. The company has been valued at about $1.8 billion, according to PitchBook.\n\nOver the years, TAE has struggled to make its various designs work. Its latest effort uses magnetic fields generated by rotating plasma to stabilize the plasma itself. Particle beams bombard the outside of the plasma cloud, helping it to spin.\nIn the meantime, TAE has also created a new division focused on the life sciences. It is selling a version of its particle accelerator as a radiation treatment for cancer.\nAfter the merger, Nunes and TAE CEO Dr. Michl Binderbauer will serve as co-CEOs of the combined company.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:56:39",
      "Source": "MT Newswires",
      "Title": "Dynatrace Serves as Launch Partner for Gemini Enterprise, Gemini CLI Extensions",
      "URL": "https://finance.yahoo.com/news/dynatrace-serves-launch-partner-gemini-145639002.html",
      "Content": "PREMIUM\nDynatrace Serves as Launch Partner for Gemini Enterprise, Gemini CLI Extensions\n\nMT Newswires\nThu, December 18, 2025 at 6:56 AM PST\n\nIn this article: DT\n\nGOOG\n\nDynatrace (DT) said Thursday that it expanded its collaboration with Alphabet's (GOOG, GOOGL) Google\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:35:06",
      "Source": "Yahoo Finance",
      "Title": "Stock market today: Dow, S&P 500, Nasdaq rise as CPI inflation eases in November, Micron boosts tech",
      "URL": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-rise-as-cpi-inflation-eases-in-november-micron-boosts-tech-143506528.html",
      "Content": "LIVE\n\nStock market today: Dow, S&P 500, Nasdaq rise as CPI inflation eases in November, Micron boosts tech\n\nKaren Friar and Brett LoGiurato\nUpdated Thu, December 18, 2025 at 6:35 AM PST 2 min read\n\nIn this article: MU\n\n^DJI\n\nGOOG\n\n^IXIC\n\nNVDA\n\nUS stocks rose on Thursday, eyeing a recovery from Wall Street's tech-fueled sell-off, as investors digested the easing inflation pressures from the latest reading on consumer prices that could help set expectations for the path of interest rates.\nThe tech-heavy Nasdaq Composite ( ^IXIC ) led the way up with a gain of 1.5%, pushed north by a strong earnings report from Micron ( MU ) after AI trade worries spurred another bruising session for tech on Wednesday. Shares in the benchmark S&P 500 ( ^GSPC ) and the blue chip-heavy Dow Jones Industrial Average ( ^DJI ) rose around 1% and 0.7%, respectively.\n\nHeadlining the morning was a cooler-than-expected Consumer Price Index (CPI) report, which showed inflation rose 2.7% in November over the prior year and 2.6% on a \"core\" basis — both figures coming in below economist estimates of 3% and 3.1%, respectively.\nAs with Tuesday's monthly jobs report , economists have noted that the inflation data may be less reliable than normal thanks to the US government shutdown. At the same time, the Federal Reserve seems more attentive to cracks in the labor market than to price pressures. On Wednesday, Fed governor Chris Waller signaled support for rate cuts before the release of the CPI update.",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:05:11",
      "Source": "Reuters",
      "Title": "Trump Media bets on fusion energy with $6 billion TAE deal",
      "URL": "https://finance.yahoo.com/m/feae638c-4bbb-3820-ba34-86fb071d46f7/trump-media-bets-on-fusion.html",
      "Content": "Trump Media bets on fusion energy with $6 billion TAE deal\n\nBy Deborah Mary Sophia and Timothy Gardner\nThu, December 18, 2025 at 6:05 AM PST 3 min read\n\nIn this article: TATE.PVT\n\nGOOGL\n\nBy Deborah Mary Sophia and Timothy Gardner\nDec 18 (Reuters) - U.S. President Donald Trump is getting into the fusion power business through a $6 billion merger of his social media firm and Google-backed TAE technologies, just days after industry representatives ​urged federal funding.\nThe all-stock deal announced on Thursday is an ambitious bet on the power boom spurred by artificial ‌intelligence datacenters and adds to the Trump family's growing roster of diverse ventures from cryptocurrency to real estate holdings and mobile services.\n\nGrowing electricity needs of the technology industry ‌has in recent months revived interest in nuclear power, including restarting fully shuttered reactors, expanding existing plants and signing contracts for future small modular reactors.\nBut despite decades of global efforts, nuclear fusion, often seen as a cleaner and reliable power source, has yet to produce a commercially viable reactor.\nTAE has been working with Google Research for more than a decade on fusion science and its backers include Chevron and Sumitomo Corporation ⁠of Americas.\nThe company, which was founded in 1998, ‌also operates an energy-storage business and a life sciences unit that develops biologically targeted radiotherapy to treat cancer.\nDEAL TERMS\nShareholders of both companies will own about 50% of the combined entity after the deal closes in ‍mid-2026. Trump Media and Technology Group will be the holding company for businesses including Truth Social platform, TAE Power Solutions and TAE Life Sciences.\n\nTrump Media shares jumped 33% in premarket trading, drawing traction on Stocktwits, a social media hub for retail investors. The money-losing company's stock has declined nearly 70% ​this year.\n\"TAE will also clearly have major political support from President Trump in our view,\" Wedbush analyst Dan Ives said.\nFUSION TECHNOLOGY\nCompanies and ‌physicists at national laboratories have been trying for decades to foster fusion reactions, in which light atoms are forced together under extreme temperatures to release huge amounts of energy, a process that fuels the sun.\nBig hurdles to commercialize fusion include getting more energy out of a reaction than what goes into it and developing plants that can withstand streams of fusion reactions to power the grid.\n\nTAE CEO Binderbauer and other fusion company leaders met with U.S. Energy Department officials this month, weeks after the department formed its first ever fusion ⁠office.\nThe company, which has raised more than $1.3 billion in private funding, is aiming ​to develop and sell next‑generation neutral beam systems for fusion and related applications ​in a more cost‑effective manner.\n\nStory Continues\nTrump Media has agreed to provide up to $200 million in cash to TAE at signing and $100 million more upon initial filing of the registration. The deal has been approved by the companies' boards.\nThe ‍two companies plan to begin construction ⁠on the world's first utility-scale fusion power plant after the deal closes.\n\nTrump Media CEO Devin Nunes will be the co-CEO of the new company, along with Binderbauer. The combined company will have a nine-member board, including Nunes, Binderbauer and Donald Trump ⁠Jr.\nThe company, which mainly generates revenue from advertising on the Truth Social platform, has consistently clocked losses since its inception. It posted a decline in revenue and ‌a loss of $54.8 million the third quarter ended September.\n(Reporting by Deborah Sophia and Vallari Srivastava in Bengaluru and Timothy ‌Gardner in Washington DC ; Editing by Shilpi Majumdar and Arun Koyyur)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:00:00",
      "Source": "Business Wire",
      "Title": "Dynatrace Expands Collaboration with Google Cloud to Help Power the Next Generation of AI Innovation",
      "URL": "https://finance.yahoo.com/news/dynatrace-expands-collaboration-google-cloud-140000141.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nDynatrace Expands Collaboration with Google Cloud to Help Power the Next Generation of AI Innovation\n\nBusiness Wire\nThu, December 18, 2025 at 6:00 AM PST 4 min read\n\nIn this article: DT\n\nGOOG\n\nAs a launch partner for Gemini Enterprise and Gemini CLI extensions, Dynatrace integrations are now available on Google Cloud Marketplace\nBOSTON, December 18, 2025 --( BUSINESS WIRE )-- Dynatrace , (NYSE: DT), the leading AI-powered observability platform, today announced it has expanded its collaboration with Google Cloud to help empower enterprises and developers to harness the full potential of agentic AI by becoming a launch partner for Gemini CLI extensions and Gemini Enterprise , a new agentic platform.\n\nThe Dynatrace Gemini CLI Extension gives developers immediate access to observability and root-cause analysis directly within their terminal, allowing them to monitor, debug, and optimize applications without leaving their workflow.\nComplementing this, Gemini Enterprise connects AI agents directly to Dynatrace’s observability platform via Google’s A2A protocol, enabling real-time collaboration between systems to help detect, resolve, and prevent issues across complex environments.\nTo simplify adoption, Dynatrace AI-driven integrations are now available through Google Cloud Marketplace, enabling customers to deploy and scale agentic AI solutions quickly and securely within their existing Google Cloud environments.\nDynatrace is among the first observability partners with a Google-validated A2A and Gemini Enterprise-compatible agent, demonstrating that its technology meets Google Cloud’s standards for performance and reliability. This achievement places Dynatrace within Google Cloud’s validated partner ecosystem, reinforcing its leadership in AI-powered observability and agentic architectures.\n\n\"Our expanded partnership with Google Cloud reflects Dynatrace’s leadership position in observability and our commitment to shaping how AI transforms cloud operations,\" said Jay Snyder, SVP of Partners and Alliances, Dynatrace. \"As a launch collaborator for both Gemini Enterprise and Gemini CLI extensions, we’re working with Google Cloud at the forefront of AI and observability innovation, helping customers build intelligent, reliable systems that adapt and optimize in real time.\"\n\"Accelerating AI across the enterprise requires a visibility that connects developer innovation directly with operational resilience,\" said Mitch Ashley, VP and Practice Lead, Futurum Research. \"Dynatrace's Gemini CLI Extension, combined with Dynatrace's Agent-to-Agent (A2A) integration into Gemini Enterprise, removes friction and increases velocity for operations to keep the enterprise in the flow of utilizing agentic AI as a scalable core business driver.\"\n\nStory Continues\nResources:\nPartners Powering the Gemini Enterprise Agent Ecosystem\nScaling AI Agents with Google Cloud Marketplace and Gemini Enterprise\nNow Open for Building: Introducing Gemini CLI Extensions\nWhen Your Service Won’t Wait: Troubleshooting EasyTrade with Dynatrace MCP and Gemini CLI\nAbout Dynatrace\nDynatrace is advancing observability for today’s digital businesses, helping to transform the complexity of modern digital ecosystems into powerful business assets. By leveraging AI-powered insights, Dynatrace enables organizations to analyze, automate, and innovate faster to drive their business forward. To learn more about how Dynatrace can help your business, visit www.dynatrace.com , visit our blog and follow us on LinkedIn and X @dynatrace .\n\nCurious to see how you can simplify your cloud and maximize the impact of your digital teams? Let us show you. Sign up for a 15-day Dynatrace trial .\nDynatrace and the Dynatrace logo are trademarks of the Dynatrace, Inc. group of companies. All other trademarks are the property of their respective owners. © 2025 Dynatrace LLC.\nCautionary Language Concerning Forward-Looking Statements\nThis press release includes certain \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995, including statements regarding Dynatrace’s and Google Cloud’s respective capabilities and the expected benefits to organizations from the partnership between Dynatrace and Google Cloud, and from using Dynatrace and Google Cloud. These forward-looking statements include all statements that are not historical facts and statements identified by words such as \"will,\" \"expects,\" \"anticipates,\" \"intends,\" \"plans,\" \"believes,\" \"seeks,\" \"estimates,\" and words of similar meaning. These forward-looking statements reflect our current views about our plans, intentions, expectations, strategies, and prospects, which are based on the information currently available to us and on assumptions we have made. Although we believe that our plans, intentions, expectations, strategies, and prospects as reflected in or suggested by those forward-looking statements are reasonable, we can give no assurance that the plans, intentions, expectations, or strategies will be attained or achieved. Actual results may differ materially from those described in the forward-looking statements and will be affected by a variety of risks and factors that are beyond our control, including the risks set forth under the caption \"Risk Factors\" in our Annual Report on Form 10-K, subsequent Quarterly Reports on Form 10-Q, and our other SEC filings. We assume no obligation to update any forward-looking statements contained in this document as a result of new information, future events, or otherwise.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251218145344/en/\nContacts\nMedia Relations:\nDynatrace PR Team\npr-team@dynatrace.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:08:14",
      "Source": "Yahoo Finance",
      "Title": "AI data centers are eating the memory industry, and it could hurt your wallet",
      "URL": "https://finance.yahoo.com/news/ai-data-centers-are-eating-the-memory-industry-and-it-could-hurt-your-wallet-130814928.html",
      "Content": "AI data centers are eating the memory industry, and it could hurt your wallet\n\nDaniel Howley · Technology Editor\nUpdated Thu, December 18, 2025 at 5:09 AM PST 3 min read\n\nIn this article: MU\n\nGOOG\n\nOPAI.PVT\n\nSSNLF\n\n000660.KS\n\nMemory maker Micron ( MU ) reported a blowout first quarter earnings report on Wednesday, beating expectations on the top and bottom lines and offering a better-than-anticipated outlook for the second quarter, as data center builders look to grab as much of the company's memory chips as possible.\nMicron builds memory, known as DRAM, for data centers. And as data center construction booms in the US, that memory is selling at a premium.\n\nThere's just one problem: DRAM is also used in devices like smartphones and laptops.\nConsumer PCs and other systems use a type of DRAM called double data rate memory (DDR), while data centers use a version of DRAM called high-bandwidth memory, HBM.\nDRAM suppliers are currently focusing more on building HBM than DRAM, thanks to higher margins on data center parts. And that's starving the broader market.\nIt's not just PC buyers who are feeling the sting, either. Everything from cars to medical equipment could be impacted by the dearth of memory chips.\nCompounding that is the fact that, ahead of its earnings, Micron announced that it is exiting the consumer memory business to focus on providing memory to AI data centers.\n\"It's not going to be good for consumers, because it's driving prices up, and very soon,” Ryan Reith, group vice president for IDC's worldwide device tracker, told Yahoo Finance.\nA massive memory crunch While most of us tend to think of GPUs powering AI data centers, they're only part of the server clusters that run apps like OpenAI's ( OPAI.PVT ) ChatGPT and Google's ( GOOG , GOOGL ) Gemini. In addition to CPUs and storage, they also need large pools of memory.\nThe problem? There are only a few major memory manufacturers in the world. That includes big-name companies like Samsung, SK Hynix, and Micron ( MU ). And the incredible demand for data center equipment is driving up prices across the entire industry.\n\nAccording to Reuters , Samsung has increased the prices of some memory by as much as 60%. Enthusiast site PCPartPicker , which tracks the prices of various memory sticks, shows the cost of some memory climbing from $100 to nearly $450.\n\"I think the general consensus is that in the last month … this has gotten a lot more attention, and not in a positive way,\" Reith said, adding that the price impact will likely end up getting passed through to consumers, especially on low-cost laptops.\nThat's because companies that produce entry-level and midrange systems have less room to maneuver when it comes to pricing before they completely eat through their margins.\n\nStory continues\n\n\"All of those things are essentially PCs. Any embedded device, game consoles, specialized medical equipment, those are all embedded computers, and they all have memory, and they all have storage of some kind,\" TECHnalysis Research founder and chief analyst Bob O'Donnell told Yahoo Finance.\n\nBut memory companies don't necessarily mind if there's a shortage of components for PCs and other systems as long as they're raking in cash on HBM, especially because the margins on HBM are higher than other types of memory.\nThere are some ways device makers can try to offset the increased price of memory, including using cheaper, less powerful components elsewhere in their products or putting pressure on suppliers to reduce costs, explained Bernstein analyst Stacy Rasgon.\nThis isn't the first time the tech industry has had to contend with memory supply problems, however. It is, after all, a notoriously cyclical market.\n\"What happens is, there's huge demand, and capacity gets built out, but it's never smooth,\" O'Donnell said.\n\n\"So … you get to the point where all demand gets sucked up, so you build these new factories, then you end up with a ton more capacity, and then the prices drop precipitously because there's too much capacity,\" he added.\nBut with so many companies building data centers across the globe, it's difficult to tell when the memory market will come back down.\nEmail Daniel Howley at dhowley@yahoofinance.com. Follow him on Twitter at @DanielHowley .\nFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here\nRead the latest financial and business news from Yahoo Finan ce.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:08:00",
      "Source": "The Wall Street Journal",
      "Title": "Trump Media to Merge With Fusion Energy Firm in $6 Billion Deal",
      "URL": "https://finance.yahoo.com/m/ff675e29-27a3-38f2-ae04-2ea028d72682/trump-media-to-merge-with.html",
      "Content": "Trump Media to Merge With Fusion Energy Firm in $6 Billion Deal\n\nGareth Vipers\nThu, December 18, 2025 at 5:08 AM PST 2 min read\n\nIn this article: TATE.PVT\n\nGOOG\n\nShares in the president’s media company jumped premarket after it agreed to a tie-up with TAE Technologies in an all-stock deal.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:05:14",
      "Source": "Reuters",
      "Title": "Big Tech-backed coalition supports biowaste carbon removal firm",
      "URL": "https://finance.yahoo.com/news/big-tech-backed-coalition-supports-130514530.html",
      "Content": "Big Tech-backed coalition supports biowaste carbon removal firm\n\nSimon Jessop and Susanna Twidale\nThu, December 18, 2025 at 5:05 AM PST 1 min read\n\nIn this article: STRI.PVT\n\nMETA\n\nGOOG\n\nSHOP\n\n(Corrects lede to remove referece to Meta which is no longer a member of the coalition, replaces with ​Stripe.)\nBy Simon Jessop and Susanna Twidale\nLONDON, Dec 18 (Reuters) - A coalition ‌backed by Big Tech companies including Google and Stripe has agreed to pay $44.2 ‌million for carbon credits from a Canadian company that aims to remove carbon dioxide from biowaste, the coalition's head of deployment told Reuters.\n\nFrontier, launched in 2022 by Stripe, Google, Meta, Shopify and McKinsey, aims to ⁠help scale carbon removal ‌technologies by committing to buy credits in advance, thereby derisking the projects and helping them grow more ‍quickly. The group plans to spend $1 billion on credits between 2022 and 2030.\nIts latest deal covers 122,000 metric tons of CO2 to be locked away ​between 2026 and 2030 by NULIFE GreenTech, which converts agricultural and ‌industrial waste - including grease from food processing - into bio-oil. The credits were purchased at an average weighted price of $362 per ton.\nNULIFE uses high-pressure cooking to break down waste into substances such as bio-oil, which is injected into salt caverns more than 1,000 metres underground ⁠for permanent storage. Frontier estimates the ​technology could scale to 1.5 gigatons of ​carbon removal annually by 2040.\n\"The goal at Frontier is really to create a portfolio of solutions that we ‍think are most ⁠likely to go the distance to a gigaton scale future,\" Hannah Bebbington Valori, Frontier’s head of deployment, said in an interview.\nScientists ⁠say carbon removal projects are critical to offset emissions from sectors that continue ‌to rely on fossil fuels.\n(Reporting by Simon Jessop and ‌Susanna Twidale. Editing by Mark Potter)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:00:00",
      "Source": "PR Newswire",
      "Title": "Data Center Capex Up 59 Percent on Continued AI Investment in 3Q 2025, According to Dell'Oro Group",
      "URL": "https://finance.yahoo.com/news/data-center-capex-59-percent-130000640.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nData Center Capex Up 59 Percent on Continued AI Investment in 3Q 2025, According to Dell'Oro Group\n\nPR Newswire\nThu, December 18, 2025 at 5:00 AM PST 3 min read\n\nIn this article: AMZN\n\nGOOG\n\nORCL\n\nMETA\n\nMSFT\n\nAccelerated Server Demand and Hyperscale Cloud expansion Drive Broad-based Infrastructure Spending\nREDWOOD CITY, Calif. , Dec. 18, 2025 /PRNewswire/ -- According to a recently published report by Dell'Oro Group, the trusted source for market information about the telecommunications, security, networks, and data center industries, worldwide data center capital expenditures increased 59 percent year-over-year, marking the eighth consecutive quarter of double-digit growth as the AI investment cycle continues to broaden beyond early, training-focused deployments.\n\"The Top 4 US cloud service providers—Amazon, Google, Meta, and Microsoft—continue to raise data center capex expectations for 2025, supported by increased investments in both AI and general-purpose infrastructure. Oracle is also on track to double its data center capex this year as it expands capacity for the Stargate project,\" said Baron Fung, Senior Research Director at Dell'Oro Group. \"What is notable this cycle is not just the pace of spending, but the expanding scope of investment, as cloud providers simultaneously scale accelerated compute, general-purpose servers, and the supporting infrastructure required to deploy AI at production scale. Accelerated server spending surged in the quarter, driven by the ramp of NVIDIA Blackwell Ultra, along with custom accelerator platforms across US hyperscalers, neo cloud providers, and sovereign AI deployments. At the same time, cloud service providers are increasing emphasis on greater capex discipline by optimizing asset depreciation and lifecycles to ensure healthy cash flow,\" explained Fung.\n\nAdditional highlights from the 3Q 2025 Data Center IT Capex Quarterly Report:\nThe global data center capex growth outlook was raised through 2026, reflecting sustained hyperscale investment and continued prioritization of AI infrastructure.\nDemand for general-purpose servers strengthened as cloud providers expanded compute and storage capacity to support growing cloud services and inference-heavy AI workloads.\nDell led all server OEMs in revenue, followed by HPE and Lenovo, gaining share on strong NVIDIA Blackwell shipments and a refreshed x86 portfolio, while white-box vendors captured the majority of server shipments, supported by hyperscale AI deployments and elevated general-purpose server demand.\nAbout the Report\nDell'Oro Group's Data Center IT Capex Quarterly Report details the data center infrastructure capital expenditures of each of the ten largest Cloud service providers, as well as the Rest-of-Cloud, Telco, and Enterprise customer segments. Allocation of the data center infrastructure capex for general-purpose and accelerated servers, storage systems, and other auxiliary data center equipment is provided. The report also discusses market trends, drivers of the leading Cloud service providers' capex growth during the quarter, and the outlook for the next year. To purchase this report, please contact us at dgsales@delloro.com.\n\nLire la suite\nAbout Dell'Oro Group\nDell'Oro Group is a market research firm that specializes in strategic competitive analysis in the telecommunications, security, enterprise networks infrastructure, and data center markets. Our firm provides in-depth quantitative data and qualitative analysis to facilitate critical, fact-based business decisions. For more information, contact Dell'Oro Group at +1.650.622.9400 or visit www.delloro.com .\nView original content to download multimedia: https://www.prnewswire.com/news-releases/data-center-capex-up-59-percent-on-continued-ai-investment-in-3q-2025-according-to-delloro-group-302642624.html\n\nCGU et Politique de confidentialité\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:00:00",
      "Source": "PR Newswire",
      "Title": "Tech Mahindra Accelerates Enterprise AI Transformation with Gemini Enterprise",
      "URL": "https://finance.yahoo.com/news/tech-mahindra-accelerates-enterprise-ai-130000092.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nTech Mahindra Accelerates Enterprise AI Transformation with Gemini Enterprise\n\nPR Newswire\nThu, December 18, 2025 at 5:00 AM PST 2 min read\n\nIn this article: TECHM.BO\n\nTECHM.NS\n\nGOOG\n\nPUNE, India , Dec. 18, 2025 /PRNewswire/ -- Tech Mahindra (NSE: TECHM), a leading global provider of technology consulting and digital solutions to enterprises across industries, announced that it plans to accelerate enterprise adoption of Gemini Enterprise using Google's Gemini 2.5 multimodal models. Through this collaboration, Tech Mahindra will empower customers to harness the full potential of Gemini Enterprise to drive measurable outcomes through responsible, human-centered AI.\nThe collaboration combines Tech Mahindra's extensive implementation experience, AI-first engineering talent, and proven Orion framework with Google Cloud's advanced AI capabilities to help organizations design, deploy, and scale next-generation Agentic AI solutions. Gemini Enterprise will also enable the creation of specialized AI agents, embed governance and safety guardrails, and integrate them seamlessly with Google Cloud's ecosystem, including Google Cloud's Vertex AI platform, Google BigQuery, and advanced data-to-AI pipelines.\n\nAmol Phadke, Chief Transformation Officer , Tech Mahindra, said, \"As enterprises evolve from AI experimentation to AI-driven business transformation, they require secure, scalable, and enterprise-ready intelligence that can operate across diverse business environments. Through our collaboration with Google Cloud and Gemini Enterprise, we are equipping organizations to embed AI into core operations with confidence, enabling intelligent, connected, and secure ecosystems powered by next-generation Agentic AI.\"\nAs a Google Cloud Premier Partner, Tech Mahindra brings strong implementation credentials aligned with its 'AI Delivered Right' strategy. The AI adoption strategy emphasizes four key pillars, including Transformation Delivered, Productivity Delivered, Innovation Delivered, and Assurance Delivered, ensuring AI is embedded into enterprise processes with trust, governance, and business-aligned impact.\n\nVictor Morales, Vice President, Global Systems Integrator Partnerships at Google Cloud , said, \" Agentic AI offers a powerful opportunity to reshape business models and unlock greater efficiency across every enterprise. By combining their deep industry expertise with Google Cloud's leading AI solutions, Tech Mahindra helps businesses meet this opportunity and deploy powerful solutions to solve complex business challenges. \"\nTech Mahindra has further strengthened its capabilities through dedicated Centers of Excellence, a portfolio of ready-to-deploy Agentic AI solutions, and a certified talent pool skilled in Google Cloud AI technologies. Together, the organizations will enable enterprises to move confidently toward an Agentic AI-powered future, where connected, reasoning agents deliver business outcomes with speed, precision, and purpose.\n\nLa historia continúa\nOur Website & Social Media Channels\nWebsite | LinkedIn | X\nLogo: https://mma.prnewswire.com/media/2804444/5688431/Tech_Mahindra_New_Logo.jpg\n\nView original content: https://www.prnewswire.com/news-releases/tech-mahindra-accelerates-enterprise-ai-transformation-with-gemini-enterprise-302645549.html\n\nCondiciones y Política de privacidad\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:50:00",
      "Source": "Motley Fool",
      "Title": "Got $1,000? 3 Tech Stocks to Buy and Hold for Decades",
      "URL": "https://finance.yahoo.com/m/adb18838-b387-36b1-9ac8-0b5773144db8/got-%241%2C000%3F-3-tech-stocks-to.html",
      "Content": "Got $1,000? 3 Tech Stocks to Buy and Hold for Decades\n\nManali Pradhan, CFA, The Motley Fool\nThu, December 18, 2025 at 4:50 AM PST 6 min read\n\nIn this article: NVDA\n\nIONQ\n\nORCL\n\nGOOG\n\nKey Points Nvidia boasts of exceptional multiyear revenue visibility.\nAlphabet’s full-stack AI approach is proving to be a key competitive advantage.\nIonQ can prove to be a high-growth, high-risk addition to a large and well-diversified investment portfolio.\n10 stocks we like better than Nvidia ›\nThe Federal Reserve's much-awaited 25-basis-point interest rate cut, announced on Dec. 10, has not delivered the market relief many investors had hoped for. While tech stocks initially jumped, the optimism was quickly replaced as renewed concerns around artificial intelligence (AI)-powered stocks resurfaced. Investor sentiment has further deteriorated after AI cloud giant Oracle missed earnings estimates in the second quarter of fiscal 2026 (ended Nov. 30, 2025), raising concerns about its ability to convert high-level capital investment into sustained profits.\nWith markets swinging sharply in response to changing sentiment, long-term investors can convert today's uncertainty into an entry opportunity. In case you have $1,000 not required to pay bills and debt or kept aside for contingencies, then investing in any of these three stocks can help generate wealth in the long run.\n\nNvidia Nvidia (NASDAQ: NVDA) might seem like the most obvious buy-and-hold pick for decades, and for good reason.\nThe company's exceptional long-term order visibility, worth nearly $500 billion of Blackwell and Rubin systems through 2025 and 2026, is itself a strong indicator of the durability of its long-term growth trajectory. While $150 billion in orders have already shipped, $350 billion worth of orders remain. Nvidia has expanded its strategic partnership with Saudi Public Investment Fund-backed AI company HUMAIN to jointly deploy up to 600,000 of its latest GPU systems over the next three years. This, coupled with a new compute capacity supply agreement with Anthropic, has expanded Nvidia's multiyear demand in addition to the $500 billion.\n\nThe reopening of the Chinese market is also a significant growth catalyst, considering that Nvidia once earned nearly 20% to 25% of its data center revenue from this market. Recently, the U.S. government approved the export of Nvidia's H200 chips to China, provided that 25% of the revenue is paid to the U.S. Treasury. According to a Reuters report, the company has informed Chinese clients that it is evaluating options to expand H200 chip production to meet the surging demand. While the Chinese government has yet to formally approve the purchases of these chips, the report notes that several Chinese technology companies, including Alibaba and ByteDance, have already contacted Nvidia to secure supply.\n\nStory Continues\nDespite the stellar demand, visibility, and expanding market access, Nvidia stock trades at a forward earnings multiple of 23 and a price-to-earnings-to-growth (PEG) ratio of just 0.48. While the stock may experience short-term volatility due to changes in hyperscaler spending and policy shifts, its long-term growth story remains intact. Hence, investors should be picking up a stake in this stock, especially at its current reasonable valuation levels.\n\nAlphabet Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) has also become a crucial player in the global development of AI infrastructure. The company exited the third quarter of fiscal 2025 (ended Sept. 30, 2025) with a Google Cloud backlog of $155 billion, up 46% on a sequential basis. Customers also entered into a larger number of deals valued at over $1 billion in the first nine months of 2025, compared to the combined total of the previous two years. Additionally, nearly 70% of the company's cloud customers are already using the company's AI products.\n\nThe rapid pace of enterprise adoption and improved multiyear revenue visibility of Google Cloud can be partly attributed to the company's full-stack AI strategy, spanning AI infrastructure, proprietary chips, AI models, and enterprise platforms. The full-stack approach is helping Google Cloud support large-scale AI deployments more efficiently. This, in turn, is contributing to improving margins and deepening existing customer relationships.\nBeyond Cloud, Alphabet's strategy of embedding AI across its ecosystem is also delivering strong results. AI experiences are already driving higher engagement in Search through AI Mode and AI Overviews. The company is seeing a higher number of overall queries, including commercial queries, which present additional avenues for monetization. YouTube is also benefiting from AI-driven recommendation systems and is witnessing robust double-digit revenue growth from advertising and subscriptions.\n\nAlphabet is generating durable cash flows from its consumer products, while Google Cloud is well positioned to ride the multiyear enterprise AI wave. The company trades at 27.6 times forward earnings, which appears rich. However, considering its scale, diversified revenue base, and technological edge, Alphabet can be a solid long-term pick even at an elevated valuation level.\nIonQ IonQ (NYSE: IONQ) is too speculative to serve as a core holding in a diversified portfolio. However, this quantum computing specialist could still merit a small allocation for investors seeking exposure to its long-term growth optionality or those growth drivers that cannot be fully modeled.\nIonQ has delivered exceptional top-line performance in the third quarter of fiscal 2025 (ended Sept. 30, 2025), with revenue soaring 222% year over year to $39.9 million, exceeding even the upper end of its own guidance by 37%. IonQ also has $3.5 billion in cash and no debt on its balance sheet, allowing the company to invest in future growth initiatives.\n\nManagement has highlighted multiple technical and product-specific milestones. The company successfully deployed its #AQ 64 Tempo system (capable of running large and complex quantum circuits) three months ahead of schedule and achieved a record two-qubit fidelity of 99.99% (meaning the system executes two-qubit operations correctly 99.99% of the time).\nIonQ is focused on expanding its presence beyond quantum computing, into associated areas, such as quantum networking, sensing, and security, through targeted acquisitions, including that of Oxford Ionics, Vector Atomic, and a controlling stake in ID Quantique. The company is also exploring commercialization opportunities through large-scale solutions-based contracts and a land-and-expand strategy. The company is thus striving to build long-term and sticky client relationships.\n\nStill, investors should remain aware of IonQ's risks, considering that the company is loss-making and incurring significant expenses on innovation. IonQ stock trades at 208.3 times sales, which is also very rich. Yet, the stock can be a good addition provided it does not exceed 5% of a large diversified portfolio.\nShould you buy stock in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,955 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,089,460 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 968 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nManali Pradhan, CFA has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, IonQ, Nvidia, and Oracle. The Motley Fool recommends Alibaba Group. The Motley Fool has a disclosure policy .\nGot $1,000? 3 Tech Stocks to Buy and Hold for Decades was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:50:00",
      "Source": "Newsfile",
      "Title": "DesignRush Names December 2025's Top SEO Agencies Amid Google Changes",
      "URL": "https://finance.yahoo.com/news/designrush-names-december-2025s-top-125000318.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nDesignRush Names December 2025's Top SEO Agencies Amid Google Changes\n\nNewsfile\nThu, December 18, 2025 at 4:50 AM PST 4 min read\n\nIn this article: GOOG\n\nDesignRush today announced its December ranking of leading SEO agencies, recognizing firms that help businesses navigate Google's core updates and AI-driven search changes.\nNew York, New York--(Newsfile Corp. - December 18, 2025) - DesignRush , a leading B2B platform, today released its list of the Top SEO Agencies for December 2025 as search teams adjust to another round of platform changes.\n\nThe agency's latest SEO roundup reported that Google has confirmed a new core update in the coming weeks, clarified that smaller updates often roll out without notice, and expanded Search Console with AI-powered reporting and longer performance views.\nAt the same time, Google Discover is giving more visibility to smaller publishers, changing how brands approach content and rankings.\nThe agencies featured this month reflect the skills businesses now need , including clear site structure, accurate performance tracking, and content that performs across search results, AI-driven discovery, and Discover feeds.\nHere are the top SEO agencies for December 2025 :\n1. eDesign Interactive\nLocation: Morristown, New Jersey, USA\nIndustries: CPG / Consumer Goods, Higher Education, Healthcare, Software / Technology, Fintech, Engineering / Construction, Hospitality\nWebsite: edesigninteractive.com\nDescription: eDesign Interactive is a full-service digital agency known for transforming brands through powerful storytelling, high-impact design, and performance-driven digital experiences. Since 2004, their award-winning team of creatives, strategists, and technologists has partnered with organizations across industries to deliver standout web design, branding, motion graphics, and conversion-focused campaigns. With studios in the U.S. and Europe, eDesign helps brands captivate audiences and accelerate growth.\n\n2. Funnel Boost Media\nLocation: San Antonio, Texas, USA\nIndustries: Healthcare, Finance, Legal, Home Services, Automotive, Professional Services\nWebsite: funnelboostmedia.net\nDescription: Funnel Boost Media is focused on helping local and regional businesses improve online visibility and grow through SEO, PPC, web design, and data-driven marketing strategies. Founded in 2012, the agency uses white-hat practices and transparent performance tracking to build campaigns that drive qualified leads and measurable outcomes. Funnel Boost Media tailors its services to the needs of service-oriented companies and keeps clients informed with clear reporting and collaborative engagement throughout every project.\n3. Rock Salt Marketing Cooperative\nLocation: Salt Lake City, Utah, USA\nIndustries: Healthcare, Professional Services, Real Estate, Food & Beverage, Retail, Creative Services\nWebsite: rocksaltmarketing.com\nDescription: Rock Salt Marketing Cooperative is a digital marketing agency with offices in Salt Lake City, Utah, and Nashville, Tennessee, specializing in SEO, paid media, and modern web design to help businesses improve online visibility and grow. The agency works with a range of clients, from local service providers and small businesses to national brands and multi-location organizations, delivering data-driven strategies with transparent reporting. Rock Salt positions itself as a partner for businesses at all stages, from small local operations to Fortune 500 companies, offering the expertise of a boutique agency with the efficiency of a larger firm.\n\nStory Continues\n4. Searchbloom\nLocation: Draper, Utah, USA\nIndustries: eCommerce, Healthcare, Legal, Manufacturing, Technology, Franchise / Multi-Location\nWebsite: searchbloom.com\nDescription: Searchbloom is a results-focused SEO and PPC agency that helps businesses improve visibility, attract qualified traffic, and optimize conversions. The agency emphasizes technical SEO precision, data-driven strategies, and ongoing campaign refinement, using proprietary frameworks like A.R.T. for SEO and A.C.E. for PPC. Searchbloom works closely with clients as partners rather than just customers, providing dedicated analysts and transparent reporting to ensure measurable, scalable results.\n\n5. eSEOspace\nLocation: San Diego, California, USA\nIndustries: Automotive, Beauty & Cosmetics, Fitness, Healthcare, Technology\nWebsite: eseospace.com\nDescription: eSEOspace is a digital agency helping small businesses and professional service providers improve online visibility and engagement. The team builds WordPress, Shopify, and custom websites, provides on-page, local, and AI/Generative SEO, and supports ongoing optimization to boost search performance. The agency also offers app and software development, including CRM, database, and backend solutions, alongside analytics setup, conversion tracking, and content strategy guidance.\n6. Fair Marketing Inc\nLocation: Spring, Texas, USA\nIndustries: Law, Healthcare & Fitness, Industrial, technology, Finance, Real Estate, Home Services\nWebsite: fairmarketing.com\n\n7. Technische SEO\nLocation: Apeldoorn, Netherlands\nIndustries: Small and Medium Enterprises Across Local Service Sectors, Ecommerce, Professional Services, Tech-Driven Businesses\nWebsite: technische-seo.nl\nBrands can explore the top SEO agencies by location, size, average hourly rate, and portfolio - all on DesignRush.\nAbout DesignRush\nDesignRush.com is a B2B marketplace and media platform connecting businesses with agencies through expert reviews and agency ranking lists, awards, knowledge resources, and personalized agency recommendations for vetted projects.\nMedia Contact\nIlze-Mari Gründling\nilze@designrush.com\n+1 305-370-1017\nhttps://www.designrush.com\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/278342\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:46:31",
      "Source": "Investor's Business Daily",
      "Title": "Data Centers Are Booming. So Is A Backlash Over Electricity Rates.",
      "URL": "https://finance.yahoo.com/m/21efdd73-59b7-33fc-8e84-fd1b3ad8eb99/data-centers-are-booming.-so.html",
      "Content": "Data Centers Are Booming. So Is A Backlash Over Electricity Rates.\n\nALEXIS GARCIA and KIT NORTON\nThu, December 18, 2025 at 4:46 AM PST 16 min read\n\nIn this article: AMZN\n\nMSFT\n\nGOOG\n\nMETA\n\nORCL\n\nThe data centers critical to the nation's AI ambitions are spawning local political battles as rising energy costs frustrate communities. What investors need to know about data center NIMBYism.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 34
}