{
  "stock_id": "INTC",
  "last_updated": "2025-12-26T12:11:18.318Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-26",
      "Time": "19:50:27",
      "Source": "MT Newswires",
      "Title": "Social Buzz: Wallstreetbets Stocks Mostly Lower Pre-Bell Friday; Intel, Air Industries to Fall",
      "URL": "https://finance.yahoo.com/news/social-buzz-wallstreetbets-stocks-mostly-115027642.html",
      "Content": "PREMIUM\nSocial Buzz: Wallstreetbets Stocks Mostly Lower Pre-Bell Friday; Intel, Air Industries to Fall\n\nMT Newswires\nFri, December 26, 2025 at 3:50 AM PST 1 min read\n\nIn this article: INTC\n\nAIRI\n\nAAPL\n\nMSFT\n\nGOOG\n\nThe most-talked-about stocks in the Reddit subforum Wallstreetbets were mostly lower hours before Fr\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "19:48:52",
      "Source": "GuruFocus.com",
      "Title": "Is Intel Stock a Buy Ahead of 2026?",
      "URL": "https://finance.yahoo.com/news/intel-stock-buy-ahead-2026-114852038.html",
      "Content": "Is Intel Stock a Buy Ahead of 2026?\n\nNauman Khan\nFri, December 26, 2025 at 3:48 AM PST 2 min read\n\nIn this article: INTC\n\nNVDA\n\nSFTBF\n\nThis article first appeared on GuruFocus .\nU.S. policy has reshaped Intel's ( NASDAQ:INTC ) investment case, and investors now see the company as more than a chipmaker chasing short-term profits. Washington and strategic partners have poured capital into Intel ( NASDAQ:INTC ), and that money changes the risk equation for the company's costly foundry pivot. The government's support gives Intel breathing room to push a capital-intensive plan that private markets might otherwise punish.\n\nWarning! GuruFocus has detected 5 Warning Signs with INTC.\nIs INTC fairly valued? Test your thesis with our free DCF calculator.\nIn Q3 Intel reported solid revenue and a clearer balance sheet after repaying debt and holding meaningful cash. The company keeps its foundry push front and center; that business still loses money, but leadership argues those losses will shrink as yields improve and volumes rise. Nvidia (NVDA) and SoftBank Group (SFTBY) contribute strategic capital and partnership opportunities that pair Intel's logic road map with external AI expertise.\nThe pivot carries real execution risk. Foundry losses run into the billions and management admits some nodes carry higher upfront costs and lower yields in early ramps. At the same time, capacity limits on older, profitable nodes left Intel unable to meet some demand, which complicates near-term margin recovery.\n\nPolicy backing matters. Infusion of cash by the government transforms Intel into a strategic toy, it attracts patient capital and provides company with additional runway to combat the manufacturing headaches. This does not negate the necessity of the fixes to its operations, however. Shareholders still desirous to see consistent yield increases, reduced margins, and a clearer path to foundry profitability.\nAt least, it is the crossroad between industrial policy and a risky, costly technological turnaround that Intel finds itself at now; the market would need to weigh the big picture priority versus immediate financial suffering.\nIs INTC Stock a Buy? Based on the one year price targets offered by 36 analysts, the average target price for Intel Corp is $36.79 with a high estimate of $52.00 and a low estimate of $18.00. The average target implies a upside of +1.74% from the current price of $36.16.Based on GuruFocus estimates, the estimated GF Value for Intel Corp in one year is $23.92, suggesting a downside of -33.85% from the current price of $36.16. gf value is gurufocus' estimate of the fair value that the stock should be traded at. it is calculated based on the historical multiples the stock has traded at previously, as well as past business growth and the future estimates of the business' performance. For deeper insights, visit the forecast page.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "16:08:00",
      "Source": "Zacks",
      "Title": "Company News for Dec 26, 2025",
      "URL": "https://finance.yahoo.com/news/company-news-dec-26-2025-080800912.html",
      "Content": "Company News for Dec 26, 2025\n\nZacks Equity Research\nFri, December 26, 2025 at 12:08 AM PST 1 min read\n\nIn this article: NVDA\n\nINTC\n\nNKE\n\nAAPL\n\nSNY\n\nShares of NVIDIA Corp. ( NVDA ) fell 0.3% following news that the company is planning to acquire assets from Groq, a designer of high-performance AI accelerator chips, for $20 billion in cash.\nNIKE Inc.&rsquo;s ( NKE ) shares surged 4.6% after Tim Cook, CEO of Apple Inc. ( AAPL ), bought $3 million of its shares.\nDynavax Technologies Corp.&rsquo;s ( DVAX ) shares soared 38.2% after Sanofi ( SNY ) decided to acquire it in a deal with a total equity value of roughly $2.2 billion.\nShares of Intel Corp. ( INTC ) fell 0.5% following news that NVIDIA has stopped testing manufacturing chips using Intel's 18A production process.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nSanofi (SNY) : Free Stock Analysis Report\nApple Inc. (AAPL) : Free Stock Analysis Report\nDynavax Technologies Corporation (DVAX) : Free Stock Analysis Report\nNIKE, Inc. (NKE) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "15:39:00",
      "Source": "Zacks",
      "Title": "Zacks Investment Ideas feature highlights Intel, Nvidia and Agnico Eagle Mines",
      "URL": "https://finance.yahoo.com/news/zacks-investment-ideas-feature-highlights-073900264.html",
      "Content": "Zacks Investment Ideas feature highlights Intel, Nvidia and Agnico Eagle Mines\n\nZacks Equity Research\nThu, December 25, 2025 at 11:39 PM PST 6 min read\n\nIn this article: INTC\n\nNVDA\n\nAEM\n\n^GSPC\n\nFor Immediate Release Chicago, IL &ndash; December 26, 2025 &ndash; Today, Zacks Investment Ideas feature highlights Intel INTC, Nvidia NVDA and Agnico Eagle Mines AEM.\nSanta Claus Rally Underway: Stocks to Watch The market&rsquo;s recent momentum continued heading into the Christmas holiday as the S&P 500 clinched a new all-time closing high.\nWe&rsquo;ve certainly seen a rotation lately into rate-sensitive areas like small-caps after the Fed cut interest rates in December for the third time this year. But large-caps are attempting to retake the lead, in line with what we&rsquo;ve seen throughout this phenomenal multi-year bull run off the October 2022 lows.\n\nIn any case, the calendar is on the side of the bulls as we remain in the most favorable 3-month stretch of the year that spans November through January. And from a seasonal perspective, the next week of trading tends to lean quite bullish.\nThe Santa Claus Rally &ldquo;If Santa should fail to call, bears may come to Broad and Wall.&rdquo; &ndash; Yale Hirsch\nWe saw a relatively sluggish start to the Christmas-themed month, with the S&P 500 falling nearly 2% through December 17 th . But the index has come roaring back over the past week and is now up roughly 1% as of Christmas Eve.\n\nThe days surrounding the Christmas holiday have historically been some of the most bullish times of the year. Dating back to 1988, the second day before Christmas (which fell on Tuesday this year) is the most bullish, with the S&P 500 rising more than 70% of the time over the past 37 years. That trend played out again yesterday.\nIt looks like the early December weakness is setting up well for a year-end rally. Today marks the final trading day before Christmas and is also the first day of a period known as the Santa Claus Rally.\nFirst discovered by Yale Hirsch (creator of the Stock Trader&rsquo;s Almanac), the Santa Claus Rally (SCR) is a seven-day period that consists of the final five trading days of the year, along with the first two trading days of the New Year. As markets are closed on Thursday for the Christmas holiday (as well as January 1 st for New Year&rsquo;s Day), today marks the first day of the SCR.\n\nSince 1950, these 7 glorious days tend to be overwhelmingly green, as the S&P 500 posts an average gain of 1.3% and is positive nearly 80% of the time. In fact, no other 7 days of the year are more likely to finish higher!\nIf these 7 days are higher, it typically bodes well for the full year. In fact, since 1950, when we have a positive return during this stretch, the S&P 500 gains an average of more than 10% the following year and is higher over 70% of the time.\n\n繼續閱讀\nYears where markets saw negative returns during the Santa Claus Rally period tended to precede bear markets or times when stocks could be bought at lower prices later in the year. For example, a negative SCR preceded relatively flat years like 1994, 2005 and 2015, as well as some of the worst years on record like 2008.\n\nAnd while we did see a negative return during the SCR period last year (and still registered solid gains in 2025), the early tariff tantrum provided investors the opportunity to purchase stocks on sale.\nStocks to Watch Chip giant Intel saw its stock fall roughly 2% in early trading on Wednesday, after a report suggested that Nvidia had halted a test to use Intel&rsquo;s production process to make advanced chips.\nNvidia had been in the testing phase of the so-called &ldquo;18A&rdquo; production process, which represented a potential return to manufacturing premium offerings in-house. While Intel touted the technology as a serious breakthrough, the halt raises concerns regarding the practicality of Intel&rsquo;s advanced manufacturing process.\n\nThe negative headline came just months after the two semiconductor companies announced a key collaboration back in September. Under the prior arrangement, Intel agreed to develop custom x86 CPUs for Nvidia&rsquo;s AI infrastructure platforms. In return, Nvidia pledged to invest $5 billion in Intel&rsquo;s common stock, which sent shares notably higher over the past few months. Intel is currently a Zacks Rank #3 (Hold) while Nvidia remains a Zacks Rank #2 (Buy).\nMeanwhile, gold prices back off slightly from their staggering ascent to all-time highs. Gold producer Agnico Eagle Mines is a leader in the space and has soared more than 130% year-to-date. The company engages in the exploration and production of precious metals including gold, silver, zinc, and copper. AEM stock remains a Zacks Rank #1 (Strong Buy) due to favorable earnings estimate revisions.\n\nConclusion Today marks the second day of the Santa Claus Rally. As we saw, this seven-day stretch is typically positive and has shown predictive power.\nPositive seasonality represents a major tailwind for stocks. Make sure to keep an eye on how markets perform over the SCR period. From all of us here at Zacks, we wish you happy holidays and a prosperous New Year.\n\nDisclosure: Nvidia is a current holding in the Zacks Headline Trader portfolio. Agnico Eagle Mines is a current holding in the Zacks Income Investor portfolio.\nFree: Instant Access to Zacks' Market-Crushing Strategies Since 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\nToday you can tap into those powerful strategies &ndash; and the high-potential stocks they uncover &ndash; free. No strings attached.\n\nGet all the details here >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nAgnico Eagle Mines Limited (AEM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\n條款 及 私隱政策\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "01:47:00",
      "Source": "TheStreet",
      "Title": "Veteran analyst has blunt message on Intel stock",
      "URL": "https://finance.yahoo.com/m/a67d7ab6-0aea-3869-8174-20f545a81294/veteran-analyst-has-blunt.html",
      "Content": "Veteran analyst has blunt message on Intel stock\n\nVuk Zdinjak\nThu, December 25, 2025 at 9:47 AM PST 4 min read\n\nIn this article: INTC\n\nNVDA\n\nIntel stock is trading approximately 0.52% lower at $36.16 as of the time of writing. The stock is down, due to a Reuters report stating that Nvidia has decided not to manufacture its chips using Intel’s 18A node (manufacturing process) after conducting some testing.\nIn response to this report, an Intel spokesperson told Reuters the company’s 18A node is “progressing well,” and that it “continues to see strong interest” for its next-gen node 14A.\n\nI have closely followed Intel’s moves this year, and wrote in late September about Intel engaging customers for its fabs: “Intel’s ability to attract customers depends on how the launch of its Panther Lake and Nova Lake CPUs goes.”\nGiven that both CPU lines are set to launch in 2026, at the time, I saw little chance that Nvidia would manufacture anything on Intel’s 18A node until its issues had been completely resolved. We’ll explore this in more detail later.\nVeteran analyst exiting long position in Intel Veteran analyst Stephen Guilfoyle has been long on Intel ( INTC ) for a few months.\nFollowing the news that Nvidia decided not to use Intel’s 18A node, he conducted his analysis, noting that since early August, Intel stock had developed a rising wedge pattern of bearish reversal .\nGuilfoyle offered more detail on TheStreet Pro .\n\nHe added that being long on Nvidia, AMD , Broadcom, and Intel leaves him somewhat overexposed to the space.\nWhat do other analysts think about INTC stock? According to MarketBeat , the consensus rating for Intel's stock is hold, with 20 analysts giving that rating, 6 giving a sell rating, and 5 giving a buy rating. The average target price is $38.09.\n“Importantly, we don’t expect a material improvement in the current unfavorable cost structure for Intel Foundry, given slow internal adoption of 18A node (peak capacity in 2030+) and foundry competition in the U.S.,” Bank of America analyst Vivek Arya wrote in his research note in October.\n\nHe also explained that Intel stock, trading at a 50 multiple price-to-earnings ratio estimate for calendar year 2027, is overvalued. Arya’s rating for INTC is underperform (sell equivalent), and a price target is $34, based on a 3 multiple of his enterprise value-to-sales ratio estimate for 2027, in line with the historical range of 1.7 to 4.\nWhy Nvidia chips on Intel’s 18A node weren’t going to happen Nvidia sells millions of GPU chips, and it needs a reliable manufacturing process. Even if Intel was going to cover the cost of the defective chips, that would mean the manufacturing would take much longer, depending on how bad the yield rate is.\n\nStory Continues\nIntel hasn’t disclosed yield rates for its 18A node, and its avoidance of the exact answer hints that they are not good.\n\"I would say the yields are adequate to address the supply, but they are not where we need them to be in order to drive the appropriate level of margins,” Intel CFO David Zinsner said during the Q3 earnings call .\n\nMore Tech Stocks:\nMorgan Stanley sets jaw-dropping Micron price target after event\nNvidia’s China chip problem isn’t what most investors think\nQuantum Computing makes $110 million move nobody saw coming\nMorgan Stanley drops eye-popping Broadcom price target\nApple analyst sets bold stock target for 2026\nJohn Pitzer, corporate vice president of corporate planning and investor relations at Intel, shared his thoughts at the 2025 RBC Capital Markets Global Technology, Internet, Media & Telecommunications Conference.\n“We have [said] in the past that the industry average yield improvement on a new ramp is about 7% per month, and we are now on that curve for Panther Lake, which is giving us some confidence as we launch the product this quarter,” Pitzer said, as reported by Tom’s Hardware .\n\nThe problem with Pitzer’s statement is that it isn’t clear what 7% represents. To illustrate this, let’s say that hypothetically, yields are 10% and they increase by 7% of that 10%, which gives us 10.7%. However, it could also mean that they get a 7% increase, in the sense that they go from 10% to 17%.\nHe said the dramatic increase started about seven or eight months ago, so if it were the latter case, it would mean the yields increased by approximately 56% from whatever the starting point was. If Intel’s yields hit more than 56% and are increasing by 7% per month, it wouldn’t need to keep avoiding the exact answer.\nIn addition to the yield problems, switching to a manufacturing process from another company is not a trivial task. Intel needs to have proof that the switch is worth it. The company was already focusing more on securing major contracts for its next-generation 14A node, due to the difficulties it had in attracting them to the 18A node, as reported by Reuters and Tom’s hardware in July.\nRelated: Bank of America resets Micron stock price target, rating\nThis story was originally published by TheStreet on Dec 25, 2025, where it first appeared in the Investing section. Add TheStreet as a Preferred Source by clicking here.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "19:35:27",
      "Source": "TipRanks",
      "Title": "Nvidia tested making chips with Intel’s 18A process, but stopped, Reuters says",
      "URL": "https://finance.yahoo.com/news/nvidia-tested-making-chips-intel-113527089.html",
      "Content": "Nvidia tested making chips with Intel’s 18A process, but stopped, Reuters says\n\nTipRanks\nThu, December 25, 2025 at 3:35 AM PST 1 min read\n\nIn this article: NVDA\n\nINTC\n\nWhile Intel ( INTC ) is picking up momentum on the deals front, its manufacturing unit has struggled to produce quality in-house chips, according to Reuters, which reports that Nvidia ( NVDA ) recently tested out whether it would manufacture its chips using Intel’s 18A production process, but stopped moving forward, citing two people familiar with the matter. Nvidia did not answer a request for comment, according to Reuters.\n\nClaim 70% Off TipRanks This Holiday Season Unlock hedge fund-level data and powerful investing tools for smarter, sharper decisions\nStay ahead of the market with the latest news and analysis and maximize your portfolio's potential\nPublished first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>>\nSee the top stocks recommended by analysts >>\nRead More on INTC:\nDisclaimer & Disclosure Report an Issue\nSerpent Lake Leak Reveals First Intel-Nvidia Chip after $5 Billion Partnership\nIntel Stock (NASDAQ:INTC) Slips Despite Power of Fab 52\nTrump administration delays tariffs on Chinese semiconductors, NY Times reports\nIntel vs. AMD: Which Chip Stock Has More Upside Heading into 2026, According to Analysts?\nOption traders moderately bearish in Intel with shares down 0.58%\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "19:03:13",
      "Source": "The Columbus Dispatch",
      "Title": "How a Silicon Valley dealmaker charmed Trump, giving Intel a lifeline",
      "URL": "https://finance.yahoo.com/m/26a2f875-52a2-39b8-a1d7-390d8c011929/how-a-silicon-valley.html",
      "Content": "How a Silicon Valley dealmaker charmed Trump, giving Intel a lifeline\n\nMax A. Cherney and Jeffrey Dastin, Reuters\nThu, December 25, 2025 at 3:03 AM PST 11 min read\n\nIn this article: INTC\n\nPLTR\n\nNVDA\n\nAMD\n\nOPAI.PVT\n\nSAN FRANCISCO (Reuters) - It was a Thursday before dawn in Silicon Valley when Intel CEO Lip-Bu Tan found himself under attack by the president of the United States.\n“The CEO of INTEL is highly CONFLICTED and must resign, immediately,” U.S. President Donald Trump wrote on his Truth Social platform at 4:39 a.m. Pacific Time on Aug. 7. Before he was Intel CEO, Tan had been a prolific investor in companies in China.\nTrump and Tan had not met. While technology leaders from Nvidia, AMD, OpenAI, Amazon, Google and Palantir had all recently traveled to see Trump, the head of America’s most storied chipmaker had not spent time with the president since joining Intel in March.\nPolitics was not Tan’s top priority. It had been more than 20 years since Tan, 66, had donated to a presidential election campaign. Though he spoke with a handful of U.S. government leaders, including Commerce Secretary Howard Lutnick in April, the Intel CEO did not fill the company’s top policy job in Washington for months after its prior holder, a Democrat, resigned.\n\nAlmost immediately after Trump’s attack, Intel scrambled to lock down time with the president, two people with knowledge of the situation said. That culminated in the most pivotal, roughly 40-minute meeting of Tan’s decades-long career.\nPreviously unreported details about Tan and Intel show how a man Trump had accused of supporting China’s interests came away from the meeting with a commitment from the U.S. government to invest billions of dollars for a nearly 10% stake in the company.\nThe deal gave Intel a too-strategic-to-fail aura and opened doors to potential partners who might want to win the president’s favor. It also may pave the way for the government to take more equity stakes in businesses the administration deems strategic, in what some investors previously described to Reuters as ushering in a new era of U.S. industrial policy.\n\nIntel’s share price has risen around 80% since Tan’s appointment, outpacing the percentage gains of the S&P 500 and Nvidia in that time.\nReuters spoke with around 20 people who are current and former Intel employees, government advisers, and Tan’s industry contacts. Some of them questioned whether Tan has the technical acumen to restore Intel’s lead in chip manufacturing and find a winning artificial intelligence strategy, even as his skills as a dealmaker served him well in the Oval Office and elsewhere.\nThe transition to Tan comes as Intel is in the middle of an announced $28 billion project to construct microchip production facilities in the Licking County portion of New Albany . While the factories were originally slated to begin operations this year, that has been delayed to 2030 at the earliest as Intel seeks buyers for the chips those factories are to produce .\n\nStory Continues\nThough Intel’s chips powered some of the first mass-produced PCs, years of dysfunction had allowed foreign competitors such as TSMC to eclipse Intel in high-end chip production.\nIn statements, an Intel spokesperson said Tan needed no persuading to engage with the Trump administration. Early on, he elevated government affairs, among other functions, to report to him. Intel announced in December that a Trump economic adviser would helm the unit.\n\n“Lip-Bu Tan has a long, and well-established history of engagement in Washington, both before and after joining Intel,” the spokesperson said. Intel declined to make Tan available for an interview.\nA White House spokesperson said President Trump was using his executive power to get “the best bargain for the American taxpayer” and safeguard U.S. security.\n“The Administration’s historic deal with Intel is one of many initiatives to reshore semiconductor and other critical manufacturing back to the United States,” the White House spokesperson said.\n40 minutes in the Oval Office Before heading into the White House, Tan called on his own allies who had forged relationships with the president, including Microsoft CEO Satya Nadella and Nvidia CEO Jensen Huang, to vouch for him, said two people familiar with the discussions.\nTan “spoke, as he does often, with confidantes who would have relevant insight and perspective ahead of his meeting with President Trump,” the Intel spokesperson said. Nvidia and Microsoft did not comment for this story.\n\nPrior to the meeting, Tan strategized with his advisors on how to convince Trump he was an American patriot by discussing his personal story and his commitment to the United States, the two people said. He also prepared to discuss his China holdings, the people said.\nTan has made some 600 investments in China, some linked to the country’s military, according to Reuters reporting. Those connections to China are what ultimately landed him in the crosshairs of the president. Two of Tan's investment firms - Walden International and Walden Catalyst - did not answer requests for comment. A third, Celesta Capital, said it had made one China investment that it exited in 2020.\nHis dealmaking acumen, Celesta Capital said, is a key reason Tan “is so well suited to lead Intel’s current moment.”\n\nJust two cabinet members joined the meeting between Trump and Tan in the Oval Office: Lutnick and Treasury Secretary Scott Bessent, one of the people said. Trump questioned the Intel CEO about how he planned to turn the company around, the person said.\nTan had already told Lutnick in a prior meeting that he did not want billions in handouts that the U.S. owed Intel as part of the CHIPS Act, the Commerce Secretary said in a video on X in August. Neither Lutnick nor Tan said why. The grant money had been offered to companies under the 2022 CHIPS Act in exchange for reviving domestic manufacturing so the U.S. could reduce its reliance on foreign semiconductor production.\nThe administration of former President Joe Biden had announced dozens of these awards to various chip-related companies, including coming to Intel's formal groundbreaking ceremony in Licking County in 2022 .\n\nSo when Trump proposed that the U.S. receive equity in exchange for giving Intel more CHIPS Act money - an idea that two sources said Lutnick had talked about for weeks with government staff - Tan struck a deal. Intel declined to comment on the specifics of the private conversation, but Lutnick later said in the video that equity made the exchange “fair.”\nThe deal gave Intel a $5.7 billion cash infusion and set up the U.S. government to be its largest shareholder. After the initial meeting, Tan pledged to “make Intel great again” in the video that Lutnick posted on social media, with the caption, “The Art of the Deal: Intel.”\nWithin weeks of his White House coup, Tan finalized a partnership with Nvidia, securing $5 billion from its CEO Huang who called Tan his “long-time friend.” Unlike Intel, known for manufacturing chips called central processing units, Nvidia designs the world’s top chips for AI.\n\nTrump celebrated the deal on social media, posting an AI-generated image of himself staring at a chart of Intel’s stock and showing how the value of the U.S. stake had risen by 50% after Nvidia’s investment.\nIntel's venture capitalist CEO Born in Malaysia to a Chinese-language journalist and a teacher, Tan started out in the hard sciences and had plans to become a nuclear engineer, but he ultimately went to business school and in or around 1983 got his first job in venture capital in California.\nDuring his career, Tan established himself as a man with a golden touch with startups that successfully were sold to other companies or went public. He amassed an estimated personal fortune well above $500 million.\n\nTan’s dealmaking savvy is helping Intel only to a point, three people with knowledge of the company said. For instance, Tan’s bid to buy SambaNova was the subject of internal debate given how the startup makes application-specific AI chips while the market favored general-purpose ones.\nAdditionally, these people said, chipmaking requires more engineering expertise than a typical tech business. Factories that make advanced chips rely on tools so precise they could pinpoint a U.S. quarter-dollar coin as far away as the moon. Some of its most successful executives, like Nvidia’s Huang, are electrical engineers by training.\nStill, some Wall Street analysts say Tan is an excellent choice for Intel CEO, with decades of chip-industry experience and a track record of delivering returns to shareholders.\n\n“Lip-Bu is deeply involved in technical decisions, including product roadmaps,” the Intel spokesperson said. “These are technical, hands-on changes that highlight the depth of his technical leadership.”\nTan was also “keenly aware” of Intel’s challenges when he took the CEO job, the Intel spokesperson said, because he had served on its board from 2022 until 2024.\nBut once inside Intel – which had around 100,000 staff when he joined - the complexity of the chip manufacturer was unlike anything Tan had faced as a CEO before, said two of the sources, who worked at Intel.\nThe company was bleeding cash to build factories for chip manufacturing, an effort begun under his predecessor Pat Gelsinger , and it needed an estimated $20 billion or more to have a shot at winning customers.\n\nTan called on top executives in his network and asked how they did things, one of the sources said. He likewise called on big customers – cloud providers like Amazon and Google – and asked what they wanted, said two people familiar with the matter.\nTan shook up Intel’s management team, similar to when he led the chip design company Cadence. There, he had worked with a deputy to draft a list of executives to fire, a person familiar with his Cadence days said. Cadence declined to comment.\nTan is cutting deeper still: laying off around 15% of Intel employees per securities filings, many of them managers.\nHe bypassed middle managers to have technical talent brief him directly, two of the people said. Tan named Intel engineering veteran Pushkar Ranade as his chief of staff and in December elevated him to interim chief technology officer.\n\nDespite the intensity of his task at Intel, Tan has split his time with his myriad other commitments, which include his investment firms. When evaluating potential deals for Intel’s venture arm, Tan would also ask his investment firms for their opinion, one of the former Intel employees said.\nAn alleged conflict of interest with his venture portfolio prompted Intel’s board to push back on Tan over an acquisition this year, Reuters reported this month.\nHis Intel employment requires that he spend “such time as is necessary” to perform his duties as CEO, a change from the prior Intel chief’s contract that had required “full business efforts and time to Intel.”\nCelesta Capital said Tan's time commitment to the firm is now minimal, and its team has received no request to review deals for Intel Capital. Walden International and Walden Catalyst did not answer requests for comment.\n\nIntel said Tan is working daily on transforming the company and “acted decisively” to flatten its structure, adding he is a “highly engaged CEO” who is “helping to restore speed, accountability, and create an engineering-centric, customer-focused culture.”\nA 'lifeline' for Intel So far, the U.S. investment has been a catalyst for Intel. Its Corporate Vice President John Pitzer said in a September interview that President Trump had just hosted top technology CEOs for dinner to discuss AI, and that their companies were potential Intel customers.\nThe deal was a “lifeline” for Intel, said technology lobbyist and Chamber of Progress CEO Adam Kovacevich. Without it, Intel could have been out a CEO if it had succumbed to Trump’s pressure, he said.\n\nThe same week as the White House deal, Intel announced a $2 billion investment from Masayoshi Son’s SoftBank, where Tan once was a board member.\nLutnick, who previously had no vested interest in phone calls to his office from business or government leaders about Intel’s manufacturing, now has an incentive to jump at them, said one of the sources, who is familiar with the administration. Lutnick has indicated that Americans have skin in the game for Intel to land a foundry deal that could bolster U.S. chip production, the person said.\nForeign chip manufacturers operating in the U.S. are concerned that government officials will tip the scales for customers to manufacture with Intel instead of with them, according to two sources familiar with these worries.\n\nA Commerce Department official said the U.S. stake gives Intel a shot at success but not a leg up, and Intel is not “too strategic to fail.” The official said further that Secretary Lutnick talks to all parties rather than prioritizing calls for Intel’s sake.\nWhile Intel is picking up steam on the deals front, its manufacturing unit has struggled to produce quality in-house chips.\nNvidia recently tested out whether it would manufacture its chips using Intel’s production process known as 18A but stopped moving forward, two people familiar with the matter said. Nvidia did not answer a request for comment.\nAn Intel spokesperson said the company’s 18A manufacturing technologies that make advanced chips are “progressing well,” and it “continues to see strong interest” for its next-generation production process, called 14A, which is expected to produce chips that are more powerful and efficient.\nNvidia made no commitment to manufacture with Intel in September when investing $5 billion in the chipmaker. “Right now we are focused on collaborations,” Tan told reporters while announcing the deal with Nvidia’s Huang.\n(Reporting by Max A. Cherney and Jeffrey Dastin in San Francisco; editing by Kenneth Li and Michael Learmonth)\nThis article originally appeared on The Columbus Dispatch: How Intel CEO Lip-Bu Tan charmed Trump to provide relief to chipmaker\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "16:09:29",
      "Source": "Insider Monkey",
      "Title": "BofA Sees Advanced Packaging Potential for Intel Foundry (INTC) Despite Manufacturing Headwinds",
      "URL": "https://finance.yahoo.com/news/bofa-sees-advanced-packaging-potential-080929412.html",
      "Content": "BofA Sees Advanced Packaging Potential for Intel Foundry (INTC) Despite Manufacturing Headwinds\n\nMaham Fatima\nThu, December 25, 2025 at 12:09 AM PST 2 min read\n\nIn this article: INTC\n\nBAC\n\nIntel Corporation (NASDAQ: INTC ) is one of the best high volume stocks to buy right now . On December 16, Bank of America raised the firm’s price target on Intel to $40 from $34, while keeping an Underperform rating on the shares. The firm highlighted a growing opportunity for Intel Foundry to secure external wins in advanced packaging and wafer design. However, BofA also noted that manufacturing uncertainties continue to weigh on the outlook, requiring a more cautious stance until production consistency improves.\n\nOn December 3, Intel announced its decision to retain its Networking and Communications unit/NEX following a comprehensive strategic review. This move marks a pivot from earlier considerations of divestiture intended to stabilize the company’s balance sheet. The decision was made possible by a considerably improved financial position, according to CFO Dave Zinsner, which follows a series of massive capital injections earlier in the year, including $8.9 billion in US government funding, $5 billion from Nvidia, and $2 billion from SoftBank.\nEarlier on November 18, Intel’s John Pitzer outlined the company’s roadmap for margin recovery and market share growth. While Intel faces supply constraints expected to peak in Q1 2026, it is prioritizing cost-efficiency to counteract currently depressed data center margins. A centerpiece of this strategy is the previously mentioned $5 billion partnership with Nvidia, where Intel will produce a custom Xeon processor for data centers that Nvidia will integrate and bring to market.\n\nIntel Corporation (NASDAQ:INTC) designs, develops, manufactures, markets, and sells computing and related products and services worldwide. It operates through Intel Products, Intel Foundry, and All Other segments.\nWhile we acknowledge the potential of INTC as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "02:48:33",
      "Source": "MT Newswires",
      "Title": "Dow, S&P 500 Close at New Highs in Holiday-Shortened Session",
      "URL": "https://finance.yahoo.com/news/dow-p-500-close-highs-184833899.html",
      "Content": "PREMIUM\nDow, S&P 500 Close at New Highs in Holiday-Shortened Session\n\nMT Newswires\nWed, December 24, 2025 at 10:48 AM PST 2 min read\n\nIn this article: ^GSPC\n\n^IXIC\n\nINTC\n\n^DJI\n\nAAPL\n\nThe Dow Jones Industrial Average and the S&P 500 ended the holiday-shortened Wednesday session at ne\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "02:34:35",
      "Source": "MT Newswires",
      "Title": "Consumer Staples, Real Estate Push US Equity Indexes Higher",
      "URL": "https://finance.yahoo.com/news/consumer-staples-real-estate-push-183435735.html",
      "Content": "PREMIUM\nConsumer Staples, Real Estate Push US Equity Indexes Higher\n\nMT Newswires\nWed, December 24, 2025 at 10:34 AM PST 2 min read\n\nIn this article: NKE\n\nNVDA\n\nEWTX\n\nINTC\n\nAAPL\n\nThe consumer staples and real estate sectors buoyed US equity indexes on Wednesday, supported by bet\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "02:05:42",
      "Source": "Yahoo Finance",
      "Title": "Stock market today: Dow, S&P 500 notch records, Nasdaq gains as Wall Street flies high into Christmas holiday",
      "URL": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-notch-records-nasdaq-gains-as-wall-street-flies-high-into-christmas-holiday-180542226.html",
      "Content": "LIVE\n\nStock market today: Dow, S&P 500 notch records, Nasdaq gains as Wall Street flies high into Christmas holiday\n\nBrett LoGiurato · Front Page Editor\nWed, December 24, 2025 at 10:05 AM PST 2 min read\n\nIn this article: ^DJI\n\nINTC\n\n^GSPC\n\n^IXIC\n\nGC=F\n\nUS stocks set more records on Wednesday, as Wall Street rode into the Christmas holiday on a high note.\nThe blue chip-focused Dow Jones Industrial Average ( ^DJI ) led the way up, gaining 0.6%, or nearly 300 points, to close at a fresh record high. Meanwhile, the S&P 500 ( ^GSPC ) picked up 0.3% to notch its second consecutive record close. The tech-heavy Nasdaq Composite ( ^IXIC ) gained a bit under 0.2%.\n\nMarkets closed early on Wednesday for Christmas Eve and are off Thursday for the holiday. Wall Street's bid for a \"Santa Claus\" rally is looking hopeful after the major indexes gained for the fifth consecutive day.\nWall Street's advance over the past several sessions has come despite new economic data that only served to dampen bets for rate cuts from the Federal Reserve in the near term. US GDP growth stood at 4.3% in the third quarter , according to a first estimate from the government, much higher than forecast as consumer spending held up over the summer.\n\nBut the GDP data led investors to trim bets on a January rate cut from the Fed — just more than 13% now expect that outcome. Most traders, however, still expect two rate cuts by the end of next year, as the divisions that defined the central bank this year are likely to persist even with a new chair set to replace Jerome Powell by mid-year.\nInvestors got one more sign of an economy that is nominally moving in the right direction as unemployment claims fell for the second week in a row, according to data released Wednesday — even as consumer confidence continues to falter .\nElsewhere, precious metals powered ahead on Wednesday, with gold ( GC=F ) rising to an all-time high above $4,500 an ounce before paring gains. Silver ( SI=F ) also advanced to a record, while platinum ( PL=F ) reversed, shedding more than 3%. Oil ( BZ=F , CL=F ) steadied after a run-up through the last few days.\nIntel ( INTC ) managed to pare losses to a drop of around 0.5% on the day after reports that Nvidia ( NVDA ) had halted a test using Intel's fabrication process for advanced chips.\n\nLIVE 15 updates\n25 mins ago Ines Ferré\n\nGold, silver, copper steady after touching record highs as metals outperform in 2025 Gold ( GC=F ) and silver ( SI=F ) are among this year’s biggest winners, with momentum driving prices to record highs and setting up their best year since 1979.\nGold traded above $4,500 per troy ounce on Wednesday before paring gains as it notched another milestone in a year packed with more than 50 record highs.\nSilver has had an even stronger year, soaring 150% on robust industrial demand and physical shortages. The metal topped $70 on Wednesday, while futures climbed past $72 an ounce.\nMeanwhile, copper ( HG=F ) also participated in the metals rally, reaching all-time highs on supply concerns before trimming gains.\n\n56 mins ago Jake Conley\n\nDiverging spending levels continue to drive a \"K-shaped\" US economy The US consumer landscape is firmly K-shaped, and the economy is likely to continue to hold that shape into 2026, according to economic strategists. As the economy has grown while consumer sentiment has soured, higher-income households have outspent and out-earned lower-income households by a widening margin.\nYahoo Finance's Brooke DiPalma reports:",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "01:47:45",
      "Source": "GuruFocus.com",
      "Title": "Leak Hints at First Intel Nvidia Chip After $5 Billion Partnership",
      "URL": "https://finance.yahoo.com/news/leak-hints-first-intel-nvidia-174745114.html",
      "Content": "Leak Hints at First Intel Nvidia Chip After $5 Billion Partnership\n\nMoz Farooque ACCA\nWed, December 24, 2025 at 9:47 AM PST 1 min read\n\nIn this article: INTC\n\nNVDA\n\nAMD\n\nTSM\n\nThis article first appeared on GuruFocus .\nIntel ( INTC , Financials ) and Nvidia ( NVDA , Financials ) may be preparing to ship their first jointly developed chip , according to leaked details about a laptop processor called Serpent Lake. The leak, shared by YouTube channel RedGamingTec, suggests the chip will combine Intel CPUs with Nvidia RTX graphics in a single design.\n\nWarning! GuruFocus has detected 5 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nSerpent Lake is expected to pair Intel's upcoming Titan Lake CPU architecture with Nvidia's RTX Rubin graphics, manufactured on TSMC's 3-nanometer process. The chip is reportedly aimed at competing with AMD's Strix Halo by delivering stronger graphics performance in high-end laptops.\nOne notable feature is memory bandwidth. The design is said to support up to 16 channels of LPDDR6 memory, a move intended to avoid bottlenecks that have limited graphics performance in competing processors.\nThe leak appears to offer the first real glimpse of what Intel and Nvidia's $5 billion partnership could produce. While Intel says it remains committed to its own Arc graphics roadmap, Serpent Lake points to deeper collaboration between the two companies, with a potential launch in late 2025 or early 2026.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "01:39:00",
      "Source": "Barrons.com",
      "Title": "These Stocks Are Moving the Most Today: Intel, Nike, UiPath, Tesla, Micron, Disney, Lam Research, AMC, Strategy, Dynavax, and More",
      "URL": "https://finance.yahoo.com/m/1257f9d8-67e5-375a-8187-2c1a9de613cd/these-stocks-are-moving-the.html",
      "Content": "These Stocks Are Moving the Most Today: Intel, Nike, UiPath, Tesla, Micron, Disney, Lam Research, AMC, Strategy, Dynavax, and More\n\nGeorge Glover\nWed, December 24, 2025 at 9:39 AM PST 3 min read\n\nIn this article: NKE\n\nVSNTV\n\nINTC\n\nNVDA\n\nPATH\n\nNike rises after Apple CEO Tim Cook snaps up shares, while Tesla stock drops amid door safety investigation.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "01:29:42",
      "Source": "Yahoo Finance Video",
      "Title": "Tesla faces probe, Intel slides on Nvidia reports, bitcoin falls",
      "URL": "https://finance.yahoo.com/video/tesla-faces-probe-intel-slides-172942248.html",
      "Content": "Tesla faces probe, Intel slides on Nvidia reports, bitcoin falls\n\nYahoo Finance Video and Josh Lipton\nWed, December 24, 2025 at 9:29 AM PST\n\nIn this video: BTC-USD\n\nTSLA\n\nINTC\n\nNVDA\n\nMarket Domination host Josh Lipton examines some of Wednesday's top trending tickers, including Intel ( INTC ), Tesla ( TSLA ), and bitcoin ( BTC-USD ). Watch the video above to hear more about the stories driving investor interest in the tickers.\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination .\n\nVideo Transcript\n\n00:00 Speaker A\nIntel is under pressure thanks to Nvidia reports saying that Nvidia is not moving ahead with plans to use Intel's chip production process. It's according to Reuters. Nvidia recently tested the so-called 18A process. This highlights a pain point for Intel amid its struggling manufacturing business. Nvidia, remember, earlier this year invested $5 billion in Intel, but did not commit to using its chip manufacturing services.\n00:36 Speaker A\nUp next, take a look at Tesla as the company faces a new investigation. The National Highway Traffic Safety Administration is launching a probe into the EV Maker's Model 3 compact sedans. This comes amid concerns that emergency door release controls may not be easily accessible or clearly identifiable. The focus of this investigation is on model year 2022 electric vehicles. The US auto safety regulator has also been looking into Tesla's advanced driver assistance system over alleged violations of traffic safety laws.\n01:17 Speaker A\nAnd lastly, let's check a check here on crypto. Bitcoin continues to slip missing out on the broader seasonal optimism. The world's largest cryptocurrency stalling here between 85,000 to 90,000 range. The slump in the digital asset follows a turbulent couple of months as crypto struggles to regain its footing after falling sharply from its record high back in early October.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "01:28:14",
      "Source": "Yahoo Finance Video",
      "Title": "S&P 493 likely to see 'outsized returns' in 2026, outside Mag 7",
      "URL": "https://finance.yahoo.com/video/p-493-likely-see-outsized-172814592.html",
      "Content": "S&P 493 likely to see 'outsized returns' in 2026, outside Mag 7\n\nYahoo Finance Video and Josh Lipton\nWed, December 24, 2025 at 9:28 AM PST\n\nIn this video: ^GSPC\n\nAMZN\n\nTSLA\n\nGOOG\n\nNVDA\n\nWhile the S&P 500 ( ^GSPC ) was largely driven by the Magnificent Seven tech stocks in 2025, how did the rest of the S&P 493 perform and what should Wall Street expect in 2026?\nRainwater Equity founder and portfolio manager Joseph Shaposhnik comes on Market Domination to discuss his outlook on the so-called Magnificent 493 and how AI has impacted their growth.\nThe US stock market will close early at 1:00 P.M. today (Christmas Eve) and will be closed all day Thursday for the Christmas holiday.\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination .\n\nVideo Transcript\n\n00:00 Speaker A\nLet's talk about what's ahead here. with the SPX, if you look under the hood, it sounds like Joseph, you know, you're you're bullish on the the 493 instead of just focusing on the on the mag 7. Let's start there, explain that. I mean, is that is that valuation, Joseph, is it is it earnings growth, positioning, explain it.\n00:27 Joseph\nI think that there have been a number of businesses in the magnificent 493 that are perceived as being uh hurt or uh compromised by the growth of AI. Valuations have gone significantly lower for a number of those companies and businesses that are just not participants in in uh the opportunity of AI have also not performed particularly well uh in that bucket of the magnificent 493. And I think in 2026, what we're going to find is that many of these companies are harnessing AI to get better, to lower their costs, to improve the velocity of introducing new products, um, and those businesses will begin to get the benefits of that uh as people recognize it. It hasn't happened uh in the last couple of years, but I think we're going to notice that in the next couple of years.\n01:29 Speaker A\nWell, what does that suggest Joseph about what do you think I do with the Mag 7 though in 2026? You know, am I avoiding those names? Am I trimming exposure? You know, do I have to be more discerning? Maybe next year, Joseph, it's more like, you know, the mag three or four.\n01:46 Joseph\nI think so. I think the Mag 7 it's tough to paint them with a broad brush because each one of them has a specific story associated with them. But I think just from a valuation perspective and the fact that they've performed so well for such a long period of time, I think that some of them will take a break, some of them will perform well, but really the opportunities for outsized returns next year are going to be outside of those seven businesses.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "01:18:26",
      "Source": "MT Newswires",
      "Title": "Sector Update: Tech Stocks Advance Wednesday Afternoon",
      "URL": "https://finance.yahoo.com/news/sector-tech-stocks-advance-wednesday-171826809.html",
      "Content": "PREMIUM\nSector Update: Tech Stocks Advance Wednesday Afternoon\n\nMT Newswires\nWed, December 24, 2025 at 9:18 AM PST 1 min read\n\nIn this article: OPAI.PVT\n\nINTC\n\nMSFT\n\nSNOW\n\nMOTV.PVT\n\nTech stocks were higher in Wednesday early afternoon trading, with the State Street Technology Selec\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "00:57:13",
      "Source": "24/7 Wall St.",
      "Title": "Uh-Oh! Did Nvidia Just Signal Problems with Intel’s Comeback?",
      "URL": "https://finance.yahoo.com/m/7543d356-0a38-3696-b5bf-15da91a3ccb7/uh-oh%21-did-nvidia-just-signal.html",
      "Content": "Uh-Oh! Did Nvidia Just Signal Problems with Intel’s Comeback?\n\nRich Duprey\nWed, December 24, 2025 at 8:57 AM PST 4 min read\n\nIn this article: INTC\n\nNVDA\n\nAVGO\n\nTSM\n\nQuick Read Intel ( INTC ) secured $8.9B from the U.S. government and $5B from Nvidia ( NVDA ) to revive its foundry business.\nNvidia halted testing of Intel’s 18A chip manufacturing process and stopped moving forward with production plans.\nIntel’s foundry turnaround depends on 18A attracting major customers beyond smaller deals with Microsoft and Amazon .\nIf you’re thinking about retiring or know someone who is, there are three quick questions causing many Americans to realize they can retire earlier than expected. take 5 minutes to learn more here\n\nIntel ( NASDAQ: INTC ) has experienced a dramatic shift in fortunes over the past year. Once viewed as a failing chipmaker losing ground to competitors like Broadcom ( NASDAQ: AVGO ), Taiwan Semiconductor Manufacturing ( NYSE: TSM ), and Nvidia ( NASDAQ: NVDA ), Intel faced speculation that rivals were circling its foundry business and other assets.\nBy the middle of the year, however, Intel regained momentum through significant backing from the Trump administration, which converted CHIPS Act grants into an equity stake worth approximately $8.9 billion, or 10% of the company, making the U.S. government its largest shareholder. This was followed by a $5 billion investment from Nvidia, giving it roughly a 4% stake, as well as partnerships aimed at joint product development in data centers and PCs.\n\nThese moves indicated renewed confidence, positioning Intel as a key player in U.S. semiconductor manufacturing once again. Yet, a Reuters report today suggests a big potential setback, raising questions about whether Intel's revival is beginning to falter.\nA Promising Rebound Built on Execution Intel's recent progress has been notable, driven by strategic investments and a focus on revitalizing its core businesses. The Trump administration's equity stake provided essential capital and aligned Intel with national priorities for domestic chip production.\nWeeks later, Nvidia's $5 billion commitment further supported Intel's turnaround, with the two firms agreeing to collaborate on custom x86 CPUs for Nvidia's AI platforms and integrated system-on-chips for PCs. An Intel spokesperson emphasized that 18A technologies are \"progressing well.\"\n\nDespite these positive developments, the rebound has always hinged on Intel's ability to execute, particularly in its foundry business. The 18A process node has been central to its plans for regaining manufacturing leadership, as it is intended to enable high-volume production of advanced chips and attract customers.\nNvidia's Decision Raises Questions About 18A According to the Reuters article, Nvidia recently evaluated whether to manufacture its next-generation chips using Intel's 18A process but halted the testing and stopped moving forward. Two sources familiar with the matter confirmed this to Reuters, though Nvidia declined to comment.\n\nStory Continues\nThis development comes despite Nvidia's earlier investment and ongoing product collaborations, which explicitly did not include commitments to use Intel's foundry. Intel has previously noted strong interest in 18A, and the company continues to highlight progress on the node, with products like Panther Lake and Clearwater Forest ramping up toward production.\n\nThe reasons for Nvidia's decision remain unclear, but earlier reports indicated both Nvidia and Broadcom conducted tests on 18A. While testing is a standard step, not all evaluations lead to production commitments.\nIf technical or yield issues contributed to the halt, it could signal challenges for Intel in convincing major designers to shift volume from established leaders like Taiwan Semiconductor. Intel's foundry has faced scrutiny over quality and scalability before, though the company maintains that 18A is on track and sees interest shifting to the subsequent 14A node for even more advanced applications.\nBroader Implications for Intel's Foundry Strategy Winning high-profile customers has been a key goal for Intel Foundry, which has invested heavily to compete as a contract manufacturer. Deals with Microsoft ( NASDAQ:MSFT ) and Amazon ( NASDAQ:AMZN ) for custom chips on 18A have been announced, and Apple ( NASDAQ:AAPL ) might go with Intel for its entry-level M-series chips in 2027, but volumes from such clients are relatively small compared to demands from AI leaders like Nvidia.\n\nNvidia halting the testing -- while not a definitive rejection -- underscores the high bar set for advanced nodes. Competitors continue to dominate high-end production, and Intel must demonstrate reliable yields and performance to secure larger commitments.\nKey Takeaway Investors should not read too much into Nvidia's decision to pause 18A testing at this stage, as qualification processes are lengthy and multifaceted. However, greater caution is warranted moving forward.\nMuch of Intel's turnaround depends on the success of the 18A process in delivering competitive manufacturing capabilities. If the node falls short of expectations in attracting major business from customers, it could complicate the company's path to foundry profitability and an overall recovery.\nThe New Report Shaking Up Retirement Plans You may think retirement is about picking the best stocks or ETFs, but you’d be wrong. Even great investments can be a liability in retirement. It’s a simple difference between accumulating vs distributing, and it makes all the difference.\nThe good news? After answering three quick questions many Americans are reworking their portfolios and finding they can retire earlier than expected. If you’re thinking about retiring or know someone who is, take 5 minutes to learn more here .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "00:51:09",
      "Source": "MT Newswires",
      "Title": "Top Midday Stories: Apple's Cook Buys $3 Million in Nike Stock; OpenAI Explores Ads in ChatGPT; Sanofi-Dynavax $2.2 Billion Deal",
      "URL": "https://finance.yahoo.com/news/top-midday-stories-apple-apos-165109264.html",
      "Content": "PREMIUM\nTop Midday Stories: Apple's Cook Buys $3 Million in Nike Stock; OpenAI Explores Ads in ChatGPT; Sanofi-Dynavax $2.2 Billion Deal\n\nMT Newswires\nWed, December 24, 2025 at 8:51 AM PST 2 min read\n\nIn this article: NKE\n\nAAPL\n\nOPAI.PVT\n\nSNY\n\nMSFT\n\nAll three major US stock indexes were edging higher in late-morning trading on Wednesday after initi\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "00:22:43",
      "Source": "Bloomberg",
      "Title": "Nvidia Stops Test Using Intel's Chip Production Process",
      "URL": "https://finance.yahoo.com/video/nvidia-stops-test-using-intels-162243099.html",
      "Content": "Nvidia Stops Test Using Intel's Chip Production Process\n\nBloomberg\nWed, December 24, 2025 at 8:22 AM PST\n\nIn this video: INTC\n\nNVDA\n\nIntel Corp. shares fell after a report said Nvidia stopped a test using Intel's production process to make advanced chips. The report from from Reuters. Norah Mulinda reports.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "23:53:00",
      "Source": "Barrons.com",
      "Title": "These Stocks Are Moving the Most Today: Intel, Nike, UiPath, Tesla, Micron, Disney, AMC, Strategy, Dynavax, and More",
      "URL": "https://finance.yahoo.com/m/1257f9d8-67e5-375a-8187-2c1a9de613cd/these-stocks-are-moving-the.html",
      "Content": "These Stocks Are Moving the Most Today: Intel, Nike, UiPath, Tesla, Micron, Disney, AMC, Strategy, Dynavax, and More\n\nGeorge Glover\nWed, December 24, 2025 at 7:53 AM PST 3 min read\n\nIn this article: NKE\n\nCOIN\n\nINTC\n\nNVDA\n\nPATH\n\nNike rises after Apple CEO Tim Cook snaps up shares, while Tesla stock drops amid door safety investigation.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "23:30:00",
      "Source": "Barrons.com",
      "Title": "Apple CEO Tim Cook Buys $3 Million of Nike Shares. The Stock Is Rising.",
      "URL": "https://finance.yahoo.com/m/aadcd4ba-7f53-3687-bd2c-28a96d0af124/apple-ceo-tim-cook-buys-%243.html",
      "Content": "Apple CEO Tim Cook Buys $3 Million of Nike Shares. The Stock Is Rising.\n\nAndrew Bary\nWed, December 24, 2025 at 7:30 AM PST 1 min read\n\nIn this article: NKE\n\nAAPL\n\nINTC\n\nApple CEO Tim Cook bought nearly $3 million worth of depressed Nike stock following the company’s disappointing earnings report last week. Cook, who is the lead independent director of Nike and a board member since 2005, bought 50,000 shares of Nike stock on Monday at an average price of $58.97, according to a form 4 filing with the Securities and Exchange Commission late Tuesday. Cook now holds just over 105,000 shares of the footwear maker, worth more than $6 million at Wednesday’s stock price.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "22:52:20",
      "Source": "GuruFocus.com",
      "Title": "Intel Lands $5.7B U.S. Investment Following CEO Tan's White House Meeting",
      "URL": "https://finance.yahoo.com/news/intel-lands-5-7b-u-145220630.html",
      "Content": "Intel Lands $5.7B U.S. Investment Following CEO Tan's White House Meeting\n\nFaizan Farooque\nWed, December 24, 2025 at 6:52 AM PST 1 min read\n\nIn this article: INTC\n\nNVDA\n\nSFTBF\n\nThis article first appeared on GuruFocus .\nIntel ( INTC , Financials ) got a much-needed boost when CEO Lip-Bu Tan met with President Donald Trump . The government agreed to invest $5.7 billion in the firm in return for a roughly 10% ownership. The transaction becomes the U.S. Intel's biggest shareholder and shows that Washington wants to boost chip manufacturing in the U.S.Tan's diplomacy eased tensions with the White House and opened the door for fresh private investments, such as $5 billion from Nvidia and $2 billion from SoftBank. Intel's stock price has gone up over 80% since Tan took over in March. The corporation is restructuring and focusing more on making chips.The deal shows that the government and business are working together more closely, with Intel at the core of America's attempts to get its semiconductor advantage back.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "22:50:17",
      "Source": "Yahoo Finance Video",
      "Title": "2 AI surprises for investors in 2025",
      "URL": "https://finance.yahoo.com/video/2-ai-surprises-investors-2025-145017842.html",
      "Content": "2 AI surprises for investors in 2025\n\nYahoo Finance Video and Brian Sozzi\nWed, December 24, 2025 at 6:50 AM PST\n\nIn this video: INTC\n\nAI dominated the markets (and conversations) in 2025. There were still a couple of things that Wall Street may not have been expecting when it came to AI giants. Great Hill Capital chairman and managing member Thomas Hayes and Edward Jones senior global investment strategist Angelo Kourkafas each share one AI surprise from 2025.\nTo watch more expert insights and analysis on the latest market action, check out more Morning Brief .\n\nVideo Transcript\n\n00:00 Speaker A\nThomas, what has surprised you this year on the AI trade?\n00:07 Speaker B\nWell, I I I'll tell you, Brian, it wasn't a surprise for us, but I think it was a dramatic surprise for the market and may still surprise some people when they hear it right now. The number one performing AI stock for 2025 was not Nvidia, it was Intel. Intel was up uh as of yesterday 81.4% year to date.\n00:46 Speaker A\nIntel's still around Thomas? They're still around? They they still do business?\n00:51 Speaker B\nThey still do business and the world all of the chip designers are dramatically dependent on them succeeding in developing advanced chips. And the US government is standing behind that because we don't want to be dependent exclusively on Taiwan semiconductor. So Intel was the number one chip and hyperscaler followed by AMD. So Intel was up 81%, AMD up 77%, Nvidia up 36%, not bad, but less than half of the returns of Intel. Uh Microsoft only 15%, Apple 8%, Amazon 4%. So, uh I think people were a little surprised that uh that the most popular names uh were more subdued than expected and I do think that theme is going to persist but but we'll get to that.\n01:46 Speaker A\nAngelo, hit me with a surprise. I think uh that Intel move, the fact that it is outperformed Nvidia certainly has surprised a lot of folks. What's uh what's been on your radar?\n01:57 Speaker C\nYeah, I think one thing that may surprise many of your viewers is that valuations for the tech sector are lower now than what they were at the start of the year. So basically what has happened is that earnings have been growing faster than prices. So that pushes back against all that AI bubble narrative because it is really earnings that have been doing the heavy lifting for the tech sector. And that I think is a comforting message. Yes, tech is the most expensive segment of the market, but it has been able to deliver earnings, solid earnings. And what has happened late in the year is probably a healthy pause, uh but the AI theme is likely to continue.\n02:51 Speaker A\nThese are the surprises I needed. Tom and Angelo, you have clearly brought your A game here on Christmas Eve. Tom, back to you. I think Angelo makes a very good point on on valuation. So, question to you, is AI are AI stocks still cheap then?\n03:10 Speaker B\nUh, I think that we have to be a little bit careful as we look into 2026. I think the theme is not going to be the AI stocks, it uh or the AI cost centers rather, when we think about hyperscalers and some of the chip names. The theme for 2026 and the biggest surprise is going to be AI beneficiaries. Those that are implementing the technology into their businesses to improve productivity, to improve margins and uh to to Angelo's point, uh earnings have grown, but if we look out three quarters, it's expected that the earnings growth rate of the magnificent 7 relative to the earnings growth of the un magnificent 493, we could say cost centers versus AI beneficiaries, is going to converge, meaning the unmagnificent 493's earnings growth rate will be equal to or greater than the magnificent 7 earnings growth rate by the third quarter of this year. and that's why I think we're going to see as we see in midterm election years, the indices a little bit more subdued, a little bit more choppy, a little bit more volatile because the biggest weights of the S&P 500 are probably going to take a uh breather or consolidate their gains uh as that earning growth decelerates. The other thing that we have to keep in mind here, Brian is that uh CapX as a percentage of uh operating cash flow now for the hyperscalers is uh exceeding levels of big oil. Greater than 60% of operating cash flow is now going to CAPEX and that's part of the reason that that growth rate is declining and I think we're going to see a lot of money made under the surface in individual stocks, the AI beneficiaries and maybe more subdued returns again from the AI cost centers, AKA hyperscalers and the stocks that most people are crowded into at the moment.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "22:49:24",
      "Source": "Investor's Business Daily",
      "Title": "Stock Market Today: Dow Edges Up After Surprise Jobless Claims; Nvidia Retakes Key Level (Live Coverage)",
      "URL": "https://finance.yahoo.com/m/98a926ac-4cdf-3973-a87b-fc34f476986d/stock-market-today%3A-dow-edges.html",
      "Content": "Stock Market Today: Dow Edges Up After Surprise Jobless Claims; Nvidia Retakes Key Level (Live Coverage)\n\nSCOTT LEHTONEN\nWed, December 24, 2025 at 6:49 AM PST 2 min read\n\nIn this article: NVDA\n\nNKE\n\nCOST\n\n^DJI\n\nBTC-USD\n\nStock Market Today: The Dow Jones index wavered Wednesday after a surprise drop in jobless claims. Nvidia stock cleared an entry Tuesday.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "22:42:07",
      "Source": "Investing.com",
      "Title": "TSX futures edge lower as liquidity thins ahead of Christmas break",
      "URL": "https://finance.yahoo.com/news/tsx-futures-edge-lower-liquidity-144207715.html",
      "Content": "TSX futures edge lower as liquidity thins ahead of Christmas break\n\nLuke Juricic\nWed, December 24, 2025 at 6:42 AM PST 3 min read\n\nIn this article: ^GSPTSE\n\nDX\n\nDX-PC\n\nINTC\n\nNVDA\n\nInvesting.com -- Canadian equity futures are drifting slightly lower on Wednesday morning as market participants head to the sidelines for a holiday-shortened session. The subtle retreat follows a historic milestone for the S&P/TSX Composite, which reached a record closing high on Tuesday, fueled by a meteoric rise in the metals and mining sectors.\n\nAs of 9:05 ET, S&P/TSX 60 Futures Index Standard Futures were down 2.4 points or 0.13%, mirroring a cautious tone in global markets. Trading volumes are expected to remain exceptionally thin today, as the Toronto Stock Exchange prepares to close early at 1:00 PM ET for Christmas Eve. Analysts warn that low liquidity could amplify price swings, though many investors appear content to lock in profits after a banner year for Canadian equities.\nRecord Territory: Tuesday Recap The benchmark S&P/TSX Composite Index finished Tuesday’s session up 58.63 points, or 0.18%, to settle at a new record of 32,058.73. The advance marked the fourth consecutive winning day for the index, which has now surged nearly 30% year-to-date.\nTuesday’s gains were driven almost exclusively by commodities:\n\nGold and Silver Miners: Outsized gains in the sub-indexes (up over 100% this year) continued as precious metals hit fresh peaks.\nEnergy: Resilience in crude prices provided a secondary floor for the index, even as domestic economic data surprised to the downside.\nThe bullish momentum successfully offset a disappointing report from Statistics Canada , which revealed that real GDP contracted 0.3% in October . The decline was wider than the 0.2% drop economists had anticipated, hampered by a 1.5% slump in manufacturing and a series of high-profile labor stoppages, including a nation-wide postal strike and teacher strikes in Alberta.\nGold Shatters $4,500 Barrier In a historic move on Wednesday, Gold Futures broke past the $4,500 per ounce resistance level. The yellow metal reached a peak of $4,554/oz in trade, extending a rally that has seen prices climb roughly 70% in 2025. Gold Futures now sit at $4,515.25/oz, a 0.2% gain.\nThe \"flight to safety\" is being propelled by a cocktail of geopolitical and macroeconomic factors:\n\nUS-Venezuela Tensions: Renewed friction between Washington and Caracas over oil shipments has heightened regional supply risks.\nFed Expectations: Despite robust US GDP data, investors remain firm in their belief that the Federal Reserve will pivot toward further rate cuts in 2026.\nCurrency Weakness: The US Dollar Index is hovering near 12-week lows, making dollar-denominated bullion more attractive to international buyers.\n\nStory Continues\nEnergy & Commodities Watch\nOil prices remained relatively stable on Wednesday morning. Brent Oil Futures edged up 0.14% to $62.46 per barrel, while Crude Oil WTI Futures gained 0.3% to trade at $58.55.\nSupply risks remain the primary catalyst, as the Trump administration intensifies enforcement actions against vessels linked to Venezuelan crude. While Venezuela accounts for a small fraction of global supply, the potential for wider maritime interdiction has re-introduced a significant risk premium into energy markets.\n\nTech Spotlight: Intel Slumps on Nvidia Snub In corporate news, Intel Corporation (NASDAQ:INTC) saw its shares tumble 3.3% in premarket trading. The move comes following reporting from Reuters saying that NVIDIA Corporation (NASDAQ:NVDA) has halted testing of Intel’s \"18A\" advanced manufacturing process.\nThe 18A node is considered the linchpin of Intel’s turnaround strategy to become a premier foundry for third-party chip designers. While an Intel spokesperson maintained that the technology is \"progressing well,\" the decision by Nvidia, the world’s most valuable chipmaker, to step away from testing dealt a heavy blow to investor sentiment.\n\nLooking Ahead U.S. markets are also expected to see light activity today, with the S&P 500 and Nasdaq 100 Futures trading near flat after their own record-setting sessions on Tuesday. The New York Stock Exchange will join the TSX in an early 1:00 PM ET close today, and both will remain shuttered on Thursday for Christmas Day.\nRelated articles\nTSX futures edge lower as liquidity thins ahead of Christmas break\n17 Undervalued Small-Cap Tech Stocks Primed to Outperform in Q4\nThe 5 Best Gold Mining Stocks to Buy Now\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "22:42:00",
      "Source": "Zacks",
      "Title": "The Zacks Analyst Blog Highlights NVIDIA, Advanced Micro Devices, Intel, Micron Technology and BigBear.ai",
      "URL": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-nvidia-144200337.html",
      "Content": "The Zacks Analyst Blog Highlights NVIDIA, Advanced Micro Devices, Intel, Micron Technology and BigBear.ai\n\nZacks Equity Research\nWed, December 24, 2025 at 6:42 AM PST 5 min read\n\nIn this article: NVDA\n\nAMD\n\nINTC\n\nBBAI\n\nMU\n\nFor Immediate Release Chicago, IL &ndash; December 24, 2025 &ndash; Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: NVIDIA Corp. NVDA, Advanced Micro Devices, Inc. AMD, Intel Corp. INTC, Micron Technology, Inc. MU and BigBear.ai Holdings, Inc. BBAI.\n\nHere are highlights from Tuesday&rsquo;s Analyst Blog:\nForget NVIDIA: 2 AI Stocks Crushing It in 2025 with More Upside Ahead Shares of the most sought-after tech stock on Wall Street, NVIDIA Corp. , have surged 36.6% this year amid the artificial intelligence (AI) boom. Ongoing demand for NVIDIA's CUDA software platform, along with its competitive advantage in the AI hardware market, fueled growth. Demand for NVIDIA's Blackwell chips remains strong, and the company plans to ship H200 AI chips to China ahead of the Lunar New Year holiday.\n\nHowever, escalating U.S.-China trade tensions remain a risk and could pose a meaningful threat to NVIDIA's future growth trajectory. NVIDIA also faces intensifying competition from rivals, including Advanced Micro Devices, Inc . and Intel Corp. , as data center capital expenditures continue to rise.\nTherefore, investors may look beyond NVIDIA at stocks that have outperformed it this year and still offer upside as the AI boom continues. Notable among them are Micron Technology, Inc . and BigBear.ai Holdings, Inc . whose shares have gained 228.8% and 43.6%, respectively, this year. Let's take a closer look at why these stocks are compelling buys.\nReasons to Be Bullish on Micron Strong demand for Micron's high-bandwidth memory (HBM) chips is expected to help the company deliver strong quarterly results. These chips have the inherent capacity to reduce power consumption and process large volumes of data. With AI infrastructure rapidly expanding, demand for HBM chips has accelerated.\n\nBanking on rising AI-led demand for HBM chips, Micron expects its revenues for the second quarter of fiscal 2026 to come in between $18.3 billion and $19.1 billion. The company reported revenues of $13.64 billion for the fiscal first quarter, up 56.8% year over year, according to investors.micron.com. Analysts had projected revenues of around $12.88 billion.\nMicron expects earnings per share (EPS) of $8.22 to $8.62 for the fiscal second quarter, with its cloud memory business unit expected to perform particularly well. Micron's expected earnings growth rate for the next year is a solid 23.5%.\n\nStory Continues\nReasons to Be Bullish on BigBear.ai BigBear.ai's shares were adversely impacted at the beginning of the year due to the Trump administration's move to curb federal spending. Reduced funding may have affected BigBear.ai's sales, but its top-line performance is expected to improve going forward, supported by the definitive $250 million agreement to acquire Ask Sage.\n\nAsk Sage is a fast-growing generative AI platform that has seen broad adoption, with users including the U.S. Space Force and the Defense Health Agency. It is designed for secure AI deployment in restricted fields such as defense and national security, according to ir.bigbear.ai. Ask Sage serves 100,000 users across 16,000 government teams, and with its acquisition, BigBear.ai expects full-year sales to reach $125 million to $140 million.\nMoreover, Trump's \"big, beautiful bill\" could drive future growth for BigBear.ai, while the company's robust cash position provides ample resources to support its expansion. The company reached a significant milestone toward profitability in the third quarter, and its expected earnings growth rate for the next year is a stellar 73.1%.\n\nWhile BigBear.ai has a Zacks Rank #2 (Buy), Micron sports a Zacks Rank #1 (Strong Buy). You can see the complete list of today's Zacks Rank #1 stocks here.\nWhy Haven't You Looked at Zacks' Top Stocks?\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss . This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nMicron Technology, Inc. (MU) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nBigBear.ai Holdings, Inc. (BBAI) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "22:34:54",
      "Source": "GuruFocus.com",
      "Title": "INTC: Intel Stock Falls After Nvidia Backs Out of 18A Chip Deal",
      "URL": "https://finance.yahoo.com/news/intc-intel-stock-falls-nvidia-140806180.html",
      "Content": "INTC: Intel Stock Falls After Nvidia Backs Out of 18A Chip Deal\n\nNauman Khan\nWed, December 24, 2025 at 6:34 AM PST 1 min read\n\nIn this article: NVDA\n\nINTC\n\nAVGO\n\nTSM\n\nThis article first appeared on GuruFocus .\nIntel ( NASDAQ:INTC ) stock slipped about 2% on early Wednesday after reports indicated that Nvidia ( NASDAQ:NVDA ) chose not to use Intel's 18A manufacturing process.\nThe two companies had tested the process earlier this year, but Nvidia reportedly decided against moving forward. Broadcom ( NASDAQ:AVGO ) also took part in similar trials.\n\nWarning! GuruFocus has detected 5 Warning Signs with INTC.\nIs INTC fairly valued? Test your thesis with our free DCF calculator.\nIntel's 18A technology is part of its effort to attract external chipmakers as customers, but early evaluations faced technical challenges, which may be affecting demand.\nShares of Nvidia remained mostly steady, suggesting minimal immediate impact on its production plans.\nThe company continues to rely heavily on Taiwan Semiconductor Manufacturing Company (TSM) for advanced chip fabrication.\nFor Intel, the decision underscores the competitive hurdles in winning high-profile foundry clients while trying to scale its advanced manufacturing capabilities.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "21:49:43",
      "Source": "MT Newswires",
      "Title": "Equity Futures Hold Steady Pre-Bell as US Initial Jobless Claims Beat Analyst Range",
      "URL": "https://finance.yahoo.com/news/equity-futures-hold-steady-pre-134943842.html",
      "Content": "PREMIUM\nEquity Futures Hold Steady Pre-Bell as US Initial Jobless Claims Beat Analyst Range\n\nMT Newswires\nWed, December 24, 2025 at 5:49 AM PST 1 min read\n\nIn this article: CL=F\n\n^GSPC\n\nTraders continued to maintain caution during the holiday season as US equity futures stayed in a hol\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "21:32:31",
      "Source": "MT Newswires",
      "Title": "Sector Update: Tech Stocks Mixed Pre-Bell Wednesday",
      "URL": "https://finance.yahoo.com/news/sector-tech-stocks-mixed-pre-133231289.html",
      "Content": "PREMIUM\nSector Update: Tech Stocks Mixed Pre-Bell Wednesday\n\nMT Newswires\nWed, December 24, 2025 at 5:32 AM PST 1 min read\n\nIn this article: ASTS\n\nNVDA\n\nINTC\n\nXLK\n\nPATH\n\nTechnology stocks were mixed pre-bell Wednesday, with the State Street Technology Select Sector SPDR\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "21:16:00",
      "Source": "Barrons.com",
      "Title": "These Stocks Are Moving the Most Today: Intel, Nike, UiPath, Tesla, AMC, Strategy, Dynavax, and More",
      "URL": "https://finance.yahoo.com/m/1257f9d8-67e5-375a-8187-2c1a9de613cd/these-stocks-are-moving-the.html",
      "Content": "These Stocks Are Moving the Most Today: Intel, Nike, UiPath, Tesla, AMC, Strategy, Dynavax, and More\n\nGeorge Glover\nWed, December 24, 2025 at 5:16 AM PST 2 min read\n\nIn this article: INTC\n\nCOIN\n\nNKE\n\nNVDA\n\nPATH\n\nStock futures were a touch lower on Wednesday, as investors waited to see if a Santa Claus rally would lift markets over the final few trading sessions of 2025. Intel fell 2.5% in premarket trading after Reuters reported that Nvidia had tested whether to manufacture chips using Intel’s production process but stopped moving forward with the plans. Nvidia and Intel didn’t immediately respond to Barron’s requests for comment.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "21:14:13",
      "Source": "Bloomberg",
      "Title": "Intel Shares Fall on Report Nvidia Halts Production Test",
      "URL": "https://finance.yahoo.com/news/intel-shares-fall-report-nvidia-131413697.html",
      "Content": "Intel Shares Fall on Report Nvidia Halts Production Test\n\nJake Rudnitsky\nWed, December 24, 2025 at 5:14 AM PST 2 min read\n\nIn this article: INTC\n\nNVDA\n\n(Bloomberg) -- Intel Corp. shares fell in premarket trading Wednesday after a report said that Nvidia Corp. halted a test to use Intel’s production process to make advanced chips.\nNvidia recently tested the so-called 18A process but stopped moving forward, Reuters reported, citing two unidentified people familiar with the matter.\n\nMost Read from Bloomberg\nNew York's Congestion Pricing Is Working. Five Charts Show How\nWith Mamdani, the Humble Bus Gets Its Due\nAs Zipcar Leaves London, Car-Share Boosters Are Looking for a New Ride\nWhen It Comes to US Transportation, 2025 Had Some Wins, Too\nSpokespeople for Nvidia and Intel didn’t immediately respond to requests for comment. An Intel spokesperson told Reuters that the company’s 18A manufacturing technologies are “progressing well.”\nIntel’s shares fell about 2.3% in early trading before markets opened in New York.\nIntel recently opened a new factory at its Ocotillo site in Arizona known as Fab 52 that’s the first to go into mass production with the 18A technique. The company says it’s the most cutting edge production technology developed and deployed in the US. Intel’s push to make advanced chips domestically is an attempt to challenge the global leader, Taiwan Semiconductor Manufacturing Co., and reassert American leadership in the industry.\n\nNvidia agreed to invest $5 billion into Intel in September, following the US government’s decision to take a roughly 10% stake in the company. The investment by the world’s most valuable company and a key designer of chips for the artificial intelligence boom was seen as a boost for Intel, which has struggled to stem losses and catch competitors that have surpassed it in recent years. However, the deal didn’t include a commitment for Intel to make Nvidia chips.\n18A is a bid to return to making Intel’s best offerings in-house. The technology contains two new features that Intel says are breakthroughs for the industry.\nThe first relates to transistors, the microscopic switches that give semiconductors their function. Modern chips cram tens of billions of transistors into a small area. In order to make chips more efficient and use less energy, the ability to switch these transistors on and off becomes critical.\n\nThe 18A products will be the first to have transistors made with so-called gate-all-around technology, a technique that allows finer control over this process, Intel said. That will allow for chips with more transistors — and the ability to handle growing amounts of data — that consume less power.\nThe second innovation pertains to how the chips are powered. The ultimate promise is that chips can have more transistors and be more efficient.\n\nStory Continues\n(Updates with more detail on 18A process.)\nMost Read from Bloomberg Businessweek\nPrivate Equity Is Ruining a Beloved Fly-Fishing Brand, Retailers Say\nTariffs Unravel India’s Dream of Challenging China in Toymaking\nChina’s EV Battery Giant Is Trying to Find a New Road\nThe United States of Klarna\nUniqlo Founder and Japan’s Richest Man Loves a $32 Pair of Slacks\n©2025 Bloomberg L.P.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "21:07:04",
      "Source": "MT Newswires",
      "Title": "Top Premarket Decliners",
      "URL": "https://finance.yahoo.com/news/top-premarket-decliners-130704599.html",
      "Content": "PREMIUM\nTop Premarket Decliners\n\nMT Newswires\nWed, December 24, 2025 at 5:07 AM PST\n\nIn this article: INTC\n\nLHAI\n\nNVDA\n\nMRNA\n\nLinkhome Holdings (LHAI) shares were down 11% in recent Wednesday premarket activity, extending Tues\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "20:39:49",
      "Source": "MT Newswires",
      "Title": "Market Chatter: Intel Shares Fall Premarket After Nvidia Reportedly Ends 18A Testing",
      "URL": "https://finance.yahoo.com/news/market-chatter-intel-shares-fall-123949107.html",
      "Content": "PREMIUM\nMarket Chatter: Intel Shares Fall Premarket After Nvidia Reportedly Ends 18A Testing\n\nMT Newswires\nWed, December 24, 2025 at 4:39 AM PST 1 min read\n\nIn this article: NVDA\n\nINTC\n\nIntel (INTC) shares were down almost 3% in premarket activity Wednesday after Reuters reported that\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "20:18:00",
      "Source": "Barrons.com",
      "Title": "Intel Stock Drops. Blame Nvidia.",
      "URL": "https://finance.yahoo.com/m/55f3a67f-ab89-3ac2-96a9-e86bd28f1318/intel-stock-drops.-blame.html",
      "Content": "Intel Stock Drops. Blame Nvidia.\n\nJack Denton\nWed, December 24, 2025 at 4:18 AM PST 1 min read\n\nIn this article: NVDA\n\n^GSPC\n\nINTC\n\nAVGO\n\nIntel stock was falling on Wednesday following a report that Nvidia had abandoned prospective plans to use the company’s chip production process. Shares of Intel retreated 3.5% in premarket trading ahead of a holiday-shortened Christmas Eve session. Nvidia stock was down 0.5%.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "20:09:06",
      "Source": "Investing.com",
      "Title": "Nike, UiPath gain in premarket; Intel falls",
      "URL": "https://finance.yahoo.com/news/nike-uipath-gain-premarket-intel-120906856.html",
      "Content": "Nike, UiPath gain in premarket; Intel falls\n\nSenad Karaahmetovic\nWed, December 24, 2025 at 4:09 AM PST 2 min read\n\nIn this article: PATH\n\nINTC\n\nNKE\n\nASTS\n\nSNY\n\nInvesting.com-- U.S. equity index futures edged lower ahead of the Christmas holiday, with S&P 500 Futures down 0.1% at 6:40 ET (11:40 GMT) in New York, putting the benchmark on track to pull back from a record high.\nUiPath (NYSE:PATH) shares jumped 8.3% in premarket trading on Wednesday after the company said it will be added to the S&P MidCap 400 index. The automation software firm will take the place of Synovus Financial, with the change scheduled to become effective before the opening bell on Friday, January 2.\nAst Spacemobile (NASDAQ:ASTS) rises 2.3% after the company successfully launched its largest-ever satellite from India. The launch marks the first in a planned series of deployments aimed at expanding space-based mobile connectivity, a key step as AST SpaceMobile seeks to compete more directly with Elon Musk’s SpaceX in satellite-to-phone services.\nDynavax Technologies (NASDAQ:DVAX) surges 37% following news that Sanofi SA (EPA:SASY) plans to launch a cash tender offer to acquire all outstanding shares of the company. Sanofi said it will offer $15.50 per share in cash, valuing Dynavax’s equity at roughly $2.2 billion and triggering a sharp repricing of the stock toward the bid level.\nNike (NYSE:NKE) gains 2.3% after a regulatory filing revealed that Apple Chief Executive Tim Cook purchased about $2.95 million worth of Nike shares on December 22. The disclosure drew investor attention given Cook’s high-profile role and long-standing ties to the sportswear company’s board.\nRamaco Resources (NASDAQ:METC) climbs 6.8% after the coal producer announced a share repurchase program of up to $100 million. The buyback will target shares of its Class A common stock and signals confidence from management in the company’s cash generation and balance sheet.\nIntel (NASDAQ:INTC) slips 2.7% after Reuters reported that Nvidia recently tested Intel’s advanced 18A chip manufacturing process but ultimately did not move forward. The report weighed on sentiment around Intel’s foundry ambitions and its efforts to attract major third-party chip customers.\nRelated articles\nNike, UiPath gain in premarket; Intel falls\nSilver's Bullish Pattern Points Higher — Keep an Eye on $52 Resistance Zone\n10 Beaten-Down Large-Cap Tech Stocks Offering Solid Upside Potential\n\nAGB und Datenschutzerklärung\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "20:00:53",
      "Source": "Investing.com",
      "Title": "Intel shares slide after report Nvidia halts testing of 18A process",
      "URL": "https://finance.yahoo.com/news/intel-shares-slide-report-nvidia-120053021.html",
      "Content": "Intel shares slide after report Nvidia halts testing of 18A process\n\nSenad Karaahmetovic\nWed, December 24, 2025 at 4:00 AM PST 1 min read\n\nIn this article: NVDA\n\nINTC\n\nInvesting.com -- Intel Corporation stock dropped 2.7% in premarket trading after Reuters reported that Nvidia stopped testing Intel’s 18A chip manufacturing process.\nAccordingly, Nvidia had been evaluating whether it could manufacture its chips using Intel’s advanced 18A production technology but decided not to move forward with the tests.\n\nAn Intel spokesperson told Reuters that the company’s 18A manufacturing technologies are \"progressing well,\" without providing further details about Nvidia’s decision to halt testing.\nThe news comes just months after the two semiconductor giants announced a major collaboration in September. Under that agreement, Intel would develop custom x86 CPUs for Nvidia’s AI infrastructure platforms, while also creating x86 system-on-chips integrating Nvidia RTX GPU chiplets for personal computing devices.\nAs part of the partnership, Nvidia had committed to investing $5 billion in Intel’s common stock at a purchase price of $23.28 per share, subject to regulatory approvals.\nThe reported testing halt raises questions about the technical viability of Intel’s advanced manufacturing process, which the company has positioned as crucial to its turnaround strategy and efforts to compete with Taiwan Semiconductor Manufacturing Company in the foundry business.\nRelated articles\nIntel shares slide after report Nvidia halts testing of 18A process\n10 Beaten-Down Large-Cap Tech Stocks Offering Solid Upside Potential\nNasdaq 100 Setup Turns Cautious as Insiders Sell and Technicals Flash Fatigue\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "19:05:28",
      "Source": "Reuters",
      "Title": "How a Silicon Valley dealmaker charmed Trump and gave Intel a lifeline",
      "URL": "https://finance.yahoo.com/news/silicon-valley-dealmaker-charmed-trump-110528784.html",
      "Content": "How a Silicon Valley dealmaker charmed Trump and gave Intel a lifeline\n\nMax A. Cherney and Jeffrey Dastin\nWed, December 24, 2025 at 3:05 AM PST 11 min read\n\nIn this article: INTC\n\nNVDA\n\nAMD\n\nOPAI.PVT\n\nAMZN\n\nBy Max A. Cherney and Jeffrey Dastin\nSAN FRANCISCO, Dec 24 (Reuters) - It was a Thursday before dawn in Silicon Valley when Intel ( INTC ) CEO Lip-Bu Tan found himself under attack by the president of the United States.\n“The CEO of INTEL is highly CONFLICTED and must resign, immediately,” U.S. President Donald Trump wrote on his Truth Social platform at 4:39 AM Pacific Time on August 7. Before he was Intel CEO, Tan had been a prolific investor in companies in China.\n\nTrump and Tan had not met. While technology leaders from Nvidia , AMD, OpenAI , Amazon, Google and Palantir had all recently traveled to see Trump, the head of America’s most storied chipmaker had not spent time with the president since joining Intel in March.\nPolitics was not Tan’s top priority. It had been more than 20 years since Tan, 66, had donated to a presidential election campaign. Though ​he spoke with a handful of U.S. government leaders, including Commerce Secretary Howard Lutnick in April, the Intel CEO did not fill the company’s top policy job in Washington for months after its prior holder, a Democrat, resigned.\n\nAlmost immediately after Trump’s attack, Intel scrambled to lock down time with the president, two people with knowledge of the situation said. That culminated in the most pivotal, roughly 40-minute meeting of Tan’s decades-long career.\nPreviously unreported details about Tan and Intel show ‌how a man Trump had accused of supporting China’s interests came away from the meeting with a commitment from the U.S. government to invest billions of dollars for a nearly 10% stake in the company.\n\nThe deal gave Intel a too-strategic-to-fail aura and opened doors to potential partners who might want to win the president’s favor. It also may pave the way for the government to take more equity stakes in businesses the administration deems strategic, in what some investors previously described to Reuters as ushering in a new era of U.S. industrial policy.\nIntel’s share price has risen around 80% since Tan’s appointment, outpacing the percentage gains of the ‌S&P 500 ( ^GSPC ) and Nvidia ( NVDA ) in that time.\nReuters spoke with around 20 people who are current and former Intel employees, government advisers, and Tan’s industry contacts. Some of them questioned whether Tan has the technical acumen to restore Intel’s lead in chip manufacturing and find a winning artificial intelligence strategy, even as his skills as a dealmaker served him well in the Oval Office and elsewhere.\nThough Intel’s chips powered some of the first mass-produced PCs, years of dysfunction had allowed foreign competitors such as TSMC to eclipse Intel in high-end chip production.\n\nStory continues\nIn statements, an Intel spokesperson said Tan needed no persuading to engage with the Trump administration. Early on, he elevated government affairs, among other functions, to report to him. Intel announced in December that a Trump economic adviser would helm the unit.\n“Lip-Bu Tan has a long, and well-established history of engagement in Washington, both before and after joining Intel,” the spokesperson said. Intel declined to make Tan available for an interview.\n\nA White House spokesperson said President Trump was using his executive power to get “the best bargain for the American taxpayer” and safeguard U.S. security.\n“The Administration’s historic deal with Intel is one of many initiatives to reshore semiconductor and other critical manufacturing back to the United States,” the White House spokesperson said.\n40 MINUTES IN THE OVAL OFFICE Before heading into the White House, Tan called on his own allies who had forged relationships with the president, including Microsoft ( MSFT ) CEO Satya Nadella and Nvidia CEO Jensen Huang, to vouch for him, said two people familiar with the discussions.\nTan “spoke, as he does often, with confidantes who would have relevant insight and perspective ahead of his meeting with President Trump,” the Intel spokesperson said. Nvidia and Microsoft did ⁠not comment for this story.\n\nPrior to the meeting, Tan strategized with his advisors on how to convince Trump he was an American patriot by discussing his personal story and his ‌commitment to the United States, the two people said. He also prepared to discuss his China holdings, the people said.\nTan has made some 600 investments in China, some linked to the country’s military, according to Reuters reporting. Those connections to China are what ultimately landed him in the crosshairs of the president. Two of Tan's investment firms — Walden International and Walden Catalyst — did not answer requests for comment. A third, Celesta Capital, said it had made one China investment that it exited in 2020.\nHis dealmaking acumen, Celesta Capital said, is a key reason Tan “is so well suited to lead Intel’s current moment.”\n\nJust two cabinet members joined the meeting between Trump and Tan in the Oval Office: Lutnick and Treasury Secretary Scott Bessent, one of the people said. Trump questioned the Intel CEO about how he planned to ‍turn the company around, the person said.\nTan had already told Lutnick in a prior meeting that he did not want billions in handouts that the U.S. owed Intel as part of the CHIPS Act, the Commerce Secretary said in a video on X in August. Neither Lutnick nor Tan said why. The grant money had been offered to companies under the 2022 CHIPS Act in exchange for reviving domestic manufacturing so the U.S. could reduce its reliance on foreign semiconductor production.\nThe administration of former President Joe Biden had announced dozens of these awards to various chip-related companies.\n\nSo when Trump proposed that the U.S. receive equity in exchange for giving Intel more CHIPS Act money - an idea that two sources said Lutnick had talked about for weeks with government staff - Tan struck a deal. Intel declined to comment on the specifics of the private conversation, but Lutnick later said in the video that equity made the exchange “fair.”\nThe deal gave Intel a $5.7 billion cash infusion and set up the U.S. government to be its largest shareholder. After the initial meeting, Tan pledged to “make Intel great again” in the video that Lutnick posted on social media, with the caption, “The Art ​of the Deal: Intel.”\nWithin weeks of his White House coup, Tan finalized a partnership with Nvidia, securing $5 billion from its CEO Huang who called Tan his “long-time friend.” Unlike Intel, known for manufacturing chips called central processing units, Nvidia designs the world’s top chips for AI.\n\nTrump celebrated the deal on social media, posting an AI-generated image of himself staring at a chart of Intel’s stock and showing how the value of the U.S. stake had risen by 50% after Nvidia’s investment.\nINTEL’S VENTURE CAPITALIST CEO Born in Malaysia ‌to a Chinese-language journalist and a teacher, Tan started out in the hard sciences and had plans to become a nuclear engineer, but he ultimately went to business school and in or around 1983 got his first job in venture capital in California.\nDuring his career, Tan established himself as a man with a golden touch with startups that successfully were sold to other companies or went public. He amassed an estimated personal fortune well above $500 million.\n\nTan’s dealmaking savvy is helping Intel only to a point, three people with knowledge of the company said. For instance, Tan’s bid to buy SambaNova was the subject of internal debate given how the startup makes application-specific AI chips while the market favored general-purpose ones.\nAdditionally, these people said, chipmaking requires more engineering expertise than a typical tech business. Factories that make advanced chips rely on tools so precise they could pinpoint a U.S. quarter-dollar coin as far away as the moon. Some of its most successful executives, like Nvidia’s Huang, are electrical engineers by training.\nStill, some Wall Street analysts say Tan is an excellent choice for Intel CEO, with decades of chip-industry experience and a track record of delivering returns to shareholders.\n\n“Lip-Bu is deeply involved in technical decisions, including product roadmaps,” the Intel spokesperson said. “These are technical, hands-on changes that highlight the depth of his technical leadership.”\nTan was also “keenly aware” of Intel’s challenges when he took the CEO job, the Intel spokesperson said, because he had served on its board from 2022 until 2024.\nBut once inside Intel – which had around 100,000 staff when he joined - the complexity of the chip manufacturer was unlike anything Tan had faced as a CEO before, said two of the sources, who worked at Intel.\nThe company was bleeding cash to build factories for chip manufacturing, an effort begun under his predecessor Pat Gelsinger, and it needed an estimated $20 billion or more to have a shot at winning customers.\n\nTan called on top executives in his network and asked how they did things, one of the sources said. He likewise called on big customers – cloud providers like Amazon and Google – and asked what they wanted, said two people familiar ⁠with the matter.\nTan shook up Intel’s management team, similar to when he led the chip design company Cadence. There, he had worked with a deputy to draft a list of executives to fire, a person familiar with his Cadence days said. Cadence declined to comment.\nTan is cutting deeper still: ​laying off around 15% of Intel employees per securities filings, many of them managers.\nHe bypassed middle managers to have technical talent brief him directly, two of the people said. Tan named Intel engineering veteran Pushkar Ranade as his chief of staff and in December elevated him to interim chief technology officer.\n\nDespite the ​intensity of his task at Intel, Tan has split his time with his myriad other commitments, which include his investment firms. When evaluating potential deals for Intel’s venture arm, Tan would also ask his investment firms for their opinion, one of the former Intel employees said.\nAn alleged conflict of interest with his venture portfolio prompted Intel’s board to push back on Tan over an acquisition this year, Reuters reported this month.\nHis Intel employment requires that he spend “such time as is necessary” to perform his duties as CEO, a change from the prior Intel chief’s contract that had required “full business efforts and time to Intel.”\nCelesta Capital said Tan's time commitment to the firm is now minimal, and its team has received no request to review deals for Intel Capital. Walden International and Walden Catalyst did not answer requests for comment.\n\nIntel said Tan ‍is working daily on transforming the company and “acted decisively” to flatten its structure, adding he is a “highly engaged CEO” who is “helping to restore ⁠speed, accountability, and create an engineering-centric, customer-focused culture.”\nA ‘LIFELINE’ FOR INTEL So far, the U.S. investment has been a catalyst for Intel. Its Corporate Vice President John Pitzer said in a September interview that President Trump had just hosted top technology CEOs for dinner to discuss AI, and that their companies were potential Intel customers.\nThe deal was a “lifeline” for Intel, said technology lobbyist and Chamber of Progress CEO Adam Kovacevich. Without it, Intel could have been out a CEO if it had succumbed to Trump’s pressure, he said.\n\nThe same week as the White House deal, Intel announced a $2 billion investment from Masayoshi Son’s SoftBank, where Tan once was a board member.\nLutnick, who previously had no vested interest in phone calls to his office from business or government leaders about Intel’s manufacturing, now has an incentive to jump at them, said one of the sources, who is familiar with the administration. Lutnick has indicated that Americans have skin in the game for Intel ⁠to land a foundry deal that could bolster U.S. chip production, the person said.\nForeign chip manufacturers operating in the U.S. are concerned that government officials will tip the scales for customers to manufacture with Intel instead of with them, according to two sources familiar with these worries.\n\nA Commerce Department official said the U.S. stake gives Intel a shot at success but not a leg up, and Intel is not “too strategic to fail.” The official said further that Secretary Lutnick talks to all parties rather than prioritizing calls for Intel’s sake.\nWhile Intel is picking up steam on the deals front, its manufacturing unit has struggled to produce ‌quality in-house chips.\nNvidia recently tested out whether it would manufacture its chips using Intel’s production process known as 18A but stopped moving forward, two people familiar with the matter said. Nvidia did not answer a request for comment.\n\nSign up for Yahoo Finance's Week in Tech\n\nBy subscribing, you are agreeing to Yahoo's\n\nTerms\n\nand\n\nPrivacy Policy\n\nSubscribe\nAn Intel spokesperson said the company’s 18A manufacturing technologies that make advanced chips are “progressing well,” and it “continues to see strong interest” for its next-generation production process, called 14A, which is expected to produce chips that are more ‌powerful and efficient.\nNvidia made no commitment to manufacture with Intel in September when investing $5 billion in the chipmaker. “Right now we are focused on collaborations,” Tan told reporters while announcing the deal with Nvidia’s Huang.\n(Reporting by Max A. Cherney and Jeffrey Dastin in San Francisco)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "18:56:24",
      "Source": "Barchart",
      "Title": "Stock Index Futures Muted in Thin Pre-Christmas Trade, U.S. Jobless Claims Data on Tap",
      "URL": "https://finance.yahoo.com/m/1e16e8cd-5295-3f00-9936-f4f0210746e8/stock-index-futures-muted-in.html",
      "Content": "Stock Index Futures Muted in Thin Pre-Christmas Trade, U.S. Jobless Claims Data on Tap\n\nOleksandr Pylypenko\nWed, December 24, 2025 at 2:56 AM PST 7 min read\n\nIn this article: ZIM\n\nINTC\n\nNOW\n\nNKE\n\nMRVL\n\nMarch S&P 500 E-Mini futures (ESH26) are down -0.03%, and March Nasdaq 100 E-Mini futures (NQH26) are down -0.01% this morning ahead of a holiday-shortened pre-Christmas trading session.\nThe U.S. stock markets will close early at 1 p.m. Eastern Time today and remain closed on Thursday in observance of the Christmas holiday.\n\nMore News from Barchart 2 Dividend Kings Quietly Beating the Market This Year\nApple Just Released a New AI Model. Should You Buy AAPL Stock Here?\nBroadcom (AVGO) Stock Options Are Signaling Pensiveness. Here’s Why the Fear Might Be Unwarranted.\nStop Missing Market Moves: Get the FREE Barchart Brief – your midday dose of stock movers, trending sectors, and actionable trade ideas, delivered right to your inbox. Sign Up Now!\n\nIn yesterday’s trading session, Wall Street’s major indexes ended in the green, with the S&P 500 notching a new record high. Most members of the Magnificent Seven stocks advanced, with Nvidia (NVDA) rising over +3% to lead gainers in the Dow and Amazon.com (AMZN) gaining more than +1%. Also, some chip stocks gained ground, with Marvell Technology (MRVL) climbing over +3% to lead gainers in the Nasdaq 100 and Broadcom (AVGO) rising more than +2%. In addition, ZIM Integrated Shipping Services (ZIM) climbed over +5% after the company said it had received multiple acquisition offers as part of its ongoing review of strategic alternatives. On the bearish side, ServiceNow (NOW) fell more than -1% after agreeing to acquire cybersecurity firm Armis for $7.75 billion in cash.\n\nThe U.S. Bureau of Economic Analysis, in its initial estimate of Q3 GDP growth, said on Tuesday that the economy grew at a +4.3% annualized rate, stronger than expectations of +3.3%. Also, U.S. November industrial production rose +0.2% m/m, stronger than expectations of +0.1% m/m. At the same time, U.S. durable goods orders fell -2.2% m/m in October, weaker than expectations of -1.5% m/m, and core durable goods orders, which exclude transportation, rose +0.2% m/m, weaker than expectations of +0.3% m/m. In addition, the U.S. Conference Board’s consumer confidence index fell to 89.1 in December, weaker than expectations of 91.7.\n“The strongest pace of economic growth in two years is bolstering confidence that corporate earnings will continue to expand robustly in 2026,” said Jose Torres at Interactive Brokers. At the same time, U.S. money markets continue to price in at least two Federal Reserve rate cuts in 2026.\nMeanwhile, the much-anticipated Santa Claus Rally period officially kicks off today. Since 1950, the S&P 500 has delivered an average return of 1.3%, posting gains 78% of the time, according to Adam Turnquist at LPL Financial.\n\nStory Continues\nToday, investors will focus on U.S. Initial Jobless Claims data, which is set to be released in a couple of hours. Economists estimate this figure will come in at 224K, the same as last week.\nU.S. rate futures have priced in an 86.7% chance of no rate change and a 13.3% chance of a 25 basis point rate cut at the January FOMC meeting.\n\nIn the bond market, the yield on the benchmark 10-year U.S. Treasury note is at 4.160%, down -0.22%.\nThe Euro Stoxx 50 Index is up +0.03% this morning, struggling for direction in quiet pre-holiday trading, with major markets like Germany shut and others, including London and Paris, set for early closures. Energy stocks advanced on Wednesday, as oil prices climbed for a sixth straight session. Luxury stocks also gained ground. Meanwhile, the regional Stoxx 600 index hit a new record high on Tuesday and is on track for its best annual performance since 2021, underpinned by lower interest rates, Germany’s fiscal spending push, and investor rotation away from expensive U.S. technology stocks. In other news, the Bank of Spain raised its economic growth forecast to 2.9% from 2.6% for this year and to 2.2% from 1.8% for 2026. In corporate news, BP Plc (BP-.LN) rose as much as +1.4% before paring gains after agreeing to sell a 65% stake in its Castrol unit to investment firm Stonepeak for about $8 billion.\n\nThe European economic data slate is empty on Wednesday.\nAsian stock markets today settled mixed. China’s Shanghai Composite Index (SHCOMP) closed up +0.53%, and Japan’s Nikkei 225 Stock Index (NIK) closed down -0.14%.\nChina’s Shanghai Composite Index closed higher today, extending its gains for a sixth consecutive session. The benchmark index notched its longest winning streak since July. Technology stocks gained ground on Wednesday. Global investors are ramping up bets on Chinese AI-related companies, wagering on the next DeepSeek and looking to diversify. Earlier this week, Moore Threads Technology, often referred to by analysts as “China’s Nvidia,” introduced a range of new products, including its next-generation chip architecture and AI chips. Meanwhile, the yuan extended its gains on Wednesday, moving closer to the key 7-per-dollar level after the People’s Bank of China set a firmer fixing. In other news, the Trump administration said on Tuesday it will impose tariffs on Chinese semiconductor imports over Beijing’s “unreasonable” push for chip industry dominance, but will delay the move until June 2027. Hong Kong’s market will be closed on Thursday and Friday for the Christmas holidays, while mainland China’s financial markets will remain open as usual.\n\nJapan’s Nikkei 225 Stock Index gave up earlier gains and closed slightly lower today, marking its first decline in four sessions. Japanese equities were pressured by a stronger yen. A stronger yen reduces the value of overseas sales for the country’s heavyweight exporters, with automakers among the notable underperformers on the day. The Japanese currency rose for a third day as traders stayed alert for signs of intervention following Tokyo’s warning against excessive moves. Financial stocks also slumped, paring some of the sharp gains that followed the Bank of Japan’s interest-rate hike last Friday. Limiting losses, some chip stocks climbed, tracking overnight gains in their U.S. peers. Data from the Cabinet Office released on Wednesday showed that Japan’s October leading economic indicators index, which gauges the economic outlook for a few months ahead based on data such as job offers and consumer sentiment, was revised slightly lower. Meanwhile, minutes from the Bank of Japan’s October meeting released on Wednesday showed that policymakers debated the need to keep raising interest rates toward levels seen as neutral for the economy. A few members of the nine-member board also said recent yen declines could risk an inflation overshoot by driving up import costs. In other news, a draft seen by Reuters showed that Japan plans to issue new government bonds worth about $189 billion to finance a record-sized budget for the next fiscal year. Investor focus is now squarely on a raft of Japan’s economic data, scheduled for release on Friday, including Tokyo core CPI, industrial production, retail sales, and employment figures. Investors also await BOJ Governor Kazuo Ueda’s speech on Thursday, as they seek guidance on the central bank’s policy path. The Nikkei Volatility Index, which takes into account the implied volatility of Nikkei 225 options, closed up +0.36% to 22.38.\n\nThe Japanese November Corporate Services Price Index rose +2.7% y/y, in line with expectations.\nThe Japanese October Leading Index came in at 109.8, weaker than expectations of 110.0.\nPre-Market U.S. Stock Movers\nDynavax (DVAX) jumped over +37% in pre-market trading after Sanofi agreed to buy the vaccine maker for about $2.2 billion.\nUiPath (PATH) climbed more than +8% in pre-market trading after S&P Dow Jones Indices announced that the software company would be added to the S&P MidCap 400 index on January 2nd.\nNike (NKE) rose over +2% in pre-market trading after a regulatory filing revealed that Apple CEO Tim Cook purchased 50,000 shares of the footwear maker on Monday.\nIntel (INTC) slid more than -2% in pre-market trading after Reuters reported that Nvidia has paused testing to manufacture on Intel’s 18A chipmaking node following initial tests.\n\nKB Home (KBH) fell about -0.8% in pre-market trading after Raymond James downgraded the stock to Market Perform from Outperform.\nYou can see more pre-market stock movers here\nToday’s U.S. Earnings Spotlight: Wednesday - December 24th\nNone.\nOn the date of publication, Oleksandr Pylypenko did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "10:12:01",
      "Source": "Simply Wall St.",
      "Title": "Has Intel’s 79.8% 2025 Surge Outrun Its Fundamentals?",
      "URL": "https://finance.yahoo.com/news/intel-79-8-2025-surge-021201736.html",
      "Content": "Has Intel’s 79.8% 2025 Surge Outrun Its Fundamentals?\n\nSimply Wall St\nTue, December 23, 2025 at 6:12 PM PST 5 min read\n\nIn this article: INTC\n\nIf you are wondering whether Intel is still a bargain after its huge run, or if the easy money has already been made, you are in the right place to unpack what the current share price really implies.\nDespite a choppy week with the stock down about 2.6%, Intel is still up roughly 5.4% over the last month and an impressive 79.8% year to date, reshaping how the market is pricing its turnaround story.\nThat surge has been fueled by renewed optimism in Intel's foundry ambitions, ongoing investments in advanced manufacturing, and growing interest in how it might benefit from AI infrastructure demand. At the same time, headlines around intensifying competition and execution risk are keeping some investors cautious, which helps explain the recent volatility.\nOn our checklist of six valuation tests, Intel currently scores a 3 out of 6 . This hints at some upside but also signals that value is not straightforward. Next, we will dig into different valuation approaches to see what the numbers say, and then finish with an even more useful way to think about Intel's true worth beyond the usual models.\n\nIntel delivered 78.2% returns over the last year. See how this stacks up to the rest of the Semiconductor industry.\nApproach 1: Intel Discounted Cash Flow (DCF) Analysis A Discounted Cash Flow, or DCF, model estimates what a company is worth by projecting its future cash flows and then discounting them back into today’s dollars. It is essentially a way to translate Intel’s long term cash generation into a single, present value number.\nIntel’s latest twelve month Free Cash Flow is about $13.7 billion in the red, highlighting the heavy investment phase the company is in. Analysts expect cash flows to recover over the next decade, with projections turning positive and reaching roughly $10.9 billion by 2035, based on a two stage Free Cash Flow to Equity model that blends analyst estimates for the early years with extrapolated growth thereafter.\n\nWhen all those future cash flows are discounted back, the model arrives at an intrinsic value of about $14.65 per share. Compared with the current market price, this implies the stock is roughly 148.2% overvalued, suggesting investors today are paying well above what the cash flow outlook supports.\nResult: OVERVALUED\nOur Discounted Cash Flow (DCF) analysis suggests Intel may be overvalued by 148.2%. Discover 908 undervalued stocks or create your own screener to find better value opportunities.\nHead to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for Intel.\n\nStory Continues\nApproach 2: Intel Price vs Sales For companies like Intel that are investing heavily and seeing earnings pressured, the price to sales ratio is often a cleaner way to compare value because it looks at what investors are paying for each dollar of revenue rather than current profits, which can be temporarily depressed.\nIn general, faster growth and lower risk justify a higher multiple, while slower growth, thinner margins, or higher uncertainty should pull a normal price to sales ratio down. Intel currently trades at about 3.24x sales, which is below the Semiconductor industry average of roughly 5.43x and well under the peer group average of around 13.19x. This suggests the market is still applying a discount to its turnaround story.\n\nSimply Wall St’s Fair Ratio for Intel is 5.31x, a proprietary estimate of what a balanced price to sales multiple should be given the company’s growth outlook, profitability profile, industry, market cap and specific risks. This is more informative than a simple peer or industry comparison because it adjusts for Intel’s own fundamentals rather than assuming it should look like the average chip stock. With the actual 3.24x sitting below the 5.31x Fair Ratio, the shares screen as undervalued on this metric.\nResult: UNDERVALUED\nPS ratios tell one story, but what if the real opportunity lies elsewhere? Discover 1457 companies where insiders are betting big on explosive growth .\nUpgrade Your Decision Making: Choose your Intel Narrative Earlier we mentioned that there is an even better way to understand valuation, so let us introduce you to Narratives, a simple way to attach your own story about Intel’s future to hard numbers like expected revenue, earnings, margins and fair value. A Narrative on Simply Wall St connects three pieces in one place: your view of the business, the financial forecast that follows from that view, and the resulting fair value that you can compare against today’s share price to decide whether Intel looks like a buy, hold or sell. Narratives are available on the Community page and used by millions of investors, so you can quickly explore different perspectives without needing to build your own spreadsheet models. They also automatically refresh when new information comes in, such as earnings results or major news. For Intel, one investor might see a high conviction AI and foundry turnaround with a fair value closer to $52 per share. Another might focus on execution and competitive risks and anchor on a fair value nearer $16, and Narratives help you decide which view fits your own expectations.\n\nFor Intel however, we will make it really easy for you with previews of two leading Intel Narratives:\n🐂 Intel Bull Case\nFair value estimate: $37.27 per share\nImplied undervaluation vs last close: approximately 2.5%\nLong term revenue growth assumption: 5.56%\nExpects operational restructuring and portfolio focus to lift agility, profitability, and long term margins.\nSees AI products and a stronger foundry offering as key drivers of higher revenue, market share, and customer trust.\nRecognizes execution, AI transition, and macro risks, but concludes that today’s price still underestimates Intel’s recovery potential.\n🐻 Intel Bear Case\nFair value estimate: $28.47 per share\nImplied overvaluation vs last close: approximately 27.6%\nLong term revenue growth assumption: 5.9%\n\nAcknowledges Intel’s scale in PC and server CPUs and its broad exposure to the AI semiconductor opportunity.\nWarns that past manufacturing missteps and the challenge of hitting an aggressive process roadmap could limit a successful turnaround.\nFlags intense competition from AMD in CPUs and Nvidia in AI accelerators as headwinds that could keep growth and returns below what the current share price implies.\nDo you think there's more to the story for Intel? Head over to our Community to see what others are saying!\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include INTC .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "04:05:00",
      "Source": "Zacks",
      "Title": "Forget NVDA: 2 AI Stocks Crushing it in 2025 With More Upside Ahead",
      "URL": "https://finance.yahoo.com/news/forget-nvda-2-ai-stocks-200500174.html",
      "Content": "Forget NVDA: 2 AI Stocks Crushing it in 2025 With More Upside Ahead\n\nTirthankar Chakraborty\nTue, December 23, 2025 at 12:05 PM PST 3 min read\n\nIn this article: NVDA\n\nAMD\n\nINTC\n\nMU\n\nBBAI\n\nShares of the most sought-after tech stock on Wall Street, NVIDIA Corporation NVDA, have surged 36.6% this year amid the artificial intelligence (AI) boom. Ongoing demand for NVIDIA’s CUDA software platform, along with its competitive advantage in the AI hardware market, fueled growth. Demand for NVIDIA’s Blackwell chips remains strong, and the company plans to ship H200 AI chips to China ahead of the Lunar New Year holiday.\n\nHowever, escalating U.S.-China trade tensions remain a risk and could pose a meaningful threat to NVIDIA’s future growth trajectory. NVIDIA also faces intensifying competition from rivals, including Advanced Micro Devices, Inc . AMD and Intel Corporation INTC, as data center capital expenditures continue to rise.\nTherefore, investors may look beyond NVIDIA at stocks that have outperformed it this year and still offer upside as the AI boom continues. Notable among them are Micron Technology, Inc . MU and BigBear.ai Holdings, Inc . BBAI, whose shares have gained 228.8% and 43.6%, respectively, this year. Let’s take a closer look at why these stocks are compelling buys.\n\nImage Source: Zacks Investment Research\nReasons to Be Bullish on Micron Strong demand for Micron’s high-bandwidth memory (HBM) chips is expected to help the company deliver strong quarterly results. These chips have the inherent capacity to reduce power consumption and process large volumes of data. With AI infrastructure rapidly expanding, demand for HBM chips has accelerated.\n\nBanking on rising AI-led demand for HBM chips, Micron expects its revenues for the second quarter of fiscal 2026 to come in between $18.3 billion and $19.1 billion. The company reported revenues of $13.64 billion for the fiscal first quarter, up 56.8% year over year, according to investors.micron.com. Analysts had projected revenues of around $12.88 billion.\nMicron expects earnings per share (EPS) of $8.22 to $8.62 for the fiscal second quarter, with its cloud memory business unit expected to perform particularly well. Micron’s expected earnings growth rate for the next year is a solid 23.5%.\nReasons to Be Bullish on BigBear.ai BigBear.ai’s shares were adversely impacted at the beginning of the year due to the Trump administration’s move to curb federal spending. Reduced funding may have affected BigBear.ai’s sales, but its top-line performance is expected to improve going forward, supported by the definitive $250 million agreement to acquire Ask Sage.\n\nAsk Sage is a fast-growing generative AI platform that has seen broad adoption, with users including the U.S. Space Force and the Defense Health Agency. It is designed for secure AI deployment in restricted fields such as defense and national security, according to ir.bigbear.ai. Ask Sage serves 100,000 users across 16,000 government teams, and with its acquisition, BigBear.ai expects full-year sales to reach $125 million to $140 million.\n\nStory Continues\nMoreover, Trump’s “big, beautiful bill” could drive future growth for BigBear.ai, while the company’s robust cash position provides ample resources to support its expansion. The company reached a significant milestone toward profitability in the third quarter, and its expected earnings growth rate for the next year is a stellar 73.1%.\n\nWhile BigBear.ai has a Zacks Rank #2 (Buy), Micron sports a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks Rank #1 stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nMicron Technology, Inc. (MU) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nBigBear.ai Holdings, Inc. (BBAI) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "04:00:00",
      "Source": "Zacks",
      "Title": "Quantum Enablers Poised for 40% Plus Growth in 2026: INTC, AVGO & TER",
      "URL": "https://finance.yahoo.com/news/quantum-enablers-poised-40-plus-200000520.html",
      "Content": "Quantum Enablers Poised for 40% Plus Growth in 2026: INTC, AVGO & TER\n\nUrmimala Biswas\nTue, December 23, 2025 at 12:00 PM PST 4 min read\n\nIn this article: QBTS\n\nLMT\n\nINTC\n\nAVGO\n\nIONQ\n\nThe pure quantum hardware sector, featuring companies like IonQ and D-Wave, has garnered significant attention. These firms have made tangible progress, securing government contracts, enterprise pilots and cloud integrations. Analysts characterize these pure plays as long-term prospects with growth potential but not guaranteed near-term earnings drivers for 2026.\n\nHowever, this does not mean that quantum offers no near-term investment opportunity. Instead, the more compelling path lies in quantum enablers - companies already generating revenues today by supplying the infrastructure, semiconductors, testing tools, cloud platforms and security frameworks required for quantum adoption at scale.\nSo, if the goal is to participate in quantum’s growth story with measurable financial outcomes in 2026, it makes sense to look beyond the flagship hardware makers and toward the ecosystem enabling quantum adoption today.\nHere in this article, we have discussed three such quantum computing enablers, Intel INTC, Broadcom AVGO and Teradyne TER, which are projected to report more than 40% earnings growth in 2026.\nThe Enabler Advantage: Real Revenues, Not Future Promises At present, several established semiconductor and enterprise technology companies are positioned to benefit from quantum development while being simultaneously projected to report solid earnings growth in 2026.\nAdvanced Micro Devices AMD, for example, is collaborating with IBM on hybrid high-performance computing and quantum workloads, leveraging its CPUs and accelerators within quantum-adjacent systems. The Zacks Consensus Estimate for AMD suggests roughly 58% earnings growth in 2026, driven primarily by data center demand rather than speculative quantum revenues.\n\nPost-Quantum Cryptography: Demand is Already Here Perhaps the most immediate quantum-linked opportunity lies in post-quantum cryptography. Governments and enterprises are racing to secure data against future quantum decryption risks, often referred to as “Q-Day.” Industry research and regulatory guidance increasingly emphasize early migration to quantum-resilient encryption standards.\n\nSEALSQ Corp. illustrates this trend. The company has commercialized secure chips with embedded post-quantum cryptography and expanded partnerships in defense and critical infrastructure, demonstrating real-world adoption rather than experimental pilots. The stock is projected to report 66.7% earnings growth in 2026.\nIn 2025, Lockheed Martin LMT advanced its role as a quantum enabler by moving quantum technologies closer to real defense applications, including a U.S. Department of Defense Innovation Unit contract to prototype a quantum-enabled inertial navigation system (QuINS) that can operate without GPS, in partnership with Q-CTRL and AOSense. The stock is projected to report 34.8% earnings growth in 2026.\n\nStory Continues\n2025 Stock Comparison of Quantum Enablers\nImage Source: Zacks Investment Research\n3 Quantum Computing Enablers With Strong Growth Potential Intel : Its positioning as a quantum enabler rests on continued progress in scaling qubit counts and improving device performance using its legacy CMOS manufacturing infrastructure. By applying its 300 mm fabrication techniques to silicon spin qubits, Intel expects to incrementally increase qubit connectivity and fidelity, essential steps toward larger, more uniform qubit arrays while refining control and interconnect technologies. Continued collaboration with research institutions in 2026 should further accelerate collective understanding of qubit behavior and materials interface challenges, helping Intel contribute to the broader quantum ecosystem even as commercial fault-tolerant systems remain on a multi-year horizon.\n\nIntel, a Zacks Rank #3 (Hold) stock, is expected to report earnings growth of 83.4% in 2026 on revenue growth of 3.3%. The stock has skyrocketed 81.4% in 2025.\nBroadcom : In 2025, Broadcom strengthened its position as a quantum enabler by embedding post-quantum cryptography (PQC) into enterprise networking and storage products, turning future quantum security risks into near-term demand. The company rolled out quantum-safe Fibre Channel and SAN solutions, including Emulex secure host bus adapters and Brocade Gen 8 Fibre Channel platforms, which integrate PQC and 256-bit encryption to protect data in motion across mission-critical infrastructure.\nIn 2026, Broadcom is positioned to benefit from rising demand for quantum-resilient infrastructure, driven by regulatory mandates such as CNSA 2.0, NIS2 and DORA and growing AI-led data center workloads, enabling quantum-linked growth without dependence on commercial quantum computers.\n\nBroadcom, a Zacks Rank #3 stock, is expected to report earnings growth of 42.5% in fiscal 2026 (ending October 2026) on revenue growth of 44.8%. The stock has gained 47.3% in 2025.\nTeradyne : In 2025, Teradyne strengthened its role as a quantum enabler by expanding its photonics and semiconductor test capabilities, highlighted by its acquisition of Quantifi Photonics, a specialist in photonic integrated circuit (PIC) testing.\nThe deal enhances Teradyne’s ability to deliver scalable PIC test solutions essential for optical interconnects used in high-performance and hybrid computing systems. Teradyne also introduced a high-volume, double-sided wafer probe test cell for silicon photonics with ficonTEC, supporting advanced electro-optical testing. These investments position Teradyne to benefit from rising demand for photonics, AI infrastructure, and high-performance computing test solutions, which underpin future quantum-adjacent ecosystems.\n\nTeradyne, a Zacks Rank #2 (Buy) stock, is expected to report earnings growth of nearly 45% in 2026 on revenue growth of 22%. The stock has gained 56.7% in 2025. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\nIntel Corporation (INTC) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nTeradyne, Inc. (TER) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "22:50:04",
      "Source": "Zacks",
      "Title": "Are You a Momentum Investor? This 1 Stock Could Be the Perfect Pick",
      "URL": "https://finance.yahoo.com/news/momentum-investor-1-stock-could-145004580.html",
      "Content": "Are You a Momentum Investor? This 1 Stock Could Be the Perfect Pick\n\nZacks Equity Research\nTue, December 23, 2025 at 6:50 AM PST\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "20:10:00",
      "Source": "GlobeNewswire",
      "Title": "Global AI Chips Market Analysis Report 2025-2035 Featuring Profiles of Key Players - Amazon, Gyrfalcon Technology, Huawei Technologies, Intel, Nvidia, NXP Semiconductors, Wave Computing and More",
      "URL": "https://finance.yahoo.com/news/global-ai-chips-market-analysis-121000895.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nGlobal AI Chips Market Analysis Report 2025-2035 Featuring Profiles of Key Players - Amazon, Gyrfalcon Technology, Huawei Technologies, Intel, Nvidia, NXP Semiconductors, Wave Computing and More\n\nResearch and Markets\nTue, December 23, 2025 at 4:10 AM PST 4 min read\n\nIn this article: AMZN\n\nINTC\n\nNVDA\n\nNXPI\n\nRapid growth in cloud processing and system-on-chip technology underline significant growth potential\nDublin, Dec. 23, 2025 (GLOBE NEWSWIRE) -- The \"AI Chip Market, Till 2035: Distribution by Type of Chip, Type of Processing, Type of Technology, Type of Function, Type of Application, Type of End-User, Type of Enterprise and Geographical Regions: Industry Trends and Global Forecasts\" has been added to ResearchAndMarkets.com's offering.\n\nThe global AI chip market is experiencing remarkable expansion, projected to soar from USD 31.6 billion in the current year to an impressive USD 846.8 billion by 2035. This equates to a CAGR of 34.84% during the forecast period.\nIn alignment with emerging market trends, 64% of companies believe AI will significantly boost productivity, underscoring its vital role in sectors like healthcare, finance, automotive, and telecommunications. The increasing demand for AI-driven efficiency and innovation is further accentuated by projections that suggest one in ten vehicles will be self-driving by 2030.\nThe AI chip market is pivotal in the global shift towards increased technological efficiency and digital transformation, with natural language processing and machine learning being instrumental in realizing its potential. Innovations from leading players, like NVIDIA's advanced GPUs and Intel's Gaudi processors, facilitate real-time decision-making.\n\nNoteworthy is Cerebras Systems' September 2024 release of its latest AI chip, the Cerebras Inference, touted as 20 times faster than NVIDIA's GPUs with over 4 trillion transistors on a single chip. Technological advancements and escalating investor interest are expected to sustain the healthy growth trajectory of the AI chip market throughout the forecast period.\nAI CHIP MARKET: KEY SEGMENTS\nType of Chip: Dominated by CPUs due to extensive use in data centers and edge devices. ASICs anticipated to grow faster.\nProcessing Type: Cloud processing leads with scalability and efficiency, but edge processing is set for faster growth.\nTechnology Type: System on Chip (SoC) leads due to integration capability, set for higher growth.\nFunction Type: Inference chips hold the majority, driven by AI-enhanced operations, with growth expected.\nApplication: Computer vision dominates, crucial for industry automation, poised for growth.\nEnd-Users: Healthcare leads, spurred by AI in patient data and diagnostics, with automotive rising rapidly.\nEnterprise Type: Large enterprises currently dominate, but SMEs are projected for higher growth.\nGeographical Regions: North America leads due to major tech firms and infrastructure, with Asia set for accelerated growth.\n\nStory Continues\nAI CHIP MARKET: RESEARCH COVERAGE\nMarket Sizing and Opportunity Analysis: Detailed exploration of key market segments including chip types and regions.\nCompetitive Landscape: Comprehensive company analysis based on size, structure, and location.\nCompany Profiles: Profiles of key players, highlighting missions, teams, and developments.\nMegatrends: Examination of ongoing industry trends.\nPatent Analysis: Insightful patent landscape examination.\nRecent Developments: Overview of significant market advancements.\nPorter's Five Forces Analysis: Analysis of competitive forces.\nSWOT Analysis: Strengths, weaknesses, opportunities, and threats assessment.\n\nKEY QUESTIONS ANSWERED IN THIS REPORT\nWhat is the current and future market size and CAGR?\nWhich type of AI chip will dominate?\nHow will market opportunities be distributed across segments?\nREASONS TO BUY THIS REPORT\nIn-depth market analysis with revenue projections.\nUnderstand competitive dynamics for strategic decisions.\nGain insights into market drivers, barriers, opportunities.\nKey Attributes\nReport Attribute\nDetails\nNo. of Pages\n192\nForecast Period\n2025-2035\nEstimated Market Value (USD) in 2025\n$31.6 Billion\nForecasted Market Value (USD) by 2035\n$846.8 Billion\nCompound Annual Growth Rate\n34.8%\nRegions Covered\nGlobal\n\nA selection of companies mentioned in this report includes, but is not limited to:\nAdvanced Micro Devices\nAmazon\nGeneral Vision\nGoogle\nGyrfalcon Technology\nHuawei Technologies\nIBM\nInfineon Technologies\nIntel\nKneron\nMicrosoft\nMYTHIC\nNvidia\nNXP Semiconductors\nQualcomm Incorporated\nSamsung Electronics\nToshiba\nWave Computing\n\nFor more information about this report visit https://www.researchandmarkets.com/r/saham9\nAbout ResearchAndMarkets.com\nResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends.\nCONTACT: CONTACT: ResearchAndMarkets.com Laura Wood,Senior Press Manager press@researchandmarkets.com For E.S.T Office Hours Call 1-917-300-0470 For U.S./ CAN Toll Free Call 1-800-526-8630 For GMT Office Hours Call +353-1-416-8900\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "08:05:00",
      "Source": "Motley Fool",
      "Title": "Could AMD Finally Close the Gap on Nvidia AI Dominance?",
      "URL": "https://finance.yahoo.com/m/49aa4e22-9212-362e-8592-9c8a0a932cb6/could-amd-finally-close-the.html",
      "Content": "Could AMD Finally Close the Gap on Nvidia AI Dominance?\n\nWill Healy, The Motley Fool\nMon, December 22, 2025 at 4:05 PM PST 4 min read\n\nIn this article: AMD\n\nNVDA\n\nINTC\n\nKey Points Nvidia controls an estimated 80% of the AI accelerator market.\nExisting infrastructure and software reinforce Nvidia's dominance.\nDespite competitive challenges, AMD has earned business from key clients.\n10 stocks we like better than Advanced Micro Devices ›\nThroughout its history, Advanced Micro Devices (NASDAQ: AMD) has developed a reputation for closing or at least reducing the competitive gap with rivals. This was true when it challenged Intel 's supremacy in prior decades and, more recently, its clashes with Nvidia (NASDAQ: NVDA) .\n\nThis includes its rivalry with Nvidia in the AI accelerator market, and its upcoming releases have captured the attention of industry analysts. The question for investors is whether it is on the verge of catching up to Nvidia and ending its dominance. The more likely outcome is that AMD will narrow but not close the gap, and here's why.\nThe state of the AI accelerator market Indeed, the semiconductor industry appeared caught off guard when it became clear that Nvidia's AI accelerators powered OpenAI's game-changing GPT-4 AI platform in 2023. Nvidia was so far ahead of rivals that even now, Nvidia holds an estimated 80% of this market, according to a Susquehanna analyst.\n\nMoreover, closing the gap hinges on more than just processing power. Nvidia has its CUDA software platform, which has an army of loyal developers. That makes switching away from that architecture difficult.\nAdditionally, Nvidia offers rack-scale solutions that integrate with both its accelerators and CUDA. That presents an additional challenge to prospective competitors.\nNvidia is also growing faster. In the first three quarters of fiscal 2026, Nvidia reported 62% revenue growth. Its data center segment, which designs the accelerators and constitutes 89% of Nvidia's revenue, increased revenue by 65% during the same period.\nAMD's overall growth is also impressive, but not as rapid in either respect. In the first nine months of 2025, AMD's revenue rose by 36% year over year. Also, its data center segment makes up 46% of overall revenue, and during the period, the segment's revenue rose by 29%, slower than the overall gain.\n\nAMD's efforts to strike back Nonetheless, as bleak as that sounds, AMD bulls should remember that that is only one quarter, and data center segment growth is likely to improve along with its technology.\nDespite lagging behind, AMD has made headway in this market. The company has built strategic partnerships with OpenAI and Meta Platforms , and its accelerators support clouds for Microsoft 's Azure and Oracle 's Oracle Cloud. Moreover, Dell , Hewlett Packard Enterprise , and others have built servers with AMD's technology.\n\nStory Continues\nLooking forward, investors have focused on AMD's upcoming MI450 accelerator. The company has also claimed that the MI450 will surpass the performance of Nvidia's upcoming Vera Rubin accelerator.\nAdditionally, AMD relies on open-source software and can work with other tech ecosystems. That could wear away at Nvidia's software-driven competitive advantage as the industry grows.\n\nFurthermore, Nvidia has struggled to keep up with demand, and AMD has traditionally sold its competing product at a lower cost. This gives companies all the more reason to consider AMD over Nvidia. Hence, if the MI450 can match or surpass the Vera Rubin, AMD could make significant competitive inroads.\nWill AMD close the gap with Nvidia? In the foreseeable future, investors should expect AMD to reduce but not completely close the competitive gap with Nvidia.\nIndeed, AMD has made significant efforts to catch up and has won business from several high-profile customers. If the MI450 matches or exceeds expectations, it could threaten AMD's dominance.\n\nUnfortunately for AMD, Nvidia is the established player in the AI accelerator market, and most companies are tied into its ecosystem. That means if AMD becomes the superior product, many of Nvidia's customers would likely be unable to switch to AMD without a tremendous disruption.\nUltimately, such conditions could be enough to stoke more rapid stock price increases for Advanced Micro Devices stock than Nvidia as the smaller company plays catch-up. However, investors should expect Nvidia to remain the leader in the AI accelerator industry for some time to come.\nShould you invest $1,000 in Advanced Micro Devices right now? Before you buy stock in Advanced Micro Devices, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Advanced Micro Devices wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,039 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,109,506 !*\nNow, it’s worth noting Stock Advisor’s total average return is 972 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nWill Healy has positions in Advanced Micro Devices. The Motley Fool has positions in and recommends Advanced Micro Devices, Intel, Meta Platforms, Microsoft, Nvidia, and Oracle. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nCould AMD Finally Close the Gap on Nvidia AI Dominance? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "02:05:10",
      "Source": "GuruFocus.com",
      "Title": "INTC: Intel Foundry Push and Nvidia Backing Could Drive 2026 Growth",
      "URL": "https://finance.yahoo.com/news/intc-intel-foundry-push-nvidia-180510667.html",
      "Content": "INTC: Intel Foundry Push and Nvidia Backing Could Drive 2026 Growth\n\nNauman Khan\nMon, December 22, 2025 at 10:05 AM PST 2 min read\n\nIn this article: INTC\n\nNVDA\n\nSFTBF\n\nAAPL\n\nQCOM\n\nThis article first appeared on GuruFocus .\nIntel ( NASDAQ:INTC ) is entering 2026 with renewed investor interest after a management change and several large cash infusions, but its turnaround still hinges on landing a major external foundry client.\nNew CEO Lip-Bu Tan has trimmed costs and leaned on industry ties to steady the company after years of setbacks that left its manufacturing arm behind rivals.\n\nWarning! GuruFocus has detected 5 Warning Signs with INTC.\nIs INTC fairly valued? Test your thesis with our free DCF calculator.\nA rare U.S. government stake, plus investments from Nvidia ( NASDAQ:NVDA ) and SoftBank ( SFTBY ), bolstered the balance sheet, but analysts say the foundry needs scale to be viable.\nIntel's progress with advanced nodes, including its roadmap for 14A, will be watched closely. Success could persuade customers like Apple or Qualcomm to shift some production, analysts said, but longstanding ties to Taiwan's TSM ( NYSE:TSM ) complicate the pitch.\nInvestors say the next 12 to 18 months are critical: without a marquee external contract, Intel may struggle to justify continued heavy manufacturing investment.\nMarket watchers caution returns could be gradual even if technical milestones are met and shareholders.\n\nIs INTC Stock a Buy? Based on the one year price targets offered by 36 analysts, the average target price for Intel Corp is $36.79 with a high estimate of $52.00 and a low estimate of $18.00. The average target implies a upside of +0.13% from the current price of $36.74.\nBased on GuruFocus estimates, the estimated GF Value for Intel Corp in one year is $23.92, suggesting a downside of -34.89% from the current price of $36.74. gf value is gurufocus' estimate of the fair value that the stock should be traded at. it is calculated based on the historical multiples the stock has traded at previously, as well as past business growth and the future estimates of the business' performance. For deeper insights, visit the forecast page.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "01:59:39",
      "Source": "GuruFocus.com",
      "Title": "Alibaba Weighs Major AMD AI Chip Order",
      "URL": "https://finance.yahoo.com/news/alibaba-weighs-major-amd-ai-175939198.html",
      "Content": "Alibaba Weighs Major AMD AI Chip Order\n\nFaizan Farooque\nMon, December 22, 2025 at 9:59 AM PST 1 min read\n\nIn this article: BABA\n\nBABAF\n\nAMD\n\nNVDA\n\nINTC\n\nThis article first appeared on GuruFocus .\nAlibaba Group ( BABA , Financials ) is considering placing a major order for Advanced Micro Devices Inc. ( AMD , Financials ) artificial intelligence chips, according to a report from MLex. Sources said the Chinese tech giant could purchase between 40,000 and 50,000 of AMD's MI308 AI accelerators.\n\nWarning! GuruFocus has detected 3 Warning Signs with BABA.\nIs BABA fairly valued? Test your thesis with our free DCF calculator.\nThe potential deal comes shortly after President Trump approved limited GPU sales to China, allowing firms such as Nvidia, Intel, and AMD to resume exports under new trade conditions.\nAMD CEO Lisa Su met with China's Commerce Minister Wang Wentao last week to discuss the company's operations and cooperation in the region, though no specifics were announced.\nThe report lifted AMD shares 3% in premarket trading, while Alibaba stock edged slightly higher. The move underscores renewed demand for U.S. chip technology as Chinese firms race to secure AI hardware ahead of 2026.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "23:59:51",
      "Source": "Insider Monkey",
      "Title": "Applied Materials (AMAT) Target Raised, but Mizuho Flags China and Intel Risks",
      "URL": "https://finance.yahoo.com/news/applied-materials-amat-target-raised-155951465.html",
      "Content": "Applied Materials (AMAT) Target Raised, but Mizuho Flags China and Intel Risks\n\nVardah Gill\nMon, December 22, 2025 at 7:59 AM PST 2 min read\n\nIn this article: AMAT\n\nINTC\n\nApplied Materials, Inc. (NASDAQ: AMAT ) is included among the 13 Top Tech Stocks Paying Consistent Dividends .\nPhoto by Dan Dennis on Unsplash\nOn December 17, Mizuho raised its price target on Applied Materials, Inc. (NASDAQ:AMAT) to $245 from $205, while keeping a Neutral rating on the stock. The firm sees more upside heading into 2026 as its outlook for wafer fab equipment spending improves. That stronger WFE backdrop is a positive for Applied Materials. Still, Mizuho pointed to a few pressure points. The firm remains cautious about the company’s loss of share in China and its exposure to Intel.\n\nApplied Materials, Inc. (NASDAQ:AMAT) echoed a more constructive tone in its fiscal Q3 2025 earnings update. Management said rising AI adoption continues to drive heavy investment in advanced semiconductors and wafer fab equipment. That demand helped deliver the company’s sixth straight year of fiscal growth. Executives also said the company is well-positioned at key technology inflection points, particularly in faster-growing segments of the market. Applied Materials is extending its leadership in leading-edge logic, DRAM, and advanced packaging, as next-generation technologies move toward volume production over the next few years.\nFrom a financial standpoint, Applied Materials, Inc. (NASDAQ:AMAT) generated nearly $8 billion in operating cash flow and $5.7 billion in free cash flow during the period. Capital spending totaled $2.3 billion, largely tied to the new EPIC Center. Applied Materials also returned $1.4 billion to shareholders through cash dividends.\n\nThe dividend story remains a steady one. The company has raised its dividend for eight consecutive years. Over the past decade through 2024, dividend per share growth has averaged around 15% annually, with close to 90% of free cash flow returned to shareholders.\nApplied Materials, Inc. (NASDAQ:AMAT) supplies the equipment, services, and software used by semiconductor and display manufacturers to produce chips and advanced display technologies.\nWhile we acknowledge the potential of AMAT as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 12 Best Long Term US Stocks to Buy Now and 12 Best Dogs of the Dow to Invest in .\nDisclosure: None.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "23:33:01",
      "Source": "GuruFocus.com",
      "Title": "AI Chips Are Driving a Foundry Boom. Why TSMC Is Winning the Most",
      "URL": "https://finance.yahoo.com/news/ai-chips-driving-foundry-boom-153301101.html",
      "Content": "AI Chips Are Driving a Foundry Boom. Why TSMC Is Winning the Most\n\nNauman Khan\nMon, December 22, 2025 at 7:33 AM PST 1 min read\n\nIn this article: TSM\n\nINTC\n\nNVDA\n\nAMD\n\nAVGO\n\nThis article first appeared on GuruFocus .\nGlobal semiconductor foundry revenue rose about 17% year over year to roughly $84.8 billion in the third quarter of 2025, supported by strong demand for artificial intelligence chips built on advanced manufacturing nodes, according to a research note from Counterpoint Research.\n\nTaiwan Semiconductor Manufacturing Company ( NYSE:TSM ) widened its lead, with market share edging up to about 72%. The gains followed higher output of its 3-nanometer process and solid utilization of 4- and 5-nanometer capacity, used heavily by AI accelerator customers such as Nvidia ( NASDAQ:NVDA ), Advanced Micro Devices ( NASDAQ:AMD ), and Broadcom ( NASDAQ:AVGO ).\nWarning! GuruFocus has detected 5 Warning Signs with INTC.\nIs INTC fairly valued? Test your thesis with our free DCF calculator.\nTSMC's foundry revenue grew more than 40% from a year earlier, outpacing the broader market. Counterpoint said most rival foundries posted slower growth, with non-TSMC players collectively expanding revenue by about 6%, reflecting softer orders after earlier tariff-related demand but some support from China's subsidy programs.\n\nLooking ahead, analysts said capacity limits at advanced nodes and constraints in advanced chip packaging, known as CoWoS, may cap sequential growth in the fourth quarter. Full-year 2025 foundry revenue growth is estimated at around 15%.\nCounterpoint expects the pure-play foundry segment to grow at a faster pace, helped by continued shipments of AI GPUs and custom AI chips. Texas Instruments ( NASDAQ:TXN ), Intel ( NASDAQ:INTC ), Infineon (IFNNY), and Samsung Electronics ( SSNLF ) maintained mid-single-digit market shares.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "22:40:14",
      "Source": "Investing.com",
      "Title": "BofA upgrades credit ratings of Intel and Micron",
      "URL": "https://finance.yahoo.com/news/bofa-upgrades-credit-ratings-intel-144014543.html",
      "Content": "BofA upgrades credit ratings of Intel and Micron\n\nVahid Karaahmetovic\nMon, December 22, 2025 at 6:40 AM PST 2 min read\n\nIn this article: INTC\n\nAVGO\n\nBAC\n\nMU\n\nInvesting.com -- Bank of America (BofA) upgraded credit ratings of Intel and Micron in its latest semiconductor update, pointing to improving balance sheets, strong AI-driven demand, and more attractive relative value across parts of the sector.\nFrom a broader sector perspective, BofA analyst Tom Curcuruto said he continues to favor capital-light exposure to AI, where companies can generate “material EBITDA and free cash flow (FCF) growth for the foreseeable future.\"\n\n\"Alternatively, as concerns about potential overheating in AI infrastructure spending (and/or repricing of the commensurate debt issuance to fund it), we look favorably on stable, non-AI revenue exposures,\" he added.\nAcross its semiconductor coverage, Curcuruto noted that near-term debt issuance needs remain limited, with most issuers either paying down debt or facing no major maturities in the near term.\nIntel was upgraded to Overweight from Marketweight on what Curcuruto described as improved stability, stronger liquidity and more compelling relative value. The analyst said Intel’s lower exposure to the AI demand cycle “could insulate it from broader AI investment overheating concerns,” even as market share pressures persist.\nHe flagged a marked improvement in credit metrics in the third quarter, supported by asset sale proceeds and equity investments, alongside a return to positive free cash flow for the first time since 2023.\n\nBofA raised its fiscal 2025 (FY25) and FY26 EBITDA estimates by 20% and 18%, respectively, and expects leverage to continue improving into 2026.\nMicron was also upgraded, to Marketweight from Underweight, as supply shortages and strong AI-driven demand extend the current memory upcycle.\nCurcuruto said robust pricing across HBM and traditional DRAM is driving a sharp improvement in free cash flow, noting that Micron estimates it can meet only “1/2 to 2/3 of demand from key customers.”\nWhile near-term fundamentals are strong, he warned that capital intensity and cyclicality present medium-term risks. Still, Micron’s recent results, higher forward guidance and debt repayments underpin expectations for significantly higher free cash flow in FY26, even after an increase in planned capital spending.\nBofA also reiterated an Overweight stance on Broadcom, citing continued AI-driven growth, disciplined capital allocation and ongoing deleveraging. In terms of relative value, Broadcom and Intel remain the most compelling names within the group, Curcuruto said.\nRelated articles\nBofA upgrades credit ratings of Intel and Micron\n17 Undervalued Small-Cap Tech Stocks Primed to Outperform in Q4\n3 Strategies to Make the Most of Dow's Record-Breaking Run\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "21:19:00",
      "Source": "Zacks",
      "Title": "Can Completion of Qualcomm's Alphawave Buyout Deal Propel Its Shares?",
      "URL": "https://finance.yahoo.com/news/completion-qualcomms-alphawave-buyout-deal-131900808.html",
      "Content": "Can Completion of Qualcomm's Alphawave Buyout Deal Propel Its Shares?\n\nSupriyo Bose\nMon, December 22, 2025 at 5:19 AM PST 3 min read\n\nIn this article: QCOM\n\nAWE.L\n\nQualcomm Incorporated QCOM has completed the acquisition of U.K.-based chip firm Alphawave Semi for an enterprise value of approximately $2.4 billion. The buyout offers Qualcomm an opportunity to expand its presence in high-growth applications, including data centers, artificial intelligence (AI), data networking and data storage.\n\nWith advanced technology solutions that are complementary to power-efficient CPU and NPU cores, Alphawave Semi delivers connectivity products and chiplets that drive faster, more reliable data transfer with higher performance and lower power consumption for 5G wireless, AI and data center applications. The acquisition, therefore, provides the firepower to enable Qualcomm to be the driving force of the next wave of AI innovation.\n\nOver the past few quarters, Qualcomm has aimed to expand its footprint in AI chips through focused R&D initiatives and strategic acquisitions. In April, the company acquired MovianAI, the former generative AI division of VinAI, a prominent Vietnam-based AI firm. The transaction provided Qualcomm access to VinAI’s comprehensive expertise in generative AI, machine learning, computer vision and natural language processing, significantly accelerating its fundamental AI research. The integration of VinAI’s portfolio with Qualcomm’s extensive R&D expertise facilitated the development of state-of-the-art AI-driven solutions for a wide range of industries, including smartphones, PCs, software-defined vehicles and more.\n\nOther Tech Firms Focusing on AI Chips Advanced Micro Devices, Inc. AMD has strengthened its position in the semiconductor market on the back of its evolution as an enterprise-focused company from a pure-bred consumer-PC chip provider. The latest MI300 series accelerator family strengthens its competitive position in the generative AI space. The accelerator from Advanced Micro is based on AMD CDNA 3 accelerator architecture. It supports up to 192 GB of HBM3 memory, enabling efficient running of large language model training (up to 80 billion parameters) and inference for generative AI workloads. Advanced Micro is also benefiting from strong enterprise adoption and expanded cloud deployments.\n\nIntel Corporation INTC has launched the Intel Core Ultra (Series 2) processors engineered to redefine mobile computing for a wide range of use cases, such as gaming, content creation, IT applications and various other businesses. This state-of-the-art lineup brings significant advancements in AI capabilities, improved performance and efficiency, setting new standards for AI computing. Intel has also introduced a new lineup of leading-edge processors to support AI workloads for edge devices. The Intel Core Ultra processors offer greater scalability, energy efficiency and impressive performance at the edge for a diverse range of use cases such as industrial IoT, autonomous vehicles and more.\n\nStory Continues\nQCOM’s Price Performance, Valuation and Estimates Qualcomm shares have gained 10.7% over the past year compared with the industry’s growth of 35.3%.\n\nImage Source: Zacks Investment Research\nGoing by the price/earnings ratio, the company's shares currently trade at 14.3 forward earnings, lower than 33.8 for the industry and the stock’s mean of 16.89.\n\nImage Source: Zacks Investment Research\nEarnings estimates for fiscal 2026 and fiscal 2027 have increased 2% to $12.15 per share and 3.4% to $12.60, respectively, over the past 60 days.\n\nImage Source: Zacks Investment Research\nQualcomm currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "00:52:00",
      "Source": "Motley Fool",
      "Title": "Want to Invest in Quantum Computing? 3 Stocks That Are Great Buys Right Now",
      "URL": "https://finance.yahoo.com/m/88141321-5ab4-3423-9d09-55ea9ccc809c/want-to-invest-in-quantum.html",
      "Content": "Want to Invest in Quantum Computing? 3 Stocks That Are Great Buys Right Now\n\nWill Healy, The Motley Fool\nSun, December 21, 2025 at 8:52 AM PST 5 min read\n\nIn this article: GOOG\n\nINTC\n\nIBM\n\nKey Points Google parent Alphabet is making waves with its new quantum computing processor.\nIntel's long-term comeback partially hinges on quantum computing.\nIBM's strength in supercomputing could help make it a leader in the quantum field.\n10 stocks we like better than Alphabet ›\nInvestors may struggle with what to make of quantum computing stocks . The technology increases the amount of computing power exponentially. Unfortunately, quantum computing is a highly error-prone technology, and in many respects, it is a solution without a problem.\n\nBoth tech giants and start-ups have undertaken efforts in this arena. Still, almost every start-up is a speculative, money-losing company with a nosebleed valuation. Knowing that, investors are probably wise to look at established companies building quantum computing segments.\nThese three companies below fit the bill. Let's have a closer look at them.\nAlphabet Admittedly, Google parent Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) has fostered a comeback recently based on artificial intelligence (AI). Thus, its investors seem focused on its latest Google Gemini update or the AI powering its autonomous vehicle segment, Waymo.\nHowever, investors should also not ignore its advancements in quantum computing. The company has built large-scale quantum computers focused on addressing error correction, a challenge that has plagued the quantum industry.\n\nTo that end, it incorporated what it calls a \"breakthrough algorithm\" on its Willow quantum processor that delivers quantum advantage. This applies the technology to problems in molecular science, materials science, and other areas.\nMoreover, investors can expect that quantum computing will play a more significant role in driving this company's revenue in the coming years. Alphabet holds $98 billion in liquidity and generated almost $74 billion in free cash flow over the last year. Hence, unlike the start-ups, investors know the Google parent holds the resources to compete in this field.\nFurthermore, even with Alphabet stock up by more than 60% over the last 12 months, its price-to-earnings (P/E) ratio of 30 is close to the S&P 500 average earnings multiple of 31, meaning investors can buy this stock at a reasonable price.\n\nIntel Intel (NASDAQ: INTC) is another tech giant that investors have written off, as its chip industry competitors beat it on innovation, leaving investors with questions as to whether it could stay relevant in today's tech market. Nonetheless, current CEO Lip-Bu Tan is reorienting Intel with an engineering-first culture, and one area of focus is quantum computing.\n\nStory Continues\nThe company recently introduced its Tunnel Falls quantum chip, which it has made available for research. Also, its Horse Ridge II cryogenic control chip has helped it overcome scalability issues, one challenge quantum computing technology faces.\nAlso, despite its struggles in recent years, Intel has attracted investor interest, including from the Trump administration, which invested in the company earlier this year. Additionally, its free cash flow turned positive in the third quarter of 2025, coming in at $896 million. That helps give Intel the financial stability it needs to advance its technology.\n\nIndeed, its recent return to profitability makes its P/E ratio a poor measure of its valuation. Still, its stock is up by more than 80% over the last year.\nFurthermore, a price-to-sales (P/S) ratio of 3 is below the S&P 500's 3.4 average and allows investors to buy into Intel's recovery at a reasonable price. As Intel's turnaround continues, now might be a good time to buy before more investors become aware of Intel's growing quantum capabilities.\nIBM In recent years, International Business Machines (NYSE: IBM) has become better known for its cloud computing capabilities. However, it has long led the way in supercomputing, and to that end, it developed its first quantum computer in 2019.\nThe advancements have continued since that time, and it has just released its IBM Quantum Nighthawk, a 120-qubit computer that can run circuits with more complexity while keeping a lid on error rates. Looking forward, its quantum advantage promises improvements over classical-only problem-solving methods, and by 2029, it plans to deliver a \"fault-tolerant\" computer that incorporates technology to more efficiently correct errors.\n\nInvestors should expect such advancements to continue amid the $14 billion in free cash flow it forecasts for 2025. About $6.3 billion of that will cover its dividend, which rises annually and returns 2.2% yearly. That frees the rest of its free cash flow to invest back into its business.\nAdditionally, the stock is up more than 30% over the last year amid its growing relevance in today's tech world. Also, as the pace of growth rises, its 37 P/E ratio has become more palatable, positioning IBM for continued gains, which are likely to be increasingly driven by quantum computing in the coming years.\nShould you buy stock in Alphabet right now? Before you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,039 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,109,506 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 972 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nWill Healy has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Intel, and International Business Machines. The Motley Fool has a disclosure policy .\nWant to Invest in Quantum Computing? 3 Stocks That Are Great Buys Right Now was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "00:10:00",
      "Source": "Motley Fool",
      "Title": "The 3 Deep Learning Stocks That Could Be Worth 50% More by 2027",
      "URL": "https://finance.yahoo.com/m/c8c45f02-e236-3d79-86e7-8c88288faa60/the-3-deep-learning-stocks.html",
      "Content": "The 3 Deep Learning Stocks That Could Be Worth 50% More by 2027\n\nBilly Duberstein, The Motley Fool\nSun, December 21, 2025 at 8:10 AM PST 7 min read\n\nIn this article: INTC\n\nGOOG\n\nMSFT\n\nOPAI.PVT\n\nKey Points Microsoft owns 27% of OpenAI, with massive Azure cloud contracts in the pipeline.\nAlphabet has come back to be a recognized leader in generative AI, with a big lead in autonomous vehicles.\nIntel has begun its turnaround, which should only accelerate in 2026.\n10 stocks we like better than Microsoft ›\n2025 is nearly over, and despite the strong year, many investors are biting their fingernails over the prospects for 2026. Will the artificial intelligence (AI) boom continue despite talks of a bubble and debt investors recently balking at funding large-scale data centers? Whom will President Donald Trump pick as the new Federal Reserve chair, and will the new nominee be independent?\n\nShort-term concerns always dominate headlines and investors' mindsets in the moment, but real long-term outperformance comes from taking a broader mindset and looking at the big picture.\nAssuming the AI buildout continues apace and AI usage increases over the next several years -- and there's no evidence AI adoption is slowing at all -- these three artificial intelligence stocks still look like they have upside. In fact, there's a case for 50% upside for each in 2026.\n1. Microsoft Microsoft (NASDAQ: MSFT) is up a solid 15% year to date in 2025 but has pulled back in recent months. Investors have grown nervous over OpenAI's technical moat and ability to fund massive spending commitments. That's important for Microsoft, which is both a 27% owner of OpenAI and a cloud provider for $250 billion of OpenAI cloud computing commitments -- a result of the 2025 negotiations by which OpenAI converted into a for-profit company.\n\nThat ownership and cloud pipeline would be highly bullish for Microsoft, but doubt has crept in regarding OpenAI's lead in generative AI in recent months. Rival Anthropic has shown significant enterprise growth, and Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) released its impressive Gemini 3 model in November.\nStill, the fear may be misplaced. It doesn't seem likely that the AI revolution would be dominated by a single model builder, but rather by a cohort of winners in an oligopoly. That's how both the semiconductor and cloud computing sectors have evolved. The AI large language model (LLM) market will likely follow a similar path.\nAfter all, Alphabet was regarded as a loser in the AI race as recently as this year, only to retake the lead. OpenAI is certainly not going away, and this week's investment in OpenAI by Amazon appears to indicate that at least some astute executives and investors still believe in the company.\n\nStory Continues\nMeanwhile, Morgan Stanley sell-side analyst Keith Weiss just upgraded Microsoft stock, giving it a $650 price target, good for 35% upside from the current price. His analysis and conversations with management indicated that Azure AI demand is stronger than initially thought and that Azure AI's gross margins can expand with scale as more revenue is generated over the next two years. Furthermore, Weiss noted that his estimates don't even contemplate the full OpenAI contract, which could lead to further upside.\n\n2026 should also see the introduction of Microsoft's next-generation AI chip, named Braga. According to reports this past summer, the chip was initially planned for 2025, but a redesign pushed back its introduction by six months. If Microsoft can develop an impressive in-house-designed chip, as Alphabet and Amazon have, that could lead to even more optimism.\n2. Alphabet Speaking of Alphabet, it would definitely be possible for both Microsoft and Alphabet to appreciate 50% in 2026. While Alphabet has had the best year of the \"Magnificent Seven\" stocks, up 62% on the year, Alphabet also entered the year as the cheapest of the bunch. In fact, despite this year's rise, it's still the second-cheapest of the bunch .\n\nComing into the year, investors were nervous that AI chatbots could disrupt Alphabet's Search business. However, that doesn't seem to be happening. Search paid clicks grew by 2%, 4%, and 7% in the first, second, and third quarters, respectively, showing a reacceleration after Alphabet introduced AI Mode into Search in May.\nWith the November release of Gemini 3, Alphabet has seemingly taken the lead for the moment in the AI race across several benchmarks. What's even better is that Gemini 3 was trained on Alphabet's homegrown Tensor Processing Units (TPUs). Following the Gemini release, other major companies are now looking to buy or lease TPUs from Alphabet or its cloud unit, Google Cloud.\n\nEven Alphabet rival Meta Platforms is reportedly considering using TPUs, according to late-November press reports. And just last Friday, Reuters reported a massive cloud deal worth over $10 billion between cybersecurity giant Palo Alto Networks and Google Cloud.\nThat all bodes very well for Google Cloud, which has been an incredibly underrated part of Alphabet's business. Google Cloud has now reached scale, with a $60 billion revenue run-rate and an almost $5 billion operating profit run-rate as of the last quarter. Growth accelerated by 34% for that business in Q3, accompanied by margin expansion.\nSo not only could the Cloud unit become a second major profit center beyond ad revenue, but 2026 could also bring exciting developments for Waymo. Waymo is now delivering over 1 million autonomous rides per month, with a significant lead over competitors in scaling. Next year could bring about more disclosure around Waymo's revenue or valuation, which could add yet another major business to Alphabet's expanding empire.\n\n3. Intel Intel (NASDAQ: INTC) has had an even better year than Alphabet or Microsoft, up 83.6% on the year thus far. Of course, Intel was trading at a practically distressed price heading into 2025, below its book value and without a CEO. And despite the 2025 surge, its market cap is still far, far lower than all the supposed AI winners of today.\n\nMeanwhile, 2026 is shaping up to be an exciting year. New CEO Lip-Bu Tan, who joined the company in March, will begin to make his presence felt more noticeably. The all-important 18A node -- the node at which Intel predicts it will either equal competitors or regain its technology leadership in the industry -- will begin to deliver product. 18A has just begun high-volume manufacturing this quarter, with the first 18A product, Panther Lake, set to enter the laptop market in January.\nSuccess on 18A in the form of better revenue and margins could yield external customer wins for future nodes 18AP and 14A. Already, technology pundits are reporting that major companies such as Apple , Nvidia, and even Intel rival Advanced Micro Devices are looking to potentially use the 14A node for their server central processing units (CPUs), according to analysts for China research firm GF Securities.\n\nIf an external customer were to commit to Intel's 14A node, which is expected to be released in 2027 or 2028, there could be confirmation of the customer win during 2026. After all, there has already been a flurry of positive reports on 14A technology and the adoption of Intel's EMIB packaging technology over the past month or so.\nIf investors come to believe that Intel has pulled even or ahead in terms of process technology, financial results improve with 18A manufacturing, and/or Intel announces a significant external 18AP or 14A customer win for its foundry, there is still considerable upside left in the stock.\nShould you invest $1,000 in Microsoft right now? Before you buy stock in Microsoft, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Microsoft wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,039 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,109,506 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 972 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nBilly Duberstein and/or his clients have positions in Alphabet, Amazon, Apple, Intel, Meta Platforms, and Microsoft. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Intel, Meta Platforms, and Microsoft. The Motley Fool recommends Palo Alto Networks and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nThe 3 Deep Learning Stocks That Could Be Worth 50% More by 2027 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-21",
      "Time": "22:00:04",
      "Source": "Yahoo Finance",
      "Title": "Intel stock soared in 2025. But the chipmaker still has a long road ahead.",
      "URL": "https://finance.yahoo.com/news/intel-stock-soared-in-2025-but-the-chipmaker-still-has-a-long-road-ahead-140004121.html",
      "Content": "Intel stock soared in 2025. But the chipmaker still has a long road ahead.\n\nLaura Bratton\nSun, December 21, 2025 at 6:00 AM PST 5 min read\n\nIn this article: INTC\n\nSFTBY\n\nTSM\n\nNVDA\n\nSFTBF\n\nFor Intel ( INTC ), 2025 was an eventful year, but not one that necessarily changed its narrative .\nThe storied American chipmaker got a new CEO and won massive investments from the US government , Nvidia ( NVDA ), and SoftBank ( SFTBY ). Those developments helped push the stock up 86% for the year, ahead of gains for the \"Magnificent Seven\" Big Tech stocks and Intel rival Advanced Micro Devices ( AMD ). At the same time, Intel's crucial manufacturing segment still lacks a major external customer — something it needs to make the cash-bleeding business viable.\n\n\"Intel's exiting the year with some optimism that they will be a relevant chip manufacturer in the US at some point in time ... and that was definitely an uncertain statement at the start of the year,\" MorningStar analyst Brian Colello told Yahoo Finance.\nAt the same time, he noted, \"There wasn't the massive sort of deal that really establishes Intel, either, in manufacturing.\"\n\nThe company's technology is largely responsible for the digital revolution and Silicon Valley's reputation as a global innovation hub: Intel invented the world's first microprocessors, or computer chips, and the x86 architecture, a critical blueprint for designing computer chips. Its co-founder Gordon Moore created Moore's Law, a theory that defined the pace of innovation in the semiconductor industry for more than half a century. The company has continued to make its own computer chips, even as the rest of the industry has gone \"fabless\" — outsourcing manufacturing to firms like Taiwan's TSMC ( TSM ).\n\nBut years of missteps and poor investment decisions put Intel's manufacturing segment behind TSMC, which in turn caused its products to lose their edge to competitors. As its chips — CPUs for servers, laptops, and desktops — have lost market share to rivals AMD and Arm ( ARM ), its manufacturing business has been stripped of the scale it needs to remain viable.\nFour years of an aggressive turnaround effort by former CEO Pat Gelsinger to revive Intel's manufacturing arm by opening it to outside customers sent investors fleeing. The massive amount of spending required to reboot the foundry, along with its uncertain success, spooked Wall Street.\nThe arrival of Lip-Bu Tan , who was named chief executive in March following the board's ousting of Gelsinger in late 2024, began to renew faith in the company's potential turnaround. While Intel's strategy remains mostly unchanged under Tan, analysts explained, investors have applauded his sober tone, cost-cutting measures, and wide-ranging industry connections.\n\nStory Continues\nThat tepid faith transformed into confidence when the US government made a rare $9 billion investment in the company — albeit funds Intel was supposed to get anyway from the Biden-era CHIPS Act — following Tan's tiff with President Trump over the CEO's business ties to China.\nOnshoring semiconductor manufacturing has been a focus of the US government since the pandemic highlighted the risk of a tech supply chain reliant on Taiwan. Escalating tensions with China, including the threat of a Taiwan invasion, have further intensified the sense of urgency.\n\n\"Semiconductors are not only economically important, they're actually important from a national security perspective,\" Technalysis analyst Bob O'Donnell told Yahoo Finance. \"Intel has by far the largest infrastructure in place as a true, real American company.\"\nMany critics believe the broader US turn toward state capitalism under Trump, exemplified by the Intel investment, raises questions about national security and the government's conflicting interests. But analysts say the US government's 10% stake in Intel could lead to various positive outcomes for the company, such as Intel having a say in trade policy that affects semiconductors. More importantly, the US could step in to incentivize or force a major company like Apple to use the chipmaker's foundry.\n\nA $2 billion investment from SoftBank and $5 billion from Nvidia further boosted investor sentiment on Intel stock. The cash infusion helped stem the company's steep losses as it figures out a path forward. Notably, though, the Nvidia deal didn't include an agreement for Intel's foundry business to manufacture the AI giant's chips.\n'Everything hinges on 14A' Intel's biggest potential customers for its foundry business — Nvidia, Apple ( AAPL ), and Qualcomm ( QCOM ) — are also, to some degree, competitors of its products arm and have longstanding relationships with TSMC. Not to mention, TSMC is building $165 billion worth of manufacturing capacity in the US, diminishing the geopolitical argument for those companies to use Intel to produce their chips.\nTo win those customers, Intel will need to prove that its latest generation manufacturing processes are up to snuff. The chipmaker's 18A process, a massive technological feat initially marketed to outside customers, is now being used primarily to make Intel's own products. Whether those products — Intel's upcoming Panther Lake chips for PCs and Clearwater Forest chips for data centers — succeed could help convince companies to use its next-generation processes called 18AP and 14A, analysts said.\n\nAlready, rumors have circulated that Apple could use Intel's manufacturing, specifically its 18AP process, for its lowest-end computer chips.\nIntel has 12 to 18 months to secure a big external customer for 14A in order for that process to continue as planned, BNB Paribas analyst David O'Connor estimated.\nHe called the process \"the crux of Intel being successful on the foundry business or not, or potentially even exiting manufacturing long term.\"\n\"Everything hinges on 14A and the success of that,\" O'Connor said.\nOther analysts gave longer timelines for when Intel would see a turnaround.\nBernstein analyst Stacy Rasgon said, \"It took 10 years to break it. Why would it take less than 10 years to fix it?\"\nLaura Bratton is a reporter for Yahoo Finance. Follow her on Bluesky @laurabratton.bsky.social. Email her at laura.bratton@yahooinc.com.\nClick here for the latest technology news that will impact the stock market\nRead the latest financial and business news from Yahoo Finance\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "21:10:00",
      "Source": "PR Newswire",
      "Title": "Stellar Solutions Awarded Contract for Missile Defense Agency SHIELD IDIQ",
      "URL": "https://finance.yahoo.com/news/stellar-solutions-awarded-contract-missile-131000383.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nStellar Solutions Awarded Contract for Missile Defense Agency SHIELD IDIQ\n\nPR Newswire\nSat, December 20, 2025 at 5:10 AM PST 1 min read\n\nIn this article: INTC\n\nGlobal aerospace and systems engineering services provider supports defense sector\nLOS ALTOS, Calif. , Dec. 20, 2025 /PRNewswire/ -- Stellar Solutions, Inc. has been awarded a contract for the Missile Defense Agency Scalable Homeland Innovative Enterprise Layered Defense (SHIELD) indefinite-delivery/indefinite-quantity (IDIQ) contract with a ceiling of $151B. This contract encompasses a broad range of work areas that allow for the rapid delivery of innovative capabilities to the warfighter with increased speed and agility.\n\"Stellar Solutions is honored to be selected as an awardee on the SHIELD IDIQ, where we will leverage our 30 years of space systems engineering experience across Intel, Defense, Civil, Commercial, and International markets,\" said Janet Grondin, CEO of Stellar Solutions, a global aerospace and systems engineering services provider and recipient of the Malcolm Baldrige Quality Award.\n\nAbout Stellar Solutions, Inc.: Stellar Solutions, Inc. is a global aerospace and systems engineering services provider to commercial, defense, intelligence, civil and international sectors. Stellar Solutions provides systems engineering capabilities and strategic support for global communications, remote sensing, national defense, and space exploration. These solutions to customer critical needs connect technology and customers across multiple domains. With physical operations throughout the U.S. and around the globe, Stellar Solutions is a recognized leader in delivering end-to-end critical expertise and problem-solving skills. https://www.stellarsolutions.com\nMedia Contact: Lynthia Romney, romneycom@gmail.com 914-589-2140\nView original content to download multimedia: https://www.prnewswire.com/news-releases/stellar-solutions-awarded-contract-for-missile-defense-agency-shield-idiq-302647414.html\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "06:15:45",
      "Source": "StockStory",
      "Title": "AMD, Intel, KLA Corporation, Western Digital, and Nova Stocks Trade Up, What You Need To Know",
      "URL": "https://finance.yahoo.com/news/amd-intel-kla-corporation-western-221545586.html",
      "Content": "AMD, Intel, KLA Corporation, Western Digital, and Nova Stocks Trade Up, What You Need To Know\n\nKayode Omotosho\nFri, December 19, 2025 at 2:15 PM PST 3 min read\n\nIn this article: AMD\n\nNVMI\n\n^IXIC\n\nINTC\n\nKLAC\n\nWhat Happened? A number of stocks jumped in the afternoon session after investor optimism around artificial intelligence fueled broad market gains. Technology stocks with a focus on artificial intelligence once again led the market higher, boosting the Nasdaq and S&P 500.\nCompanies at the forefront of the AI boom, such as Nvidia and Broadcom, saw significant jumps in their share prices. The rally reflects a renewed belief among investors in the transformative potential of AI technology to drive future growth and productivity.\n\nThe rally was further supported by a surprise cooling in the November consumer price index (CPI) report, which triggered market pricing for additional rate cuts in the coming year. This created a more favorable environment for growth-oriented companies.\nThe stock market overreacts to news, and big price drops can present good opportunities to buy high-quality stocks.\nAmong others, the following stocks were impacted:\nProcessors and Graphics Chips company AMD (NASDAQ:AMD) jumped 6.8%. Is now the time to buy AMD? Access our full analysis report here, it’s free for active Edge members.\nProcessors and Graphics Chips company Intel (NASDAQ:INTC) jumped 3.2%. Is now the time to buy Intel? Access our full analysis report here, it’s free for active Edge members.\nSemiconductor Manufacturing company KLA Corporation (NASDAQ:KLAC) jumped 2.9%. Is now the time to buy KLA Corporation? Access our full analysis report here, it’s free for active Edge members.\nMemory Semiconductors company Western Digital (NASDAQ:WDC) jumped 5%. Is now the time to buy Western Digital? Access our full analysis report here, it’s free for active Edge members.\nSemiconductor Manufacturing company Nova (NASDAQ:NVMI) jumped 4.1%. Is now the time to buy Nova? Access our full analysis report here, it’s free for active Edge members.\n\nZooming In On AMD (AMD) AMD’s shares are very volatile and have had 29 moves greater than 5% over the last year. In that context, today’s move indicates the market considers this news meaningful but not something that would fundamentally change its perception of the business.\nThe previous big move we wrote about was 7 days ago when the stock dropped 4.3% on the news that investors rotated out of AI-linked high-flyers following underwhelming earnings updates from Oracle and Broadcom as the core thesis shifted from \"growth at any cost\" to \"prove the returns.\"\n\nOracle triggered the alarm by missing revenue estimates while simultaneously hiking capital expenditures by $15 billion. This reignited fears that AI infrastructure spending is outpacing actual monetization. Broadcom compounded the anxiety; despite beating earnings, its stock fell as CFO Kirsten Spears cautioned that gross margins may come under pressure as product mix shifts further toward system-level AI sales. This sparked a macro rotation away from AI infrastructure and power plays. High-valuation names like AMD, Vertiv, and Bloom Energy fell as markets looked to sectors that can benefit from the recent Fed rate cut and a resilient economy.\n\nStory Continues\nAMD is up 77.6% since the beginning of the year, but at $214.30 per share, it is still trading 18.9% below its 52-week high of $264.33 from October 2025. Investors who bought $1,000 worth of AMD’s shares 5 years ago would now be looking at an investment worth $2,299.\nMicrosoft, Alphabet, Coca-Cola, Monster Beverage—all began as under-the-radar growth stories riding a massive trend. We’ve identified the next one: a profitable AI semiconductor play Wall Street is still overlooking. Go here for access to our full report .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "05:48:29",
      "Source": "Yahoo Finance Video",
      "Title": "Nvidia, Tesla dominate Dec. trading as 2025 options demand surges",
      "URL": "https://finance.yahoo.com/video/nvidia-tesla-dominate-dec-trading-214829316.html",
      "Content": "Nvidia, Tesla dominate Dec. trading as 2025 options demand surges\n\nYahoo Finance Video\nFri, December 19, 2025 at 1:48 PM PST\n\nIn this video: NVDA\n\nAMD\n\nAMZN\n\nAAPL\n\nINTC\n\nCboe vice president of market intelligence Henry Schwartz joins Market Domination with Yahoo Finance Data and Markets Editor Jared Blikre to discuss the state of the options landscape.\nWatch the video above to hear Schwartz's outlook for the options market in 2026.\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination .\n\nVideo Transcript\n\n00:00 Speaker A\n2025 will be another record year for options volume, but how are retail traders gearing up for 2026 as the demand for leverage keeps surging? We're digging into all of this in today's options pit, sponsored by Tasty trade.\n00:15 Speaker A\nAnd Henry Schwartz, CBOE Vice President of Market Intelligence is here to discuss. Uh, let's talk about this surge in options demand. We were just talking offline. You said it's up what three times since uh COVID?\n00:32 Henry Schwartz\nYeah.\n00:33 Speaker A\nThat is incredible. So, what is this trend tell you?\n00:36 Henry Schwartz\nSo, I mean, this year we're going to see 15 billion option contracts trade. Uh if you go back to to just before COVID, it was about 4 billion contracts a year. So, and in fact, I've been doing the calculations. It looks like the 15 billionth contract will trade on Christmas Eve.\n00:52 Speaker A\nMhm.\n00:52 Henry Schwartz\nI think we should have a door prize or something. Let's see if we can figure out what trade.\n00:56 Speaker A\nThere might be some binary option futures betting markets that could uh take care of that.\n01:00 Henry Schwartz\nAbsolutely. Well, I mean, that that's actually kind of one of the big themes, right? As we've seen this the evolution of risk taking, betting, you know, there's a lot of different ways to discuss it. Um, you know, the the you know, COVID really or you know, that whole kind of market environment really changed the landscape for options trading. And basically, uh we saw growth of about 50% in 2020 and it has kept up and it is retail that is really driving most of that. You know, we continue to see, you know, a healthy institutional business. Uh we see, you know, we see, you know, the the big theme really for this year is kind of everything is just stronger. Across the board, no matter what asset classes you look at, if you're talking about index options like SPX or VIX. If you're talking about ETF options, which you know, we were just talking about kind of the explosion in in number of ETFs and single stock option flow, which is really, you know, primarily retail driven. And when you have a year like, you know, like we're seeing this year with, you know, basically the broad averages up, you know, between 15 and 20%, uh that just brings in more and more activity.\n02:08 Speaker A\nSo, I've been thinking about this and tell me if I'm just way offline here. But if we take it back to early late 2020, early 2021, that's when we had the whole Reddit GameStop phenomenon going on. Arguably, a lot of it was fueled with the stimulus checks, the stimmies. and next year is going to be a blockbuster record year for fiscal stimulus. Um there's going to be a lot of tax refunds and I'm just wondering, is there any way we could have some kind of a repeat of that, maybe not to the same extent, but do you think that we just get another surge, um perhaps just because people have more money to play with?\n02:46 Henry Schwartz\nI I mean, I think you have you have a lot of dynamics going on at the same time. You know, we do have a a a rate, you know, the rates are going down in the cycle, but you also do have some concerns about the labor market, you have concerns about, you know, just fundamental valuations. So there's a little bit of push and pull. I think, you know, that the the COVID situation and you know, zero interest rates and stimulus and meme stock, uh that that was such a perfect storm of just kind of\n03:28 Speaker A\nAgreed, perfect storm.\n03:29 Henry Schwartz\nexplosive bullish activity and and and retail were able to capitalize on it. You know, in a large part because they were at home and they kind of had the freedom to trade. You also had commissions that basically gone to zero just leading into that. So, everything came together and you know, a lot of these traders found each other and learned from each other on Reddit and on, you know, social media. Uh I don't know if 2026 is going to be quite the same. I think there's a little bit more kind of back and forth. Uh but you know, at least in terms of the options activity, you know, we continue to see new brokerage firms coming uh online. We see the existing brokerage firms, you know, innovating and and rolling out new platforms and doing some really interesting things. So, you know, I see the business, at least in the options world continuing to to do very, very well. And you know, in terms of assets, uh you know, I think that you have this environment now where, you know, the US has had an amazing run and there's a lot of people that say, oh, you know, I don't know, this is getting a little bit tired. Uh but at the same time, you you you know, every time we have a dip, uh,\n04:36 Speaker A\nAnd that's arguably better for options traders. I mean, option traders like volatility. I I I want to make sure we get to a couple other things here. The other is the rise of zero-dated options. And so that just gives more opportunities. Back in the day, you only had monthlies, so you had to wait every month. Then we had weeklies, then basically we have dailies now. And that has just increased uh this volume of options. Talk to me about some of the other innovations. I know CBOE has a bunch of new products, too.\n05:08 Henry Schwartz\nYeah, so the so we pioneered the zero DTE or the daily option option cycle starting 2022 and those are now about 2/3 of the activity uh in SPX and um and some of the big ETFs. Uh and there there's no signs of that slowing down. Uh we just rolled out the Mag 10 index, which is the Mag 7 plus uh Broadcom, uh AMD and Palantir. And you know, those 10 symbols together do about a third of the single stock option. Out of almost 4,000 single stocks. So you you can see how concentrated it is. That's what the trader, that's what the investing public really, really is interested in. They're following the stories, they're getting in and getting out of these stocks. And so the Mag 10 index which launched about a month ago, I'm very proud to say I was the very first trade in in Mag 10. and that option expired today and I made a little bit of money at it. Uh we actually have daily options coming in those just uh in two weeks. So that's, you know, and that's new, right? This this is the first time that that there's been a uh an index that's not quite as broad-based with the daily options on it as well. So, um you know, there's you know, the the industry just continues to keep innovating. You know, we see a lot of work going on in complex order execution, which is you know, basically about a third of the activity is customers trading one option against another, vertical spreads, calendar spreads, exactly. Uh and that you know, CBOE and all the other exchanges continue to kind of take steps to make that uh easier to do, add functionality. You can now trade flex options versus listed options, which is a kind of a special option that lets people pick their own expiration date and um and strike price and even exercise style.\n06:56 Speaker A\nAll right, Henry, we got to leave it there, but congratulations on your Mag 10 trade. I hope it pretends a bullish 2026. Thanks for joining us in studio here.\n07:05 Henry Schwartz\nAwesome.\n07:06 Speaker A\nAll right, we'll\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "05:00:29",
      "Source": "MT Newswires",
      "Title": "Sector Update: Tech Stocks Gain Late Afternoon",
      "URL": "https://finance.yahoo.com/news/sector-tech-stocks-gain-afternoon-210029981.html",
      "Content": "PREMIUM\nSector Update: Tech Stocks Gain Late Afternoon\n\nMT Newswires\nFri, December 19, 2025 at 1:00 PM PST 1 min read\n\nIn this article: ORCL\n\nMETA\n\nGOOG\n\nNVDA\n\nINTC\n\nTech stocks gained late Friday afternoon, with the State Street Technology Select Sector SPDR ETF (X\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "02:46:31",
      "Source": "MT Newswires",
      "Title": "Sector Update: Tech Stocks Gain Friday Afternoon",
      "URL": "https://finance.yahoo.com/news/sector-tech-stocks-gain-friday-184631483.html",
      "Content": "PREMIUM\nSector Update: Tech Stocks Gain Friday Afternoon\n\nMT Newswires\nFri, December 19, 2025 at 10:46 AM PST 1 min read\n\nIn this article: ORCL\n\nNVDA\n\nINTC\n\nGOOG\n\nXLK\n\nTech stocks gained Friday afternoon, with the State Street Technology Select Sector SPDR ETF (XLK) r\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "02:31:36",
      "Source": "MT Newswires",
      "Title": "Market Chatter: Nvidia Wins US Antitrust Clearance for Intel Investment",
      "URL": "https://finance.yahoo.com/news/market-chatter-nvidia-wins-us-183136242.html",
      "Content": "PREMIUM\nMarket Chatter: Nvidia Wins US Antitrust Clearance for Intel Investment\n\nMT Newswires\nFri, December 19, 2025 at 10:31 AM PST 1 min read\n\nIn this article: NVDA\n\nINTC\n\nNvidia (NVDA) won clearance from US antitrust regulators for its planned investment in Intel (INTC),\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "02:11:57",
      "Source": "Yahoo Finance Video",
      "Title": "Nvidia's Intel stake cleared by FTC, existing home sales rise",
      "URL": "https://finance.yahoo.com/video/nvidias-intel-stake-cleared-ftc-181157932.html",
      "Content": "Nvidia's Intel stake cleared by FTC, existing home sales rise\n\nYahoo Finance Video and John Hyland\nFri, December 19, 2025 at 10:11 AM PST\n\nIn this video: NVDA\n\nINTC\n\nYahoo Finance's John Hyland takes a closer look at some of Friday's top stories in this episode of Market Minute , including Nvidia's ( NVDA ) Intel ( INTC ) investment being approved by US regulators, reports that the Trump administration has begun its review of Nvidia's H100 chip exports to China, and existing home sales moderately gaining in November.\nStay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute .\n\nVideo Transcript\n\n00:03 Speaker A\nIt's time for the Yahoo Finance Market Minute.\n00:05 Speaker A\nUS stocks are looking to close out a week of gains as tech stocks lead the market higher, and US anti-trust agencies have cleared Nvidia's investment in Intel.\n00:13 Speaker A\nBack in September, Nvidia said it would invest $5 billion in the struggling chipmaker.\n00:17 Speaker A\nThe FTC ended its review and made the announcement today, but didn't offer details on the investment.\n00:21 Speaker A\nMeanwhile, the Trump administration has reportedly kicked off its review of Nvidia's H200 chip exports to China.\n00:27 Speaker A\nAccording to Reuters, the White House has launched the review, which could result in the first shipment of chips to China, but questions remain on the timeline for sales and whether Beijing would even allow the Chinese firms to purchase Nvidia's chips.\n00:36 Speaker A\nAn existing home sales data showed a moderate gain for November, but it did mark a third straight month of gains and lower mortgage rates were likely the boost.\n00:43 Speaker A\nHome sold in November typically go under contract during September or October, around when mortgage rates were near year-to-date lows.\n00:48 Speaker A\nAnd that's your Yahoo Finance Market Minute. Scan the QR code below for more on what's trending on the website.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "01:05:00",
      "Source": "Motley Fool",
      "Title": "Intel vs. Taiwan Semiconductor Manufacturing: Which Stock Will Outperform in 2026?",
      "URL": "https://finance.yahoo.com/m/ab4439bf-2ed7-3ec1-b64a-61a4c9be5886/intel-vs.-taiwan.html",
      "Content": "Intel vs. Taiwan Semiconductor Manufacturing: Which Stock Will Outperform in 2026?\n\nGeoffrey Seiler, The Motley Fool\nFri, December 19, 2025 at 9:05 AM PST 5 min read\n\nIn this article: TSM\n\nINTC\n\nNVDA\n\nAAPL\n\nAVGO\n\nKey Points TSMC is the undisputed leader in manufacturing advanced chips.\nIntel's stock outperformed in 2025 after the company was backed by some big investors.\nTSMC has a clearer growth path between the two companies.\n10 stocks we like better than Intel ›\nWhen it comes to chip manufacturing, Taiwan Semiconductor Manufacturing (NYSE: TSM) is the undisputed foundry leader, while Intel (NASDAQ: INTC) is trying to make inroads. However, in 2025, it was Intel's stock that outperformed, up nearly 80% as of this writing, compared to a 40% gain for Taiwan Semiconductor Manufacturing.\nLet's look at which stock is set up to outperform in 2026.\nThe case for Taiwan Semiconductor Manufacturing Taiwan Semiconductor Manufacturing, or TSMC for short, is the world's largest semiconductor foundry on the planet. Due to its technological expertise and scale, the company manufactures the vast majority of advanced chips, such as graphics processing units (GPUs) . It counts Nvidia , Apple , and Broadcom among its top customers.\n\nIn chip manufacturing, the goal is to consistently push down node sizes, which refers to the transistor density of the chips. The more transistors that can be fit on a chip, the more powerful and energy efficient they become. However, producing advanced chips at scale is difficult, and TSMC's main competitors, including Intel and Samsung , have struggled with yields (the number of defects per wafer). Meanwhile, nearly three-quarters of its production is at 7nm nodes and below, and it is set to move to 2nm technology next year.\nGiven its position in the industry, TSMC is the go-to partner for chip designers. It works closely with companies like Nvidia to grow capacity to meet their projected demand. And, as the only foundry that can really make these advanced chips at scale with high yields, it has also garnered strong pricing power. The company is set to raise prices once again next year, while the cost of its new 2nm processing technology is forecasted to be 50% higher than its 2nm technology.\n\nTSMC is well-positioned to continue to benefit from the ongoing artificial intelligence (AI) infrastructure buildout and sees AI chip demand growing by more than a 40% compound annual growth rate (CAGR) over the next few years.\nThe case for Intel Intel stock's outperformance in 2025 wasn't really a result of its operational performance. The company has struggled to grow its revenue, and it felt a lot of gross margin pressure in the first half of the year. However, it did see a huge rebound in adjusted gross margins in Q3, with it climbing from 18% a year ago to 40%. Revenue, meanwhile, edged up 3%.\n\nStory Continues\nThe biggest reasons for Intel's gains in 2025 were from the high-profile investments others made into the company's stock. Nvidia made a $5 billion equity investment in the company, while SoftBank invested $2 billion. Meanwhile, the U.S. government made an $8.9 billion investment. These investments, along with the 51% sale of its Altera business for $5.2 billion, helped Intel end Q3 with nearly $31 billion in cash on its balance sheet.\n\nThe company will use that cash to keep building out its foundry business and advance its chip manufacturing technology. Meanwhile, it is collaborating with Nvidia on new products, including integrating its central processing units (CPUs) with Nvidia's NVLink system to allow its CPUs to communicate more quickly with Nvidia's GPUs. This would help give Intel a nice advantage in the data center CPU market, where it has been losing share to Advanced Micro Devices . Separately, Intel is also working on its own AI chips designed for inference, and it is supposedly close to a deal with SambaNova Systems to further its efforts in this area.\nThe verdict Intel's 2025 performance was largely from events that won't repeat in 2026. For the company to outperform next year, it's probably going to need to win a large foundry customer or show major progress in data center chips, either with its CPUs or GPU efforts. That makes the stock more of a wildcard.\n\nTSMC, meanwhile, is the much safer choice. The company is set to benefit from the continued AI data center buildout, and its path forward is much clearer. As such, it's my pick to outperform in 2026.\nShould you buy stock in Intel right now? Before you buy stock in Intel, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Intel wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $506,935 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,067,514 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 958 % — a market-crushing outperformance compared to 192% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nGeoffrey Seiler has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Apple, Intel, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nIntel vs. Taiwan Semiconductor Manufacturing: Which Stock Will Outperform in 2026? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "01:04:16",
      "Source": "Reuters",
      "Title": "Nvidia-Intel deal cleared by US antitrust agencies",
      "URL": "https://finance.yahoo.com/news/nvidia-intel-deal-cleared-us-170416066.html",
      "Content": "Nvidia-Intel deal cleared by US antitrust agencies\n\nReuters\nFri, December 19, 2025 at 9:04 AM PST\n\nIn this article: NVDA\n\nINTC\n\nTSM\n\nAMD\n\nDec 19 (Reuters) - U.S. antitrust agencies ​have cleared Nvidia 's ‌investment in Intel, according ‌to a notice posted by the U.S. Federal Trade ⁠Commission.\nWhile ‌the notice did not specify the ‍details of the transaction, Nvidia said in ​September it ‌would invest $5 billion in Intel, throwing its heft behind the struggling U.S. chipmaker ⁠in a ​deal that ​could pose risks for rival manufacturers, ‍Taiwan's ⁠TSMC and U.S.-based AMD.\n(Reporting by Jody ⁠Godoy in New ‌York, Editing by ‌Franklin Paul)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "01:01:02",
      "Source": "GuruFocus.com",
      "Title": "US Reopens China's Door to Nvidia Chips--But Risks Undermining Its AI Edge",
      "URL": "https://finance.yahoo.com/news/us-reopens-chinas-door-nvidia-170102157.html",
      "Content": "US Reopens China's Door to Nvidia Chips--But Risks Undermining Its AI Edge\n\nKhac Phu Nguyen\nFri, December 19, 2025 at 9:01 AM PST 2 min read\n\nIn this article: NVDA\n\nAMD\n\nINTC\n\nThis article first appeared on GuruFocus .\nPolicy shifts in Washington have reopened a sensitive debate around Nvidia ( NASDAQ:NVDA ) and the balance between commercial opportunity and national security in advanced semiconductors. Earlier this month, the White House granted Nvidia permission to resume shipments of its H200 artificial intelligence chips to China, while also loosening restrictions on Intel and Advanced Micro Devices ( NASDAQ:AMD ). Although the H200 is not Nvidia's most advanced product, it remains meaningfully ahead of Chinese-made alternatives. Research cited from the Institute for Progress suggests the H200 delivers 32% more processing power and 50% more memory bandwidth than Huawei's Ascend 910C, while also being cheaper to operate and more reliable, reinforcing its appeal for AI model training and deployment.\n\nWarning! GuruFocus has detected 4 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nSupporters of the decision argue the policy could help slow China's domestic chip development by keeping Chinese customers dependent on US technology, while preserving revenue streams that US firms could reinvest into future semiconductor innovation. They point to concerns that Huawei may be closing the gap by linking more chips together and potentially expanding production next year. However, Commerce Department estimates indicate Huawei is expected to produce about 200,000 Ascend chips this year, compared with roughly 14 million AI chips deployed by US companies, raising questions about whether domestic supply can meaningfully satisfy Chinese demand. Under the current framework, companies must still apply for licenses to import H200s, and US officials have indicated the government would take a 25% cut of any such sales.\n\nCritics caution that allowing H200 exports could gradually chip away at what remains the US's largest advantage in AI: aggregate computing power. As of mid-2025, the US accounted for nearly three-quarters of global AI supercomputer capacity, compared with about 14% for China, a gap seen as critical for training frontier models. There is concern that Chinese authorities could direct imported H200s toward leading firms and, through civilian channels, into defense-related research, potentially accelerating advances in both commercial AI and military applications. With bipartisan support in Congress for tighter controls, lawmakers are expected to scrutinize the administration's assumptions on Huawei's progress and weigh testimony from AI developers and cloud providers on whether the current approach strengthens, or possibly undermines, long-term US competitiveness in artificial intelligence.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "00:21:07",
      "Source": "GuruFocus.com",
      "Title": "Why Advanced Micro Devices Stock Is Jumping Today",
      "URL": "https://finance.yahoo.com/news/why-advanced-micro-devices-stock-162107644.html",
      "Content": "Why Advanced Micro Devices Stock Is Jumping Today\n\nNauman Khan\nFri, December 19, 2025 at 8:21 AM PST 1 min read\n\nIn this article: AMD\n\nNVDA\n\nINTC\n\nThis article first appeared on GuruFocus .\nAdvanced Micro Devices ( NASDAQ:AMD ) shares climbed about 4% on Friday morning after Chief Executive Lisa Su met with China's Commerce Minister Wang Wentao in Beijing.\nThe ministry said the two sides discussed AMD's business operations in China and ways to deepen cooperation. It did not provide financial details or timelines tied to any potential outcomes.\n\nThe meeting comes as Washington reviews export policies tied to advanced artificial intelligence chips. The Trump administration has begun a review that could allow initial shipments of Nvidia's ( NASDAQ:NVDA ) H200 graphics processing units to China.\nWarning! GuruFocus has detected 5 Warning Signs with AMD.\nIs AMD fairly valued? Test your thesis with our free DCF calculator.\nPresident Trump said earlier this month he had approved sales of Nvidia's H200 GPUs to Chinese customers. He added that a similar approach would likely apply to AMD, Intel ( NASDAQ:INTC ), and other U.S. chipmakers.\nAny change in export policy could affect revenue prospects for U.S. semiconductor companies with exposure to China, one of the world's largest markets for data center and AI hardware.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "00:04:01",
      "Source": "Yahoo Finance",
      "Title": "Nvidia stock gains on Trump chip export review, sparking rally in chipmakers",
      "URL": "https://finance.yahoo.com/news/nvidia-stock-gains-on-trump-chip-export-review-sparking-rally-in-chipmakers-160401242.html",
      "Content": "Nvidia stock gains on Trump chip export review, sparking rally in chipmakers\n\nGrace O'Donnell · Editor, Special Projects\nUpdated Fri, December 19, 2025 at 8:05 AM PST 2 min read\n\nIn this article: NVDA\n\nAVGO\n\nMU\n\nAMD\n\nINTC\n\nNvidia stock ( NVDA ) jumped as much as 3.7% in early trading on Friday following a Reuters report that the Trump administration began its review of Nvidia H200 chip exports to China.\nThe move higher put shares of the world's largest company on track for a weekly gain, as investors viewed the news as a sign that President Trump would follow through on his promise to allow Nvidia to sell advanced chips to China in exchange for a 25% fee to the government.",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "23:00:40",
      "Source": "Barchart",
      "Title": "Stocks Supported by Strength in Cloud Stocks and Chip Makers",
      "URL": "https://finance.yahoo.com/m/4fd7a5ad-a021-3b53-8bd8-9a6a32d1cf60/stocks-supported-by-strength.html",
      "Content": "Stocks Supported by Strength in Cloud Stocks and Chip Makers\n\nRich Asplund\nFri, December 19, 2025 at 7:00 AM PST 7 min read\n\nIn this article: ORCL\n\nAPLD\n\n$IUXX\n\nSATS\n\nAMD\n\nThe S&P 500 Index ($SPX) (SPY) today is up by +0.63%, the Dow Jones Industrials Index ($DOWI) (DIA) is up by +0.52%, and the Nasdaq 100 Index ($IUXX) (QQQ) is up by +1.08%. March E-mini S&P futures (ESH26) are up +0.61%, and March E-mini Nasdaq futures (NQH26) are up +1.09%.\n\nStock indexes are moving higher today as a rally in cloud infrastructure stocks improves market sentiment and lifts the broader market. Oracle is up by more than 7% after TikTok CEO Chew said his company has signed binding agreements to create a US joint venture owned by American investors, including Oracle. Also, strength in chipmakers today supports the broader market.\nMore News from Barchart Is Cathie Wood Jumping Ship on Tesla Stock?\nBeyond Nvidia: The AI Stock to Buy With 205% Upside Potential\nAs Nvidia Launches New Nemotron 3 Models, Should You Buy, Sell, or Hold NVDA Stock?\nTired of missing midday reversals? The FREE Barchart Brief newsletter keeps you in the know. Sign up now!\nHigher bond yields are limiting gains in stocks today, as the 10-year T-note yield is up +3 bp to 4.15%. Global bond yields are climbing today, led by a surge in the 10-year Japanese government bond yield to a 26-year high of 2.025% after the BOJ raised interest rates and said it will keep raising rates if its economic and price outlook is realized.\n\nUpbeat comments today from New York Fed President John Williams were supportive for stocks but negative for bonds, as he said some data we're seeing is \"pretty encouraging\" and he sees no sign of sharp deterioration in the jobs data. He added that he sees US GDP growth of 1.5% to 1.75% this year, with growth picking up next year, and that there's \"no urgency to need to act further on monetary policy right now, because I think the cuts we've made have positioned us really well.\"\nStock market moves may be exaggerated and more volatile than usual today due to the expiration of options, futures, and derivatives during the quarterly event known as triple witching. According to Citigroup, a record $7.1 trillion of notional open interest will roll off the US options market today.\n\nThis week's market focus will be on US economic news. Later today, Nov existing home sales are expected to be up +1.2% m/m to 4.15 million. Also, the University of Michigan Dec consumer sentiment index is expected to be revised upward by +0.2 to 53.5 from the previously reported 53.3.\nThe markets are discounting a 20% chance that the FOMC will cut the fed funds target range by 25 bp at the next FOMC meeting on January 27-28.\n\nStory Continues\nOverseas stock markets are higher today. The Euro Stoxx 50 is up +0.04%. China’s Shanghai Composite climbed to a 1-week high and closed up +0.36%. Japan’s Nikkei Stock 225 closed up +1.03%.\nInterest Rates\nMarch 10-year T-notes (ZNH6) today are down by -7 ticks. The 10-year T-note yield is up +2.7 bp to 4.149%. Today's strength in stocks has reduced safe-haven demand for government debt securities and is weighing on T-notes. Also, hawkish comments from New York Fed President John Williams are undercutting T-note prices after he said some of the data we're seeing is \"pretty encouraging\" and that he sees no sign of sharp deterioration in the jobs data. In addition, T-notes have a negative carryover from today’s jump in the 10-year Japan government bond yield to a 26-year high of 2.025%.\n\nThe steepening yield curve is also bearish for T-note prices. Steepening trades occur when bond investors buy short-term government debt and sell long-term debt. The yield curve has steepened since last Wednesday’s FOMC meeting, when the Fed said it would begin purchasing up to $40 billion of short-term T-bills a month to boost liquidity in the financial system. Longer-term Treasury securities are also under pressure from concerns about inflation and the Fed’s independence.\nEuropean government bond yields are moving higher today. The 10-year German bund yield is up +3.4 bp to 2.884%. The 10-year UK gilt yield is up +3.8 bp to 4.518%.\nGerman Nov PPI fell -2.3% y/y, weaker than expectations of -2.2% y/y and the steepest pace of decline in 20 months.\n\nThe German Jan GfK consumer confidence index unexpectedly fell -3.5 to a 1.75-year low of -26.9, weaker than expectations of an increase to -23.0.\nUK Nov retail sales ex-auto fuel unexpectedly fell -0.2% m/m, weaker than expectations of an increase of +0.1% m/m.\nSwaps are discounting a 1% chance for a -25 bp rate cut by the ECB at its next policy meeting on February 5.\nUS Stock Movers\nCloud infrastructure stocks are rallying today as they recover from a recent sell-off on financing concerns in the AI supply chain. CoreWeave (CRWV) is up +8%, and Oracle (ORCL) is up more than +7% to lead gainers in the S&P 500. Also, Applied Digital (APLD) is up more than +4%, and Nebius Group NV (NBIS) is up more than +3%.\nChip stocks are moving higher today, a supportive factor for the overall market. Micron Technology (MU) is up more than +6% to lead gainers in the Nasdaq 100. Also, Lam Research (LRCX) is up more than +3%, and Nvidia (NVDA) is up more than +2% to lead gainers in the Dow Jones Industrials. In addition, Advanced Micro Devices (AMD), Applied Materials (AMAT), KLA Corp (KLAC), NXP Semiconductors NV (NXPI), and Intel (INTC) are up more than +2%. Finally, GlobalFoundries (GFS), Broadcom (AVGO), and Marvell Technology (MRVL) are up more than +1%.\n\nCryptocurrency-exposed stocks are climbing today, with Bitcoin (^BTCUSD) up more than +2%. Galaxy Digital Holdings (GLXY) and Riot Platforms (RIOT) are up more than +4%. Also, Strategy (MSTR) and Mara Holdings (MARA) are up more than +2%, and Coinbase Global (COIN) is up more than +1%.\nWhitefiber Inc (WYFI) is up more than +16% following the announcement of a 10-year 40 megawatt co-location agreement between its subsidiary Enovum Data Centers Corp. and Nscale Global Holdings, representing around $865 million in contracted revenue.\nEchostar Corp (SATS) is up more than +4% after Deutsche Bank raised its price target on the stock to $131 from $97.\nGenerac Holdings (GNRC) is up more than +2% after Wells Fargo Securities upgraded the stock to overweight from equal weight with a price target of $195.\n\nStryker Corp (SYK) is up more than +1% after Citizens JMP Securities LLC upgraded the stock to outperform from market perform with a price target of $440.\nCummins Inc (CMI) is up more than +1% after Barclays upgraded the stock to overweight from equal weight with a price target of $546.\nLamb Weston Holdings (LW) is down more than -19% to lead losers in the S&P 500 after forecasting full-year net sales of $6.35 billion to $6.55 billion, the midpoint below the consensus of $6.52 billion.\nNike (NKE) is down more than -9% to lead losers in the Dow Jones Industrials after forecasting Q3 revenue down in the low single digits and gross margins down about 175 to 225 basis points, amid persistent weakness in China.\nKB Home (KBH) is down more than -7% after reporting Q4 EPS of $1.55, weaker than the consensus of $1.79, and forecasting 2026 housing revenue of $5.10 billion to $6.10 billion, the midpoint below the consensus of $5.83 billion.\n\nLyft Inc (LYFT) is down more than -4% after Wedbush Securities downgraded the stock to underperform from neutral with a price target of $16.\nKBR Inc (KBR) is down more than -4% after Truist Securities cut its price target on the stock to $50 from $62.\nPaychex (PAYX) is down more than -3% to lead losers in the Nasdaq 100 after BMO Capital Markets said the company’s Q2 earnings signaled an “okay quarter,” but management-solutions growth was softer.\nFedEx (FDX) is down more than -2% after Morgan Stanley downgraded the stock to underweight from neutral with a price target of $210.\nElevance Health (ELV) is down more than -1% after Deutsche Bank downgraded the stock to hold from buy, citing a challenging macro environment.\nEarnings Reports(12/19/2025)\nCarnival Corp (CCL), Conagra Brands Inc (CAG), Lamb Weston Holdings Inc (LW), Paychex Inc (PAYX).\nOn the date of publication, Rich Asplund did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "21:34:11",
      "Source": "GuruFocus.com",
      "Title": "Big Tech Backs DOE's Genesis AI Mission",
      "URL": "https://finance.yahoo.com/news/big-tech-backs-does-genesis-133411420.html",
      "Content": "Big Tech Backs DOE's Genesis AI Mission\n\nMoz Farooque ACCA\nFri, December 19, 2025 at 5:34 AM PST 1 min read\n\nIn this article: AMZN\n\nOPAI.PVT\n\nORCL\n\nPLTR\n\nDELL\n\nThis article first appeared on GuruFocus .\nAmazon ( NASDAQ:AMZN ), Google (GOOGL), and Microsoft (MSFT) are stepping into a much bigger role in U.S. science and energy policy, teaming up with the Department of Energy on a new initiative called the Genesis Mission.\nWarning! GuruFocus has detected 8 Warning Signs with F.\nIs GOOG fairly valued? Test your thesis with our free DCF calculator.\n\nThe effort brings together 24 companies to use AI to speed up scientific discovery, strengthen national security, and drive energy innovation. The goal is to let AI handle more of the heavy lifting, from designing experiments to running complex simulations and building predictive models. DOE officials say that could dramatically shorten the time it takes for researchers to move from ideas to real world breakthroughs.\nAlongside the major cloud providers, the group includes Nvidia ( NASDAQ:NVDA ), AMD ( NASDAQ:AMD ), Intel ( NASDAQ:INTC ), OpenAI (OPENAI), Oracle ( NYSE:ORCL ), Palantir ( NASDAQ:PLTR ), Dell ( NYSE:DELL ), and IBM (IBM), many of which already work closely with U.S. national labs. White House officials described the partnerships as just the beginning of a broader national AI platform for research.\nFor investors, this is not about near term sales. It is about positioning. The Genesis Mission shows how tightly big tech, AI infrastructure, and government priorities are becoming linked as demand for compute and energy continues to grow.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "20:57:38",
      "Source": "GuruFocus.com",
      "Title": "Amazon, Google, and Microsoft Join U.S. Energy Department's 'Genesis Mission'",
      "URL": "https://finance.yahoo.com/news/amazon-google-microsoft-join-u-125738758.html",
      "Content": "Amazon, Google, and Microsoft Join U.S. Energy Department's 'Genesis Mission'\n\nFaizan Farooque\nFri, December 19, 2025 at 4:57 AM PST 1 min read\n\nIn this article: AMZN\n\nGOOG\n\nMSFT\n\nACN\n\nAMD\n\nThis article first appeared on GuruFocus .\nThe U.S. Department of Energy announced new partnerships with 24 major technology firms , including Amazon ( AMZN , Financials ), Google, and Microsoft, to advance the Genesis Mission, a national program to apply artificial intelligence to energy research and scientific discovery.The Genesis Mission will employ AI to automate experiment design, expedite simulations, and produce predictive models to advance renewable energy, manufacturing, and medicine discovery, according to DOE officials.Accenture, AMD, Anthropic, Amazon Web Services, Cerebras, CoreWeave, Dell, Google, HPE, IBM, Intel, Microsoft, Nvidia, OpenAI, Oracle, Palantir, and xAI are participating. These companies have started or showed interest in DOE-National Laboratories initiatives.Michael Kratsios, Director of the White House Office of Science and Technology Policy, called the agreements only the beginning of public-private AI research collaboration. DOE Under Secretary for Science and Genesis Mission Director Dario Gil said the effort complements President Trump's executive order to create a national AI platform for scientific research.The Genesis Mission is one of the most extensive government-led AI innovation coordination projects spanning business, academia, and governmental research organizations. Industry analysts anticipate the initiative to boost U.S. applied AI competitiveness and bridge cloud and semiconductor leaders in high-performance computing.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 68
}