{
  "stock_id": "INTC",
  "last_updated": "2025-12-17T20:11:46.603Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-18",
      "Time": "02:03:28",
      "Source": "Reuters",
      "Title": "Republican lawmakers decry Intel's testing of Chinese-linked tools after Reuters report",
      "URL": "https://finance.yahoo.com/news/republican-lawmakers-decry-intels-testing-180328101.html",
      "Content": "Republican lawmakers decry Intel's testing of Chinese-linked tools after Reuters report\n\nAlexandra Alper\nWed, December 17, 2025 at 10:03 AM PST 3 min read\n\nIn this article: ACMR\n\nINTC\n\nBy Alexandra Alper\nWASHINGTON, Dec 17 (Reuters) - Republican lawmakers accused Intel this week of threatening U.S. national security after Reuters revealed the chipmaker was evaluating chipmaking equipment made by a company with deep ties to China and ​overseas units sanctioned by the U.S. government.\n\nIntel, whose CEO came under pressure from President Donald Trump to resign in ‌August over his alleged ties to China, got the tools from ACM Research, a Fremont, California-based producer of chipmaking equipment.\nThe tools were tested for possible use ‌in Intel's most advanced chipmaking process, known as 14A.\nTwo of ACM's units were among a number of firms barred last year from receiving U.S. technology over claims they supported Chinese government efforts to harness commercial technology for military use and making advanced chips or chipmaking tools. ACM denies the allegations. Shares of its Shanghai unit rose 8% the day the story was published.\n\"Testing Chinese-linked tools for U.S. chip ⁠manufacturing opens the door for the (Chinese Government) ‌to manipulate or compromise our most advanced semiconductor capabilities,\" Republican Senator Marsha Blackburn said in a statement to Reuters. \"It is egregious that Intel would put American national and economic security at risk.\"\n\nBlackburn called for ‍the passage of legislation she co-sponsored to bar chipmakers that have received billions in U.S. government subsidies from using Chinese equipment as part of their government-backed expansion plans.\nReuters could not determine if Intel had made a decision to add the tools to the chipmaking process and has no ​evidence that the company violated any U.S. regulations.\nACM did not respond to a request for comment. Intel reiterated that it ‌was not using ACM tools to produce chips currently and that it complies with U.S. laws and regulations.\nIntel said it takes \"U.S. national security responsibilities extremely seriously and operates under rigorous IT and cyber security protocols\" to protect sensitive information.\nThe company limits the data any individual tool can receive during manufacturing, ensures tools cannot connect with each other, and monitors communications from all equipment, it added.\n\nIntel also said it engages regularly with lawmakers, regulators and U.S. government customers about manufacturing and security and welcomes continued dialogue with ⁠policymakers to address any concerns.\nChina hawks said the fact that Intel, which ​is now part-owned by the U.S. government, would consider adding tools made by ​a firm with sanctioned units into its most advanced manufacturing line, raised important national security concerns.\n\nStory Continues\nThey flagged the possible transfer of Intel's sensitive technological know-how to China, the eventual displacement of trusted Western tool suppliers ‍with China-linked firms and even the ⁠potential for sabotage efforts by Beijing.\nRepublican Congressman John Moolenaar, who chairs the powerful House Select Committee on China, said there was no faster way to erase America's advantage in AI chips and the tools to make them than by ⁠importing Chinese manufacturing equipment into American factories and turbocharging its adoption.\n\"Given that Intel has received generous U.S. taxpayer support due to its corporate alignment with ‌the national interest, it is hard to believe Intel would consider taking this step and possibly jeopardize American ‌national security,\" he said.\n(Reporting by Alexandra Alper; Editing by Nia Williams)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "00:24:19",
      "Source": "Barchart",
      "Title": "Stocks Retreat as AI Infrastructure Companies and Chip Makers Fall",
      "URL": "https://finance.yahoo.com/m/dcbf4e6d-55a0-37a0-88e8-bb0bc313ca00/stocks-retreat-as-ai.html",
      "Content": "Stocks Retreat as AI Infrastructure Companies and Chip Makers Fall\n\nRich Asplund\nWed, December 17, 2025 at 8:24 AM PST 7 min read\n\nIn this article: ^GSPC\n\nNQ*0\n\nDHI\n\nFTNT\n\nPSKY\n\nThe S&P 500 Index ($SPX) (SPY) today is down by -0.61%, the Dow Jones Industrials Index ($DOWI) (DIA) is down by -0.12%, and the Nasdaq 100 Index ($IUXX) (QQQ) is down by -1.12%. December E-mini S&P futures (ESZ25) are down -0.66%, and December E-mini Nasdaq futures (NQZ25) are down -1.15%.\n\nStock indexes are falling today, with the S&P 500 and Nasdaq 100 posting 3-week lows. Weakness in AI infrastructure stocks and chip makers is dragging the broader market lower and weighing on market sentiment. Also, homebuilding stocks are lower, led by a -5% fall in Lennar after it reported Q4 EPS that were weaker than expected.\nMore News from Barchart While AI Panic Struck Applied Digital (APLD) Stock, the Smart Money Has a Different View\nJPMorgan Says to Sell NVDA March $160 Puts. Should You Actually?\nBroadcom Stock Is Up 120% in the Past Year. This Analyst Thinks It Is One of the Highest-Quality Stocks to Buy for the Next Year Too.\nGet exclusive insights with the FREE Barchart Brief newsletter. Subscribe now for quick, incisive midday market analysis you won't find anywhere else.\n\nOn the positive side, energy producers are climbing, with WTI crude oil up by more than 1% after President Trump announced an oil blockade on tankers entering and leaving Venezuela. Mining stocks are also moving higher as tensions in Venezuela escalate, boosting safe-haven demand for precious metals, with silver soaring to a new all-time high.\nDovish comments today from Fed Governor Christopher Waller were supportive of stocks and bonds, as he said the US labor market is \"pretty soft,\" with close to zero job growth, and that inflation is \"pretty well anchored\" around 2%. He added that interest rates are still 50-100 basis points above neutral, and the Fed can steadily lower them with no rush.\nUS MBA weekly mortgage applications fell -3.8% in the week ended December 12, with the purchase mortgage sub-index down -2.8% and the refinancing mortgage sub-index down -3.6%. The average 30-year fixed rate mortgage rose +5 bp to 6.38% from 6.33% in the prior week.\n\nThis week's market focus will be on US economic news. On Thursday, weekly initial unemployment claims are expected to fall -11,000 to 225,000. Also, Nov CPI is expected to be +3.1% y/y, and Nov core CPI is expected to be +3.0% y/y. On Friday, Nov existing home sales are expected to be up +1.2% m/m to 4.15 million. Also, the University of Michigan Dec consumer sentiment index is expected to be revised upward by +0.2 to 53.5 from the previously reported 53.3.\n\nStory continues\nThe markets are discounting a 24% chance that the FOMC will cut the fed funds target range by 25 bp at the next FOMC meeting on January 27-28.\nOverseas stock markets are mixed today. The Euro Stoxx 50 is down -0.24%. China’s Shanghai Composite closed up +1.19%. Japan’s Nikkei Stock 225 recovered from a 2-week low and closed up +0.26%.\n\nInterest Rates\nMarch 10-year T-notes (ZNH6) today are up by +1 tick. The 10-year T-note yield is down -0.4 bp to 4.141%. T-notes recovered from early losses today and are slightly higher due to dovish comments from Fed Governor Waller, who said the Fed can keep cutting rates as interest rates are still 50-100 bp above neutral.\nT-notes initially moved lower today on negative carryover from a plunge in Japanese 10-year bonds to an 18-year low. Also, supply pressures are weighing on T-note prices ahead of the Treasury’s $13 billion auction of 20-year T-bonds later today.\nThe steepening yield curve is bearish for T-note prices. Steepening trades occur when bond investors buy short-term government debt and sell long -term debt. The yield curve has steepened since last Wednesday’s FOMC meeting, when the Fed said it would begin purchasing up to $40 billion of short-term T-bills a month to boost liquidity in the financial system. Longer-term Treasury securities are also under pressure from concerns about inflation and the Fed’s independence.\n\nEuropean government bond yields are mixed today. The 10-year German bund yield rebounded from a 1-week low of 2.826% and is up +0.6 bp to 2.851%. The 10-year UK gilt yield fell to a 1.5-week low of 4.446% and is down -6.2 bp to 4.456%.\nEurozone Nov CPI was revised downward to +2.1% y/y from the previously reported +2.2% y/y.\nEurozone Q3 labor costs eased to +3.3% y/y from +3.9% y/y in Q2, the smallest pace of increase in three years.\nThe German Dec IFO business conditions survey unexpectedly fell -0.4 to a 7-month low of 87.6 versus expectations of an increase to 88.2.\nUK Nov CPI eased to +3.2% y/y from +3.6% y/y in Oct, better than expectations of +3.5% y/y and the slowest pace of increase in eight months. Nov core CPI rose +3.2% y/y, weaker than expectations of +3.4% y/y and the slowest pace of increase in 11 months.\n\nSwaps are discounting a 0% chance for a -25 bp rate cut by the ECB at its next policy meeting on Thursday.\nUS Stock Movers\nAI infrastructure stocks and chip makers are sliding today and weighing on market sentiment. GE Vernova (GEV) is down more than -6% to lead losers in the S&P 500, and Constellation Energy (CEG) is down more than -6% to lead losers in the Nasdaq 100. Also, Broadcom (AVGO) and ASML Holding NV (ASML) are down more than -4%. In addition, Lam Research (LRCX), Nvidia (NVDA), and Advanced Micro Devices (AMD) are down more than -3%. Finally, Palantir Technologies (PLTR), ARM Holdings Plc (ARM), KLA Corp (KLAC), Applied Materials (AMAT), Intel (INTC), and Micron Technology (MU) are down more than -2%.\nHomebuilding stocks are lower today, led by a -5% fall in Lennar (LEN) after it forecast Q1 new orders of 18,000 to 19,000, below the consensus of 20,297. Also, DR Horton (DHI) is down more than -2%, and PulteGroup (PHM) is down more than -1%.\n\nEnergy producers and energy service providers are climbing today, with WTI crude oil up by more than 1%. Devon Energy (DVN) is up more than +3%, and ConocoPhillips (COP) is up more than +2%. Also, APA Corp (APA), Halliburton (HAL), Occidental Petroleum (OXY), Diamondback Energy (FANG), Chevron (CVX), and Exxon Mobil (XOM) are up more than +1%.\nOracle (ORCL) is down more than -5% after the Financial Times reported that Blue Owl Capital will not back a $10 billion deal for Oracle’s next data center.\nParamount Skydance (PSKY) is down more than -4% to lead losers in the S&P 500 as Warner Bros. Discovery plans to reject Paramount Skydance’s takeover bid due to concerns about financing and other terms.\nWorthington Enterprises (WOR) is down more than -4% after reporting Q2 adjusted EPS of 65 cents, weaker than the consensus of 70 cents.\n\nBrown-Forman Corp (BF.B) is down more than -4% after Citigroup downgraded the stock to sell from neutral with a price target of $27.\nBally’s Corp (BALY) is down more than -3% after Barclays downgraded the stock to underweight from equal weight with a price target of $11.\nProgressive Corp (PGR) is down more than 2% after reporting that November net premiums written fell 12% m/m.\nFortinet (FTNT) is down more than -2% after JPMorgan Chase downgraded the stock to underweight from neutral with a price target of $75.\nTexas Pacific Land Corp (TPL) is up more than +7% to lead gainers in the S&P 500 after announcing a strategic agreement with Bolt Data & Energy to develop large-scale data center campuses across TPL’s West Texas land holdings.\n\nAlbemarle (ALB) is up more than +4% to lead lithium producers higher as lithium prices continue to rise with expected demand growth.\nLumentum Holdings (LITE) is up more than +3% after Morgan Stanley raised its price target on the stock to $304 from $190.\nSalesforce (CRM) is up more than +2% to lead gainers in the Dow Jones Industrials after BTIG initiated coverage on the stock with a recommendation of buy and a price target of $335.\nGeneral Mills (GIS) is up more than +2% after reporting Q2 net sales of $4.86 billion, above the consensus of $4.79 billion.\nNetflix (NFLX) is up more than +1% as Warner Bros. Discovery plans to reject Paramount Skydance’s takeover bid due to concerns about financing and other terms.\nEarnings Reports(12/17/2025)\nGeneral Mills Inc (GIS), Jabil Inc (JBL), Micron Technology Inc (MU), Toro Co/The (TTC).\nOn the date of publication, Rich Asplund did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:17:58",
      "Source": "Reuters",
      "Title": "Exclusive-How China built its ‘Manhattan Project’ to rival the West in AI chips",
      "URL": "https://finance.yahoo.com/news/exclusive-china-built-manhattan-project-141758929.html",
      "Content": "Exclusive-How China built its ‘Manhattan Project’ to rival the West in AI chips\n\nFanny Potkin\nWed, December 17, 2025 at 6:17 AM PST 11 min read\n\nIn this article: ASML\n\nINTC\n\nSSNLF\n\nNVDA\n\nAMD\n\nBy Fanny Potkin\nSINGAPORE Dec 17 - In a high-security Shenzhen laboratory, Chinese scientists have built what Washington has spent years trying to prevent: a prototype of a machine capable of producing the cutting-edge semiconductor chips that power artificial intelligence , smartphones and weapons central to Western military dominance, Reuters has learned.\n\nCompleted in early 2025 and now undergoing testing, the prototype fills nearly an entire factory floor. It was built by a team of former engineers from Dutch semiconductor giant ASML who reverse-engineered the company's extreme ultraviolet lithography machines or EUVs, according to two people with knowledge of the project.\nEUV machines sit at the heart of a technological Cold War. They use beams of extreme ultraviolet light to etch circuits thousands of times thinner than a human hair onto silicon wafers, currently a capability monopolized by the West. ​The smaller the circuits, the more powerful the chips.\nChina's machine is operational and successfully generating extreme ultraviolet light, but has not yet produced working chips, the people said.\n\nIn April, ASML CEO Christophe Fouquet said that China would need \"many, many years\" to develop such technology. But the existence of this prototype, reported by Reuters for the first time, suggests China may be years closer to achieving semiconductor independence than analysts anticipated.\nNevertheless, China still faces ‌major technical challenges, particularly in replicating the precision optical systems that Western suppliers produce.\nThe availability of parts from older ASML machines on secondary markets has allowed China to build a domestic prototype, with the government setting a goal of producing working chips on the prototype by 2028, according to the two people.\nBut those close to the project say a more realistic target is 2030, which is still years earlier than the decade that analysts believed it would take China to match the West on chips.\n\nChinese authorities did not respond to requests for comment.\nThe breakthrough marks the culmination of a six-year government ‌initiative to achieve semiconductor self-sufficiency, one of President Xi Jinping's highest priorities. While China's semiconductor goals have been public, the Shenzhen EUV project has been conducted in secret, according to the people.\nThe project falls under the country's semiconductor strategy, which state media has identified as being run by Xi Jinping confidant Ding Xuexiang, who heads the Communist Party's Central Science and Technology Commission.\n\nStory Continues\nChinese electronics giant Huawei plays a key role coordinating a web of companies and state research institutes across the country involving thousands of engineers, according to the two people and a third source.\nThe people described it as China's version of the Manhattan Project, the U.S. wartime effort to develop the atomic bomb.\n\n“The aim is for China to eventually be able to make advanced chips on machines that are entirely China-made,” one of the people said. \"China wants the United States 100% kicked out of its supply chains.\"\nHuawei, the State Council of China, the Chinese Embassy in Washington, and China's Ministry of Industry and Information Technology did not respond to requests for comment.\nUntil now, only one company has mastered EUV technology: ASML, headquartered in Veldhoven, Netherlands. Its machines, which cost around $250 million, are indispensable for manufacturing the most advanced chips designed by companies like Nvidia and AMD—and produced by chipmakers such as TSMC, Intel, and Samsung.\nASML built its first working prototype of EUV technology in 2001, and told Reuters it took nearly two decades and billions of euros in R&D spending before it produced its first commercially-available chips in 2019.\n\n“It makes sense that companies would want to replicate our technology, but doing so is no small ⁠feat,” ASML told Reuters in a statement.\nASML's EUV systems are currently available to U.S. allies including Taiwan, South Korea, and Japan.\nStarting in 2018, the United States began pressuring ‌the Netherlands to block ASML from selling EUV systems to China. The restrictions expanded in 2022, when the Biden administration imposed sweeping export controls designed to cut off China's access to advanced semiconductor technology.\nThe controls targeted not just EUV systems but also older deep ultraviolet (DUV) lithography machines that produce less-advanced chips like Huawei’s, aiming to keep China at least a generation behind in chipmaking capabilities.\n\nThe U.S. State Department said the Trump Administration has strengthened enforcement of export controls on advanced semiconductor manufacturing equipment and is working with partners \"to close loopholes as technology advances.”\nThe Dutch Ministry of Defence said the Netherlands is developing policies requiring “knowledge institutions” to perform personnel screenings to prevent access to sensitive technology “by individuals that have ill intentions or who are at risk of being pressured.”\nExport restrictions ‍have slowed China's progress toward semiconductor self-sufficiency for years, and constrained advanced chip production at Huawei, the two people and a third person said.\nThe sources spoke on condition they not be identified due to the confidentiality of the project.\n\nCHINA'S MANHATTAN PROJECT\nOne veteran Chinese engineer from ASML recruited to the project was surprised to find that his generous signing bonus came with an identification card issued under a false name, according to one of the people, who was familiar with his recruitment.\nOnce inside, he recognized other former ASML colleagues who were also working under aliases and was instructed to use their fake names at work to maintain secrecy, the person said. Another person independently confirmed that recruits were given fake IDs to conceal their identities from other workers inside the secure facility.\nThe guidance was clear, the two people said: Classified under national security, no one outside the compound could know what they were building—or that they were there at all.\n\nThe team includes recently retired, Chinese-born former ASML engineers and scientists—prime recruitment targets because they possess sensitive technical knowledge but face fewer professional constraints after leaving the company, ​the people said.\nTwo current ASML employees of Chinese nationality in the Netherlands told Reuters they have been approached by recruiters from Huawei since at least 2020.\nHuawei did not respond to requests for comment.\nEuropean privacy laws limit ASML's ability to track former employees. Though employees sign non-disclosure agreements, enforcing them across borders has proven difficult.\nASML won an $845 million judgment in 2019 against a former Chinese engineer accused of stealing trade secrets, but the defendant filed for bankruptcy and continues to ‌operate in Beijing with Chinese government support, according to court documents.\n\nASML told Reuters that it “vigilantly guards” trade secrets and confidential information.\n\"While ASML cannot control or restrict where former employees work, all employees are bound by the confidentiality clauses in their contracts,\" the company said, and it has \"successfully pursued legal action in response to the theft of trade secrets.”\nReuters was unable to determine if any legal actions have been taken against former ASML employees involved in China’s lithography program.\nThe company said it safeguards EUV knowledge by ensuring only select employees can access the information even inside the company.\nDutch intelligence warned in an April report that China \"used extensive espionage programmes in its attempts to obtain advanced technology and knowledge from Western countries,\" including recruiting \"Western scientists and employees of high-tech companies.”\n\nThe ASML veterans made the breakthrough in Shenzhen possible, the people said. Without their intimate knowledge of the technology, reverse-engineering the machines would have been nearly impossible.\nTheir recruitment was part of an aggressive drive China launched in 2019 for semiconductor experts working abroad, offering signing bonuses that started at 3 million to 5 million yuan ($420,000 to $700,000) and home-purchase subsidies, according to a Reuters review of government policy documents.\nRecruits included Lin Nan, ASML's former head of light source technology, whose team at the Chinese Academy of Sciences' Shanghai Institute of Optics has filed eight patents on EUV light sources in 18 months, according to patent filings.\nThe Shanghai Institute of Optics and Fine Mechanics did not respond to requests for comment. Lin could not be reached for comment.\n\nTwo additional people familiar with China’s recruitment efforts said some naturalized citizens of other countries were given Chinese passports and allowed to maintain dual citizenship.\nChina officially prohibits dual citizenship and did not answer questions on issuing passports.\nChinese authorities did not respond to requests for comment.\nINSIDE CHINA'S EUV FAB\nASML's most advanced EUV systems are roughly the size of a school bus, and weigh 180 tons. After failed attempts to replicate its size, the prototype inside the Shenzhen lab became many times larger to improve its ⁠power, according to the two people.\nThe Chinese prototype is crude compared to ASML's machines but operational enough for testing, the people said.\nChina's prototype lags behind ASML's machines largely because researchers have struggled to obtain optical systems like those from Germany's Carl Zeiss AG, one of ASML's ​key suppliers, the two people said.\n\nZeiss declined to comment.\nThe machines fire lasers at molten tin 50,000 times per second, generating plasma at 200,000 degrees Celsius. The light is focused using mirrors that take months to produce, according to Zeiss' website.\nChina's top research institutes have played key roles in developing homegrown ​alternatives, according to the two people.\nThe Changchun Institute of Optics, Fine Mechanics and Physics at the Chinese Academy of Sciences (CIOMP) achieved a breakthrough in integrating extreme-ultraviolet light into the prototype's optical system, enabling it to become operational in early 2025, one of the people said, though the optics still require significant refinement.\nCIOMP did not respond to requests for comment.\nIn a March online recruitment call on its website, the institute said it was offering \"uncapped\" salaries to PhD lithography researchers and research grants worth up to 4 million yuan ($560,000) plus 1 million yuan ($140,000) in personal subsidies.\n\nJeff Koch, an analyst at research firm SemiAnalysis and a former ASML engineer, said China will have achieved \"meaningful progress” if the “light source has enough power, is reliable, and doesn’t generate too much contamination.”\n\"No doubt this is technically feasible, it's ‍just a question of timeline,\" he said. \"China has the advantage that commercial EUV now exists, so they aren't starting from zero.\"\nTo ⁠get the required parts, China is salvaging components from older ASML machines and sourcing parts from ASML suppliers through secondhand markets, the two people said.\nNetworks of intermediary companies are sometimes used to mask the ultimate buyer, the people said.\nExport-restricted components from Japan’s Nikon and Canon are being used for the prototype, one of the people and an additional source said.\n\nNikon declined to comment. Canon said it was not aware of such reports. The Japanese Embassy in Washington did not respond to a request for comment.\nInternational banks regularly auction older semiconductor fabrication equipment, the sources said. Auctions in China sold older ASML lithography equipment as recently as October 2025, according to a review of listings on Alibaba Auction, an Alibaba-owned platform.\nA team of around 100 recent university graduates is focused on reverse-engineering components from both EUV and DUV lithography machines, according to the people.\nEach worker's desk is filmed by an individual camera ⁠to document their efforts to disassemble and reassemble parts—work the people described as key to China's lithography efforts.\n\nStaffers who successfully reassemble a component receive bonuses, the people said.\nHUAWEI SCIENTISTS SLEEP ON-SITE\nWhile the EUV project is run by the Chinese government, Huawei is involved in every step of the supply chain from chip design and fabrication equipment to manufacturing and final integration into products like smartphones, according to four people familiar with Huawei’s operations.\nCEO Ren Zhengfei briefs senior Chinese leaders on progress, according to one of the people.\nThe U.S. placed Huawei on an entity list in 2019, banning American companies from ‌doing business with them without a license.\nHuawei has deployed employees to offices, fabrication plants, and research centers across the country for the effort. Employees assigned to semiconductor teams often sleep on-site and are barred from returning home during the work week, with phone access restricted for teams handling more sensitive tasks, according to the people.\nInside Huawei, few employees know the scope of this work. \"The teams are kept isolated from ‌each other to protect the confidentiality of the project,\" one of the people said. “They don't know what the other teams work on.”\n(Reporting by Fanny Potkin in Singapore, additional reporting by Alexandra Alper in Washington, editing by Ken Li and Michael Learmonth)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:00:00",
      "Source": "Business Wire",
      "Title": "Archive Intel Adds Microsoft Dynamics 365 as Integration Partner, Enabling Automatic Contact Whitelisting for MS Ecosystem Users",
      "URL": "https://finance.yahoo.com/news/archive-intel-adds-microsoft-dynamics-140000571.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nArchive Intel Adds Microsoft Dynamics 365 as Integration Partner, Enabling Automatic Contact Whitelisting for MS Ecosystem Users\n\nBusiness Wire\nWed, December 17, 2025 at 6:00 AM PST 3 min read\n\nIn this article: MSFT\n\nINTC\n\nIntegration deepens Archive Intel’s capabilities as the premier automated compliance system of record, supporting scalable mobile communications archiving and AI-driven review\nALPHARETTA, Ga., December 17, 2025 --( BUSINESS WIRE )-- Archive Intel , an AI-powered communications compliance platform for financial institutions, today announced its new integration with Microsoft Dynamics 365 , enabling users to automatically import and sync business contacts directly from the Microsoft ecosystem for compliant text-message archiving. By eliminating manual whitelisting at the individual user level, the update enhances efficiency for Microsoft Dynamics customers and reinforces Archive Intel’s position as a centralized, enterprise-grade compliance system of record for growing advisory firms.\n\nMicrosoft Dynamics 365 is a cloud-based suite of AI-driven business applications that unifies enterprise resource planning (ERP), customer relationship management (CRM) and business intelligence (BI). Connecting Archive Intel to Dynamics 365 gives firms a streamlined, automated contact-management workflow, enabling organization-wide whitelisting for text-archiving across iMessage and Android devices. With continuous syncing, firms maintain accurate, up-to-date records as client information evolves, while reducing risk from oversight gaps common with manual processes.\n\"For regulated firms, consistency and accuracy across communication records are essential, yet manual whitelisting creates unnecessary risk and operational drag,\" said Larry Shumbres , founder and CEO of Archive Intel . \"This integration solves that challenge at scale. By automating contact sync from Microsoft Dynamics, we give firms a simple, reliable and efficient way to ensure compliant text archiving across every advisor and employee.\"\n\nThe integration supports Archive Intel’s broader growth strategy to unify compliance operations across the systems advisors already use. By pulling contact data directly from a firm’s CRM or data lake, Archive Intel’s AI-driven archiving, monitoring and review tools can operate with greater precision and significantly less manual intervention. This reduces operational burden for firms and enables Archive Intel to continue expanding platform intelligence and automation capabilities.\n\"The quality of a firm’s data directly impacts the speed and accuracy of communications archival, while protecting the privacy of employees by not archiving personal messages,\" said Laura Kimble , CPO and head of AI at Archive Intel . \"Cleaner, centralized contact information allows our system to reduce false positives, accelerate review cycles and deliver a stronger, more scalable compliance foundation for every client we serve.\"\n\nStory Continues\nAdministrators with Power Platform Administrator, Dynamics 365 Administrator, or Global Administrator roles can activate the integration through a secure OAuth 2.0 connection within their Archive Intel account. Firms may set custom syncing schedules — daily, weekly or at another cadence — to maintain continuous alignment as client records change. All imported contacts populate the Organization Contacts tab, making them available platform-wide.\n\nThe Microsoft Dynamics 365 integration is available now and included at no additional cost to Archive Intel clients.\nFor more information, visit archiveintel.com .\nAbout Archive Intel\nArchive Intel is an AI-powered compliance platform built for the financial services industry. The company helps financial institutions monitor, archive, and review communications and marketing content with speed and precision. Its AI automates up to 85% of manual review tasks and reduces false positives by 99%, improving oversight while cutting operational costs. Archive Intel supports text archiving from personal devices with business contact whitelisting, social media, email, and AI marketing review in one secure, audit-ready platform.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251217317137/en/\nContacts\nMEDIA CONTACT:\narchiveintel@streetcredpr.com\nTommy Warburton\n347-400-3483\nTommy@streetcredpr.com\nLindsay McCoy\n906-322-4982\nLindsay@streetcredpr.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "00:50:06",
      "Source": "24/7 Wall St.",
      "Title": "Billionaire David Tepper Sells These 5 Stocks to Buy This 1 Stock",
      "URL": "https://finance.yahoo.com/m/4c5d007f-f956-3736-be81-1711b9f7fad0/billionaire-david-tepper.html",
      "Content": "Billionaire David Tepper Sells These 5 Stocks to Buy This 1 Stock\n\nOmor Ibne Ehsan\nTue, December 16, 2025 at 8:50 AM PST 5 min read\n\nIn this article: UNH\n\nINTC\n\nNVDA\n\nWHR\n\nVST\n\nQuick Read David Tepper sold his entire Intel (INTC) stake worth $205M despite recent government backing and Nvidia partnership.\nUnitedHealth (UNH) was Tepper’s largest sale at $780M after buying a similar amount the prior quarter.\nHe sold many other stocks, including AI ones, to buy this 1 recovery bet.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality. Read more here .\n\nDavid Tepper is one of the most successful hedge fund managers in history, with a net worth of ~$23.7 billion. He's been selling UnitedHealth ( NYSE:UNH ) , Intel ( NASDAQ:INTC ) , Alibaba ( NYSE:BABA ) , Vistra ( NYSE:VST ) , and Micron ( NASDAQ:MU ) . He's piling into a lesser-known stock instead called Whirlpool ( NYSE:WHR ) , and we'll look into why in a bit.\nTepper is the founder of Appaloosa Management and is also the proprietor of the NFL's Carolina Panthers and Charlotte FC in Major League Soccer.\nTepper is credited with playing a major role in the survival of Goldman Sachs after the 1987 stock market crash. After being passed over for a partner at Goldman Sachs twice, Tepper quit in December 1992 and created Appaloosa Management in early 1993. This hedge fund has been raking it in. It has returned roughly 25% a year since its founding.\n\nOne of his hallmark strategies is to buy up distressed stocks, especially those of companies with debt-laden balance sheets. He has successfully invested in many such stocks, and the contrarian approach paid off as the companies recovered. This is exactly what he did in 2009 and earned $7 billion by buying distressed financial stocks in February and March.\nHe's now selling many AI holdings and popular stocks, a very contrarian move. Let's take a look.\nStock #1: UnitedHealth (UNH) Tepper's largest sale for Q3 2025 was UNH. He shaved off 92% of his position, or about $780 million worth of the stock. UNH turned into a fan-favorite for hedge funds after it halved in value. After all, how can you pass on America's largest insurance business at a 50% discount?\nTepper is doing just that after buying a similar amount of shares in Q2 2025. It's unknown when he bought in Q2 2025, but if he bought at the peak, he may be just cutting his losses. If he bought the dip, the ongoing \"recovery\" may be too slow for his liking, and he's fine with the tidy profits.\n\nStock #2: Intel (INTC) Wall Street's hopes were dashed for Intel as it failed to make use of the AI headwinds... right up until the company's new CEO, Lip-Bu Tan, cozied up with the Trump administration. He's been able to secure U.S. government + SoftBank investments. Even Nvidia ( NASDAQ:NVDA ) , a \"competitor,\" partnered up with Intel with a $5 billion deal this September. This led to Intel's \"best day since 1987\".\n\nStory Continues\nTepper isn't interested.\nHe sold $205 million worth of INTC stock. That's his entire stake. Tepper likely did this to take profits as INTC stock became much more expensive. Analysts believe Intel won't be able to make a full recovery (both profits and sales-wise) this decade. Thus, Tepper likely sees the hullabaloo as premature.\n\nStock #3: Alibaba (BABA) Tepper trimmed his BABA holdings by 8.73%. Alibaba is still his largest holding and constitutes 15.61% of his portfolio, so it was still the third-largest sale, worth $110 million.\nBABA is up 75.4% in the past year, and Tepper was loading up well before the rally. He's likely just taking profits.\n\nStock #4: Vistra (VST) Vistra holdings were reduced by 30.83% in Q3, or by $109 million. He bought in Q3 and Q4 of last year and has been taking profits in Q1, Q2, and Q3.\nTepper is likely just booking profits while maintaining exposure to the AI-driven power demand thesis.\nStock #5: Micron (MU) He sold 39.39% of his MU stock, worth $54.4 million. Tepper has a long history with Micron, with multiple buys and sells dating back to 2006.\nIn Q2 2025, he more than doubled his stake and then took some profits in Q3. He still has plenty of exposure to this stock.\nThe stock he bought: Whirlpool (WHR) Tepper's biggest purchase in Q3 was increasing Appaloosa's stake in Whirlpool by a whopping 1,967%. He added $411 million to his WHR holdings, making it his third largest in one swoop. This company sells home appliances.\nWHR stock is down nearly 69% from its peak in mid-2021 and is yet to show any sign of bottoming out. What caused Whirlpool's fall? Mainly, the company has been hit by the horrible post-pandemic housing bust. Homeowners have been reluctant to move due to locked-in low-rate mortgages.\n\nIts total debt is at $8.28 billion against a market capitalization of $4.36 billion. This is a classic Tepper bet on an indebted company that is beaten down. In all likelihood, Tepper likely sees retailers reverting to buying Whirlpool items after China tariffs are fully implemented and interest rate cuts induce more homebuilding.\nData Shows One Habit Doubles American’s Savings And Boosts Retirement Most Americans drastically underestimate how much they need to retire and overestimate how prepared they are. But data shows that people with one habit have more than double the savings of those who don’t.\nAnd no, it’s got nothing to do with increasing your income, savings, clipping coupons, or even cutting back on your lifestyle. It’s much more straightforward (and powerful) than any of that. Frankly, it’s shocking more people don’t adopt the habit given how easy it is .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "00:31:00",
      "Source": "Zacks",
      "Title": "Can Intel's AI Focus Restore Its Competitive Edge & Boost Shares?",
      "URL": "https://finance.yahoo.com/news/intels-ai-focus-restore-competitive-163100510.html",
      "Content": "Can Intel's AI Focus Restore Its Competitive Edge & Boost Shares?\n\nZacks Equity Research\nTue, December 16, 2025 at 8:31 AM PST 3 min read\n\nIn this article: INTC\n\nSANS.PVT\n\nPer a Bloomberg news report , Intel Corporation ( INTC ) is in advanced talks to acquire AI start-up SambaNova Systems for about $1.6 billion. SambaNova is known for designing custom AI chips and systems. Acquiring an AI-focused company facilitates Intel with a ready-made AI architecture, software stacks and engineering talent, minimizing years of internal development time and speeding up its AI development plans.\n\nIf the deal materializes, it will help Intel to modernize its CPUs with AI chips and software, providing cloud and enterprise customers with a complete AI system. By using AI chip technology, Intel can make chips in its own factories, increasing its manufacturing strength and allowing it to attract more foundry customers.\nIntel has launched new AI-powered chips that are faster and more energy-efficient, helping the company compete better in the growing AI market. It is gaining traction in AI infrastructure as Super Micro Computer has chosen Intel’s Xeon 6 processors for its high-performance enterprise servers.\nThe company has collaborated with Cisco to build a new integrated platform that supports distributed AI workloads. NVIDIA will invest $5 billion in Intel to build advanced technologies that will shape the future of AI infrastructure. Intel is actively investing in AI and is serious about competing in the fast-growing semiconductor market, signaling a credible comeback.\n\nHow Are Competitors Faring? Intel faces competition from Advanced Micro Devices ( AMD ) and Qualcomm Incorporated ( QCOM ). Qualcomm focuses on making advanced chips for AI-powered PCs. Qualcomm launched the AI 200 and AI 250 chips to meet rising AI processing needs in data centers. HUMAIN has chosen Qualcomm’s AI200 and AI250 chips to provide high-performance AI services in Saudi Arabia and worldwide.\n\nAMD is growing its AI business by launching new MI350 series accelerators and working with major partners like Amazon, Microsoft, Meta and Oracle to deliver faster and more powerful AI systems. AMD has entered into a long-term deal with OpenAI to power large AI systems using AMD’s Instinct GPUs starting in 2026. IBM and AMD are working with Zyphra to provide powerful AI infrastructure on IBM Cloud using AMD Instinct MI300X GPUs to train advanced AI models.\nINTC’s Price Performance, Valuation and Estimates Intel has rallied 79.3% over the past year compared with the industry ’s growth of 31.1%.\n\nImage Source: Zacks Investment Research\nGoing by the price/book ratio, the company's shares currently trade at 1.53 book value, lower than 30.63 of the industry average.\n\nStory Continues\n\nImage Source: Zacks Investment Research\nEarnings estimates for 2025 have increased 128.6% to 32 cents, while those for 2026 have declined 10.7% to 59 cents over the past 60 days.\n\nImage Source: Zacks Investment Research\nIntel stock currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "00:02:21",
      "Source": "Wealth Management",
      "Title": "13 Investment Must Reads for This Week (Dec. 16, 2025)",
      "URL": "https://finance.yahoo.com/m/5c8408c0-0d3e-3b61-8e87-d25e813afdd7/13-investment-must-reads-for.html",
      "Content": "13 Investment Must Reads for This Week (Dec. 16, 2025)\n\nDavid Bodamer\nTue, December 16, 2025 at 8:02 AM PST 4 min read\n\nIn this article: CSCO\n\nINTC\n\nMSFT\n\nYou can find original article here WealthManagement . Subscribe to our free daily WealthManagement newsletters .\nBeyond the Magnificent Seven: Unlocking Value in a Concentrated Stock Market “Periods of market concentration don’t always end in a selloff, but narrow leadership can precede weaker returns. The dot-com bubble is perhaps the clearest example. Between 1997 and 2000, the share of US market capitalization held by the 10 largest stocks surged to 24% from 15%, driven by soaring valuations in technology names like Microsoft, Cisco CSCO, Intel INTC, AOL, and Yahoo.” ( Morningstar )\nLong-Duration Bonds: Poised to Regain Their Role as a Core Diversifier “Yields on long-term Treasuries, investment-grade corporates, and long-duration taxable municipals have recently climbed to levels more in line with historical averages, moving past the artificially low environment that followed the global financial crisis. Despite this increase, several factors suggest that these yields could decline over the medium term.” ( Dividend.com )\nInside the Invitation-Only Stock Market for the Wealthy “The ultrawealthy are able to buy and sell shares of the buzziest private companies via invite-only transactions long before they list their shares on public stock exchanges. That’s created a two-tier market. One tier is a private club of sorts, where a privileged group can obtain shares of companies still in their early growth stages. Everyone else is left with older, slower-growing names.” ( WSJ )\nSEC’s Democratization of Alts is ‘Irresponsible’: Crenshaw “The Securities and Exchange Commission's efforts to create greater access to private market investment strategies in the retail channel is an ‘irresponsible departure from foundational pillars of the securities laws,’ SEC Commissioner Caroline Crenshaw said in a speech Thursday.” ( FundFire )\nHidden Fees, Hidden Dangers: Why a House-Passed Plan Threatens Investor Protection “This so-called small-business provision would permit mutual funds, closed-end funds, and other registered investment companies to omit from their fee tables the costs they incur when investing in business-development companies, or BDCs. This creates a dangerous precedent, allowing complex, fee-laden investment vehicles to be hidden from the comprehensive cost disclosure that has been a cornerstone of investor protection since the Investment Company Act of 1940 was signed into law.” ( Morningstar )\nAlts in DC Lineups Gain Traction Among Plan Advisers “One-quarter of defined contribution plan advisers are likely to recommend the inclusion of alternative investments in defined contribution plans following the Department of Labor’s August policy shift, and another 10% already do so, according to Escalent’s ‘2025 Retirement Plan Advisors Trends’ report.” ( Planadviser )\nWhose Inflation Is This? “The Inflation surge was visible to anyone looking at the impact of the single largest fiscal stimulus since World War 2. The point of all this is simply that we should be honest about what happened then, and transparent about the impact of the pandemic on higher prices today.” ( The Big Picture )\nPublic is going private and private is going public “This convergence has been underway for years, but perhaps there are few better signals of this trend than Larry Fink, the CEO and Chairman of the world’s largest asset manager, making it clear in his Annual Chairman’s Letter to Investors that BlackRock is no longer just a traditional asset manager.” ( Alt Goes Mainstream )\nGetting Stronger “Put another way, while fees were predictive then, they weren’t as decisive as they’ve become in recent years. That is, fees appear to be getting stronger as a predictor of differences in funds’ performance.” ( Basis Pointing )\nAres CEO Questions the Value of Retail Partnerships “Arougheti said he remains unconvinced that combining traditional and alternative products through partnerships delivers a better proposition for retail investors. The firm has, though, explored multiple potential collaborations, Bloomberg reports.” ( FundFire )\nPrivate Credit ETFs 101: Business Development Companies “These ‘companies’ are more akin to an investment fund or hedge fund than they are a traditional company. They don’t make anything, and they don’t provide any services to customers. Instead, they provide financing to middle market companies and generate their returns based on two broad segments, private equity stakes and private credit debt instruments.” ( ETF.com )\nHigh-Speed Traders Are Feuding Over a Way to Save 3.2 Billionths of a Second “The controversy is about an arcane technical maneuver in which high-speed traders bombard Frankfurt-based Eurex with useless data. The idea is to keep their connections to the exchange warm so they can react fractionally faster to market-moving information.” ( WSJ )\nBlackstone’s BCRED Reports Record Fundraising, Increased Share Repurchases “While fundraising has been strong, the demand for share repurchases has also increased. Fourth-quarter repurchases were estimated to be approximately 4.5% of shares outstanding as of Sept. 30. In the letter, BCRED confirmed it will honor all tenders for the latest quarterly repurchase period, which concluded on Dec. 2.” ( AltsWire )\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "23:07:57",
      "Source": "Simply Wall St.",
      "Title": "ACM Research (ACMR): Valuation Check After Ultra Lith Baker Delivery and Intel Process Tool Validation",
      "URL": "https://finance.yahoo.com/news/acm-research-acmr-valuation-check-150757412.html",
      "Content": "ACM Research (ACMR): Valuation Check After Ultra Lith Baker Delivery and Intel Process Tool Validation\n\nSimply Wall St\nTue, December 16, 2025 at 7:07 AM PST 3 min read\n\nIn this article: ACMR\n\nINTC\n\nACM Research (ACMR) just hit two important milestones, delivering its first Ultra Lith Baker system into high volume display manufacturing and seeing its chipmaking tools tested in Intel’s advanced process lines.\nSee our latest analysis for ACM Research.\nThose wins seem to be feeding into the story in the share price, with a roughly 20% 1 month share price return and a powerful 3 year total shareholder return of more than 300% suggesting momentum is still very much on ACMR’s side.\n\nIf this kind of momentum has your attention, it could be worth seeing what else is moving and exploring high growth tech and AI stocks as potential next candidates for your watchlist.\nWith the stock up more than 140% over the past year and now trading close to analyst targets, investors face a key question: Is ACMR still mispriced after its recent wins, or is the market already discounting its future growth?\nMost Popular Narrative: 7.6% Undervalued With ACM Research last closing at $37.73 against a narrative fair value of about $40.81, the story points to modest upside still on the table.\nRead the complete narrative.\nWant to see what kind of growth and profitability path could justify that higher value? The narrative leans on ambitious expansion, steady margins, and a disciplined earnings multiple. Curious how those moving parts add up to this target?\nResult: Fair Value of $40.81 (UNDERVALUED)\n\nHave a read of the narrative in full and understand what's behind the forecasts.\nHowever, several risks could derail that upside, including tighter U.S. export controls on China and slower than expected margin recovery from heavy R&D spending.\nFind out about the key risks to this ACM Research narrative.\nAnother Angle on Valuation Our DCF model paints a less generous picture, with a fair value estimate of about $30.14, below today’s $37.73 price, suggesting ACM Research may be overvalued on cash flow assumptions. Is the current optimism leaning too hard on growth and margin resilience?\nLook into how the SWS DCF model arrives at its fair value.\nSimply Wall St performs a discounted cash flow (DCF) on every stock in the world every day ( check out ACM Research for example ). We show the entire calculation in full. You can track the result in your watchlist or portfolio and be alerted when this changes, or use our stock screener to discover 906 undervalued stocks based on their cash flows . If you save a screener we even alert you when new companies match - so you never miss a potential opportunity.\n\nStory Continues\nBuild Your Own ACM Research Narrative If you see the story playing out differently, or simply want to dig into the numbers yourself, you can build a custom view in minutes: Do it your way\nA good starting point is our analysis highlighting 4 key rewards investors are optimistic about regarding ACM Research.\nLooking for more investment ideas? Do not let a single stock define your strategy when there are targeted ideas right at your fingertips. Use the Simply Wall Street Screener to uncover new opportunities.\nLock in potential income streams by targeting these 13 dividend stocks with yields > 3% that can help anchor your portfolio during volatile markets.\nRide the secular growth wave by focusing on these 26 AI penny stocks positioned at the heart of automation, data intelligence, and next generation software.\nPosition yourself early in emerging innovations by analysing these 28 quantum computing stocks that could reshape computing, cybersecurity, and complex problem solving.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include ACMR .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "18:43:05",
      "Source": "GuruFocus.com",
      "Title": "Intel Names Trump Economic Adviser to Lead Government Affairs",
      "URL": "https://finance.yahoo.com/news/intel-names-trump-economic-adviser-104305542.html",
      "Content": "Intel Names Trump Economic Adviser to Lead Government Affairs\n\nFaizan Farooque\nTue, December 16, 2025 at 2:43 AM PST 1 min read\n\nIn this article: INTC\n\nSANS.PVT\n\nCDNS\n\nOPAI.PVT\n\nCSCO\n\nThis article first appeared on GuruFocus .\nIntel ( INTC , Financials ) named Robin Colwell, a top economic advisor to President Donald Trump , as its director of government relations on Monday, deepening its links with Washington.After Bruce Andrews left after the November U.S. elections, Colwell, a deputy assistant to the president and deputy director of the National Economic Council, would fill the job. Under Obama, Andrews worked in the Commerce Department.\n\nWarning! GuruFocus has detected 9 Warning Signs with INTC.\nIs INTC fairly valued? Test your thesis with our free DCF calculator.\nMonths after the U.S. government bought a 10% interest in Intel, the nomination underscores its strategic relevance to domestic chip production and national security.Intel also promoted James Chew vice president of Intel Government Technologies, which manages its U.S. government business. Former Intel CEO Lip-Bu Tan employed Chew at Cadence Design Systems.Annie Shea Weckesser became Intel's CMO. She worked for Cisco Systems and Tan-backed startup SambaNova Systems.Following Sachin Katti's departure to OpenAI, Tan's chief of staff Pushkar Ranade became acting chief technology officer.\nInvestors will examine Intel's government strategy and long-term performance after leadership changes.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "08:35:00",
      "Source": "Motley Fool",
      "Title": "Intel Is Eyeing an AI Acquisition. Its Track Record Isn't Great.",
      "URL": "https://finance.yahoo.com/m/741c9dd1-8c7b-34e4-aeaa-923a2b8a0340/intel-is-eyeing-an-ai.html",
      "Content": "Intel Is Eyeing an AI Acquisition. Its Track Record Isn't Great.\n\nTimothy Green, The Motley Fool\nMon, December 15, 2025 at 4:35 PM PST 4 min read\n\nIn this article: SANS.PVT\n\nINTC\n\nKey Points Intel is reportedly in talks to acquire AI start-up SambaNova.\nSambaNova designs custom AI chips and rack-scale systems for efficient AI inference workloads.\nAn acquisition would accelerate Intel's AI strategy shift.\n10 stocks we like better than Intel ›\nChip giant Intel (NASDAQ: INTC) is reportedly in talks to potentially acquire SambaNova Systems, an AI start-up that was once valued at $5 billion. The rumored price tag is much lower at $1.6 billion, according to Bloomberg.\n\nSambaNova is focused on enabling fast and efficient AI inference . The company develops custom AI chips, which it refers to as Reconfigurable Dataflow Units, or RDUs. Those RDUs are used in the company's SambaRack, which combines hardware, networking, and software into a complete rack-scale solution. SambaNova also offers a cloud AI platform powered by its hardware.\nThe last AI acquisition didn't pan out SambaNova would not be Intel's first large AI-related acquisition. In 2019, well before ChatGPT sparked the AI boom, Intel paid approximately $2 billion for Habana Labs. Habana's core product was the Gaudi AI training processor, which was being sampled with large hyperscalers at the time of the acquisition.\n\nUnder Intel's ownership, Gaudi 2 and Gaudi 3 were eventually launched. While the chips provided solid performance and efficiency, Intel was unable to gain any meaningful traction. Nvidia and its GPUs ultimately won the battle for AI training supremacy. The Gaudi line of chips had an unfamiliar architecture and an immature software ecosystem , which contributed to their lackluster sales.\nAnother factor was a scatterbrained approach to AI chips. Intel was simultaneously developing Habana's Gaudi chips and data center GPUs aimed at AI workloads. Neither strategy worked. Intel eventually scrapped Falcon Shores, a data center GPU that incorporated some of Gaudi's technology, effectively ending its attempt to break into the AI training market.\n\nThe failure of the Habana Labs acquisition wasn't entirely Intel's fault. Nvidia's proprietary CUDA platform, which supports only the company's GPUs, has become the industry standard for accelerated computing over the course of nearly two decades. CUDA and the mature software ecosystem built around it gave Nvidia a critical advantage.\nThis time could be different If Intel ultimate acquires SambaNova, the deal could turn out differently for the chip giant. For starters, SambaNova is already a portfolio company for Intel Capital, the company's venture capital arm. Intel CEO Lip-Bu Tan is also SambaNova's Chairman.\n\nStory Continues\nWhile Habana Labs was focused on AI training chips, SambaNova sells complete AI inference solutions. There's likely no beating Nvidia in the AI training market at this point, but the AI inference market is far more competitive. Efficiency is just as important as raw performance, and that's where custom chips like SambaNova's can shine. And because SambaNova sells rack-scale AI inference solutions that can be easily slotted into AI datacenters rather than just chips, the company has found some success winning over customers.\n\nIn October, SambaNova announced that it had won three deals to use its systems to power sovereign AI inference clouds in Australia, Europe, and the United Kingdom . In November, the company was selected by French cloud computing company OVHcloud to power its AI Endpoints solution along with GPU-based systems.\nShifting focus to rack-scale AI solutions aligns with Intel's latest AI strategy. When the company cancelled Falcon Shores earlier this year, it noted that it would pursue a rack-scale AI strategy by developing fully integrated systems that could be installed in data centers. Acquiring SambaNova is one way to accelerate that process, although it's unclear what an acquisition would mean for Jaguar Shores, the successor to Falcon Shores.\n\nIntel does not have a great track record with acquisitions, particularly AI acquisitions. However, the acquisition of SambaNova would make a lot of sense given the company's focus on AI inference and rack-scale solutions, as well as its exit from the AI training market. There's no telling when or if a deal will be announced, but acquiring SambaNova would be a reasonable way for Intel to gain ground in the AI infrastructure market.\nShould you invest $1,000 in Intel right now? Before you buy stock in Intel, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Intel wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $513,353 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,072,908 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 965 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nTimothy Green has positions in Intel. The Motley Fool has positions in and recommends Intel and Nvidia. The Motley Fool has a disclosure policy .\nIntel Is Eyeing an AI Acquisition. Its Track Record Isn't Great. was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "06:30:54",
      "Source": "Motley Fool",
      "Title": "Stock Market Today, Dec. 15: Nvidia Gains on Reports of Strong H200 Demand From China",
      "URL": "https://finance.yahoo.com/m/7038ae5f-444d-3447-85c7-6545dc849c92/stock-market-today%2C-dec.-15%3A.html",
      "Content": "Stock Market Today, Dec. 15: Nvidia Gains on Reports of Strong H200 Demand From China\n\nJeff Santoro, The Motley Fool\nMon, December 15, 2025 at 2:30 PM PST 2 min read\n\nIn this article: NVDA\n\n^GSPC\n\nINTC\n\n^IXIC\n\nAMD\n\nNvidia (NASDAQ:NVDA) , a leading GPUs and AI solutions developer, closed Monday’s session at $176.29, up 0.73%. Trading volume reached 163 million shares, nearly 15% below its three-month average of 191 million shares.\nHow the markets moved today Monday’s move followed premarket reports of stronger H200 demand from China and fresh coverage of Nvidia’s Nemotron 3 open-source AI models. Investors are watching how AI infrastructure spending holds up against valuation and policy risks. The S&P 500 (SNPINDEX:^GSPC) slipped 0.16% to 6,816, while the Nasdaq Composite (NASDAQINDEX:^IXIC) fell 0.59% to 23,057. Within Semiconductors, industry peers Advanced Micro Devices (NASDAQ:AMD) and Intel (NASDAQ:INTC) lost 1.52% and 0.79%, respectively, as traders weighed AI server demand against rising competitive pressures.\n\nWhat this means for investors Today, the market received welcome news that demand for H200 chips to be sold to China might be robust enough to increase output for this chip, now that U.S. export approvals have been secured. Monday also saw news that Nvidia plans to acquire the AI software firm SchedMD, which supplies software that can help AI data centers operate more efficiently. Investors are hoping these new items might help reinforce Nvidia's AI leadership and could start to reverse the 17% pullback the stock has seen recently.\n\nEarlier this year, Nvidia's Q3 2026 results featured overall revenue growth of 62% with data center revenue growing even faster at 66%, year over year.\nDon’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $453,954 !*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $52,940 !*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $513,353 !*\nRight now, we’re issuing “Double Down” alerts for three incredible companies , available when you join Stock Advisor , and there may not be another chance like this anytime soon.\nSee the 3 stocks »\n*Stock Advisor returns as of December 15, 2025\nJeff Santoro has positions in Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Intel, and Nvidia. The Motley Fool has a disclosure policy .\nStock Market Today, Dec. 15: Nvidia Gains on Reports of Strong H200 Demand From China was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "06:24:49",
      "Source": "Reuters",
      "Title": "Intel appoints Trump economic adviser as head of government affairs",
      "URL": "https://finance.yahoo.com/news/intel-appoints-trump-economic-adviser-222449313.html",
      "Content": "Intel appoints Trump economic adviser as head of government affairs\n\nStephen Nellis\nUpdated Mon, December 15, 2025 at 2:55 PM PST 1 min read\n\nIn this article: INTC\n\nCDNS\n\nSANS.PVT\n\nCSCO\n\nBy Stephen Nellis\nSAN FRANCISCO, Dec 15 (Reuters) - Intel ( INTC ) on Monday appointed an economic adviser to ​U.S. President Trump as its head of government ‌affairs, months after the U.S. government took a 10% stake ‌in the U.S. chipmaker.\nIntel said that Robin Colwell, deputy assistant to the president and deputy director of the National Economic Council, has been appointed to head its ⁠government affairs office. ‌The position had been vacant after Bruce Andrews, who had worked in the ‍Commerce Department under then-President Barack Obama, left Intel after November's U.S. elections.\n\nIntel also on Monday appointed James Chew as vice president of Intel Government ​Technologies, the unit that oversees its business with ‌the U.S. government after the departure of Intel veteran Christopher George earlier this year. Chew worked at Cadence Design Systems, where Intel CEO Lip-Bu Tan was previously chief executive.\n\nIntel also appointed Annie Shea Weckesser, a ⁠Cisco Systems veteran who most ​recently worked at SambaNova Systems, ​a chip startup where Tan is an investor through his extensive venture capital holdings, as ‍chief marketing ⁠and communications officer.\nPushkar Ranade, Tan's chief of staff, was appointed interim chief technology officer. Intel's former ⁠technology chief Sachin Katti left the company to join ChatGPT creator ‌ OpenAI last month.\n(Reporting by Stephen Nellis in San ‌FranciscoEditing by Nick Zieminski)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "00:58:47",
      "Source": "GuruFocus.com",
      "Title": "Intel Corp (INTC) Q1 2025 Earnings Call Highlights: Surpassing Expectations Amidst Challenges",
      "URL": "https://finance.yahoo.com/news/intel-corp-intc-q1-2025-165847385.html",
      "Content": "Intel Corp (INTC) Q1 2025 Earnings Call Highlights: Surpassing Expectations Amidst Challenges\n\nGuruFocus News\nMon, December 15, 2025 at 8:58 AM PST 4 min read\n\nIn this article: INTC\n\nThis article first appeared on GuruFocus .\nRevenue: $12.7 billion, at the high end of guidance range.\nNon-GAAP Gross Margin: 39.2%, approximately 3 percentage points above guidance.\nEarnings Per Share (EPS): $0.13, versus guidance of breakeven EPS.\nOperating Cash Flow: $800 million.\nGross Capital Expenditure (CapEx): $6.2 billion, with offsets of $1.7 billion.\nAdjusted Free Cash Flow: Negative $3.7 billion.\nCash Balance: $21 billion.\nIntel Products Revenue: $11.8 billion, down 10% sequentially.\nIntel Foundry Revenue: $4.7 billion, up 8% sequentially.\nOperating Profit for Intel Products: $2.9 billion, 25% of revenue.\nIntel Foundry Operating Loss: $2.3 billion, roughly flat quarter over quarter.\nAll Other Revenue: $943 million, down 15% sequentially.\nOpEx Target for 2025: $17 billion.\nOpEx Target for 2026: $16 billion.\nGross CapEx Target for 2025: $18 billion.\nQ2 Revenue Guidance: $11.2 billion to $12.4 billion.\nQ2 Gross Margin Guidance: Approximately 36.5%.\nQ2 EPS Guidance: Breakeven.\n\nWarning! GuruFocus has detected 9 Warning Signs with INTC.\nIs INTC fairly valued? Test your thesis with our free DCF calculator.\nRelease Date: April 24, 2025\nFor the complete transcript of the earnings call, please refer to the full earnings call transcript .\nPositive Points Intel Corp ( NASDAQ:INTC ) delivered revenue, gross margins, and EPS above their guidance for Q1 2025.\nThe company is taking swift actions to simplify operations, reduce bureaucracy, and empower smaller teams for faster decision-making.\nIntel Corp ( NASDAQ:INTC ) is focusing on revitalizing its engineering talent pool by promoting strong leaders internally and recruiting new talent.\nThe company is committed to reducing operational expenses, targeting $17 billion in 2025 and $16 billion in 2026.\nIntel Corp ( NASDAQ:INTC ) is making strategic adjustments to its product roadmap to optimize for emerging AI workloads and ensure on-time delivery.\n\nNegative Points Intel Corp ( NASDAQ:INTC ) faces ongoing macroeconomic uncertainty, including shifting trade policies and persistent inflation.\nThe company acknowledges that organizational complexity and bureaucracies have been hindering innovation and agility.\nIntel Corp ( NASDAQ:INTC ) anticipates a potential economic slowdown, with the probability of a recession growing.\nThe company is experiencing capacity constraints in Intel 7, which are expected to persist for the foreseeable future.\nIntel Corp ( NASDAQ:INTC ) is facing competitive pressure in its core markets, impacting product mix and margins.\n\nQ & A Highlights Q : How is Intel balancing the internal product roadmap with the foundry side of things, especially with the need to fill Intel's own foundry? A : Lip-Bu Tan, CEO, explained that Intel is focusing on flattening the organization to improve product delivery and customer solutions. The priority is to focus on key products and ensure they meet customer requirements. For the foundry, Intel is concentrating on improving yield and reliability, particularly with the 18A process for Panther Lake.\n\nStory Continues\nQ : Can you discuss the puts and takes on gross margin for 2025 and 2026, considering strategic changes and cost-cutting measures? A : David Zinsner, CFO, noted that the industry is dynamic due to tariffs and macroeconomic factors. Intel expects a mix shift towards Lunar Lake, which has margin pressures. The ramp-up of 18A will also impact margins. However, Panther Lake, expected to ramp in 2026, should improve margins due to better product economics and internal wafer production benefits.\n\nQ : What is Intel's approach to announcing new third-party foundry customers, and is there potential to add a Tier 1 customer soon? A : Lip-Bu Tan, CEO, emphasized that the priority is ramping internal customers like Panther Lake and building trust with foundry customers. Intel is focusing on process technology improvements and customer service to optimize solutions for different design methodologies.\nQ : How is Intel addressing the demand for older generation products like Raptor Lake versus newer ones like Meteor Lake and Lunar Lake? A : Michelle Holthaus, CEO of Intel Products, explained that the demand for older products is driven by macroeconomic factors and consumer price sensitivity. Raptor Lake offers a better price point for OEMs, while newer products have higher costs. Intel is balancing this demand with investments in AI PC and future products like Panther Lake.\nQ : What is Intel's strategy for AI, particularly in terms of workload optimization and architecture? A : Lip-Bu Tan, CEO, stated that Intel is focusing on understanding AI workloads and partnering with industry leaders to optimize silicon and software. The strategy includes exploring new architectures for edge and inference applications, aiming for low power and high efficiency.\nFor the complete transcript of the earnings call, please refer to the full earnings call transcript .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 13
}