{
  "stock_id": "INTC",
  "last_updated": "2025-12-23T22:11:45.058Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-24",
      "Time": "04:05:00",
      "Source": "Zacks",
      "Title": "Forget NVDA: 2 AI Stocks Crushing it in 2025 With More Upside Ahead",
      "URL": "https://finance.yahoo.com/news/forget-nvda-2-ai-stocks-200500174.html",
      "Content": "Forget NVDA: 2 AI Stocks Crushing it in 2025 With More Upside Ahead\n\nTirthankar Chakraborty\nTue, December 23, 2025 at 12:05 PM PST 3 min read\n\nIn this article: NVDA\n\nAMD\n\nINTC\n\nMU\n\nBBAI\n\nShares of the most sought-after tech stock on Wall Street, NVIDIA Corporation NVDA, have surged 36.6% this year amid the artificial intelligence (AI) boom. Ongoing demand for NVIDIA’s CUDA software platform, along with its competitive advantage in the AI hardware market, fueled growth. Demand for NVIDIA’s Blackwell chips remains strong, and the company plans to ship H200 AI chips to China ahead of the Lunar New Year holiday.\n\nHowever, escalating U.S.-China trade tensions remain a risk and could pose a meaningful threat to NVIDIA’s future growth trajectory. NVIDIA also faces intensifying competition from rivals, including Advanced Micro Devices, Inc . AMD and Intel Corporation INTC, as data center capital expenditures continue to rise.\nTherefore, investors may look beyond NVIDIA at stocks that have outperformed it this year and still offer upside as the AI boom continues. Notable among them are Micron Technology, Inc . MU and BigBear.ai Holdings, Inc . BBAI, whose shares have gained 228.8% and 43.6%, respectively, this year. Let’s take a closer look at why these stocks are compelling buys.\n\nImage Source: Zacks Investment Research\nReasons to Be Bullish on Micron Strong demand for Micron’s high-bandwidth memory (HBM) chips is expected to help the company deliver strong quarterly results. These chips have the inherent capacity to reduce power consumption and process large volumes of data. With AI infrastructure rapidly expanding, demand for HBM chips has accelerated.\n\nBanking on rising AI-led demand for HBM chips, Micron expects its revenues for the second quarter of fiscal 2026 to come in between $18.3 billion and $19.1 billion. The company reported revenues of $13.64 billion for the fiscal first quarter, up 56.8% year over year, according to investors.micron.com. Analysts had projected revenues of around $12.88 billion.\nMicron expects earnings per share (EPS) of $8.22 to $8.62 for the fiscal second quarter, with its cloud memory business unit expected to perform particularly well. Micron’s expected earnings growth rate for the next year is a solid 23.5%.\nReasons to Be Bullish on BigBear.ai BigBear.ai’s shares were adversely impacted at the beginning of the year due to the Trump administration’s move to curb federal spending. Reduced funding may have affected BigBear.ai’s sales, but its top-line performance is expected to improve going forward, supported by the definitive $250 million agreement to acquire Ask Sage.\n\nAsk Sage is a fast-growing generative AI platform that has seen broad adoption, with users including the U.S. Space Force and the Defense Health Agency. It is designed for secure AI deployment in restricted fields such as defense and national security, according to ir.bigbear.ai. Ask Sage serves 100,000 users across 16,000 government teams, and with its acquisition, BigBear.ai expects full-year sales to reach $125 million to $140 million.\n\nStory Continues\nMoreover, Trump’s “big, beautiful bill” could drive future growth for BigBear.ai, while the company’s robust cash position provides ample resources to support its expansion. The company reached a significant milestone toward profitability in the third quarter, and its expected earnings growth rate for the next year is a stellar 73.1%.\n\nWhile BigBear.ai has a Zacks Rank #2 (Buy), Micron sports a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks Rank #1 stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nMicron Technology, Inc. (MU) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nBigBear.ai Holdings, Inc. (BBAI) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "04:00:00",
      "Source": "Zacks",
      "Title": "Quantum Enablers Poised for 40% Plus Growth in 2026: INTC, AVGO & TER",
      "URL": "https://finance.yahoo.com/news/quantum-enablers-poised-40-plus-200000520.html",
      "Content": "Quantum Enablers Poised for 40% Plus Growth in 2026: INTC, AVGO & TER\n\nUrmimala Biswas\nTue, December 23, 2025 at 12:00 PM PST 4 min read\n\nIn this article: QBTS\n\nLMT\n\nINTC\n\nAVGO\n\nIONQ\n\nThe pure quantum hardware sector, featuring companies like IonQ and D-Wave, has garnered significant attention. These firms have made tangible progress, securing government contracts, enterprise pilots and cloud integrations. Analysts characterize these pure plays as long-term prospects with growth potential but not guaranteed near-term earnings drivers for 2026.\n\nHowever, this does not mean that quantum offers no near-term investment opportunity. Instead, the more compelling path lies in quantum enablers - companies already generating revenues today by supplying the infrastructure, semiconductors, testing tools, cloud platforms and security frameworks required for quantum adoption at scale.\nSo, if the goal is to participate in quantum’s growth story with measurable financial outcomes in 2026, it makes sense to look beyond the flagship hardware makers and toward the ecosystem enabling quantum adoption today.\nHere in this article, we have discussed three such quantum computing enablers, Intel INTC, Broadcom AVGO and Teradyne TER, which are projected to report more than 40% earnings growth in 2026.\nThe Enabler Advantage: Real Revenues, Not Future Promises At present, several established semiconductor and enterprise technology companies are positioned to benefit from quantum development while being simultaneously projected to report solid earnings growth in 2026.\nAdvanced Micro Devices AMD, for example, is collaborating with IBM on hybrid high-performance computing and quantum workloads, leveraging its CPUs and accelerators within quantum-adjacent systems. The Zacks Consensus Estimate for AMD suggests roughly 58% earnings growth in 2026, driven primarily by data center demand rather than speculative quantum revenues.\n\nPost-Quantum Cryptography: Demand is Already Here Perhaps the most immediate quantum-linked opportunity lies in post-quantum cryptography. Governments and enterprises are racing to secure data against future quantum decryption risks, often referred to as “Q-Day.” Industry research and regulatory guidance increasingly emphasize early migration to quantum-resilient encryption standards.\n\nSEALSQ Corp. illustrates this trend. The company has commercialized secure chips with embedded post-quantum cryptography and expanded partnerships in defense and critical infrastructure, demonstrating real-world adoption rather than experimental pilots. The stock is projected to report 66.7% earnings growth in 2026.\nIn 2025, Lockheed Martin LMT advanced its role as a quantum enabler by moving quantum technologies closer to real defense applications, including a U.S. Department of Defense Innovation Unit contract to prototype a quantum-enabled inertial navigation system (QuINS) that can operate without GPS, in partnership with Q-CTRL and AOSense. The stock is projected to report 34.8% earnings growth in 2026.\n\nStory Continues\n2025 Stock Comparison of Quantum Enablers\nImage Source: Zacks Investment Research\n3 Quantum Computing Enablers With Strong Growth Potential Intel : Its positioning as a quantum enabler rests on continued progress in scaling qubit counts and improving device performance using its legacy CMOS manufacturing infrastructure. By applying its 300 mm fabrication techniques to silicon spin qubits, Intel expects to incrementally increase qubit connectivity and fidelity, essential steps toward larger, more uniform qubit arrays while refining control and interconnect technologies. Continued collaboration with research institutions in 2026 should further accelerate collective understanding of qubit behavior and materials interface challenges, helping Intel contribute to the broader quantum ecosystem even as commercial fault-tolerant systems remain on a multi-year horizon.\n\nIntel, a Zacks Rank #3 (Hold) stock, is expected to report earnings growth of 83.4% in 2026 on revenue growth of 3.3%. The stock has skyrocketed 81.4% in 2025.\nBroadcom : In 2025, Broadcom strengthened its position as a quantum enabler by embedding post-quantum cryptography (PQC) into enterprise networking and storage products, turning future quantum security risks into near-term demand. The company rolled out quantum-safe Fibre Channel and SAN solutions, including Emulex secure host bus adapters and Brocade Gen 8 Fibre Channel platforms, which integrate PQC and 256-bit encryption to protect data in motion across mission-critical infrastructure.\nIn 2026, Broadcom is positioned to benefit from rising demand for quantum-resilient infrastructure, driven by regulatory mandates such as CNSA 2.0, NIS2 and DORA and growing AI-led data center workloads, enabling quantum-linked growth without dependence on commercial quantum computers.\n\nBroadcom, a Zacks Rank #3 stock, is expected to report earnings growth of 42.5% in fiscal 2026 (ending October 2026) on revenue growth of 44.8%. The stock has gained 47.3% in 2025.\nTeradyne : In 2025, Teradyne strengthened its role as a quantum enabler by expanding its photonics and semiconductor test capabilities, highlighted by its acquisition of Quantifi Photonics, a specialist in photonic integrated circuit (PIC) testing.\nThe deal enhances Teradyne’s ability to deliver scalable PIC test solutions essential for optical interconnects used in high-performance and hybrid computing systems. Teradyne also introduced a high-volume, double-sided wafer probe test cell for silicon photonics with ficonTEC, supporting advanced electro-optical testing. These investments position Teradyne to benefit from rising demand for photonics, AI infrastructure, and high-performance computing test solutions, which underpin future quantum-adjacent ecosystems.\n\nTeradyne, a Zacks Rank #2 (Buy) stock, is expected to report earnings growth of nearly 45% in 2026 on revenue growth of 22%. The stock has gained 56.7% in 2025. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\nIntel Corporation (INTC) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nTeradyne, Inc. (TER) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "22:50:04",
      "Source": "Zacks",
      "Title": "Are You a Momentum Investor? This 1 Stock Could Be the Perfect Pick",
      "URL": "https://finance.yahoo.com/news/momentum-investor-1-stock-could-145004580.html",
      "Content": "Are You a Momentum Investor? This 1 Stock Could Be the Perfect Pick\n\nZacks Equity Research\nTue, December 23, 2025 at 6:50 AM PST\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "20:10:00",
      "Source": "GlobeNewswire",
      "Title": "Global AI Chips Market Analysis Report 2025-2035 Featuring Profiles of Key Players - Amazon, Gyrfalcon Technology, Huawei Technologies, Intel, Nvidia, NXP Semiconductors, Wave Computing and More",
      "URL": "https://finance.yahoo.com/news/global-ai-chips-market-analysis-121000895.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nGlobal AI Chips Market Analysis Report 2025-2035 Featuring Profiles of Key Players - Amazon, Gyrfalcon Technology, Huawei Technologies, Intel, Nvidia, NXP Semiconductors, Wave Computing and More\n\nResearch and Markets\nTue, December 23, 2025 at 4:10 AM PST 4 min read\n\nIn this article: AMZN\n\nINTC\n\nNVDA\n\nNXPI\n\nRapid growth in cloud processing and system-on-chip technology underline significant growth potential\nDublin, Dec. 23, 2025 (GLOBE NEWSWIRE) -- The \"AI Chip Market, Till 2035: Distribution by Type of Chip, Type of Processing, Type of Technology, Type of Function, Type of Application, Type of End-User, Type of Enterprise and Geographical Regions: Industry Trends and Global Forecasts\" has been added to ResearchAndMarkets.com's offering.\n\nThe global AI chip market is experiencing remarkable expansion, projected to soar from USD 31.6 billion in the current year to an impressive USD 846.8 billion by 2035. This equates to a CAGR of 34.84% during the forecast period.\nIn alignment with emerging market trends, 64% of companies believe AI will significantly boost productivity, underscoring its vital role in sectors like healthcare, finance, automotive, and telecommunications. The increasing demand for AI-driven efficiency and innovation is further accentuated by projections that suggest one in ten vehicles will be self-driving by 2030.\nThe AI chip market is pivotal in the global shift towards increased technological efficiency and digital transformation, with natural language processing and machine learning being instrumental in realizing its potential. Innovations from leading players, like NVIDIA's advanced GPUs and Intel's Gaudi processors, facilitate real-time decision-making.\n\nNoteworthy is Cerebras Systems' September 2024 release of its latest AI chip, the Cerebras Inference, touted as 20 times faster than NVIDIA's GPUs with over 4 trillion transistors on a single chip. Technological advancements and escalating investor interest are expected to sustain the healthy growth trajectory of the AI chip market throughout the forecast period.\nAI CHIP MARKET: KEY SEGMENTS\nType of Chip: Dominated by CPUs due to extensive use in data centers and edge devices. ASICs anticipated to grow faster.\nProcessing Type: Cloud processing leads with scalability and efficiency, but edge processing is set for faster growth.\nTechnology Type: System on Chip (SoC) leads due to integration capability, set for higher growth.\nFunction Type: Inference chips hold the majority, driven by AI-enhanced operations, with growth expected.\nApplication: Computer vision dominates, crucial for industry automation, poised for growth.\nEnd-Users: Healthcare leads, spurred by AI in patient data and diagnostics, with automotive rising rapidly.\nEnterprise Type: Large enterprises currently dominate, but SMEs are projected for higher growth.\nGeographical Regions: North America leads due to major tech firms and infrastructure, with Asia set for accelerated growth.\n\nStory Continues\nAI CHIP MARKET: RESEARCH COVERAGE\nMarket Sizing and Opportunity Analysis: Detailed exploration of key market segments including chip types and regions.\nCompetitive Landscape: Comprehensive company analysis based on size, structure, and location.\nCompany Profiles: Profiles of key players, highlighting missions, teams, and developments.\nMegatrends: Examination of ongoing industry trends.\nPatent Analysis: Insightful patent landscape examination.\nRecent Developments: Overview of significant market advancements.\nPorter's Five Forces Analysis: Analysis of competitive forces.\nSWOT Analysis: Strengths, weaknesses, opportunities, and threats assessment.\n\nKEY QUESTIONS ANSWERED IN THIS REPORT\nWhat is the current and future market size and CAGR?\nWhich type of AI chip will dominate?\nHow will market opportunities be distributed across segments?\nREASONS TO BUY THIS REPORT\nIn-depth market analysis with revenue projections.\nUnderstand competitive dynamics for strategic decisions.\nGain insights into market drivers, barriers, opportunities.\nKey Attributes\nReport Attribute\nDetails\nNo. of Pages\n192\nForecast Period\n2025-2035\nEstimated Market Value (USD) in 2025\n$31.6 Billion\nForecasted Market Value (USD) by 2035\n$846.8 Billion\nCompound Annual Growth Rate\n34.8%\nRegions Covered\nGlobal\n\nA selection of companies mentioned in this report includes, but is not limited to:\nAdvanced Micro Devices\nAmazon\nGeneral Vision\nGoogle\nGyrfalcon Technology\nHuawei Technologies\nIBM\nInfineon Technologies\nIntel\nKneron\nMicrosoft\nMYTHIC\nNvidia\nNXP Semiconductors\nQualcomm Incorporated\nSamsung Electronics\nToshiba\nWave Computing\n\nFor more information about this report visit https://www.researchandmarkets.com/r/saham9\nAbout ResearchAndMarkets.com\nResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends.\nCONTACT: CONTACT: ResearchAndMarkets.com Laura Wood,Senior Press Manager press@researchandmarkets.com For E.S.T Office Hours Call 1-917-300-0470 For U.S./ CAN Toll Free Call 1-800-526-8630 For GMT Office Hours Call +353-1-416-8900\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "08:05:00",
      "Source": "Motley Fool",
      "Title": "Could AMD Finally Close the Gap on Nvidia AI Dominance?",
      "URL": "https://finance.yahoo.com/m/49aa4e22-9212-362e-8592-9c8a0a932cb6/could-amd-finally-close-the.html",
      "Content": "Could AMD Finally Close the Gap on Nvidia AI Dominance?\n\nWill Healy, The Motley Fool\nMon, December 22, 2025 at 4:05 PM PST 4 min read\n\nIn this article: AMD\n\nNVDA\n\nINTC\n\nKey Points Nvidia controls an estimated 80% of the AI accelerator market.\nExisting infrastructure and software reinforce Nvidia's dominance.\nDespite competitive challenges, AMD has earned business from key clients.\n10 stocks we like better than Advanced Micro Devices ›\nThroughout its history, Advanced Micro Devices (NASDAQ: AMD) has developed a reputation for closing or at least reducing the competitive gap with rivals. This was true when it challenged Intel 's supremacy in prior decades and, more recently, its clashes with Nvidia (NASDAQ: NVDA) .\n\nThis includes its rivalry with Nvidia in the AI accelerator market, and its upcoming releases have captured the attention of industry analysts. The question for investors is whether it is on the verge of catching up to Nvidia and ending its dominance. The more likely outcome is that AMD will narrow but not close the gap, and here's why.\nThe state of the AI accelerator market Indeed, the semiconductor industry appeared caught off guard when it became clear that Nvidia's AI accelerators powered OpenAI's game-changing GPT-4 AI platform in 2023. Nvidia was so far ahead of rivals that even now, Nvidia holds an estimated 80% of this market, according to a Susquehanna analyst.\n\nMoreover, closing the gap hinges on more than just processing power. Nvidia has its CUDA software platform, which has an army of loyal developers. That makes switching away from that architecture difficult.\nAdditionally, Nvidia offers rack-scale solutions that integrate with both its accelerators and CUDA. That presents an additional challenge to prospective competitors.\nNvidia is also growing faster. In the first three quarters of fiscal 2026, Nvidia reported 62% revenue growth. Its data center segment, which designs the accelerators and constitutes 89% of Nvidia's revenue, increased revenue by 65% during the same period.\nAMD's overall growth is also impressive, but not as rapid in either respect. In the first nine months of 2025, AMD's revenue rose by 36% year over year. Also, its data center segment makes up 46% of overall revenue, and during the period, the segment's revenue rose by 29%, slower than the overall gain.\n\nAMD's efforts to strike back Nonetheless, as bleak as that sounds, AMD bulls should remember that that is only one quarter, and data center segment growth is likely to improve along with its technology.\nDespite lagging behind, AMD has made headway in this market. The company has built strategic partnerships with OpenAI and Meta Platforms , and its accelerators support clouds for Microsoft 's Azure and Oracle 's Oracle Cloud. Moreover, Dell , Hewlett Packard Enterprise , and others have built servers with AMD's technology.\n\nStory Continues\nLooking forward, investors have focused on AMD's upcoming MI450 accelerator. The company has also claimed that the MI450 will surpass the performance of Nvidia's upcoming Vera Rubin accelerator.\nAdditionally, AMD relies on open-source software and can work with other tech ecosystems. That could wear away at Nvidia's software-driven competitive advantage as the industry grows.\n\nFurthermore, Nvidia has struggled to keep up with demand, and AMD has traditionally sold its competing product at a lower cost. This gives companies all the more reason to consider AMD over Nvidia. Hence, if the MI450 can match or surpass the Vera Rubin, AMD could make significant competitive inroads.\nWill AMD close the gap with Nvidia? In the foreseeable future, investors should expect AMD to reduce but not completely close the competitive gap with Nvidia.\nIndeed, AMD has made significant efforts to catch up and has won business from several high-profile customers. If the MI450 matches or exceeds expectations, it could threaten AMD's dominance.\n\nUnfortunately for AMD, Nvidia is the established player in the AI accelerator market, and most companies are tied into its ecosystem. That means if AMD becomes the superior product, many of Nvidia's customers would likely be unable to switch to AMD without a tremendous disruption.\nUltimately, such conditions could be enough to stoke more rapid stock price increases for Advanced Micro Devices stock than Nvidia as the smaller company plays catch-up. However, investors should expect Nvidia to remain the leader in the AI accelerator industry for some time to come.\nShould you invest $1,000 in Advanced Micro Devices right now? Before you buy stock in Advanced Micro Devices, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Advanced Micro Devices wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,039 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,109,506 !*\nNow, it’s worth noting Stock Advisor’s total average return is 972 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nWill Healy has positions in Advanced Micro Devices. The Motley Fool has positions in and recommends Advanced Micro Devices, Intel, Meta Platforms, Microsoft, Nvidia, and Oracle. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nCould AMD Finally Close the Gap on Nvidia AI Dominance? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "02:05:10",
      "Source": "GuruFocus.com",
      "Title": "INTC: Intel Foundry Push and Nvidia Backing Could Drive 2026 Growth",
      "URL": "https://finance.yahoo.com/news/intc-intel-foundry-push-nvidia-180510667.html",
      "Content": "INTC: Intel Foundry Push and Nvidia Backing Could Drive 2026 Growth\n\nNauman Khan\nMon, December 22, 2025 at 10:05 AM PST 2 min read\n\nIn this article: INTC\n\nNVDA\n\nSFTBF\n\nAAPL\n\nQCOM\n\nThis article first appeared on GuruFocus .\nIntel ( NASDAQ:INTC ) is entering 2026 with renewed investor interest after a management change and several large cash infusions, but its turnaround still hinges on landing a major external foundry client.\nNew CEO Lip-Bu Tan has trimmed costs and leaned on industry ties to steady the company after years of setbacks that left its manufacturing arm behind rivals.\n\nWarning! GuruFocus has detected 5 Warning Signs with INTC.\nIs INTC fairly valued? Test your thesis with our free DCF calculator.\nA rare U.S. government stake, plus investments from Nvidia ( NASDAQ:NVDA ) and SoftBank ( SFTBY ), bolstered the balance sheet, but analysts say the foundry needs scale to be viable.\nIntel's progress with advanced nodes, including its roadmap for 14A, will be watched closely. Success could persuade customers like Apple or Qualcomm to shift some production, analysts said, but longstanding ties to Taiwan's TSM ( NYSE:TSM ) complicate the pitch.\nInvestors say the next 12 to 18 months are critical: without a marquee external contract, Intel may struggle to justify continued heavy manufacturing investment.\nMarket watchers caution returns could be gradual even if technical milestones are met and shareholders.\n\nIs INTC Stock a Buy? Based on the one year price targets offered by 36 analysts, the average target price for Intel Corp is $36.79 with a high estimate of $52.00 and a low estimate of $18.00. The average target implies a upside of +0.13% from the current price of $36.74.\nBased on GuruFocus estimates, the estimated GF Value for Intel Corp in one year is $23.92, suggesting a downside of -34.89% from the current price of $36.74. gf value is gurufocus' estimate of the fair value that the stock should be traded at. it is calculated based on the historical multiples the stock has traded at previously, as well as past business growth and the future estimates of the business' performance. For deeper insights, visit the forecast page.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "01:59:39",
      "Source": "GuruFocus.com",
      "Title": "Alibaba Weighs Major AMD AI Chip Order",
      "URL": "https://finance.yahoo.com/news/alibaba-weighs-major-amd-ai-175939198.html",
      "Content": "Alibaba Weighs Major AMD AI Chip Order\n\nFaizan Farooque\nMon, December 22, 2025 at 9:59 AM PST 1 min read\n\nIn this article: BABA\n\nBABAF\n\nAMD\n\nNVDA\n\nINTC\n\nThis article first appeared on GuruFocus .\nAlibaba Group ( BABA , Financials ) is considering placing a major order for Advanced Micro Devices Inc. ( AMD , Financials ) artificial intelligence chips, according to a report from MLex. Sources said the Chinese tech giant could purchase between 40,000 and 50,000 of AMD's MI308 AI accelerators.\n\nWarning! GuruFocus has detected 3 Warning Signs with BABA.\nIs BABA fairly valued? Test your thesis with our free DCF calculator.\nThe potential deal comes shortly after President Trump approved limited GPU sales to China, allowing firms such as Nvidia, Intel, and AMD to resume exports under new trade conditions.\nAMD CEO Lisa Su met with China's Commerce Minister Wang Wentao last week to discuss the company's operations and cooperation in the region, though no specifics were announced.\nThe report lifted AMD shares 3% in premarket trading, while Alibaba stock edged slightly higher. The move underscores renewed demand for U.S. chip technology as Chinese firms race to secure AI hardware ahead of 2026.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "23:59:51",
      "Source": "Insider Monkey",
      "Title": "Applied Materials (AMAT) Target Raised, but Mizuho Flags China and Intel Risks",
      "URL": "https://finance.yahoo.com/news/applied-materials-amat-target-raised-155951465.html",
      "Content": "Applied Materials (AMAT) Target Raised, but Mizuho Flags China and Intel Risks\n\nVardah Gill\nMon, December 22, 2025 at 7:59 AM PST 2 min read\n\nIn this article: AMAT\n\nINTC\n\nApplied Materials, Inc. (NASDAQ: AMAT ) is included among the 13 Top Tech Stocks Paying Consistent Dividends .\nPhoto by Dan Dennis on Unsplash\nOn December 17, Mizuho raised its price target on Applied Materials, Inc. (NASDAQ:AMAT) to $245 from $205, while keeping a Neutral rating on the stock. The firm sees more upside heading into 2026 as its outlook for wafer fab equipment spending improves. That stronger WFE backdrop is a positive for Applied Materials. Still, Mizuho pointed to a few pressure points. The firm remains cautious about the company’s loss of share in China and its exposure to Intel.\n\nApplied Materials, Inc. (NASDAQ:AMAT) echoed a more constructive tone in its fiscal Q3 2025 earnings update. Management said rising AI adoption continues to drive heavy investment in advanced semiconductors and wafer fab equipment. That demand helped deliver the company’s sixth straight year of fiscal growth. Executives also said the company is well-positioned at key technology inflection points, particularly in faster-growing segments of the market. Applied Materials is extending its leadership in leading-edge logic, DRAM, and advanced packaging, as next-generation technologies move toward volume production over the next few years.\nFrom a financial standpoint, Applied Materials, Inc. (NASDAQ:AMAT) generated nearly $8 billion in operating cash flow and $5.7 billion in free cash flow during the period. Capital spending totaled $2.3 billion, largely tied to the new EPIC Center. Applied Materials also returned $1.4 billion to shareholders through cash dividends.\n\nThe dividend story remains a steady one. The company has raised its dividend for eight consecutive years. Over the past decade through 2024, dividend per share growth has averaged around 15% annually, with close to 90% of free cash flow returned to shareholders.\nApplied Materials, Inc. (NASDAQ:AMAT) supplies the equipment, services, and software used by semiconductor and display manufacturers to produce chips and advanced display technologies.\nWhile we acknowledge the potential of AMAT as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 12 Best Long Term US Stocks to Buy Now and 12 Best Dogs of the Dow to Invest in .\nDisclosure: None.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "23:33:01",
      "Source": "GuruFocus.com",
      "Title": "AI Chips Are Driving a Foundry Boom. Why TSMC Is Winning the Most",
      "URL": "https://finance.yahoo.com/news/ai-chips-driving-foundry-boom-153301101.html",
      "Content": "AI Chips Are Driving a Foundry Boom. Why TSMC Is Winning the Most\n\nNauman Khan\nMon, December 22, 2025 at 7:33 AM PST 1 min read\n\nIn this article: TSM\n\nINTC\n\nNVDA\n\nAMD\n\nAVGO\n\nThis article first appeared on GuruFocus .\nGlobal semiconductor foundry revenue rose about 17% year over year to roughly $84.8 billion in the third quarter of 2025, supported by strong demand for artificial intelligence chips built on advanced manufacturing nodes, according to a research note from Counterpoint Research.\n\nTaiwan Semiconductor Manufacturing Company ( NYSE:TSM ) widened its lead, with market share edging up to about 72%. The gains followed higher output of its 3-nanometer process and solid utilization of 4- and 5-nanometer capacity, used heavily by AI accelerator customers such as Nvidia ( NASDAQ:NVDA ), Advanced Micro Devices ( NASDAQ:AMD ), and Broadcom ( NASDAQ:AVGO ).\nWarning! GuruFocus has detected 5 Warning Signs with INTC.\nIs INTC fairly valued? Test your thesis with our free DCF calculator.\nTSMC's foundry revenue grew more than 40% from a year earlier, outpacing the broader market. Counterpoint said most rival foundries posted slower growth, with non-TSMC players collectively expanding revenue by about 6%, reflecting softer orders after earlier tariff-related demand but some support from China's subsidy programs.\n\nLooking ahead, analysts said capacity limits at advanced nodes and constraints in advanced chip packaging, known as CoWoS, may cap sequential growth in the fourth quarter. Full-year 2025 foundry revenue growth is estimated at around 15%.\nCounterpoint expects the pure-play foundry segment to grow at a faster pace, helped by continued shipments of AI GPUs and custom AI chips. Texas Instruments ( NASDAQ:TXN ), Intel ( NASDAQ:INTC ), Infineon (IFNNY), and Samsung Electronics ( SSNLF ) maintained mid-single-digit market shares.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "22:40:14",
      "Source": "Investing.com",
      "Title": "BofA upgrades credit ratings of Intel and Micron",
      "URL": "https://finance.yahoo.com/news/bofa-upgrades-credit-ratings-intel-144014543.html",
      "Content": "BofA upgrades credit ratings of Intel and Micron\n\nVahid Karaahmetovic\nMon, December 22, 2025 at 6:40 AM PST 2 min read\n\nIn this article: INTC\n\nAVGO\n\nBAC\n\nMU\n\nInvesting.com -- Bank of America (BofA) upgraded credit ratings of Intel and Micron in its latest semiconductor update, pointing to improving balance sheets, strong AI-driven demand, and more attractive relative value across parts of the sector.\nFrom a broader sector perspective, BofA analyst Tom Curcuruto said he continues to favor capital-light exposure to AI, where companies can generate “material EBITDA and free cash flow (FCF) growth for the foreseeable future.\"\n\n\"Alternatively, as concerns about potential overheating in AI infrastructure spending (and/or repricing of the commensurate debt issuance to fund it), we look favorably on stable, non-AI revenue exposures,\" he added.\nAcross its semiconductor coverage, Curcuruto noted that near-term debt issuance needs remain limited, with most issuers either paying down debt or facing no major maturities in the near term.\nIntel was upgraded to Overweight from Marketweight on what Curcuruto described as improved stability, stronger liquidity and more compelling relative value. The analyst said Intel’s lower exposure to the AI demand cycle “could insulate it from broader AI investment overheating concerns,” even as market share pressures persist.\nHe flagged a marked improvement in credit metrics in the third quarter, supported by asset sale proceeds and equity investments, alongside a return to positive free cash flow for the first time since 2023.\n\nBofA raised its fiscal 2025 (FY25) and FY26 EBITDA estimates by 20% and 18%, respectively, and expects leverage to continue improving into 2026.\nMicron was also upgraded, to Marketweight from Underweight, as supply shortages and strong AI-driven demand extend the current memory upcycle.\nCurcuruto said robust pricing across HBM and traditional DRAM is driving a sharp improvement in free cash flow, noting that Micron estimates it can meet only “1/2 to 2/3 of demand from key customers.”\nWhile near-term fundamentals are strong, he warned that capital intensity and cyclicality present medium-term risks. Still, Micron’s recent results, higher forward guidance and debt repayments underpin expectations for significantly higher free cash flow in FY26, even after an increase in planned capital spending.\nBofA also reiterated an Overweight stance on Broadcom, citing continued AI-driven growth, disciplined capital allocation and ongoing deleveraging. In terms of relative value, Broadcom and Intel remain the most compelling names within the group, Curcuruto said.\nRelated articles\nBofA upgrades credit ratings of Intel and Micron\n17 Undervalued Small-Cap Tech Stocks Primed to Outperform in Q4\n3 Strategies to Make the Most of Dow's Record-Breaking Run\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "21:19:00",
      "Source": "Zacks",
      "Title": "Can Completion of Qualcomm's Alphawave Buyout Deal Propel Its Shares?",
      "URL": "https://finance.yahoo.com/news/completion-qualcomms-alphawave-buyout-deal-131900808.html",
      "Content": "Can Completion of Qualcomm's Alphawave Buyout Deal Propel Its Shares?\n\nSupriyo Bose\nMon, December 22, 2025 at 5:19 AM PST 3 min read\n\nIn this article: QCOM\n\nAWE.L\n\nQualcomm Incorporated QCOM has completed the acquisition of U.K.-based chip firm Alphawave Semi for an enterprise value of approximately $2.4 billion. The buyout offers Qualcomm an opportunity to expand its presence in high-growth applications, including data centers, artificial intelligence (AI), data networking and data storage.\n\nWith advanced technology solutions that are complementary to power-efficient CPU and NPU cores, Alphawave Semi delivers connectivity products and chiplets that drive faster, more reliable data transfer with higher performance and lower power consumption for 5G wireless, AI and data center applications. The acquisition, therefore, provides the firepower to enable Qualcomm to be the driving force of the next wave of AI innovation.\n\nOver the past few quarters, Qualcomm has aimed to expand its footprint in AI chips through focused R&D initiatives and strategic acquisitions. In April, the company acquired MovianAI, the former generative AI division of VinAI, a prominent Vietnam-based AI firm. The transaction provided Qualcomm access to VinAI’s comprehensive expertise in generative AI, machine learning, computer vision and natural language processing, significantly accelerating its fundamental AI research. The integration of VinAI’s portfolio with Qualcomm’s extensive R&D expertise facilitated the development of state-of-the-art AI-driven solutions for a wide range of industries, including smartphones, PCs, software-defined vehicles and more.\n\nOther Tech Firms Focusing on AI Chips Advanced Micro Devices, Inc. AMD has strengthened its position in the semiconductor market on the back of its evolution as an enterprise-focused company from a pure-bred consumer-PC chip provider. The latest MI300 series accelerator family strengthens its competitive position in the generative AI space. The accelerator from Advanced Micro is based on AMD CDNA 3 accelerator architecture. It supports up to 192 GB of HBM3 memory, enabling efficient running of large language model training (up to 80 billion parameters) and inference for generative AI workloads. Advanced Micro is also benefiting from strong enterprise adoption and expanded cloud deployments.\n\nIntel Corporation INTC has launched the Intel Core Ultra (Series 2) processors engineered to redefine mobile computing for a wide range of use cases, such as gaming, content creation, IT applications and various other businesses. This state-of-the-art lineup brings significant advancements in AI capabilities, improved performance and efficiency, setting new standards for AI computing. Intel has also introduced a new lineup of leading-edge processors to support AI workloads for edge devices. The Intel Core Ultra processors offer greater scalability, energy efficiency and impressive performance at the edge for a diverse range of use cases such as industrial IoT, autonomous vehicles and more.\n\nStory Continues\nQCOM’s Price Performance, Valuation and Estimates Qualcomm shares have gained 10.7% over the past year compared with the industry’s growth of 35.3%.\n\nImage Source: Zacks Investment Research\nGoing by the price/earnings ratio, the company's shares currently trade at 14.3 forward earnings, lower than 33.8 for the industry and the stock’s mean of 16.89.\n\nImage Source: Zacks Investment Research\nEarnings estimates for fiscal 2026 and fiscal 2027 have increased 2% to $12.15 per share and 3.4% to $12.60, respectively, over the past 60 days.\n\nImage Source: Zacks Investment Research\nQualcomm currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "00:52:00",
      "Source": "Motley Fool",
      "Title": "Want to Invest in Quantum Computing? 3 Stocks That Are Great Buys Right Now",
      "URL": "https://finance.yahoo.com/m/88141321-5ab4-3423-9d09-55ea9ccc809c/want-to-invest-in-quantum.html",
      "Content": "Want to Invest in Quantum Computing? 3 Stocks That Are Great Buys Right Now\n\nWill Healy, The Motley Fool\nSun, December 21, 2025 at 8:52 AM PST 5 min read\n\nIn this article: GOOG\n\nINTC\n\nIBM\n\nKey Points Google parent Alphabet is making waves with its new quantum computing processor.\nIntel's long-term comeback partially hinges on quantum computing.\nIBM's strength in supercomputing could help make it a leader in the quantum field.\n10 stocks we like better than Alphabet ›\nInvestors may struggle with what to make of quantum computing stocks . The technology increases the amount of computing power exponentially. Unfortunately, quantum computing is a highly error-prone technology, and in many respects, it is a solution without a problem.\n\nBoth tech giants and start-ups have undertaken efforts in this arena. Still, almost every start-up is a speculative, money-losing company with a nosebleed valuation. Knowing that, investors are probably wise to look at established companies building quantum computing segments.\nThese three companies below fit the bill. Let's have a closer look at them.\nAlphabet Admittedly, Google parent Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) has fostered a comeback recently based on artificial intelligence (AI). Thus, its investors seem focused on its latest Google Gemini update or the AI powering its autonomous vehicle segment, Waymo.\nHowever, investors should also not ignore its advancements in quantum computing. The company has built large-scale quantum computers focused on addressing error correction, a challenge that has plagued the quantum industry.\n\nTo that end, it incorporated what it calls a \"breakthrough algorithm\" on its Willow quantum processor that delivers quantum advantage. This applies the technology to problems in molecular science, materials science, and other areas.\nMoreover, investors can expect that quantum computing will play a more significant role in driving this company's revenue in the coming years. Alphabet holds $98 billion in liquidity and generated almost $74 billion in free cash flow over the last year. Hence, unlike the start-ups, investors know the Google parent holds the resources to compete in this field.\nFurthermore, even with Alphabet stock up by more than 60% over the last 12 months, its price-to-earnings (P/E) ratio of 30 is close to the S&P 500 average earnings multiple of 31, meaning investors can buy this stock at a reasonable price.\n\nIntel Intel (NASDAQ: INTC) is another tech giant that investors have written off, as its chip industry competitors beat it on innovation, leaving investors with questions as to whether it could stay relevant in today's tech market. Nonetheless, current CEO Lip-Bu Tan is reorienting Intel with an engineering-first culture, and one area of focus is quantum computing.\n\nStory Continues\nThe company recently introduced its Tunnel Falls quantum chip, which it has made available for research. Also, its Horse Ridge II cryogenic control chip has helped it overcome scalability issues, one challenge quantum computing technology faces.\nAlso, despite its struggles in recent years, Intel has attracted investor interest, including from the Trump administration, which invested in the company earlier this year. Additionally, its free cash flow turned positive in the third quarter of 2025, coming in at $896 million. That helps give Intel the financial stability it needs to advance its technology.\n\nIndeed, its recent return to profitability makes its P/E ratio a poor measure of its valuation. Still, its stock is up by more than 80% over the last year.\nFurthermore, a price-to-sales (P/S) ratio of 3 is below the S&P 500's 3.4 average and allows investors to buy into Intel's recovery at a reasonable price. As Intel's turnaround continues, now might be a good time to buy before more investors become aware of Intel's growing quantum capabilities.\nIBM In recent years, International Business Machines (NYSE: IBM) has become better known for its cloud computing capabilities. However, it has long led the way in supercomputing, and to that end, it developed its first quantum computer in 2019.\nThe advancements have continued since that time, and it has just released its IBM Quantum Nighthawk, a 120-qubit computer that can run circuits with more complexity while keeping a lid on error rates. Looking forward, its quantum advantage promises improvements over classical-only problem-solving methods, and by 2029, it plans to deliver a \"fault-tolerant\" computer that incorporates technology to more efficiently correct errors.\n\nInvestors should expect such advancements to continue amid the $14 billion in free cash flow it forecasts for 2025. About $6.3 billion of that will cover its dividend, which rises annually and returns 2.2% yearly. That frees the rest of its free cash flow to invest back into its business.\nAdditionally, the stock is up more than 30% over the last year amid its growing relevance in today's tech world. Also, as the pace of growth rises, its 37 P/E ratio has become more palatable, positioning IBM for continued gains, which are likely to be increasingly driven by quantum computing in the coming years.\nShould you buy stock in Alphabet right now? Before you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,039 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,109,506 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 972 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nWill Healy has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Intel, and International Business Machines. The Motley Fool has a disclosure policy .\nWant to Invest in Quantum Computing? 3 Stocks That Are Great Buys Right Now was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "00:10:00",
      "Source": "Motley Fool",
      "Title": "The 3 Deep Learning Stocks That Could Be Worth 50% More by 2027",
      "URL": "https://finance.yahoo.com/m/c8c45f02-e236-3d79-86e7-8c88288faa60/the-3-deep-learning-stocks.html",
      "Content": "The 3 Deep Learning Stocks That Could Be Worth 50% More by 2027\n\nBilly Duberstein, The Motley Fool\nSun, December 21, 2025 at 8:10 AM PST 7 min read\n\nIn this article: INTC\n\nGOOG\n\nMSFT\n\nOPAI.PVT\n\nKey Points Microsoft owns 27% of OpenAI, with massive Azure cloud contracts in the pipeline.\nAlphabet has come back to be a recognized leader in generative AI, with a big lead in autonomous vehicles.\nIntel has begun its turnaround, which should only accelerate in 2026.\n10 stocks we like better than Microsoft ›\n2025 is nearly over, and despite the strong year, many investors are biting their fingernails over the prospects for 2026. Will the artificial intelligence (AI) boom continue despite talks of a bubble and debt investors recently balking at funding large-scale data centers? Whom will President Donald Trump pick as the new Federal Reserve chair, and will the new nominee be independent?\n\nShort-term concerns always dominate headlines and investors' mindsets in the moment, but real long-term outperformance comes from taking a broader mindset and looking at the big picture.\nAssuming the AI buildout continues apace and AI usage increases over the next several years -- and there's no evidence AI adoption is slowing at all -- these three artificial intelligence stocks still look like they have upside. In fact, there's a case for 50% upside for each in 2026.\n1. Microsoft Microsoft (NASDAQ: MSFT) is up a solid 15% year to date in 2025 but has pulled back in recent months. Investors have grown nervous over OpenAI's technical moat and ability to fund massive spending commitments. That's important for Microsoft, which is both a 27% owner of OpenAI and a cloud provider for $250 billion of OpenAI cloud computing commitments -- a result of the 2025 negotiations by which OpenAI converted into a for-profit company.\n\nThat ownership and cloud pipeline would be highly bullish for Microsoft, but doubt has crept in regarding OpenAI's lead in generative AI in recent months. Rival Anthropic has shown significant enterprise growth, and Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) released its impressive Gemini 3 model in November.\nStill, the fear may be misplaced. It doesn't seem likely that the AI revolution would be dominated by a single model builder, but rather by a cohort of winners in an oligopoly. That's how both the semiconductor and cloud computing sectors have evolved. The AI large language model (LLM) market will likely follow a similar path.\nAfter all, Alphabet was regarded as a loser in the AI race as recently as this year, only to retake the lead. OpenAI is certainly not going away, and this week's investment in OpenAI by Amazon appears to indicate that at least some astute executives and investors still believe in the company.\n\nStory Continues\nMeanwhile, Morgan Stanley sell-side analyst Keith Weiss just upgraded Microsoft stock, giving it a $650 price target, good for 35% upside from the current price. His analysis and conversations with management indicated that Azure AI demand is stronger than initially thought and that Azure AI's gross margins can expand with scale as more revenue is generated over the next two years. Furthermore, Weiss noted that his estimates don't even contemplate the full OpenAI contract, which could lead to further upside.\n\n2026 should also see the introduction of Microsoft's next-generation AI chip, named Braga. According to reports this past summer, the chip was initially planned for 2025, but a redesign pushed back its introduction by six months. If Microsoft can develop an impressive in-house-designed chip, as Alphabet and Amazon have, that could lead to even more optimism.\n2. Alphabet Speaking of Alphabet, it would definitely be possible for both Microsoft and Alphabet to appreciate 50% in 2026. While Alphabet has had the best year of the \"Magnificent Seven\" stocks, up 62% on the year, Alphabet also entered the year as the cheapest of the bunch. In fact, despite this year's rise, it's still the second-cheapest of the bunch .\n\nComing into the year, investors were nervous that AI chatbots could disrupt Alphabet's Search business. However, that doesn't seem to be happening. Search paid clicks grew by 2%, 4%, and 7% in the first, second, and third quarters, respectively, showing a reacceleration after Alphabet introduced AI Mode into Search in May.\nWith the November release of Gemini 3, Alphabet has seemingly taken the lead for the moment in the AI race across several benchmarks. What's even better is that Gemini 3 was trained on Alphabet's homegrown Tensor Processing Units (TPUs). Following the Gemini release, other major companies are now looking to buy or lease TPUs from Alphabet or its cloud unit, Google Cloud.\n\nEven Alphabet rival Meta Platforms is reportedly considering using TPUs, according to late-November press reports. And just last Friday, Reuters reported a massive cloud deal worth over $10 billion between cybersecurity giant Palo Alto Networks and Google Cloud.\nThat all bodes very well for Google Cloud, which has been an incredibly underrated part of Alphabet's business. Google Cloud has now reached scale, with a $60 billion revenue run-rate and an almost $5 billion operating profit run-rate as of the last quarter. Growth accelerated by 34% for that business in Q3, accompanied by margin expansion.\nSo not only could the Cloud unit become a second major profit center beyond ad revenue, but 2026 could also bring exciting developments for Waymo. Waymo is now delivering over 1 million autonomous rides per month, with a significant lead over competitors in scaling. Next year could bring about more disclosure around Waymo's revenue or valuation, which could add yet another major business to Alphabet's expanding empire.\n\n3. Intel Intel (NASDAQ: INTC) has had an even better year than Alphabet or Microsoft, up 83.6% on the year thus far. Of course, Intel was trading at a practically distressed price heading into 2025, below its book value and without a CEO. And despite the 2025 surge, its market cap is still far, far lower than all the supposed AI winners of today.\n\nMeanwhile, 2026 is shaping up to be an exciting year. New CEO Lip-Bu Tan, who joined the company in March, will begin to make his presence felt more noticeably. The all-important 18A node -- the node at which Intel predicts it will either equal competitors or regain its technology leadership in the industry -- will begin to deliver product. 18A has just begun high-volume manufacturing this quarter, with the first 18A product, Panther Lake, set to enter the laptop market in January.\nSuccess on 18A in the form of better revenue and margins could yield external customer wins for future nodes 18AP and 14A. Already, technology pundits are reporting that major companies such as Apple , Nvidia, and even Intel rival Advanced Micro Devices are looking to potentially use the 14A node for their server central processing units (CPUs), according to analysts for China research firm GF Securities.\n\nIf an external customer were to commit to Intel's 14A node, which is expected to be released in 2027 or 2028, there could be confirmation of the customer win during 2026. After all, there has already been a flurry of positive reports on 14A technology and the adoption of Intel's EMIB packaging technology over the past month or so.\nIf investors come to believe that Intel has pulled even or ahead in terms of process technology, financial results improve with 18A manufacturing, and/or Intel announces a significant external 18AP or 14A customer win for its foundry, there is still considerable upside left in the stock.\nShould you invest $1,000 in Microsoft right now? Before you buy stock in Microsoft, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Microsoft wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,039 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,109,506 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 972 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nBilly Duberstein and/or his clients have positions in Alphabet, Amazon, Apple, Intel, Meta Platforms, and Microsoft. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Intel, Meta Platforms, and Microsoft. The Motley Fool recommends Palo Alto Networks and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nThe 3 Deep Learning Stocks That Could Be Worth 50% More by 2027 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-21",
      "Time": "22:00:04",
      "Source": "Yahoo Finance",
      "Title": "Intel stock soared in 2025. But the chipmaker still has a long road ahead.",
      "URL": "https://finance.yahoo.com/news/intel-stock-soared-in-2025-but-the-chipmaker-still-has-a-long-road-ahead-140004121.html",
      "Content": "Intel stock soared in 2025. But the chipmaker still has a long road ahead.\n\nLaura Bratton\nSun, December 21, 2025 at 6:00 AM PST 5 min read\n\nIn this article: INTC\n\nSFTBY\n\nTSM\n\nNVDA\n\nSFTBF\n\nFor Intel ( INTC ), 2025 was an eventful year, but not one that necessarily changed its narrative .\nThe storied American chipmaker got a new CEO and won massive investments from the US government , Nvidia ( NVDA ), and SoftBank ( SFTBY ). Those developments helped push the stock up 86% for the year, ahead of gains for the \"Magnificent Seven\" Big Tech stocks and Intel rival Advanced Micro Devices ( AMD ). At the same time, Intel's crucial manufacturing segment still lacks a major external customer — something it needs to make the cash-bleeding business viable.\n\n\"Intel's exiting the year with some optimism that they will be a relevant chip manufacturer in the US at some point in time ... and that was definitely an uncertain statement at the start of the year,\" MorningStar analyst Brian Colello told Yahoo Finance.\nAt the same time, he noted, \"There wasn't the massive sort of deal that really establishes Intel, either, in manufacturing.\"\n\nThe company's technology is largely responsible for the digital revolution and Silicon Valley's reputation as a global innovation hub: Intel invented the world's first microprocessors, or computer chips, and the x86 architecture, a critical blueprint for designing computer chips. Its co-founder Gordon Moore created Moore's Law, a theory that defined the pace of innovation in the semiconductor industry for more than half a century. The company has continued to make its own computer chips, even as the rest of the industry has gone \"fabless\" — outsourcing manufacturing to firms like Taiwan's TSMC ( TSM ).\n\nBut years of missteps and poor investment decisions put Intel's manufacturing segment behind TSMC, which in turn caused its products to lose their edge to competitors. As its chips — CPUs for servers, laptops, and desktops — have lost market share to rivals AMD and Arm ( ARM ), its manufacturing business has been stripped of the scale it needs to remain viable.\nFour years of an aggressive turnaround effort by former CEO Pat Gelsinger to revive Intel's manufacturing arm by opening it to outside customers sent investors fleeing. The massive amount of spending required to reboot the foundry, along with its uncertain success, spooked Wall Street.\nThe arrival of Lip-Bu Tan , who was named chief executive in March following the board's ousting of Gelsinger in late 2024, began to renew faith in the company's potential turnaround. While Intel's strategy remains mostly unchanged under Tan, analysts explained, investors have applauded his sober tone, cost-cutting measures, and wide-ranging industry connections.\n\nStory Continues\nThat tepid faith transformed into confidence when the US government made a rare $9 billion investment in the company — albeit funds Intel was supposed to get anyway from the Biden-era CHIPS Act — following Tan's tiff with President Trump over the CEO's business ties to China.\nOnshoring semiconductor manufacturing has been a focus of the US government since the pandemic highlighted the risk of a tech supply chain reliant on Taiwan. Escalating tensions with China, including the threat of a Taiwan invasion, have further intensified the sense of urgency.\n\n\"Semiconductors are not only economically important, they're actually important from a national security perspective,\" Technalysis analyst Bob O'Donnell told Yahoo Finance. \"Intel has by far the largest infrastructure in place as a true, real American company.\"\nMany critics believe the broader US turn toward state capitalism under Trump, exemplified by the Intel investment, raises questions about national security and the government's conflicting interests. But analysts say the US government's 10% stake in Intel could lead to various positive outcomes for the company, such as Intel having a say in trade policy that affects semiconductors. More importantly, the US could step in to incentivize or force a major company like Apple to use the chipmaker's foundry.\n\nA $2 billion investment from SoftBank and $5 billion from Nvidia further boosted investor sentiment on Intel stock. The cash infusion helped stem the company's steep losses as it figures out a path forward. Notably, though, the Nvidia deal didn't include an agreement for Intel's foundry business to manufacture the AI giant's chips.\n'Everything hinges on 14A' Intel's biggest potential customers for its foundry business — Nvidia, Apple ( AAPL ), and Qualcomm ( QCOM ) — are also, to some degree, competitors of its products arm and have longstanding relationships with TSMC. Not to mention, TSMC is building $165 billion worth of manufacturing capacity in the US, diminishing the geopolitical argument for those companies to use Intel to produce their chips.\nTo win those customers, Intel will need to prove that its latest generation manufacturing processes are up to snuff. The chipmaker's 18A process, a massive technological feat initially marketed to outside customers, is now being used primarily to make Intel's own products. Whether those products — Intel's upcoming Panther Lake chips for PCs and Clearwater Forest chips for data centers — succeed could help convince companies to use its next-generation processes called 18AP and 14A, analysts said.\n\nAlready, rumors have circulated that Apple could use Intel's manufacturing, specifically its 18AP process, for its lowest-end computer chips.\nIntel has 12 to 18 months to secure a big external customer for 14A in order for that process to continue as planned, BNB Paribas analyst David O'Connor estimated.\nHe called the process \"the crux of Intel being successful on the foundry business or not, or potentially even exiting manufacturing long term.\"\n\"Everything hinges on 14A and the success of that,\" O'Connor said.\nOther analysts gave longer timelines for when Intel would see a turnaround.\nBernstein analyst Stacy Rasgon said, \"It took 10 years to break it. Why would it take less than 10 years to fix it?\"\nLaura Bratton is a reporter for Yahoo Finance. Follow her on Bluesky @laurabratton.bsky.social. Email her at laura.bratton@yahooinc.com.\nClick here for the latest technology news that will impact the stock market\nRead the latest financial and business news from Yahoo Finance\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "21:10:00",
      "Source": "PR Newswire",
      "Title": "Stellar Solutions Awarded Contract for Missile Defense Agency SHIELD IDIQ",
      "URL": "https://finance.yahoo.com/news/stellar-solutions-awarded-contract-missile-131000383.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nStellar Solutions Awarded Contract for Missile Defense Agency SHIELD IDIQ\n\nPR Newswire\nSat, December 20, 2025 at 5:10 AM PST 1 min read\n\nIn this article: INTC\n\nGlobal aerospace and systems engineering services provider supports defense sector\nLOS ALTOS, Calif. , Dec. 20, 2025 /PRNewswire/ -- Stellar Solutions, Inc. has been awarded a contract for the Missile Defense Agency Scalable Homeland Innovative Enterprise Layered Defense (SHIELD) indefinite-delivery/indefinite-quantity (IDIQ) contract with a ceiling of $151B. This contract encompasses a broad range of work areas that allow for the rapid delivery of innovative capabilities to the warfighter with increased speed and agility.\n\"Stellar Solutions is honored to be selected as an awardee on the SHIELD IDIQ, where we will leverage our 30 years of space systems engineering experience across Intel, Defense, Civil, Commercial, and International markets,\" said Janet Grondin, CEO of Stellar Solutions, a global aerospace and systems engineering services provider and recipient of the Malcolm Baldrige Quality Award.\n\nAbout Stellar Solutions, Inc.: Stellar Solutions, Inc. is a global aerospace and systems engineering services provider to commercial, defense, intelligence, civil and international sectors. Stellar Solutions provides systems engineering capabilities and strategic support for global communications, remote sensing, national defense, and space exploration. These solutions to customer critical needs connect technology and customers across multiple domains. With physical operations throughout the U.S. and around the globe, Stellar Solutions is a recognized leader in delivering end-to-end critical expertise and problem-solving skills. https://www.stellarsolutions.com\nMedia Contact: Lynthia Romney, romneycom@gmail.com 914-589-2140\nView original content to download multimedia: https://www.prnewswire.com/news-releases/stellar-solutions-awarded-contract-for-missile-defense-agency-shield-idiq-302647414.html\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "06:15:45",
      "Source": "StockStory",
      "Title": "AMD, Intel, KLA Corporation, Western Digital, and Nova Stocks Trade Up, What You Need To Know",
      "URL": "https://finance.yahoo.com/news/amd-intel-kla-corporation-western-221545586.html",
      "Content": "AMD, Intel, KLA Corporation, Western Digital, and Nova Stocks Trade Up, What You Need To Know\n\nKayode Omotosho\nFri, December 19, 2025 at 2:15 PM PST 3 min read\n\nIn this article: AMD\n\nNVMI\n\n^IXIC\n\nINTC\n\nKLAC\n\nWhat Happened? A number of stocks jumped in the afternoon session after investor optimism around artificial intelligence fueled broad market gains. Technology stocks with a focus on artificial intelligence once again led the market higher, boosting the Nasdaq and S&P 500.\nCompanies at the forefront of the AI boom, such as Nvidia and Broadcom, saw significant jumps in their share prices. The rally reflects a renewed belief among investors in the transformative potential of AI technology to drive future growth and productivity.\n\nThe rally was further supported by a surprise cooling in the November consumer price index (CPI) report, which triggered market pricing for additional rate cuts in the coming year. This created a more favorable environment for growth-oriented companies.\nThe stock market overreacts to news, and big price drops can present good opportunities to buy high-quality stocks.\nAmong others, the following stocks were impacted:\nProcessors and Graphics Chips company AMD (NASDAQ:AMD) jumped 6.8%. Is now the time to buy AMD? Access our full analysis report here, it’s free for active Edge members.\nProcessors and Graphics Chips company Intel (NASDAQ:INTC) jumped 3.2%. Is now the time to buy Intel? Access our full analysis report here, it’s free for active Edge members.\nSemiconductor Manufacturing company KLA Corporation (NASDAQ:KLAC) jumped 2.9%. Is now the time to buy KLA Corporation? Access our full analysis report here, it’s free for active Edge members.\nMemory Semiconductors company Western Digital (NASDAQ:WDC) jumped 5%. Is now the time to buy Western Digital? Access our full analysis report here, it’s free for active Edge members.\nSemiconductor Manufacturing company Nova (NASDAQ:NVMI) jumped 4.1%. Is now the time to buy Nova? Access our full analysis report here, it’s free for active Edge members.\n\nZooming In On AMD (AMD) AMD’s shares are very volatile and have had 29 moves greater than 5% over the last year. In that context, today’s move indicates the market considers this news meaningful but not something that would fundamentally change its perception of the business.\nThe previous big move we wrote about was 7 days ago when the stock dropped 4.3% on the news that investors rotated out of AI-linked high-flyers following underwhelming earnings updates from Oracle and Broadcom as the core thesis shifted from \"growth at any cost\" to \"prove the returns.\"\n\nOracle triggered the alarm by missing revenue estimates while simultaneously hiking capital expenditures by $15 billion. This reignited fears that AI infrastructure spending is outpacing actual monetization. Broadcom compounded the anxiety; despite beating earnings, its stock fell as CFO Kirsten Spears cautioned that gross margins may come under pressure as product mix shifts further toward system-level AI sales. This sparked a macro rotation away from AI infrastructure and power plays. High-valuation names like AMD, Vertiv, and Bloom Energy fell as markets looked to sectors that can benefit from the recent Fed rate cut and a resilient economy.\n\nStory Continues\nAMD is up 77.6% since the beginning of the year, but at $214.30 per share, it is still trading 18.9% below its 52-week high of $264.33 from October 2025. Investors who bought $1,000 worth of AMD’s shares 5 years ago would now be looking at an investment worth $2,299.\nMicrosoft, Alphabet, Coca-Cola, Monster Beverage—all began as under-the-radar growth stories riding a massive trend. We’ve identified the next one: a profitable AI semiconductor play Wall Street is still overlooking. Go here for access to our full report .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "05:48:29",
      "Source": "Yahoo Finance Video",
      "Title": "Nvidia, Tesla dominate Dec. trading as 2025 options demand surges",
      "URL": "https://finance.yahoo.com/video/nvidia-tesla-dominate-dec-trading-214829316.html",
      "Content": "Nvidia, Tesla dominate Dec. trading as 2025 options demand surges\n\nYahoo Finance Video\nFri, December 19, 2025 at 1:48 PM PST\n\nIn this video: NVDA\n\nAMD\n\nAMZN\n\nAAPL\n\nINTC\n\nCboe vice president of market intelligence Henry Schwartz joins Market Domination with Yahoo Finance Data and Markets Editor Jared Blikre to discuss the state of the options landscape.\nWatch the video above to hear Schwartz's outlook for the options market in 2026.\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination .\n\nVideo Transcript\n\n00:00 Speaker A\n2025 will be another record year for options volume, but how are retail traders gearing up for 2026 as the demand for leverage keeps surging? We're digging into all of this in today's options pit, sponsored by Tasty trade.\n00:15 Speaker A\nAnd Henry Schwartz, CBOE Vice President of Market Intelligence is here to discuss. Uh, let's talk about this surge in options demand. We were just talking offline. You said it's up what three times since uh COVID?\n00:32 Henry Schwartz\nYeah.\n00:33 Speaker A\nThat is incredible. So, what is this trend tell you?\n00:36 Henry Schwartz\nSo, I mean, this year we're going to see 15 billion option contracts trade. Uh if you go back to to just before COVID, it was about 4 billion contracts a year. So, and in fact, I've been doing the calculations. It looks like the 15 billionth contract will trade on Christmas Eve.\n00:52 Speaker A\nMhm.\n00:52 Henry Schwartz\nI think we should have a door prize or something. Let's see if we can figure out what trade.\n00:56 Speaker A\nThere might be some binary option futures betting markets that could uh take care of that.\n01:00 Henry Schwartz\nAbsolutely. Well, I mean, that that's actually kind of one of the big themes, right? As we've seen this the evolution of risk taking, betting, you know, there's a lot of different ways to discuss it. Um, you know, the the you know, COVID really or you know, that whole kind of market environment really changed the landscape for options trading. And basically, uh we saw growth of about 50% in 2020 and it has kept up and it is retail that is really driving most of that. You know, we continue to see, you know, a healthy institutional business. Uh we see, you know, we see, you know, the the big theme really for this year is kind of everything is just stronger. Across the board, no matter what asset classes you look at, if you're talking about index options like SPX or VIX. If you're talking about ETF options, which you know, we were just talking about kind of the explosion in in number of ETFs and single stock option flow, which is really, you know, primarily retail driven. And when you have a year like, you know, like we're seeing this year with, you know, basically the broad averages up, you know, between 15 and 20%, uh that just brings in more and more activity.\n02:08 Speaker A\nSo, I've been thinking about this and tell me if I'm just way offline here. But if we take it back to early late 2020, early 2021, that's when we had the whole Reddit GameStop phenomenon going on. Arguably, a lot of it was fueled with the stimulus checks, the stimmies. and next year is going to be a blockbuster record year for fiscal stimulus. Um there's going to be a lot of tax refunds and I'm just wondering, is there any way we could have some kind of a repeat of that, maybe not to the same extent, but do you think that we just get another surge, um perhaps just because people have more money to play with?\n02:46 Henry Schwartz\nI I mean, I think you have you have a lot of dynamics going on at the same time. You know, we do have a a a rate, you know, the rates are going down in the cycle, but you also do have some concerns about the labor market, you have concerns about, you know, just fundamental valuations. So there's a little bit of push and pull. I think, you know, that the the COVID situation and you know, zero interest rates and stimulus and meme stock, uh that that was such a perfect storm of just kind of\n03:28 Speaker A\nAgreed, perfect storm.\n03:29 Henry Schwartz\nexplosive bullish activity and and and retail were able to capitalize on it. You know, in a large part because they were at home and they kind of had the freedom to trade. You also had commissions that basically gone to zero just leading into that. So, everything came together and you know, a lot of these traders found each other and learned from each other on Reddit and on, you know, social media. Uh I don't know if 2026 is going to be quite the same. I think there's a little bit more kind of back and forth. Uh but you know, at least in terms of the options activity, you know, we continue to see new brokerage firms coming uh online. We see the existing brokerage firms, you know, innovating and and rolling out new platforms and doing some really interesting things. So, you know, I see the business, at least in the options world continuing to to do very, very well. And you know, in terms of assets, uh you know, I think that you have this environment now where, you know, the US has had an amazing run and there's a lot of people that say, oh, you know, I don't know, this is getting a little bit tired. Uh but at the same time, you you you know, every time we have a dip, uh,\n04:36 Speaker A\nAnd that's arguably better for options traders. I mean, option traders like volatility. I I I want to make sure we get to a couple other things here. The other is the rise of zero-dated options. And so that just gives more opportunities. Back in the day, you only had monthlies, so you had to wait every month. Then we had weeklies, then basically we have dailies now. And that has just increased uh this volume of options. Talk to me about some of the other innovations. I know CBOE has a bunch of new products, too.\n05:08 Henry Schwartz\nYeah, so the so we pioneered the zero DTE or the daily option option cycle starting 2022 and those are now about 2/3 of the activity uh in SPX and um and some of the big ETFs. Uh and there there's no signs of that slowing down. Uh we just rolled out the Mag 10 index, which is the Mag 7 plus uh Broadcom, uh AMD and Palantir. And you know, those 10 symbols together do about a third of the single stock option. Out of almost 4,000 single stocks. So you you can see how concentrated it is. That's what the trader, that's what the investing public really, really is interested in. They're following the stories, they're getting in and getting out of these stocks. And so the Mag 10 index which launched about a month ago, I'm very proud to say I was the very first trade in in Mag 10. and that option expired today and I made a little bit of money at it. Uh we actually have daily options coming in those just uh in two weeks. So that's, you know, and that's new, right? This this is the first time that that there's been a uh an index that's not quite as broad-based with the daily options on it as well. So, um you know, there's you know, the the industry just continues to keep innovating. You know, we see a lot of work going on in complex order execution, which is you know, basically about a third of the activity is customers trading one option against another, vertical spreads, calendar spreads, exactly. Uh and that you know, CBOE and all the other exchanges continue to kind of take steps to make that uh easier to do, add functionality. You can now trade flex options versus listed options, which is a kind of a special option that lets people pick their own expiration date and um and strike price and even exercise style.\n06:56 Speaker A\nAll right, Henry, we got to leave it there, but congratulations on your Mag 10 trade. I hope it pretends a bullish 2026. Thanks for joining us in studio here.\n07:05 Henry Schwartz\nAwesome.\n07:06 Speaker A\nAll right, we'll\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "05:00:29",
      "Source": "MT Newswires",
      "Title": "Sector Update: Tech Stocks Gain Late Afternoon",
      "URL": "https://finance.yahoo.com/news/sector-tech-stocks-gain-afternoon-210029981.html",
      "Content": "PREMIUM\nSector Update: Tech Stocks Gain Late Afternoon\n\nMT Newswires\nFri, December 19, 2025 at 1:00 PM PST 1 min read\n\nIn this article: ORCL\n\nMETA\n\nGOOG\n\nNVDA\n\nINTC\n\nTech stocks gained late Friday afternoon, with the State Street Technology Select Sector SPDR ETF (X\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "02:46:31",
      "Source": "MT Newswires",
      "Title": "Sector Update: Tech Stocks Gain Friday Afternoon",
      "URL": "https://finance.yahoo.com/news/sector-tech-stocks-gain-friday-184631483.html",
      "Content": "PREMIUM\nSector Update: Tech Stocks Gain Friday Afternoon\n\nMT Newswires\nFri, December 19, 2025 at 10:46 AM PST 1 min read\n\nIn this article: ORCL\n\nNVDA\n\nINTC\n\nGOOG\n\nXLK\n\nTech stocks gained Friday afternoon, with the State Street Technology Select Sector SPDR ETF (XLK) r\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "02:31:36",
      "Source": "MT Newswires",
      "Title": "Market Chatter: Nvidia Wins US Antitrust Clearance for Intel Investment",
      "URL": "https://finance.yahoo.com/news/market-chatter-nvidia-wins-us-183136242.html",
      "Content": "PREMIUM\nMarket Chatter: Nvidia Wins US Antitrust Clearance for Intel Investment\n\nMT Newswires\nFri, December 19, 2025 at 10:31 AM PST 1 min read\n\nIn this article: NVDA\n\nINTC\n\nNvidia (NVDA) won clearance from US antitrust regulators for its planned investment in Intel (INTC),\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "02:11:57",
      "Source": "Yahoo Finance Video",
      "Title": "Nvidia's Intel stake cleared by FTC, existing home sales rise",
      "URL": "https://finance.yahoo.com/video/nvidias-intel-stake-cleared-ftc-181157932.html",
      "Content": "Nvidia's Intel stake cleared by FTC, existing home sales rise\n\nYahoo Finance Video and John Hyland\nFri, December 19, 2025 at 10:11 AM PST\n\nIn this video: NVDA\n\nINTC\n\nYahoo Finance's John Hyland takes a closer look at some of Friday's top stories in this episode of Market Minute , including Nvidia's ( NVDA ) Intel ( INTC ) investment being approved by US regulators, reports that the Trump administration has begun its review of Nvidia's H100 chip exports to China, and existing home sales moderately gaining in November.\nStay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute .\n\nVideo Transcript\n\n00:03 Speaker A\nIt's time for the Yahoo Finance Market Minute.\n00:05 Speaker A\nUS stocks are looking to close out a week of gains as tech stocks lead the market higher, and US anti-trust agencies have cleared Nvidia's investment in Intel.\n00:13 Speaker A\nBack in September, Nvidia said it would invest $5 billion in the struggling chipmaker.\n00:17 Speaker A\nThe FTC ended its review and made the announcement today, but didn't offer details on the investment.\n00:21 Speaker A\nMeanwhile, the Trump administration has reportedly kicked off its review of Nvidia's H200 chip exports to China.\n00:27 Speaker A\nAccording to Reuters, the White House has launched the review, which could result in the first shipment of chips to China, but questions remain on the timeline for sales and whether Beijing would even allow the Chinese firms to purchase Nvidia's chips.\n00:36 Speaker A\nAn existing home sales data showed a moderate gain for November, but it did mark a third straight month of gains and lower mortgage rates were likely the boost.\n00:43 Speaker A\nHome sold in November typically go under contract during September or October, around when mortgage rates were near year-to-date lows.\n00:48 Speaker A\nAnd that's your Yahoo Finance Market Minute. Scan the QR code below for more on what's trending on the website.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "01:05:00",
      "Source": "Motley Fool",
      "Title": "Intel vs. Taiwan Semiconductor Manufacturing: Which Stock Will Outperform in 2026?",
      "URL": "https://finance.yahoo.com/m/ab4439bf-2ed7-3ec1-b64a-61a4c9be5886/intel-vs.-taiwan.html",
      "Content": "Intel vs. Taiwan Semiconductor Manufacturing: Which Stock Will Outperform in 2026?\n\nGeoffrey Seiler, The Motley Fool\nFri, December 19, 2025 at 9:05 AM PST 5 min read\n\nIn this article: TSM\n\nINTC\n\nNVDA\n\nAAPL\n\nAVGO\n\nKey Points TSMC is the undisputed leader in manufacturing advanced chips.\nIntel's stock outperformed in 2025 after the company was backed by some big investors.\nTSMC has a clearer growth path between the two companies.\n10 stocks we like better than Intel ›\nWhen it comes to chip manufacturing, Taiwan Semiconductor Manufacturing (NYSE: TSM) is the undisputed foundry leader, while Intel (NASDAQ: INTC) is trying to make inroads. However, in 2025, it was Intel's stock that outperformed, up nearly 80% as of this writing, compared to a 40% gain for Taiwan Semiconductor Manufacturing.\nLet's look at which stock is set up to outperform in 2026.\nThe case for Taiwan Semiconductor Manufacturing Taiwan Semiconductor Manufacturing, or TSMC for short, is the world's largest semiconductor foundry on the planet. Due to its technological expertise and scale, the company manufactures the vast majority of advanced chips, such as graphics processing units (GPUs) . It counts Nvidia , Apple , and Broadcom among its top customers.\n\nIn chip manufacturing, the goal is to consistently push down node sizes, which refers to the transistor density of the chips. The more transistors that can be fit on a chip, the more powerful and energy efficient they become. However, producing advanced chips at scale is difficult, and TSMC's main competitors, including Intel and Samsung , have struggled with yields (the number of defects per wafer). Meanwhile, nearly three-quarters of its production is at 7nm nodes and below, and it is set to move to 2nm technology next year.\nGiven its position in the industry, TSMC is the go-to partner for chip designers. It works closely with companies like Nvidia to grow capacity to meet their projected demand. And, as the only foundry that can really make these advanced chips at scale with high yields, it has also garnered strong pricing power. The company is set to raise prices once again next year, while the cost of its new 2nm processing technology is forecasted to be 50% higher than its 2nm technology.\n\nTSMC is well-positioned to continue to benefit from the ongoing artificial intelligence (AI) infrastructure buildout and sees AI chip demand growing by more than a 40% compound annual growth rate (CAGR) over the next few years.\nThe case for Intel Intel stock's outperformance in 2025 wasn't really a result of its operational performance. The company has struggled to grow its revenue, and it felt a lot of gross margin pressure in the first half of the year. However, it did see a huge rebound in adjusted gross margins in Q3, with it climbing from 18% a year ago to 40%. Revenue, meanwhile, edged up 3%.\n\nStory Continues\nThe biggest reasons for Intel's gains in 2025 were from the high-profile investments others made into the company's stock. Nvidia made a $5 billion equity investment in the company, while SoftBank invested $2 billion. Meanwhile, the U.S. government made an $8.9 billion investment. These investments, along with the 51% sale of its Altera business for $5.2 billion, helped Intel end Q3 with nearly $31 billion in cash on its balance sheet.\n\nThe company will use that cash to keep building out its foundry business and advance its chip manufacturing technology. Meanwhile, it is collaborating with Nvidia on new products, including integrating its central processing units (CPUs) with Nvidia's NVLink system to allow its CPUs to communicate more quickly with Nvidia's GPUs. This would help give Intel a nice advantage in the data center CPU market, where it has been losing share to Advanced Micro Devices . Separately, Intel is also working on its own AI chips designed for inference, and it is supposedly close to a deal with SambaNova Systems to further its efforts in this area.\nThe verdict Intel's 2025 performance was largely from events that won't repeat in 2026. For the company to outperform next year, it's probably going to need to win a large foundry customer or show major progress in data center chips, either with its CPUs or GPU efforts. That makes the stock more of a wildcard.\n\nTSMC, meanwhile, is the much safer choice. The company is set to benefit from the continued AI data center buildout, and its path forward is much clearer. As such, it's my pick to outperform in 2026.\nShould you buy stock in Intel right now? Before you buy stock in Intel, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Intel wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $506,935 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,067,514 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 958 % — a market-crushing outperformance compared to 192% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nGeoffrey Seiler has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Apple, Intel, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nIntel vs. Taiwan Semiconductor Manufacturing: Which Stock Will Outperform in 2026? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "01:04:16",
      "Source": "Reuters",
      "Title": "Nvidia-Intel deal cleared by US antitrust agencies",
      "URL": "https://finance.yahoo.com/news/nvidia-intel-deal-cleared-us-170416066.html",
      "Content": "Nvidia-Intel deal cleared by US antitrust agencies\n\nReuters\nFri, December 19, 2025 at 9:04 AM PST\n\nIn this article: NVDA\n\nINTC\n\nTSM\n\nAMD\n\nDec 19 (Reuters) - U.S. antitrust agencies ​have cleared Nvidia 's ‌investment in Intel, according ‌to a notice posted by the U.S. Federal Trade ⁠Commission.\nWhile ‌the notice did not specify the ‍details of the transaction, Nvidia said in ​September it ‌would invest $5 billion in Intel, throwing its heft behind the struggling U.S. chipmaker ⁠in a ​deal that ​could pose risks for rival manufacturers, ‍Taiwan's ⁠TSMC and U.S.-based AMD.\n(Reporting by Jody ⁠Godoy in New ‌York, Editing by ‌Franklin Paul)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "01:01:02",
      "Source": "GuruFocus.com",
      "Title": "US Reopens China's Door to Nvidia Chips--But Risks Undermining Its AI Edge",
      "URL": "https://finance.yahoo.com/news/us-reopens-chinas-door-nvidia-170102157.html",
      "Content": "US Reopens China's Door to Nvidia Chips--But Risks Undermining Its AI Edge\n\nKhac Phu Nguyen\nFri, December 19, 2025 at 9:01 AM PST 2 min read\n\nIn this article: NVDA\n\nAMD\n\nINTC\n\nThis article first appeared on GuruFocus .\nPolicy shifts in Washington have reopened a sensitive debate around Nvidia ( NASDAQ:NVDA ) and the balance between commercial opportunity and national security in advanced semiconductors. Earlier this month, the White House granted Nvidia permission to resume shipments of its H200 artificial intelligence chips to China, while also loosening restrictions on Intel and Advanced Micro Devices ( NASDAQ:AMD ). Although the H200 is not Nvidia's most advanced product, it remains meaningfully ahead of Chinese-made alternatives. Research cited from the Institute for Progress suggests the H200 delivers 32% more processing power and 50% more memory bandwidth than Huawei's Ascend 910C, while also being cheaper to operate and more reliable, reinforcing its appeal for AI model training and deployment.\n\nWarning! GuruFocus has detected 4 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nSupporters of the decision argue the policy could help slow China's domestic chip development by keeping Chinese customers dependent on US technology, while preserving revenue streams that US firms could reinvest into future semiconductor innovation. They point to concerns that Huawei may be closing the gap by linking more chips together and potentially expanding production next year. However, Commerce Department estimates indicate Huawei is expected to produce about 200,000 Ascend chips this year, compared with roughly 14 million AI chips deployed by US companies, raising questions about whether domestic supply can meaningfully satisfy Chinese demand. Under the current framework, companies must still apply for licenses to import H200s, and US officials have indicated the government would take a 25% cut of any such sales.\n\nCritics caution that allowing H200 exports could gradually chip away at what remains the US's largest advantage in AI: aggregate computing power. As of mid-2025, the US accounted for nearly three-quarters of global AI supercomputer capacity, compared with about 14% for China, a gap seen as critical for training frontier models. There is concern that Chinese authorities could direct imported H200s toward leading firms and, through civilian channels, into defense-related research, potentially accelerating advances in both commercial AI and military applications. With bipartisan support in Congress for tighter controls, lawmakers are expected to scrutinize the administration's assumptions on Huawei's progress and weigh testimony from AI developers and cloud providers on whether the current approach strengthens, or possibly undermines, long-term US competitiveness in artificial intelligence.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "00:21:07",
      "Source": "GuruFocus.com",
      "Title": "Why Advanced Micro Devices Stock Is Jumping Today",
      "URL": "https://finance.yahoo.com/news/why-advanced-micro-devices-stock-162107644.html",
      "Content": "Why Advanced Micro Devices Stock Is Jumping Today\n\nNauman Khan\nFri, December 19, 2025 at 8:21 AM PST 1 min read\n\nIn this article: AMD\n\nNVDA\n\nINTC\n\nThis article first appeared on GuruFocus .\nAdvanced Micro Devices ( NASDAQ:AMD ) shares climbed about 4% on Friday morning after Chief Executive Lisa Su met with China's Commerce Minister Wang Wentao in Beijing.\nThe ministry said the two sides discussed AMD's business operations in China and ways to deepen cooperation. It did not provide financial details or timelines tied to any potential outcomes.\n\nThe meeting comes as Washington reviews export policies tied to advanced artificial intelligence chips. The Trump administration has begun a review that could allow initial shipments of Nvidia's ( NASDAQ:NVDA ) H200 graphics processing units to China.\nWarning! GuruFocus has detected 5 Warning Signs with AMD.\nIs AMD fairly valued? Test your thesis with our free DCF calculator.\nPresident Trump said earlier this month he had approved sales of Nvidia's H200 GPUs to Chinese customers. He added that a similar approach would likely apply to AMD, Intel ( NASDAQ:INTC ), and other U.S. chipmakers.\nAny change in export policy could affect revenue prospects for U.S. semiconductor companies with exposure to China, one of the world's largest markets for data center and AI hardware.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "00:04:01",
      "Source": "Yahoo Finance",
      "Title": "Nvidia stock gains on Trump chip export review, sparking rally in chipmakers",
      "URL": "https://finance.yahoo.com/news/nvidia-stock-gains-on-trump-chip-export-review-sparking-rally-in-chipmakers-160401242.html",
      "Content": "Nvidia stock gains on Trump chip export review, sparking rally in chipmakers\n\nGrace O'Donnell · Editor, Special Projects\nUpdated Fri, December 19, 2025 at 8:05 AM PST 2 min read\n\nIn this article: NVDA\n\nAVGO\n\nMU\n\nAMD\n\nINTC\n\nNvidia stock ( NVDA ) jumped as much as 3.7% in early trading on Friday following a Reuters report that the Trump administration began its review of Nvidia H200 chip exports to China.\nThe move higher put shares of the world's largest company on track for a weekly gain, as investors viewed the news as a sign that President Trump would follow through on his promise to allow Nvidia to sell advanced chips to China in exchange for a 25% fee to the government.",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "23:00:40",
      "Source": "Barchart",
      "Title": "Stocks Supported by Strength in Cloud Stocks and Chip Makers",
      "URL": "https://finance.yahoo.com/m/4fd7a5ad-a021-3b53-8bd8-9a6a32d1cf60/stocks-supported-by-strength.html",
      "Content": "Stocks Supported by Strength in Cloud Stocks and Chip Makers\n\nRich Asplund\nFri, December 19, 2025 at 7:00 AM PST 7 min read\n\nIn this article: ORCL\n\nAPLD\n\n$IUXX\n\nSATS\n\nAMD\n\nThe S&P 500 Index ($SPX) (SPY) today is up by +0.63%, the Dow Jones Industrials Index ($DOWI) (DIA) is up by +0.52%, and the Nasdaq 100 Index ($IUXX) (QQQ) is up by +1.08%. March E-mini S&P futures (ESH26) are up +0.61%, and March E-mini Nasdaq futures (NQH26) are up +1.09%.\n\nStock indexes are moving higher today as a rally in cloud infrastructure stocks improves market sentiment and lifts the broader market. Oracle is up by more than 7% after TikTok CEO Chew said his company has signed binding agreements to create a US joint venture owned by American investors, including Oracle. Also, strength in chipmakers today supports the broader market.\nMore News from Barchart Is Cathie Wood Jumping Ship on Tesla Stock?\nBeyond Nvidia: The AI Stock to Buy With 205% Upside Potential\nAs Nvidia Launches New Nemotron 3 Models, Should You Buy, Sell, or Hold NVDA Stock?\nTired of missing midday reversals? The FREE Barchart Brief newsletter keeps you in the know. Sign up now!\nHigher bond yields are limiting gains in stocks today, as the 10-year T-note yield is up +3 bp to 4.15%. Global bond yields are climbing today, led by a surge in the 10-year Japanese government bond yield to a 26-year high of 2.025% after the BOJ raised interest rates and said it will keep raising rates if its economic and price outlook is realized.\n\nUpbeat comments today from New York Fed President John Williams were supportive for stocks but negative for bonds, as he said some data we're seeing is \"pretty encouraging\" and he sees no sign of sharp deterioration in the jobs data. He added that he sees US GDP growth of 1.5% to 1.75% this year, with growth picking up next year, and that there's \"no urgency to need to act further on monetary policy right now, because I think the cuts we've made have positioned us really well.\"\nStock market moves may be exaggerated and more volatile than usual today due to the expiration of options, futures, and derivatives during the quarterly event known as triple witching. According to Citigroup, a record $7.1 trillion of notional open interest will roll off the US options market today.\n\nThis week's market focus will be on US economic news. Later today, Nov existing home sales are expected to be up +1.2% m/m to 4.15 million. Also, the University of Michigan Dec consumer sentiment index is expected to be revised upward by +0.2 to 53.5 from the previously reported 53.3.\nThe markets are discounting a 20% chance that the FOMC will cut the fed funds target range by 25 bp at the next FOMC meeting on January 27-28.\n\nStory Continues\nOverseas stock markets are higher today. The Euro Stoxx 50 is up +0.04%. China’s Shanghai Composite climbed to a 1-week high and closed up +0.36%. Japan’s Nikkei Stock 225 closed up +1.03%.\nInterest Rates\nMarch 10-year T-notes (ZNH6) today are down by -7 ticks. The 10-year T-note yield is up +2.7 bp to 4.149%. Today's strength in stocks has reduced safe-haven demand for government debt securities and is weighing on T-notes. Also, hawkish comments from New York Fed President John Williams are undercutting T-note prices after he said some of the data we're seeing is \"pretty encouraging\" and that he sees no sign of sharp deterioration in the jobs data. In addition, T-notes have a negative carryover from today’s jump in the 10-year Japan government bond yield to a 26-year high of 2.025%.\n\nThe steepening yield curve is also bearish for T-note prices. Steepening trades occur when bond investors buy short-term government debt and sell long-term debt. The yield curve has steepened since last Wednesday’s FOMC meeting, when the Fed said it would begin purchasing up to $40 billion of short-term T-bills a month to boost liquidity in the financial system. Longer-term Treasury securities are also under pressure from concerns about inflation and the Fed’s independence.\nEuropean government bond yields are moving higher today. The 10-year German bund yield is up +3.4 bp to 2.884%. The 10-year UK gilt yield is up +3.8 bp to 4.518%.\nGerman Nov PPI fell -2.3% y/y, weaker than expectations of -2.2% y/y and the steepest pace of decline in 20 months.\n\nThe German Jan GfK consumer confidence index unexpectedly fell -3.5 to a 1.75-year low of -26.9, weaker than expectations of an increase to -23.0.\nUK Nov retail sales ex-auto fuel unexpectedly fell -0.2% m/m, weaker than expectations of an increase of +0.1% m/m.\nSwaps are discounting a 1% chance for a -25 bp rate cut by the ECB at its next policy meeting on February 5.\nUS Stock Movers\nCloud infrastructure stocks are rallying today as they recover from a recent sell-off on financing concerns in the AI supply chain. CoreWeave (CRWV) is up +8%, and Oracle (ORCL) is up more than +7% to lead gainers in the S&P 500. Also, Applied Digital (APLD) is up more than +4%, and Nebius Group NV (NBIS) is up more than +3%.\nChip stocks are moving higher today, a supportive factor for the overall market. Micron Technology (MU) is up more than +6% to lead gainers in the Nasdaq 100. Also, Lam Research (LRCX) is up more than +3%, and Nvidia (NVDA) is up more than +2% to lead gainers in the Dow Jones Industrials. In addition, Advanced Micro Devices (AMD), Applied Materials (AMAT), KLA Corp (KLAC), NXP Semiconductors NV (NXPI), and Intel (INTC) are up more than +2%. Finally, GlobalFoundries (GFS), Broadcom (AVGO), and Marvell Technology (MRVL) are up more than +1%.\n\nCryptocurrency-exposed stocks are climbing today, with Bitcoin (^BTCUSD) up more than +2%. Galaxy Digital Holdings (GLXY) and Riot Platforms (RIOT) are up more than +4%. Also, Strategy (MSTR) and Mara Holdings (MARA) are up more than +2%, and Coinbase Global (COIN) is up more than +1%.\nWhitefiber Inc (WYFI) is up more than +16% following the announcement of a 10-year 40 megawatt co-location agreement between its subsidiary Enovum Data Centers Corp. and Nscale Global Holdings, representing around $865 million in contracted revenue.\nEchostar Corp (SATS) is up more than +4% after Deutsche Bank raised its price target on the stock to $131 from $97.\nGenerac Holdings (GNRC) is up more than +2% after Wells Fargo Securities upgraded the stock to overweight from equal weight with a price target of $195.\n\nStryker Corp (SYK) is up more than +1% after Citizens JMP Securities LLC upgraded the stock to outperform from market perform with a price target of $440.\nCummins Inc (CMI) is up more than +1% after Barclays upgraded the stock to overweight from equal weight with a price target of $546.\nLamb Weston Holdings (LW) is down more than -19% to lead losers in the S&P 500 after forecasting full-year net sales of $6.35 billion to $6.55 billion, the midpoint below the consensus of $6.52 billion.\nNike (NKE) is down more than -9% to lead losers in the Dow Jones Industrials after forecasting Q3 revenue down in the low single digits and gross margins down about 175 to 225 basis points, amid persistent weakness in China.\nKB Home (KBH) is down more than -7% after reporting Q4 EPS of $1.55, weaker than the consensus of $1.79, and forecasting 2026 housing revenue of $5.10 billion to $6.10 billion, the midpoint below the consensus of $5.83 billion.\n\nLyft Inc (LYFT) is down more than -4% after Wedbush Securities downgraded the stock to underperform from neutral with a price target of $16.\nKBR Inc (KBR) is down more than -4% after Truist Securities cut its price target on the stock to $50 from $62.\nPaychex (PAYX) is down more than -3% to lead losers in the Nasdaq 100 after BMO Capital Markets said the company’s Q2 earnings signaled an “okay quarter,” but management-solutions growth was softer.\nFedEx (FDX) is down more than -2% after Morgan Stanley downgraded the stock to underweight from neutral with a price target of $210.\nElevance Health (ELV) is down more than -1% after Deutsche Bank downgraded the stock to hold from buy, citing a challenging macro environment.\nEarnings Reports(12/19/2025)\nCarnival Corp (CCL), Conagra Brands Inc (CAG), Lamb Weston Holdings Inc (LW), Paychex Inc (PAYX).\nOn the date of publication, Rich Asplund did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "21:34:11",
      "Source": "GuruFocus.com",
      "Title": "Big Tech Backs DOE's Genesis AI Mission",
      "URL": "https://finance.yahoo.com/news/big-tech-backs-does-genesis-133411420.html",
      "Content": "Big Tech Backs DOE's Genesis AI Mission\n\nMoz Farooque ACCA\nFri, December 19, 2025 at 5:34 AM PST 1 min read\n\nIn this article: AMZN\n\nOPAI.PVT\n\nORCL\n\nPLTR\n\nDELL\n\nThis article first appeared on GuruFocus .\nAmazon ( NASDAQ:AMZN ), Google (GOOGL), and Microsoft (MSFT) are stepping into a much bigger role in U.S. science and energy policy, teaming up with the Department of Energy on a new initiative called the Genesis Mission.\nWarning! GuruFocus has detected 8 Warning Signs with F.\nIs GOOG fairly valued? Test your thesis with our free DCF calculator.\n\nThe effort brings together 24 companies to use AI to speed up scientific discovery, strengthen national security, and drive energy innovation. The goal is to let AI handle more of the heavy lifting, from designing experiments to running complex simulations and building predictive models. DOE officials say that could dramatically shorten the time it takes for researchers to move from ideas to real world breakthroughs.\nAlongside the major cloud providers, the group includes Nvidia ( NASDAQ:NVDA ), AMD ( NASDAQ:AMD ), Intel ( NASDAQ:INTC ), OpenAI (OPENAI), Oracle ( NYSE:ORCL ), Palantir ( NASDAQ:PLTR ), Dell ( NYSE:DELL ), and IBM (IBM), many of which already work closely with U.S. national labs. White House officials described the partnerships as just the beginning of a broader national AI platform for research.\nFor investors, this is not about near term sales. It is about positioning. The Genesis Mission shows how tightly big tech, AI infrastructure, and government priorities are becoming linked as demand for compute and energy continues to grow.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "20:57:38",
      "Source": "GuruFocus.com",
      "Title": "Amazon, Google, and Microsoft Join U.S. Energy Department's 'Genesis Mission'",
      "URL": "https://finance.yahoo.com/news/amazon-google-microsoft-join-u-125738758.html",
      "Content": "Amazon, Google, and Microsoft Join U.S. Energy Department's 'Genesis Mission'\n\nFaizan Farooque\nFri, December 19, 2025 at 4:57 AM PST 1 min read\n\nIn this article: AMZN\n\nGOOG\n\nMSFT\n\nACN\n\nAMD\n\nThis article first appeared on GuruFocus .\nThe U.S. Department of Energy announced new partnerships with 24 major technology firms , including Amazon ( AMZN , Financials ), Google, and Microsoft, to advance the Genesis Mission, a national program to apply artificial intelligence to energy research and scientific discovery.The Genesis Mission will employ AI to automate experiment design, expedite simulations, and produce predictive models to advance renewable energy, manufacturing, and medicine discovery, according to DOE officials.Accenture, AMD, Anthropic, Amazon Web Services, Cerebras, CoreWeave, Dell, Google, HPE, IBM, Intel, Microsoft, Nvidia, OpenAI, Oracle, Palantir, and xAI are participating. These companies have started or showed interest in DOE-National Laboratories initiatives.Michael Kratsios, Director of the White House Office of Science and Technology Policy, called the agreements only the beginning of public-private AI research collaboration. DOE Under Secretary for Science and Genesis Mission Director Dario Gil said the effort complements President Trump's executive order to create a national AI platform for scientific research.The Genesis Mission is one of the most extensive government-led AI innovation coordination projects spanning business, academia, and governmental research organizations. Industry analysts anticipate the initiative to boost U.S. applied AI competitiveness and bridge cloud and semiconductor leaders in high-performance computing.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "19:00:24",
      "Source": "Yahoo Finance Video",
      "Title": "The top 10 trending tickers of 2025 on Yahoo Finance",
      "URL": "https://finance.yahoo.com/video/top-10-trending-tickers-2025-110024376.html",
      "Content": "The top 10 trending tickers of 2025 on Yahoo Finance\n\nYahoo Finance Video and Jared Blikre\nFri, December 19, 2025 at 3:00 AM PST\n\nIn this video: TSLA\n\nNVDA\n\nSMCI\n\nPLTR\n\nAMD\n\nNvidia ( NVDA ), Tesla ( TSLA ), and Palantir ( PLTR ) are some of the top-viewed ticker pages on Yahoo Finance in 2025.\nYahoo Finance Markets and Data Editor Jared Blikre , who also hosts Yahoo Finance's Stocks in Translation podcast , examines the 10 most popular ticker pages on Yahoo Finance, with AI names dominating the list, with the exception of bitcoin ( BTC-USD ).\nCatch more Stocks in Translation , with new episodes every Tuesday and Thursday.\nTo watch more expert insights and analysis on the latest market action, check out more Market Catalysts .\n\nVideo Transcript\n\n00:04 Speaker A\n2025 has been a year of surprises. At the outset, many pros were doubting that year three of this bull market could match the outside gains of the prior two.\n00:13 Speaker A\nBut the AI trade keeps driving attention and driving behavior. And on today's stocks in translation, we're not looking at the best performers of 2025. We are looking at the names that you, the viewers, checked in on the most on the Yahoo Finance platform. And we're breaking down our top 10 trending tickers of 2025.\n00:32 Speaker A\nSo let's take a look at the scores on the door. and here we got the top 10 tickers. The first thing you might notice is that this is an AI dominated list with maybe Bitcoin in the middle as the exception.\n00:46 Speaker A\nThen you're going to see the perennial favorites, uh that's Nvidia and Tesla to the left there. They are in a different zip code. Our Nvidia quote page has a cool quarter billion page views this year, while Tesla clocks in at over 180 million.\n01:03 Speaker A\nAnd while Apple is usually top three, it was edged out this year by Palantir with nearly 100 million views. And from there things stabilize as AMD, Amazon, Bitcoin, Meta, Super Micro and Intel, they all clocked 40 to 60 million viewers each.\n01:17 Speaker A\nNow, let's take a look at this list from a different perspective. This is our Yahoo Finance heat map and we're looking at the box size right here. So each box size corresponds to the market cap of the company and all of these are large to mega caps with two in the $4 trillion bucket. That would be Nvidia and Apple,\n01:36 Speaker A\nall the way down to Intel over here at 180 billion. and in the far lower right, you almost can't see it there. You can see Super Micro, which is just shy of $20 billion. But the other thing you might notice is that the only losing ticker this year is Bitcoin, although Amazon is pretty close to break even too.\n01:52 Speaker A\nSo each of these has a different story. Now let's dive into some of the charts that really uh tell this story and this is going to be a year-to-date. So we'll start with Nvidia here. This has arguably been the poster child for the entire AI trade and you can see it got kind of sucked into the post liberation day redness there, but it has bounced back strong.\n02:09 Speaker A\nReally hasn't done much over the last few months, but with 30% gains in a year after almost being up, what is it? a thousand percent over the last three years. There you go, 963%. I think investors are going to take that.\n02:19 Speaker A\nNow Tesla. Tesla's really interesting because over the last year, and this is a three-year chart too, it has traced out a cup and handle formation. If it can break above 480, it has the ability to really break out and 2026 could be the year to do this. If it fails at this level, well, maybe it's got to consolidate a little bit longer.\n02:37 Speaker A\nNow, let's take a look at Palantir. This stock is up 2,500% over the last three years. Let's dial down to a year-to-date and you can see like Nvidia, it hasn't really done much over the last few months, but still sitting on 140% year-to-date gains.\n02:50 Speaker A\nNow, Apple year to date, this stock is only up 9%, but it has come back nicely after it just kind of stalled out after the liberation day uh melee where a lot of stocks were taking off, it was going sideways, but it finally caught up over the last few months. and so Apple has been generating recent record highs even as Nvidia has been going sideways.\n03:07 Speaker A\nNow here's AMD to round out the top five, 71% year to date. This is a very volatile stock, but again, I think investors will uh happily hold on to gains like that for a stock like AMD.\n03:16 Speaker A\nNow, Amazon, barely positive for the year. This is a stock you kind of got to look at over this entire three-year bull market. Still up 150%, but this was a year of consolidation. We'll have to see if 2026 breaks to the upside or the downside.\n03:30 Speaker A\nAnd you know what? Bitcoin is a very similar story, sitting on more gains over the last three years, but this has been a year of consolidation. It happens to be down about 10% right now, and 75,000 is a line in the sand that I am watching. I think that gets hit before it takes off again.\n03:44 Speaker A\nThen Meta, this is another three-year story. Uh hasn't done much this year, but we'll have to see if it can continue the trend. 445%, very strong over this bull market.\n03:53 Speaker A\nGetting towards the end here. Super Micro is a very volatile stock and while it's up this year a decent percentage, you can see it was up a lot more in early 2024. So this is one of those high beta plays you got to trade with caution, but guess what, the Yahoo Finance audience loves to day trade this stock.\n04:06 Speaker A\nAnd finally here's Intel. This is another kind of uh sine wave pattern here. Let me just dial this down to year to date so you can see it has really taken off over the last few months. It's become a volatile stock, but it was doing nothing for the first 6, seven, eight months of the year. So I think investors at the end of the day, at the end of the year going to be pleased with this one.\n04:24 Speaker A\nSo let us dial it back down here. I got a few things that are going to tell us what to watch in 2026. So just think of these as the questions that move these tickers. First is the AI spend payback test. Investors are going to want to see the revenue and not just the profits of these uh companies, not just the spending.\n04:42 Speaker A\nAnd the next up is margins versus Mega Cap spending. Can these giants keep growing without the profit engine getting dented? Third, keep an eye on the chip cycle inflection point. Does demand for semiconductors, does it broaden out or is it just stay limited to AI?\n04:59 Speaker A\nFourth, watch those crypto regulation headlines. 2025 was arguably the best year ever for crypto regulation and Bitcoin isn't even positive. So let's see if sentiment can shift. And finally, monitor those rate cuts versus the real economy. If we get more cuts, ask why. Is it a soft landing scenario or are we sinking into recession?\n05:17 Speaker A\nBottom line, these were the tickers investors just could not stop watching in 2025. Next year, what matters is whether the stories hold up and that's where the rubber meets the road. And tune into the Stocks and Translation podcast for more jargon busting deep dives. New episodes can be found Tuesdays and Thursdays on Yahoo Finance's website or wherever you find your podcast.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "18:25:30",
      "Source": "Benzinga",
      "Title": "NVDA Stock Price Prediction: Where Nvidia Could Be by 2025, 2026, 2030",
      "URL": "https://finance.yahoo.com/news/nvda-stock-price-prediction-where-070852948.html",
      "Content": "NVDA Stock Price Prediction: Where Nvidia Could Be by 2025, 2026, 2030\n\nAJ Fabino\nFri, December 19, 2025 at 2:25 AM PST 8 min read\n\nIn this article: NVDA\n\nSOFI\n\nAMD\n\nINTC\n\nBenzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\nAnalysts are saying Nvidia could hit 920.09 dollars by 2030, a projection that has many investors assessing whether NVDA still has room to run after years of explosive gains. If you're bullish and want a simple, low-cost way to invest, SoFi lets you trade Nvidia stock with no commissions, and new users who fund their account can receive up to 1,000 dollars in stock . Plus, anyone who transfers existing investments to SoFi and keeps them there through December 31, 2025, can earn an additional 1 percent bonus, offering even more upside for new investors.\n\nNvidia Corp (NASDAQ: NVDA ) has evolved from a graphics-chip manufacturer into the backbone of the modern artificial intelligence boom. As companies scale generative AI, autonomous systems and data-intensive cloud applications, Nvidia's GPUs have become central infrastructure powering these technological shifts. After soaring 171 percent in 2024 and adding another 26 percent in 2025, many investors are now weighing whether Nvidia's valuation still leaves enough room for meaningful future gains.\nDon’t Miss:\nMissed Nvidia and Tesla? RAD Intel could be the next AI powerhouse — join 10,000+ early backers and invest now just $0.81 per share .\nWarren Buffett once said, \"If you don't find a way to make money while you sleep, you will work until you die.\" Here’s how you can earn passive income with $100 .\n\nThis forecast examines Nvidia's financial standing and uses a structured methodology to outline potential price targets for 2025, 2026 and 2030. By blending analyst sentiment, valuation metrics and algorithmic projections, it offers a clearer picture of where NVDA could be headed both in the near term and over the next decade.\nCurrent Overview Trading above 180 dollars as of October 2025\nMarket Cap: 4.37 trillion dollars\nTrailing P/E Ratio: 51.23\nGross Margins: near 70 percent\nYTD Performance: over 30 percent\nNvidia continues to report exceptional fundamentals, driven largely by its data center division, which remains the company's strongest revenue engine thanks to global AI demand from major technology firms and enterprise cloud platforms. Gross margins remain robust, earnings consistently exceed expectations and the company's leadership role in high-performance computing continues to set it apart from competitors.\n\nInvestor sentiment remains overwhelmingly positive. Out of 48 analysts, 43 rate Nvidia as a Buy or Strong Buy, reflecting strong confidence in its long-term prospects. The average 12-month price target sits around 209.97 dollars, with projections ranging from 100 dollars on the low end to 250 dollars on the high end. Still, valuation concerns linger, along with fears that competition from AMD, Intel and new AI-focused players could chip away at Nvidia's premium positioning.\n\nStory Continues\nQuick Snapshot Table of Predictions\n\nYear\nBullish Prediction\nAverage Prediction\nBearish Prediction\n2025\n183.13\n178.84\n173.92\n2026\n308.56\n207.13\n170.15\n2027\n566.89\n442.32\n285.19\n2028\n628.83\n537.29\n396.17\n2029\n873.74\n719.91\n493.76\n2030\n863.77\n799.05\n774.93\n2031\n1029.59\n950.43\n848.77\n2032\n1069.34\n1010.52\n920.01\n2033\n1226.54\n1127.95\n993.88\n2040\n2358.25\n2228.74\n2028.93\n2050\n6367.97\n5786.71\n5596.95\n\nThese forecasts are based on algorithmic modeling by CoinCodex, which assesses historical price movement, volatility cycles and long-term trend behavior across multiple time horizons.\nBull and Bear Case Bull Case The bull case for Nvidia centers on its unparalleled profitability and dominance across the AI supply chain. With net profit margins above 50 percent and gross margins holding near 70 percent, Nvidia remains one of the most financially efficient companies in the tech sector. Institutional support is strong, as shown by the overwhelming majority of Buy-rated analyst recommendations. Valuation multiples such as P/E and forward P/E have eased from their peak levels, suggesting healthier entry points compared to earlier years. Nvidia's low debt profile and consistent free cash flow growth further reinforce the thesis that it will continue to lead long-term AI infrastructure and data center expansion, giving bulls confidence in sustained multiyear upside.\n\nBear Case The bear case focuses on the early signs of slowing growth across key financial indicators. Earnings per share, net income and free cash flow are still rising, but at a noticeably slower rate than their three-year averages. Nvidia's valuation metrics, including PEG ratio, EV/Sales and EV/EBITDA, remain elevated relative to industry competitors, raising concerns that the stock may still be priced for perfection. The company's dividend yield is extremely low and recent growth in dividend payouts has stagnated, limiting appeal for income-driven investors. Bears argue that if financial momentum continues to cool and competition intensifies, Nvidia may struggle to justify the lofty expectations currently embedded in its share price.\n\nNvidia Stock Price Prediction for 2025 Bullish Prediction: 183.13 dollars\nAverage Prediction: 178.84 dollars\nBearish Prediction: 173.92 dollars\nNvidia's 2025 outlook reflects cautious optimism, with modest upside expected if the company continues executing on its AI and data center roadmap. Its premium valuation signals strong confidence from the market, but it also leaves little room for disappointment. Any signs of slowing demand, regulatory pressure or margin compression could trigger volatility in the short term.\n\nNvidia Stock Price Prediction for 2026 Bullish Prediction: 308.56 dollars\nAverage Prediction: 207.13 dollars\nBearish Prediction: 170.15 dollars\nThe 2026 projections suggest that Nvidia's long-term trajectory will depend heavily on its ability to maintain pricing power despite rising competition. Some models anticipate more moderate returns as valuations stabilize and GPU demand normalizes. However, Nvidia's entrenched position across cloud infrastructure and AI-driven enterprise ecosystems may provide resilience even in a cooling market, helping extend its revenue expansion through mid-decade.\n\nNvidia Stock Price Prediction for 2030 Bullish Prediction: 863.77 dollars\nAverage Prediction: 799.05 dollars\nBearish Prediction: 774.93 dollars\nBy 2030, Nvidia's growth story becomes tightly interwoven with the long-term strength of the AI revolution. If demand for accelerated computing continues its upward trajectory and Nvidia sustains leadership in next-generation architectures, the company could see substantial long-term appreciation. Conservative models still show meaningful compounding returns through the end of the decade. However, risks remain, including intensified competition, cyclical demand disruptions and greater regulatory scrutiny surrounding AI hardware.\n\nInvestment Considerations Nvidia remains a quintessential growth stock — a pure play on next-generation computing and AI hardware infrastructure. Institutional ownership is strong, and retail investor enthusiasm remains high, but these factors also reflect elevated expectations built into the current share price. While Nvidia pays a dividend, its yield is negligible, functioning more as an indicator of corporate strength than an income generator.\n\nKey risks include competition from AMD and Intel, the possibility of slowing AI adoption, regulatory headwinds and global supply chain constraints. Still, Nvidia's deep integration into cloud ecosystems, its unmatched GPU leadership and its alignment with long-term technological megatrends make it one of the most compelling — and scrutinized — companies in the global market.\nBuilding Wealth Across More Than Just the Market When evaluating any stock price forecast, it's wise to think about portfolio balance and not rely on a single company's trajectory. Markets shift quickly, and putting all of your capital into one sector or stock can increase risk. Many investors are turning to platforms that open the door to real estate, professional financial advice, fixed-income products, and even self-directed retirement options. These tools make it easier to diversify, smooth out volatility, and build wealth across multiple asset classes over time.\n\nArrived Backed by Jeff Bezos, Arrived Homes makes real estate investing accessible with a low barrier to entry. Investors can buy fractional shares of single-family rentals and vacation homes starting with as little as $100 . This allows everyday investors to diversify into real estate, collect rental income, and build long-term wealth without needing to manage properties directly.\n\nIRA Financial Self-directed investors looking to take greater control of their retirement savings may consider IRA Financial. The platform enables you to use a self-directed IRA or Solo 401(k) to invest in alternative assets such as real estate, private equity, or even crypto . This flexibility empowers retirement savers to go beyond traditional stocks and bonds, building diversified portfolios that align with their long-term wealth strategies.\n\nMoomoo Idle Cash Moomoo isn't just for trading — it's also one of the most attractive places to park cash. New users can earn a promotional 8.1% APY on uninvested cash , combining a 3.85% base rate with a 4.25% booster once activated. On top of that, eligible new users can also score up to $1,000 in free Nvidia stock—but the real draw here is the ability to earn bank-beating interest rates without having to move into riskier assets.\n\nRange Wealth Management Range Wealth Management takes a modern, subscription-based approach to financial planning. Instead of charging asset-based fees, the platform offers flat-fee tiers that provide unlimited access to fiduciary advisors along with AI-powered planning tools . Investors can link their accounts without moving assets, while higher-level plans unlock advanced support for taxes, real estate, and multi-generational wealth strategies. This model makes Range especially appealing to high-earning professionals who want holistic advice and predictable pricing.\nSee Next:\nThe ‘ChatGPT of marketing' just opened a $0.81 per share round — 10,000+ investors are already in .\nGM-backed EnergyX is tackling the global lithium supply shortage — invest before global expansion at just $10 per share by October 30 .\nThis article NVDA Stock Price Prediction: Where Nvidia Could Be by 2025, 2026, 2030 originally appeared on Benzinga.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "08:12:14",
      "Source": "Simply Wall St.",
      "Title": "Are Intel's (INTC) Leadership Shifts And AI Rumors Quietly Rewriting Its Washington Strategy?",
      "URL": "https://finance.yahoo.com/news/intels-intc-leadership-shifts-ai-001214556.html",
      "Content": "Are Intel's (INTC) Leadership Shifts And AI Rumors Quietly Rewriting Its Washington Strategy?\n\nSimply Wall St\nThu, December 18, 2025 at 4:12 PM PST 3 min read\n\nIn this article: INTC\n\nIn recent days, Intel announced senior leadership changes across government affairs, marketing, and advanced technology strategy, while also facing fresh scrutiny from U.S. lawmakers over its evaluation of China-linked chipmaking equipment and sitting at the center of growing AI acquisition rumors involving SambaNova.\nTogether, these developments highlight how Intel is trying to deepen its influence in Washington and accelerate its AI ambitions even as regulatory and geopolitical risks intensify.\nNext, we’ll examine how Intel’s push into AI platforms via the reported SambaNova talks could reshape its existing investment narrative.\n\nThis technology could replace computers: discover 28 stocks that are working to make quantum computing a reality .\nIntel Investment Narrative Recap To own Intel today, you have to believe its AI and foundry turnaround can overcome execution issues, high investment needs, and geopolitical noise. Short term, the biggest catalyst is whether Intel can credibly expand its AI platform story, with the rumored SambaNova deal front and center. The key risk is regulatory and political pressure, particularly around China exposure and U.S. national security scrutiny. The latest Washington criticism looks material mainly as a headline and oversight risk, not an immediate earnings shock.\n\nAmong the recent announcements, the reported talks to acquire SambaNova are most relevant. SambaNova’s full stack AI racks could help Intel offer more complete AI platforms, a gap often cited versus rivals. If it progresses, this could reinforce Intel’s push to simplify its portfolio around AI workloads and improve perceptions of its long term AI roadmap, even as questions remain on foundry execution and the company’s ability to keep tightening OpEx and CapEx.\nYet investors should be aware that mounting national security scrutiny of Intel’s China related tooling choices could still...\nRead the full narrative on Intel (it's free!)\nIntel's narrative projects $58.1 billion revenue and $5.2 billion earnings by 2028.\nUncover how Intel's forecasts yield a $37.27 fair value , a 3% upside to its current price.\n\nExploring Other Perspectives Before this news, the most optimistic analysts assumed Intel could reach about US$62.1 billion of revenue and US$8.7 billion of earnings by 2028, a far brighter path than consensus. If you weigh that against fresh questions on lagging process nodes and high investment needs highlighted by recent scrutiny, it shows how far opinions can diverge and why it is worth exploring several viewpoints before deciding what you believe.\n\nStory Continues\nExplore 32 other fair value estimates on Intel - why the stock might be worth as much as 5% more than the current price!\nBuild Your Own Intel Narrative Disagree with existing narratives? Create your own in under 3 minutes - extraordinary investment returns rarely come from following the herd.\nA great starting point for your Intel research is our analysis highlighting 3 key rewards and 1 important warning sign that could impact your investment decision.\nOur free Intel research report provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate Intel's overall financial health at a glance.\n\nSearching For A Fresh Perspective? Every day counts. These free picks are already gaining attention. See them before the crowd does:\nThese 14 companies survived and thrived after COVID and have the right ingredients to survive Trump's tariffs . Discover why before your portfolio feels the trade war pinch.\nThe latest GPUs need a type of rare earth metal called Neodymium and there are only 35 companies in the world exploring or producing it . Find the list for free.\nUncover the next big thing with financially sound penny stocks that balance risk and reward .\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include INTC .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "04:12:03",
      "Source": "StockStory",
      "Title": "Marvell Technology (MRVL) Stock Is Up, What You Need To Know",
      "URL": "https://finance.yahoo.com/news/marvell-technology-mrvl-stock-know-201203934.html",
      "Content": "Marvell Technology (MRVL) Stock Is Up, What You Need To Know\n\nPetr Huřťák\nThu, December 18, 2025 at 12:12 PM PST 2 min read\n\nIn this article: MRVL\n\nTSM\n\nMU\n\nQCOM\n\nINTC\n\nWhat Happened? Shares of networking chips designer Marvell Technology (NASDAQ: MRVL) jumped 3.2% in the afternoon session after positive results from peer company Micron lifted the broader semiconductor sector.\nThe strong report created a ripple effect, boosting sentiment for chip-related companies. Marvell climbed alongside other industry players, as firms connected to memory and storage saw some of the most notable gains. For instance, Taiwan Semiconductor Manufacturing, Intel, Broadcom, and Qualcomm all recorded increases. The move highlighted investor optimism across the semiconductor space, reinforcing the view that companies like Marvell, which are key to AI infrastructure, were well-positioned.\n\nAfter the initial pop the shares cooled down to $84.30, up 3.1% from previous close.\nIs now the time to buy Marvell Technology? Access our full analysis report here .\nWhat Is The Market Telling Us Marvell Technology’s shares are extremely volatile and have had 42 moves greater than 5% over the last year. In that context, today’s move indicates the market considers this news meaningful but not something that would fundamentally change its perception of the business.\nThe previous big move we wrote about was 7 days ago when the stock dropped 3.8% on the news that reports revealed that China is moving to substitute US technology by adding domestic AI chips to its government procurement list.\n\nThis development is part of a broader \"buy local\" campaign aimed at reducing China's reliance on foreign technology, particularly from the United States, amid persistent trade and tech tensions. The Chinese government has updated its guidelines to include AI chips from homegrown companies like Huawei and Cambricon. This policy shift effectively steers government and state-affiliated buyers away from American semiconductor firms. For US chipmakers, this signals a potential loss of market share in one of the world's largest tech markets, raising concerns among investors about future revenue streams from the region.\nMarvell Technology is down 25.8% since the beginning of the year, and at $84.30 per share, it is trading 33.1% below its 52-week high of $126.06 from January 2025. Investors who bought $1,000 worth of Marvell Technology’s shares 5 years ago would now be looking at an investment worth $1,774.\nWhile Wall Street chases Nvidia at all-time highs, an under-the-radar semiconductor supplier is dominating a critical AI component these giants can’t build without. Click here to access our full research report .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "03:00:00",
      "Source": "Yahoo Finance Video",
      "Title": "Intel, Paramount are some of Wall Street's best comebacks of 2025",
      "URL": "https://finance.yahoo.com/video/intel-paramount-wall-streets-best-190000152.html",
      "Content": "Intel, Paramount are some of Wall Street's best comebacks of 2025\n\nYahoo Finance Video and Jared Blikre\nThu, December 18, 2025 at 11:00 AM PST\n\nIn this video: ALB\n\nALB-PA\n\nEL\n\nAPTV\n\nDLTR\n\nParamount Skydance ( PSKY ), Intel ( INTC ), and Estée Lauder ( EL ) are just some of the S&P 500 ( ^GSPC ) components that gained in 2025, rebounding from negative returns in 2024.\nYahoo Finance Markets and Data Editor Jared Blikre , who also hosts Yahoo Finance's Stocks in Translation podcast , takes a closer look at some of 2025's best comebacks.\nCatch more Stocks in Translation , with new episodes every Tuesday and Thursday.\nTo watch more expert insights and analysis on the latest market action, check out more Market Catalysts .\n\nVideo Transcript\n\n00:07 Speaker A\nAmerica loves a comeback story. So on today's stocks and translation, we are breaking down 11 2025 S&P 500 winners for you, but the twist is, many of these are still working their way back from pretty deep holes.\n00:20 Speaker A\nMethodology wise, we took all the S&P 500 names that were down at least 25% in 2024 and up at least 25% this year. And we discovered a few themes to track for next year.\n00:33 Speaker A\nFirst, let's look at the comeback leaderboard and it is a wild mix here. Here we have the first six names sorted by 2025 returns beginning with Paramount Skydance.\n00:44 Speaker A\nYou can see it in blue and it was down about 30% in 2024, and the orange bar is showing it's up 25% this year. It's merger drama this year is ongoing, and we're going to get into all the company stories in a minute.\n00:57 Speaker A\nFor now, just note the mix of industries from auto parts supplier Aptiv, steel company Nucor, well-known luxury brand Estee Lauder, chemical company Albemarle, critical for lithium production, and animal health and testing company, Idexx Labs, which is up nearly 70% this year.\n01:17 Speaker A\nAnd in the second group of names, we've got America's largest military ship builder on the left, Huntington Ingalls. It's up a cool 70% year to date. Then discount store Dollar Tree, followed by pharmacy giant CVS Health, chipmaker Intel, which is up 80% this year, along with another discount name, Dollar General.\n01:39 Speaker A\nNow, let's look at all of these names together in a heat map. And we have all of these set for year-to-date returns.\n01:49 Speaker A\nAnd a quick note first, most of these names are still down over the last two years, with the exception of CVX, Dollar General, Idexx, and Huntington.\n01:59 Speaker A\nSo, let's talk about some of these stories. First up, we got Intel. Now, this company is up 81% and it's the child the poster child for a comeback that's still not fixed.\n02:10 Speaker A\nBecause you had a really tough 2024, then a monster move over the last few months, and I'm going to show the year to date here, but over the last two years, still underwater.\n02:20 Speaker A\nSo the 2026 question is simple. Can this turnaround turn into execution, products, manufacturing, and proof, not just headlines.\n02:30 Speaker A\nNext up, we have CVS, up 74% this year. It's a great example of a stock that got punished on a fundamental problem, medical costs and guidance drama.\n02:41 Speaker A\nAnd then it got a relief rally when the story stabilized. Year to date, it's up big, but over two years, it's basically a small gain.\n02:50 Speaker A\nFor 2026, CVS is a market signal for healthcare cost inflation. And if that trend gains steam again, it can hit more than just this one stock.\n03:01 Speaker A\nNext up, we have Dollar General, DG, up 81%. This is your consumer mood ring. It's up huge this year and it's also slightly positive over the last two years.\n03:12 Speaker A\nThe 2026 tell is whether margins hold up when promotions shrink and cost pressures, they start pushing back. Because when value retailers get squeezed, the rest of consumer land can feel it too.\n03:25 Speaker A\nNow on to Paramount Skydance. That's up 26% this year. And the story here is deal drama, transition, and then a fresh rerate on a new company narrative.\n03:36 Speaker A\nIt's up this year, but very volatile and now sits in the red over two years. So the market is interested, but it's needing a resolution on who finally owns this company and some other things.\n03:47 Speaker A\nSo 2026 is about whether they can execute on the new plan without all the old problems creeping back in.\n03:55 Speaker A\nFinally, our smallest company here, Huntington Ingalls. This is the sneaky one that adds some spice because it's not a retail or a tech story. It is a throughput story.\n04:05 Speaker A\nIt was up strong in 2025 and also up about 27% over the last two years. For 2026, next year, the big question is whether they can turn backlog into deliveries and whether labor and supply constraints get better or they stay sticky, which matters well beyond the defense industry.\n04:20 Speaker A\nNow, let's talk about what to watch based on this 2026 list, and we got a few themes here. Think of this as an early warning dashboard for the broader market.\n04:30 Speaker A\nThe first category to pay attention to is guidance credibility. Watch CVS, Dollar General, Intel and Paramount. If these companies can hold guidance or raise it, it's a signal that demand and costs, they're behaving.\n04:44 Speaker A\nIf they start walking it back, well, that's often how earnings season starts going sideways. Then we have margin durability. Watch Dollar General, Dollar Tree, Estee Lauder, CVS, and Nucor.\n04:57 Speaker A\nMargins are where all the real world stuff shows up first, discounts, wages, input costs, and margin surprises can move the entire tone of the market real fast.\n05:08 Speaker A\nNext up, we have consumer stress and trade down. Here, watch the same basket of as above, except take out Nucor. Because when value stores are booming and discretionary categories are on the back foot, that is a different economy than when everybody's spending like it's peak pandemic stimmy time.\n05:25 Speaker A\nThis group helps you see that shift in real time. And finally, last on the list, we have cyclical pricing and the real economy pulse. And for this, we're going to watch Nucor and Albemarle.\n05:37 Speaker A\nSteel and lithium can be messy, but they're useful because when those cycles turn, they often tell you whether growth expectations are heating up or cooling off. So all in all, while these are the comebacks of 2025, next year is about which ones can prove that it's been more than a technical bounce.\n05:54 Speaker A\nAnd tune in to the Stocks in Translation podcast for more jargon busting deep dives. New episodes can be found Tuesdays and Thursdays on Yahoo Finance's website or wherever you find your podcast.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:50:00",
      "Source": "Motley Fool",
      "Title": "Better Semiconductor Stock for 2026: AMD vs. Intel",
      "URL": "https://finance.yahoo.com/m/cd77e330-ba70-359c-a5b3-279fb02aa143/better-semiconductor-stock.html",
      "Content": "Better Semiconductor Stock for 2026: AMD vs. Intel\n\nHarsh Chauhan, The Motley Fool\nThu, December 18, 2025 at 7:50 AM PST 7 min read\n\nIn this article: AMD\n\nINTC\n\n^SOX\n\nKey Points AMD's and Intel's earnings are expected to grow significantly in 2026.\nA close look at their businesses reveals that one of them is outperforming the other financially.\nComparing their valuations will make it easy for investors to understand which one is the better buy right now.\n10 stocks we like better than Intel ›\n\nSemiconductor stocks have delivered some stellar performances in 2025, as is evident from the 40% gains registered by the PHLX Semiconductor Sector index this year. Though the sector has witnessed periods of volatility due to concerns such as the sustainability of the massive spending on artificial intelligence (AI) infrastructure and questions about the returns on investment that this technology will actually deliver, strong chip demand has provided a solid tailwind so far.\nThe good news is that semiconductor stocks can keep doing well in 2026. The World Semiconductor Trade Statistics organization forecasts a 26% spike in semiconductor sales next year to $975 billion, higher than this year's projected growth of 22.5%. This should bode well for Advanced Micro Devices (NASDAQ: AMD) and Intel (NASDAQ: INTC) , two chip companies that have clocked impressive returns in 2025.\nBut if you're choosing one of these two stocks to buy now based on their outlook for 2026, which one should it be?\nThe case for AMD As of this writing, AMD stock is up 72% in 2025. Its revenue and earnings have been growing at a healthy clip thanks to demand for its chips for use in personal computers (PCs), gaming consoles, and data centers .\nIts revenue in the first three quarters of 2025 increased by 35% from the year-ago period. AMD's generally accepted accounting principles (GAAP) net income jumped by about 244% during this period to $2.8 billion. The new year could be even stronger for AMD. The proliferation of AI in PCs and data centers, along with a potential increase in the company's market share in AI chips, is likely to drive growth in 2026.\n\nAMD has been constantly gaining market share for central processing units (CPUs) in both PCs and data centers. Its share of PC CPUs increased by 1.4 percentage points year over year in the third quarter of 2025 to 25.4%, according to Mercury Research. Meanwhile, it recorded a jump of 3.6 points in server CPUs to 27.8%.\nAMD can continue to gain share in CPUs next year since it is moving to a 2-nanometer (nm) process node from the current-generation 3nm and 4nm nodes. The company claims that its Zen 6 CPU will be the first chip fabricated on foundry leader TSMC 's 2nm node. Importantly, that smaller process node should enable AMD to deliver increased computing performance while keeping power consumption in check.\n\nStory Continues\nThe company also notes that its 2nm chips will support a wider range of AI workloads in both PCs and data centers. Moreover, AMD sees its addressable opportunity in the data center market increasing at an annualized rate of over 40% for the next five years. On the other hand, shipments of AI PCs are projected to jump by 83% in 2026.\n\nAMD's expanding addressable market and its ability to acquire a greater share of the data center and PC chip markets explain why it expects annualized revenue growth of more than 35% for the next three to five years, up from the 21% annual growth it has recorded in the past five years. It also expects its operating margin to grow to 35% over the long run from around 24% this year.\n2026 will be the year when AMD steps on the gas. Analysts are estimating a 62% spike in earnings next year, up significantly from the 20% non-GAAP earnings growth it is set to deliver in 2025. Ideally, that should translate into more gains for AMD stock next year.\nThe case for Intel Intel has regained investor confidence in 2025 thanks to a few key positive developments, which explains the 87% spike in its share price this year.\nInvestments from the U.S. government, SoftBank , and Nvidia have strengthened its balance sheet. The company also divested its stake in programmable chip manufacturer Altera and sold a stake in Mobileye . As a result, Intel was sitting on almost $31 billion in cash and short-term investments at the end of the third quarter. The $5 billion investment from Nvidia is set to close in the current quarter.\n\nThis solid cash position should enable Intel to bring more production capacity online for its most advanced chip nodes, which are experiencing healthy demand. CFO David Zinsner remarked on the October earnings conference call that the demand for its Intel 10 and Intel 7 process nodes exceeded supply, driven by the PC and data center markets.\nManagement also notes that its data center customers are interested in entering into long-term supply agreements to support the installation of additional AI infrastructure. At the same time, Intel's partnership with Nvidia for the joint development of data center chips and PC processors that will be deployed in the hyperscaler, enterprise, and consumer end markets should open up another opportunity for the company to accelerate its growth.\n\nIntel has been lacking on that front so far. The consensus estimate is for a 1% drop in revenue this year. However, the cost-cutting measures Intel has undertaken will help it post an adjusted profit of $0.34 per share in 2025, according to analysts, compared to its loss of $0.13 per share last year.\nIntel's cost-saving efforts are set to continue in 2026. Management expects to lower its operating expenses to $16 billion from this year's $16.8 billion, and its revenue is expected to grow by 2.5% in 2026. This combination of an improvement in its top line and control of spending could boost Intel's earnings by an impressive 76% next year, per consensus estimates.\nThis all looks like good news for Intel investors, but is it a better buy than AMD?\n\nThe verdict Both Intel and AMD are on track to clock healthy earnings growth next year. However, for Intel, that growth is expected to mainly be driven by its cost-optimization efforts -- its top-line growth has yet to kick into a higher gear. AMD, meanwhile, is clocking healthy growth in both revenue and earnings, and it expects to step on the gas next year.\nWhat's more, AMD is significantly cheaper than Intel on the valuation front.\nBased on all that, AMD appears to be the more convincing stock to buy now. Intel, of course, could do well next year if it continues to execute its turnaround, but AMD seems like the better bet for 2026.\nShould you buy stock in Intel right now? Before you buy stock in Intel, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Intel wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $511,196 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,047,897 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 954 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nHarsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Intel, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Mobileye Global and recommends the following options: short February 2026 $9 puts on Mobileye Global. The Motley Fool has a disclosure policy .\nBetter Semiconductor Stock for 2026: AMD vs. Intel was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:30:17",
      "Source": "Associated Press Finance",
      "Title": "BC-Most Active Stocks",
      "URL": "https://finance.yahoo.com/news/bc-most-active-stocks-153017572.html",
      "Content": "BC-Most Active Stocks\n\nThe Associated Press\nThu, December 18, 2025 at 7:30 AM PST 21 min read\n\nIn this article: VIVK\n\nCGC\n\nATHA\n\nPLUG\n\nUGRO\n\nNEW YORK (AP) — prices for the Nasdaq composite, NYSE and NYSE American listed most active stocks.\nNasdaq most active stocks:\nStock Name\nVolume\nHigh\nLow\nLast\nChange\nurban-gro Inc.\n98,786,371\n0.4595\n0.3802\n0.3921\n+0.0961\nVivakor Inc.\n55,713,705\n0.0603\n0.0535\n0.0577\n+0.0067\nCanopy Growth Corp.\n48,071,327\n2.38\n2.033\n2.33\n+0.41\nTrump Media & Tech.GroupCorp.\n45,168,853\n14.50\n12.71\n13.4706\n+3.0006\nAthira Pharma Inc.\n44,105,837\n8.36\n7.15\n7.4862\n+3.3512\nPlug Power Inc.\n39,887,801\n2.49\n2.26\n2.35\n+0.19\nNVIDIA Corp.\n37,969,134\n174.89\n171.82\n173.08\n+2.14\nEnvirotech Vehicles Inc.\n32,963,418\n0.67\n0.487\n0.5445\n-0.2556\nInno Holdings Inc.\n26,844,281\n0.0714\n0.0664\n0.068\n-0.045\nMicron Technology Inc.\n26,264,071\n263.65\n249.09\n250.25\n+24.73\nWork Medical Technology Group\n24,936,125\n0.0528\n0.0489\n0.051\n-0.0054\nAgape ATP Corporation\n21,466,986\n0.1384\n0.1258\n0.1259\n-0.0149\nOndas Holdings Inc.\n21,173,804\n8.3393\n7.74\n8.06\n+0.69\nTesla Inc .\n20,932,131\n482.92\n473.12\n479.58\n+12.32\niRobot Corp.\n18,681,824\n0.94\n0.80\n0.8411\n+0.0791\nIntel Corp.\n18,617,317\n37.485\n35.7801\n35.90\n-0.15\nTilray Brands Inc.\n15,395,956\n15.6995\n13.4499\n14.8374\n+1.9574\nMaison Solutions Inc.\n15,058,210\n0.3646\n0.302\n0.3537\n-0.0719\nParanovus Entertain.Tech. Ltd.\n14,382,665\n2.99\n2.36\n2.735\n+0.745\niShares Bitcoin Trust ETF\n14,058,539\n50.57\n49.75\n49.99\n+1.28\niShares Ethereum Trust ETF\n14,131,004\n22.58\n22.095\n22.2105\n+0.8905\nVision Marine Technologies Inc\n14,015,978\n0.3001\n0.268\n0.27\n-0.2294\nRivian Automotive Inc.\n13,193,590\n19.16\n18.26\n18.77\n+1.14\nRezolve AI PLC\n12,762,877\n2.64\n2.38\n2.435\n+0.035\nSoFi Technologies Inc.\n12,699,435\n26.55\n25.9502\n26.22\n+0.95\nBeyond Meat Inc.\n12,521,073\n1.14\n1.04\n1.075\n+0.025\nStrive Inc.\n12,122,204\n0.8844\n0.8461\n0.8475\n+0.0267\nBitfarms Ltd.\n11,714,085\n2.50\n2.35\n2.365\n+0.045\nApple Inc.\n11,613,819\n273.63\n266.95\n269.20\n-2.64\nOpendoor Technologies Inc.\n11,531,946\n6.585\n6.30\n6.365\n+0.245\nBroadcom Inc.\n10,869,708\n336.025\n323.63\n324.89\n-1.13\nOriental Culture Holding Ltd.\n9,656,467\n0.155\n0.1407\n0.1445\n+0.0045\nRigetti Computing Inc.\n9,391,759\n23.96\n22.55\n22.705\n+0.235\nIREN Ltd.\n8,989,678\n36.90\n35.0701\n35.56\n+1.78\nPalantir Technologies Inc.\n8,906,525\n184.78\n181.51\n182.73\n+5.44\nMARA Holdings Inc.\n8,644,315\n10.37\n9.93\n10.00\n+0.07\nRecursion Pharmaceuticals Inc.\n8,592,233\n4.96\n4.65\n4.675\n-0.005\nActelis Networks Inc.\n8,633,694\n0.65\n0.5709\n0.58\n-0.52\nAmazon.com Inc.\n8,288,816\n227.15\n224.41\n226.11\n+4.84\nComcast Corp.\n7,898,015\n30.285\n29.74\n30.255\n-0.065\nRobinhood Markets Inc.\n7,840,022\n124.25\n120.38\n121.20\n+5.40\nCOREWEAVE INC.\n7,643,361\n68.66\n65.8661\n66.70\n+2.15\nAdvanced Micro Devices Inc.\n7,562,193\n206.13\n203.01\n204.035\n+5.925\nCipher Mining Inc.\n7,184,394\n15.98\n14.92\n15.155\n+0.765\nApplied Digital Corp.\n7,185,806\n24.20\n23.00\n23.4551\n+1.4551\nTerawulf Inc.\n7,053,636\n12.34\n11.32\n11.47\n-0.10\nNetflix Inc.\n6,858,350\n95.54\n94.13\n94.945\n+0.155\nAlphabet Inc.\n6,747,363\n302.52\n299.2308\n300.0075\n+3.2875\nInspire Veterinary Partners In\n6,450,871\n0.0461\n0.0425\n0.0448\n-0.0023\nRocket Lab Corp.\n6,121,558\n58.8268\n56.0801\n56.92\n+2.96\nDirect Digital Holdings Inc.\n5,999,059\n0.066\n0.0639\n0.0641\n-0.0088\nLuminar Technologies Inc.\n5,884,341\n0.213\n0.1813\n0.1895\n-0.0365\nCleanspark Inc.\n5,823,238\n12.2824\n11.55\n11.69\n+0.21\nAkanda Corp.\n5,613,259\n0.974\n0.85\n0.8984\n+0.1584\nSuper Micro Computer Inc.\n5,544,231\n30.91\n29.7815\n29.95\n+0.11\nFuelcell Energy Inc.\n5,365,033\n10.84\n9.25\n10.53\n+2.63\nVYNE Therapeutics Inc.\n4,775,773\n0.64\n0.574\n0.5959\n-0.0041\nPayPal Holdings Inc.\n4,766,946\n60.32\n59.29\n59.37\n-0.81\nCartesian Growth Corp. III\n4,752,581\n10.42\n10.30\n10.31\n+0.20\nLululemon Athletica Inc.\n4,484,322\n225.98\n218.56\n222.05\n+14.18\nBit Digital Inc.\n4,705,297\n2.12\n2.035\n2.0735\n+0.1035\nAmerican Airlines Group Inc.\n4,483,568\n15.78\n15.55\n15.605\n+0.095\nMedline Borrower LP/Co-Iss.Inc\n4,424,656\n40.6999\n38.00\n39.65\n-1.35\nPyxis Oncology Inc.\n4,252,438\n1.75\n1.48\n1.535\n-1.835\nAlphabet Inc.\n4,169,423\n303.83\n300.63\n301.4299\n+3.3699\nHUT 8 Corp.\n4,070,721\n45.64\n42.14\n42.442\n+2.282\nAST SpaceMobile Inc.\n4,017,324\n67.68\n64.01\n65.7109\n+3.8509\nConfluent Inc.\n3,825,155\n30.07\n30.00\n30.00\n0.00\nStarbucks Corp.\n3,820,238\n89.67\n87.30\n89.10\n+3.89\nSoundhound AI Inc.\n3,776,124\n11.53\n11.11\n11.1737\n+0.1837\nMicrosoft Corp.\n3,770,414\n485.395\n477.89\n483.5117\n+7.3917\nCheer Holding Inc.\n3,748,632\n0.042\n0.04\n0.0405\n-0.0002\nStrategy Inc.\n3,628,388\n169.51\n162.91\n163.63\n+3.25\nDatavault AI Inc.\n3,575,445\n1.39\n1.30\n1.315\n+0.015\nQuantum Computing Inc.\n3,524,283\n10.86\n10.405\n10.53\n+0.31\nVistagen Therap. Inc.\n3,513,206\n0.8423\n0.78\n0.8025\n-0.0585\nWARNER BROS. DISCOVERY INC.\n3,515,795\n28.38\n28.175\n28.222\n+0.012\nSanDisk Corp.\n3,507,191\n231.00\n219.50\n221.69\n+14.86\nX3 Holdings Co. Ltd.\n3,507,798\n1.87\n1.75\n1.85\n+0.08\nEos Energy Enterprises Inc.\n3,487,101\n13.16\n12.32\n12.4299\n+0.1599\nRichtech Robotics Inc.\n3,394,553\n3.66\n3.46\n3.49\n+0.06\nSEALSQ Corp.\n3,323,600\n4.25\n4.031\n4.08\n+0.22\nNebius Group N.V.\n3,352,002\n80.35\n77.01\n77.775\n+2.325\nCore Scientific Inc. New\n3,317,358\n14.68\n14.30\n14.48\n+0.91\nMeta Platforms Inc.\n3,262,832\n663.95\n656.46\n661.57\n+12.07\nInsmed Inc.\n3,241,582\n172.305\n161.0212\n166.86\n-31.60\nLinkhome Holdings Inc.\n3,217,146\n11.22\n7.8477\n9.3248\n+0.0348\nAGNC Investment Corp.\n3,177,072\n10.6293\n10.465\n10.615\n+0.175\nAmerican Bitcoin Corp.\n3,234,622\n1.76\n1.66\n1.6794\n+0.0294\nNavitas Semiconductor Corp.\n3,057,474\n8.02\n7.50\n7.585\n+0.205\nRiot Platforms Inc.\n3,057,112\n13.735\n13.115\n13.22\n+0.26\nKindly MD Inc.\n2,947,253\n0.4224\n0.3796\n0.4022\n+0.037\nHeartBeam Inc.\n2,939,419\n3.24\n2.90\n3.00\n-0.07\nGrab Holdings Limited\n2,924,165\n4.95\n4.90\n4.91\n+0.04\nOrigin Materials Inc.\n2,874,716\n0.3294\n0.2752\n0.3128\n-0.0166\nLam Research Corp.\n2,850,503\n168.29\n162.00\n164.49\n+9.51\nWalmart Inc.\n2,770,268\n115.95\n114.79\n115.82\n+0.16\nMondelez International Inc.\n2,758,410\n54.71\n53.68\n54.64\n+0.82\nIncannex Healthcare Inc.\n2,650,275\n0.428\n0.4064\n0.4207\n+0.0094\nWerewolf Therapeutics Inc.\n2,590,093\n0.80\n0.5588\n0.6724\n-0.3976\n\nNYSE most active stocks:\n\nStory Continues\nStock Name\nVolume\nHigh\nLow\nLast\nChange\nSable Offshore Corp.\n20,065,230\n9.29\n7.85\n8.82\n+3.54\nBigBear.ai Holdings Inc.\n11,071,364\n5.79\n5.56\n5.602\n+0.162\nOracle Corp.\n8,433,177\n184.76\n180.72\n181.51\n+3.05\nT1 Energy Inc.\n7,661,700\n6.35\n5.705\n6.265\n+0.845\nD-Wave Quantum Inc.\n7,306,793\n25.84\n24.22\n24.39\n+0.59\nUWM Holdings Corp.\n6,916,278\n4.868\n4.765\n4.825\n-0.025\nFord Motor Co.\n6,187,074\n13.44\n13.32\n13.335\n+0.025\nSnap Inc.\n5,894,848\n7.74\n7.53\n7.65\n+0.15\nNuScale Power Corp.\n5,898,696\n16.83\n15.86\n16.00\n+0.27\nArcher Aviation Inc.\n5,742,114\n8.10\n7.80\n7.835\n+0.255\nAMC Entertainment Holdings Inc\n5,716,088\n1.86\n1.80\n1.835\n+0.015\nPfizer Inc.\n5,631,850\n25.225\n24.98\n25.0456\n+0.0056\nBristol-Myers Squibb Co.\n5,569,362\n53.80\n53.092\n53.56\n+0.01\nRedwire Corp.\n5,515,703\n7.48\n6.93\n7.105\n+0.665\nBank of America Corp.\n5,340,279\n55.15\n54.52\n54.835\n+0.285\nHP Inc.\n5,274,337\n24.11\n22.98\n23.325\n-1.105\nBloom Energy Corp.\n4,894,897\n85.30\n80.01\n80.70\n+3.73\nIonQ Inc.\n4,731,541\n48.7163\n46.69\n47.06\n+1.21\nFirst Majestic Silver Corp.\n4,634,127\n16.65\n16.03\n16.33\n-0.05\nNu Holdings Ltd.\n4,340,133\n16.3555\n16.11\n16.265\n+0.405\nKenvue Inc.\n4,170,335\n17.40\n17.11\n17.28\n0.00\nAT & T Inc.\n4,099,252\n24.55\n24.29\n24.515\n+0.155\nHewlett Packard Enterprise Co.\n4,085,778\n24.19\n23.385\n23.515\n-0.505\nKosmos Energy Ltd.\n4,041,739\n0.929\n0.8763\n0.9045\n-0.0154\nChipotle Mexican Grill Inc.\n3,861,582\n37.88\n37.27\n37.5444\n+0.5444\nQuantumScape Corp.\n3,824,906\n11.57\n11.12\n11.225\n+0.485\nJoby Aviation Inc.\n3,786,350\n14.20\n13.61\n13.695\n+0.495\nLithium Americas Corp.\n3,751,966\n4.7424\n4.46\n4.4845\n-0.1255\nUiPath Inc.\n3,620,730\n16.3355\n15.89\n15.9693\n+0.0093\nPG & E Corp.\n3,457,194\n15.795\n15.65\n15.765\n+0.085\nHecla Mining Co.\n3,439,911\n19.79\n19.1225\n19.505\n+0.095\nEndeavour Silver Corp.\n3,316,250\n9.65\n9.22\n9.41\n+0.05\nCarnival Corp.\n3,273,260\n28.505\n28.03\n28.035\n+0.005\nTwo Harbors Investment Corp.\n3,255,512\n11.36\n11.07\n11.265\n+0.155\nCoupang Inc.\n3,255,774\n23.23\n22.7906\n23.105\n+0.385\nNIKE Inc.\n3,025,334\n66.86\n65.80\n66.70\n+1.01\nButterfly Network Inc.\n3,012,290\n3.61\n3.28\n3.415\n+0.245\nOklo Inc.\n2,999,997\n81.00\n76.30\n77.1541\n+1.2141\nHims & Hers Health Inc.\n2,941,859\n36.03\n34.81\n35.02\n+0.05\nTransocean Ltd.\n2,944,593\n4.0099\n3.91\n3.955\n+0.005\nCarmax Inc.\n2,899,572\n41.99\n38.34\n41.29\n+0.22\nUber Technologies Inc.\n2,889,911\n80.71\n79.62\n79.79\n+0.65\nDell Technologies Inc.\n2,829,763\n128.6925\n122.10\n122.87\n-5.02\nRocket Companies Inc.\n2,784,410\n19.12\n18.82\n18.875\n+0.715\nCircle Internet Group Inc.\n2,730,763\n84.47\n80.45\n81.725\n+2.525\nCoursera Inc.\n2,661,801\n7.985\n7.48\n7.965\n+0.125\nBoston Scientific Corp.\n2,581,667\n96.82\n94.655\n96.535\n+2.055\nNine Energy Service Inc.\n2,543,723\n0.3773\n0.344\n0.352\n-0.015\nVerizon Communications Inc.\n2,545,290\n40.8399\n40.58\n40.79\n-0.09\nEnergy Transfer L.P.\n2,475,505\n16.40\n16.30\n16.35\n-0.04\nCoeur Mining Inc.\n2,388,268\n17.55\n16.9598\n17.31\n+0.11\nPlanet Labs PBC\n2,273,626\n17.95\n17.04\n17.265\n+0.795\nAlight Inc.\n2,209,543\n2.13\n2.03\n2.045\n-0.075\nNorwegian Cruise Line Holdings\n2,210,629\n22.10\n21.62\n21.775\n+0.235\nWalt Disney Co., The\n2,172,475\n111.97\n110.42\n111.46\n+0.83\nMerck & Co. Inc.\n2,154,781\n100.85\n98.86\n100.26\n+1.08\nBlue Owl Capital Inc.\n2,044,501\n15.875\n15.54\n15.825\n+0.435\nAMCOR PLC\n2,130,088\n8.44\n8.36\n8.39\n+0.02\nPinterest Inc.\n1,936,889\n26.475\n26.00\n26.36\n+0.48\nInspire Medical Systems Inc.\n1,929,750\n100.52\n89.94\n93.72\n-24.55\nVertiv Holdings Co.\n1,927,331\n158.755\n151.50\n152.49\n+2.66\nCoca-Cola Co., The\n1,925,794\n70.795\n70.225\n70.75\n+0.08\nLumen Technologies Inc.\n1,917,313\n8.08\n7.64\n7.685\n+0.055\nFreeport-McMoRan Inc.\n1,914,482\n48.07\n47.33\n47.70\n-0.12\nUnder Armour Inc.\n1,857,882\n4.53\n4.42\n4.5029\n+0.1329\nBaytex Energy Corp.\n1,811,636\n3.16\n3.10\n3.1099\n-0.0401\nUnder Armour Inc.\n1,813,696\n4.3284\n4.19\n4.295\n+0.155\nFluor Corp. (New)\n1,790,290\n42.18\n40.785\n40.89\n+0.03\nSES AI Corporation\n1,787,999\n2.07\n1.888\n1.96\n+0.14\nBarrick Mining Corp.\n1,782,386\n44.2299\n43.11\n43.82\n+0.25\nExxon Mobil Corp.\n1,656,702\n116.93\n115.63\n116.81\n-0.60\nAccenture PLC\n1,655,681\n272.37\n261.50\n266.99\n-6.75\nStellantis N.V.\n1,618,351\n11.76\n11.665\n11.71\n+0.04\nStubHub Holdings Inc.\n1,616,412\n14.99\n14.0601\n14.295\n+0.305\nMP Materials Corp.\n1,597,251\n55.1099\n52.09\n52.42\n+0.39\nServiceNow Inc.\n1,599,366\n157.7799\n152.51\n152.60\n-3.878\nOccidental Petroleum Corp.\n1,575,991\n40.54\n39.93\n40.205\n-0.425\nTarget Corp.\n1,570,391\n101.34\n98.56\n100.945\n+2.345\nAmer. Eagle Outfitters Inc.\n1,550,734\n28.08\n27.16\n27.68\n+0.76\nSLB Ltd.\n1,554,728\n38.555\n38.09\n38.28\n-0.25\nDow Inc.\n1,515,158\n23.18\n22.75\n22.92\n-0.15\nReddit Inc.\n1,510,234\n245.5499\n229.4544\n244.395\n+17.055\nBirkenstock Holding PLC\n1,504,902\n46.27\n43.34\n43.59\n-2.81\nAltria Group Inc.\n1,491,874\n59.0959\n58.70\n59.05\n-0.13\nVenture Global Inc.\n1,494,544\n6.105\n5.89\n6.1001\n+0.1601\nCitigroup Inc.\n1,482,290\n113.66\n112.15\n112.84\n+1.38\nRegions Financial Corp.\n1,481,294\n27.945\n27.63\n27.77\n+0.20\nNexGen Energy Ltd.\n1,461,531\n8.525\n8.28\n8.405\n+0.205\nGE Vernova Inc.\n1,460,647\n658.69\n639.0901\n643.08\n+28.89\nLennar Corp.\n1,431,663\n112.97\n109.1425\n109.66\n-2.57\nProcter & Gamble Co., The\n1,429,776\n147.50\n146.35\n146.63\n-1.18\nMorgan Stanley\n1,392,423\n177.07\n174.5317\n174.735\n-0.065\nIamgold Corp.\n1,362,444\n16.40\n15.87\n16.275\n+0.205\nKinross Gold Corp.\n1,357,614\n28.29\n27.54\n28.015\n+0.075\nUnity Software Inc.\n1,352,550\n45.68\n44.39\n45.115\n+1.335\nKeycorp\n1,326,990\n21.07\n20.845\n20.945\n+0.145\nFranklin Resources Inc.\n1,326,133\n24.47\n24.03\n24.175\n+0.505\nBorr Drilling Ltd\n1,321,232\n3.875\n3.70\n3.835\n+0.115\nfuboTV Inc.\n1,320,941\n2.73\n2.65\n2.71\n+0.07\nNextdoor Holdings Inc.\n1,306,931\n2.16\n2.08\n2.1045\n+0.0145\n\nNYSE American most active stocks:\nStock Name\nVolume\nHigh\nLow\nLast\nChange\ncbdMD Inc.\n15,564,629\n2.56\n2.12\n2.1767\n-0.0933\nBitMine Immersion Techno. Inc.\n12,374,132\n31.72\n30.22\n30.479\n+1.159\nSRX HealthSolutions Inc.\n6,021,796\n0.335\n0.3125\n0.3184\n-0.0566\nB2Gold Corp.\n4,978,728\n4.63\n4.515\n4.595\n+0.025\nHyperscale Data Inc.\n3,912,289\n0.266\n0.2539\n0.2561\n+0.0039\nDenison Mines Corp.\n3,644,178\n2.59\n2.51\n2.52\n+0.04\nNuburu Inc.\n3,295,650\n0.2027\n0.1972\n0.2018\n-0.0002\nUr-Energy Inc.\n2,978,180\n1.43\n1.35\n1.365\n+0.025\nSilvercorp Metals Inc.\n2,215,911\n8.87\n8.61\n8.825\n+0.135\nUranium Energy Corp.\n1,908,437\n12.19\n11.42\n11.54\n+0.02\nNew Gold Inc.\n1,815,341\n8.5255\n8.245\n8.42\n+0.09\nUnited States Antimony Corp.\n1,806,248\n4.8986\n4.43\n4.465\n-0.075\nI-80 Gold Corp.\n1,596,854\n1.565\n1.5134\n1.515\n-0.005\nPlatinum Group Metals Ltd.\n1,577,703\n2.63\n2.45\n2.482\n-0.118\nEnergy Fuels Inc.\n1,569,368\n14.16\n13.54\n13.62\n+0.15\nEON Resources Inc.\n1,414,092\n0.384\n0.3629\n0.3748\n-0.038\nOrla Mining Ltd. (new)\n1,427,907\n14.65\n13.585\n14.40\n+0.76\nAvino Silver & Gold Mines Ltd.\n1,320,613\n6.265\n6.06\n6.16\n+0.03\nStandard Lithium Ltd.\n1,324,383\n5.15\n4.71\n4.835\n+0.075\nEquinox Gold Corp.\n1,225,971\n14.11\n13.73\n14.015\n+0.125\nIndonesia Energy Corp. Ltd.\n1,204,281\n2.99\n2.725\n2.8099\n-0.2301\nTrilogy Metals Inc.\n1,166,289\n4.71\n4.375\n4.4201\n+0.1001\nVolitionRX Ltd.\n1,037,875\n0.2789\n0.2644\n0.2652\n-0.0019\nNorthern Dynasty Minls Ltd.\n938,796\n2.185\n2.08\n2.12\n+0.04\nVizsla Silver Corp.\n823,201\n5.3199\n5.13\n5.20\n+0.01\nTheriva Biologics Inc.\n805,522\n0.187\n0.1793\n0.1817\n-0.0017\nSMJ International Holdings\n757,272\n4.45\n4.35\n4.39\n+0.01\nAmericas Gold & Silver Corp.\n662,791\n5.53\n5.322\n5.39\n-0.01\nOcean Power Technologies Inc.\n645,092\n0.3406\n0.3332\n0.3333\n+0.0033\nTaseko Mines Ltd.\n614,275\n5.23\n5.11\n5.115\n-0.065\nComstock Inc.\n597,754\n3.85\n3.51\n3.54\n+0.08\nGoldMining Inc.\n612,419\n1.29\n1.25\n1.26\n-0.02\nAtlasclear Holdings Inc.\n589,036\n0.3046\n0.2933\n0.2961\n+0.0077\nRing Energy Inc.\n541,252\n0.8999\n0.8599\n0.8855\n+0.0306\nAgEagle Aerial Systems Inc.\n521,888\n0.97\n0.94\n0.94\n+0.009\nTrio Petroleum Corp.\n471,056\n0.8093\n0.7217\n0.765\n-0.145\nAbundia Global Impact Grp. Inc\n461,224\n1.54\n1.37\n1.46\n-0.34\nCastellum Inc.\n403,611\n1.05\n1.0212\n1.025\n+0.005\nIGC Pharma Inc.\n396,830\n0.349\n0.3285\n0.3372\n+0.0087\nIntegra Resources Corp.\n392,958\n4.13\n4.01\n4.055\n-0.045\nAmaze Holdings Inc.\n377,672\n0.3331\n0.326\n0.3312\n+0.0063\nGold Royalty Corp.\n376,982\n4.05\n3.95\n3.9598\n-0.0202\nVista Gold Corp.\n343,747\n2.13\n2.025\n2.08\n-0.01\nNovaGold Resources Inc.\n339,669\n9.9793\n9.75\n9.85\n+0.02\nUnusual Machines Inc.\n341,741\n9.59\n8.90\n8.98\n+0.29\nWestwater Resources Inc.\n293,739\n0.89\n0.8459\n0.8669\n+0.0269\nKULR Technology Group Inc.\n280,802\n3.15\n3.00\n3.07\n+0.07\nCybin Inc.\n269,372\n7.2144\n6.88\n6.93\n+0.14\nGaliano Gold Inc.\n258,379\n2.4698\n2.405\n2.43\n-0.02\nCornerstone Strat.Val.Fd Inc.\n256,507\n8.22\n8.18\n8.205\n+0.045\nCleancore Solutions Inc.\n253,249\n0.3002\n0.286\n0.2891\n-0.009\nGold Resource Corp.\n240,977\n0.8749\n0.8444\n0.8532\n-0.0048\nNew Found Gold Corp.\n232,113\n2.71\n2.63\n2.665\n-0.055\nGEE Group Inc.\n226,433\n0.187\n0.184\n0.1868\n+0.0019\nNovabay Pharmaceuticals Inc.\n211,026\n4.00\n3.51\n3.9165\n+0.4165\nAris Mining Corp.\n209,685\n16.03\n15.2836\n15.72\n+0.30\nPhaos Technology Holdings (Cay\n198,787\n3.74\n3.70\n3.70\n-0.06\nWestern Copper & Gold Corp.\n190,862\n2.72\n2.65\n2.6699\n-0.0101\nDolly Varden Silver Corp.\n172,891\n4.58\n4.48\n4.515\n-0.025\nTecogen Inc. (New)\n176,513\n5.27\n4.93\n5.141\n+0.361\nCornerstone Total Return Fund\n158,265\n7.8599\n7.81\n7.8424\n+0.0524\nLineage Cell Therapeutics Inc.\n156,571\n1.82\n1.75\n1.77\n0.00\nNew Pacific Metals Corp.\n153,511\n3.675\n3.52\n3.559\n-0.081\nDakota Gold Corp.\n144,862\n5.71\n5.585\n5.615\n+0.015\nPerspective Therapeutics Inc.\n153,201\n2.6885\n2.565\n2.60\n+0.01\nChowChow Cloud Int.Hldgs Ltd.\n137,150\n1.129\n1.02\n1.045\n+0.015\nEaton Vance Ltd.Durat.Inc.Fd.\n119,254\n9.9063\n9.8327\n9.85\n-0.02\nGamco Gl.Gold Nat.Res.&Inc.Tr.\n110,190\n5.17\n5.12\n5.145\n+0.005\nGenius Group Ltd.\n105,510\n0.66\n0.624\n0.6416\n+0.0014\nReaves Utility Income Fund\n108,178\n36.62\n36.1201\n36.22\n+0.09\nTechcreate Group Ltd.\n104,358\n5.53\n5.36\n5.45\n-0.07\nAzitra Inc.\n95,347\n0.3064\n0.292\n0.3051\n+0.0089\nGran Tierra Energy Inc.\n87,778\n4.10\n3.96\n3.96\n-0.11\nIvanhoe Electric Inc.\n89,806\n14.58\n14.15\n14.36\n+0.42\nNeub.Real Esta.Secur.Inc.Fund\n84,706\n2.94\n2.92\n2.935\n+0.005\nZedge Inc.\n82,504\n3.23\n2.94\n3.1101\n+0.1401\nCboe Global Markets Inc.\n81,385\n253.03\n251.46\n252.34\n+0.08\nMega Matrix Inc.\n82,480\n1.27\n1.18\n1.18\n-0.05\nPower REIT\n87,207\n1.12\n1.0186\n1.045\n+0.015\nPicard Medical Inc.\n79,496\n2.46\n2.28\n2.35\n+0.12\nImperial Oil Ltd.\n78,146\n84.93\n83.765\n84.755\n-0.235\nXtant Medical Holdings Inc.\n76,953\n0.84\n0.7933\n0.8399\n+0.0614\nHyliion Holdings Corp.\n78,062\n1.85\n1.79\n1.81\n+0.05\nTRX Gold Corp.\n74,476\n0.8632\n0.8466\n0.8471\n-0.0161\nNeuberger Berman Municipal Fd\n76,672\n10.28\n10.22\n10.26\n+0.06\nIntl Tower Hill Mines Ltd.\n74,183\n1.96\n1.875\n1.875\n-0.035\nMAIA Biotechnology Inc.\n68,625\n1.22\n1.13\n1.20\n+0.05\nEvolution Petroleum Corp.\n67,532\n3.74\n3.66\n3.705\n-0.015\nIdaho Strategic Resources Inc.\n67,625\n44.45\n42.50\n43.47\n+1.61\nCredit Sui. Asset Mgmt Inc. Fd\n65,321\n2.81\n2.79\n2.805\n+0.01\nLaird Superfood Inc.\n63,303\n2.12\n2.00\n2.0901\n+0.0701\nArena Group Holdings Inc.\n59,773\n4.36\n4.10\n4.28\n+0.26\nCredit Suisse High Yld Crd Fnd\n61,085\n2.02\n2.01\n2.01\n+0.01\nSolitario Resources Corp.\n56,840\n0.68\n0.6494\n0.6615\n-0.01\nHealthy Choice Wellness Corp.\n56,206\n0.299\n0.2739\n0.2743\n-0.0085\nNew Concept Energy Inc.\n52,060\n0.8299\n0.7778\n0.81\n-0.04\nOS Therapies Inc.\n51,623\n1.65\n1.5965\n1.63\n+0.09\nWells Fargo Income Opport.Fund\n49,023\n6.785\n6.76\n6.78\n+0.02\nBattalion Oil Corp.\n46,232\n1.18\n1.0999\n1.15\n-0.04\nFury Gold Mines Ltd.\n46,834\n0.6031\n0.5807\n0.6011\n+0.0061\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:08:25",
      "Source": "GuruFocus.com",
      "Title": "Top Semiconductor Stocks for 2026 -- Nvidia and Broadcom Lead Chip Picks",
      "URL": "https://finance.yahoo.com/news/top-semiconductor-stocks-2026-wall-120207279.html",
      "Content": "Top Semiconductor Stocks for 2026 -- Nvidia and Broadcom Lead Chip Picks\n\nNauman Khan\nThu, December 18, 2025 at 7:08 AM PST 1 min read\n\nIn this article: AVGO\n\nNVDA\n\nALAB\n\nMU\n\nAMD\n\nThis article first appeared on GuruFocus .\nMorgan Stanley named Nvidia ( NASDAQ:NVDA ), Broadcom ( NASDAQ:AVGO ) and Astera Labs ( NASDAQ:ALAB ) as its top semiconductor picks for 2026, pointing to strong AI-driven demand in data center chips, according to a recent research note.\nThe firm highlighted Nvidia and Broadcom as its preferred processor names. Analysts said Nvidia could deliver the highest returns in cloud computing as Vera Rubin deployments ramp in the second half of 2026. Broadcom remains central to AI infrastructure, despite potential bottlenecks in ASIC growth.\n\nWarning! GuruFocus has detected 4 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nAstera Labs emerged as the standout small-cap pick for data center opportunities. Morgan Stanley kept Equal-Weight ratings on AMD ( NASDAQ:AMD ) and Marvell ( NASDAQ:MRVL ), noting room for upside but also some uncertainties. Intel ( NASDAQ:INTC ) drew a cautious view due to challenges in its foundry operations.\nIn memory and chip equipment, Micron ( NASDAQ:MU ) leads the way, with Sandisk ( NASDAQ:SNDK ) also rated Overweight. Applied Materials (AMAT) and Taiwan Semiconductor ( NYSE:TSM ) are favored in equipment, while NXP Semiconductors (NXPI) balances growth and value. Analog Devices (ADI) shows growth potential, though at a higher price point.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:04:31",
      "Source": "Morningstar Research",
      "Title": "Analyst Report: ASML Holding N.V.",
      "URL": "https://finance.yahoo.com/m/13d55925-eee8-32f3-9d82-2a9bef69c914/analyst-report%3A-asml-holding.html",
      "Content": "Analyst Report: ASML Holding N.V.\n\nJavier Correonero\nThu, December 18, 2025 at 7:04 AM PST\n\nIn this article: ASML\n\nASMLF\n\nTSM\n\nSSNLF\n\nINTC\n\nASML is the market leader in lithography systems for manufacturing semiconductors. Lithography is the process in which a light source is used to expose circuit patterns from a photo mask onto a semiconductor wafer. Lithography allows chipmakers to increase the number of transistors on the same area of silicon, with lithography historically representing a high portion of the cost of making cutting-edge chips. ASML outsources the manufacturing of most of its parts, acting like an assembler. ASML’s largest clients are TSMC, Samsung, and Intel.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:30:14",
      "Source": "Yahoo Finance Video",
      "Title": "Netflix vs. Intel: Why this portfolio mgr. recommends only one",
      "URL": "https://finance.yahoo.com/video/netflix-vs-intel-why-portfolio-123014098.html",
      "Content": "Netflix vs. Intel: Why this portfolio mgr. recommends only one\n\nYahoo Finance Video and Josh Lipton\nThu, December 18, 2025 at 4:30 AM PST\n\nIn this video: INTC\n\nNFLX\n\nZacks Investment Management senior client portfolio manager Brian Mulberry joins Market Domination host Josh Lipton on Good Buy or Goodbye to explain why he recommends buying Intel ( INTC ) and tells investors to stay away from Netflix ( NFLX ).\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination .\n\nVideo Transcript\n\n00:00 Host\nour goal to help cut through that noise to navigate the best moves for your portfolio. I'm here now with Brian Moberry, senior client portfolio manager at Zach's Investment Management. Brian, great to see you, my friend, as always. Let's start with what you like, Brian. And this is Intel. You got to buy on this name.\n00:17 Host\nRemarkable move for. It's up 80% this year, Brian. You say, you know what, you stick with it. It's still a buy. Let's go through the reasons why. One, piling up investments. What do you mean?\n00:30 Brian Mulberry\nYeah, when you look at the combination of the 8 billion they got from the US government through the Chips and Science Act, then another 5 billion from Nvidia, and 2 billion from Softbank. This is really recognizing their leadership as the biggest manufacturer of chips inside the US. and these investments reflect that their leadership will continue.\n00:46 Host\nUh second reason, you say this is a smart place to commit capital, boost for future revenues.\n00:52 Brian Mulberry\nYeah, so the all the capital that they're getting as investments is going to help them diversify their product lineup. So not just the simple chips that they use for the automotive segment for a long time. Now they're going to get into the AI infrastructure race, help them innovate, design new products and really participate in that build out.\n01:06 Host\nThird reason, market share gains with AI.\n01:10 Brian Mulberry\nAlready getting it done. They have a big order from Super Micro where they're using the new processor, the Xeon 6 processor designed by Intel, deploying it for their database management and enterprise application business already.\n01:21 Host\nAll right, so I'm convinced, Brian. I'm ready to commit capital. Before I do, what are the downside risks I got to think about?\n01:27 Brian Mulberry\nThere have been delays in manufacturing for Intel. Their new 7 nanometer chip is delayed and that is causing them to lose market share in the hardware segment of their business. So really directed towards PCs. So this is a place where they do need to accelerate and catch up and get these new products online.\n01:45 Host\nAnd you would obviously argue, all right, it's made an 80% move, but you must think valuation's still attractive.\n01:50 Brian Mulberry\nYeah, absolutely. I mean, it's all about productive capital going forward. and as they grow their market share and innovate and participate, again, already being the leader in US manufacturing based semiconductors, the I think the the the road for future gains is still paved really, really well.\n02:06 Host\nAll right, so buy Intel. Let's go to a name you're you're not so enthusiastic about. That would be Netflix. Now, this one's up about 7% this year. Most on the street are bullish, you're not, Brian. Let's go through those reasons. Growing competitive landscape.\n02:20 Brian Mulberry\nYeah, absolutely. So, Netflix had been by a wide margin, the US market share leader, but they just got passed by Amazon. Amazon Prime video now 22% market share in the US and Netflix down to 21. So you're seeing the competitive wave here domestically is catching up with them. Hot on their heels, you've got Paramount and obviously Disney Plus, some other names out there, really the race for subscriptions and eyeballs, it's just getting hotter and hotter.\n02:45 Host\nNow, because we're talking about this competitive landscape, we got to bring up WBD because the board just says, hey, they still favor this Netflix deal. If that happens, Brian, doesn't that mean Netflix picks up a library, it picks up a lot of sought after IP? What do you think about that?\n03:00 Brian Mulberry\nYeah, that definitely helps them in the short term. There's a little bit of a caffeine buzz there where you get a little bit more viewership and you also get a nice library in there. But at the same time, their future debt obligations are one of the things that are concerning. How much of that would weave into that new WB process, right? We know that Discovery's going to go somewhere else. But how much more are they going to have to commit to continuing that line of intellectual property when they're already backlogged with a lot of debt.\n03:22 Host\nSecond reason, you say Netflix is one to avoid concerning spending obligations.\n03:26 Brian Mulberry\nYeah, just their content future obligations is $21 billion. When you add to that their long-term debt obligations that are on the balance sheet over 14 billion, you can start to see where servicing this debt is really going to draw cash flow away from earnings. And so we think that if subscribers are going to top off in the next year or so, this is a long-term view, but also cash cash flow is going to be declining as it services the debt. You can see how this leads to a lower earning picture in the next year or two.\n03:52 Host\nAnd a final reason you're not interested in Netflix, debt load downside risk.\n03:55 Brian Mulberry\nYeah, really, it's all about the the weight, that combination of the payments that they're going to have to make to service that future debt. Interest rates are coming down, but they're kind of stuck where they they brought this debt on the balance sheet about a year or two ago. So they're kind of in a high rate environment on the debt that they currently have. They could try and refinance that, they can try and restructure it, but it is one of those things that concerns us about future cash flow.\n04:15 Host\nAll right, so you're a Netflix skeptic, Brian. Where could you be wrong?\n04:18 Brian Mulberry\nWell, they are growing their ad business, and if that continues to accelerate, that might be the offset to the spend in terms of financing that they're looking for when the debt comes back into the balance sheet. So it it is one of those things where they could use AI innovation to continue to drive ad business and I'll hopefully lower the cost of future content as well.\n04:33 Host\nAll right, buy Intel, the man says, avoid Netflix. Brian, thank you, sir. Appreciate it. And thank you all for watching.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:02:07",
      "Source": "GuruFocus.com",
      "Title": "Top Semiconductor Stocks for 2026 --  Wall Street's 10 Picks To Watch",
      "URL": "https://finance.yahoo.com/news/top-semiconductor-stocks-2026-wall-120207279.html",
      "Content": "Top Semiconductor Stocks for 2026 -- Wall Street's 10 Picks To Watch\n\nNauman Khan\nThu, December 18, 2025 at 4:02 AM PST 1 min read\n\nIn this article: AVGO\n\nALAB\n\nNVDA\n\nMU\n\nINTC\n\nThis article first appeared on GuruFocus .\nMorgan Stanley named Nvidia ( NASDAQ:NVDA ), Broadcom ( NASDAQ:AVGO ) and Astera Labs ( NASDAQ:ALAB ) as its top semiconductor picks for 2026, pointing to strong AI-driven demand in data center chips, according to a recent research note.\nThe firm highlighted Nvidia and Broadcom as its preferred processor names. Analysts said Nvidia could deliver the highest returns in cloud computing as Vera Rubin deployments ramp in the second half of 2026. Broadcom remains central to AI infrastructure, despite potential bottlenecks in ASIC growth.\n\nWarning! GuruFocus has detected 4 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nAstera Labs emerged as the standout small-cap pick for data center opportunities. Morgan Stanley kept Equal-Weight ratings on AMD ( NASDAQ:AMD ) and Marvell ( NASDAQ:MRVL ), noting room for upside but also some uncertainties. Intel ( NASDAQ:INTC ) drew a cautious view due to challenges in its foundry operations.\nIn memory and chip equipment, Micron ( NASDAQ:MU ) leads the way, with Sandisk ( NASDAQ:SNDK ) also rated Overweight. Applied Materials (AMAT) and Taiwan Semiconductor ( NYSE:TSM ) are favored in equipment, while NXP Semiconductors (NXPI) balances growth and value. Analog Devices (ADI) shows growth potential, though at a higher price point.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "19:40:38",
      "Source": "GuruFocus.com",
      "Title": "Advanced Micro Devices Rises After Analyst Reiterates Buy Rating",
      "URL": "https://finance.yahoo.com/news/advanced-micro-devices-rises-analyst-114038601.html",
      "Content": "Advanced Micro Devices Rises After Analyst Reiterates Buy Rating\n\nFaizan Farooque\nThu, December 18, 2025 at 3:40 AM PST 1 min read\n\nIn this article: AMD\n\nINTC\n\nThis article first appeared on GuruFocus .\nAMD ( AMD , Financials ) shares rose after Daiwa analyst Louis Miscioscia maintained a Buy rating and $300 price target. The target is around 40% higher than where shares last traded. The solid forecast is based on the fact that AI workloads in data centers are driving up demand for AMD processors. Companies and cloud providers are using the company's CPUs and GPUs more and more for AI training and inference.\n\nWarning! GuruFocus has detected 5 Warning Signs with AMD.\nIs AMD fairly valued? Test your thesis with our free DCF calculator.\nExperts suggest that AMD is increasing market share in the AI-focused GPU industry as customers look for different vendors and options. Intel is a competitor in the CPU market, while AMD continues to sell its server solutions against established players.\nAMD has released Helios server rack systems, which are pre-configured data center solutions that combine CPUs and GPUs for faster deployment.The chip giant says it makes it easier for businesses to use AI technology on a large scale.Shares went up a little in the morning after being up about 1% the day before. AMD stock has gone up more than 70% this year, which shows that investors are hopeful about AI-related progress.\nInvestors will look at financial reports to see how much demand there is for data centers, how well products are selling, and how much profit the company is making. This could cause the stock to go up.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "08:11:00",
      "Source": "Morningstar Research",
      "Title": "Analyst Report: Applied Materials, Inc.",
      "URL": "https://finance.yahoo.com/m/9bbcbf4a-0fb9-3662-b261-40536851795c/analyst-report%3A-applied.html",
      "Content": "Analyst Report: Applied Materials, Inc.\n\nWilliam Kerwin\nWed, December 17, 2025 at 4:11 PM PST\n\nIn this article: AMAT\n\nTSM\n\nINTC\n\nSSNLF\n\nApplied Materials is the largest semiconductor wafer fabrication equipment manufacturer in the world. It has a broad portfolio spanning nearly every corner of the WFE ecosystem. Applied Materials holds leading market share in deposition, which entails the layering of new materials on semiconductor wafers. It is more exposed to general-purpose logic chips made at integrated device manufacturers and foundries. It counts the largest chipmakers in the world as customers, including TSMC, Intel, and Samsung.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "07:40:00",
      "Source": "PR Newswire",
      "Title": "SK hynix First to Complete Intel Data Center Certification for 32Gb Die-based 256GB Server DDR5 RDIMM",
      "URL": "https://finance.yahoo.com/news/sk-hynix-first-complete-intel-234000528.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nSK hynix First to Complete Intel Data Center Certification for 32Gb Die-based 256GB Server DDR5 RDIMM\n\nPR Newswire\nWed, December 17, 2025 at 3:40 PM PST 3 min read\n\nIn this article: 000660.KS\n\nINTC\n\n- SK hynix 32Gb 1b die-based 256GB server DDR5 RDIMM completes compatibility validation with Intel Xeon 6 platform\n- Demonstrates world-leading expertise in high-capacity DDR5 module technology\n- SK hynix to proactively enhance customer satisfaction as a \"Full-stack AI memory creator\"\nSEOUL, South Korea , Dec. 17, 2025 /PRNewswire/ -- SK hynix Inc. (or \"the company\", www.skhynix.com ) announced today that it has become the first in the industry to complete the Intel Data Center Certified process to apply 256GB DDR5 RDIMM [ 1] —a high capacity server module based on 32Gb fifth-generation 10nm-class (1b) DRAM— to Intel® Xeon® 6 platform.\n1 Registered Dual In-Line Memory Module (RDIMM): DRAM module for server/workstation that includes a register or buffer chip to relay address and command signals between the memory controller and DRAM chip in a memory module\n\nAs an Intel Data Center Certified system/platform, 256GB DDR5 RDIMM has completed extensive testing and rigorous validation by Intel's Advanced Data Center Development Laboratory, and is now the industry's first server module verified to provide reliable performance, compatibility and quality when combined with Intel Xeon processors. SK hynix has previously obtained similar validation in January this year for its 16Gb fourth-generation 10nm-class (1a) die-based 256GB product.\n\nBy becoming the first in the industry to validate compatibility with Intel's latest server platform, SK hynix is demonstrating technological leadership in high-capacity DDR5 modules. Based on this, the company will expand cooperation with major global data center operators and continue to lead the next-generation memory market in response to rapidly increasing demand from server customers.\nIn this new AI-driven infrastructure environment, memory has emerged as a critical determinant of performance. As AI inference models evolve beyond generating simple response to performing complex logical processes, the volume of data that must be processed in real time is growing exponentially. To manage these massive data sets swiftly and reliably, high-capacity and high-performance memory has become indispensable—driving a sharp increase in market demand.\n\nThe company anticipates its latest product to be the ideal solution to meet this growing demand. Servers equipped with the new module deliver up to 16% higher inference performance compared with those using 32Gb die-based 128GB products. In addition, by utilizing 32Gb DRAM chips, the design achieves up to approximately 18% lower power consumption than previous 256GB products based on 16Gb 1a DRAM. With this improved power efficiency and outstanding performance per watt [2] , the company expects strong interest from data center customers.\n\nStory Continues\n2 Performance per watt: An indicator of data capacity per second that can be processed per unit of power\n\n\"We are now able to respond more swiftly to customer needs, solidifying our leadership in the server DDR5 DRAM market. As a full-stack AI memory creator, we will actively address the growing demand for high-performance, low-power, and high-capacity memory solutions to further enhance customer satisfaction.\" said Sangkwon Lee, head of DRAM Product Planning & Enablement at SK hynix.\n\n\"This achievement represents the culmination of collaborative engineering efforts across Intel and SK hynix and demonstrates our shared commitment to advancing memory technology. The high-capacity module addresses the increasingly demanding requirements of capacity-hungry workloads of AI applications, enabling our customers to unlock new levels of performance and efficiency in their data center operations,\" said Dr. Dimitrios Ziakas, VP of Platform Architecture, Intel Data Center Group.\nAbout SK hynix Inc.\nSK hynix Inc., headquartered in Korea, is the world's top tier semiconductor supplier offering Dynamic Random Access Memory chips (\"DRAM\") and flash memory chips (\"NAND flash\") for a wide range of distinguished customers globally. The Company's shares are traded on the Korea Exchange, and the Global Depository shares are listed on the Luxembourg Stock Exchange. Further information about SK hynix is available at www.skhynix.com , news.skhynix.com .\nIntel, the Intel logo and other Intel marks are trademarks of Intel Corporation or its subsidiaries.\nView original content to download multimedia: https://www.prnewswire.com/news-releases/sk-hynix-first-to-complete-intel-data-center-certification-for-32gb-die-based-256gb-server-ddr5-rdimm-302645255.html\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "06:45:05",
      "Source": "Zacks",
      "Title": "Intel (INTC) Dips More Than Broader Market: What You Should Know",
      "URL": "https://finance.yahoo.com/news/intel-intc-dips-more-broader-224505668.html",
      "Content": "Intel (INTC) Dips More Than Broader Market: What You Should Know\n\nZacks Equity Research\nWed, December 17, 2025 at 2:45 PM PST 3 min read\n\nIn this article: INTC\n\n^GSPC\n\n^DJI\n\n^IXIC\n\nIntel (INTC) closed the most recent trading day at $36.05, moving -3.39% from the previous trading session. This change lagged the S&P 500's daily loss of 1.16%. Elsewhere, the Dow saw a downswing of 0.47%, while the tech-heavy Nasdaq depreciated by 1.81%.\nThe world's largest chipmaker's shares have seen an increase of 8.68% over the last month, surpassing the Computer and Technology sector's gain of 1% and the S&P 500's gain of 1.03%.\n\nThe investment community will be closely monitoring the performance of Intel in its forthcoming earnings report. It is anticipated that the company will report an EPS of $0.08, marking a 38.46% fall compared to the same quarter of the previous year. Simultaneously, our latest consensus estimate expects the revenue to be $13.38 billion, showing a 6.2% drop compared to the year-ago quarter.\nRegarding the entire year, the Zacks Consensus Estimates forecast earnings of $0.32 per share and revenue of $52.4 billion, indicating changes of +346.15% and -1.32%, respectively, compared to the previous year.\nInvestors should also note any recent changes to analyst estimates for Intel. These recent revisions tend to reflect the evolving nature of short-term business trends. Hence, positive alterations in estimates signify analyst optimism regarding the business and profitability.\n\nEmpirical research indicates that these revisions in estimates have a direct correlation with impending stock price performance. To capitalize on this, we've crafted the Zacks Rank, a unique model that incorporates these estimate changes and offers a practical rating system.\nRanging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Within the past 30 days, our consensus EPS projection has moved 1.8% higher. At present, Intel boasts a Zacks Rank of #3 (Hold).\nValuation is also important, so investors should note that Intel has a Forward P/E ratio of 115.24 right now. This indicates a premium in contrast to its industry's Forward P/E of 35.41.\n\nMeanwhile, INTC's PEG ratio is currently 12.42. The PEG ratio is akin to the commonly utilized P/E ratio, but this measure also incorporates the company's anticipated earnings growth rate. As the market closed yesterday, the Semiconductor - General industry was having an average PEG ratio of 4.5.\nThe Semiconductor - General industry is part of the Computer and Technology sector. This industry currently has a Zacks Industry Rank of 15, which puts it in the top 7% of all 250+ industries.\n\nStory Continues\nThe Zacks Industry Rank evaluates the power of our distinct industry groups by determining the average Zacks Rank of the individual stocks forming the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nEnsure to harness Zacks.com to stay updated with all these stock-shifting metrics, among others, in the next trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "06:33:40",
      "Source": "Motley Fool",
      "Title": "Stock Market Today, Dec. 17: Broadcom Drops on  China AI Chip Breakthrough and AI Buildout Uncertainty",
      "URL": "https://finance.yahoo.com/m/b94120bd-2174-3b5e-aacc-11f8ba04d936/stock-market-today%2C-dec.-17%3A.html",
      "Content": "Stock Market Today, Dec. 17: Broadcom Drops on China AI Chip Breakthrough and AI Buildout Uncertainty\n\nHoward Smith, The Motley Fool\nWed, December 17, 2025 at 2:33 PM PST 2 min read\n\nIn this article: AVGO\n\n^GSPC\n\n^IXIC\n\nNVDA\n\nINTC\n\nBroadcom (NASDAQ:AVGO) , which designs and supplies semiconductor devices and infrastructure software solutions, closed at $326.02, down 4.48%. Trading volume reached 73 million shares, coming in about 287% above versus its three-month average of 26 million shares.\nHow the markets moved today Wednesday’s trading reflected renewed concern about AI chip profitability and competitive threats from Chinese AI developments, and investors are watching how Broadcom manages margins alongside VMware integration and AI infrastructure demand.\n\nThe S&P 500 (SNPINDEX:^GSPC) fell 1.15% to 6,722, while the Nasdaq Composite (NASDAQINDEX:^IXIC) lost 1.81% to close at 22,694. Among Semiconductors industry rivals, Nvidia (NASDAQ:NVDA) slid 3.81% and Intel (NASDAQ:INTC) dropped 3.38%, underscoring broad pressure on major AI-focused chipmakers.\n\nWhat this means for investors Rising competition from China had tech investors on their heels to start the day. It only got worse with reports that one private equity firm may not back an Oracle data center project as had been expected.\nAn ongoing Chinese government project to boost semiconductor self-sufficiency made a breakthrough, according to reports. While it has yet to result in working chips, a laboratory prototype represents progress.\n\nInvestors are also souring on names like Broadcom as questions arise around AI infrastructure funding. Reports today that Blue Owl Capital may not back the Oracle project as expected gave investors another reason to book profits today.\nDon’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $460,957 !*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $52,242 !*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $509,955 !*\nRight now, we’re issuing “Double Down” alerts for three incredible companies , available when you join Stock Advisor , and there may not be another chance like this anytime soon.\nSee the 3 stocks »\n*Stock Advisor returns as of December 15, 2025\nHoward Smith has positions in Broadcom, Intel, and Nvidia and has the following options: short February 2026 $170 calls on Nvidia and short January 2026 $26 calls on Intel. The Motley Fool has positions in and recommends Intel, Nvidia, and Oracle. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nStock Market Today, Dec. 17: Broadcom Drops on China AI Chip Breakthrough and AI Buildout Uncertainty was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "05:38:06",
      "Source": "Barchart",
      "Title": "Stocks Settle Sharply Lower as Tech Stocks Routed",
      "URL": "https://finance.yahoo.com/m/8b903064-d85d-369e-8085-98879b0b46fe/stocks-settle-sharply-lower.html",
      "Content": "Stocks Settle Sharply Lower as Tech Stocks Routed\n\nRich Asplund\nWed, December 17, 2025 at 1:38 PM PST 8 min read\n\nIn this article: ^GSPC\n\n^IXIC\n\n^DJI\n\n^NDX\n\nCL=F\n\nThe S&P 500 Index ($SPX) (SPY) on Wednesday closed down by -1.16%, the Dow Jones Industrials Index ($DOWI) (DIA) closed down by -0.47%, and the Nasdaq 100 Index ($IUXX) (QQQ) closed down by -1.93%. December E-mini S&P futures (ESZ25) fell -1.02%, and December E-mini Nasdaq futures (NQZ25) fell -1.71%.\n\nStock indexes retreated on Wednesday, with the S&P 500 and Nasdaq 100 posting 3-week lows. The rout in AI-infrastructure stocks and chip makers on Wednesday weighed on the broader market and sparked risk-off in asset markets. Also, a -2% fall in Bitcoin (^BTCUSD) weighed on cryptocurrency-exposed stocks.\nMore News from Barchart While AI Panic Struck Applied Digital (APLD) Stock, the Smart Money Has a Different View\nCathie Wood Keeps Buying the Dip in CoreWeave Stock. Should You?\nJPMorgan Says to Sell NVDA March $160 Puts. Should You Actually?\nMarkets move fast. Keep up by reading our FREE midday Barchart Brief newsletter for exclusive charts, analysis, and headlines.\n\nOn the positive side, energy producers moved higher, as WTI crude oil rose more than 1% after President Trump announced an oil blockade on tankers entering and leaving Venezuela. Mining stocks are also moving higher as tensions in Venezuela escalate, boosting safe-haven demand for precious metals, with silver soaring to a new all-time high.\nDovish comments today from Fed Governor Christopher Waller were supportive of stocks and bonds, as he said the US labor market is \"pretty soft,\" with close to zero job growth, and that inflation is \"pretty well anchored\" around 2%. He added that interest rates are still 50-100 basis points above neutral, and the Fed can steadily lower them with no rush.\nComments from Atlanta Fed President Raphael Bostic were slightly hawkish, with him saying that US GDP growth is solid and that he sees it continuing in 2026. He added that in a close call, inflation is more worrying than the labor market.\n\nUS MBA weekly mortgage applications fell -3.8% in the week ended December 12, with the purchase mortgage sub-index down -2.8% and the refinancing mortgage sub-index down -3.6%. The average 30-year fixed rate mortgage rose +5 bp to 6.38% from 6.33% in the prior week.\nThis week's market focus will be on US economic news. On Thursday, weekly initial unemployment claims are expected to fall -11,000 to 225,000. Also, Nov CPI is expected to be +3.1% y/y, and Nov core CPI is expected to be +3.0% y/y. On Friday, Nov existing home sales are expected to be up +1.2% m/m to 4.15 million. Also, the University of Michigan Dec consumer sentiment index is expected to be revised upward by +0.2 to 53.5 from the previously reported 53.3.\n\nStory Continues\nThe markets are discounting a 24% chance that the FOMC will cut the fed funds target range by 25 bp at the next FOMC meeting on January 27-28.\nOverseas stock markets settled mixed on Wednesday. The Euro Stoxx 50 fell to a 2-week low and closed down -0.63%. China’s Shanghai Composite closed up +1.19%. Japan’s Nikkei Stock 225 recovered from a 2-week low and closed up +0.26%.\n\nInterest Rates\nMarch 10-year T-notes (ZNH6) on Wednesday fell by -0.5 of a tick. The 10-year T-note yield rose +0.6 bp to 4.151%.\nT-notes were little changed on Wednesday. T-note prices had a negative carryover from a plunge in Japanese 10-year bonds to an 18-year low. Also, hawkish comments from Atlanta Fed President Raphael Bostic weighed on T-notes, as he said US GDP growth is solid and that he sees it continuing in 2026.\nT-notes found support on Wednesday from dovish comments from Fed Governor Waller, who said the Fed can keep cutting rates as interest rates are still 50-100 bp above neutral. Also, solid demand for the Treasury’s $13 billion auction of 20-year T-bonds was supportive for T-notes as the auction had a bid-to-cover ratio of 2.67, above the 10-auction average of 2.62.\n\nThe steepening yield curve is bearish for T-note prices. Steepening trades occur when bond investors buy short-term government debt and sell long -term debt. The yield curve has steepened since last Wednesday’s FOMC meeting, when the Fed said it would begin purchasing up to $40 billion of short-term T-bills a month to boost liquidity in the financial system. Longer-term Treasury securities are also under pressure from concerns about inflation and the Fed’s independence.\nEuropean government bond yields were mixed on Wednesday. The 10-year German bund yield rebounded from a 1-week low of 2.826% and finished up +1.9 bp to 2.864%. The 10-year UK gilt yield fell to a 1.5-week low of 4.446% and finished down -4.3 bp to 4.475%.\n\nEurozone Nov CPI was revised downward to +2.1% y/y from the previously reported +2.2% y/y.\nEurozone Q3 labor costs eased to +3.3% y/y from +3.9% y/y in Q2, the smallest pace of increase in three years.\nThe German Dec IFO business conditions survey unexpectedly fell -0.4 to a 7-month low of 87.6 versus expectations of an increase to 88.2.\nUK Nov CPI eased to +3.2% y/y from +3.6% y/y in Oct, better than expectations of +3.5% y/y and the slowest pace of increase in eight months. Nov core CPI rose +3.2% y/y, weaker than expectations of +3.4% y/y and the slowest pace of increase in 11 months.\nSwaps are discounting a 0% chance for a -25 bp rate cut by the ECB at its next policy meeting on Thursday.\nUS Stock Movers\nAI-infrastructure stocks and chip makers sold off on Wednesday and weighed on market sentiment. GE Vernova (GEV) closed down more than -10% to lead losers in the S&P 500, and Constellation Energy (CEG) closed down more than -6% to lead losers in the Nasdaq 100. Also, ASML Holding NV (ASML), Palantir Technologies (PLTR), ARM Holdings Plc (ARM), Lam Research (LRCX), and Advanced Micro Devices (AMD) closed down more than -5%. In addition, KLA Corp (KLAC), Broadcom (AVGO), and Applied Materials (AMAT) closed down more than -4%, and Nvidia (NVDA), Microchip Technology (MCHP), Intel (INTC), and Micron Technology (MU) closed down more than -3%.\n\nCryptocurrency-exposed stocks tumbled on Wednesday as Bitcoin (^BTCUSD) fell more than -2%. Mara Holdings (MARA) and Galaxy Digital Holdings (GLXY) closed down more than -6%. Also, Strategy (MSTR) closed down more than -4%, and Riot Platforms (RIOT) and Coinbase Global (COIN) closed down more than -3%.\nHomebuilding stocks retreated on Wednesday, led by a -4% fall in Lennar (LEN) after it forecast Q1 new orders of 18,000 to 19,000, below the consensus of 20,297. Also, DR Horton (DHI) and PulteGroup (PHM) closed down more than -1%.\nEnergy producers and energy service providers moved higher on Wednesday after WTI crude oil rose more than 1%. Devon Energy (DVN) closed up more than +5%, and ConocoPhillips (COP) and Occidental Petroleum (OXY) closed up more than +4%. Also, Diamondback Energy (FANG) closed up more than +3% to lead gainers in the Nasdaq 100. In addition, APA Corp (APA), Halliburton (HAL) and Exxon Mobil (XOM) closed up more than +2%. Finally, Chevron (CVX) closed up more than +1% to lead gainers in the Dow Jones Industrials.\n\nOracle (ORCL) closed down more than -5% after the Financial Times reported that Blue Owl Capital will not back a $10 billion deal for Oracle’s next data center.\nBrown-Forman Corp (BF.B) closed down more than -5% after Citigroup downgraded the stock to sell from neutral with a price target of $27.\nParamount Skydance (PSKY) closed down more than -5% as Warner Bros. Discovery plans to reject Paramount Skydance’s takeover bid due to concerns about financing and other terms.\nFortinet (FTNT) closed down more than -3% after JPMorgan Chase downgraded the stock to underweight from neutral with a price target of $75.\nBally’s Corp (BALY) closed down more than -3% after Barclays downgraded the stock to underweight from equal weight with a price target of $11.\n\nWorthington Enterprises (WOR) closed down more than -2% after reporting Q2 adjusted EPS of 65 cents, weaker than the consensus of 70 cents.\nProgressive Corp (PGR) closed down more than -1% after reporting that November net premiums written fell 12% m/m.\nTexas Pacific Land Corp (TPL) closed up more than +7% to lead gainers in the S&P 500 after announcing a strategic agreement with Bolt Data & Energy to develop large-scale data center campuses across TPL’s West Texas land holdings.\nGeneral Mills (GIS) closed up more than +3% after reporting Q2 net sales of $4.86 billion, above the consensus of $4.79 billion.\nAlbemarle (ALB) closed up more than +2% to lead lithium producers higher as lithium prices continue to rise with expected demand growth.\n\nLumentum Holdings (LITE) closed up more than +1% after Morgan Stanley raised its price target on the stock to $304 from $190.\nSalesforce (CRM) closed up more than +1% after BTIG initiated coverage on the stock with a recommendation of buy and a price target of $335.\nEarnings Reports(12/18/2025)\nAccenture PLC (ACN), Birkenstock Holding Plc (BIRK), CarMax Inc (KMX), Cintas Corp (CTAS), Darden Restaurants Inc (DRI), FactSet Research Systems Inc (FDS), FedEx Corp (FDX), HEICO Corp (HEI), NIKE Inc (NKE).\nOn the date of publication, Rich Asplund did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "02:03:28",
      "Source": "Reuters",
      "Title": "Republican lawmakers decry Intel's testing of Chinese-linked tools after Reuters report",
      "URL": "https://finance.yahoo.com/news/republican-lawmakers-decry-intels-testing-180328101.html",
      "Content": "Republican lawmakers decry Intel's testing of Chinese-linked tools after Reuters report\n\nAlexandra Alper\nWed, December 17, 2025 at 10:03 AM PST 3 min read\n\nIn this article: ACMR\n\nINTC\n\nBy Alexandra Alper\nWASHINGTON, Dec 17 (Reuters) - Republican lawmakers accused Intel this week of threatening U.S. national security after Reuters revealed the chipmaker was evaluating chipmaking equipment made by a company with deep ties to China and ​overseas units sanctioned by the U.S. government.\n\nIntel, whose CEO came under pressure from President Donald Trump to resign in ‌August over his alleged ties to China, got the tools from ACM Research, a Fremont, California-based producer of chipmaking equipment.\nThe tools were tested for possible use ‌in Intel's most advanced chipmaking process, known as 14A.\nTwo of ACM's units were among a number of firms barred last year from receiving U.S. technology over claims they supported Chinese government efforts to harness commercial technology for military use and making advanced chips or chipmaking tools. ACM denies the allegations. Shares of its Shanghai unit rose 8% the day the story was published.\n\"Testing Chinese-linked tools for U.S. chip ⁠manufacturing opens the door for the (Chinese Government) ‌to manipulate or compromise our most advanced semiconductor capabilities,\" Republican Senator Marsha Blackburn said in a statement to Reuters. \"It is egregious that Intel would put American national and economic security at risk.\"\n\nBlackburn called for ‍the passage of legislation she co-sponsored to bar chipmakers that have received billions in U.S. government subsidies from using Chinese equipment as part of their government-backed expansion plans.\nReuters could not determine if Intel had made a decision to add the tools to the chipmaking process and has no ​evidence that the company violated any U.S. regulations.\nACM did not respond to a request for comment. Intel reiterated that it ‌was not using ACM tools to produce chips currently and that it complies with U.S. laws and regulations.\nIntel said it takes \"U.S. national security responsibilities extremely seriously and operates under rigorous IT and cyber security protocols\" to protect sensitive information.\nThe company limits the data any individual tool can receive during manufacturing, ensures tools cannot connect with each other, and monitors communications from all equipment, it added.\n\nIntel also said it engages regularly with lawmakers, regulators and U.S. government customers about manufacturing and security and welcomes continued dialogue with ⁠policymakers to address any concerns.\nChina hawks said the fact that Intel, which ​is now part-owned by the U.S. government, would consider adding tools made by ​a firm with sanctioned units into its most advanced manufacturing line, raised important national security concerns.\n\nStory Continues\nThey flagged the possible transfer of Intel's sensitive technological know-how to China, the eventual displacement of trusted Western tool suppliers ‍with China-linked firms and even the ⁠potential for sabotage efforts by Beijing.\nRepublican Congressman John Moolenaar, who chairs the powerful House Select Committee on China, said there was no faster way to erase America's advantage in AI chips and the tools to make them than by ⁠importing Chinese manufacturing equipment into American factories and turbocharging its adoption.\n\"Given that Intel has received generous U.S. taxpayer support due to its corporate alignment with ‌the national interest, it is hard to believe Intel would consider taking this step and possibly jeopardize American ‌national security,\" he said.\n(Reporting by Alexandra Alper; Editing by Nia Williams)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "00:24:19",
      "Source": "Barchart",
      "Title": "Stocks Retreat as AI Infrastructure Companies and Chip Makers Fall",
      "URL": "https://finance.yahoo.com/m/dcbf4e6d-55a0-37a0-88e8-bb0bc313ca00/stocks-retreat-as-ai.html",
      "Content": "Stocks Retreat as AI Infrastructure Companies and Chip Makers Fall\n\nRich Asplund\nWed, December 17, 2025 at 8:24 AM PST 7 min read\n\nIn this article: ^GSPC\n\nNQ*0\n\nDHI\n\nFTNT\n\nPSKY\n\nThe S&P 500 Index ($SPX) (SPY) today is down by -0.61%, the Dow Jones Industrials Index ($DOWI) (DIA) is down by -0.12%, and the Nasdaq 100 Index ($IUXX) (QQQ) is down by -1.12%. December E-mini S&P futures (ESZ25) are down -0.66%, and December E-mini Nasdaq futures (NQZ25) are down -1.15%.\n\nStock indexes are falling today, with the S&P 500 and Nasdaq 100 posting 3-week lows. Weakness in AI infrastructure stocks and chip makers is dragging the broader market lower and weighing on market sentiment. Also, homebuilding stocks are lower, led by a -5% fall in Lennar after it reported Q4 EPS that were weaker than expected.\nMore News from Barchart While AI Panic Struck Applied Digital (APLD) Stock, the Smart Money Has a Different View\nJPMorgan Says to Sell NVDA March $160 Puts. Should You Actually?\nBroadcom Stock Is Up 120% in the Past Year. This Analyst Thinks It Is One of the Highest-Quality Stocks to Buy for the Next Year Too.\nGet exclusive insights with the FREE Barchart Brief newsletter. Subscribe now for quick, incisive midday market analysis you won't find anywhere else.\n\nOn the positive side, energy producers are climbing, with WTI crude oil up by more than 1% after President Trump announced an oil blockade on tankers entering and leaving Venezuela. Mining stocks are also moving higher as tensions in Venezuela escalate, boosting safe-haven demand for precious metals, with silver soaring to a new all-time high.\nDovish comments today from Fed Governor Christopher Waller were supportive of stocks and bonds, as he said the US labor market is \"pretty soft,\" with close to zero job growth, and that inflation is \"pretty well anchored\" around 2%. He added that interest rates are still 50-100 basis points above neutral, and the Fed can steadily lower them with no rush.\nUS MBA weekly mortgage applications fell -3.8% in the week ended December 12, with the purchase mortgage sub-index down -2.8% and the refinancing mortgage sub-index down -3.6%. The average 30-year fixed rate mortgage rose +5 bp to 6.38% from 6.33% in the prior week.\n\nThis week's market focus will be on US economic news. On Thursday, weekly initial unemployment claims are expected to fall -11,000 to 225,000. Also, Nov CPI is expected to be +3.1% y/y, and Nov core CPI is expected to be +3.0% y/y. On Friday, Nov existing home sales are expected to be up +1.2% m/m to 4.15 million. Also, the University of Michigan Dec consumer sentiment index is expected to be revised upward by +0.2 to 53.5 from the previously reported 53.3.\n\nStory continues\nThe markets are discounting a 24% chance that the FOMC will cut the fed funds target range by 25 bp at the next FOMC meeting on January 27-28.\nOverseas stock markets are mixed today. The Euro Stoxx 50 is down -0.24%. China’s Shanghai Composite closed up +1.19%. Japan’s Nikkei Stock 225 recovered from a 2-week low and closed up +0.26%.\n\nInterest Rates\nMarch 10-year T-notes (ZNH6) today are up by +1 tick. The 10-year T-note yield is down -0.4 bp to 4.141%. T-notes recovered from early losses today and are slightly higher due to dovish comments from Fed Governor Waller, who said the Fed can keep cutting rates as interest rates are still 50-100 bp above neutral.\nT-notes initially moved lower today on negative carryover from a plunge in Japanese 10-year bonds to an 18-year low. Also, supply pressures are weighing on T-note prices ahead of the Treasury’s $13 billion auction of 20-year T-bonds later today.\nThe steepening yield curve is bearish for T-note prices. Steepening trades occur when bond investors buy short-term government debt and sell long -term debt. The yield curve has steepened since last Wednesday’s FOMC meeting, when the Fed said it would begin purchasing up to $40 billion of short-term T-bills a month to boost liquidity in the financial system. Longer-term Treasury securities are also under pressure from concerns about inflation and the Fed’s independence.\n\nEuropean government bond yields are mixed today. The 10-year German bund yield rebounded from a 1-week low of 2.826% and is up +0.6 bp to 2.851%. The 10-year UK gilt yield fell to a 1.5-week low of 4.446% and is down -6.2 bp to 4.456%.\nEurozone Nov CPI was revised downward to +2.1% y/y from the previously reported +2.2% y/y.\nEurozone Q3 labor costs eased to +3.3% y/y from +3.9% y/y in Q2, the smallest pace of increase in three years.\nThe German Dec IFO business conditions survey unexpectedly fell -0.4 to a 7-month low of 87.6 versus expectations of an increase to 88.2.\nUK Nov CPI eased to +3.2% y/y from +3.6% y/y in Oct, better than expectations of +3.5% y/y and the slowest pace of increase in eight months. Nov core CPI rose +3.2% y/y, weaker than expectations of +3.4% y/y and the slowest pace of increase in 11 months.\n\nSwaps are discounting a 0% chance for a -25 bp rate cut by the ECB at its next policy meeting on Thursday.\nUS Stock Movers\nAI infrastructure stocks and chip makers are sliding today and weighing on market sentiment. GE Vernova (GEV) is down more than -6% to lead losers in the S&P 500, and Constellation Energy (CEG) is down more than -6% to lead losers in the Nasdaq 100. Also, Broadcom (AVGO) and ASML Holding NV (ASML) are down more than -4%. In addition, Lam Research (LRCX), Nvidia (NVDA), and Advanced Micro Devices (AMD) are down more than -3%. Finally, Palantir Technologies (PLTR), ARM Holdings Plc (ARM), KLA Corp (KLAC), Applied Materials (AMAT), Intel (INTC), and Micron Technology (MU) are down more than -2%.\nHomebuilding stocks are lower today, led by a -5% fall in Lennar (LEN) after it forecast Q1 new orders of 18,000 to 19,000, below the consensus of 20,297. Also, DR Horton (DHI) is down more than -2%, and PulteGroup (PHM) is down more than -1%.\n\nEnergy producers and energy service providers are climbing today, with WTI crude oil up by more than 1%. Devon Energy (DVN) is up more than +3%, and ConocoPhillips (COP) is up more than +2%. Also, APA Corp (APA), Halliburton (HAL), Occidental Petroleum (OXY), Diamondback Energy (FANG), Chevron (CVX), and Exxon Mobil (XOM) are up more than +1%.\nOracle (ORCL) is down more than -5% after the Financial Times reported that Blue Owl Capital will not back a $10 billion deal for Oracle’s next data center.\nParamount Skydance (PSKY) is down more than -4% to lead losers in the S&P 500 as Warner Bros. Discovery plans to reject Paramount Skydance’s takeover bid due to concerns about financing and other terms.\nWorthington Enterprises (WOR) is down more than -4% after reporting Q2 adjusted EPS of 65 cents, weaker than the consensus of 70 cents.\n\nBrown-Forman Corp (BF.B) is down more than -4% after Citigroup downgraded the stock to sell from neutral with a price target of $27.\nBally’s Corp (BALY) is down more than -3% after Barclays downgraded the stock to underweight from equal weight with a price target of $11.\nProgressive Corp (PGR) is down more than 2% after reporting that November net premiums written fell 12% m/m.\nFortinet (FTNT) is down more than -2% after JPMorgan Chase downgraded the stock to underweight from neutral with a price target of $75.\nTexas Pacific Land Corp (TPL) is up more than +7% to lead gainers in the S&P 500 after announcing a strategic agreement with Bolt Data & Energy to develop large-scale data center campuses across TPL’s West Texas land holdings.\n\nAlbemarle (ALB) is up more than +4% to lead lithium producers higher as lithium prices continue to rise with expected demand growth.\nLumentum Holdings (LITE) is up more than +3% after Morgan Stanley raised its price target on the stock to $304 from $190.\nSalesforce (CRM) is up more than +2% to lead gainers in the Dow Jones Industrials after BTIG initiated coverage on the stock with a recommendation of buy and a price target of $335.\nGeneral Mills (GIS) is up more than +2% after reporting Q2 net sales of $4.86 billion, above the consensus of $4.79 billion.\nNetflix (NFLX) is up more than +1% as Warner Bros. Discovery plans to reject Paramount Skydance’s takeover bid due to concerns about financing and other terms.\nEarnings Reports(12/17/2025)\nGeneral Mills Inc (GIS), Jabil Inc (JBL), Micron Technology Inc (MU), Toro Co/The (TTC).\nOn the date of publication, Rich Asplund did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:17:58",
      "Source": "Reuters",
      "Title": "Exclusive-How China built its ‘Manhattan Project’ to rival the West in AI chips",
      "URL": "https://finance.yahoo.com/news/exclusive-china-built-manhattan-project-141758929.html",
      "Content": "Exclusive-How China built its ‘Manhattan Project’ to rival the West in AI chips\n\nFanny Potkin\nWed, December 17, 2025 at 6:17 AM PST 11 min read\n\nIn this article: ASML\n\nINTC\n\nSSNLF\n\nNVDA\n\nAMD\n\nBy Fanny Potkin\nSINGAPORE Dec 17 - In a high-security Shenzhen laboratory, Chinese scientists have built what Washington has spent years trying to prevent: a prototype of a machine capable of producing the cutting-edge semiconductor chips that power artificial intelligence , smartphones and weapons central to Western military dominance, Reuters has learned.\n\nCompleted in early 2025 and now undergoing testing, the prototype fills nearly an entire factory floor. It was built by a team of former engineers from Dutch semiconductor giant ASML who reverse-engineered the company's extreme ultraviolet lithography machines or EUVs, according to two people with knowledge of the project.\nEUV machines sit at the heart of a technological Cold War. They use beams of extreme ultraviolet light to etch circuits thousands of times thinner than a human hair onto silicon wafers, currently a capability monopolized by the West. ​The smaller the circuits, the more powerful the chips.\nChina's machine is operational and successfully generating extreme ultraviolet light, but has not yet produced working chips, the people said.\n\nIn April, ASML CEO Christophe Fouquet said that China would need \"many, many years\" to develop such technology. But the existence of this prototype, reported by Reuters for the first time, suggests China may be years closer to achieving semiconductor independence than analysts anticipated.\nNevertheless, China still faces ‌major technical challenges, particularly in replicating the precision optical systems that Western suppliers produce.\nThe availability of parts from older ASML machines on secondary markets has allowed China to build a domestic prototype, with the government setting a goal of producing working chips on the prototype by 2028, according to the two people.\nBut those close to the project say a more realistic target is 2030, which is still years earlier than the decade that analysts believed it would take China to match the West on chips.\n\nChinese authorities did not respond to requests for comment.\nThe breakthrough marks the culmination of a six-year government ‌initiative to achieve semiconductor self-sufficiency, one of President Xi Jinping's highest priorities. While China's semiconductor goals have been public, the Shenzhen EUV project has been conducted in secret, according to the people.\nThe project falls under the country's semiconductor strategy, which state media has identified as being run by Xi Jinping confidant Ding Xuexiang, who heads the Communist Party's Central Science and Technology Commission.\n\nStory Continues\nChinese electronics giant Huawei plays a key role coordinating a web of companies and state research institutes across the country involving thousands of engineers, according to the two people and a third source.\nThe people described it as China's version of the Manhattan Project, the U.S. wartime effort to develop the atomic bomb.\n\n“The aim is for China to eventually be able to make advanced chips on machines that are entirely China-made,” one of the people said. \"China wants the United States 100% kicked out of its supply chains.\"\nHuawei, the State Council of China, the Chinese Embassy in Washington, and China's Ministry of Industry and Information Technology did not respond to requests for comment.\nUntil now, only one company has mastered EUV technology: ASML, headquartered in Veldhoven, Netherlands. Its machines, which cost around $250 million, are indispensable for manufacturing the most advanced chips designed by companies like Nvidia and AMD—and produced by chipmakers such as TSMC, Intel, and Samsung.\nASML built its first working prototype of EUV technology in 2001, and told Reuters it took nearly two decades and billions of euros in R&D spending before it produced its first commercially-available chips in 2019.\n\n“It makes sense that companies would want to replicate our technology, but doing so is no small ⁠feat,” ASML told Reuters in a statement.\nASML's EUV systems are currently available to U.S. allies including Taiwan, South Korea, and Japan.\nStarting in 2018, the United States began pressuring ‌the Netherlands to block ASML from selling EUV systems to China. The restrictions expanded in 2022, when the Biden administration imposed sweeping export controls designed to cut off China's access to advanced semiconductor technology.\nThe controls targeted not just EUV systems but also older deep ultraviolet (DUV) lithography machines that produce less-advanced chips like Huawei’s, aiming to keep China at least a generation behind in chipmaking capabilities.\n\nThe U.S. State Department said the Trump Administration has strengthened enforcement of export controls on advanced semiconductor manufacturing equipment and is working with partners \"to close loopholes as technology advances.”\nThe Dutch Ministry of Defence said the Netherlands is developing policies requiring “knowledge institutions” to perform personnel screenings to prevent access to sensitive technology “by individuals that have ill intentions or who are at risk of being pressured.”\nExport restrictions ‍have slowed China's progress toward semiconductor self-sufficiency for years, and constrained advanced chip production at Huawei, the two people and a third person said.\nThe sources spoke on condition they not be identified due to the confidentiality of the project.\n\nCHINA'S MANHATTAN PROJECT\nOne veteran Chinese engineer from ASML recruited to the project was surprised to find that his generous signing bonus came with an identification card issued under a false name, according to one of the people, who was familiar with his recruitment.\nOnce inside, he recognized other former ASML colleagues who were also working under aliases and was instructed to use their fake names at work to maintain secrecy, the person said. Another person independently confirmed that recruits were given fake IDs to conceal their identities from other workers inside the secure facility.\nThe guidance was clear, the two people said: Classified under national security, no one outside the compound could know what they were building—or that they were there at all.\n\nThe team includes recently retired, Chinese-born former ASML engineers and scientists—prime recruitment targets because they possess sensitive technical knowledge but face fewer professional constraints after leaving the company, ​the people said.\nTwo current ASML employees of Chinese nationality in the Netherlands told Reuters they have been approached by recruiters from Huawei since at least 2020.\nHuawei did not respond to requests for comment.\nEuropean privacy laws limit ASML's ability to track former employees. Though employees sign non-disclosure agreements, enforcing them across borders has proven difficult.\nASML won an $845 million judgment in 2019 against a former Chinese engineer accused of stealing trade secrets, but the defendant filed for bankruptcy and continues to ‌operate in Beijing with Chinese government support, according to court documents.\n\nASML told Reuters that it “vigilantly guards” trade secrets and confidential information.\n\"While ASML cannot control or restrict where former employees work, all employees are bound by the confidentiality clauses in their contracts,\" the company said, and it has \"successfully pursued legal action in response to the theft of trade secrets.”\nReuters was unable to determine if any legal actions have been taken against former ASML employees involved in China’s lithography program.\nThe company said it safeguards EUV knowledge by ensuring only select employees can access the information even inside the company.\nDutch intelligence warned in an April report that China \"used extensive espionage programmes in its attempts to obtain advanced technology and knowledge from Western countries,\" including recruiting \"Western scientists and employees of high-tech companies.”\n\nThe ASML veterans made the breakthrough in Shenzhen possible, the people said. Without their intimate knowledge of the technology, reverse-engineering the machines would have been nearly impossible.\nTheir recruitment was part of an aggressive drive China launched in 2019 for semiconductor experts working abroad, offering signing bonuses that started at 3 million to 5 million yuan ($420,000 to $700,000) and home-purchase subsidies, according to a Reuters review of government policy documents.\nRecruits included Lin Nan, ASML's former head of light source technology, whose team at the Chinese Academy of Sciences' Shanghai Institute of Optics has filed eight patents on EUV light sources in 18 months, according to patent filings.\nThe Shanghai Institute of Optics and Fine Mechanics did not respond to requests for comment. Lin could not be reached for comment.\n\nTwo additional people familiar with China’s recruitment efforts said some naturalized citizens of other countries were given Chinese passports and allowed to maintain dual citizenship.\nChina officially prohibits dual citizenship and did not answer questions on issuing passports.\nChinese authorities did not respond to requests for comment.\nINSIDE CHINA'S EUV FAB\nASML's most advanced EUV systems are roughly the size of a school bus, and weigh 180 tons. After failed attempts to replicate its size, the prototype inside the Shenzhen lab became many times larger to improve its ⁠power, according to the two people.\nThe Chinese prototype is crude compared to ASML's machines but operational enough for testing, the people said.\nChina's prototype lags behind ASML's machines largely because researchers have struggled to obtain optical systems like those from Germany's Carl Zeiss AG, one of ASML's ​key suppliers, the two people said.\n\nZeiss declined to comment.\nThe machines fire lasers at molten tin 50,000 times per second, generating plasma at 200,000 degrees Celsius. The light is focused using mirrors that take months to produce, according to Zeiss' website.\nChina's top research institutes have played key roles in developing homegrown ​alternatives, according to the two people.\nThe Changchun Institute of Optics, Fine Mechanics and Physics at the Chinese Academy of Sciences (CIOMP) achieved a breakthrough in integrating extreme-ultraviolet light into the prototype's optical system, enabling it to become operational in early 2025, one of the people said, though the optics still require significant refinement.\nCIOMP did not respond to requests for comment.\nIn a March online recruitment call on its website, the institute said it was offering \"uncapped\" salaries to PhD lithography researchers and research grants worth up to 4 million yuan ($560,000) plus 1 million yuan ($140,000) in personal subsidies.\n\nJeff Koch, an analyst at research firm SemiAnalysis and a former ASML engineer, said China will have achieved \"meaningful progress” if the “light source has enough power, is reliable, and doesn’t generate too much contamination.”\n\"No doubt this is technically feasible, it's ‍just a question of timeline,\" he said. \"China has the advantage that commercial EUV now exists, so they aren't starting from zero.\"\nTo ⁠get the required parts, China is salvaging components from older ASML machines and sourcing parts from ASML suppliers through secondhand markets, the two people said.\nNetworks of intermediary companies are sometimes used to mask the ultimate buyer, the people said.\nExport-restricted components from Japan’s Nikon and Canon are being used for the prototype, one of the people and an additional source said.\n\nNikon declined to comment. Canon said it was not aware of such reports. The Japanese Embassy in Washington did not respond to a request for comment.\nInternational banks regularly auction older semiconductor fabrication equipment, the sources said. Auctions in China sold older ASML lithography equipment as recently as October 2025, according to a review of listings on Alibaba Auction, an Alibaba-owned platform.\nA team of around 100 recent university graduates is focused on reverse-engineering components from both EUV and DUV lithography machines, according to the people.\nEach worker's desk is filmed by an individual camera ⁠to document their efforts to disassemble and reassemble parts—work the people described as key to China's lithography efforts.\n\nStaffers who successfully reassemble a component receive bonuses, the people said.\nHUAWEI SCIENTISTS SLEEP ON-SITE\nWhile the EUV project is run by the Chinese government, Huawei is involved in every step of the supply chain from chip design and fabrication equipment to manufacturing and final integration into products like smartphones, according to four people familiar with Huawei’s operations.\nCEO Ren Zhengfei briefs senior Chinese leaders on progress, according to one of the people.\nThe U.S. placed Huawei on an entity list in 2019, banning American companies from ‌doing business with them without a license.\nHuawei has deployed employees to offices, fabrication plants, and research centers across the country for the effort. Employees assigned to semiconductor teams often sleep on-site and are barred from returning home during the work week, with phone access restricted for teams handling more sensitive tasks, according to the people.\nInside Huawei, few employees know the scope of this work. \"The teams are kept isolated from ‌each other to protect the confidentiality of the project,\" one of the people said. “They don't know what the other teams work on.”\n(Reporting by Fanny Potkin in Singapore, additional reporting by Alexandra Alper in Washington, editing by Ken Li and Michael Learmonth)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:00:00",
      "Source": "Business Wire",
      "Title": "Archive Intel Adds Microsoft Dynamics 365 as Integration Partner, Enabling Automatic Contact Whitelisting for MS Ecosystem Users",
      "URL": "https://finance.yahoo.com/news/archive-intel-adds-microsoft-dynamics-140000571.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nArchive Intel Adds Microsoft Dynamics 365 as Integration Partner, Enabling Automatic Contact Whitelisting for MS Ecosystem Users\n\nBusiness Wire\nWed, December 17, 2025 at 6:00 AM PST 3 min read\n\nIn this article: MSFT\n\nINTC\n\nIntegration deepens Archive Intel’s capabilities as the premier automated compliance system of record, supporting scalable mobile communications archiving and AI-driven review\nALPHARETTA, Ga., December 17, 2025 --( BUSINESS WIRE )-- Archive Intel , an AI-powered communications compliance platform for financial institutions, today announced its new integration with Microsoft Dynamics 365 , enabling users to automatically import and sync business contacts directly from the Microsoft ecosystem for compliant text-message archiving. By eliminating manual whitelisting at the individual user level, the update enhances efficiency for Microsoft Dynamics customers and reinforces Archive Intel’s position as a centralized, enterprise-grade compliance system of record for growing advisory firms.\n\nMicrosoft Dynamics 365 is a cloud-based suite of AI-driven business applications that unifies enterprise resource planning (ERP), customer relationship management (CRM) and business intelligence (BI). Connecting Archive Intel to Dynamics 365 gives firms a streamlined, automated contact-management workflow, enabling organization-wide whitelisting for text-archiving across iMessage and Android devices. With continuous syncing, firms maintain accurate, up-to-date records as client information evolves, while reducing risk from oversight gaps common with manual processes.\n\"For regulated firms, consistency and accuracy across communication records are essential, yet manual whitelisting creates unnecessary risk and operational drag,\" said Larry Shumbres , founder and CEO of Archive Intel . \"This integration solves that challenge at scale. By automating contact sync from Microsoft Dynamics, we give firms a simple, reliable and efficient way to ensure compliant text archiving across every advisor and employee.\"\n\nThe integration supports Archive Intel’s broader growth strategy to unify compliance operations across the systems advisors already use. By pulling contact data directly from a firm’s CRM or data lake, Archive Intel’s AI-driven archiving, monitoring and review tools can operate with greater precision and significantly less manual intervention. This reduces operational burden for firms and enables Archive Intel to continue expanding platform intelligence and automation capabilities.\n\"The quality of a firm’s data directly impacts the speed and accuracy of communications archival, while protecting the privacy of employees by not archiving personal messages,\" said Laura Kimble , CPO and head of AI at Archive Intel . \"Cleaner, centralized contact information allows our system to reduce false positives, accelerate review cycles and deliver a stronger, more scalable compliance foundation for every client we serve.\"\n\nStory Continues\nAdministrators with Power Platform Administrator, Dynamics 365 Administrator, or Global Administrator roles can activate the integration through a secure OAuth 2.0 connection within their Archive Intel account. Firms may set custom syncing schedules — daily, weekly or at another cadence — to maintain continuous alignment as client records change. All imported contacts populate the Organization Contacts tab, making them available platform-wide.\n\nThe Microsoft Dynamics 365 integration is available now and included at no additional cost to Archive Intel clients.\nFor more information, visit archiveintel.com .\nAbout Archive Intel\nArchive Intel is an AI-powered compliance platform built for the financial services industry. The company helps financial institutions monitor, archive, and review communications and marketing content with speed and precision. Its AI automates up to 85% of manual review tasks and reduces false positives by 99%, improving oversight while cutting operational costs. Archive Intel supports text archiving from personal devices with business contact whitelisting, social media, email, and AI marketing review in one secure, audit-ready platform.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251217317137/en/\nContacts\nMEDIA CONTACT:\narchiveintel@streetcredpr.com\nTommy Warburton\n347-400-3483\nTommy@streetcredpr.com\nLindsay McCoy\n906-322-4982\nLindsay@streetcredpr.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "00:50:06",
      "Source": "24/7 Wall St.",
      "Title": "Billionaire David Tepper Sells These 5 Stocks to Buy This 1 Stock",
      "URL": "https://finance.yahoo.com/m/4c5d007f-f956-3736-be81-1711b9f7fad0/billionaire-david-tepper.html",
      "Content": "Billionaire David Tepper Sells These 5 Stocks to Buy This 1 Stock\n\nOmor Ibne Ehsan\nTue, December 16, 2025 at 8:50 AM PST 5 min read\n\nIn this article: UNH\n\nINTC\n\nNVDA\n\nWHR\n\nVST\n\nQuick Read David Tepper sold his entire Intel (INTC) stake worth $205M despite recent government backing and Nvidia partnership.\nUnitedHealth (UNH) was Tepper’s largest sale at $780M after buying a similar amount the prior quarter.\nHe sold many other stocks, including AI ones, to buy this 1 recovery bet.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality. Read more here .\n\nDavid Tepper is one of the most successful hedge fund managers in history, with a net worth of ~$23.7 billion. He's been selling UnitedHealth ( NYSE:UNH ) , Intel ( NASDAQ:INTC ) , Alibaba ( NYSE:BABA ) , Vistra ( NYSE:VST ) , and Micron ( NASDAQ:MU ) . He's piling into a lesser-known stock instead called Whirlpool ( NYSE:WHR ) , and we'll look into why in a bit.\nTepper is the founder of Appaloosa Management and is also the proprietor of the NFL's Carolina Panthers and Charlotte FC in Major League Soccer.\nTepper is credited with playing a major role in the survival of Goldman Sachs after the 1987 stock market crash. After being passed over for a partner at Goldman Sachs twice, Tepper quit in December 1992 and created Appaloosa Management in early 1993. This hedge fund has been raking it in. It has returned roughly 25% a year since its founding.\n\nOne of his hallmark strategies is to buy up distressed stocks, especially those of companies with debt-laden balance sheets. He has successfully invested in many such stocks, and the contrarian approach paid off as the companies recovered. This is exactly what he did in 2009 and earned $7 billion by buying distressed financial stocks in February and March.\nHe's now selling many AI holdings and popular stocks, a very contrarian move. Let's take a look.\nStock #1: UnitedHealth (UNH) Tepper's largest sale for Q3 2025 was UNH. He shaved off 92% of his position, or about $780 million worth of the stock. UNH turned into a fan-favorite for hedge funds after it halved in value. After all, how can you pass on America's largest insurance business at a 50% discount?\nTepper is doing just that after buying a similar amount of shares in Q2 2025. It's unknown when he bought in Q2 2025, but if he bought at the peak, he may be just cutting his losses. If he bought the dip, the ongoing \"recovery\" may be too slow for his liking, and he's fine with the tidy profits.\n\nStock #2: Intel (INTC) Wall Street's hopes were dashed for Intel as it failed to make use of the AI headwinds... right up until the company's new CEO, Lip-Bu Tan, cozied up with the Trump administration. He's been able to secure U.S. government + SoftBank investments. Even Nvidia ( NASDAQ:NVDA ) , a \"competitor,\" partnered up with Intel with a $5 billion deal this September. This led to Intel's \"best day since 1987\".\n\nStory Continues\nTepper isn't interested.\nHe sold $205 million worth of INTC stock. That's his entire stake. Tepper likely did this to take profits as INTC stock became much more expensive. Analysts believe Intel won't be able to make a full recovery (both profits and sales-wise) this decade. Thus, Tepper likely sees the hullabaloo as premature.\n\nStock #3: Alibaba (BABA) Tepper trimmed his BABA holdings by 8.73%. Alibaba is still his largest holding and constitutes 15.61% of his portfolio, so it was still the third-largest sale, worth $110 million.\nBABA is up 75.4% in the past year, and Tepper was loading up well before the rally. He's likely just taking profits.\n\nStock #4: Vistra (VST) Vistra holdings were reduced by 30.83% in Q3, or by $109 million. He bought in Q3 and Q4 of last year and has been taking profits in Q1, Q2, and Q3.\nTepper is likely just booking profits while maintaining exposure to the AI-driven power demand thesis.\nStock #5: Micron (MU) He sold 39.39% of his MU stock, worth $54.4 million. Tepper has a long history with Micron, with multiple buys and sells dating back to 2006.\nIn Q2 2025, he more than doubled his stake and then took some profits in Q3. He still has plenty of exposure to this stock.\nThe stock he bought: Whirlpool (WHR) Tepper's biggest purchase in Q3 was increasing Appaloosa's stake in Whirlpool by a whopping 1,967%. He added $411 million to his WHR holdings, making it his third largest in one swoop. This company sells home appliances.\nWHR stock is down nearly 69% from its peak in mid-2021 and is yet to show any sign of bottoming out. What caused Whirlpool's fall? Mainly, the company has been hit by the horrible post-pandemic housing bust. Homeowners have been reluctant to move due to locked-in low-rate mortgages.\n\nIts total debt is at $8.28 billion against a market capitalization of $4.36 billion. This is a classic Tepper bet on an indebted company that is beaten down. In all likelihood, Tepper likely sees retailers reverting to buying Whirlpool items after China tariffs are fully implemented and interest rate cuts induce more homebuilding.\nData Shows One Habit Doubles American’s Savings And Boosts Retirement Most Americans drastically underestimate how much they need to retire and overestimate how prepared they are. But data shows that people with one habit have more than double the savings of those who don’t.\nAnd no, it’s got nothing to do with increasing your income, savings, clipping coupons, or even cutting back on your lifestyle. It’s much more straightforward (and powerful) than any of that. Frankly, it’s shocking more people don’t adopt the habit given how easy it is .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "00:31:00",
      "Source": "Zacks",
      "Title": "Can Intel's AI Focus Restore Its Competitive Edge & Boost Shares?",
      "URL": "https://finance.yahoo.com/news/intels-ai-focus-restore-competitive-163100510.html",
      "Content": "Can Intel's AI Focus Restore Its Competitive Edge & Boost Shares?\n\nZacks Equity Research\nTue, December 16, 2025 at 8:31 AM PST 3 min read\n\nIn this article: INTC\n\nSANS.PVT\n\nPer a Bloomberg news report , Intel Corporation ( INTC ) is in advanced talks to acquire AI start-up SambaNova Systems for about $1.6 billion. SambaNova is known for designing custom AI chips and systems. Acquiring an AI-focused company facilitates Intel with a ready-made AI architecture, software stacks and engineering talent, minimizing years of internal development time and speeding up its AI development plans.\n\nIf the deal materializes, it will help Intel to modernize its CPUs with AI chips and software, providing cloud and enterprise customers with a complete AI system. By using AI chip technology, Intel can make chips in its own factories, increasing its manufacturing strength and allowing it to attract more foundry customers.\nIntel has launched new AI-powered chips that are faster and more energy-efficient, helping the company compete better in the growing AI market. It is gaining traction in AI infrastructure as Super Micro Computer has chosen Intel’s Xeon 6 processors for its high-performance enterprise servers.\nThe company has collaborated with Cisco to build a new integrated platform that supports distributed AI workloads. NVIDIA will invest $5 billion in Intel to build advanced technologies that will shape the future of AI infrastructure. Intel is actively investing in AI and is serious about competing in the fast-growing semiconductor market, signaling a credible comeback.\n\nHow Are Competitors Faring? Intel faces competition from Advanced Micro Devices ( AMD ) and Qualcomm Incorporated ( QCOM ). Qualcomm focuses on making advanced chips for AI-powered PCs. Qualcomm launched the AI 200 and AI 250 chips to meet rising AI processing needs in data centers. HUMAIN has chosen Qualcomm’s AI200 and AI250 chips to provide high-performance AI services in Saudi Arabia and worldwide.\n\nAMD is growing its AI business by launching new MI350 series accelerators and working with major partners like Amazon, Microsoft, Meta and Oracle to deliver faster and more powerful AI systems. AMD has entered into a long-term deal with OpenAI to power large AI systems using AMD’s Instinct GPUs starting in 2026. IBM and AMD are working with Zyphra to provide powerful AI infrastructure on IBM Cloud using AMD Instinct MI300X GPUs to train advanced AI models.\nINTC’s Price Performance, Valuation and Estimates Intel has rallied 79.3% over the past year compared with the industry ’s growth of 31.1%.\n\nImage Source: Zacks Investment Research\nGoing by the price/book ratio, the company's shares currently trade at 1.53 book value, lower than 30.63 of the industry average.\n\nStory Continues\n\nImage Source: Zacks Investment Research\nEarnings estimates for 2025 have increased 128.6% to 32 cents, while those for 2026 have declined 10.7% to 59 cents over the past 60 days.\n\nImage Source: Zacks Investment Research\nIntel stock currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "00:02:21",
      "Source": "Wealth Management",
      "Title": "13 Investment Must Reads for This Week (Dec. 16, 2025)",
      "URL": "https://finance.yahoo.com/m/5c8408c0-0d3e-3b61-8e87-d25e813afdd7/13-investment-must-reads-for.html",
      "Content": "13 Investment Must Reads for This Week (Dec. 16, 2025)\n\nDavid Bodamer\nTue, December 16, 2025 at 8:02 AM PST 4 min read\n\nIn this article: CSCO\n\nINTC\n\nMSFT\n\nYou can find original article here WealthManagement . Subscribe to our free daily WealthManagement newsletters .\nBeyond the Magnificent Seven: Unlocking Value in a Concentrated Stock Market “Periods of market concentration don’t always end in a selloff, but narrow leadership can precede weaker returns. The dot-com bubble is perhaps the clearest example. Between 1997 and 2000, the share of US market capitalization held by the 10 largest stocks surged to 24% from 15%, driven by soaring valuations in technology names like Microsoft, Cisco CSCO, Intel INTC, AOL, and Yahoo.” ( Morningstar )\nLong-Duration Bonds: Poised to Regain Their Role as a Core Diversifier “Yields on long-term Treasuries, investment-grade corporates, and long-duration taxable municipals have recently climbed to levels more in line with historical averages, moving past the artificially low environment that followed the global financial crisis. Despite this increase, several factors suggest that these yields could decline over the medium term.” ( Dividend.com )\nInside the Invitation-Only Stock Market for the Wealthy “The ultrawealthy are able to buy and sell shares of the buzziest private companies via invite-only transactions long before they list their shares on public stock exchanges. That’s created a two-tier market. One tier is a private club of sorts, where a privileged group can obtain shares of companies still in their early growth stages. Everyone else is left with older, slower-growing names.” ( WSJ )\nSEC’s Democratization of Alts is ‘Irresponsible’: Crenshaw “The Securities and Exchange Commission's efforts to create greater access to private market investment strategies in the retail channel is an ‘irresponsible departure from foundational pillars of the securities laws,’ SEC Commissioner Caroline Crenshaw said in a speech Thursday.” ( FundFire )\nHidden Fees, Hidden Dangers: Why a House-Passed Plan Threatens Investor Protection “This so-called small-business provision would permit mutual funds, closed-end funds, and other registered investment companies to omit from their fee tables the costs they incur when investing in business-development companies, or BDCs. This creates a dangerous precedent, allowing complex, fee-laden investment vehicles to be hidden from the comprehensive cost disclosure that has been a cornerstone of investor protection since the Investment Company Act of 1940 was signed into law.” ( Morningstar )\nAlts in DC Lineups Gain Traction Among Plan Advisers “One-quarter of defined contribution plan advisers are likely to recommend the inclusion of alternative investments in defined contribution plans following the Department of Labor’s August policy shift, and another 10% already do so, according to Escalent’s ‘2025 Retirement Plan Advisors Trends’ report.” ( Planadviser )\nWhose Inflation Is This? “The Inflation surge was visible to anyone looking at the impact of the single largest fiscal stimulus since World War 2. The point of all this is simply that we should be honest about what happened then, and transparent about the impact of the pandemic on higher prices today.” ( The Big Picture )\nPublic is going private and private is going public “This convergence has been underway for years, but perhaps there are few better signals of this trend than Larry Fink, the CEO and Chairman of the world’s largest asset manager, making it clear in his Annual Chairman’s Letter to Investors that BlackRock is no longer just a traditional asset manager.” ( Alt Goes Mainstream )\nGetting Stronger “Put another way, while fees were predictive then, they weren’t as decisive as they’ve become in recent years. That is, fees appear to be getting stronger as a predictor of differences in funds’ performance.” ( Basis Pointing )\nAres CEO Questions the Value of Retail Partnerships “Arougheti said he remains unconvinced that combining traditional and alternative products through partnerships delivers a better proposition for retail investors. The firm has, though, explored multiple potential collaborations, Bloomberg reports.” ( FundFire )\nPrivate Credit ETFs 101: Business Development Companies “These ‘companies’ are more akin to an investment fund or hedge fund than they are a traditional company. They don’t make anything, and they don’t provide any services to customers. Instead, they provide financing to middle market companies and generate their returns based on two broad segments, private equity stakes and private credit debt instruments.” ( ETF.com )\nHigh-Speed Traders Are Feuding Over a Way to Save 3.2 Billionths of a Second “The controversy is about an arcane technical maneuver in which high-speed traders bombard Frankfurt-based Eurex with useless data. The idea is to keep their connections to the exchange warm so they can react fractionally faster to market-moving information.” ( WSJ )\nBlackstone’s BCRED Reports Record Fundraising, Increased Share Repurchases “While fundraising has been strong, the demand for share repurchases has also increased. Fourth-quarter repurchases were estimated to be approximately 4.5% of shares outstanding as of Sept. 30. In the letter, BCRED confirmed it will honor all tenders for the latest quarterly repurchase period, which concluded on Dec. 2.” ( AltsWire )\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "23:07:57",
      "Source": "Simply Wall St.",
      "Title": "ACM Research (ACMR): Valuation Check After Ultra Lith Baker Delivery and Intel Process Tool Validation",
      "URL": "https://finance.yahoo.com/news/acm-research-acmr-valuation-check-150757412.html",
      "Content": "ACM Research (ACMR): Valuation Check After Ultra Lith Baker Delivery and Intel Process Tool Validation\n\nSimply Wall St\nTue, December 16, 2025 at 7:07 AM PST 3 min read\n\nIn this article: ACMR\n\nINTC\n\nACM Research (ACMR) just hit two important milestones, delivering its first Ultra Lith Baker system into high volume display manufacturing and seeing its chipmaking tools tested in Intel’s advanced process lines.\nSee our latest analysis for ACM Research.\nThose wins seem to be feeding into the story in the share price, with a roughly 20% 1 month share price return and a powerful 3 year total shareholder return of more than 300% suggesting momentum is still very much on ACMR’s side.\n\nIf this kind of momentum has your attention, it could be worth seeing what else is moving and exploring high growth tech and AI stocks as potential next candidates for your watchlist.\nWith the stock up more than 140% over the past year and now trading close to analyst targets, investors face a key question: Is ACMR still mispriced after its recent wins, or is the market already discounting its future growth?\nMost Popular Narrative: 7.6% Undervalued With ACM Research last closing at $37.73 against a narrative fair value of about $40.81, the story points to modest upside still on the table.\nRead the complete narrative.\nWant to see what kind of growth and profitability path could justify that higher value? The narrative leans on ambitious expansion, steady margins, and a disciplined earnings multiple. Curious how those moving parts add up to this target?\nResult: Fair Value of $40.81 (UNDERVALUED)\n\nHave a read of the narrative in full and understand what's behind the forecasts.\nHowever, several risks could derail that upside, including tighter U.S. export controls on China and slower than expected margin recovery from heavy R&D spending.\nFind out about the key risks to this ACM Research narrative.\nAnother Angle on Valuation Our DCF model paints a less generous picture, with a fair value estimate of about $30.14, below today’s $37.73 price, suggesting ACM Research may be overvalued on cash flow assumptions. Is the current optimism leaning too hard on growth and margin resilience?\nLook into how the SWS DCF model arrives at its fair value.\nSimply Wall St performs a discounted cash flow (DCF) on every stock in the world every day ( check out ACM Research for example ). We show the entire calculation in full. You can track the result in your watchlist or portfolio and be alerted when this changes, or use our stock screener to discover 906 undervalued stocks based on their cash flows . If you save a screener we even alert you when new companies match - so you never miss a potential opportunity.\n\nStory Continues\nBuild Your Own ACM Research Narrative If you see the story playing out differently, or simply want to dig into the numbers yourself, you can build a custom view in minutes: Do it your way\nA good starting point is our analysis highlighting 4 key rewards investors are optimistic about regarding ACM Research.\nLooking for more investment ideas? Do not let a single stock define your strategy when there are targeted ideas right at your fingertips. Use the Simply Wall Street Screener to uncover new opportunities.\nLock in potential income streams by targeting these 13 dividend stocks with yields > 3% that can help anchor your portfolio during volatile markets.\nRide the secular growth wave by focusing on these 26 AI penny stocks positioned at the heart of automation, data intelligence, and next generation software.\nPosition yourself early in emerging innovations by analysing these 28 quantum computing stocks that could reshape computing, cybersecurity, and complex problem solving.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include ACMR .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "18:43:05",
      "Source": "GuruFocus.com",
      "Title": "Intel Names Trump Economic Adviser to Lead Government Affairs",
      "URL": "https://finance.yahoo.com/news/intel-names-trump-economic-adviser-104305542.html",
      "Content": "Intel Names Trump Economic Adviser to Lead Government Affairs\n\nFaizan Farooque\nTue, December 16, 2025 at 2:43 AM PST 1 min read\n\nIn this article: INTC\n\nSANS.PVT\n\nCDNS\n\nOPAI.PVT\n\nCSCO\n\nThis article first appeared on GuruFocus .\nIntel ( INTC , Financials ) named Robin Colwell, a top economic advisor to President Donald Trump , as its director of government relations on Monday, deepening its links with Washington.After Bruce Andrews left after the November U.S. elections, Colwell, a deputy assistant to the president and deputy director of the National Economic Council, would fill the job. Under Obama, Andrews worked in the Commerce Department.\n\nWarning! GuruFocus has detected 9 Warning Signs with INTC.\nIs INTC fairly valued? Test your thesis with our free DCF calculator.\nMonths after the U.S. government bought a 10% interest in Intel, the nomination underscores its strategic relevance to domestic chip production and national security.Intel also promoted James Chew vice president of Intel Government Technologies, which manages its U.S. government business. Former Intel CEO Lip-Bu Tan employed Chew at Cadence Design Systems.Annie Shea Weckesser became Intel's CMO. She worked for Cisco Systems and Tan-backed startup SambaNova Systems.Following Sachin Katti's departure to OpenAI, Tan's chief of staff Pushkar Ranade became acting chief technology officer.\nInvestors will examine Intel's government strategy and long-term performance after leadership changes.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "08:35:00",
      "Source": "Motley Fool",
      "Title": "Intel Is Eyeing an AI Acquisition. Its Track Record Isn't Great.",
      "URL": "https://finance.yahoo.com/m/741c9dd1-8c7b-34e4-aeaa-923a2b8a0340/intel-is-eyeing-an-ai.html",
      "Content": "Intel Is Eyeing an AI Acquisition. Its Track Record Isn't Great.\n\nTimothy Green, The Motley Fool\nMon, December 15, 2025 at 4:35 PM PST 4 min read\n\nIn this article: SANS.PVT\n\nINTC\n\nKey Points Intel is reportedly in talks to acquire AI start-up SambaNova.\nSambaNova designs custom AI chips and rack-scale systems for efficient AI inference workloads.\nAn acquisition would accelerate Intel's AI strategy shift.\n10 stocks we like better than Intel ›\nChip giant Intel (NASDAQ: INTC) is reportedly in talks to potentially acquire SambaNova Systems, an AI start-up that was once valued at $5 billion. The rumored price tag is much lower at $1.6 billion, according to Bloomberg.\n\nSambaNova is focused on enabling fast and efficient AI inference . The company develops custom AI chips, which it refers to as Reconfigurable Dataflow Units, or RDUs. Those RDUs are used in the company's SambaRack, which combines hardware, networking, and software into a complete rack-scale solution. SambaNova also offers a cloud AI platform powered by its hardware.\nThe last AI acquisition didn't pan out SambaNova would not be Intel's first large AI-related acquisition. In 2019, well before ChatGPT sparked the AI boom, Intel paid approximately $2 billion for Habana Labs. Habana's core product was the Gaudi AI training processor, which was being sampled with large hyperscalers at the time of the acquisition.\n\nUnder Intel's ownership, Gaudi 2 and Gaudi 3 were eventually launched. While the chips provided solid performance and efficiency, Intel was unable to gain any meaningful traction. Nvidia and its GPUs ultimately won the battle for AI training supremacy. The Gaudi line of chips had an unfamiliar architecture and an immature software ecosystem , which contributed to their lackluster sales.\nAnother factor was a scatterbrained approach to AI chips. Intel was simultaneously developing Habana's Gaudi chips and data center GPUs aimed at AI workloads. Neither strategy worked. Intel eventually scrapped Falcon Shores, a data center GPU that incorporated some of Gaudi's technology, effectively ending its attempt to break into the AI training market.\n\nThe failure of the Habana Labs acquisition wasn't entirely Intel's fault. Nvidia's proprietary CUDA platform, which supports only the company's GPUs, has become the industry standard for accelerated computing over the course of nearly two decades. CUDA and the mature software ecosystem built around it gave Nvidia a critical advantage.\nThis time could be different If Intel ultimate acquires SambaNova, the deal could turn out differently for the chip giant. For starters, SambaNova is already a portfolio company for Intel Capital, the company's venture capital arm. Intel CEO Lip-Bu Tan is also SambaNova's Chairman.\n\nStory Continues\nWhile Habana Labs was focused on AI training chips, SambaNova sells complete AI inference solutions. There's likely no beating Nvidia in the AI training market at this point, but the AI inference market is far more competitive. Efficiency is just as important as raw performance, and that's where custom chips like SambaNova's can shine. And because SambaNova sells rack-scale AI inference solutions that can be easily slotted into AI datacenters rather than just chips, the company has found some success winning over customers.\n\nIn October, SambaNova announced that it had won three deals to use its systems to power sovereign AI inference clouds in Australia, Europe, and the United Kingdom . In November, the company was selected by French cloud computing company OVHcloud to power its AI Endpoints solution along with GPU-based systems.\nShifting focus to rack-scale AI solutions aligns with Intel's latest AI strategy. When the company cancelled Falcon Shores earlier this year, it noted that it would pursue a rack-scale AI strategy by developing fully integrated systems that could be installed in data centers. Acquiring SambaNova is one way to accelerate that process, although it's unclear what an acquisition would mean for Jaguar Shores, the successor to Falcon Shores.\n\nIntel does not have a great track record with acquisitions, particularly AI acquisitions. However, the acquisition of SambaNova would make a lot of sense given the company's focus on AI inference and rack-scale solutions, as well as its exit from the AI training market. There's no telling when or if a deal will be announced, but acquiring SambaNova would be a reasonable way for Intel to gain ground in the AI infrastructure market.\nShould you invest $1,000 in Intel right now? Before you buy stock in Intel, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Intel wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $513,353 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,072,908 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 965 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nTimothy Green has positions in Intel. The Motley Fool has positions in and recommends Intel and Nvidia. The Motley Fool has a disclosure policy .\nIntel Is Eyeing an AI Acquisition. Its Track Record Isn't Great. was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "06:30:54",
      "Source": "Motley Fool",
      "Title": "Stock Market Today, Dec. 15: Nvidia Gains on Reports of Strong H200 Demand From China",
      "URL": "https://finance.yahoo.com/m/7038ae5f-444d-3447-85c7-6545dc849c92/stock-market-today%2C-dec.-15%3A.html",
      "Content": "Stock Market Today, Dec. 15: Nvidia Gains on Reports of Strong H200 Demand From China\n\nJeff Santoro, The Motley Fool\nMon, December 15, 2025 at 2:30 PM PST 2 min read\n\nIn this article: NVDA\n\n^GSPC\n\nINTC\n\n^IXIC\n\nAMD\n\nNvidia (NASDAQ:NVDA) , a leading GPUs and AI solutions developer, closed Monday’s session at $176.29, up 0.73%. Trading volume reached 163 million shares, nearly 15% below its three-month average of 191 million shares.\nHow the markets moved today Monday’s move followed premarket reports of stronger H200 demand from China and fresh coverage of Nvidia’s Nemotron 3 open-source AI models. Investors are watching how AI infrastructure spending holds up against valuation and policy risks. The S&P 500 (SNPINDEX:^GSPC) slipped 0.16% to 6,816, while the Nasdaq Composite (NASDAQINDEX:^IXIC) fell 0.59% to 23,057. Within Semiconductors, industry peers Advanced Micro Devices (NASDAQ:AMD) and Intel (NASDAQ:INTC) lost 1.52% and 0.79%, respectively, as traders weighed AI server demand against rising competitive pressures.\n\nWhat this means for investors Today, the market received welcome news that demand for H200 chips to be sold to China might be robust enough to increase output for this chip, now that U.S. export approvals have been secured. Monday also saw news that Nvidia plans to acquire the AI software firm SchedMD, which supplies software that can help AI data centers operate more efficiently. Investors are hoping these new items might help reinforce Nvidia's AI leadership and could start to reverse the 17% pullback the stock has seen recently.\n\nEarlier this year, Nvidia's Q3 2026 results featured overall revenue growth of 62% with data center revenue growing even faster at 66%, year over year.\nDon’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $453,954 !*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $52,940 !*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $513,353 !*\nRight now, we’re issuing “Double Down” alerts for three incredible companies , available when you join Stock Advisor , and there may not be another chance like this anytime soon.\nSee the 3 stocks »\n*Stock Advisor returns as of December 15, 2025\nJeff Santoro has positions in Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Intel, and Nvidia. The Motley Fool has a disclosure policy .\nStock Market Today, Dec. 15: Nvidia Gains on Reports of Strong H200 Demand From China was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "06:24:49",
      "Source": "Reuters",
      "Title": "Intel appoints Trump economic adviser as head of government affairs",
      "URL": "https://finance.yahoo.com/news/intel-appoints-trump-economic-adviser-222449313.html",
      "Content": "Intel appoints Trump economic adviser as head of government affairs\n\nStephen Nellis\nUpdated Mon, December 15, 2025 at 2:55 PM PST 1 min read\n\nIn this article: INTC\n\nCDNS\n\nSANS.PVT\n\nCSCO\n\nBy Stephen Nellis\nSAN FRANCISCO, Dec 15 (Reuters) - Intel ( INTC ) on Monday appointed an economic adviser to ​U.S. President Trump as its head of government ‌affairs, months after the U.S. government took a 10% stake ‌in the U.S. chipmaker.\nIntel said that Robin Colwell, deputy assistant to the president and deputy director of the National Economic Council, has been appointed to head its ⁠government affairs office. ‌The position had been vacant after Bruce Andrews, who had worked in the ‍Commerce Department under then-President Barack Obama, left Intel after November's U.S. elections.\n\nIntel also on Monday appointed James Chew as vice president of Intel Government ​Technologies, the unit that oversees its business with ‌the U.S. government after the departure of Intel veteran Christopher George earlier this year. Chew worked at Cadence Design Systems, where Intel CEO Lip-Bu Tan was previously chief executive.\n\nIntel also appointed Annie Shea Weckesser, a ⁠Cisco Systems veteran who most ​recently worked at SambaNova Systems, ​a chip startup where Tan is an investor through his extensive venture capital holdings, as ‍chief marketing ⁠and communications officer.\nPushkar Ranade, Tan's chief of staff, was appointed interim chief technology officer. Intel's former ⁠technology chief Sachin Katti left the company to join ChatGPT creator ‌ OpenAI last month.\n(Reporting by Stephen Nellis in San ‌FranciscoEditing by Nick Zieminski)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "00:58:47",
      "Source": "GuruFocus.com",
      "Title": "Intel Corp (INTC) Q1 2025 Earnings Call Highlights: Surpassing Expectations Amidst Challenges",
      "URL": "https://finance.yahoo.com/news/intel-corp-intc-q1-2025-165847385.html",
      "Content": "Intel Corp (INTC) Q1 2025 Earnings Call Highlights: Surpassing Expectations Amidst Challenges\n\nGuruFocus News\nMon, December 15, 2025 at 8:58 AM PST 4 min read\n\nIn this article: INTC\n\nThis article first appeared on GuruFocus .\nRevenue: $12.7 billion, at the high end of guidance range.\nNon-GAAP Gross Margin: 39.2%, approximately 3 percentage points above guidance.\nEarnings Per Share (EPS): $0.13, versus guidance of breakeven EPS.\nOperating Cash Flow: $800 million.\nGross Capital Expenditure (CapEx): $6.2 billion, with offsets of $1.7 billion.\nAdjusted Free Cash Flow: Negative $3.7 billion.\nCash Balance: $21 billion.\nIntel Products Revenue: $11.8 billion, down 10% sequentially.\nIntel Foundry Revenue: $4.7 billion, up 8% sequentially.\nOperating Profit for Intel Products: $2.9 billion, 25% of revenue.\nIntel Foundry Operating Loss: $2.3 billion, roughly flat quarter over quarter.\nAll Other Revenue: $943 million, down 15% sequentially.\nOpEx Target for 2025: $17 billion.\nOpEx Target for 2026: $16 billion.\nGross CapEx Target for 2025: $18 billion.\nQ2 Revenue Guidance: $11.2 billion to $12.4 billion.\nQ2 Gross Margin Guidance: Approximately 36.5%.\nQ2 EPS Guidance: Breakeven.\n\nWarning! GuruFocus has detected 9 Warning Signs with INTC.\nIs INTC fairly valued? Test your thesis with our free DCF calculator.\nRelease Date: April 24, 2025\nFor the complete transcript of the earnings call, please refer to the full earnings call transcript .\nPositive Points Intel Corp ( NASDAQ:INTC ) delivered revenue, gross margins, and EPS above their guidance for Q1 2025.\nThe company is taking swift actions to simplify operations, reduce bureaucracy, and empower smaller teams for faster decision-making.\nIntel Corp ( NASDAQ:INTC ) is focusing on revitalizing its engineering talent pool by promoting strong leaders internally and recruiting new talent.\nThe company is committed to reducing operational expenses, targeting $17 billion in 2025 and $16 billion in 2026.\nIntel Corp ( NASDAQ:INTC ) is making strategic adjustments to its product roadmap to optimize for emerging AI workloads and ensure on-time delivery.\n\nNegative Points Intel Corp ( NASDAQ:INTC ) faces ongoing macroeconomic uncertainty, including shifting trade policies and persistent inflation.\nThe company acknowledges that organizational complexity and bureaucracies have been hindering innovation and agility.\nIntel Corp ( NASDAQ:INTC ) anticipates a potential economic slowdown, with the probability of a recession growing.\nThe company is experiencing capacity constraints in Intel 7, which are expected to persist for the foreseeable future.\nIntel Corp ( NASDAQ:INTC ) is facing competitive pressure in its core markets, impacting product mix and margins.\n\nQ & A Highlights Q : How is Intel balancing the internal product roadmap with the foundry side of things, especially with the need to fill Intel's own foundry? A : Lip-Bu Tan, CEO, explained that Intel is focusing on flattening the organization to improve product delivery and customer solutions. The priority is to focus on key products and ensure they meet customer requirements. For the foundry, Intel is concentrating on improving yield and reliability, particularly with the 18A process for Panther Lake.\n\nStory Continues\nQ : Can you discuss the puts and takes on gross margin for 2025 and 2026, considering strategic changes and cost-cutting measures? A : David Zinsner, CFO, noted that the industry is dynamic due to tariffs and macroeconomic factors. Intel expects a mix shift towards Lunar Lake, which has margin pressures. The ramp-up of 18A will also impact margins. However, Panther Lake, expected to ramp in 2026, should improve margins due to better product economics and internal wafer production benefits.\n\nQ : What is Intel's approach to announcing new third-party foundry customers, and is there potential to add a Tier 1 customer soon? A : Lip-Bu Tan, CEO, emphasized that the priority is ramping internal customers like Panther Lake and building trust with foundry customers. Intel is focusing on process technology improvements and customer service to optimize solutions for different design methodologies.\nQ : How is Intel addressing the demand for older generation products like Raptor Lake versus newer ones like Meteor Lake and Lunar Lake? A : Michelle Holthaus, CEO of Intel Products, explained that the demand for older products is driven by macroeconomic factors and consumer price sensitivity. Raptor Lake offers a better price point for OEMs, while newer products have higher costs. Intel is balancing this demand with investments in AI PC and future products like Panther Lake.\nQ : What is Intel's strategy for AI, particularly in terms of workload optimization and architecture? A : Lip-Bu Tan, CEO, stated that Intel is focusing on understanding AI workloads and partnering with industry leaders to optimize silicon and software. The strategy includes exploring new architectures for edge and inference applications, aiming for low power and high efficiency.\nFor the complete transcript of the earnings call, please refer to the full earnings call transcript .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 59
}