{
  "stock_id": "META",
  "last_updated": "2025-12-18T19:11:58.140Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-19",
      "Time": "02:36:39",
      "Source": "MT Newswires",
      "Title": "Sector Update: Tech Stocks Gain Thursday Afternoon",
      "URL": "https://finance.yahoo.com/news/sector-tech-stocks-gain-thursday-183639691.html",
      "Content": "PREMIUM\nSector Update: Tech Stocks Gain Thursday Afternoon\n\nMT Newswires\nThu, December 18, 2025 at 10:36 AM PST 1 min read\n\nIn this article: MU\n\nMSFT\n\nNVDA\n\nXLK\n\nOPAI.PVT\n\nTech stocks were higher Thursday afternoon, with the State Street Technology Select Sector SPDR ETF\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "02:13:11",
      "Source": "24/7 Wall St.",
      "Title": "3 Stocks to Watch In 2026 As AI Spending Becomes a Hot Topic",
      "URL": "https://finance.yahoo.com/m/4e077653-0309-3b94-b56b-93698638e21a/3-stocks-to-watch-in-2026-as.html",
      "Content": "3 Stocks to Watch In 2026 As AI Spending Becomes a Hot Topic\n\nChris MacDonald\nThu, December 18, 2025 at 10:13 AM PST 5 min read\n\nIn this article: NVDA\n\nMETA\n\nPLTR\n\nThe artificial intelligence trade is one that's become integral to the U.S. economy, and in some ways, to the global economy. That's because the sheer size of these AI behemoths means that more and more capital is becoming concentrated around one trend, which if unwound, could send ripple effects across global markets. Most investors are certainly not banking on such a wind down, but it's also true that leverage and valuations have increased to levels we haven't seen in decades.\n\nQuick Read Meta’s stock rose on reports it will reduce spending and possibly cut jobs in its Reality Labs metaverse division.\nPalantir trades at over 120x forward sales and 180x forward earnings.\nNvidia holds a $4.2T market cap as the dominant AI chip supplier but faces growing competition from custom chips.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "01:56:59",
      "Source": "Investor's Business Daily",
      "Title": "Google, Oracle, Amazon, Meta In Hot AI Race. But A Data Center Backlash Is Surging.",
      "URL": "https://finance.yahoo.com/m/21efdd73-59b7-33fc-8e84-fd1b3ad8eb99/google%2C-oracle%2C-amazon%2C-meta.html",
      "Content": "Google, Oracle, Amazon, Meta In Hot AI Race. But A Data Center Backlash Is Surging.\n\nALEXIS GARCIA and KIT NORTON\nThu, December 18, 2025 at 9:56 AM PST 16 min read\n\nIn this article: GOOG\n\nORCL\n\nAMZN\n\nMETA\n\nMSFT\n\nThe data centers critical to the nation's AI ambitions are spawning local political battles as rising energy costs frustrate communities. What investors need to know about data center NIMBYism.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "01:51:10",
      "Source": "GuruFocus.com",
      "Title": "Meta's Yann LeCun Seeks $3.5 Billion Valuation for New AI Startup",
      "URL": "https://finance.yahoo.com/news/metas-yann-lecun-seeks-3-175110625.html",
      "Content": "Meta's Yann LeCun Seeks $3.5 Billion Valuation for New AI Startup\n\nFaizan Farooque\nThu, December 18, 2025 at 9:51 AM PST 1 min read\n\nIn this article: META\n\nThis article first appeared on GuruFocus .\nYann LeCun, Meta's ( META , Financials ) chief artificial intelligence scientist, is in early discussions to raise 500 million ($586 million) for a new AI startup expected to debut with a 3 billion valuation, according to the Financial Times.\nWarning! GuruFocus has detected 2 Warning Sign with META.\nIs META fairly valued? Test your thesis with our free DCF calculator.\n\nThe venture will be led operationally by Alexandre LeBrun, founder of French health technology firm Nabla, with LeCun focusing on research and development. The company aims to develop AI systems based on world models, which simulate the physical environment to enable more capable and context-aware machines.\nLeCun, who plans to leave Meta at year-end, said last month his new company will focus on building next-generation superintelligent AI systems. The initiative comes amid record capital inflows to AI startups, drawing renewed concern about inflated valuations and limited commercial returns.\nWidely known as one of the pioneers of deep learning, LeCun shared the 2018 Turing Award with Geoffrey Hinton and Yoshua Bengio for breakthroughs that laid the foundation for modern AI. His new venture underscores growing competition among former Big Tech leaders to establish independent research-driven AI firms.\nInvestors and industry observers will be watching whether the company's early fundraising success translates into sustainable technological advances as enthusiasm for AI remains high entering 2026.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "01:49:20",
      "Source": "24/7 Wall St.",
      "Title": "Trump Media Goes Nuclear: Surges 37% on Bold $6 Billion Fusion Merger",
      "URL": "https://finance.yahoo.com/m/be1535cc-3be6-31f4-a489-94645f8fdf6d/trump-media-goes-nuclear%3A.html",
      "Content": "Trump Media Goes Nuclear: Surges 37% on Bold $6 Billion Fusion Merger\n\nRich Duprey\nThu, December 18, 2025 at 9:49 AM PST 4 min read\n\nIn this article: TATE.PVT\n\nDJT\n\nMETA\n\nQuick Read Trump Media & Technology ( DJT ) announced an all-stock merger with nuclear fusion company TAE Technologies in a deal valuing the combined entity at over $6B. Trump Media shares surged 37% following the announcement.\nTrump Media operates Truth Social with an estimated user base in the low millions compared to Meta Platforms ‘ billions and X’s hundreds of millions.\nTAE Technologies plans to begin construction on its first commercial fusion plant in 2026 despite no operating fusion plants globally producing net energy for the grid.\nIf you’re thinking about retiring or know someone who is, there are three quick questions causing many Americans to realize they can retire earlier than expected. take 5 minutes to learn more here\n\nTrump Media & Technology Group ( NASDAQ:DJT ) -- owner of President Trump's Truth Social platform -- announced a shocking, all-stock merger agreement this morning with privately held nuclear fusion company TAE Technologies in a deal valuing the combined businesses at more than $6 billion. With shareholders of each company expected to own approximately 50% of the merged entity, the transaction is expected to close in mid-2026, subject to approvals.\nFollowing the announcement, Trump Media shares are surging 37% in early trading today as the merger aims to create one of the world's first publicly traded fusion companies. It would position the combined firm to build utility-scale fusion power plants, with the first one beginning construction next year. Trump Media CEO Devin Nunes and TAE CEO Michl Binderbauer will serve as co-CEOs.\n\nTruth Social's Limited Reach Truth Social was launched in 2022 as an alternative platform emphasizing free expression, but has struggled to achieve broad market traction because of its association with President Trump -- Barron's reports he indirectly owns about 115 million shares of the company. Instead, the app primarily attracts users aligned with his political base, limiting its appeal beyond that demographic.\n\nReports indicate Truth Social has far fewer active users compared to established platforms such as Meta Platforms ' ( NASDAQ:META ) Facebook, Instagram, and WhatsApp -- which collectively boast billions of monthly active users worldwide -- and X, which also commands hundreds of millions of users. Truth Social's user base remains significantly smaller, with estimates placing it in the low millions, reflecting challenges in expanding beyond its core audience.\nFusion: Energy's Chimera TAE Technologies was founded in 1998 and has pursued nuclear fusion -- a process mimicking the sun's energy production -- for over 25 years. Fusion is often called the energy industry's holy grail due to its potential for abundant, clean power without long-term radioactive waste, unlike traditional nuclear fission.\n\nStory Continues\nTAE has built and operated five experimental reactors, raising more than $1.3 billion from investors, including Google and Chevron ( NYSE:CVX ). The company now plans to advance to utility-scale operations, aiming to commence construction on its first commercial plant in 2026. This step represents a significant escalation from research prototypes to power generation capable of supplying electricity to the grid.\n\nDespite progress, achieving commercial fusion remains elusive globally, with no operating plants producing net energy for the grid. TAE's ambition to deploy utility-scale facilities faces substantial technical and financial challenges. Although the company has demonstrated advancements in reactor design, transitioning to reliable, cost-effective power production is fraught with hurdles.\nKey Takeaways TAE's timeline for a utility-scale plant beginning next year appears highly ambitious, requiring not only technical breakthroughs but also extensive regulatory approvals from bodies like the Nuclear Regulatory Commission and Department of Energy.\nTrump Media is seeking to leverage growing energy demands from artificial intelligence data centers, where fusion could theoretically provide vast power. However, combining a social media operation with cutting-edge fusion research represents a sharp divergence from core businesses for both entities. It reeks of opportunistic grandstanding by attempting to capitalize on the hot topic of AI's energy demands, much like its previous venture into the crypto world.\n\nGiven fusion's history of overpromising and delay -- and the merger's execution risks -- the deal carries a high probability of complications, setbacks, and failure. Investors should avoid buying into the hype. If TAE and Trump Media can actually succeed in the effort, there will be plenty of opportunity to buy in afterward.\nThe New Report Shaking Up Retirement Plans You may think retirement is about picking the best stocks or ETFs, but you’d be wrong. Even great investments can be a liability in retirement. It’s a simple difference between accumulating vs distributing, and it makes all the difference.\nThe good news? After answering three quick questions many Americans are reworking their portfolios and finding they can retire earlier than expected. If you’re thinking about retiring or know someone who is, take 5 minutes to learn more here .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "01:48:32",
      "Source": "Investor's Business Daily",
      "Title": "Meta Stock Tests Key Level. Analyst Sees Chance For Facebook Parent To Shake AI Worries.",
      "URL": "https://finance.yahoo.com/m/fc85c109-f059-3247-9905-3be33edd4950/meta-stock-tests-key-level..html",
      "Content": "Meta Stock Tests Key Level. Analyst Sees Chance For Facebook Parent To Shake AI Worries.\n\nRYAN DEFFENBAUGH\nThu, December 18, 2025 at 9:48 AM PST 2 min read\n\nIn this article: META\n\n^GSPC\n\nBofA Securities offered a positive view for shares of the Facebook parent company in a 2026 preview note. While Meta is ahead more than 2% at 664.91 on the stock market today, the company's 14% year-to-date gain is underperforming the S&P 500. \"We believe current valuation reflects subdued AI sentiment, which has potential to improve as Meta launches next LLM and new AI products,\" Post wrote to clients.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "01:40:03",
      "Source": "decrypt",
      "Title": "What is Ethereum (ETH)? A Beginner's Guide to the Smart Contract Blockchain",
      "URL": "https://finance.yahoo.com/m/73b1bf83-705b-3ccc-bb88-7224d05ea345/what-is-ethereum-%28eth%29%3F-a.html",
      "Content": "What is Ethereum (ETH)? A Beginner's Guide to the Smart Contract Blockchain\n\nMatt Hussey,Jason Nelson\nThu, December 18, 2025 at 9:40 AM PST 9 min read\n\nIn this article: ETH-USD\n\nBTC-USD\n\nAMZN\n\nGOOGL\n\nMETA\n\nEthereum, the second-biggest cryptocurrency after Bitcoin, is a blockchain-powered platform for creating decentralized applications (dapps).\nEthereum is not just a cryptocurrency. It’s a global, decentralized network that enables smart contracts —self-executing programs on the blockchain—and decentralized applications, or dapps , that run without banks, governments, or big tech.\n\nWhen programmer Vitalik Buterin published a “whitepaper” in late 2013 proposing a new kind of blockchain —not just for money but for programmable code—a revolution in digital finance began. Today, the Ethereum blockchain hosts decentralized applications like smart contracts, games , digital art , and assets worth billions.\nUltimately, many believe that Ethereum could underpin a re-imagining of how the internet works, dubbed Web3, in which control of the internet is disintermediated away from big companies such as Amazon, Google, Facebook, and X.\nThis guide will help you understand the history of Ethereum, Buterin’s big idea, and the role Ether plays in that vision.\nSmart contracts: Ethereum’s breakthrough The feature that set Ethereum apart from Bitcoin early on was the smart contract. A smart contract is a code stored and executed on the blockchain that runs automatically once its conditions are met.\nSmart contracts are transparent, tamper-proof, and execute without relying on third parties. This makes them the backbone of everything built on Ethereum, from DeFi protocols to NFT marketplaces.\n\nWho Invented Ethereum? Russian/Canadian computer programmer Vitalik Buterin wrote the whitepaper that Ethereum is based on. However, the building of the network and community was helped along by a number of co-founders: Anthony Di Loria, Charles Hoskinson, Miha Alisie, Amir Chetrit, Joseph Lubin and Gavin Wood.\n\nDevelopment of the Ethereum network began in early 2014 under the Ethereum Foundation, with Gavin Wood publishing the technical “yellow paper” that defined the Ethereum Virtual Machine.\nA crowdfunded token sale followed in mid-2014, raising funds through an initial coin offering, or ICO, that exchanged Bitcoin for Ether. The ICO raised over $18 million.\n\nThe network officially went live on July 30, 2015, launching as “Frontier”—a platform for developers to test and deploy decentralized applications.\nThe switch from Proof-of-Work to Proof-of-Stake When it first launched, Ethereum used the same Proof-of-Work consensus mechanism as Bitcoin, with cryptocurrency miners securing the network by solving complex cryptographic puzzles.\nIn September 2022, Ethereum switchted to a Proof-of-Stake (PoS) consensus algorithm. Instead of mining, Ether is created through staking: validators lock up at least 32 ETH as collateral and are chosen to propose and verify new blocks. Honest participation earns them ETH rewards.\n\nStory Continues\nWhat is Proof of Stake? How it Differs From Proof of Work\nThis shift, known as “ The Merge ,” ended Proof-of-Work mining, making Ethereum more energy-efficient while allowing anyone with the required stake to help secure the network and earn rewards.\nBlocks are still added about every 12 seconds, but ETH is now distributed as staking rewards, not mining rewards.\n\nEther (ETH), Ethereum’s native cryptocurrency, pays for transactions, powers apps, and secures the network. Ether’s sub-units, Gwei and Wei, are named after Wei Dai, an early pioneer of cryptocurrencies.\nWhat applications have been built on Ethereum? 👥 Social Networks: Get paid for your posts on social media dapps.\n📁 File Storage: Decentralized file storage at a fraction of the price.\n💸 Overseas Payments: Dramatically reducing the cost of sending cash overseas.\n💳 Payment Cards: Contactless debit card to pay in Ethereum and other cryptocurrencies.\n👀 Online advertising: Cutting out the middlemen in online ads. Users get paid directly for watching online advertisements.\n💱 Exchanges: Decentralized exchanges ( DEXs ) such as Uniswap enable users to trade cryptocurrencies peer-to-peer, without middlemen.\n🏦 Loans: Blockchain-backed loans with no credit checks.\n\nTimeline: Major milestones in Ethereum Late 2013: Vitalik Buterin publishes the Ethereum white paper, introducing the idea of a programmable blockchain.\nMid-2014: Ethereum crowdsale (ICO) sells Ether for Bitcoin to fund development.\nJuly 30, 2015: Ethereum launches with the “Frontier” genesis block.\nSeptember 2015: “Frontier Thawing” update increases gas limits for more stability.\nMarch 2016: Homestead upgrade improves protocol security and usability.\nApril 2016: The DAO, a decentralized venture fund, launches via crowdsale.\nJune 2016: Hackers exploit The DAO and drain roughly $50 million in Ether. Community votes to hard-fork, creating Ethereum (ETH) and Ethereum Classic (ETC).\nOctober 2017: Byzantium hard fork enhances performance, privacy, and sets the stage for Proof-of-Stake.\nDecember 2017: CryptoKitties and CryptoPunk NFTs go viral, stressing network capacity and highlighting scalability issues.\nJanuary 2018: ERC-721 NFT standard is introduced, enabling unique digital assets.\nDecember 2020: Beacon Chain launches, beginning Ethereum’s transition to Proof-of-Stake.\nMarch 2020: Visa begins settling USD Coin (USDC) stablecoin transactions using Ethereum.\nApril 2021: Berlin hard fork reduces gas costs.\nAugust 2021: London hard fork activates EIP-1559 ; introduces fee burning, reducing inflation.\nSeptember 15, 2022: “The Merge” transitions Ethereum from Proof-of-Work to Proof-of-Stake, cutting energy use by more than 99 percent.\nApril 12, 2023: The Shanghai upgrade enables withdrawal of staked Ether from the Beacon Chain.\nMarch 13, 2024: The Dencun upgrade introduces proto-danksharding, a step toward reducing costs and increasing scalability.\nMay 7, 2025: The Pectra upgrade, combining Prague and Electra updates, aims to expand staking flexibility and improve Ethereum’s efficiency.\nDecember 3, 2025: The Fusaka upgrade introduces changes to Ethereum's data availability and block capacity.\n\nEthereum and DAOs One of Ethereum’s most radical innovations was the decentralized autonomous organization, or DAO. A DAO is a blockchain-based organization governed by smart contracts and community votes . Members typically hold tokens that grant them voting power on how the DAO operates and spends its funds.\nThe first major experiment was The DAO in 2016, which sought to operate as a decentralized venture capital fund. Investors pooled Ether, then voted collectively on how to allocate it. The project ended in disaster due to an infamous hack , but it demonstrated the potential of blockchains as platforms for decentralized governance.\n\nWhat Is a Decentralized Autonomous Organization (DAO)?\nSince then, DAOs have grown into a vibrant sector. They range from DAO frameworks like Moloch and Aragon , to investment collectives like Syndicate , and governance DAOs such as MakerDAO , which manages a stablecoin pegged to the U.S. dollar, to social DAOs that organize communities online.\nSupporters argue that DAOs could redefine corporate governance by replacing traditional hierarchies with code and community control. Critics warn that legal frameworks remain murky, and smart contract vulnerabilities pose risks. Still, DAOs remain one of the clearest examples of Ethereum enabling something that could not exist without it.\nA network tested by crisis If Bitcoin is the gold of the cryptocurrency world, Ethereum is the oil that machines are powered on—but it has not been all smooth sailing.\nEthereum’s first major crisis arrived in 2016 with the DAO hack, when attackers exploited a vulnerability to steal $50 million worth of Ether.\nThe community was split: some argued the blockchain’s ledger should remain immutable, while others pushed to undo the damage. The decision to hard fork created two parallel blockchains—Ethereum (ETH) and Ethereum Classic (ETC).\n\nEthereum and the NFT boom Ethereum also fueled the explosion of non-fungible tokens , or NFTs, unique digital assets that prove ownership of items like art, music, or collectibles.\nThe breakthrough came in 2017 with the ERC-721 token standard, which let developers create unique tokens on the Ethereum blockchain. NFTs began to clog the Ethereum network as users spent millions trading CryptoKitties , CryptoPunks , and more, showing both the appeal and the limits of the technology.\n\nBeginner's Guide to NFTs: What Are Non-Fungible Tokens?\nBy 2021, NFTs had gone mainstream. Digital artist Beeple sold an NFT artwork for $69 million , and the Bored Ape Yacht Club launched. One of the most prominent NFT collections, the Bored Ape Yacht Club, is a collection of 10,000 primate-themed NFTs that became a cultural phenomenon, drawing celebrities and selling for hundreds of thousands of dollars each. At its height, in May 2022, all 10,000 BAYC NFTs collectively were valued over $1 billion.\nEthereum’s smart contracts made this possible by encoding ownership and authenticity directly into the blockchain. The NFT boom exposed Ethereum’s energy inefficiency, accelerating its shift away from the more energy-intensive Proof-of-Work algorithm.\n\nThe race to scale Ethereum’s biggest weakness? Scalability. At about 15 transactions per second, it cannot match Visa’s tens of thousands. That bottleneck has often caused sky-high “gas fees,” or transaction costs.\nTo address this, developers began a years-long upgrade known as Ethereum 2.0 . The launch of the Beacon Chain in 2020, the Berlin and London upgrades in 2021, and the Merge in 2022 marked steps toward a more efficient, Proof-of-Stake network. Later upgrades, including Shanghai in 2023 and Dencun in 2024, tackled staking flexibility and lower transaction costs.\n\nVitalik Wants To Speed Up Ethereum By 100x, Make it as 'Simple as Bitcoin'\nEthereum and the Web3 vision Supporters see Ethereum as the foundation for “Web3”—an internet where users, not corporations, control data, money, and digital identities. Ethereum powers decentralized finance DeFi, non-fungible tokens, and decentralized autonomous organizations, each of which experiments with alternatives to traditional financial and governance systems.\n\nBut competition looms. Rival networks such as Solana , Cardano , and Polkadot have positioned themselves as faster, cheaper alternatives. Meanwhile, Ethereum scaling solutions like Polygon and Arbitrum aim to process transactions off-chain before anchoring them to Ethereum’s main blockchain, reducing lag time and cost.\nEthereum and privacy In 2025, privacy has become a key focus of the Ethereum project. In November, Vitalik Buterin stated that \"Privacy is not a feature. Privacy is hygiene,\" building on a narrative in which he framed it as a fundamental requirement for digital systems such as blockchain platforms.\nEthereum Foundation Launches New Cluster Focused on Privacy\n\nThe Ethereum Foundation has followed suit, launching a privacy cluster in October 2025 that includes 47 researchers, coordinators and cryptographers. The Foundation also launched Kohaku, a \"privacy-first\" toolkit for Ethereum, alongside a browser wallet and SDK. Upon its launch, Buterin commented that \"Full-stack privacy and security are first-class priorities in Ethereum.\"\nA decade in, Ethereum is still defining itself As Ethereum enters its second decade, it continues to test the boundaries of what a blockchain can do. Whether it will deliver on its vision of a decentralized internet—or cede ground to faster competitors—remains an open question.\nWhat’s certain is that Ethereum has already changed how we think about the internet, money, community, and governance.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "01:31:12",
      "Source": "Benzinga",
      "Title": "JPMorgan Warns: AI Hype Has Peaked — 2026 Is About Profits",
      "URL": "https://finance.yahoo.com/news/jpmorgan-warns-ai-hype-peaked-173112523.html",
      "Content": "JPMorgan Warns: AI Hype Has Peaked — 2026 Is About Profits\n\nSurbhi Jain\nThu, December 18, 2025 at 9:31 AM PST 2 min read\n\nIn this article: JPM\n\nGOOG\n\nMETA\n\nAMZN\n\nGenerative AI dominated narratives in 2025, but the financial payoff hasn't kept pace with the hype. JPMorgan's 2026 outlook, backed by new CEO survey data, suggests markets are now recalibrating expectations — shifting focus from AI adoption to whether it actually delivers profits.\nGenAI Fell Short Of CEO Expectations PwC's latest global CEO survey, covering more than 4,700 executives across 109 countries, shows a clear expectation gap. While over 40% of CEOs entered 2025 expecting GenAI to boost revenue and nearly half anticipated a lift in profitability, only about one-third reported meaningful gains in either metric by year-end. Efficiency improvements were more visible, but even those undershot initial expectations.\n\nDon't Miss:\nThe AI Marketing Platform Backed by Insiders from Google, Meta, and Amazon — Invest at $0.85/Share\nAn EA Co-Founder Shapes This VC Backed Marketplace— Now You Can Invest in Gaming's Next Big Platform\nJPMorgan's interpretation isn't that AI spending was misplaced — it's that monetization arrived slower than anticipated. Adoption moved quickly, but translating that into top-line and margin expansion proved harder than forecasts implied.\nFrom Experimentation To ROI Discipline That gap is now changing behavior. JPMorgan notes that boards and CFOs are pressing harder on return on investment, favoring projects with clearer financial outcomes over open-ended experimentation. Growth alone is no longer enough; it needs to come with margin discipline.\nAs a result, valuation frameworks are tightening. Metrics like the Rule of 40 — and JPMorgan's stricter Rule of X — are reasserting themselves as filters rather than afterthoughts.\n\nTrending: Earn While You Scroll: The Deloitte-Ranked #1 Software Company Growing 32,481% Is Opening Its $0.50/Share Round to Accredited Investors.\nWhy 2026 Will Look Different The implication for 2026 is straightforward. AI narratives still matter, but they no longer earn automatic premiums. Investors are rotating toward companies that can pair innovation with durable earnings power.\nIn the next phase of the cycle, belief won't be enough. The numbers will decide.\nRead Next:\n\nMissed Tesla? EnergyX Is Tackling the Next $200 Billion Opportunity — Lithium\n$100k+ in investable assets? Match with a fiduciary advisor for free to learn how you can maximize your retirement and save on taxes – no cost, no obligation.\nPhoto: Shutterstock\nUNLOCKED: 5 NEW TRADES EVERY WEEK. Click now to get top trade ideas daily , plus unlimited access to cutting-edge tools and strategies to gain an edge in the markets.\n\nStory Continues\nGet the latest stock analysis from Benzinga:\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article JPMorgan Warns: AI Hype Has Peaked — 2026 Is About Profits originally appeared on Benzinga.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "00:17:17",
      "Source": "GuruFocus.com",
      "Title": "Amazon Stock Climbs on Strong 2026 Outlook From Truist Securities",
      "URL": "https://finance.yahoo.com/news/amazon-stock-climbs-strong-2026-161717723.html",
      "Content": "Amazon Stock Climbs on Strong 2026 Outlook From Truist Securities\n\nNauman Khan\nThu, December 18, 2025 at 8:17 AM PST 1 min read\n\nIn this article: AMZN\n\nWMT\n\nTFC\n\nGOOG\n\nMETA\n\nThis article first appeared on GuruFocus .\nShares of Amazon ( NASDAQ:AMZN ) edged up more than 3% on Thursday, as Truist Securities projected robust growth for internet and digital media stocks in 2026, led by the e-commerce giant.\nAnalyst Youssef Squali cited durable secular growth drivers, AI-enhanced product offerings, and a supportive macroeconomic backdrop as key factors for Amazon's upside. Truist forecasts Amazon to grow 10.5% year-over-year in 2026, slightly below its 12.1% growth in 2025.\n\nWarning! GuruFocus has detected 4 Warning Sign with PYPL.\nIs WMT fairly valued? Test your thesis with our free DCF calculator.\nThe analyst firm highlighted mid-to-high single-digit growth for U.S. e-commerce next year, around 7%, supported by faster delivery capabilities and personalized offerings powered by generative AI.\nAmazon is part of Truist's top mega-cap picks alongside Meta Platforms (META) and Alphabet (GOOGL). Large-cap internet stocks are expected to outperform small and mid-caps in 2026, the firm said.\nTruist noted that sustained digital advertising growth and holiday-season sales momentum, including Cyber-5 week, contribute to the constructive outlook.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:56:20",
      "Source": "MT Newswires",
      "Title": "Meta Platforms' Personalized Ad Model Deemed Unlawful by Austrian Supreme Court",
      "URL": "https://finance.yahoo.com/news/meta-platforms-apos-personalized-ad-155620554.html",
      "Content": "PREMIUM\nMeta Platforms' Personalized Ad Model Deemed Unlawful by Austrian Supreme Court\n\nMT Newswires\nThu, December 18, 2025 at 7:56 AM PST 1 min read\n\nIn this article: META\n\nMeta Platforms' (META) personalized advertising model has been ruled unlawful by the Austrian Suprem\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:52:13",
      "Source": "Benzinga",
      "Title": "Charlie Munger Said, 'Find A Way To Get Your Hands On $100,000' Even If It Means Walking Everywhere — The Magic Number If You Want To Be Rich",
      "URL": "https://finance.yahoo.com/news/charlie-munger-said-way-hands-155213794.html",
      "Content": "Charlie Munger Said, 'Find A Way To Get Your Hands On $100,000' Even If It Means Walking Everywhere — The Magic Number If You Want To Be Rich\n\nJeannine Mancini\nThu, December 18, 2025 at 7:52 AM PST 4 min read\n\nIn this article: GOOG\n\nMETA\n\nAMZN\n\nBRK.A\n\nCharlie Munger didn't believe in shortcuts — but he did believe in thresholds. And if you ever asked how to get rich , he had a number ready: $100,000. Hit that, he said, and you'll have the momentum to keep going. Fail to hit it, and you'll spin your wheels forever.\nMunger, who died in 2023 just weeks shy of his 100th birthday, was best known as Warren Buffett's blunt, brilliant right hand — but he built a billion-dollar fortune of his own by focusing on what worked and ignoring what didn't.\n\nOne piece of wisdom that resonates with investors is his take on building wealth. In the late 1990s, during a shareholder meeting, Munger said, “The first $100,000 is a b****, but you gotta do it.”\nDon't Miss:\nThe AI Marketing Platform Backed by Insiders from Google, Meta, and Amazon — Invest at $0.85/Share\nAmericans With a Financial Plan Can 4X Their Wealth — Get Your Personalized Plan from a CFP Pro\nThis statement emphasizes the initial hurdle many face in accumulating savings. Munger’s bluntness highlights the challenge of reaching that critical first $100,000.\n“I don’t care what you have to do,\" he said. \"If it means walking everywhere and not eating anything that wasn’t purchased with a coupon, find a way to get your hands on $100,000.\"\n\nThe reason behind Munger’s focus on this initial amount? The power of compounding. Once you have that base, the path to greater wealth becomes smoother. With compounding returns, $100,000 can grow significantly over time, providing a strong foundation for long-term financial goals.\n“After that, you can ease off the gas a little bit,” he said.\nTrending: $100k+ in investable assets? Match with a fiduciary advisor for free to learn how you can maximize your retirement and save on taxes – no cost, no obligation.\nMunger made this statement in the mid-1990s, and when adjusted for inflation, $100,000 at the time is roughly equivalent to about $200,000 in 2025 dollars, based on U.S. consumer price index data. The number itself has shifted with time, but the idea behind it has not. The first meaningful pool of capital is still the hardest to assemble, and everything that follows depends on clearing that initial hurdle.\n\nThat belief stayed with Munger until the end of his life. In 2023, during one of his final long-form interviews discussed on the \" Acquired\" podcast, he summed up the payoff of that early grind in a single line: \"You only have to get rich once .\" The remark reflected a theme he returned to repeatedly over decades — build a durable financial base one time, and the rest of your decisions become less constrained.\n\nStory Continues\nThat perspective also helps explain why Munger's career did not begin with stocks. Before becoming Buffett's longtime partner at Berkshire Hathaway, Munger was a real estate attorney. He understood early on how property, cash flow, and patience could work together over long periods. Real estate was not a side note in his thinking. It was foundational.\n\nFor people trying to apply that lesson today, real estate remains one of the most common ways to build toward that first six-figure milestone. Rental income, equity growth, and long holding periods can create momentum that wages alone often struggle to provide. While not everyone can buy an entire property outright, access to real estate no longer requires that level of capital.\nSee Also: An EA Co-Founder Shapes This VC Backed Marketplace— Now You Can Invest in Gaming's Next Big Platform\nPlatforms like Arrived offer one example. Arrived allows investors to buy fractional shares of rental home s, giving them exposure to rental income and property appreciation without owning or managing a full property themselves. The best part? All you need is $100 to get started.\n\nFor people working toward their first $100,000, or its inflation-adjusted equivalent, steady real estate income can complement traditional saving and investing strategies.\nMunger never argued that the process was easy. He argued that it was worth it. The discipline required to build that first base — whether through work, saving, investing, or real estate — is the same discipline that keeps wealth intact later on. Once that base exists, compounding has room to operate, and the pressure to constantly scramble begins to fade.\nA financial adviser can help translate those principles into a plan that fits real life, weighing income, risk tolerance, time horizon, and how assets like stocks and real estate should work together. The goal is not to replicate Munger's fortune. It is to apply his logic: reach a solid foundation once, and let time do the rest.\n\nSome elements of this story were previously reported by Benzinga and it has been updated.\nRead Next: Buffett's Secret to Wealth? Private Real Estate— Get Institutional Access Yourself\nImage: Shutterstock\nUp Next: Transform your trading with Benzinga Edge's one-of-a-kind market trade ideas and tools. Click now to access unique insights that can set you ahead in today's competitive market.\nGet the latest stock analysis from Benzinga:\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Charlie Munger Said, 'Find A Way To Get Your Hands On $100,000' Even If It Means Walking Everywhere — The Magic Number If You Want To Be Rich originally appeared on Benzinga.com\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:51:37",
      "Source": "GuruFocus.com",
      "Title": "AI Giants Eye Dublin in Quiet Power Grab",
      "URL": "https://finance.yahoo.com/news/ai-giants-eye-dublin-quiet-155137025.html",
      "Content": "AI Giants Eye Dublin in Quiet Power Grab\n\nKhac Phu Nguyen\nThu, December 18, 2025 at 7:51 AM PST 2 min read\n\nIn this article: ANTH.PVT\n\nMETA\n\nOPAI.PVT\n\nThis article first appeared on GuruFocus .\nOpenAI and Anthropic are assessing potential expansions of their Dublin office footprints, a move that could reflect a broader strategy to deepen their European presence as competition to scale artificial intelligence services accelerates. People familiar with the discussions say Anthropic is considering leasing around 25,000 square feet in the city over the next three to five years, although the final figure could be lower as plans continue to evolve. Other AI firms, including OpenAI, are understood to be evaluating similar space requirements, marking a possible shift away from the small, flexible co-working offices both companies currently use in Dublin.\n\nWarning! GuruFocus has detected 2 Warning Sign with META.\nIs META fairly valued? Test your thesis with our free DCF calculator.\nThis search for larger offices comes as fast-growing AI players look to build out operations abroad and compete for users, even as concerns circulate around the possibility of a trillion-dollar AI bubble. Dublin already hosts the European hubs of major technology groups such as Meta Platforms ( NASDAQ:META ) and ByteDance's TikTok, and industry observers suggest the current AI boom could reinforce the city's long-standing ties to US technology firms. Anthropic declined to comment on its specific leasing plans but said it is expanding rapidly, with existing European offices in London, Paris, Zurich and Munich, and has described EMEA as its fastest-growing region in a November blog post.\n\nOpenAI, backed by Microsoft ( NASDAQ:MSFT ), also declined to discuss specific property plans, but said it employs about 60 people in Ireland and expects to continue adding staff in 2026. The company began its Dublin operations in 2023 and is advertising roles including software engineers and trust and safety analysts, while also planning to increase the size of its London office. Together, these developments suggest that Dublin could see increased activity from AI companies seeking to scale their European operations, even as the pace and final shape of that expansion remain subject to change.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:15:49",
      "Source": "24/7 Wall St.",
      "Title": "China Prepares to Wreck US AI Industry",
      "URL": "https://finance.yahoo.com/m/52060673-6d88-33ef-9d62-758d25b5efeb/china-prepares-to-wreck-us-ai.html",
      "Content": "China Prepares to Wreck US AI Industry\n\nDouglas A. McIntyre\nThu, December 18, 2025 at 7:15 AM PST 4 min read\n\nIn this article: META\n\nGOOG\n\nNVDA\n\nORCL\n\nMSFT\n\nThe math is simple. It starts with three facts. China has spent massive amounts to create very low-priced electricity at a rate several times the U.S. pace. It has built massive dams. The best example is the Motuo Hydropower Station on the Yarlung Tsangpo River in Tibet. No other nation could build a colossal project so fast. And China has extraordinary solar power supply. Do the large Chinese artificial intelligence (AI) companies pay for these? No. The central government largely does. China is a dictatorship, so things happen that way.\n\n24/7 Wall St. Key Points There are three ways China is poised to leap ahead in artificial intelligence.\nThe United States faces many headwinds in creating AI infrastructure.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:59:41",
      "Source": "TechCrunch",
      "Title": "Trump Media is merging with fusion power company TAE Technologies in $6B+ deal",
      "URL": "https://finance.yahoo.com/news/trump-media-merging-fusion-power-145941117.html",
      "Content": "Trump Media is merging with fusion power company TAE Technologies in $6B+ deal\n\nTim De Chant, Amanda Silberling\nThu, December 18, 2025 at 6:59 AM PST 3 min read\n\nIn this article: TATE.PVT\n\nMETA\n\nGOOG\n\nPresident Donald Trump’s social media company, Trump Media and Technology Group (TMTG), said on Thursday that it’s merging with TAE Technologies , a Southern California-based company that has been chasing the dream of fusion power for nearly 30 years.\nThe all-stock transaction, valued at more than $6 billion, would expand Trump Media’s presence into the nascent fusion power space while data centers clamor for more electricity amid the ongoing AI boom.\n\nTMTG is the parent company of Truth Social, the microblogging platform that the president spun up after he was banned from platforms like YouTube, Twitter, and Facebook in the wake of the January 6 attacks on the U.S. Capitol. At launch , the president called it “a rival to the liberal media consortium,” and said he wanted to “fight back against the Big Tech companies.”\nTMTG went public last year via a merger with a special-purpose acquisition company (SPAC), a technique used to go public by private companies that want to raise money quickly but aren’t yet mature enough to take the traditional IPO route. In the quarter ended September 30, 2025, TMTG reported that it recorded a loss of $54.8 million on revenue of $972,900.\nTruth Social and the company’s streaming platform have failed to generate much revenue, but TMTG has nevertheless managed to amass $3.1 billion in assets, largely through its cryptocurrency investments and partnerships.\n\nTMTG CEO Devin Nunes, formerly a Republican congressman, stated that the company’s acquisition of TAE would “cement America’s global energy dominance for generations.” The companies said they plan to site and begin construction on “the world’s first utility-scale fusion power plant (50 MWe)” next year, and have plans for more fusion plants that are expected to generate between 350 megawatts to 500 megawatts of electricity.\nBut the path forward for fusion power remains uncertain.\nCurrently, only one experimental device has proven that controlled fusion reactions can generate more power than they consume. Several other companies, including Bill Gates-backed Commonwealth Fusion Systems and Sam Altman-backed Helion , are in the race to put fusion power on the grid sometime in the early 2030s.\n\nIf one or more fusion startups succeed, they could deliver gigawatts of clean, continuous power to the grid using nothing more than hydrogen isotopes filtered from seawater. Inside a fusion reactor, those isotopes are heated and compressed until they turn into a plasma. When particles in the plasma collide, they merge to form a new, heavier atom while releasing tremendous amounts of heat, which can be harvested to generate electricity.\n\nStory Continues\nTAE has been working on a range of fusion devices since the late 1990s. The company has raised nearly $2 billion in total, including a recent $150 million round from existing investors including Google, Chevron Technology Ventures, and New Enterprise. The company has been valued at about $1.8 billion, according to PitchBook.\n\nOver the years, TAE has struggled to make its various designs work. Its latest effort uses magnetic fields generated by rotating plasma to stabilize the plasma itself. Particle beams bombard the outside of the plasma cloud, helping it to spin.\nIn the meantime, TAE has also created a new division focused on the life sciences. It is selling a version of its particle accelerator as a radiation treatment for cancer.\nAfter the merger, Nunes and TAE CEO Dr. Michl Binderbauer will serve as co-CEOs of the combined company.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:50:44",
      "Source": "24/7 Wall St.",
      "Title": "Meta Platforms (NASDAQ: META) Stock Price Prediction for 2026: Where Will It Be in 1 Year (Dec 18)",
      "URL": "https://finance.yahoo.com/m/8b941382-ff1c-35a6-a44b-22dba0ec5010/meta-platforms-%28nasdaq%3A-meta%29.html",
      "Content": "Meta Platforms (NASDAQ: META) Stock Price Prediction for 2026: Where Will It Be in 1 Year (Dec 18)\n\nJoel South\nThu, December 18, 2025 at 6:50 AM PST 7 min read\n\nIn this article: META\n\nThis year, one of the better performers among the Magnificent 7 had been Meta Platforms Inc. ( NASDAQ: META ). But its third-quarter earnings report raised investor concerns about the company’s massive capital spending on artificial intelligence initiatives. In addition, Meta says it plans to make significant cuts to the budget of its Reality Labs metaverse division in the coming year. The stock is down 13.6% since the quarterly report was released.\n\nStrong quarterly reports earlier this year (despite a tax charge) had lent credence to the claim that Meta would continue to outshine its competitors over the next year. The share price hit an all-time high of $796.25 back in August. Due to the recent pullback, the stock is up 4.9% year over year, underperforming the broader market. Furthermore, the near-term future of the economy is uncertain—just like the markets themselves—and Meta Platforms CEO Mark Zuckerberg is a controversial figure. Certainly, Zuckerberg's sudden shift to the metaverse and brand name change to Meta Platforms raised a few eyebrows several years ago.\n24/7 Wall St. Key Points Meta Platforms Inc.’s ( NASDAQ: META ) AI push has been a key driver for the company in 2025, with integrations coming across numerous platforms, which is fueling engagement and increasing ad sales.\nDespite economic cloudiness, Meta announced that its 2025 capital expenditures (capex) estimate increased significantly, much of which will be allocated to AI project development and integration.\nIf you’re thinking about retiring or know someone who is, there are three quick questions causing many Americans to realize they can retire earlier than expected. take 5 minutes to learn more here\n\nNow, the Meta Platforms CEO is shifting the company's focus and riding a powerful, bullish trend. Against this complex backdrop with many moving parts, investors should consider the wide range of Meta stock price targets and formulate a strategy for all possible outcomes. To help, 24/7 Wall St. conducted some analysis. Let's jump in.\nWhy Invest in Meta Platforms? Let's start by addressing the elephant in the room. Investors should not rely on Meta Platforms' Reality Labs metaverse business to drive the company's near-term future growth. In Q3 2025, Reality Labs generated $470 million in revenue, up from $370 million in revenue in the prior quarter. However, during that same time frame, Reality Labs recorded a loss from operations of $4.43 billion.\n\nFortunately, it appears that the CEO's attention has turned to a different tech field lately. In particular, Zuckerberg seems to expect AI to be Meta Platforms' key driver going forward. AI integrations into Facebook, Instagram, Messenger, and WhatsApp could provide an economic moat for Meta Platforms if new features translate to greater user engagement. WhatsApp, in particular, has seen notable growth with more than 3 billion monthly users now.\n\nStory Continues\nMeta's AI focus evidently helped the company succeed in the third quarter of the year despite losses in its metaverse business. Impressively, Meta Platforms grew its revenue 26% year over year to $51.2 billion, beating Wall Street's consensus call for $49.5 billion. Furthermore, excluding a one-time tax charge, the company's earnings per share (EPS) surged 20% to $7.25, easily outpacing the analysts' consensus estimate of $6.74.\n\nThere's no doubt that Zuckerberg is all-in on the AI revolution now. He envisions a future in which AI will be used for \"a lot\" of \"social tasks.\" And he believes it's \"really compelling\" that AI will \"get to know you better and better.\" Some reporters have expressed skepticism of an AI-infused future. Yet, if Meta Platforms can parlay machine learning into profits, investors shouldn't dismiss the growth potential of Meta stock.\nAnother key driver for Meta Platforms is its Threads short-form messaging platform. Granted, Threads is still playing catch-up to the popular X platform, which is owned by Tesla CEO Elon Musk. Still, Threads is making inroads as its monthly active user count grew from 320 million in 2024's fourth quarter to 350 million in Q1 of 2025. That's not at the level of X, which reportedly has more than 580 million monthly active users. Yet, perhaps AI feature integration can make Threads even more competitive with X in the coming quarters.\n\nThe company expects fourth-quarter 2025 revenue to range from $56 billion to $59 billion. That is expected to be driven primarily by ongoing strength in its advertising business, bolstered by the positive impact of AI-driven enhancements to ad targeting and user engagement across its family of apps.\nMeta Platforms as a Stock It is impossible to know how the economy will perform going forward. Similarly, it remains unclear whether Meta Platforms will achieve significant returns on its AI investments. These unknowns will not stop analysts from publishing their Meta stock price predictions, though.\nOppenheimer and Benchmark downgraded the stock following the third-quarter earnings release, citing increased capex concerns. However, BofA Securities has reiterated its Buy rating on the shares, keeping its price target at $900 and affirming long-term confidence in Meta, citing its user base and potential AI integration opportunities. Cantor Fitzgerald also reaffirmed its positive stance by reiterating an Overweight rating and $920 price target. It anticipates that improvements in AI execution will lead to a \"sentiment reversal\" for the company in 2026.\n\nThe aforementioned uncertainties are reflected in the wide range of Wall Street analysts' price targets for Meta Platforms. The Zuckerberg-led firm has a high price target of $1,117.00, a median price target of $837.92, and a low target price of $685.00. However, the consensus recommendation of 67 analysts covering the stock remains to buy shares.\nEstimate\nPrice Target\nChange From Current Price\nLow\n$685.00\n5.5%\nMedian\n$837.92\n29.0%\nHigh\n$1,117.00\n72.0%\n\nMeta Platforms 2025 Outlook Meta Platforms raised its 2025 capex estimate from a range of $66 billion to $72 billion to a range of $70 billion to $72 billion. By now, you can probably guess what Meta Platforms is spending those extra billions on. If you guessed AI, you are correct. More specifically, Meta Platforms' management anticipates \"additional data center investments to support our artificial intelligence efforts as well as an increase in the expected cost of infrastructure hardware.\"\n\nHence, the multi-billion-dollar question is whether Meta Platforms can effectively leverage its costly AI enhancements. That's difficult to predict. The same goes for the state of the economy, which might not support an increase in ad spending if macroeconomic conditions deteriorate in the remainder of this year.\n24/7 Wall St.'s Meta forecast is a more bullish than the mean forecast, calling for the share price to rise to $935.29 by the end of next year. That implies a run of 44.0%. It is based on the company’s ability to sustain strong ad revenue while increasing efficiency. This should drive its bottom line despite higher capital expenditures for AI objectives.\nUltimately, your price target for Meta Platforms stock should depend on whether you expect the company to take full advantage of ramped-up AI features. If so, then get ready for Meta Platforms stock to eventually head for new all-time highs. However, it may be a bumpy ride along the way.\n\nMeta’s Heavy AI Spending Justified Says Pro. Is He Right?\n\nThe New Report Shaking Up Retirement Plans You may think retirement is about picking the best stocks or ETFs, but you’d be wrong. Even great investments can be a liability in retirement. It’s a simple difference between accumulating vs distributing, and it makes all the difference.\nThe good news? After answering three quick questions many Americans are reworking their portfolios and finding they can retire earlier than expected. If you’re thinking about retiring or know someone who is, take 5 minutes to learn more here .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:05:14",
      "Source": "Reuters",
      "Title": "Big Tech-backed coalition supports biowaste carbon removal firm",
      "URL": "https://finance.yahoo.com/news/big-tech-backed-coalition-supports-130514530.html",
      "Content": "Big Tech-backed coalition supports biowaste carbon removal firm\n\nSimon Jessop and Susanna Twidale\nThu, December 18, 2025 at 5:05 AM PST 1 min read\n\nIn this article: STRI.PVT\n\nMETA\n\nGOOG\n\nSHOP\n\n(Corrects lede to remove referece to Meta which is no longer a member of the coalition, replaces with ​Stripe.)\nBy Simon Jessop and Susanna Twidale\nLONDON, Dec 18 (Reuters) - A coalition ‌backed by Big Tech companies including Google and Stripe has agreed to pay $44.2 ‌million for carbon credits from a Canadian company that aims to remove carbon dioxide from biowaste, the coalition's head of deployment told Reuters.\n\nFrontier, launched in 2022 by Stripe, Google, Meta, Shopify and McKinsey, aims to ⁠help scale carbon removal ‌technologies by committing to buy credits in advance, thereby derisking the projects and helping them grow more ‍quickly. The group plans to spend $1 billion on credits between 2022 and 2030.\nIts latest deal covers 122,000 metric tons of CO2 to be locked away ​between 2026 and 2030 by NULIFE GreenTech, which converts agricultural and ‌industrial waste - including grease from food processing - into bio-oil. The credits were purchased at an average weighted price of $362 per ton.\nNULIFE uses high-pressure cooking to break down waste into substances such as bio-oil, which is injected into salt caverns more than 1,000 metres underground ⁠for permanent storage. Frontier estimates the ​technology could scale to 1.5 gigatons of ​carbon removal annually by 2040.\n\"The goal at Frontier is really to create a portfolio of solutions that we ‍think are most ⁠likely to go the distance to a gigaton scale future,\" Hannah Bebbington Valori, Frontier’s head of deployment, said in an interview.\nScientists ⁠say carbon removal projects are critical to offset emissions from sectors that continue ‌to rely on fossil fuels.\n(Reporting by Simon Jessop and ‌Susanna Twidale. Editing by Mark Potter)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:00:00",
      "Source": "Business Wire",
      "Title": "Incyte to Present at Upcoming Investor Conference",
      "URL": "https://finance.yahoo.com/news/incyte-present-upcoming-investor-conference-130000853.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nIncyte to Present at Upcoming Investor Conference\n\nBusiness Wire\nThu, December 18, 2025 at 5:00 AM PST 1 min read\n\nIn this article: INCY\n\nMETA\n\nWILMINGTON, Del., December 18, 2025 --( BUSINESS WIRE )--Incyte (Nasdaq:INCY) announced today that it will present at the 44 th Annual J. P. Morgan Healthcare Conference on Monday, January 12, 2026 at 8:15 am (PST).\nThe presentation will be webcast live and can be accessed at Investor.Incyte.com and will be available for replay for 30 days.\n\nAbout Incyte\nA global biopharmaceutical company on a mission to Solve On. , Incyte follows the science to find solutions for patients with unmet medical needs. Through the discovery, development and commercialization of proprietary therapeutics, Incyte has established a portfolio of first-in-class medicines for patients and a strong pipeline of products in Oncology and Inflammation & Autoimmunity. Headquartered in Wilmington, Delaware, Incyte has operations in North America, Europe and Asia.\nFor additional information on Incyte, please visit Incyte.com or follow us on social media: LinkedIn , X , Instagram , Facebook , YouTube .\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251218287907/en/\nContacts\nIncyte Contacts\nMedia\nmedia@incyte.com\nInvestors\nir@incyte.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:00:00",
      "Source": "PR Newswire",
      "Title": "Data Center Capex Up 59 Percent on Continued AI Investment in 3Q 2025, According to Dell'Oro Group",
      "URL": "https://finance.yahoo.com/news/data-center-capex-59-percent-130000640.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nData Center Capex Up 59 Percent on Continued AI Investment in 3Q 2025, According to Dell'Oro Group\n\nPR Newswire\nThu, December 18, 2025 at 5:00 AM PST 3 min read\n\nIn this article: AMZN\n\nGOOG\n\nORCL\n\nMETA\n\nMSFT\n\nAccelerated Server Demand and Hyperscale Cloud expansion Drive Broad-based Infrastructure Spending\nREDWOOD CITY, Calif. , Dec. 18, 2025 /PRNewswire/ -- According to a recently published report by Dell'Oro Group, the trusted source for market information about the telecommunications, security, networks, and data center industries, worldwide data center capital expenditures increased 59 percent year-over-year, marking the eighth consecutive quarter of double-digit growth as the AI investment cycle continues to broaden beyond early, training-focused deployments.\n\"The Top 4 US cloud service providers—Amazon, Google, Meta, and Microsoft—continue to raise data center capex expectations for 2025, supported by increased investments in both AI and general-purpose infrastructure. Oracle is also on track to double its data center capex this year as it expands capacity for the Stargate project,\" said Baron Fung, Senior Research Director at Dell'Oro Group. \"What is notable this cycle is not just the pace of spending, but the expanding scope of investment, as cloud providers simultaneously scale accelerated compute, general-purpose servers, and the supporting infrastructure required to deploy AI at production scale. Accelerated server spending surged in the quarter, driven by the ramp of NVIDIA Blackwell Ultra, along with custom accelerator platforms across US hyperscalers, neo cloud providers, and sovereign AI deployments. At the same time, cloud service providers are increasing emphasis on greater capex discipline by optimizing asset depreciation and lifecycles to ensure healthy cash flow,\" explained Fung.\n\nAdditional highlights from the 3Q 2025 Data Center IT Capex Quarterly Report:\nThe global data center capex growth outlook was raised through 2026, reflecting sustained hyperscale investment and continued prioritization of AI infrastructure.\nDemand for general-purpose servers strengthened as cloud providers expanded compute and storage capacity to support growing cloud services and inference-heavy AI workloads.\nDell led all server OEMs in revenue, followed by HPE and Lenovo, gaining share on strong NVIDIA Blackwell shipments and a refreshed x86 portfolio, while white-box vendors captured the majority of server shipments, supported by hyperscale AI deployments and elevated general-purpose server demand.\nAbout the Report\nDell'Oro Group's Data Center IT Capex Quarterly Report details the data center infrastructure capital expenditures of each of the ten largest Cloud service providers, as well as the Rest-of-Cloud, Telco, and Enterprise customer segments. Allocation of the data center infrastructure capex for general-purpose and accelerated servers, storage systems, and other auxiliary data center equipment is provided. The report also discusses market trends, drivers of the leading Cloud service providers' capex growth during the quarter, and the outlook for the next year. To purchase this report, please contact us at dgsales@delloro.com.\n\nStory Continues\nAbout Dell'Oro Group\nDell'Oro Group is a market research firm that specializes in strategic competitive analysis in the telecommunications, security, enterprise networks infrastructure, and data center markets. Our firm provides in-depth quantitative data and qualitative analysis to facilitate critical, fact-based business decisions. For more information, contact Dell'Oro Group at +1.650.622.9400 or visit www.delloro.com .\nView original content to download multimedia: https://www.prnewswire.com/news-releases/data-center-capex-up-59-percent-on-continued-ai-investment-in-3q-2025-according-to-delloro-group-302642624.html\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:46:31",
      "Source": "Investor's Business Daily",
      "Title": "Data Centers Are Booming. So Is A Backlash Over Electricity Rates.",
      "URL": "https://finance.yahoo.com/m/21efdd73-59b7-33fc-8e84-fd1b3ad8eb99/data-centers-are-booming.-so.html",
      "Content": "Data Centers Are Booming. So Is A Backlash Over Electricity Rates.\n\nALEXIS GARCIA and KIT NORTON\nThu, December 18, 2025 at 4:46 AM PST 16 min read\n\nIn this article: AMZN\n\nMSFT\n\nGOOG\n\nMETA\n\nORCL\n\nThe data centers critical to the nation's AI ambitions are spawning local political battles as rising energy costs frustrate communities. What investors need to know about data center NIMBYism.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:21:10",
      "Source": "MT Newswires",
      "Title": "Market Chatter: Meta's Outgoing Chief AI Scientist Looking to Raise $586 Million for Startup",
      "URL": "https://finance.yahoo.com/news/market-chatter-meta-apos-outgoing-122110696.html",
      "Content": "PREMIUM\nMarket Chatter: Meta's Outgoing Chief AI Scientist Looking to Raise $586 Million for Startup\n\nMT Newswires\nThu, December 18, 2025 at 4:21 AM PST 1 min read\n\nIn this article: META\n\nMeta Platforms' (META) outgoing chief artificial intelligence scientist Yann LeCun is in early discu\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:05:00",
      "Source": "Business Wire",
      "Title": "Edwards Lifesciences to Present at the 44th Annual J.P. Morgan Healthcare Conference",
      "URL": "https://finance.yahoo.com/news/edwards-lifesciences-present-44th-annual-120500959.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nEdwards Lifesciences to Present at the 44th Annual J.P. Morgan Healthcare Conference\n\nBusiness Wire\nThu, December 18, 2025 at 4:05 AM PST 1 min read\n\nIn this article: EW\n\nMETA\n\nIRVINE, Calif., December 18, 2025 --( BUSINESS WIRE )--Edwards Lifesciences Corporation (NYSE: EW) today announced it will participate in the J.P. Morgan Healthcare Conference on Monday, Jan. 12, 2026.\nBernard Zovighian, chief executive officer, is scheduled to present at 11:15 a.m. PT. Scott Ullem, chief financial officer, will also participate in the conference. A live webcast of the presentation will be available on the Edwards Lifesciences investor relations website at http://ir.edwards.com/ , with an archived version accessible later the same day.\n\nAbout Edwards Lifesciences\nEdwards Lifesciences is the leading global structural heart innovation company, driven by a passion to improve patient lives. Through breakthrough technologies, world-class evidence and partnerships with clinicians and healthcare stakeholders, our employees are inspired by our patient-focused culture to deliver life-changing innovations to those who need them most. Discover more at www.edwards.com and follow us on LinkedIn, Facebook, Instagram and YouTube.\nEdwards, Edwards Lifesciences, and the stylized E logo are trademarks of Edwards Lifesciences Corporation. All other trademarks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251218869141/en/\nContacts\nMedia Contact: Amy Meshulam, media@edwards.com\nInvestor Contact: Mark Wilterding, investor_relations@edwards.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:00:39",
      "Source": "Yahoo Finance Video",
      "Title": "Amazon, Apple, Google, etc.: Why the Mag 7 needs to 'recalibrate'",
      "URL": "https://finance.yahoo.com/video/amazon-apple-google-etc-why-120039409.html",
      "Content": "Amazon, Apple, Google, etc.: Why the Mag 7 needs to 'recalibrate'\n\nYahoo Finance Video and Brian Sozzi\nThu, December 18, 2025 at 4:00 AM PST\n\nIn this video: TSLA\n\n^GSPC\n\nAAPL\n\nGOOG\n\nMSFT\n\nThe S&P 500 ( ^GSPC ) is concentrated primarily in the top ten technology stocks, according to Barclays.\nPNC Asset Management Group chief investment officer Amanda Agati, Yahoo Finance Senior Business Reporter Ines Ferré , and Yahoo Finance Senior Reporter Brooke DiPalma join Opening Bid host Brian Sozzi to discuss the market's concentration in tech and whether it's time for investors to start selling the \"Magnificent Seven.\"\nTo watch more expert insights and analysis on the latest market action, check out more Opening Bid .\n\nVideo Transcript\n\n00:00 Speaker A\nWhat I mentioned at the top about how much concentration risk there is in the S&P 500. What does that mean exactly for investors as we gear up for next year?\n00:10 Amanda\nWell, it's a great question and it's great to be with all of you again.\n00:15 Amanda\nIt's tough out there. Uh certainly for active managers to try and own enough of those top seven or top 10 names to really make a difference in terms of trying to keep up with, let alone outperform the S&P 500.\n00:30 Amanda\nSo for multi- asset investors, it's I think it's just going to continue to be a challenging environment to keep up with the S&P 500. It's hard to bet against them though.\n00:43 Amanda\nBut I think for 2026, it's going to be less about valuation multiple expansion and much more about what happens to the bottom 490 or 493, however you want to calculate it. I think that market breadth story, it was a little bit elusive this year, but I think it's going to come to the forefront next year and make a difference for multi- asset investor positioning.\n01:00 Speaker A\nAmanda, that's good points. Uh is the sell-offs we're seeing in Oracle and CoreWeave over the past few weeks, is that the signal Amanda to investors to start lightning the load on the Mag 7?\n01:11 Amanda\nI don't know that it's necessarily a signal to start selling. Again, we're not trying to bet against that story. It's it's very secular, thematic, long runway, still very much early innings. So we're all in on it. I think just the reality of where valuations have moved to is a little bit, I don't want to say nonsensical, but I just said nonsensical.\n01:28 Amanda\nIt feel it feels like we need to recalibrate a little bit. And so I think what's happening here is some seasonality, selling some of those winners and hoping that we get another crack at it, maybe early in the new year.\n01:40 Speaker A\nInez, this is all one big fat bubble, right?\n01:44 Ines\nLook, uh Sozzi, uh like Amanda was saying, I mean, yes, there is this concentration uh and also Goldman Sachs uh just recently put out a note as well talking about that concentration for earnings growth for next year and concentrated in the largest uh S&P 500, the largest seven stocks of the S&P 500.\n02:05 Ines\nHowever, like what Amanda was just saying, there is this expectation that for the other 493, that you will see a bit of an acceleration of earnings growth for those companies as well. So there may be a little tiny bit of broadening out when it comes to that.\n02:22 Ines\nBut a lot of this of course is the AI theme that we've been talking about and this is what Wall Street has been bullish on, is this AI theme that AI uh driven productivity will also be supporting earnings.\n02:37 Speaker A\nUh important point here Brooke is that within these 10 stocks that have uh essentially taken over the S&P 500 and taken over the minds of investors. These companies have earnings, the earnings are good and they're still accelerating. So I guess to Amanda's point, it's going to be hard to bet against these names next year.\n02:53 Brooke\nBrian, but I think what the key point here that investors have really weighed in on is the future outlook of these companies, the guidance that they're putting out.\n03:02 Brooke\nAnd I think that's why we're seeing investors fall disappointed based upon what these companies say will be the end results or what exactly the end result could potentially be for revenue when it comes to all the AI investments that they're currently making, the spending that they're currently doing.\n03:20 Brooke\nAnd and that's why sometimes we're not seeing the same return that we see from other uh stocks, other investments because of the fact that these these uh guidance, these outlook that these companies put out just doesn't meet the very high bar that these investors have set for these sort of companies.\n03:42 Brooke\nAnd also, we are seeing a bit of a different fold. Over the past three months, we've seen Tesla, Apple, and Alphabet outperform the broader uh Mag 7.\n03:51 Brooke\nAnd that's largely because of the fact that investors seem to be liking the way in which these companies are now pursuing AI. And so we're seeing this bit of a uh a differ, you know, a difference in what we're seeing in these latter parts of the month than maybe earlier this year when we really saw Nvidia, Amazon, Microsoft, as well as Meta really lead the way within this AI tech rally, especially over the summer months.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "19:06:41",
      "Source": "Reuters",
      "Title": "Meta's Yann LeCun targets $3.5 billion valuation for new AI startup, FT reports",
      "URL": "https://finance.yahoo.com/news/metas-yann-lecun-targets-3-110641727.html",
      "Content": "Meta's Yann LeCun targets $3.5 billion valuation for new AI startup, FT reports\n\nReuters\nThu, December 18, 2025 at 3:06 AM PST 1 min read\n\nIn this article: META\n\nDec 18 (Reuters) - Meta's ( META ) outgoing chief artificial intelligence scientist Yann LeCun is holding early talks to ​raise 500 million euros ($586.00 million) for a new ‌startup that would value the AI firm at about 3 billion euros ‌ahead of its official launch, the Financial Times reported on Thursday.\n\nThe report said LeCun has tapped Alexandre LeBrun, the founder of French health tech startup Nabla, as chief executive, ⁠citing people familiar ‌with the matter.\nLeCun played a key role in developing Meta's AI ambitions, and said last ‍month that he will leave the social media giant at the end of the year to focus on a new startup ​that aims to build a new generation of ‌superintelligent AI systems.\n\nStrong funding commitments and a high valuation before launch could fuel fears of an AI bubble after industry leaders warned that enthusiasm for AI may have outstripped business fundamentals.\nThe startup plans to build AI systems using ⁠so-called world models that can ​understand the physical world. The systems ​could support applications including robotics and transport.\nLeCun did not immediately respond to a Reuters request ‍for comment.\n\nSign up for Yahoo Finance's Week in Tech\n\nBy subscribing, you are agreeing to Yahoo's\n\nTerms\n\nand\n\nPrivacy Policy\n\nSubscribe\nHe is ⁠widely regarded as one of the \"godfathers\" of deep learning, alongside Geoffrey Hinton and Yoshua Bengio — a trio ⁠that won the 2018 Turing Award, often called the Nobel Prize ‌of computing.\n($1 = 0.8532 euros)\n(Reporting by Zaheer Kachwala in ‌Bengaluru; Editing by Tasim Zahid)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "14:15:09",
      "Source": "Insider Monkey",
      "Title": "Meta Platforms, Inc. (META) Boasts Significant Upside Potential Despite Morgan Stanley Price Target Cut",
      "URL": "https://finance.yahoo.com/news/meta-platforms-inc-meta-boasts-061509893.html",
      "Content": "Meta Platforms, Inc. (META) Boasts Significant Upside Potential Despite Morgan Stanley Price Target Cut\n\nNeha Gupta\nWed, December 17, 2025 at 10:15 PM PST 2 min read\n\nIn this article: META\n\nMS\n\nGOOG\n\nMeta Platforms Inc. (NASDAQ: META ) is one of billionaire David Tepper’s top stock picks heading into 2026 . On December 11, Morgan Stanley cut its price target of Meta Platforms Inc. (NASDAQ:META) to $750 from $820 while reiterating an Overweight rating.\nMeta App 3D sign\nThe price cut comes amid concerns that sentiments around the social media networking stock have turned negative. That’s in part because of growing fears about revenue durability, operating expense uncertainty, and issues around the company’s Llama AI model. The shift in sentiment comes amid growing confidence in Alphabet’s prospects, buoyed by the tech giant’s AI initiatives.\n\nDespite the cut, the price target represents a significant upside potential. Additionally, Morgan Stanley insists Meta is one of the few companies that can leverage its data, distribution capabilities, and AI investments to generate long-term value.\nAdditionally, the stock came under pressure after the company detailed plans to develop a closed, monetizable AI model incorporating technology from Chinese tech giants, including Alibaba. Avocado is the proposed AI model slated for release next spring. Meta will reportedly retain control over the closed AI model, marking a significant departure from the open-source model it has championed over the years.\nThe Pivot towards a closed model is part of an effort to address the disappointments associated with Meta’s Llama 4 Open Source model.\n\nMeta Platforms, Inc. (NASDAQ:META) is a tech giant focused on connecting people through social media (Facebook, Instagram, WhatsApp), advertising, and building the future of the internet with virtual and augmented reality (Metaverse, Quest headsets, AI), aiming to blend digital and physical worlds for work, play, and connection.\nWhile we acknowledge the potential of META as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 12 Best Industrial Stocks to Buy According to Wall Street Analysts and 12 Best 52-Week High Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "13:39:42",
      "Source": "Insider Monkey",
      "Title": "Oracle (ORCL) Announces Q2 2026 Financial Results",
      "URL": "https://finance.yahoo.com/news/oracle-orcl-announces-q2-2026-053942435.html",
      "Content": "Oracle (ORCL) Announces Q2 2026 Financial Results\n\nBob Karr\nWed, December 17, 2025 at 9:39 PM PST 2 min read\n\nIn this article: ORCL\n\nMETA\n\nNVDA\n\nOracle Corporation (NYSE: ORCL ) is one of the Top AI and Technology Stocks to Buy According to Hedge Funds. On December 10, the company announced its Q2 2026 financial results, with total remaining performance obligations rising 438% YoY in USD to $523 billion. Notably, Oracle Corporation (NYSE:ORCL) highlighted that its RPO rose by $68 billion in Q2 2026, an increase of 15% sequentially. This was highlighted by new commitments from Meta, NVIDIA, and others.\nOracle Corporation (NYSE:ORCL)’s total quarterly revenues rose by 14% in USD and 13% in constant currency to reach $16.1 billion, amidst growth in the cloud revenues of 34% in USD and 33% in constant currency to $8.0 billion.\nThe increase in cloud and software business revenues in Q2 2026 and H1 2026 was mainly because of growth in its cloud revenues as customers purchased its applications and infrastructure technologies, and also renewed related cloud contracts. In constant currency, cloud applications made a contribution of 19% and 20% and cloud infrastructure contributed 81% and 80% to the growth in cloud revenues in Q2 2026 and H1 2026, respectively.\n\nThe company’s operating income came in at $4,731 million in Q2 2026, reflecting an increase from $4,220 million in Q2 2025 because of the increased revenues.\nAfter the release, Goldman Sachs analyst Kash Rangan reduced the price target on the company’s stock to $220 from $320, while keeping a “Neutral” rating.\nWhile we acknowledge the potential of ORCL as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 13 Cheap AI Stocks to Buy According to Analysts and 11 Unstoppable Growth Stocks to Invest in Now\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "13:39:34",
      "Source": "Insider Monkey",
      "Title": "TD Cowen Maintains Buy Rating on Meta Platforms (META) Stock",
      "URL": "https://finance.yahoo.com/news/td-cowen-maintains-buy-rating-053934792.html",
      "Content": "TD Cowen Maintains Buy Rating on Meta Platforms (META) Stock\n\nBob Karr\nWed, December 17, 2025 at 9:39 PM PST 2 min read\n\nIn this article: META\n\nMeta Platforms, Inc. (NASDAQ: META ) is one of the Top AI and Technology Stocks to Buy According to Hedge Funds. On December 4, analyst John Blackledge of TD Cowen maintained a “Buy” rating on the company’s stock, retaining the price objective of $810.00. The analyst’s rating is backed by a combination of factors highlighting Meta Platforms, Inc. (NASDAQ:META)’s strategic cost management and potential for earnings growth.\nOne of the main reasons is Meta Platforms, Inc. (NASDAQ:META)’s plan to significantly reduce its Metaverse-related expenses, which form part of the Reality Labs segment. As per the analyst, such cost reductions are anticipated to be ~30% by 2026, potentially leading to savings of $5 billion – $6 billion. Notably, this move can help partially mitigate the increased spending on AI infrastructure, which happens to be a key area of investment for Meta Platforms, Inc. (NASDAQ:META).\n\nElsewhere, Morgan Stanley reduced its price objective on the company’s stock to $750.00 from $820.00, while maintaining an “Overweight” rating. While the firm reduced its price objective, it believes that Meta Platforms, Inc. (NASDAQ:META) happens to be one of the few selected companies that could leverage leading data, distribution capabilities, and AI investments to fuel earnings power and maintain technological leadership.\nWhile we acknowledge the potential of META as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 13 Cheap AI Stocks to Buy According to Analysts and 11 Unstoppable Growth Stocks to Invest in Now\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 26
}