{
  "stock_id": "META",
  "last_updated": "2025-12-18T14:43:33.637Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-18",
      "Time": "21:00:00",
      "Source": "Business Wire",
      "Title": "Incyte to Present at Upcoming Investor Conference",
      "URL": "https://finance.yahoo.com/news/incyte-present-upcoming-investor-conference-130000853.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nIncyte to Present at Upcoming Investor Conference\n\nBusiness Wire\nThu, December 18, 2025 at 5:00 AM PST 1 min read\n\nIn this article: INCY\n\nMETA\n\nWILMINGTON, Del., December 18, 2025 --( BUSINESS WIRE )--Incyte (Nasdaq:INCY) announced today that it will present at the 44 th Annual J. P. Morgan Healthcare Conference on Monday, January 12, 2026 at 8:15 am (PST).\nThe presentation will be webcast live and can be accessed at Investor.Incyte.com and will be available for replay for 30 days.\n\nAbout Incyte\nA global biopharmaceutical company on a mission to Solve On. , Incyte follows the science to find solutions for patients with unmet medical needs. Through the discovery, development and commercialization of proprietary therapeutics, Incyte has established a portfolio of first-in-class medicines for patients and a strong pipeline of products in Oncology and Inflammation & Autoimmunity. Headquartered in Wilmington, Delaware, Incyte has operations in North America, Europe and Asia.\nFor additional information on Incyte, please visit Incyte.com or follow us on social media: LinkedIn , X , Instagram , Facebook , YouTube .\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251218287907/en/\nContacts\nIncyte Contacts\nMedia\nmedia@incyte.com\nInvestors\nir@incyte.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:00:00",
      "Source": "PR Newswire",
      "Title": "Data Center Capex Up 59 Percent on Continued AI Investment in 3Q 2025, According to Dell'Oro Group",
      "URL": "https://finance.yahoo.com/news/data-center-capex-59-percent-130000640.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nData Center Capex Up 59 Percent on Continued AI Investment in 3Q 2025, According to Dell'Oro Group\n\nPR Newswire\nThu, December 18, 2025 at 5:00 AM PST 3 min read\n\nIn this article: AMZN\n\nGOOG\n\nORCL\n\nMETA\n\nMSFT\n\nAccelerated Server Demand and Hyperscale Cloud expansion Drive Broad-based Infrastructure Spending\nREDWOOD CITY, Calif. , Dec. 18, 2025 /PRNewswire/ -- According to a recently published report by Dell'Oro Group, the trusted source for market information about the telecommunications, security, networks, and data center industries, worldwide data center capital expenditures increased 59 percent year-over-year, marking the eighth consecutive quarter of double-digit growth as the AI investment cycle continues to broaden beyond early, training-focused deployments.\n\"The Top 4 US cloud service providers—Amazon, Google, Meta, and Microsoft—continue to raise data center capex expectations for 2025, supported by increased investments in both AI and general-purpose infrastructure. Oracle is also on track to double its data center capex this year as it expands capacity for the Stargate project,\" said Baron Fung, Senior Research Director at Dell'Oro Group. \"What is notable this cycle is not just the pace of spending, but the expanding scope of investment, as cloud providers simultaneously scale accelerated compute, general-purpose servers, and the supporting infrastructure required to deploy AI at production scale. Accelerated server spending surged in the quarter, driven by the ramp of NVIDIA Blackwell Ultra, along with custom accelerator platforms across US hyperscalers, neo cloud providers, and sovereign AI deployments. At the same time, cloud service providers are increasing emphasis on greater capex discipline by optimizing asset depreciation and lifecycles to ensure healthy cash flow,\" explained Fung.\n\nAdditional highlights from the 3Q 2025 Data Center IT Capex Quarterly Report:\nThe global data center capex growth outlook was raised through 2026, reflecting sustained hyperscale investment and continued prioritization of AI infrastructure.\nDemand for general-purpose servers strengthened as cloud providers expanded compute and storage capacity to support growing cloud services and inference-heavy AI workloads.\nDell led all server OEMs in revenue, followed by HPE and Lenovo, gaining share on strong NVIDIA Blackwell shipments and a refreshed x86 portfolio, while white-box vendors captured the majority of server shipments, supported by hyperscale AI deployments and elevated general-purpose server demand.\nAbout the Report\nDell'Oro Group's Data Center IT Capex Quarterly Report details the data center infrastructure capital expenditures of each of the ten largest Cloud service providers, as well as the Rest-of-Cloud, Telco, and Enterprise customer segments. Allocation of the data center infrastructure capex for general-purpose and accelerated servers, storage systems, and other auxiliary data center equipment is provided. The report also discusses market trends, drivers of the leading Cloud service providers' capex growth during the quarter, and the outlook for the next year. To purchase this report, please contact us at dgsales@delloro.com.\n\nStory Continues\nAbout Dell'Oro Group\nDell'Oro Group is a market research firm that specializes in strategic competitive analysis in the telecommunications, security, enterprise networks infrastructure, and data center markets. Our firm provides in-depth quantitative data and qualitative analysis to facilitate critical, fact-based business decisions. For more information, contact Dell'Oro Group at +1.650.622.9400 or visit www.delloro.com .\nView original content to download multimedia: https://www.prnewswire.com/news-releases/data-center-capex-up-59-percent-on-continued-ai-investment-in-3q-2025-according-to-delloro-group-302642624.html\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:46:31",
      "Source": "Investor's Business Daily",
      "Title": "Data Centers Are Booming. So Is A Backlash Over Electricity Rates.",
      "URL": "https://finance.yahoo.com/m/21efdd73-59b7-33fc-8e84-fd1b3ad8eb99/data-centers-are-booming.-so.html",
      "Content": "Data Centers Are Booming. So Is A Backlash Over Electricity Rates.\n\nALEXIS GARCIA and KIT NORTON\nThu, December 18, 2025 at 4:46 AM PST 16 min read\n\nIn this article: AMZN\n\nMSFT\n\nGOOG\n\nMETA\n\nORCL\n\nThe data centers critical to the nation's AI ambitions are spawning local political battles as rising energy costs frustrate communities. What investors need to know about data center NIMBYism.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:21:10",
      "Source": "MT Newswires",
      "Title": "Market Chatter: Meta's Outgoing Chief AI Scientist Looking to Raise $586 Million for Startup",
      "URL": "https://finance.yahoo.com/news/market-chatter-meta-apos-outgoing-122110696.html",
      "Content": "PREMIUM\nMarket Chatter: Meta's Outgoing Chief AI Scientist Looking to Raise $586 Million for Startup\n\nMT Newswires\nThu, December 18, 2025 at 4:21 AM PST 1 min read\n\nIn this article: META\n\nMeta Platforms' (META) outgoing chief artificial intelligence scientist Yann LeCun is in early discu\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:05:00",
      "Source": "Business Wire",
      "Title": "Edwards Lifesciences to Present at the 44th Annual J.P. Morgan Healthcare Conference",
      "URL": "https://finance.yahoo.com/news/edwards-lifesciences-present-44th-annual-120500959.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nEdwards Lifesciences to Present at the 44th Annual J.P. Morgan Healthcare Conference\n\nBusiness Wire\nThu, December 18, 2025 at 4:05 AM PST 1 min read\n\nIn this article: EW\n\nMETA\n\nIRVINE, Calif., December 18, 2025 --( BUSINESS WIRE )--Edwards Lifesciences Corporation (NYSE: EW) today announced it will participate in the J.P. Morgan Healthcare Conference on Monday, Jan. 12, 2026.\nBernard Zovighian, chief executive officer, is scheduled to present at 11:15 a.m. PT. Scott Ullem, chief financial officer, will also participate in the conference. A live webcast of the presentation will be available on the Edwards Lifesciences investor relations website at http://ir.edwards.com/ , with an archived version accessible later the same day.\n\nAbout Edwards Lifesciences\nEdwards Lifesciences is the leading global structural heart innovation company, driven by a passion to improve patient lives. Through breakthrough technologies, world-class evidence and partnerships with clinicians and healthcare stakeholders, our employees are inspired by our patient-focused culture to deliver life-changing innovations to those who need them most. Discover more at www.edwards.com and follow us on LinkedIn, Facebook, Instagram and YouTube.\nEdwards, Edwards Lifesciences, and the stylized E logo are trademarks of Edwards Lifesciences Corporation. All other trademarks are the property of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251218869141/en/\nContacts\nMedia Contact: Amy Meshulam, media@edwards.com\nInvestor Contact: Mark Wilterding, investor_relations@edwards.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:00:39",
      "Source": "Yahoo Finance Video",
      "Title": "Amazon, Apple, Google, etc.: Why the Mag 7 needs to 'recalibrate'",
      "URL": "https://finance.yahoo.com/video/amazon-apple-google-etc-why-120039409.html",
      "Content": "Amazon, Apple, Google, etc.: Why the Mag 7 needs to 'recalibrate'\n\nYahoo Finance Video and Brian Sozzi\nThu, December 18, 2025 at 4:00 AM PST\n\nIn this video: TSLA\n\n^GSPC\n\nAAPL\n\nGOOG\n\nMSFT\n\nThe S&P 500 ( ^GSPC ) is concentrated primarily in the top ten technology stocks, according to Barclays.\nPNC Asset Management Group chief investment officer Amanda Agati, Yahoo Finance Senior Business Reporter Ines Ferré , and Yahoo Finance Senior Reporter Brooke DiPalma join Opening Bid host Brian Sozzi to discuss the market's concentration in tech and whether it's time for investors to start selling the \"Magnificent Seven.\"\nTo watch more expert insights and analysis on the latest market action, check out more Opening Bid .\n\nVideo Transcript\n\n00:00 Speaker A\nWhat I mentioned at the top about how much concentration risk there is in the S&P 500. What does that mean exactly for investors as we gear up for next year?\n00:10 Amanda\nWell, it's a great question and it's great to be with all of you again.\n00:15 Amanda\nIt's tough out there. Uh certainly for active managers to try and own enough of those top seven or top 10 names to really make a difference in terms of trying to keep up with, let alone outperform the S&P 500.\n00:30 Amanda\nSo for multi- asset investors, it's I think it's just going to continue to be a challenging environment to keep up with the S&P 500. It's hard to bet against them though.\n00:43 Amanda\nBut I think for 2026, it's going to be less about valuation multiple expansion and much more about what happens to the bottom 490 or 493, however you want to calculate it. I think that market breadth story, it was a little bit elusive this year, but I think it's going to come to the forefront next year and make a difference for multi- asset investor positioning.\n01:00 Speaker A\nAmanda, that's good points. Uh is the sell-offs we're seeing in Oracle and CoreWeave over the past few weeks, is that the signal Amanda to investors to start lightning the load on the Mag 7?\n01:11 Amanda\nI don't know that it's necessarily a signal to start selling. Again, we're not trying to bet against that story. It's it's very secular, thematic, long runway, still very much early innings. So we're all in on it. I think just the reality of where valuations have moved to is a little bit, I don't want to say nonsensical, but I just said nonsensical.\n01:28 Amanda\nIt feel it feels like we need to recalibrate a little bit. And so I think what's happening here is some seasonality, selling some of those winners and hoping that we get another crack at it, maybe early in the new year.\n01:40 Speaker A\nInez, this is all one big fat bubble, right?\n01:44 Ines\nLook, uh Sozzi, uh like Amanda was saying, I mean, yes, there is this concentration uh and also Goldman Sachs uh just recently put out a note as well talking about that concentration for earnings growth for next year and concentrated in the largest uh S&P 500, the largest seven stocks of the S&P 500.\n02:05 Ines\nHowever, like what Amanda was just saying, there is this expectation that for the other 493, that you will see a bit of an acceleration of earnings growth for those companies as well. So there may be a little tiny bit of broadening out when it comes to that.\n02:22 Ines\nBut a lot of this of course is the AI theme that we've been talking about and this is what Wall Street has been bullish on, is this AI theme that AI uh driven productivity will also be supporting earnings.\n02:37 Speaker A\nUh important point here Brooke is that within these 10 stocks that have uh essentially taken over the S&P 500 and taken over the minds of investors. These companies have earnings, the earnings are good and they're still accelerating. So I guess to Amanda's point, it's going to be hard to bet against these names next year.\n02:53 Brooke\nBrian, but I think what the key point here that investors have really weighed in on is the future outlook of these companies, the guidance that they're putting out.\n03:02 Brooke\nAnd I think that's why we're seeing investors fall disappointed based upon what these companies say will be the end results or what exactly the end result could potentially be for revenue when it comes to all the AI investments that they're currently making, the spending that they're currently doing.\n03:20 Brooke\nAnd and that's why sometimes we're not seeing the same return that we see from other uh stocks, other investments because of the fact that these these uh guidance, these outlook that these companies put out just doesn't meet the very high bar that these investors have set for these sort of companies.\n03:42 Brooke\nAnd also, we are seeing a bit of a different fold. Over the past three months, we've seen Tesla, Apple, and Alphabet outperform the broader uh Mag 7.\n03:51 Brooke\nAnd that's largely because of the fact that investors seem to be liking the way in which these companies are now pursuing AI. And so we're seeing this bit of a uh a differ, you know, a difference in what we're seeing in these latter parts of the month than maybe earlier this year when we really saw Nvidia, Amazon, Microsoft, as well as Meta really lead the way within this AI tech rally, especially over the summer months.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "19:06:41",
      "Source": "Reuters",
      "Title": "Meta's Yann LeCun targets $3.5 billion valuation for new AI startup, FT reports",
      "URL": "https://finance.yahoo.com/news/metas-yann-lecun-targets-3-110641727.html",
      "Content": "Meta's Yann LeCun targets $3.5 billion valuation for new AI startup, FT reports\n\nReuters\nThu, December 18, 2025 at 3:06 AM PST 1 min read\n\nIn this article: META\n\nDec 18 (Reuters) - Meta's ( META ) outgoing chief artificial intelligence scientist Yann LeCun is holding early talks to ​raise 500 million euros ($586.00 million) for a new ‌startup that would value the AI firm at about 3 billion euros ‌ahead of its official launch, the Financial Times reported on Thursday.\n\nThe report said LeCun has tapped Alexandre LeBrun, the founder of French health tech startup Nabla, as chief executive, ⁠citing people familiar ‌with the matter.\nLeCun played a key role in developing Meta's AI ambitions, and said last ‍month that he will leave the social media giant at the end of the year to focus on a new startup ​that aims to build a new generation of ‌superintelligent AI systems.\n\nStrong funding commitments and a high valuation before launch could fuel fears of an AI bubble after industry leaders warned that enthusiasm for AI may have outstripped business fundamentals.\nThe startup plans to build AI systems using ⁠so-called world models that can ​understand the physical world. The systems ​could support applications including robotics and transport.\nLeCun did not immediately respond to a Reuters request ‍for comment.\n\nSign up for Yahoo Finance's Week in Tech\n\nBy subscribing, you are agreeing to Yahoo's\n\nTerms\n\nand\n\nPrivacy Policy\n\nSubscribe\nHe is ⁠widely regarded as one of the \"godfathers\" of deep learning, alongside Geoffrey Hinton and Yoshua Bengio — a trio ⁠that won the 2018 Turing Award, often called the Nobel Prize ‌of computing.\n($1 = 0.8532 euros)\n(Reporting by Zaheer Kachwala in ‌Bengaluru; Editing by Tasim Zahid)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "14:15:09",
      "Source": "Insider Monkey",
      "Title": "Meta Platforms, Inc. (META) Boasts Significant Upside Potential Despite Morgan Stanley Price Target Cut",
      "URL": "https://finance.yahoo.com/news/meta-platforms-inc-meta-boasts-061509893.html",
      "Content": "Meta Platforms, Inc. (META) Boasts Significant Upside Potential Despite Morgan Stanley Price Target Cut\n\nNeha Gupta\nWed, December 17, 2025 at 10:15 PM PST 2 min read\n\nIn this article: META\n\nMS\n\nGOOG\n\nMeta Platforms Inc. (NASDAQ: META ) is one of billionaire David Tepper’s top stock picks heading into 2026 . On December 11, Morgan Stanley cut its price target of Meta Platforms Inc. (NASDAQ:META) to $750 from $820 while reiterating an Overweight rating.\nMeta App 3D sign\nThe price cut comes amid concerns that sentiments around the social media networking stock have turned negative. That’s in part because of growing fears about revenue durability, operating expense uncertainty, and issues around the company’s Llama AI model. The shift in sentiment comes amid growing confidence in Alphabet’s prospects, buoyed by the tech giant’s AI initiatives.\n\nDespite the cut, the price target represents a significant upside potential. Additionally, Morgan Stanley insists Meta is one of the few companies that can leverage its data, distribution capabilities, and AI investments to generate long-term value.\nAdditionally, the stock came under pressure after the company detailed plans to develop a closed, monetizable AI model incorporating technology from Chinese tech giants, including Alibaba. Avocado is the proposed AI model slated for release next spring. Meta will reportedly retain control over the closed AI model, marking a significant departure from the open-source model it has championed over the years.\nThe Pivot towards a closed model is part of an effort to address the disappointments associated with Meta’s Llama 4 Open Source model.\n\nMeta Platforms, Inc. (NASDAQ:META) is a tech giant focused on connecting people through social media (Facebook, Instagram, WhatsApp), advertising, and building the future of the internet with virtual and augmented reality (Metaverse, Quest headsets, AI), aiming to blend digital and physical worlds for work, play, and connection.\nWhile we acknowledge the potential of META as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 12 Best Industrial Stocks to Buy According to Wall Street Analysts and 12 Best 52-Week High Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "13:39:42",
      "Source": "Insider Monkey",
      "Title": "Oracle (ORCL) Announces Q2 2026 Financial Results",
      "URL": "https://finance.yahoo.com/news/oracle-orcl-announces-q2-2026-053942435.html",
      "Content": "Oracle (ORCL) Announces Q2 2026 Financial Results\n\nBob Karr\nWed, December 17, 2025 at 9:39 PM PST 2 min read\n\nIn this article: ORCL\n\nMETA\n\nNVDA\n\nOracle Corporation (NYSE: ORCL ) is one of the Top AI and Technology Stocks to Buy According to Hedge Funds. On December 10, the company announced its Q2 2026 financial results, with total remaining performance obligations rising 438% YoY in USD to $523 billion. Notably, Oracle Corporation (NYSE:ORCL) highlighted that its RPO rose by $68 billion in Q2 2026, an increase of 15% sequentially. This was highlighted by new commitments from Meta, NVIDIA, and others.\nOracle Corporation (NYSE:ORCL)’s total quarterly revenues rose by 14% in USD and 13% in constant currency to reach $16.1 billion, amidst growth in the cloud revenues of 34% in USD and 33% in constant currency to $8.0 billion.\nThe increase in cloud and software business revenues in Q2 2026 and H1 2026 was mainly because of growth in its cloud revenues as customers purchased its applications and infrastructure technologies, and also renewed related cloud contracts. In constant currency, cloud applications made a contribution of 19% and 20% and cloud infrastructure contributed 81% and 80% to the growth in cloud revenues in Q2 2026 and H1 2026, respectively.\n\nThe company’s operating income came in at $4,731 million in Q2 2026, reflecting an increase from $4,220 million in Q2 2025 because of the increased revenues.\nAfter the release, Goldman Sachs analyst Kash Rangan reduced the price target on the company’s stock to $220 from $320, while keeping a “Neutral” rating.\nWhile we acknowledge the potential of ORCL as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 13 Cheap AI Stocks to Buy According to Analysts and 11 Unstoppable Growth Stocks to Invest in Now\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "13:39:34",
      "Source": "Insider Monkey",
      "Title": "TD Cowen Maintains Buy Rating on Meta Platforms (META) Stock",
      "URL": "https://finance.yahoo.com/news/td-cowen-maintains-buy-rating-053934792.html",
      "Content": "TD Cowen Maintains Buy Rating on Meta Platforms (META) Stock\n\nBob Karr\nWed, December 17, 2025 at 9:39 PM PST 2 min read\n\nIn this article: META\n\nMeta Platforms, Inc. (NASDAQ: META ) is one of the Top AI and Technology Stocks to Buy According to Hedge Funds. On December 4, analyst John Blackledge of TD Cowen maintained a “Buy” rating on the company’s stock, retaining the price objective of $810.00. The analyst’s rating is backed by a combination of factors highlighting Meta Platforms, Inc. (NASDAQ:META)’s strategic cost management and potential for earnings growth.\nOne of the main reasons is Meta Platforms, Inc. (NASDAQ:META)’s plan to significantly reduce its Metaverse-related expenses, which form part of the Reality Labs segment. As per the analyst, such cost reductions are anticipated to be ~30% by 2026, potentially leading to savings of $5 billion – $6 billion. Notably, this move can help partially mitigate the increased spending on AI infrastructure, which happens to be a key area of investment for Meta Platforms, Inc. (NASDAQ:META).\n\nElsewhere, Morgan Stanley reduced its price objective on the company’s stock to $750.00 from $820.00, while maintaining an “Overweight” rating. While the firm reduced its price objective, it believes that Meta Platforms, Inc. (NASDAQ:META) happens to be one of the few selected companies that could leverage leading data, distribution capabilities, and AI investments to fuel earnings power and maintain technological leadership.\nWhile we acknowledge the potential of META as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 13 Cheap AI Stocks to Buy According to Analysts and 11 Unstoppable Growth Stocks to Invest in Now\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 10
}