{
  "stock_id": "MSFT",
  "last_updated": "2025-12-18T16:12:44.731Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-19",
      "Time": "00:07:05",
      "Source": "CBS News",
      "Title": "How will the stock market perform in 2026? Wall Street pros weigh in.",
      "URL": "https://finance.yahoo.com/m/96359a46-6ce3-3868-91eb-9a802a738c35/how-will-the-stock-market.html",
      "Content": "How will the stock market perform in 2026? Wall Street pros weigh in.\n\nMary Cunningham\nThu, December 18, 2025 at 8:07 AM PST 5 min read\n\nIn this article: ^GSPC\n\n^DJI\n\n^IXIC\n\nGOOG\n\nMSFT\n\nThe U.S. stock market scaled new heights in 2025, as investors largely tuned out concerns about the Trump administration's sharply higher tariffs and shrugged off fears of a financial market bubble among artificial intelligence companies.\nThe S&P 500 stock index is up roughly 15% this year through Dec. 17— a strong performance, although lower than the heady 23% jump posted by the broad-based index in 2024. The S&P 500 has climbed an average of 13% per year over the last decade, according to Mark Luschini, chief investment strategist at wealth management firm Janney Montgomery Scott.\n\nThe Nasdaq Composite, which includes tech heavy-hitters such as Alphabet, Microsoft and Nvidia, has climbed more than 18% this year, while the blue-chip Dow Jones Industrial Average is up more than 13%.\nThe key question: Will such investor exuberance spill over into 2026, especially as concerns about an AI bubble percolate?\n\"I think conditions remain relatively fertile for stock prices to do OK overall,\" Luschini told CBS News. \"The big risk is that the whole AI narrative starts to lose a little of its viscosity.\"\nOther forecasters are also expecting a strong stock market performance in 2026. David Lefkowitz, head of U.S. equities at UBS Global Wealth Management, expects the S&P 500, which closed Monday trading at 6,816 points, to reach 7,300 points by June of next year and 7,700 by the end of 2026. That would represent a roughly 15% gain over the next year.\n\nJ.P. Morgan said in a November research report that it expects the S&P 500 to rise 13% to 15% next year, boosted by robust corporate earnings growth, and to carry that strength into 2027.\nWhat will drive stocks in 2026?\nSeveral catalysts are expected to drive the stock market in 2026. Among them is another year of strong corporate earnings, particularly in tech, analysts say. BofA Global Research expects overall earnings to grow in the mid-double digits next year.\n\"Multiple expansion and earnings growth both pushed the S&P 500 up 15% this year,\" the securities firm said in a market forecast. \"In 2026, earnings will do the lift.\"\nThe AI boom should also help fuel the stock market, with a wave of capital investments likely to drive up tech stocks, analysts note. AI capital expenditures from major tech companies including Alphabet, Amazon, Meta, Microsoft and Oracle are expected to approach $520 billion in 2026, Jeff Buchbinder, chief equity strategist for LPL Financial, said in a research note.\nAnother area expected to benefit from the AI boom is the industrials sector, which is supplying the equipment necessary for data centers .\n\nStory Continues\nGrowth, however, won't be limited to tech or AI-adjacent sectors. Indeed, Bret Kenwell, a U.S. investment and options analyst at eToro, said a broadening of the bull market could be in the cards, with all 11 sectors in the S&P 500 expected to rise next year.\n\"If it happens, it'll have been five years since we've seen it,\" he said.\n\nAdam Crisafulli, head of Vital Knowledge, and Luschini both expect a good year for financial services stocks. Banks have traded very well this year amid an easier regulatory backdrop and a jump in mergers and acquisitions.\nAnother tailwind for the stock market could be softer monetary policy and a more dovish Federal Reserve, Kenwell said, with President Trump soon expected to nominate a new central bank chief before Jerome Powell's term ends in May.\n\"It's kind of a when, not if, rate-cut situation with the Fed,\" Kenwell said.\nStill, analysts and major banks expect a slowdown in the pace of interest rate cuts. In a November report, J.P. Morgan forecasts one more interest rate cut in January before an extended pause and said that if the central bank further eases monetary policy, the S&P 500 could surpass 8,000 points in 2026.\n\nIs my money safe?\nThe biggest shadow looming over the stock market next year is what will happen with artificial intelligence.\nAI and tech stocks have been the propelling force behind equity gains this year, with earnings growth from the \"Magnificent Seven\" far outpacing other companies in the S&P 500. That strength has been accompanied by a boom in capital expenditures, as investors rush to invest in data center construction and other technology infrastructure to meet rising demand for AI.\n\"Robust demand for cloud services and data center capacity shows no signs of slowing,\" Janus Henderson portfolio manager Jeremiah Buckley said in his company's 2026 outlook on capital investment.\nAmid all the hype, some investors are concerned about whether AI's ascendance could start to falter next year, leading to a market correction or the bursting of what some consider to be an AI bubble.\n\nIn its 2026 outlook, Vanguard said it expects U.S. technology stocks to maintain momentum given the rate of investment and anticipated earnings growth. At the same time, the investment management company noted that \"risks are growing\" amid all of the AI optimism.\nCrisafulli said tech gains have historically moved in unison, but that started to splinter in November, when Alphabet shares surged 14% following the release of Google Gemini 3, while the rest of the Nasdaq slumped . The continued fracturing of the AI narrative is one of the headwinds he expects investors will have to face in 2026.\n\"It's not so much the bubbles bursting,\" he said. \"It's more just people looking at it in a more nuanced way.\"\nStill, as usual investors should expect some turbulence. Minor pullbacks or flat trading periods are possible, especially after several months of consecutive growth in the S&P 500, according to Kenwell.\n\"When we look at 2025, it was a good reminder that volatility is in play, and that's something that certainly can be back in the cards in 2026,\" he said.\nWhat to expect from Trump's address to the nation\nMore details emerge about Rob Reiner and wife Michele's killings\nNew surveillance video shows Nick Reiner before his arrest\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:15:49",
      "Source": "24/7 Wall St.",
      "Title": "China Prepares to Wreck US AI Industry",
      "URL": "https://finance.yahoo.com/m/52060673-6d88-33ef-9d62-758d25b5efeb/china-prepares-to-wreck-us-ai.html",
      "Content": "China Prepares to Wreck US AI Industry\n\nDouglas A. McIntyre\nThu, December 18, 2025 at 7:15 AM PST 4 min read\n\nIn this article: META\n\nGOOG\n\nNVDA\n\nORCL\n\nMSFT\n\nThe math is simple. It starts with three facts. China has spent massive amounts to create very low-priced electricity at a rate several times the U.S. pace. It has built massive dams. The best example is the Motuo Hydropower Station on the Yarlung Tsangpo River in Tibet. No other nation could build a colossal project so fast. And China has extraordinary solar power supply. Do the large Chinese artificial intelligence (AI) companies pay for these? No. The central government largely does. China is a dictatorship, so things happen that way.\n\n24/7 Wall St. Key Points There are three ways China is poised to leap ahead in artificial intelligence.\nThe United States faces many headwinds in creating AI infrastructure.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:12:00",
      "Source": "PR Newswire",
      "Title": "SIS, LLC Announces Successful Go-Live of Microsoft Dynamics 365 and SIS Construct 365 at Clyde Companies",
      "URL": "https://finance.yahoo.com/news/sis-llc-announces-successful-live-151200689.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nSIS, LLC Announces Successful Go-Live of Microsoft Dynamics 365 and SIS Construct 365 at Clyde Companies\n\nPR Newswire\nThu, December 18, 2025 at 7:12 AM PST 2 min read\n\nIn this article: MSFT\n\nDULUTH, Ga. , Dec. 18, 2025 /PRNewswire/ -- SIS, LLC, a leading provider of construction-focused ERP solutions, today announced the successful go-live of Microsoft Dynamics 365 with SIS Construct 365 at Clyde Companies. The launch marks a major milestone in Clyde Companies' digital transformation, providing enhanced operational efficiency, streamlined project management, and real-time visibility across its diverse construction and materials businesses.\nThe deployment delivers a smooth transition to a modern, cloud-based ERP platform built specifically for the construction industry. By combining the enterprise-grade capabilities of Microsoft Dynamics 365 with the specialized functionality of SIS Construct 365, Clyde Companies is positioned to optimize workflows, strengthen financial controls, and elevate decision-making in an increasingly competitive market.\n\n\"We are excited to celebrate this go-live with Clyde Companies, which reflects a strong collaborative effort focused on operational excellence,\" said Mark Kershteyn, Partner at SIS, LLC . \"SIS Construct 365, built on the Microsoft Dynamics platform, equips construction firms with the advanced tools they need to thrive in today's fast-moving environment. We're thrilled to see the immediate value it's delivering to their teams.\"\nJeremy Hafen, CEO & President of Clyde Companies , added, \"Implementing Microsoft Dynamics 365 and SIS Construct 365 has transformed how we operate. SIS Construct 365 was essential to making this solution successful. With greater automation and integrated data, our teams can concentrate on delivering outstanding projects instead of managing administrative tasks. This partnership sets the stage for long-term growth and innovation.\"\n\nTed Kempf, Director, AI Business Process Sales Lead Professional Services - Americas at Microsoft , commented, \"Microsoft is dedicated to empowering organizations like Clyde Companies with intelligent, cloud-based solutions. The go-live of Dynamics 365 alongside SIS Construct 365 highlights how our partners bring industry-specific value to customers, supporting both operational excellence and digital transformation.\"\nThe successful launch underscores SIS's deep expertise in delivering ERP solutions tailored to the construction sector, ensuring scalability, compliance, and high performance for growing organizations.\nAbout Clyde Companies\nClyde Companies is a family-owned business headquartered in Orem, Utah, with nearly 100 years of experience in building a better community. With more than 6,000 employees and operations across 15 states, our family of companies delivers excellence in construction, building materials, insurance, and real estate development. Learn more at www.clydeinc.com .\n\nStory Continues\nMedia Contact:\nNate McDonald\nNamcdonald@clydeinc.com\n(801) 694-0294\nAbout SIS, LLC\nSIS is a premier provider of construction ERP software, offering SIS Construct 365, a comprehensive suite built on Microsoft Dynamics 365. Committed to innovation and customer success, SIS helps construction companies streamline operations, boost productivity, and increase profitability. Learn more at www.sisn.com .\nMedia Contact:\nEric Petrucelli\ninfo@sisn.com\n(888) 844-6599\nView original content to download multimedia: https://www.prnewswire.com/news-releases/sis-llc-announces-successful-go-live-of-microsoft-dynamics-365-and-sis-construct-365-at-clyde-companies-302646008.html\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:10:26",
      "Source": "24/7 Wall St.",
      "Title": "Microsoft Looks Like a “Table Pounder” After Dipping on AI Worries",
      "URL": "https://finance.yahoo.com/m/86b3260d-c93c-323a-878a-958a2eeba1fc/microsoft-looks-like-a-%E2%80%9Ctable.html",
      "Content": "Microsoft Looks Like a “Table Pounder” After Dipping on AI Worries\n\nJoey Frenette\nThu, December 18, 2025 at 7:10 AM PST 5 min read\n\nIn this article: MSFT\n\nQuick Read Microsoft stock is down over 12% from recent highs amid AI spending concerns and competition from Google’s Gemini 3.0.\nThe company denied reports of reduced AI sales quotas following an article from The Information.\nMicrosoft has its own AI team led by Mustafa Suleyman and can reduce OpenAI dependence through Azure and its MAI model.\nIf you’re thinking about retiring or know someone who is, there are three quick questions causing many Americans to realize they can retire earlier than expected. take 5 minutes to learn more here\n\nIf you've been waiting for an opportunity to pick up shares of Microsoft (NASDAQ:MSFT) on the cheap amid broad AI and tech jitters, here's your chance. The stock has been beaten down in recent months, now off more than 12% from its recent all-time highs. And while the still seemingly frothy 33.89 times trailing price-to-earnings (P/E) multiple doesn't seem to suggest Microsoft shares are a \"table pounder,\" I do think that the premier hyperscaler remains one of the best bets of the Magnificent Seven.\nOf course, its close ties to OpenAI used to be a positive. Nowadays, it's a negative, with ChatGPT losing a bit of ground in the AI race to the likes of Alphabet (NASDAQ:GOOG), which has seemingly caught up with the release of its well-received Gemini 3.0 model.\n\nBut just because Google Gemini and the hardware running behind the scenes (Google TPUs) are having their moment, it does not mean we should start treating OpenAI as a laggard. Is the AI innovator behind ChatGPT a bit heavy on the debt, with more than a handful of circular deals?\nAI spending fears are weighing on the hyperscalers, Microsoft included Sure, but just because we've got reminders of the internet bubble and dot-com bust does not mean we're in for an exact repeat. Of course, heavy debt loads and extreme spending might be a concern for many. And circular dealmaking in the AI scene makes things a tad trickier and perhaps scarier for those with AI bubble fears.\n\nHowever, I think the big question is whether or not the AI efforts are going to pay off. If they do, leverage might work out heavily in the AI titan's favor in a big-time way. Of course, it's hard to tell how the AI frenzy ends, when it will end, and if the pain will be as bad as the dot-com bust. Either way, I think investors might wish to treat Microsoft as more than just an OpenAI proxy.\nAt the end of the day, Microsoft has been making its own investments to lessen its dependence on ChatGPT. Even if a worst-case scenario happens and OpenAI runs into a bit of financial trouble at some point down the road while giving up more ground to rival AI models, Microsoft can go its own way.\n\nStory Continues\nOpenAI aside, Microsoft has plenty of its own AI firepower Azure is the star of the show, and Microsoft can swap out the model running behind the scenes with another one, including its own (think the MAI model). With a powerful, arguably one of the most powerful, AI teams in the world, headed by a genius in Mustafa Suleyman, I'd argue that Microsoft's own AI dream team is worth the premium price tag.\n\nEither way, Microsoft has more than one racer in the AI race, and that improves the enterprise software behemoth's chances of having a winner on the road to AGI (artificial general intelligence).\nEither way, I think far too many investors are doubting OpenAI. But with the release of GPT-5.2, it's clear that OpenAI is a hungry company that's willing to do whatever it takes to keep that AI ball rolling. If anything, I'd argue that Gemini 3.0 and the \"code red\" it gave OpenAI is a good thing. It might be the nudge the firm needs to sprint that much faster.\nIn any case, I continue to view OpenAI as a massive positive for Microsoft that the market will appreciate again, perhaps in due time, or after the release of GPT-6, which one has to think will be smoother and far more impressive than the launch of GPT-5.\n\nWhat about jitters over that report on lower AI sales quotas? Finally, there's renewed anxiety that Microsoft's AI sales will miss the mark following a report from The Information that some divisions reduced their sales growth quotas.\nThe company has since denied the report, but, nevertheless, it seems like the investor unease has stuck around. If a future quarter proves sales jitters are unwarranted, perhaps Microsoft stock is unfairly sold off right here. In any case, I think 2026 could be a huge year for AI monetization, and few firms, I think, are better prepared than Microsoft.\n\nWhether we're talking about the OpenAI worries, broad bubble fears, or The Information report, I think there's too much negativity in Microsoft stock right here. And that might make its stock one of the bigger \"table pounders\" for the new year.\nThe New Report Shaking Up Retirement Plans You may think retirement is about picking the best stocks or ETFs, but you’d be wrong. Even great investments can be a liability in retirement. It’s a simple difference between accumulating vs distributing, and it makes all the difference.\nThe good news? After answering three quick questions many Americans are reworking their portfolios and finding they can retire earlier than expected. If you’re thinking about retiring or know someone who is, take 5 minutes to learn more here .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:59:57",
      "Source": "MT Newswires",
      "Title": "Cognizant Technology, Microsoft Sign Multiyear Partnership to Build Industry-Grade AI Solutions",
      "URL": "https://finance.yahoo.com/news/cognizant-technology-microsoft-sign-multiyear-145957743.html",
      "Content": "PREMIUM\nCognizant Technology, Microsoft Sign Multiyear Partnership to Build Industry-Grade AI Solutions\n\nMT Newswires\nThu, December 18, 2025 at 6:59 AM PST\n\nIn this article: CTSH\n\nMSFT\n\nCognizant Technology Solutions (CTSH) said Thursday it has agreed to a multiyear partnership with Mi\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:00:00",
      "Source": "PR Newswire",
      "Title": "Cognizant and Microsoft Expand Partnership to Advance AI Transformation and Frontier Firm Experiences",
      "URL": "https://finance.yahoo.com/news/cognizant-microsoft-expand-partnership-advance-140000135.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nCognizant and Microsoft Expand Partnership to Advance AI Transformation and Frontier Firm Experiences\n\nPR Newswire\nThu, December 18, 2025 at 6:00 AM PST 2 min read\n\nIn this article: CTSH\n\nMSFT\n\nThe collaboration will co-innovate to deliver AI-powered solutions, combining Microsoft's trusted cloud with Cognizant's industry platforms to help organizations redefine work and scale innovation.\nTEANECK, N.J. , Dec. 18, 2025 /PRNewswire/ -- Cognizant (NASDAQ: CTSH) today announced a multi-year strategic partnership with Microsoft to help global enterprises become AI-powered frontier firms: organizations that redefine work, unlock new value, and scale innovation responsibly.\nUnder this agreement, Cognizant and Microsoft will co-build industry-grade AI solutions, jointly co-sell globally and collaborate on large-scale deals across key sectors including Financial Services, Healthcare and Life Sciences, Retail, and Manufacturing.\nThe partnership will embed agentic AI and Copilot powered by Work IQ, Foundry IQ and Fabric IQ capabilities into mission-critical workflows, accelerating productivity, customer experience and operational resilience. This partnership also expands on the Cognizant Neuro ® AI Suite of offerings Cognizant is bringing to the market which leverage Microsoft cloud and AI services.\n\n\"Today, AI underpins and shapes every transformation program we drive,\" said Ravi Kumar S, CEO, Cognizant. \"We will co-build scalable solutions, co-sell globally and partner on large deals that deliver measurable outcomes for our clients by aligning this partnership to our three-vector AI builder strategy.\nKumar continued, \"By combining Microsoft's trusted cloud and AI with Cognizant's industry platforms, we are strongly positioned to help clients solve the last-mile challenge of scaling AI across the enterprise.\"\nCognizant will scale Microsoft 365 Copilot and GitHub Copilot adoption across delivery and consulting teams, while upskilling associates on Microsoft Azure, Azure AI Foundry, and related technologies, creating an agile, AI-fluent workforce. The collaboration will also harness Cognizant's proprietary platforms, including TriZetto, Skygrade, and FlowSource™, to deliver sector-specific advancements and modernize software engineering at scale.\n\n\"Cognizant's ability to marry deep industry expertise with bold innovation makes them an outstanding partner as we co-innovate to help enterprises become AI-powered Frontier Firms,\" said Judson Althoff, Chief Executive Officer of Microsoft's commercial business. \"By combining Microsoft's trusted cloud and agentic AI capabilities with Cognizant's platforms and delivery scale, we will accelerate the creation of industry-specific solutions that are embedded in the flow of work and unlock transformative value for our joint customers around the world.\"\n\nStory Continues\nFor more information about Cognizant's partnership with Microsoft, visit this page .\nAbout Cognizant\nCognizant (Nasdaq: CTSH) engineers modern businesses. We help our clients modernize technology, reimagine processes and transform experiences so they can stay ahead in our fast-changing world. Together, we're improving everyday life. See how at www.cognizant.com or @cognizant.\nFor more information, contact:\nU.S.\nName Ben Gorelick\nEmail benjamin.gorelick@cognizant.com\n\nEurope / APAC\nName Sarah Douglas\nEmail sarah.douglas@cognizant.com\n\nIndia\nName Vipin Nair\nEmail Vipin.nair@cognizant.com\n\nView original content to download multimedia: https://www.prnewswire.com/news-releases/cognizant-and-microsoft-expand-partnership-to-advance-ai-transformation-and-frontier-firm-experiences-302645413.html\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:30:04",
      "Source": "24/7 Wall St.",
      "Title": "Microsoft (NASDAQ: MSFT) Stock Price Prediction for 2025: Where Will It Be in 1 Year",
      "URL": "https://finance.yahoo.com/m/fde91597-c2ad-3dbf-a423-4d0acc661d47/microsoft-%28nasdaq%3A-msft%29.html",
      "Content": "Microsoft (NASDAQ: MSFT) Stock Price Prediction for 2025: Where Will It Be in 1 Year\n\nJoel South\nThu, December 18, 2025 at 5:30 AM PST 5 min read\n\nIn this article: AMZN\n\nORCL\n\nMSFT\n\nKey Points in This Article: Microsoft is dedicating significant capex to AI and cloud infrastructure in order to compete with other tech firms.\nMicrosoft’s gaming segment grew 44% last year, providing significant revenue to complement its software, cloud and AI business lines.\nIf you’re thinking about retiring or know someone who is, there are three quick questions causing many Americans to realize they can retire earlier than expected. take 5 minutes to learn more here\n\nShares of Microsoft ( NASDAQ:MSFT ) lost 0.03% over the past five trading sessions after losing 0.27% the five prior. That brings MSFT's year-to-date gain to 13.75%, including a more than 3r4% gain since its year-to-date low on April 8.\nWhen the Magnificent Seven member reported FY 2026 Q1 earnings on Oct. 29, shares fell despite beating on EPS and revenue. The company announced earnings of $3.72 per share versus analysts' expectations of $3.67, and quarterly revenue of $77.67 billion versus analysts' expectations of $75.33 billion.\nOn Oct. 1, the company announced that it was increasing its Xbox Game Pass subscription by 50%. In its last fiscal year, Microsoft saw more than 8% of revenue derived from its gaming segment, which now boasts 50 million monthly active subscribers and nearly $5 billion in YoY revenue.\n\nMicrosoft's decision in May fire 6,000 employees — or 3% of its workforce — signals the tech giant is serious about cost discipline amid economic uncertainty. With analysts eyeing sustained cloud demand, 24/7 Wall St. conducted analysis to explore whether Microsoft can maintain its upward trajectory and drive long-term growth.\nWhy Invest in Microsoft Microsoft navigates challenges, but remains a prime investment due to its AI and cloud dominance. Third-quarter earnings showcased robust demand for its Intelligent Cloud segment, though tariff risks linger. Microsoft’s $80 billion cash reserve fuels its $80 billion investments in cloud and AI infrastructure, with over half in the U.S.\n\nIts Microsoft 365 Copilot, adopted by over 70% of Fortune 500 firms, drives productivity revenue, positioning Microsoft to capture the AI market’s 37% compounded annual growth predicted through 2030. Similarly, partnerships with Oracle ( NYSE:ORCL ) for multi-cloud solutions bolster its competitiveness against Amazon 's ( NASDAQ:AMZN ) AWS.\nIn June, it was reported that the company will be expanding its AI and cloud investments in Switzerland, committing $400 million to expand its data center infrastructure in the European nation. The additional capacity is expected to support more than 50,000 current customers and expand the availability of AI services for more sectors, including health care, finance government. Microsoft is capitalizing on its Azure platform’s momentum as revenue jumped 39% in FY25 Q4, driven by AI services.\n\nStory Continues\nWhen Microsoft last reported earnings, EPS beat by 7.40% and revenue beat by 2.37%. The EPS beat marked the 15th time in the past 16 quarters that the company surpassed estimates, with EPS coming in at $3.46 versus the consensus forecast of $3.20.\nMicrosoft (MSFT) As a Company Microsoft reported a gross profit of $49.8 billion, up 14% year-over-year, with gross margins at 68%, driven by strong cloud and AI demand. The company committed to continuing spending on capital expenditures, focusing on AI data center expansion to meet enterprise needs. Analysts expect the company's capex to remain elevated to support Microsoft’s cloud infrastructure growth.\n\nTariff uncertainties do pose risks, even with the pause on China, as supply chain cost pressures for server hardware are not eliminated. Microsoft’s operating income of $32 billion was tempered by a 5% rise in operating expenses, reflecting heavy AI R&D investments. Despite no revenue from its $13 billion OpenAI stake, Microsoft reported $42.4 billion in Microsoft Cloud revenue, up 20% year-over-year.\nBeyond cloud, Microsoft’s gaming segment grew 44% with 43 points of the gain coming from its acquisition of Activision, but bolstered by Xbox content and Bethesda’s Starfield expansion. A partnership with Oracle for multicloud solutions strengthens its enterprise offerings, further diversifying its revenue. Wall Street projects Q4 revenue of $73.8 billion, up 14%, driven by Microsoft's AI and cloud momentum.\n\nMicrosoft As a Stock Broadly, 34 Wall Street analysts' remain bullish, with 32 analysts covering MSFT assigning it a \"Buy\" rating, two assigning it a \"Hold\" rating and none assigning it a \"Sell\" rating. Overall, the stock receives a consensus \"Strong Buy\" rating. Wall Street's price targets cover a significant range, spanning $500 per share on the low end to $700 per share on the high end. The median one-year price target for MSFT is $632.22, which represents 32.78% potential upside from today's share price.\nInstitutional ownership currently stands at 73.74%, with three of the four largest buy-side firms — Vanguard, BlackRock and State Street — holding a collective 1.570 billion shares of Microsoft.\nEstimate\nPrice Target\n%Change From Current Price\nLow\n$500\n5.01%\nMedian\n$632.22\n32.17%\nHigh\n$700\n47.02%\n\nMicrosoft (MSFT) Stock Prediction in 2025 Microsoft’s strong Azure revenue growth positions it for cloud and AI market gains. However, $20 billion quarterly capex and tariff risks require caution. Its $80 billion cash reserve and Oracle partnership offer stability, making MSFT stock a buy for growth investors, even as valuation concerns linger.\n\n24/7 Wall St. ’s year-end price target for Microsoft is $563.64, implying upside potential of 18.38% from the stock's current price. This cautious target reflects Azure’s strength and FY26 Q1 revenue guidance, balanced against the need for higher capex spending and potential supply chain disruptions, positioning it at a realistic estimate of its leading presence in the space.\nData Shows One Habit Doubles American’s Savings And Boosts Retirement Most Americans drastically underestimate how much they need to retire and overestimate how prepared they are. But data shows that people with one habit have more than double the savings of those who don’t.\nAnd no, it’s got nothing to do with increasing your income, savings, clipping coupons, or even cutting back on your lifestyle. It’s much more straightforward (and powerful) than any of that. Frankly, it’s shocking more people don’t adopt the habit given how easy it is .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:01:35",
      "Source": "GuruFocus.com",
      "Title": "Microsoft Pullback Seen as Buying Opportunity After Recent Sell-Off",
      "URL": "https://finance.yahoo.com/news/microsoft-pullback-seen-buying-opportunity-130135082.html",
      "Content": "Microsoft Pullback Seen as Buying Opportunity After Recent Sell-Off\n\nFaizan Farooque\nThu, December 18, 2025 at 5:01 AM PST 1 min read\n\nIn this article: MSFT\n\nThis article first appeared on GuruFocus .\nMicrosoft ( MSFT , Financials ) is drawing renewed interest from long term investors after a recent sell off that followed elevated capital spending tied to artificial intelligence infrastructure.\nWarning! GuruFocus has detected 3 Warning Sign with MSFT.\nIs MSFT fairly valued? Test your thesis with our free DCF calculator.\n\nMicrosoft's fiscal first-quarter capital expenditures were higher than projected as it invested extensively in data centers and AI. While expenditure hurt near-term optimism, cloud revenue grew strongly. Azure revenue increased 28% year over year, indicating sustained demand for cloud and AI services.\nMicrosoft also revealed a 50% rise in commercial outstanding performance commitments to approximately $400 billion. Rising capital intensity is mitigated by the expanding backlog, which increases revenue visibility.\nThe firm generates substantial cash flow from its cloud computing, corporate software, productivity tools, and gaming business strategy. Microsoft's balance sheet strength is an advantage as companies expand in AI, investors say.\nTechnical support at recent lows suggests modest downside danger, say market participants. Investors are eyeing earnings reports for margin trends and capital discipline as cloud and AI demand remains strong.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:00:00",
      "Source": "PR Newswire",
      "Title": "Data Center Capex Up 59 Percent on Continued AI Investment in 3Q 2025, According to Dell'Oro Group",
      "URL": "https://finance.yahoo.com/news/data-center-capex-59-percent-130000640.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nData Center Capex Up 59 Percent on Continued AI Investment in 3Q 2025, According to Dell'Oro Group\n\nPR Newswire\nThu, December 18, 2025 at 5:00 AM PST 3 min read\n\nIn this article: AMZN\n\nGOOG\n\nORCL\n\nMETA\n\nMSFT\n\nAccelerated Server Demand and Hyperscale Cloud expansion Drive Broad-based Infrastructure Spending\nREDWOOD CITY, Calif. , Dec. 18, 2025 /PRNewswire/ -- According to a recently published report by Dell'Oro Group, the trusted source for market information about the telecommunications, security, networks, and data center industries, worldwide data center capital expenditures increased 59 percent year-over-year, marking the eighth consecutive quarter of double-digit growth as the AI investment cycle continues to broaden beyond early, training-focused deployments.\n\"The Top 4 US cloud service providers—Amazon, Google, Meta, and Microsoft—continue to raise data center capex expectations for 2025, supported by increased investments in both AI and general-purpose infrastructure. Oracle is also on track to double its data center capex this year as it expands capacity for the Stargate project,\" said Baron Fung, Senior Research Director at Dell'Oro Group. \"What is notable this cycle is not just the pace of spending, but the expanding scope of investment, as cloud providers simultaneously scale accelerated compute, general-purpose servers, and the supporting infrastructure required to deploy AI at production scale. Accelerated server spending surged in the quarter, driven by the ramp of NVIDIA Blackwell Ultra, along with custom accelerator platforms across US hyperscalers, neo cloud providers, and sovereign AI deployments. At the same time, cloud service providers are increasing emphasis on greater capex discipline by optimizing asset depreciation and lifecycles to ensure healthy cash flow,\" explained Fung.\n\nAdditional highlights from the 3Q 2025 Data Center IT Capex Quarterly Report:\nThe global data center capex growth outlook was raised through 2026, reflecting sustained hyperscale investment and continued prioritization of AI infrastructure.\nDemand for general-purpose servers strengthened as cloud providers expanded compute and storage capacity to support growing cloud services and inference-heavy AI workloads.\nDell led all server OEMs in revenue, followed by HPE and Lenovo, gaining share on strong NVIDIA Blackwell shipments and a refreshed x86 portfolio, while white-box vendors captured the majority of server shipments, supported by hyperscale AI deployments and elevated general-purpose server demand.\nAbout the Report\nDell'Oro Group's Data Center IT Capex Quarterly Report details the data center infrastructure capital expenditures of each of the ten largest Cloud service providers, as well as the Rest-of-Cloud, Telco, and Enterprise customer segments. Allocation of the data center infrastructure capex for general-purpose and accelerated servers, storage systems, and other auxiliary data center equipment is provided. The report also discusses market trends, drivers of the leading Cloud service providers' capex growth during the quarter, and the outlook for the next year. To purchase this report, please contact us at dgsales@delloro.com.\n\nStory Continues\nAbout Dell'Oro Group\nDell'Oro Group is a market research firm that specializes in strategic competitive analysis in the telecommunications, security, enterprise networks infrastructure, and data center markets. Our firm provides in-depth quantitative data and qualitative analysis to facilitate critical, fact-based business decisions. For more information, contact Dell'Oro Group at +1.650.622.9400 or visit www.delloro.com .\nView original content to download multimedia: https://www.prnewswire.com/news-releases/data-center-capex-up-59-percent-on-continued-ai-investment-in-3q-2025-according-to-delloro-group-302642624.html\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:46:31",
      "Source": "Investor's Business Daily",
      "Title": "Data Centers Are Booming. So Is A Backlash Over Electricity Rates.",
      "URL": "https://finance.yahoo.com/m/21efdd73-59b7-33fc-8e84-fd1b3ad8eb99/data-centers-are-booming.-so.html",
      "Content": "Data Centers Are Booming. So Is A Backlash Over Electricity Rates.\n\nALEXIS GARCIA and KIT NORTON\nThu, December 18, 2025 at 4:46 AM PST 16 min read\n\nIn this article: AMZN\n\nMSFT\n\nGOOG\n\nMETA\n\nORCL\n\nThe data centers critical to the nation's AI ambitions are spawning local political battles as rising energy costs frustrate communities. What investors need to know about data center NIMBYism.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:03:00",
      "Source": "Barrons.com",
      "Title": "AI Fears Are Fickle. Why Oracle Woes Present a Stock Market Opportunity and 5 Other Things to Know Today.",
      "URL": "https://finance.yahoo.com/m/235c0204-a4df-33b4-a656-d9bb079fdd95/ai-fears-are-fickle.-why.html",
      "Content": "AI Fears Are Fickle. Why Oracle Woes Present a Stock Market Opportunity and 5 Other Things to Know Today.\n\nBarrons.com\nThu, December 18, 2025 at 4:03 AM PST 8 min read\n\nIn this article: OWL\n\nMU\n\nMSFT\n\nAMZN\n\nORCL\n\nMicron Earnings Impress Wall Street, Trump’s prediction of an economic boom may be wrong, more news to start your day.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:01:30",
      "Source": "GuruFocus.com",
      "Title": "Nebius Shares Plunge Despite Launch of AI Cloud 3.1 with NVIDIA Tech",
      "URL": "https://finance.yahoo.com/news/nebius-shares-plunge-despite-launch-113436676.html",
      "Content": "Nebius Shares Plunge Despite Launch of AI Cloud 3.1 with NVIDIA Tech\n\nNauman Khan\nThu, December 18, 2025 at 4:01 AM PST 1 min read\n\nIn this article: NBIS\n\nMSFT\n\nNVDA\n\nThis article first appeared on GuruFocus .\nNebius ( NASDAQ:NBIS ) shares plunged about 6% Wednesday after the company unveiled Nebius AI Cloud 3.1, platform upgrade featuring NVIDIA (NVDA)'s Blackwell Ultra compute and new operational tools.\nThe Amsterdam-based cloud provider said 3.1 adds Capacity Blocks, a real-time Capacity Dashboard, project-level quotas and Microsoft Entra ID integration to help enterprises scale GPU workloads. Nebius also noted it operates GB300 NVL72 and HGX B300 systems and claims production runs on NVL72 with 800 Gbps Quantum-X800 InfiniBand.\n\nWarning! GuruFocus has detected 5 Warning Signs with NBIS.\nIs NBIS fairly valued? Test your thesis with our free DCF calculator.\nDespite the product news, investors sold the stock. Traders flagged concerns over the company's lofty valuation and profitability trajectory: Nebius has surged more than 175% over the past year while trading on a P/E around 165 and remains unprofitable this year.\nThe market-observers indicated that the technological upgrade could push up the long-term demand, but have no significant effect on the near-term margins or cash burn.\nNebius is experiencing a terrible top line increase - the revenue increased substantially in the last quarter, but some investors seek evidence that the profitability can be maintained, and that the customers are committed to multi-year contracts before they will begin to offer to buy the shares at a premium.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:00:39",
      "Source": "Yahoo Finance Video",
      "Title": "Amazon, Apple, Google, etc.: Why the Mag 7 needs to 'recalibrate'",
      "URL": "https://finance.yahoo.com/video/amazon-apple-google-etc-why-120039409.html",
      "Content": "Amazon, Apple, Google, etc.: Why the Mag 7 needs to 'recalibrate'\n\nYahoo Finance Video and Brian Sozzi\nThu, December 18, 2025 at 4:00 AM PST\n\nIn this video: TSLA\n\n^GSPC\n\nAAPL\n\nGOOG\n\nMSFT\n\nThe S&P 500 ( ^GSPC ) is concentrated primarily in the top ten technology stocks, according to Barclays.\nPNC Asset Management Group chief investment officer Amanda Agati, Yahoo Finance Senior Business Reporter Ines Ferré , and Yahoo Finance Senior Reporter Brooke DiPalma join Opening Bid host Brian Sozzi to discuss the market's concentration in tech and whether it's time for investors to start selling the \"Magnificent Seven.\"\nTo watch more expert insights and analysis on the latest market action, check out more Opening Bid .\n\nVideo Transcript\n\n00:00 Speaker A\nWhat I mentioned at the top about how much concentration risk there is in the S&P 500. What does that mean exactly for investors as we gear up for next year?\n00:10 Amanda\nWell, it's a great question and it's great to be with all of you again.\n00:15 Amanda\nIt's tough out there. Uh certainly for active managers to try and own enough of those top seven or top 10 names to really make a difference in terms of trying to keep up with, let alone outperform the S&P 500.\n00:30 Amanda\nSo for multi- asset investors, it's I think it's just going to continue to be a challenging environment to keep up with the S&P 500. It's hard to bet against them though.\n00:43 Amanda\nBut I think for 2026, it's going to be less about valuation multiple expansion and much more about what happens to the bottom 490 or 493, however you want to calculate it. I think that market breadth story, it was a little bit elusive this year, but I think it's going to come to the forefront next year and make a difference for multi- asset investor positioning.\n01:00 Speaker A\nAmanda, that's good points. Uh is the sell-offs we're seeing in Oracle and CoreWeave over the past few weeks, is that the signal Amanda to investors to start lightning the load on the Mag 7?\n01:11 Amanda\nI don't know that it's necessarily a signal to start selling. Again, we're not trying to bet against that story. It's it's very secular, thematic, long runway, still very much early innings. So we're all in on it. I think just the reality of where valuations have moved to is a little bit, I don't want to say nonsensical, but I just said nonsensical.\n01:28 Amanda\nIt feel it feels like we need to recalibrate a little bit. And so I think what's happening here is some seasonality, selling some of those winners and hoping that we get another crack at it, maybe early in the new year.\n01:40 Speaker A\nInez, this is all one big fat bubble, right?\n01:44 Ines\nLook, uh Sozzi, uh like Amanda was saying, I mean, yes, there is this concentration uh and also Goldman Sachs uh just recently put out a note as well talking about that concentration for earnings growth for next year and concentrated in the largest uh S&P 500, the largest seven stocks of the S&P 500.\n02:05 Ines\nHowever, like what Amanda was just saying, there is this expectation that for the other 493, that you will see a bit of an acceleration of earnings growth for those companies as well. So there may be a little tiny bit of broadening out when it comes to that.\n02:22 Ines\nBut a lot of this of course is the AI theme that we've been talking about and this is what Wall Street has been bullish on, is this AI theme that AI uh driven productivity will also be supporting earnings.\n02:37 Speaker A\nUh important point here Brooke is that within these 10 stocks that have uh essentially taken over the S&P 500 and taken over the minds of investors. These companies have earnings, the earnings are good and they're still accelerating. So I guess to Amanda's point, it's going to be hard to bet against these names next year.\n02:53 Brooke\nBrian, but I think what the key point here that investors have really weighed in on is the future outlook of these companies, the guidance that they're putting out.\n03:02 Brooke\nAnd I think that's why we're seeing investors fall disappointed based upon what these companies say will be the end results or what exactly the end result could potentially be for revenue when it comes to all the AI investments that they're currently making, the spending that they're currently doing.\n03:20 Brooke\nAnd and that's why sometimes we're not seeing the same return that we see from other uh stocks, other investments because of the fact that these these uh guidance, these outlook that these companies put out just doesn't meet the very high bar that these investors have set for these sort of companies.\n03:42 Brooke\nAnd also, we are seeing a bit of a different fold. Over the past three months, we've seen Tesla, Apple, and Alphabet outperform the broader uh Mag 7.\n03:51 Brooke\nAnd that's largely because of the fact that investors seem to be liking the way in which these companies are now pursuing AI. And so we're seeing this bit of a uh a differ, you know, a difference in what we're seeing in these latter parts of the month than maybe earlier this year when we really saw Nvidia, Amazon, Microsoft, as well as Meta really lead the way within this AI tech rally, especially over the summer months.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "18:00:46",
      "Source": "MT Newswires",
      "Title": "Microsoft-Backed OpenAI Says Developers Can Now Submit Apps for Review, Publication in ChatGPT",
      "URL": "https://finance.yahoo.com/news/microsoft-backed-openai-says-developers-100046443.html",
      "Content": "PREMIUM\nMicrosoft-Backed OpenAI Says Developers Can Now Submit Apps for Review, Publication in ChatGPT\n\nMT Newswires\nThu, December 18, 2025 at 2:00 AM PST 1 min read\n\nIn this article: OPAI.PVT\n\nMSFT\n\nMicrosoft-backed (MSFT) OpenAI said Wednesday that developers can now submit apps for review and pub\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "17:23:18",
      "Source": "MT Newswires",
      "Title": "Market Chatter: OpenAI Has Held Talks With Some Investors About Raising New Funding at $750 Billion Valuation",
      "URL": "https://finance.yahoo.com/news/market-chatter-openai-held-talks-092318306.html",
      "Content": "PREMIUM\nMarket Chatter: OpenAI Has Held Talks With Some Investors About Raising New Funding at $750 Billion Valuation\n\nMT Newswires\nThu, December 18, 2025 at 1:23 AM PST 1 min read\n\nIn this article: OPAI.PVT\n\nMSFT\n\nAMZN\n\nSFTBF\n\nMicrosoft-backed (MSFT) OpenAI has held preliminary talks with certain investors about raising new f\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 15
}