{
  "stock_id": "NVDA",
  "last_updated": "2025-12-17T19:11:01.417Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-18",
      "Time": "03:04:00",
      "Source": "Barrons.com",
      "Title": "GE Vernova Has More Than Doubled This Year. Why It’s the Worst Stock in the S&P 500 Today.",
      "URL": "https://finance.yahoo.com/m/8de6abcf-661d-31ff-87d9-5ba3aad5bfda/ge-vernova-has-more-than.html",
      "Content": "GE Vernova Has More Than Doubled This Year. Why It’s the Worst Stock in the S&P 500 Today.\n\nAl Root\nWed, December 17, 2025 at 11:04 AM PST 2 min read\n\nIn this article: GEV\n\nORCL\n\n^DJI\n\nNVDA\n\n^GSPC\n\nA chip start-up named Mystic has created worries similar to the DeepSeek situation earlier this year.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "02:55:00",
      "Source": "Motley Fool",
      "Title": "1 Unstoppable Artificial Intelligence (AI) Stock You'll Want to Own Next Year",
      "URL": "https://finance.yahoo.com/m/1fb9f9ee-11a6-3cb0-82e3-3606c595e906/1-unstoppable-artificial.html",
      "Content": "1 Unstoppable Artificial Intelligence (AI) Stock You'll Want to Own Next Year\n\nAdam Levy, The Motley Fool\nWed, December 17, 2025 at 10:55 AM PST 6 min read\n\nIn this article: GOOG\n\nMSFT\n\nNVDA\n\nKey Points This company operates market-leading businesses in three industries.\nMassive investments in AI infrastructure have weighed heavily on its free cash flow.\nIt's showing strong operating results that should eventually lead to an increase in free cash flow.\n10 stocks we like better than Amazon ›\nArtificial intelligence (AI) has been the driving force behind many of the stock market's biggest winners over the last three years. Big companies like Microsoft (NASDAQ: MSFT) and Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) have seen their share prices reach new all-time highs, driven by strong AI-related business results across both software and cloud computing . Both companies are pushing toward $4 trillion valuations. Meanwhile, Nvidia briefly touched a $5 trillion market cap this year as big tech companies continue to buy up its graphics processing units (GPUs) as fast as it can sell them.\n\nBut not every AI-related stock has zoomed higher this year. One company, in particular, has seen its stock stuck in neutral, climbing less than 5% this year while the S&P 500 is up more than 17%. But that could be a buying opportunity for long-term investors. In fact, the stock could produce very strong returns as soon as next year. Here's why you'll want to own Amazon (NASDAQ: AMZN) in 2026.\nA dominant force across three major industries Amazon may have started as a small online bookseller, but it has grown to be much more. Its marketplace offers nearly everything you can think of, and it can ship millions of items to U.S. customers within one to two days thanks to its massive fulfillment network. It has built a burgeoning advertising business that has expanded from retail media ads to video ads served through its Prime Video service and other streaming partners. And it's the largest cloud computing platform in the world, operating Amazon Web Services (AWS).\n\nAll three businesses are experiencing rapid growth and demonstrating strong momentum.\nThe online retail business continues to produce high-single-digit revenue growth despite generating over $250 billion in annual sales. Its third-party seller services, which enable other businesses to sell through Amazon's marketplace, are showing accelerating growth, up 11% in the most recent quarter. The entire ecosystem rests on Amazon's Prime subscription service, which has steadily pushed subscription revenue 10% higher.\nAmazon's advertising business is accelerating, climbing 24% in the most recent quarter, reaching a $70 billion run rate. Prime Video is a key catalyst for that continued growth, as 80% of subscribers are on the ad-supported tier and Amazon adds more live sports content to the service. It has also partnered with several major streaming platforms through its demand-side ad-buying platform.\n\nStory Continues\nOverall, Amazon is seeing operating margin expansion in its North American and International reporting segments. A couple of factors are leading to higher margins. First, advertising sales have extremely high margins relative to product sales and even third-party services. The second is that Amazon's improvements to its fulfillment center have reduced its shipping costs. Shipping costs have increased at a slower pace than paid units in each of the last eight quarters.\n\nAmazon's cloud computing business remains the company's most important segment, accounting for most of the operating income and growing quickly. Management has successfully reaccelerated revenue growth for the segment, achieving 20% year-over-year growth last quarter, driven by strong triple-digit revenue from AI services. That rate is significantly slower than both Microsoft and Google, but AWS is also growing off a larger base.\nCEO Andy Jassy expects sales to continue at the current pace for the foreseeable future. That's supported by a growing backlog, which reached $200 billion by the end of the third quarter. Amazon also signed deals in October with commitments exceeding everything it booked in Q3, so there's a lot of momentum behind the cloud computing segment to keep growing.\n\nAmazon looks undervalued right now Amazon is investing heavily to capitalize on the opportunities it sees in both cloud computing and e-commerce. It spent $90 billion through the first three months of the year on capital expenditures (capex), and management expects full-year cash capex to come in around $125 billion. That's well above Alphabet's planned $92 billion in capex for the year and slightly more than Microsoft (which spent $80 billion through the first nine months of the year).\n\nThat high spending has weighed heavily on Amazon's free cash flow, which fell to $14.8 billion over the trailing-12-month period. That's down from $47.7 billion in the previous 12-month period. Indeed, the high capex has hit Amazon's cash flow much harder than capex has hit either Microsoft or Alphabet. That's in part because its competitors have high-margin software businesses that continue to grow quickly, offsetting their spending, while Amazon's retail business still has relatively low margins.\nBut Amazon has gone through multiple investment cycles throughout its history. Each time, it has emerged with much stronger cash flows than it had before the investment cycle. Considering the growing backlog of cloud computing contracts and the secular trend toward migrating to cloud computing services, investors should remain confident that the pattern will hold. While management expects to increase its capex further in 2026, free cash flow will eventually trough as capital intensity levels off. With strong operating cash-flow growth, Amazon should see a rapid recovery in free cash flow.\n\nAmazon has historically traded around 50 times its free cash flow near its peaks. With its current market cap of $2.5 trillion, investors are merely expecting it to return to its peak free-cash-flow levels from a bit over a year ago. It seems very likely that Amazon will far exceed those levels over time, pushing its stock price significantly higher.\nShould you buy stock in Amazon right now? Before you buy stock in Amazon, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Amazon wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,955 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,089,460 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 968 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nAdam Levy has positions in Alphabet, Amazon, and Microsoft. The Motley Fool has positions in and recommends Alphabet, Amazon, Microsoft, and Nvidia. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\n1 Unstoppable Artificial Intelligence (AI) Stock You'll Want to Own Next Year was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "02:45:11",
      "Source": "CBS News",
      "Title": "How will the stock market perform in 2026? Wall Street pros weigh in.",
      "URL": "https://finance.yahoo.com/m/96359a46-6ce3-3868-91eb-9a802a738c35/how-will-the-stock-market.html",
      "Content": "How will the stock market perform in 2026? Wall Street pros weigh in.\n\nMary Cunningham\nWed, December 17, 2025 at 10:45 AM PST 5 min read\n\nIn this article: ^GSPC\n\n^DJI\n\n^IXIC\n\nGOOG\n\nMSFT\n\nThe U.S. stock market scaled new heights in 2025, as investors largely tuned out concerns about the Trump administration's sharply higher tariffs and shrugged off fears of a financial market bubble among artificial intelligence companies.\nThe S&P 500 stock index is up roughly 15% this year through Dec. 17— a strong performance, although lower than the heady 23% jump posted by the broad-based index in 2024. The S&P 500 has climbed an average of 13% per year over the last decade, according to Mark Luschini, chief investment strategist at wealth management firm Janney Montgomery Scott.\n\nThe Nasdaq Composite, which includes tech heavy-hitters such as Alphabet, Microsoft and Nvidia, has climbed more than 18% this year, while the blue-chip Dow Jones Industrial Average is up more than 13%.\nThe key question: Will such investor exuberance spill over into 2026, especially as concerns about an AI bubble percolate?\n\"I think conditions remain relatively fertile for stock prices to do OK overall,\" Luschini told CBS News. \"The big risk is that the whole AI narrative starts to lose a little of its viscosity.\"\nOther forecasters are also expecting a strong stock market performance in 2026. David Lefkowitz, head of U.S. equities at UBS Global Wealth Management, expects the S&P 500, which closed Monday trading at 6,816 points, to reach 7,300 points by June of next year and 7,700 by the end of 2026. That would represent a roughly 15% gain over the next year.\n\nJ.P. Morgan said in a November research report that it expects the S&P 500 to rise 13% to 15% next year, boosted by robust corporate earnings growth, and to carry that strength into 2027.\nWhat will drive stocks in 2026?\nSeveral catalysts are expected to drive the stock market in 2026. Among them is another year of strong corporate earnings, particularly in tech, analysts say. BofA Global Research expects overall earnings to grow in the mid-double digits next year.\n\"Multiple expansion and earnings growth both pushed the S&P 500 up 15% this year,\" the group said in its equity outlook. \"In 2026, earnings will do the lift.\"\nThe AI boom should also help fuel the stock market, with a wave of capital investments likely to drive up tech stocks, analysts note. AI capital expenditures from major tech companies including Alphabet, Amazon, Meta, Microsoft and Oracle are expected to approach $520 billion in 2026, Jeff Buchbinder, chief equity strategist for LPL Financial, said in a research note.\nAnother area expected to benefit from the AI boom is the industrials sector, which is supplying the equipment necessary for data centers .\n\nStory Continues\nGrowth, however, won't be limited to tech or AI-adjacent sectors. Indeed, Bret Kenwell, a U.S. investment and options analyst at eToro, said a broadening of the bull market could be in the cards, with all 11 sectors in the S&P 500 expected to rise next year.\n\"That's something we haven't seen,\" he said. \"If it happens, it'll have been five years since we've seen it.\"\n\nAdam Crisafulli, head of Vital Knowledge, and Luschini both expect a good year for financial services stocks. Banks have traded very well this year amid an easier regulatory backdrop and a jump in mergers and acquisitions.\nAnother tailwind for the stock market could be softer monetary policy and a more dovish Federal Reserve, Kenwell said, with President Trump soon expected to nominate a new central bank chief before Jerome Powell's term ends in May.\n\"It's kind of a when, not if, rate-cut situation with the Fed,\" Kenwell said.\nStill, analysts and major banks expect a slowdown in the pace of interest rate cuts. In a November report, J.P. Morgan forecasts one more interest rate cut in January before an extended pause and said that if the central bank further eases monetary policy, the S&P 500 could surpass 8,000 points in 2026.\n\nIs my money safe?\nThe biggest shadow looming over the stock market next year is what will happen with artificial intelligence.\nAI and tech stocks have been the propelling force behind equity gains this year, with earnings growth from the \"Magnificent Seven\" far outpacing other companies in the S&P 500. That strength has been accompanied by a boom in capital expenditures, as investors rush to invest in data center construction and other technology infrastructure to meet rising demand for AI.\n\"Robust demand for cloud services and data center capacity shows no signs of slowing,\" Janus Henderson portfolio manager Jeremiah Buckley said in his company's 2026 outlook on capital investment.\nAmid all the hype, some investors are concerned about whether AI's ascendance could start to falter next year, leading to a market correction or the bursting of what some consider to be an AI bubble.\n\nIn its 2026 outlook, Vanguard said it expects U.S. technology stocks to maintain momentum given the rate of investment and anticipated earnings growth. At the same time, the investment management company noted that \"risks are growing\" amid all of the AI optimism.\nCrisafulli said tech gains have historically moved in unison, but that started to splinter in November, when Alphabet shares surged 14% following the release of Google Gemini 3, while the rest of the Nasdaq slumped . The continued fracturing of the AI narrative is one of the headwinds he expects investors will have to face in 2026.\n\"It's not so much the bubbles bursting,\" he said. \"It's more just people looking at it in a more nuanced way.\"\nStill, as usual investors should expect some turbulence. Minor pullbacks or flat trading periods are possible, especially after several months of consecutive growth in the S&P 500, according to Kenwell.\n\"When we look at 2025, it was a good reminder that volatility is in play, and that's something that certainly can be back in the cards in 2026,\" he said.\nEye Opener: New video emerges of Nick Reiner moments before arrest\nWhat we know after Rob and Michele Reiner's son Nick arrested in their deaths\nMore details emerge about Rob Reiner and wife Michele's killings\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "02:44:23",
      "Source": "MT Newswires",
      "Title": "Sector Update: Tech Stocks Fall Wednesday Afternoon",
      "URL": "https://finance.yahoo.com/news/sector-tech-stocks-fall-wednesday-184423440.html",
      "Content": "PREMIUM\nSector Update: Tech Stocks Fall Wednesday Afternoon\n\nMT Newswires\nWed, December 17, 2025 at 10:44 AM PST 1 min read\n\nIn this article: AMZN\n\nNVDA\n\nGOOG\n\nXLK\n\nMETA\n\nTech stocks were lower Wednesday afternoon, with the State Street Technology Select Sector SPDR ETF\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "02:34:00",
      "Source": "Business Wire",
      "Title": "Siemens unveils lineup for CES 2026 keynote",
      "URL": "https://finance.yahoo.com/news/siemens-unveils-lineup-ces-2026-183400569.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nSiemens unveils lineup for CES 2026 keynote\n\nBusiness Wire\nWed, December 17, 2025 at 10:34 AM PST 4 min read\n\nIn this article: SIEGY\n\nNVDA\n\nMSFT\n\nPEP\n\nPresident and CEO of Siemens AG, Roland Busch, will welcome to the stage leaders from NVIDIA, Microsoft, PepsiCo and Commonwealth Fusion Systems\nDiscussions will focus on how Siemens, together with its partners and customers, is accelerating the industrial AI revolution – from design to operations\n\nMUNICH, December 17, 2025 --( BUSINESS WIRE )--Siemens today announced the lineup of industry and technology leaders who will join President and CEO Roland Busch on stage for Siemens’ keynote at CES 2026.\n\nThe keynote will bring together executives from NVIDIA, Microsoft, PepsiCo and Commonwealth Fusion Systems for a series of conversations focused on how AI is reshaping the physical world and transforming manufacturing, infrastructure and transportation.\nAt the heart of the keynote: an on-stage conversation between Roland Busch and Jensen Huang, founder and CEO of NVIDIA. Together, they will explore the next phase of industrial AI and what it will take to scale intelligence responsibly and reliably in the physical world. The discussion will reflect the growing collaboration between Siemens and NVIDIA at the intersection of AI, software, automation and infrastructure. They will also share what’s next for their partnership, how AI will reshape industry and what it takes to scale intelligence from the data center to the factory floor and beyond.\n\nThroughout the keynote, Roland Busch will also speak with partners and customers who are shaping the future of industry:\nJay Parikh, Executive Vice President for CoreAI at Microsoft, will discuss how the convergence of Microsoft’s AI excellence and Siemens’ industrial expertise will enable the next wave of industrial transformation.\nAthina Kanioura, CEO, Latin America and Global Chief Strategy and Transformation Officer of PepsiCo, will offer insights into how global companies are reconfiguring their operations and rethinking value creation – leveraging digital twin technology and advanced simulation – to stay ahead in an increasingly digital and AI-driven industrial landscape.\nBob Mumgaard, CEO and Co-founder of Commonwealth Fusion Systems (CFS), will discuss how advanced technology is enabling the role of commercial fusion – addressing one of the world’s most complex and consequential challenges by paving the way for clean, firm and abundant energy solutions.\n\nRoland Busch will also share the technology stack powering this industrial AI revolution. He will introduce concrete opportunities for organizations to apply industrial AI in 2026 and beyond, reinforcing Siemens' commitment to making AI accessible, scalable and impactful for the industries that power the global economy.\n\nStory Continues\nThe Siemens CES 2026 keynote follows the CTA State of the Industry Address at 8:30 a.m. PST on Tuesday, January 6, 2026 , in the Palazzo Ballroom at the Venetian and will also be livestreamed on the Siemens LinkedIn channel .\nIn addition to the keynote, Siemens and AWS will have a joint broadcast studio at CES, featuring conversations with AI industry and thought leaders, partners and customers sharing their perspectives on the latest in AI announcements at CES as well as industrial AI adoption. The Siemens and AWS CES live broadcast studio is in the Las Vegas Convention Center North Hall (booth 8011) and livestreamed on the Siemens LinkedIn and YouTube channels .\n\nThis press release is available at https://sie.ag/MyGqS\nSiemens AG (Berlin and Munich) is a leading technology company focused on industry, infrastructure, mobility, and healthcare. The company’s purpose is to create technology to transform the everyday, for everyone. By combining the real and the digital worlds, Siemens empowers customers to accelerate their digital and sustainability transformations, making factories more efficient, cities more livable, and transportation more sustainable. A leader in industrial AI, Siemens leverages its deep domain know-how to apply AI – including generative AI – to real-world applications, making AI accessible and impactful for customers across diverse industries. Siemens also owns a majority stake in the publicly listed company Siemens Healthineers, a leading global medical technology provider pioneering breakthroughs in healthcare. For everyone. Everywhere. Sustainably.\nIn fiscal 2025, which ended on September 30, 2025, the Siemens Group generated revenue of €78.9 billion and net income of €10.4 billion. As of September 30, 2025, the company employed around 318,000 people worldwide on the basis of continuing operations. Further information is available on the Internet at https://www.siemens.com/ .\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251217504789/en/\nContacts\nContacts for journalists\nSiemens AG\nSimon Krause\nPhone: +49 (173) 4039683; email: krause.simon@siemens.com\n\nSiemens USA\nCharlie DiPasquale\nPhone: (+1) 240-481-6632; email: charlie.dipasquale@siemens.com\n\nChristine Whitman\nPhone: (+1) 202-316-2347; email: christine.whitman@siemens.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "02:20:57",
      "Source": "Investor's Business Daily",
      "Title": "Chip Leader Rides AI Boom Wave; Stock Vaults 62%",
      "URL": "https://finance.yahoo.com/m/944b539d-a87b-3e93-bcd3-fd9ff7a0973f/chip-leader-rides-ai-boom.html",
      "Content": "Chip Leader Rides AI Boom Wave; Stock Vaults 62%\n\nVIDYA RAMAKRISHNAN\nWed, December 17, 2025 at 10:20 AM PST 2 min read\n\nIn this article: AVGO\n\nNVMI\n\nNVDA\n\nChip designers like Nvidia and Broadcom have led the artificial intelligence rally in 2024 and 2025. Nova stock is Wednesday's choice for IBD 50 Stocks To Watch. Nova is a chip process control tools provider.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "02:12:36",
      "Source": "MT Newswires",
      "Title": "Sector Update: Tech",
      "URL": "https://finance.yahoo.com/news/sector-tech-181236733.html",
      "Content": "PREMIUM\nSector Update: Tech\n\nMT Newswires\nWed, December 17, 2025 at 10:12 AM PST 1 min read\n\nIn this article: NVDA\n\nGOOG\n\nXLK\n\nMETA\n\nTech stocks were lower Wednesday afternoon, with the State Street Technology Select Sector SPDR ETF\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "01:59:28",
      "Source": "Investor's Business Daily",
      "Title": "Stock Market Today: Dow Slips As Nasdaq Struggles; Oracle Hit, Salesforce Up (Live Coverage)",
      "URL": "https://finance.yahoo.com/m/08034984-b2ec-32ee-b4d6-81730f186925/stock-market-today%3A-dow-slips.html",
      "Content": "Stock Market Today: Dow Slips As Nasdaq Struggles; Oracle Hit, Salesforce Up (Live Coverage)\n\nSCOTT LEHTONEN and CARLA MOZEE\nWed, December 17, 2025 at 9:59 AM PST 5 min read\n\nIn this article: CRM\n\n^DJI\n\nORCL\n\nCAT\n\n^GSPC\n\nStock Market Today: The Dow Jones index rose Wednesday after the indexes dropped Tuesday. Tesla stock wavered.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "01:44:56",
      "Source": "Insider Monkey",
      "Title": "Jim Cramer on NVIDIA (NVDA): “I’m Not Changing My Tune”",
      "URL": "https://finance.yahoo.com/news/jim-cramer-nvidia-nvda-m-174456973.html",
      "Content": "Jim Cramer on NVIDIA (NVDA): “I’m Not Changing My Tune”\n\nSyeda Seirut Javed\nWed, December 17, 2025 at 9:44 AM PST 3 min read\n\nIn this article: NVDA\n\nNVIDIA Corporation (NASDAQ: NVDA ) is one of the stocks that Jim Cramer shared his take on . During the episode, Cramer said that he is not changing his “tune” around the company, as he said:\nNVIDIA Corporation (NASDAQ:NVDA) develops accelerated computing and AI platforms, GPUs for gaming and professional use, cloud services, robotics and embedded systems, and automotive technologies. Cramer discussed the company’s China business during the December 9 episode and said:\n\nStory Continues\nWhile we acknowledge the potential of NVDA as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "01:41:00",
      "Source": "Motley Fool",
      "Title": "1 Prediction for Nvidia in 2026",
      "URL": "https://finance.yahoo.com/m/903d6366-bde7-3321-b9ad-5802a700baf1/1-prediction-for-nvidia-in.html",
      "Content": "1 Prediction for Nvidia in 2026\n\nHoward Smith, The Motley Fool\nWed, December 17, 2025 at 9:41 AM PST 3 min read\n\nIn this article: NVDA\n\nKey Points Investors are becoming skeptical that Nvidia's remarkable growth can continue.\nNvidia's CEO has already signaled why they could be wrong.\n2026 could mark a new leg of growth for Nvidia.\n10 stocks we like better than Nvidia ›\nNvidia (NASDAQ: NVDA) has been a focal point of investment in the artificial intelligence (AI) sector this year. It's the undisputed leader in accelerated computing. However, Nvidia's chips aren't the only reason why.\n\nThe company's graphics processing unit (GPU) stacks combine hardware, software, and platform solutions designed to support applications from gaming to professional visualization and accelerated computing. I believe Nvidia's vast array of solutions will reaccelerate growth in the stock price next year.\nAI solutions for the future Nvidia's revenue soared to a record $57 billion in the recently reported fiscal third quarter. That was a remarkable 62% year-over-year jump.\nSome investors believe that this kind of growth is unsustainable. That seems like a sensible position considering that level of sales. I predict that another leg of sustainable growth lies ahead that investors will begin to recognize in 2026. Nvidia CEO Jensen Huang has already publicly signaled what it will be, too.\n\nEven if the AI data center buildout slows, as some believe will happen, Jensen Huang sees a long growth runway for his company over the next decade. In an interview earlier this year, Huang stated, \"This is going to be the decade of AV [autonomous vehicles], robotics, autonomous machines.\"\nNvidia will supply both hardware and software to support that development. The company produces embedded systems for autonomous and robotic applications. Nvidia's Drive ADX platform provides high-level compute performance for the highest level of self-driving technology.\nThe company calls its Jetson platform \"the ideal software for robotics and generative AI at the edge.\" It's powered by Nvidia's leading Blackwell GPU, helping to generate more hardware sales, too.\n\nInvestors should continue to monitor data center growth to track the state of Nvidia's business. However, watching developments in robotics, autonomous vehicles, and machines should provide confidence that a new leg of sales growth for Nvidia is likely. That, in turn, should drive the stock higher after shares have consolidated over the past couple of months.\nShould you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStory Continues\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,955 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,089,460 !*\nNow, it’s worth noting Stock Advisor’s total average return is 968 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nHoward Smith has positions in Nvidia and has the following options: short February 2026 $170 calls on Nvidia. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy .\n1 Prediction for Nvidia in 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "01:40:00",
      "Source": "The Wall Street Journal",
      "Title": "Major U.S. Stock Indexes Slip; Oil Rises on Trump Order of Venezuela Blockade",
      "URL": "https://finance.yahoo.com/m/48d4a891-0b99-3e06-8437-3dbf2b0e95c1/major-u.s.-stock-indexes.html",
      "Content": "Major U.S. Stock Indexes Slip; Oil Rises on Trump Order of Venezuela Blockade\n\nAngus Berwick\nWed, December 17, 2025 at 9:40 AM PST 1 min read\n\nIn this article: CL=F\n\nGBP=X\n\nXOM\n\nBP\n\nSHEL\n\nOil prices rose after President Trump ramped up pressure on Venezuela, ordering a blockade of sanctioned tankers entering and exiting the country.\nBrent crude futures moved higher toward $60 a barrel, after skidding Tuesday. Shares of energy companies, including Exxon Mobil, BP and Shell, rallied.\nMost Read from The Wall Street Journal U.S. Tanker Seizure Has Paralyzed Venezuelan Oil Shipping—Except Chevron’s\nSpooked by AI and Layoffs, White-Collar Workers See Their Security Slip Away\nPanama Ports Deal Hits Impasse as China Makes New Demands for Its Approval\nPepsi Worked to Keep Prices Higher at Retailers to Protect Walmart, FTC Found\nWarner Preparing to Tell Shareholders to Reject Paramount Offer\n\nThe Nasdaq composite lost ground Wednesday, falling more than 1% with Nvidia, Broadcom and Oracle all down on the day. The Dow industrials surrendered early gains, dragged down by a slide in shares of Caterpillar.\nWarner Bros. Discovery rejected an unsolicited bid from Paramount, saying it believes a planned deal with Netflix is still superior. Paramount and Warner shares both fell, while Netflix gained.\nThe dollar strengthened against a range of currencies. The British pound fell after data showed U.K. inflation slowed to an eight-month low, making a Thursday rate cut all but certain.\nIn other markets:\n— Global markets largely advanced. China’s Shanghai composite and Hang Seng Index both rose about 1%, boosted by AI stocks. The FTSE 100 rose 1.5%, bolstered by energy and bank stocks.\n— Silver futures rallied to another record intraday high. Gold prices also gained.\nWrite to Angus Berwick at angus.berwick@wsj.com\nMost Read from The Wall Street Journal U.S. Unemployment Rose in November ​Despite Job Gains\nCalifornia Gives Tesla 90 Days to Change Autopilot Advertising\nBlackstone Leads $400 Million Investment in Cyber Startup Cyera\nThe Factory Workers Who Build the Power Grid by Hand\nBitcoin Keeps Sliding, and the True Believers Keep Buying\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "01:35:28",
      "Source": "MT Newswires",
      "Title": "Update: Market Chatter: Google Working to Make Chips Better at Running Meta-Backed AI Software",
      "URL": "https://finance.yahoo.com/news/market-chatter-google-working-chips-173528410.html",
      "Content": "PREMIUM\nUpdate: Market Chatter: Google Working to Make Chips Better at Running Meta-Backed AI Software\n\nMT Newswires\nWed, December 17, 2025 at 9:35 AM PST 1 min read\n\nIn this article: GOOG\n\nMETA\n\nGOOGL\n\nNVDA\n\n(Update with Google's response to a request for comment from MT Newswires.) Alphabet's (GOOG, GOO\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "01:13:00",
      "Source": "Barrons.com",
      "Title": "Private AI Investments Soar Despite Modest Sales",
      "URL": "https://finance.yahoo.com/m/ce572545-ba11-36b0-8f99-79ae24e5e8a5/private-ai-investments-soar.html",
      "Content": "Private AI Investments Soar Despite Modest Sales\n\nAdam Levine\nWed, December 17, 2025 at 9:13 AM PST 1 min read\n\nIn this article: NVDA\n\nOPAI.PVT\n\nANTH.PVT\n\nAlmost $70 billion of 2024 and 2025 AI funding has gone to just two companies: OpenAI and Anthropic.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "01:00:00",
      "Source": "Business Wire",
      "Title": "Atlas Cloud AI and NewYork GreenCloud Launch $6B Sustainable AI Infrastructure Partnership Powered by NVIDIA Blackwell Platform",
      "URL": "https://finance.yahoo.com/news/atlas-cloud-ai-newyork-greencloud-170000673.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nAtlas Cloud AI and NewYork GreenCloud Launch $6B Sustainable AI Infrastructure Partnership Powered by NVIDIA Blackwell Platform\n\nBusiness Wire\nWed, December 17, 2025 at 9:00 AM PST 2 min read\n\nIn this article: NVDA\n\nNEW YORK, December 17, 2025 --( BUSINESS WIRE )--Atlas Cloud AI, a leader in high-performance artificial intelligence infrastructure, and NewYork GreenCloud, a sustainable data center provider based in Plattsburgh, NY, announced today a landmark partnership to deploy one of the nation’s most advanced renewable-powered accelerated computing clusters.\n\nUnder the agreement, NewYork GreenCloud will host a dedicated cluster of 288 HGX B300 systems, featuring 2,304 NVIDIA Blackwell GPU s, at its renewable biomass-powered data center in Ione, California. This initial investment of roughly $250 million marks the first project within Atlas Cloud AI’s $6 billion initiative, a two-year plan to build a network of sustainable AI compute hubs across North America.\nThe four-year agreement outlines full-scale deployment by February 2026, delivering a minimum Tier III Compliant data center featuring 99.9% uptime with 24/7 monitoring and maintenance. Each 2CRSi Godì 1.8E2D-NV8 server integrates NVIDIA Quantum-X800 InfiniBand networking (800 Gbps per GPU), WEKA high-performance storage, and liquid cooling to maximize efficiency and minimize environmental footprint.\n\n\"This partnership represents the first step in our $6 billion commitment to redefining AI infrastructure through sustainability and scale,\" said Jerry Tang, CEO of Atlas Cloud AI. \"Working with NewYork GreenCloud allows us to combine world-class NVIDIA Blackwell performance with renewable energy and enterprise-grade reliability.\"\nJoe Church, CEO of NewYork GreenCloud, added: \"Atlas Cloud AI’s vision aligns perfectly with our mission to make AI infrastructure both reliable and sustainable. Together, we’re proving that green energy can fuel the next generation of AI innovation.\"\nAbout Atlas Cloud AI\nAtlas Cloud AI is a next-generation compute provider specializing in hyperscale GPU infrastructure for AI training, inference, and enterprise workloads. Based in New York, Atlas partners with technology leaders to deliver secure, efficient, and sustainable compute capacity.\n\nAbout NewYork GreenCloud\nNewYork GreenCloud operates renewable-powered data centers and AI Factories that provide high performance computing with minimal environmental impact. With advanced cooling and energy recovery systems, NewYork GreenCloud enables enterprises to achieve carbon-negative AI growth with an industry-low PUE (1.02).\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251217923131/en/\nContacts\nMEDIA CONTACTS\nAPEX Public Relations\nLindsay Maguire / Elyse Weissman\nlindsay@theapex-pr.com / elyse@theapex-pr.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "00:51:35",
      "Source": "GuruFocus.com",
      "Title": "Why Oracle (ORCL) Shares Are Crashing Today",
      "URL": "https://finance.yahoo.com/news/why-oracle-orcl-shares-crashing-165135190.html",
      "Content": "Why Oracle (ORCL) Shares Are Crashing Today\n\nNauman Khan\nWed, December 17, 2025 at 8:51 AM PST 1 min read\n\nIn this article: ORCL\n\nNVDA\n\nOWL\n\nThis article first appeared on GuruFocus .\nOracle ( NYSE:ORCL ) shares fell about 5% on Wednesday after reports surfaced that Blue Owl Capital would not fund a $10 billion data center project linked to OpenAI.\nThe cloud giant said the project in Saline Township, Michigan, remains \"on schedule,\" but confirmed that Blue Owl is no longer involved in financing talks.\n\nWarning! GuruFocus has detected 6 Warning Signs with ORCL.\nIs ORCL fairly valued? Test your thesis with our free DCF calculator.\nThe planned facility, designed to provide 1-gigawatt capacity for AI operations, is part of Oracle's long-term expansion in cloud infrastructure. Investors have raised questions about the company's ability to fund large-scale projects, given its $248 billion in lease and cloud capacity commitments over the next 15 to 19 years.\nDespite the dip, analysts note that Oracle's efforts to secure computing resources for AI remain a strategic priority.\nThe stock has been volatile this month amid broader tech sector pressures and rising investor scrutiny of off-balance-sheet obligations.\nMarket watchers are also tracking AI-driven infrastructure spending and upcoming earnings from chip suppliers like Nvidia ( NASDAQ:NVDA ) for signs of enterprise demand.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "00:51:17",
      "Source": "Investor's Business Daily",
      "Title": "This Tech Play Smokes Google, Nvidia, And All Mag 7 Stocks Year To Date",
      "URL": "https://finance.yahoo.com/m/81729e8d-b499-3eb0-8db4-96d7a2bed604/this-tech-play-smokes-google%2C.html",
      "Content": "This Tech Play Smokes Google, Nvidia, And All Mag 7 Stocks Year To Date\n\nMATTHEW GALGANI\nWed, December 17, 2025 at 8:51 AM PST 3 min read\n\nIn this article: GOOG\n\nALNT\n\nNVDA\n\nTSLA\n\nMETA\n\nBoosted by a sharp turnaround in growth and demand from top funds, Allient stock has smashed all Mag 7 stocks year to date.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "00:44:20",
      "Source": "Investor's Business Daily",
      "Title": "Stock Market Today: Dow Turns Lower As Nasdaq Loss Deepens; Oracle Tumbles (Live Coverage)",
      "URL": "https://finance.yahoo.com/m/08034984-b2ec-32ee-b4d6-81730f186925/stock-market-today%3A-dow-turns.html",
      "Content": "Stock Market Today: Dow Turns Lower As Nasdaq Loss Deepens; Oracle Tumbles (Live Coverage)\n\nSCOTT LEHTONEN and CARLA MOZEE\nWed, December 17, 2025 at 8:44 AM PST 4 min read\n\nIn this article: ORCL\n\n^DJI\n\nCAT\n\n^GSPC\n\nTSLA\n\nStock Market Today: The Dow Jones index rose Wednesday after the indexes dropped Tuesday. Tesla stock wavered.\n\nContinue Reading\n\n條款 及 私隱政策\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "00:43:30",
      "Source": "GuruFocus.com",
      "Title": "China's MetaX IPO Soars 700%, Threatening Nvidia and AMD Dominance",
      "URL": "https://finance.yahoo.com/news/chinas-metax-ipo-soars-700-164330095.html",
      "Content": "China's MetaX IPO Soars 700%, Threatening Nvidia and AMD Dominance\n\nNauman Khan\nWed, December 17, 2025 at 8:43 AM PST 1 min read\n\nIn this article: AMD\n\nNVDA\n\nThis article first appeared on GuruFocus .\nShares of China's MetaX Integrated Circuits rocketed 700% on their Shanghai debut Wednesday, fuelled by Beijing's push to cut reliance on foreign AI chips and robust retail demand.\nThe GPU maker priced its IPO at 104.66 yuan and opened near 700 yuan, briefly climbing to 895 yuan at session peak. The listing raised about 4.2 billion yuan ($596 million) and was wildly oversubscribed, underscoring intense investor appetite.\n\nWarning! GuruFocus has detected 5 Warning Signs with AMD.\nIs AMD fairly valued? Test your thesis with our free DCF calculator.\nMetaX was founded by former AMD executive Chen Weiliang and joins a wave of domestic chip listings; rival Moore Threads jumped 400% at its recent debut. Analysts say the moves reflect policy support for homegrown semiconductors and a scramble by investors to back local alternatives to Nvidia ( NASDAQ:NVDA ) and Advanced Micro Devices ( NASDAQ:AMD ).\nThe surge was not necessarily about visibly high near-term earnings, but fund managers warned that the surges were instead all about speculative retail money, policy hype, but many said that IPO offers pre-market players an opportunity to taste some sweet arbitrage.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "00:31:10",
      "Source": "GuruFocus.com",
      "Title": "Micron's Make-or-Break Moment: Can AI Hype Justify a 176% Surge?",
      "URL": "https://finance.yahoo.com/news/microns-break-moment-ai-hype-163110049.html",
      "Content": "Micron's Make-or-Break Moment: Can AI Hype Justify a 176% Surge?\n\nKhac Phu Nguyen\nWed, December 17, 2025 at 8:31 AM PST 2 min read\n\nIn this article: MU\n\nAVGO\n\nNVDA\n\nAMD\n\n^GSPC\n\nThis article first appeared on GuruFocus .\nMarket participants are bracing for Micron Technology ( NASDAQ:MU ) to report earnings after Wednesday's close, with the bar set high as skepticism around the AI trade begins to surface. The shares have surged 176% in 2025, ranking as the fifth-best performer in the S&P 500 and marking Micron's strongest year since 2013, well ahead of the roughly 40% gain in the Philadelphia Semiconductor Index. That momentum has softened in recent sessions, with the stock down about 12% over the past four days following a Dec. 10 high, suggesting investors may be reassessing expectations ahead of the report.\n\nWarning! GuruFocus has detected 9 Warning Sign with MU.\nIs MU fairly valued? Test your thesis with our free DCF calculator.\nThe company is expected to post strong growth as sustained spending on AI data centers supports demand for its high-bandwidth memory chips, but the market appears focused on whether that momentum is still accelerating. Recent sharp declines in Oracle and Broadcom, both of which fell 11% in a single session last week, have highlighted how quickly sentiment can turn on perceived AI beneficiaries. Some investors may now be adopting a more cautious stance, waiting for clearer signals on how durable data-center growth could be before re-engaging with the sector.\nValuation remains a central part of the Micron debate. Despite this year's rally, the shares trade at roughly 11 times estimated earnings over the next 12 months, the lowest multiple among the 30 stocks in the semiconductor index, which trades closer to 25 times forward earnings. That discount stands out against peers such as Nvidia ( NASDAQ:NVDA ), Broadcom ( NASDAQ:AVGO ), and Advanced Micro Devices ( NASDAQ:AMD ), which command significantly higher multiples. At the same time, expectations for Micron's fundamentals have been moving higher, with consensus forecasts for fiscal 2026 net earnings up 16% over the past month and more than 50% over the past quarter, while revenue estimates have risen by more than 20% over the past three months. With enthusiasm elevated and memory demand still cyclical, the upcoming earnings report could either reinforce the view that Micron is reasonably valued or test how much optimism is already reflected in the shares.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "00:31:00",
      "Source": "Motley Fool",
      "Title": "My Surprising Top \"Magnificent Seven\" Stock Pick for 2026",
      "URL": "https://finance.yahoo.com/m/62bdc046-5e09-3421-90c2-479d4473424a/my-surprising-top.html",
      "Content": "My Surprising Top \"Magnificent Seven\" Stock Pick for 2026\n\nStefon Walters, The Motley Fool\nWed, December 17, 2025 at 8:31 AM PST 4 min read\n\nIn this article: AMZN\n\nTSLA\n\n^GSPC\n\nNVDA\n\nAAPL\n\nKey Points Investors have become impatient with the lack of immediate results from Amazon's increased spending.\nAmazon is adding more computing capacity to Amazon Web Services.\nAdvertising was Amazon's fastest-growing segment in the third quarter.\n10 stocks we like better than Amazon ›\nThe \" Magnificent Seven \" is the name given to the group of Nvidia , Apple , Microsoft , Alphabet , Meta , Tesla , and Amazon (NASDAQ: AMZN) . These seven companies are bundled together because they have driven much of the stock market's gains in recent years. As of Dec. 15, they are seven of the world's top nine most valuable companies and represent nearly 35% of the S&P 500 .\nSo far this year, every \"Magnificent Seven\" stock has produced double-digit returns except for one: Amazon.\nOnce the face of growth stocks, Amazon has lagged over the past year, frustrating its investors along the way. Despite that retreat, Amazon may be positioned to bounce back in 2026.\nWhy has Amazon's stock been lagging? There hasn't been one issue that's caused Amazon's underperformance. It's more a combination of factors. First, Amazon has spent a lot of money this year, with capital expenditures (capex) of around $90 billion through the first nine months of 2025.\nGiven how much Amazon has been spending (mostly on AI infrastructure), investors have been wanting more to show for it -- especially when it comes to Amazon Web Services (AWS) growth. With many of the \"Magnificent Seven\" stocks making big splashes in AI, some people viewed Amazon as falling behind in the race.\nAmazon's heavy spending has weighed on its free cash flow, and that's not something investors typically like without seeing more immediate results. Add in how expensive Amazon's stock has been, and there was little room for error in many investors' eyes.\nAWS is positioning itself for the future AWS may not have been producing the results that we've grown used to seeing over the years, but investors jumping ship seems like a premature overreaction (which is no surprise if you know investors). Yes, AWS has been losing market share to Microsoft's Azure and Alphabet's Google Cloud, but it's still the world's largest cloud platform by far.\n\nCloud platforms are, and will continue to be, crucial to AI training and scaling. That's why Amazon has been focusing so much on building out more infrastructure and adding computing capacity. It has added more than 3.8 gigawatts in the past 12 months and plans to double its capacity through 2027.\n\nStory Continues\nThis investment is noteworthy because, according to calculations from investment bank Oppenheimer , each incremental gigawatt of capacity could add $3 billion in revenue. The high capex might be weighing on Amazon's financials right now, but it's poised to pay off in the long term.\nAmazon has an underrated profit machine There's no doubt that AWS is Amazon's profit engine, accounting for most of its operating income. However, advertising is a high-margin business that has been growing steadily over the past couple of years.\nOn one hand, Amazon has access to data from its millions of customers and Prime members, making it more effective at helping advertisers with targeted ad campaigns. They know what customers buy, when they buy it, what they watch, what they listen to, what they browse, and other information that allows advertisers to target with greater precision.\nOn the other hand, Amazon's massive reach means it has plenty of places to set these ads. Whether it's online, when you search for a specific product, stream something on Prime Video, watch Twitch, or listen to music, there's no shortage of real estate for advertisers looking to reach potential customers. Amazon also announced that it recently struck partnerships that allow its advertisers to buy ad space on Netflix , Spotify , and SiriusXM .\n\nIn the third quarter, Amazon's advertising services revenue grew 24% to $17.7 billion, outpacing its revenue from subscriptions ($12.5 billion). Beyond revenue growth, advertising is a high-margin business that can help Amazon boost its overall profitability. I expect the momentum to continue in 2026.\nShould you invest $1,000 in Amazon right now? Before you buy stock in Amazon, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Amazon wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,955 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,089,460 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 968 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nStefon Walters has positions in Apple and Microsoft. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Netflix, Nvidia, Spotify Technology, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nMy Surprising Top \"Magnificent Seven\" Stock Pick for 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "00:25:06",
      "Source": "GuruFocus.com",
      "Title": "Mythic Raises $125 Million to Expand AI Chip Push Against Nvidia",
      "URL": "https://finance.yahoo.com/news/mythic-raises-125-million-expand-162506954.html",
      "Content": "Mythic Raises $125 Million to Expand AI Chip Push Against Nvidia\n\nFaizan Farooque\nWed, December 17, 2025 at 8:25 AM PST 1 min read\n\nIn this article: NVDA\n\nSFTBF\n\nHMC\n\nLMT\n\nThis article first appeared on GuruFocus .\nMythic Inc. received $125 million to compete with Nvidia ( NVDA , Financials ) in the artificial intelligence chip market.According to a corporate release, DCVC led the fundraising round, which comprised New Enterprise Associates, Atreides Management, SoftBank Group, Honda Motor, and Lockheed Martin.Mythic is creating analog computers that can handle massive AI data sets with less power than digital CPUs. As data center, industrial, and military applications need more AI training and inference, power consumption has become a key issue, according to the business.The corporation named Taner Ozcelik CEO last year. Ozcelik, who spent a decade at Nvidia, said Mythic's approach addresses AI hardware design efficiency gaps.The financing comes as Nvidia dominates the AI processor market due to data center demand. Startups and established firms are trying to grab niche markets or launch new chip designs due to that growth.\nWarning! GuruFocus has detected 4 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nDespite fierce competition and Nvidia's size and environment, Mythic's current round shows investors that AI infrastructure continues to attract funding. Next steps for the firm include product commercialization and client uptake.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "00:23:58",
      "Source": "MT Newswires",
      "Title": "US Big Tech Set as Main Beneficiaries of AI Monetization Inflection in 2026, Wedbush Says",
      "URL": "https://finance.yahoo.com/news/us-big-tech-set-main-162358858.html",
      "Content": "PREMIUM\nUS Big Tech Set as Main Beneficiaries of AI Monetization Inflection in 2026, Wedbush Says\n\nMT Newswires\nWed, December 17, 2025 at 8:23 AM PST 1 min read\n\nIn this article: GOOG\n\nNVDA\n\nAAPL\n\nMSFT\n\nMETA\n\nUS big tech companies are set to be primary beneficiaries of an expected inflection point for artifi\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "00:22:47",
      "Source": "GuruFocus.com",
      "Title": "Amazon Stock Is Rising on OpenAI Funding Talks. What It Means for AI Chips",
      "URL": "https://finance.yahoo.com/news/amazon-stock-rising-openai-funding-162247893.html",
      "Content": "Amazon Stock Is Rising on OpenAI Funding Talks. What It Means for AI Chips\n\nNauman Khan\nWed, December 17, 2025 at 8:22 AM PST 1 min read\n\nIn this article: AMZN\n\nOPAI.PVT\n\nNVDA\n\nMSFT\n\nThis article first appeared on GuruFocus .\nAmazon ( NASDAQ:AMZN ) shares climbed about 1% on Wednesday morning after media reports said OpenAI is in early-stage talks to raise at least $10 billion from the e-commerce and cloud giant.\nPeople familiar with the private discussions said the talks could value OpenAI at more than $500 billion. The potential deal may also involve OpenAI using Amazon's in-house Trainium artificial intelligence chips through Amazon Web Services, though the source cautioned that terms remain fluid and talks could still change.\n\nWarning! GuruFocus has detected 3 Warning Sign with MSFT.\nIs MSFT fairly valued? Test your thesis with our free DCF calculator.\nIf completed, the arrangement would deepen OpenAI's relationship with AWS and reduce its reliance on Nvidia ( NASDAQ:NVDA ) graphics processing units, which it has largely accessed through Microsoft's Azure cloud platform.\nThe move would also be a strategic win for Amazon's growing semiconductor push. Trainium chips are positioned as a lower-cost and more energy-efficient alternative to Nvidia's high-end AI processors, a pitch Amazon has been making to cost-conscious enterprise customers.\nDiscussions between OpenAI and Amazon reportedly began in October 2025, shortly after OpenAI completed a major corporate restructuring. That overhaul followed extended negotiations with Microsoft ( NASDAQ:MSFT ), which resulted in the software maker securing a 27% ownership stake.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "00:17:49",
      "Source": "Investing.com",
      "Title": "Google teams with Meta’s PyTorch to chip away at Nvidia’s moat, Reuters says",
      "URL": "https://finance.yahoo.com/news/google-teams-meta-pytorch-chip-161749510.html",
      "Content": "Google teams with Meta’s PyTorch to chip away at Nvidia’s moat, Reuters says\n\nLuke Juricic\nWed, December 17, 2025 at 8:17 AM PST 2 min read\n\nIn this article: GOOG\n\nMETA\n\nNVDA\n\nMSFT\n\nInvesting.com -- Alphabet Inc’s (NASDAQ:GOOGL) Google is intensifying efforts to make its proprietary artificial intelligence hardware more compatible with the industry’s leading software, a move aimed at challenging NVIDIA Corp’s (NASDAQ:NVDA) grip on the AI computing market, Reuters reported Wednesday.\n\nThe initiative, known internally as \"TorchTPU,\" focuses on optimizing Google’s Tensor Processing Units (TPUs) to run PyTorch, an open-source framework originally developed by Meta Platforms Inc. PyTorch has become the global standard for AI development, and its seamless integration with Nvidia’s hardware has historically acted as a significant barrier to entry for competing chipmakers.\nFor years, Google’s TPUs were primarily optimized for its own internal software framework, Jax. While efficient for Google’s internal workloads, this requirement created a \"bottleneck\" for external enterprise customers who have already built their AI infrastructure on PyTorch, according to the Reuters report, citing sources familiar with the matter.\n\nThe TorchTPU project represents a shift in organizational focus. By allocating more engineering resources to ensure TPUs are \"developer-friendly\" for the broader PyTorch ecosystem, Google aims to make its silicon a more viable alternative to Nvidia’s market-leading GPUs.\nThe push comes as Google Cloud seeks to prove to investors that its massive capital investments in AI hardware are yielding scalable returns.\nCloud Revenue: TPU adoption is a critical engine for Google’s cloud division, which competes with Microsoft Azure and Amazon Web Services.\nThe CUDA Moat: Wall Street analysts often cite Nvidia’s CUDA software as its primary competitive advantage. By natively supporting PyTorch, Google is attempting to neutralize that advantage.\nOpen-Source Strategy: To accelerate market uptake, Google is reportedly considering open-sourcing components of the new software bridge.\n\nWhile Nvidia remains the dominant provider of AI processors, the high cost and limited availability of its chips have led major tech firms to seek alternatives. Meta, one of Nvidia’s largest customers, has been a key proponent of open-source software like PyTorch to ensure hardware flexibility across the industry.\nBy creating a software bridge that allows developers to easily switch away from Nvidia hardware, Google seems set on positioning its own chips to undercut Nvidia’s premium pricing and force a more competitive environment across the AI data center market.\nNvidia stock is down 3.1% in late morning trading, while Alphabet has dropped 3% itself.\n\nStory Continues\nRelated articles\nGoogle teams with Meta’s PyTorch to chip away at Nvidia’s moat, Reuters says\n17 Undervalued Small-Cap Tech Stocks Primed to Outperform in Q4\nThe 5 Best Gold Mining Stocks to Buy Now\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "23:30:18",
      "Source": "Associated Press Finance",
      "Title": "BC-Most Active Stocks",
      "URL": "https://finance.yahoo.com/news/bc-most-active-stocks-153018098.html",
      "Content": "BC-Most Active Stocks\n\nThe Associated Press\nWed, December 17, 2025 at 7:30 AM PST 21 min read\n\nIn this article: VYNE\n\nNVDA\n\nIRBT\n\nCGC\n\nWOK\n\nNEW YORK (AP) — prices for the Nasdaq composite, NYSE and NYSE American listed most active stocks.\nNasdaq most active stocks:\nStock Name\nVolume\nHigh\nLow\nLast\nChange\nAgape ATP Corporation\n231,897,993\n0.154\n0.1273\n0.1347\n+0.0447\nVYNE Therapeutics Inc.\n139,307,566\n0.719\n0.5733\n0.625\n+0.2223\nDirect Digital Holdings Inc.\n107,237,166\n0.0753\n0.07\n0.0705\n+0.0045\nParanovus Entertain.Tech. Ltd.\n53,795,773\n0.0235\n0.0215\n0.0222\n-0.0008\nNVIDIA Corp.\n42,482,718\n176.13\n173.385\n174.09\n-3.63\niRobot Corp.\n42,432,941\n1.06\n0.72\n1.0397\n+0.2795\nCanopy Growth Corp.\n40,396,278\n2.28\n1.93\n2.12\n+0.29\nWork Medical Technology Group\n37,308,635\n0.054\n0.046\n0.0492\n-0.0049\nAditxt Inc.\n29,764,081\n2.20\n1.71\n1.76\n+0.34\nRezolve AI PLC\n28,500,831\n3.48\n2.68\n2.765\n-0.205\nVistagen Therap. Inc.\n25,043,639\n0.9501\n0.7719\n0.7865\n-3.5735\nTesla Inc .\n24,438,796\n495.2799\n486.22\n490.98\n+1.10\niShares Bitcoin Trust ETF\n24,285,688\n51.265\n49.475\n51.23\n+1.52\nHeartBeam Inc.\n21,524,810\n4.00\n3.23\n3.52\n+0.08\nRecursion Pharmaceuticals Inc.\n19,655,045\n4.87\n4.48\n4.795\n+0.595\nAkanda Corp.\n19,469,279\n1.06\n0.7601\n0.7824\n+0.0374\nPlug Power Inc.\n16,887,896\n2.44\n2.28\n2.34\n+0.05\nStrive Inc.\n15,351,205\n0.8929\n0.831\n0.8915\n+0.0311\nOndas Holdings Inc.\n14,619,220\n8.56\n7.87\n7.965\n-0.125\niShares Ethereum Trust ETF\n14,319,855\n22.89\n21.81\n22.865\n+0.585\nNetflix Inc.\n14,049,533\n97.28\n95.61\n97.045\n+2.475\nWARNER BROS. DISCOVERY INC.\n13,953,899\n28.81\n28.51\n28.765\n-0.135\nOriental Culture Holding Ltd.\n13,211,659\n0.161\n0.1462\n0.151\n+0.0048\nUdemy Inc.\n13,183,116\n7.16\n6.72\n6.8101\n+1.4401\nComcast Corp.\n13,221,956\n30.03\n29.43\n29.95\n+0.22\nAutozi Internet Techn. Global\n12,941,934\n2.2599\n1.96\n2.005\n+0.135\nBitfarms Ltd.\n12,790,026\n2.60\n2.45\n2.59\n+0.16\nTilray Brands Inc.\n11,017,523\n14.70\n13.71\n13.96\n+0.02\nCipher Mining Inc.\n11,000,411\n16.00\n15.00\n15.78\n+0.79\nBroadcom Inc.\n10,817,837\n346.61\n332.10\n334.42\n-6.88\nHUT 8 Corp.\n9,598,051\n44.6999\n40.84\n43.66\n+6.81\nVision Marine Technologies Inc\n9,554,918\n0.79\n0.6419\n0.6598\n-0.3162\nCOREWEAVE INC.\n9,508,503\n69.9897\n65.93\n67.3385\n-2.1615\nAlphabet Inc.\n8,991,761\n308.09\n299.00\n299.9172\n-6.6528\nSoFi Technologies Inc.\n8,739,319\n26.835\n26.16\n26.71\n+0.13\nIREN Ltd.\n8,791,103\n37.39\n35.44\n37.17\n+0.58\nInspire Veterinary Partners In\n8,593,722\n0.049\n0.0455\n0.0459\n-0.0041\nRigetti Computing Inc.\n8,225,094\n25.22\n24.08\n24.76\n+0.80\nOpendoor Technologies Inc.\n8,168,470\n6.88\n6.545\n6.62\n-0.11\nPalantir Technologies Inc.\n8,222,681\n187.745\n184.6167\n187.24\n-0.51\nPMGC Holdings Inc.\n7,922,572\n3.18\n2.8961\n2.97\n-0.315\nRobinhood Markets Inc.\n8,021,514\n124.12\n119.25\n124.1199\n+4.7199\nGrab Holdings Limited\n7,763,298\n4.97\n4.85\n4.91\n-0.04\nLuminar Technologies Inc.\n7,287,425\n0.302\n0.26\n0.2808\n-0.0322\nBeyond Meat Inc.\n7,270,660\n1.13\n1.07\n1.085\n-0.015\nTerawulf Inc.\n7,274,064\n13.64\n12.71\n12.97\n-0.02\nAmerican Airlines Group Inc.\n7,259,913\n16.00\n15.68\n15.945\n-0.045\nInspirato Inc.\n7,177,055\n4.19\n4.13\n4.18\n+1.34\nApplied Digital Corp.\n7,145,479\n24.94\n23.53\n23.96\n-0.28\nMicron Technology Inc.\n7,060,655\n237.45\n232.61\n236.68\n+4.17\nKyverna Therapeutics Inc.\n6,889,452\n7.3182\n6.72\n7.08\n-3.16\nIntel Corp.\n6,879,143\n37.84\n37.22\n37.50\n+0.19\nAmazon.com Inc.\n6,513,776\n225.19\n222.84\n224.12\n+1.56\nurban-gro Inc.\n6,405,873\n0.4401\n0.385\n0.3902\n+0.0352\nMARA Holdings Inc.\n6,358,750\n10.95\n10.51\n10.945\n+0.255\nCleanspark Inc.\n6,298,749\n12.67\n11.835\n12.599\n+0.739\nIovance Biotherapeutics Inc.\n6,283,102\n2.57\n2.265\n2.47\n+0.22\nMilestone Pharmaceuticals Inc.\n6,269,863\n2.205\n2.00\n2.065\n-0.135\nNew Fortress Energy Inc.\n5,833,153\n1.40\n1.2109\n1.315\n+0.145\nVivakor Inc.\n5,440,921\n0.0597\n0.0551\n0.0585\n-0.0012\nRivian Automotive Inc.\n5,384,848\n18.4099\n17.95\n18.165\n+0.265\nMoleculin Biotech Inc.\n5,325,037\n4.2099\n3.63\n3.8987\n-0.7913\nRocket Lab Corp.\n5,335,503\n56.91\n53.35\n55.78\n+0.29\nAdvanced Micro Devices Inc.\n5,332,827\n211.50\n205.97\n207.0699\n-2.1001\nApple Inc.\n5,300,839\n276.16\n274.83\n275.475\n+0.865\nNebius Group N.V.\n5,231,825\n84.30\n77.85\n79.5662\n-1.3838\nDragonfly Energy Holdings Corp\n5,147,893\n0.4377\n0.4109\n0.432\n-0.008\nAlphabet Inc.\n5,106,506\n309.195\n300.26\n301.21\n-6.52\nCheer Holding Inc.\n4,652,044\n0.0429\n0.04\n0.0421\n-0.0003\nKaival Brands Innovations Grp\n4,593,848\n0.23\n0.195\n0.209\n+0.0284\nInno Holdings Inc.\n4,438,621\n0.1158\n0.1087\n0.1093\n-0.0022\nSoundhound AI Inc.\n4,452,146\n11.545\n11.17\n11.54\n+0.43\nJeffs Brands Ltd\n4,056,043\n1.3699\n1.235\n1.33\n+0.10\nQuantum Computing Inc.\n3,837,643\n11.42\n10.945\n11.125\n-0.145\nAmerican Bitcoin Corp.\n3,814,951\n1.74\n1.62\n1.705\n+0.055\nProcessa Pharmaceuticals Inc.\n3,767,834\n8.50\n3.2801\n7.13\n+4.125\nJetblue Airways Corp.\n3,793,411\n5.095\n4.915\n5.065\n+0.125\nHuntington Bancshares Inc.\n3,737,686\n17.905\n17.66\n17.875\n+0.245\nDatavault AI Inc.\n3,798,248\n1.41\n1.335\n1.3655\n-0.0245\nIncannex Healthcare Inc.\n3,707,305\n0.435\n0.4201\n0.4332\n+0.0149\nRichtech Robotics Inc.\n3,389,549\n3.75\n3.53\n3.64\n+0.01\nTraws Pharma Inc.\n3,317,015\n2.1991\n1.795\n1.94\n-0.26\nRezolute Inc.\n3,286,681\n2.07\n1.84\n1.989\n-0.031\nImmunome Inc.\n3,205,482\n21.93\n21.13\n21.3691\n-2.1109\nAGNC Investment Corp.\n3,203,937\n10.55\n10.36\n10.545\n+0.215\nAMC Robotics Corp.\n3,211,800\n12.19\n9.75\n10.70\n-3.95\nStrategy Inc.\n3,214,387\n171.1631\n164.20\n170.3003\n+2.8003\nAST SpaceMobile Inc.\n3,079,780\n70.39\n64.57\n67.78\n-0.59\nBit Digital Inc.\n2,963,107\n2.19\n2.105\n2.16\n+0.06\nMarvell Technology Inc.\n2,985,525\n87.07\n84.21\n86.445\n+2.375\nModerna Inc.\n2,880,707\n31.70\n29.91\n31.50\n+1.61\nRiot Platforms Inc.\n2,736,006\n13.99\n13.47\n13.935\n+0.465\nProfusa Inc.\n2,723,149\n0.1121\n0.106\n0.1078\n-0.0043\nMondelez International Inc.\n2,724,080\n54.33\n53.72\n53.835\n-0.135\nApplied Therapeutics Inc.\n2,723,653\n0.1288\n0.1135\n0.1219\n+0.0012\nCore Scientific Inc. New\n2,690,416\n15.45\n14.61\n14.74\n+0.01\nMicrosoft Corp.\n2,689,123\n478.53\n475.3213\n477.55\n+1.16\nPrecigen Inc.\n2,633,866\n3.99\n3.78\n3.99\n+0.12\nParamount Skydance Corp.\n2,710,659\n13.58\n13.15\n13.17\n-0.68\nCelsius Holdings Inc.\n2,545,752\n42.1339\n40.3601\n40.40\n-2.75\n\nNYSE most active stocks:\n\nStory Continues\nStock Name\nVolume\nHigh\nLow\nLast\nChange\nSnap Inc.\n22,294,742\n7.63\n7.28\n7.63\n+0.26\nOracle Corp.\n14,353,909\n184.70\n179.59\n180.41\n-8.24\nBigBear.ai Holdings Inc.\n13,481,836\n5.98\n5.7158\n5.8036\n-0.0564\nNu Holdings Ltd.\n9,444,986\n16.16\n15.70\n15.8056\n-0.3944\nUWM Holdings Corp.\n9,396,809\n5.01\n4.74\n4.87\n-0.25\nD-Wave Quantum Inc.\n8,836,753\n27.29\n25.83\n26.19\n+0.67\nPfizer Inc.\n8,752,395\n25.49\n25.11\n25.2128\n-0.3172\nFord Motor Co.\n7,370,863\n13.66\n13.455\n13.505\n-0.165\nQuantumScape Corp.\n7,274,055\n12.0699\n11.39\n11.64\n+0.80\nFirst Majestic Silver Corp.\n7,059,462\n17.00\n16.32\n16.56\n+0.16\nVici Properties Inc.\n5,639,731\n28.16\n27.88\n28.135\n-0.175\nTwo Harbors Investment Corp.\n5,660,038\n11.24\n10.73\n11.119\n+1.209\nDow Inc.\n5,244,726\n23.375\n22.91\n23.345\n+0.505\nT1 Energy Inc.\n5,080,718\n5.70\n5.34\n5.59\n+0.15\nIonQ Inc.\n4,989,148\n52.1505\n49.205\n50.345\n+0.675\nBank of America Corp.\n4,903,554\n55.57\n55.12\n55.335\n+0.525\nGeneral Mills Inc.\n4,832,456\n48.78\n47.23\n47.925\n+0.905\nNuScale Power Corp.\n4,789,184\n17.249\n16.535\n16.875\n-0.245\nAT & T Inc.\n4,628,852\n24.36\n24.085\n24.2656\n+0.1956\nUber Technologies Inc.\n4,621,085\n81.30\n79.48\n79.7809\n-1.1391\nTransocean Ltd.\n4,243,245\n3.935\n3.84\n3.905\n+0.065\nArcher Aviation Inc.\n3,844,739\n8.16\n7.91\n8.11\n+0.16\nCoeur Mining Inc.\n3,785,329\n17.53\n16.79\n17.12\n+0.23\nUiPath Inc.\n3,721,464\n16.70\n16.04\n16.63\n+0.54\nEndeavour Silver Corp.\n3,646,423\n9.825\n9.33\n9.60\n+0.28\nChipotle Mexican Grill Inc.\n3,578,912\n37.33\n35.70\n37.165\n+1.505\nCircle Internet Group Inc.\n3,554,599\n85.74\n82.16\n84.301\n+1.301\nLithium Americas Corp.\n3,517,203\n5.15\n4.85\n4.88\n+0.10\nCarnival Corp.\n3,470,252\n28.90\n28.245\n28.69\n+0.49\nKenvue Inc.\n3,463,586\n17.48\n17.245\n17.3499\n+0.0999\nClarivate PLC\n3,445,042\n3.545\n3.28\n3.475\n-0.095\nAMC Entertainment Holdings Inc\n3,404,120\n1.95\n1.92\n1.9401\n+0.0101\nVerizon Communications Inc.\n3,304,833\n40.88\n40.47\n40.605\n-0.145\nHecla Mining Co.\n3,176,017\n19.66\n19.23\n19.50\n+0.48\nBlue Owl Capital Inc.\n3,032,728\n16.22\n15.85\n15.93\n+0.10\nBloom Energy Corp.\n2,931,604\n90.50\n83.02\n83.60\n-4.01\nAlight Inc.\n2,865,715\n2.17\n2.055\n2.17\n+0.11\nHewlett Packard Enterprise Co.\n2,858,089\n24.67\n24.21\n24.35\n+0.05\nNorwegian Cruise Line Holdings\n2,774,910\n22.33\n21.51\n22.27\n+0.73\nCoupang Inc.\n2,709,072\n23.26\n22.535\n22.765\n-0.425\nPlanet Labs PBC\n2,703,452\n18.5499\n17.31\n17.85\n-0.03\nNIKE Inc.\n2,503,861\n66.83\n65.7388\n66.62\n-0.50\nHP Inc.\n2,448,860\n24.89\n24.235\n24.38\n-0.45\nBarrick Mining Corp.\n2,447,844\n43.87\n43.065\n43.44\n+0.51\nBaytex Energy Corp.\n2,440,175\n3.10\n3.045\n3.075\n+0.065\nJoby Aviation Inc.\n2,325,018\n14.50\n14.035\n14.19\n+0.12\nLennar Corp.\n2,243,637\n116.54\n111.11\n113.305\n-4.265\nOccidental Petroleum Corp.\n2,233,892\n39.74\n39.26\n39.6893\n+0.7693\nExxon Mobil Corp.\n2,221,540\n115.99\n115.17\n115.68\n+1.00\nCoursera Inc.\n2,228,570\n8.89\n8.29\n8.455\n+0.515\nWalt Disney Co., The\n2,172,244\n112.13\n110.59\n111.97\n+0.35\nOklo Inc.\n2,141,796\n85.58\n80.31\n81.62\n-1.89\nVertiv Holdings Co.\n2,144,167\n161.01\n153.1033\n154.55\n-6.11\nCNH Industrial N.V.\n2,010,101\n9.82\n9.53\n9.815\n+0.185\nProcter & Gamble Co., The\n1,976,076\n148.055\n146.45\n147.09\n+1.88\nFreeport-McMoRan Inc.\n1,949,148\n48.21\n47.43\n48.025\n+0.485\nCompass Inc.\n1,946,852\n11.02\n10.83\n10.985\n+0.105\nSLB Ltd.\n1,931,779\n38.185\n37.725\n38.045\n+0.435\nBaxter International Inc.\n1,896,751\n19.37\n18.97\n19.325\n+0.275\nKeycorp\n1,902,680\n20.88\n20.62\n20.8621\n+0.2821\nWeyerhaeuser Co.\n1,843,781\n23.955\n23.375\n23.88\n+0.60\nVirgin Galactic Holdings Inc.\n1,862,254\n3.30\n3.035\n3.285\n+0.185\nRedwire Corp.\n1,834,395\n7.02\n6.5445\n6.74\n+0.15\nBoston Scientific Corp.\n1,828,151\n95.285\n93.58\n95.245\n+2.295\nRocket Companies Inc.\n1,822,301\n18.455\n18.1201\n18.405\n+0.185\nDestiny Tech100 Inc.\n1,816,207\n34.78\n32.435\n32.73\n+2.73\nGap Inc.\n1,799,907\n28.095\n27.35\n27.85\n+0.79\nSouthwest Airlines Co.\n1,795,674\n42.83\n41.91\n42.65\n+0.48\nCoca-Cola Co., The\n1,781,039\n70.835\n70.315\n70.40\n+0.03\nBristol-Myers Squibb Co.\n1,776,276\n54.49\n53.87\n53.9769\n-0.2531\nEnergy Transfer L.P.\n1,737,206\n16.4263\n16.31\n16.33\n-0.03\nAMCOR PLC\n1,731,132\n8.4299\n8.28\n8.415\n+0.095\nDevon Energy Corp.\n1,720,175\n36.35\n35.61\n36.315\n+1.225\nNextdoor Holdings Inc.\n1,713,640\n2.24\n2.12\n2.14\n-0.09\nHalliburton Co.\n1,664,617\n27.735\n27.32\n27.615\n+0.425\nCleveland-Cliffs Inc.\n1,661,656\n13.16\n12.845\n12.945\n+0.025\nBoeing Co.\n1,606,872\n210.58\n206.25\n210.5656\n+3.8556\nAMPRIUS TECHNOLOGIES INC\n1,579,857\n10.36\n9.44\n9.73\n-0.55\nPinterest Inc.\n1,583,147\n26.395\n25.67\n26.195\n+0.415\nHims & Hers Health Inc.\n1,563,872\n37.20\n36.3691\n37.16\n+0.30\nOrchid Island Capital Inc.\n1,536,274\n7.39\n7.30\n7.38\n+0.10\nKinross Gold Corp.\n1,532,033\n28.29\n27.60\n27.91\n+0.10\nKosmos Energy Ltd.\n1,480,508\n1.00\n0.9511\n0.9589\n-0.0096\nSable Offshore Corp.\n1,445,248\n5.55\n5.07\n5.375\n-0.055\nPan American Silver Corp.\n1,431,289\n50.505\n49.37\n50.10\n+0.84\nMerck & Co. Inc.\n1,417,063\n99.085\n98.06\n98.62\n+0.35\nAvantor Inc.\n1,410,610\n11.49\n10.915\n11.475\n+0.275\nTeck Resources Ltd.\n1,396,251\n44.96\n44.38\n44.695\n+1.525\nBlackBerry Ltd.\n1,361,547\n4.435\n4.37\n4.425\n+0.035\nCorebridge Financial Inc.\n1,351,443\n31.985\n31.355\n31.355\n-0.655\nZim Integrated Shipp.Serv.Ltd.\n1,324,316\n20.85\n20.00\n20.30\n+0.28\nAmer. Eagle Outfitters Inc.\n1,312,951\n27.73\n27.05\n27.60\n+0.24\nLyondellbasell Industries NV\n1,270,191\n44.385\n42.95\n44.24\n+1.26\nCenovus Energy Inc.\n1,262,333\n17.13\n16.835\n16.95\n+0.12\nGeneral Motors Co.\n1,251,041\n81.49\n80.68\n81.04\n-0.72\nU.S. Bancorp\n1,245,786\n54.035\n53.58\n53.975\n+0.505\nNewmont Corp.\n1,241,783\n99.95\n98.32\n99.13\n+1.10\nWells Fargo & Co.\n1,249,605\n93.27\n92.66\n93.115\n+0.925\nPG & E Corp.\n1,241,588\n15.42\n15.27\n15.4039\n+0.1339\nCoherent Corp.\n1,228,804\n186.67\n176.32\n178.175\n+2.975\n\nNYSE American most active stocks:\nStock Name\nVolume\nHigh\nLow\nLast\nChange\ncbdMD Inc.\n78,781,140\n2.46\n1.92\n2.26\n+0.83\nSRX HealthSolutions Inc.\n18,362,414\n0.38\n0.3302\n0.3488\n-0.0281\nBitMine Immersion Techno. Inc.\n12,267,663\n32.225\n30.22\n31.865\n+0.475\nHyperscale Data Inc.\n5,606,517\n0.27\n0.2532\n0.2665\n+0.0068\nB2Gold Corp.\n5,561,716\n4.62\n4.5407\n4.565\n+0.015\nVolitionRX Ltd.\n5,526,811\n0.3049\n0.2798\n0.3011\n+0.059\nDenison Mines Corp.\n4,206,363\n2.64\n2.58\n2.615\n+0.015\nNew Gold Inc.\n3,065,701\n8.52\n8.1701\n8.33\n+0.10\nNuburu Inc.\n3,001,877\n0.2024\n0.196\n0.2021\n-0.0018\nPlatinum Group Metals Ltd.\n2,818,463\n2.9494\n2.68\n2.73\n-0.01\nTechcreate Group Ltd.\n2,093,092\n5.83\n5.52\n5.645\n-0.075\nEquinox Gold Corp.\n1,757,330\n14.295\n13.84\n13.8886\n-0.0214\nSilvercorp Metals Inc.\n1,745,665\n8.85\n8.53\n8.665\n+0.075\nAvino Silver & Gold Mines Ltd.\n1,677,198\n6.38\n6.17\n6.2728\n+0.1028\nNorthern Dynasty Minls Ltd.\n1,618,256\n2.205\n2.0795\n2.115\n+0.035\nIGC Pharma Inc.\n1,231,806\n0.36\n0.34\n0.3486\n+0.0126\nTheriva Biologics Inc.\n1,151,534\n0.2063\n0.1865\n0.1913\n-0.0155\nUr-Energy Inc.\n1,137,000\n1.36\n1.30\n1.335\n+0.025\nKULR Technology Group Inc.\n1,048,605\n3.6756\n3.38\n3.4258\n+0.1358\nTrilogy Metals Inc.\n1,027,990\n4.78\n4.415\n4.55\n+0.13\nEnergy Fuels Inc.\n971,198\n14.4204\n13.9394\n14.165\n+0.085\nUranium Energy Corp.\n960,215\n12.535\n12.2245\n12.335\n+0.195\nI-80 Gold Corp.\n901,488\n1.50\n1.46\n1.485\n+0.005\nStandard Lithium Ltd.\n832,059\n4.99\n4.78\n4.8899\n+0.2099\nVizsla Silver Corp.\n730,017\n5.31\n5.115\n5.19\n+0.04\nOcean Power Technologies Inc.\n716,690\n0.3525\n0.34\n0.3508\n+0.0117\nUnited States Antimony Corp.\n701,734\n5.0802\n4.845\n4.92\n-0.06\nCleancore Solutions Inc.\n687,066\n0.3041\n0.2837\n0.2977\n+0.0164\nGold Resource Corp.\n676,114\n0.89\n0.85\n0.8598\n-0.0202\nVista Gold Corp.\n611,557\n2.21\n2.0408\n2.085\n-0.065\nAmericas Gold & Silver Corp.\n577,368\n5.70\n5.52\n5.6399\n+0.0699\nGoldMining Inc.\n570,920\n1.3288\n1.30\n1.305\n-0.005\nChowChow Cloud Int.Hldgs Ltd.\n554,955\n1.20\n1.05\n1.095\n+0.015\nAgEagle Aerial Systems Inc.\n530,629\n1.0701\n1.03\n1.035\n-0.025\nAmaze Holdings Inc.\n518,249\n0.3554\n0.3201\n0.3473\n-0.0085\nTaseko Mines Ltd.\n492,091\n5.33\n5.215\n5.225\n+0.025\nAtlasclear Holdings Inc.\n475,830\n0.3095\n0.2969\n0.3091\n+0.0156\nOrla Mining Ltd. (new)\n377,700\n13.83\n13.35\n13.44\n-0.11\nGold Royalty Corp.\n368,639\n4.12\n4.005\n4.025\n-0.045\nNew Pacific Metals Corp.\n346,577\n3.83\n3.7019\n3.80\n+0.13\nPerspective Therapeutics Inc.\n290,592\n2.84\n2.695\n2.715\n-0.125\nGaliano Gold Inc.\n270,175\n2.485\n2.415\n2.44\n+0.02\nDolly Varden Silver Corp.\n261,050\n4.63\n4.53\n4.615\n+0.105\nPhaos Technology Holdings (Cay\n252,768\n3.76\n3.67\n3.74\n0.00\nCybin Inc.\n239,261\n7.03\n6.77\n6.8227\n+0.1627\nRing Energy Inc.\n235,786\n0.86\n0.8411\n0.8517\n+0.0139\nCornerstone Strat.Val.Fd Inc.\n222,477\n8.20\n8.17\n8.196\n+0.036\nUnusual Machines Inc.\n218,577\n9.7063\n9.245\n9.42\n+0.12\nNovaGold Resources Inc.\n209,143\n9.84\n9.70\n9.765\n+0.075\nIntl Tower Hill Mines Ltd.\n203,731\n1.96\n1.87\n1.93\n+0.05\nWestwater Resources Inc.\n184,851\n0.945\n0.9074\n0.9191\n+0.013\nNew Found Gold Corp.\n184,012\n2.77\n2.69\n2.715\n-0.005\nIntegra Resources Corp.\n182,166\n4.17\n4.07\n4.125\n+0.095\nComstock Inc.\n178,355\n3.6338\n3.47\n3.54\n-0.04\nNovabay Pharmaceuticals Inc.\n170,281\n3.40\n3.10\n3.38\n+0.22\nMICROPOLIS Holding Co.\n169,357\n1.38\n1.35\n1.35\n+0.05\nAris Mining Corp.\n168,873\n15.75\n15.38\n15.50\n+0.01\nTRX Gold Corp.\n165,452\n0.8838\n0.8603\n0.8698\n-0.012\nCornerstone Total Return Fund\n162,921\n7.8403\n7.80\n7.82\n+0.02\nJM Group Ltd.\n156,396\n5.70\n4.95\n5.6481\n+0.6481\nPower REIT\n130,791\n1.095\n0.9823\n1.07\n+0.1266\nCastellum Inc.\n126,695\n1.06\n1.03\n1.0448\n+0.0148\nGamco Gl.Gold Nat.Res.&Inc.Tr.\n124,446\n5.15\n5.09\n5.1413\n+0.0513\nGenius Group Ltd.\n124,284\n0.6688\n0.6501\n0.6578\n-0.006\nIndonesia Energy Corp. Ltd.\n124,056\n2.92\n2.87\n2.8801\n+0.0501\nFury Gold Mines Ltd.\n122,795\n0.6115\n0.6001\n0.6003\n+0.0007\nIvanhoe Electric Inc.\n118,499\n14.64\n14.37\n14.56\n+0.29\nEON Resources Inc.\n117,843\n0.39\n0.38\n0.387\n+0.0138\nDakota Gold Corp.\n114,428\n5.706\n5.60\n5.6613\n+0.1413\nTecogen Inc. (New)\n104,132\n5.3708\n5.1801\n5.365\n+0.025\nLineage Cell Therapeutics Inc.\n100,993\n1.81\n1.754\n1.785\n-0.015\nXtant Medical Holdings Inc.\n96,356\n0.78\n0.75\n0.7734\n+0.0384\nWestern Copper & Gold Corp.\n89,100\n2.64\n2.5601\n2.60\n+0.04\nRiley Exploration Permian Inc.\n83,897\n27.50\n26.56\n26.81\n+1.47\nMAIA Biotechnology Inc.\n82,162\n1.25\n1.21\n1.2345\n+0.0045\nAeon Biopharma Inc.\n78,859\n1.06\n1.015\n1.0301\n+0.0001\nNeub.Ber.Real Est.Secs Inc.Fd\n75,550\n2.945\n2.91\n2.9372\n+0.0072\nEaton Vance Municipal Bond Fd\n75,306\n9.7655\n9.739\n9.755\n-0.015\nHyliion Holdings Corp.\n70,392\n1.842\n1.80\n1.825\n+0.005\nMetalla Royalty&Streaming Ltd.\n69,979\n7.99\n7.82\n7.875\n-0.015\nNanoviricides Inc.\n68,218\n1.35\n1.28\n1.29\n0.00\nStereotaxis Inc.\n68,200\n2.405\n2.35\n2.39\n+0.01\nCboe Global Markets Inc.\n67,238\n253.70\n249.35\n252.54\n+3.55\nBrazil Potash Corp.\n64,949\n2.10\n2.042\n2.042\n+0.062\nImperial Oil Ltd.\n64,403\n86.18\n84.94\n85.59\n+0.30\nOS Therapies Inc.\n58,569\n1.65\n1.63\n1.65\n+0.03\nParamount Gold Nevada Corp.\n58,458\n1.21\n1.18\n1.1873\n+0.0073\nEaton Vance Ltd.Durat.Inc.Fd.\n57,658\n9.92\n9.88\n9.885\n-0.005\nGran Tierra Energy Inc.\n57,032\n3.92\n3.78\n3.82\n+0.06\nProtalix BioTherapeutics Inc.\n53,964\n1.85\n1.81\n1.83\n+0.02\nGEE Group Inc.\n50,273\n0.1865\n0.1862\n0.1864\n+0.0001\nKAIROS Pharma Ltd.\n49,642\n0.759\n0.739\n0.74\n+0.001\nIdaho Strategic Resources Inc.\n45,373\n46.33\n44.00\n44.4795\n+0.2095\nAzitra Inc.\n43,761\n0.3047\n0.2927\n0.2967\n-0.0034\nSilynx Communications Ltd.\n40,718\n0.86\n0.8012\n0.85\n+0.07\nReaves Utility Income Fund\n40,710\n37.0498\n36.68\n36.71\n-0.50\nClough Global Opportunities FD\n40,287\n5.57\n5.5301\n5.5624\n-0.0606\nZedge Inc.\n40,100\n2.93\n2.78\n2.86\n+0.03\nVenu Holding Corp.\n38,932\n8.97\n8.82\n8.835\n+0.055\nUSBC Inc.\n38,158\n0.7156\n0.6849\n0.6897\n-0.0083\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "23:19:21",
      "Source": "MT Newswires",
      "Title": "Nebius Launches AI Cloud 3.1 Featuring Nvidia Blackwell Ultra Chips",
      "URL": "https://finance.yahoo.com/news/nebius-launches-ai-cloud-3-151921427.html",
      "Content": "PREMIUM\nNebius Launches AI Cloud 3.1 Featuring Nvidia Blackwell Ultra Chips\n\nMT Newswires\nWed, December 17, 2025 at 7:19 AM PST\n\nIn this article: NBIS\n\nNVDA\n\nNebius Group (NBIS) launched its Nebius AI Cloud 3.1, adding Nvidia (NVDA) Blackwell Ultra computing\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "23:15:41",
      "Source": "24/7 Wall St.",
      "Title": "Amazon Set to Waste $10 Billion on OpenAI",
      "URL": "https://finance.yahoo.com/m/26ad52f9-2ade-3d18-8428-b999dfd1b853/amazon-set-to-waste-%2410.html",
      "Content": "Amazon Set to Waste $10 Billion on OpenAI\n\nDouglas A. McIntyre\nWed, December 17, 2025 at 7:15 AM PST 3 min read\n\nIn this article: AMZN\n\nNVDA\n\nGOOG\n\nOPAI.PVT\n\nMSFT\n\nAmazon.com Inc. ( NASDAQ: AMZN ) apparently cannot help itself. Media reports say it plans to invest $10 billion into OpenAI.\n24/7 Wall St. Key Points Amazon.com Inc. ( NASDAQ: AMZN ) reportedly plans to invest $10 billion into OpenAI, a firm swarmed by competition.\nClearly, Amazon is trying to buy its way into the AI market when the bubble may be about to burst.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality. Read more here .\n\nOpenAI, which until recently has been the leading artificial intelligence (AI) company in the world, has raised money from a long list of investors. Some are venture capitalists who are simply writing checks to get returns. However, another list consists of money or strategic deals with Microsoft, Oracle, Softbank, Nvidia, and, soon, Disney.\nWhat these tech investors are getting is a stake in a company that has had its spot at the top of the industry challenged by Gemini 3. That is an Alphabet Inc. ( NASDAQ: GOOGL ) offering. It is also one that the company says will not make money until 2030, one that will need hundreds of billions of dollars to hit its ambiguous goals, and one that has a growing number of direct competitors. These competitors include divisions of public companies, well-funded xAI and Anthropic, and a legion of smaller companies.\n\nBloomberg reports, “OpenAI is in initial discussions to raise at least $10 billion from Amazon.com Inc. and use its chips, a potential win for the online retailer’s effort to broaden its AI industry presence and compete with Nvidia Corp.” Amazon is a tiny player in the AI chip business. Nvidia Corp. ( NASDAQ: NVDA ) dominates, with a market cap of $4.33 trillion, which makes it the most valuable company in the world. Put plainly, the Amazon deal is part of the dangerous “round tripping” that goes on in the industry. One company invests in another. The company that gets the investment uses the money to buy products or services from the investor.\nAmazon clearly has little chance of competing head-to-head with Nvidia, so it is buying its way into the market. And Amazon can hardly say it is getting special treatment from OpenAI. The Financial Times reports, “OpenAI has already locked in $1.5tn in long-term deals with Nvidia, Oracle, AMD and Broadcom to supply chips and other computing infrastructure.”\nOpenAI does have one important strategic advantage in an Amazon deal. Like the rest of the AI world, it does not want to be trapped in a world where Nvidia is the only arms supplier.\n\nStory Continues\nPeople have begun to ask whether the AI industry has created a valuation bubble. They are worried that the companies leading the race into AI will never make money. Many AI products are currently free. Investors worry that the data centers needed to run AI will take years to build and may not have enough electricity to run them. Still others believe that not all the large AI companies can survive in a brutally competitive market. The total of these investments will eventually move into the trillions of dollars.\n\nThe Amazon deal with OpenAI is another example that the train has run off the rails.\nAmazon Stock Price Prediction and Forecast 2025–2030\n\nThe New Report Shaking Up Retirement Plans You may think retirement is about picking the best stocks or ETFs, but you’d be wrong. Even great investments can be a liability in retirement. It’s a simple difference between accumulating vs distributing, and it makes all the difference.\nThe good news? After answering three quick questions many Americans are reworking their portfolios and finding they can retire earlier than expected. If you’re thinking about retiring or know someone who is, take 5 minutes to learn more here .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "23:02:53",
      "Source": "Reuters",
      "Title": "Exclusive-Google works to erode Nvidia's software advantage with Meta's help",
      "URL": "https://finance.yahoo.com/news/exclusive-google-works-erode-nvidias-150253328.html",
      "Content": "Exclusive-Google works to erode Nvidia's software advantage with Meta's help\n\nReuters\nWed, December 17, 2025 at 7:02 AM PST 5 min read\n\nIn this article: GOOG\n\nMETA\n\nNVDA\n\nAMD\n\nDec 17 (Reuters) - Alphabet's Google is working on a new initiative to make its artificial intelligence chips better at running PyTorch, the world’s most widely used AI software framework, in a move aimed at weakening Nvidia 's longstanding dominance of the AI computing market, according to people familiar with the matter.\n\nThe effort is part of Google's aggressive plan to make its Tensor Processing ​Units a viable alternative to Nvidia's market-leading GPUs. TPU sales have become a crucial growth engine of Google's cloud revenue as it seeks to prove to investors that its AI investments are generating returns.\nBut ‌hardware alone is not enough to spur adoption. The new initiative, known internally as “TorchTPU,” aims to remove a key barrier that has slowed adoption of TPU chips by making them fully compatible and developer-friendly for customers who have already built their tech infrastructure using PyTorch software, the ‌sources said. Google is also considering open-sourcing parts of the software to speed uptake among customers, some of the people said.\n\nCompared with earlier attempts to support PyTorch on TPUs, Google has devoted more organizational focus, resources and strategic importance to TorchTPU, as demand grows from companies that want to adopt the chips but view the software stack as a bottleneck, the sources said.\nPyTorch, an open-source project heavily supported by Meta Platforms, is one of the most widely used tools for developers who make AI models. In Silicon Valley, very few developers write every line of code that chips from Nvidia, Advanced Micro Devices or Google will actually execute.\nInstead, those developers rely on tools like PyTorch, which is a ⁠collection of pre-written code libraries and frameworks that automate many common tasks in ‌developing AI software. Originally released in 2016, PyTorch’s history has been closely tied to Nvidia’s development of CUDA, the software that some Wall Street analysts regard as the company’s strongest shield against competitors.\n\nNvidia’s engineers have spent years ensuring that software developed with PyTorch runs as fast and efficiently as possible on its chips. Google, by contrast, has long ‍had its internal armies of software developers use a different code framework called Jax, and its TPU chips use a tool called XLA to make that code run efficiently. Much of Google’s own AI software stack and performance optimization has been built around Jax, widening the gap between how Google uses its chips and how customers want to use them.\nA Google Cloud spokesperson did not comment on the specifics of the project, but confirmed to Reuters that the move would provide customers with choice.\n\nStory Continues\n\"We ​are seeing massive, accelerating demand for both our TPU and GPU infrastructure,\" the spokesperson said. \"Our focus is providing the flexibility and scale developers need, regardless of the hardware they choose to build on.\"\nTPU FOR CUSTOMERS\nAlphabet had ‌long reserved the lion’s share of its own chips, or TPUs, for in-house use only. That changed in 2022, when Google’s cloud computing unit successfully lobbied to oversee the group that sells TPUs. The move drastically increased Google Cloud's allocation of TPUs and as customers' interest in AI has grown, Google has sought to capitalize by ramping up production and sales of TPUs to external customers.\n\nBut the mismatch between the PyTorch frameworks used by most of the world’s AI developers and the Jax frameworks that Google’s chips are currently most finely tuned to run means that most developers cannot easily adopt Google’s chips and get them to perform as well as Nvidia’s without undertaking significant, extra engineering work. Such work takes time and money in the fast-paced AI race.\nIf successful, Google's “TorchTPU” initiative could significantly reduce switching costs for companies that want alternatives to Nvidia’s GPUs. Nvidia’s dominance has been reinforced ⁠not only by its hardware but by its CUDA software ecosystem, which is deeply embedded in PyTorch and has become the ​default method by which companies train and run large AI models.\n\nEnterprise customers have been telling Google that TPUs are harder to adopt ​for AI workloads because they historically required developers to switch to Jax, a machine-learning framework favored internally at Google, rather than PyTorch, which most AI developers already use, the sources said.\nJOINT EFFORTS WITH META\nTo speed development, Google is working closely with Meta, the creator and steward of PyTorch, according to the sources. The two tech giants have been discussing deals ‍for Meta to access more TPUs, a move first reported ⁠by The Information.\nEarly offerings for Meta were structured as Google-managed services, in which customers like Meta installed Google's chips designed to run Google software and models, with Google providing operational support. Meta has a strategic interest in working on software that makes it easier to run TPUs, in a bid to lower inference costs and diversify its AI infrastructure away from Nvidia’s GPUs to gain negotiating power, the people ⁠said.\n\nMeta declined to comment.\nThis year, Google has begun selling TPUs directly into customers’ data centers rather than limiting access to its own cloud. Amin Vahdat, a Google veteran, was named head of AI infrastructure this month, reporting directly to CEO Sundar Pichai.\nGoogle needs that ‌infrastructure both to run its own AI products, including the Gemini chatbot and AI-powered search, and to supply customers of Google Cloud, which sells access to TPUs to companies such as ‌Anthropic.\n(Reporting by Krystal Hu, Kenrick Cai and Stephen Nellis in San Francisco; Editing by Kenneth Li and Matthew Lewis)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:59:37",
      "Source": "Investor's Business Daily",
      "Title": "This Tech Play Smokes Google, Nvidia, And All Mag 7 Stocks Year To Date – And Eyes New Breakout",
      "URL": "https://finance.yahoo.com/m/81729e8d-b499-3eb0-8db4-96d7a2bed604/this-tech-play-smokes-google%2C.html",
      "Content": "This Tech Play Smokes Google, Nvidia, And All Mag 7 Stocks Year To Date – And Eyes New Breakout\n\nMATTHEW GALGANI\nWed, December 17, 2025 at 6:59 AM PST 3 min read\n\nIn this article: NVDA\n\nALNT\n\nGOOG\n\nSEI\n\nNVT\n\nBoosted by a sharp turnaround in growth and demand from top funds, Allient stock has smashed all Mag 7 stocks year to date.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:55:43",
      "Source": "24/7 Wall St.",
      "Title": "This $500k Retirement Portfolio Pays $7,700 Per Month",
      "URL": "https://finance.yahoo.com/m/205e1dc0-caf7-3de2-add0-5f10a0720bb9/this-%24500k-retirement.html",
      "Content": "This $500k Retirement Portfolio Pays $7,700 Per Month\n\nOmor Ibne Ehsan\nWed, December 17, 2025 at 6:55 AM PST 6 min read\n\nIn this article: SI=F\n\nTLT\n\nNVDA\n\nTLTW\n\nJEPI\n\nQuick Read iShares 20+ Year Treasury Bond Buywrite Strategy ETF (TLTW) yields 13.92% through covered calls on long-term Treasury bonds.\nTLTW holdings likely benefit from Fed rate cuts as long-term bonds increase in value.\nA three-ETF strategy combining TLTW with gold and silver covered call funds targets 18.5% total yield.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality. Read more here .\n\nIf you want a $7.7k monthly income on a $500k portfolio, some may call you crazy, but it is still possible. ETFs like the iShares 20+ Year Treasury Bond Buywrite Strategy ETF ( BATS:TLTW ) , FT Vest Gold Strategy Target Income ETF (BATS:IGLD) , and the Ubs Ag Etracs Silver Shares Covered Call ETN Exp 21 Apr 2033 (NASDAQ:SLVO) give you very high yields and a respectable safety profile that can boost your yields massively if you put them in your portfolio.\nThe catch is that these ETFs alone should not constitute your entire portfolio. If you have a portfolio of, say, $1 million, and you want a little more income, you can set aside $500k to higher-yielding ETFs like these to boost your overall income while having some funds to fall back on just in case they don't do as well.\n\nIf not, you should only chase more yield if you fall into any of the two following categories:\nYou are nearing the end of your retirement, and you want to end it lavishly.\nYou're struggling to make ends meet, and you're willing to sacrifice some safety for yield.\nA $500k portfolio churning out $7.7k per month means $92.4k a year, or an 18.5% yield. The following 3 ETFs can make that happen. You can squeeze out even more yield if you allocate more money to the higher-yielding ones, but I'll assume you're just going to split your money equally among them for the sake of this article.\nFT Vest Gold Strategy Target Income ETF (IGLD) The FT Vest Gold Strategy Target Income ETF gives you exposure to the price movements of gold via the popular SPDR Gold Trust ETF ( NYSEARCA:GLD ) while also generating a consistent monthly income. Simply put, it tracks gold but adds extra income by writing call options on gold and then collecting premiums.\n\nYour typical covered call ETF that targets the stock market also generates its income this way. The difference is that gold is much more likely to stay solid through a recession. One bad jobs report, or a major company like Nvidia ( NASDAQ:NVDA ) reporting a bad quarter, can send covered-call ETFs like JPMorgan Equity Premium Income ETF ( NYSE:JEPI ) down by double digits. They're only flashy today due to the extended rally.\n\nStory Continues\nIGLD has a stronger foundation as gold itself looks incredibly strong right now, with central banks worldwide stockpiling gold. Sanctions on Russia have caused gold exports from the country to plunge. It's a triple whammy that favors gold when you take the shaky global economy into account.\nIGLD yields 7.39% with an expense ratio of 0.85%, or $85 per $10,000. It's steep, but you won't find a higher-yielding name if you want to buy something that targets GLD.\n\niShares 20+ Year Treasury Bond Buywrite Strategy ETF (TLTW) The iShares 20+ Year Treasury Bond Buywrite Strategy ETF executes a very similar strategy, this time with U.S. Treasury bonds. It holds shares of another ETF called the iShares 20+ Year Treasury Bond ETF ( NASDAQ:TLT ) , which holds U.S. bonds expiring in 20+ years.\nThen, it uses monthly covered call options on those holdings to boost income.\n\nAgain, this is much better than your run-of-the-mill covered call ETF in terms of safety. Bonds are not going to shift under your feet, because they're the safest asset you can hold. Besides, you are likely to get upside on top of the generous yield as Fed interest rates come down. The Fed lowered its interest rates last week, and this is going to make long-term bonds more expensive as they already have secured a higher yield until they mature.\nAnd even if a recession hits, I expect TLTW and TLT to go up, not down. TLT went from $95 to over $122 in a few months as interest rates were cut drastically in 2008. Today, TLT trades below $90 and snaps back quickly as Wall Street gets hungrier for yield. This will translate into more upside for TLTW, as it holds TLT.\n\nThe catch is that TLTW will underperform if the TLT remains flat, which is unlikely to stand the case as the Fed is cutting.\nTLTW yields 13.92%. The expense ratio is 0.35%, or $35 per $10,000.\nUbs Ag Etracs Silver Shares Covered Call ETN Exp 21 Apr 2033 (SLVO) The Ubs Ag Etracs Silver Shares Covered Call ETN Exp 21 Apr 2033 tracks the performance of an index that mimics owning shares of a silver ETF. You benefit from rises in silver prices, but your upside is capped each month. It's very similar to IGLD but more aggressive.\nDo note that this is not an ETF. It is a debt note from UBS (credit risk involved), and it matures on April 21, 2033.\n\nSLVO has long been a loser in the market, as it did not offer any capital appreciation until very recently. If you reinvested the dividends, it would still get you 2% to 3% a year.\nHowever, what changed the equation is that silver prices have tripled since 2024. This is due to unceasing demand from multiple sectors like solar, AI, and more. Plus, silver is seen as a safe haven like gold. Many believe it can still deliver multibagger returns from here as silver's valuation still pales in comparison to the historical gold/silver ratio.\nSLVO is very under-the-radar and gets you a 34.73% yield. The expense ratio is 0.65%, or $65 per $10,000.\nThe New Report Shaking Up Retirement Plans You may think retirement is about picking the best stocks or ETFs, but you’d be wrong. Even great investments can be a liability in retirement. It’s a simple difference between accumulating vs distributing, and it makes all the difference.\nThe good news? After answering three quick questions many Americans are reworking their portfolios and finding they can retire earlier than expected. If you’re thinking about retiring or know someone who is, take 5 minutes to learn more here .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:49:03",
      "Source": "Investor's Business Daily",
      "Title": "OpenAI In Talks To Get $10 Billion Amazon Investment, Use Its Chips: The Information",
      "URL": "https://finance.yahoo.com/m/2726b9b8-789b-3d00-8ef3-494b9b80d8bf/openai-in-talks-to-get-%2410.html",
      "Content": "OpenAI In Talks To Get $10 Billion Amazon Investment, Use Its Chips: The Information\n\nED CARSON\nWed, December 17, 2025 at 6:49 AM PST 1 min read\n\nIn this article: AMZN\n\nNVDA\n\nAVGO\n\nAMD\n\nORCL\n\nAmazon is in talks to invest at least $10 billion in OpenAI, which would use the e-commerce giant's in-house AI chips.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:38:45",
      "Source": "GuruFocus.com",
      "Title": "Amazon's $10 Billion AI Power Play: OpenAI Deal Could Disrupt Nvidia's Chip Empire",
      "URL": "https://finance.yahoo.com/news/amazons-10-billion-ai-power-143845969.html",
      "Content": "Amazon's $10 Billion AI Power Play: OpenAI Deal Could Disrupt Nvidia's Chip Empire\n\nKhac Phu Nguyen\nWed, December 17, 2025 at 6:38 AM PST 2 min read\n\nIn this article: AMZN\n\nNVDA\n\nOPAI.PVT\n\nMSFT\n\nThis article first appeared on GuruFocus .\nPeople familiar with the matter have indicated that OpenAI is in early-stage discussions to raise at least $10 billion from Amazon ( NASDAQ:AMZN ), a development that could expand Amazon's role in the AI ecosystem while potentially increasing competitive pressure on Nvidia (NVDA). The talks, which remain preliminary and subject to change, could value OpenAI north of $500 billion and may involve the ChatGPT creator adopting Amazon's Trainium chips. If the discussions progress, the arrangement could represent an incremental but meaningful step for Amazon's semiconductor ambitions, particularly as large AI developers begin to test alternatives to Nvidia's dominant GPU offerings.\n\nWarning! GuruFocus has detected 3 Warning Sign with MSFT.\nIs MSFT fairly valued? Test your thesis with our free DCF calculator.\nTrainium is positioned as a core part of Amazon's broader AI strategy alongside Amazon Web Services, which remains the largest global provider of cloud computing and data storage. Despite that scale, AWS has faced stiff competition in attracting AI developers from rivals such as Microsoft ( NASDAQ:MSFT ), one of OpenAI's largest backers, as well as platforms linked to Alphabet ( NASDAQ:GOOG ) and Meta Platforms ( NASDAQ:META ), both of which have been evaluating non-Nvidia chip options. Amazon has suggested that Trainium chips could handle AI workloads more cheaply and efficiently than Nvidia's market-leading GPUs, an argument aimed at customers seeking cost-effective infrastructure as AI spending accelerates.\n\nThe negotiations between OpenAI and Amazon reportedly began around October, following a corporate restructuring at OpenAI that resulted in Microsoft taking a 27% ownership stake after nearly a year of talks. OpenAI was most recently valued at $500 billion in an employee share sale, briefly placing it ahead of SpaceX as the world's largest startup and highlighting the intensity of investor interest in AI leaders. At the same time, some market observers have warned that parts of the AI funding cycle could be vulnerable to excess, particularly where capital flows loop between suppliers and customers. Notably, OpenAI and Amazon announced last month that AWS will provide $38 billion of cloud computing capacity over seven years, a deal centered on hundreds of thousands of Nvidia chips, suggesting that any future shift toward Trainium would unfold alongside, rather than immediately replace, existing infrastructure commitments.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:35:00",
      "Source": "Motley Fool",
      "Title": "This $200 Billion Streaming Giant Is Partnering With a Top AI Company (Hint: It's Not Nvidia)",
      "URL": "https://finance.yahoo.com/m/bd1b82a5-48d2-35de-a53e-59bc9c745190/this-%24200-billion-streaming.html",
      "Content": "This $200 Billion Streaming Giant Is Partnering With a Top AI Company (Hint: It's Not Nvidia)\n\nNeil Patel, The Motley Fool\nWed, December 17, 2025 at 6:35 AM PST 4 min read\n\nIn this article: NVDA\n\nKey Points A well-known media and entertainment powerhouse inked a three-year deal with the creator of the most popular large language model.\nThis move demonstrates just how valuable it is to own high-quality intellectual property, which can be monetized in unique ways.\nInvestors seeking value in today’s market are in luck.\n10 stocks we like better than Walt Disney ›\n\nDespite fears of a possible bubble bursting, artificial intelligence (AI) is a technology that increasingly looks like it's not going away. There are already businesses winning the AI race, whether they make hardware, operate cloud platforms, or run the large language models that have become so popular among consumers.\nBut other industries are starting to embrace AI instead of fighting it, showcasing how seriously executive teams are taking this new technology to bolster their competitive positions.\nIn fact, a prominent streaming giant just decided to partner with a top AI company in a move that could impact the media and entertainment sector. Investors should take notice.\nThe House of Mouse is leaning into AI It was announced on Dec. 11 that Walt Disney (NYSE: DIS) entered a three-year partnership with OpenAI , licensing more than 200 characters (including Mickey Mouse, characters from Inside Out and Frozen, and Marvel superheroes) for photo generation on ChatGPT and video generation on Sora by those apps' user bases. Disney can show these user-generated videos on Disney+, its streaming platform.\n\nWhat's more, Disney will invest $1 billion in OpenAI. And it will become a customer, integrating OpenAI's technology across its organization in various ways for its employees and to help create new products for customers.\nThis is clear evidence that Disney is leaning into AI, at a time when those in Hollywood worry about the tech's impact on content creation.\n\"Disney and OpenAI affirm a shared commitment to responsible use of AI that protects the safety of users and the rights of creators,\" the press release reads.\nThis is an encouraging statement for those in the industry, but it will be interesting to see how much appetite there is for watching AI-created videos from viewers.\nDisney benefits because it can potentially earn incremental revenue by leveraging its intellectual property in this new way. While it's not known if the business will make money from its characters' use on ChatGPT or Sora prompts, it can drive more engagement on Disney+ if this type of short-form content catches on. Disney could better compete with Meta Platforms ' Reels on Facebook and Instagram and Alphabet 's YouTube Shorts. There is intense competition for attention .\n\nStory Continues\nAnd it gives Disney a first-mover advantage. Perhaps if AI-generated videos go viral, investors could see similar moves by Netflix , for example.\nOne obvious critique of this decision might be that Disney is selling out and diluting the value of its intellectual property, making its famous characters available to the masses. With ChatGPT counting 800 million weekly users (as of early November), however, this is a good example of a media and entertainment powerhouse attempting to stay ahead of the curve.\n\nInvestors can find value in the streaming market This partnership highlights just how valuable Disney's intellectual property is. With characters, storylines, and franchises that span Disney, Pixar, Marvel, and Lucasfilm, no company can go toe-to-toe with this depth and breadth of content. It makes sense that OpenAI would want to sign a deal with an industry leader. This also suggests there has been significant demand from ChatGPT and Sora users to be more creative and work with Disney characters rather than other studios' intellectual property.\n\nFrom an investment point of view, those looking to put capital to work in the streaming industry might want to consider Disney. It has become a leader in the streaming wars, with Disney+, Hulu, and ESPN providing a full range of content for an entire household. And its experiences segment is extremely profitable.\nShares currently trade at a forward price-to-earnings ratio of 16.8. It's difficult to find value like this in the stock market these days.\nShould you buy stock in Walt Disney right now? Before you buy stock in Walt Disney, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Walt Disney wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,955 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,089,460 !*\nNow, it’s worth noting Stock Advisor’s total average return is 968 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nNeil Patel has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Meta Platforms, Netflix, and Walt Disney. The Motley Fool has a disclosure policy .\nThis $200 Billion Streaming Giant Is Partnering With a Top AI Company (Hint: It's Not Nvidia) was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:33:00",
      "Source": "GlobeNewswire",
      "Title": "RLWRLD Wins Foundation Models Category at Nebius Robotics & Physical AI Awards",
      "URL": "https://finance.yahoo.com/news/rlwrld-wins-foundation-models-category-143300885.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nRLWRLD Wins Foundation Models Category at Nebius Robotics & Physical AI Awards\n\nRLWRLD Inc.\nWed, December 17, 2025 at 6:33 AM PST 3 min read\n\nIn this article: NVDA\n\nOPAI.PVT\n\nNBIS\n\nThe Physical AI startup was recognized by judges from NVIDIA, OpenAI, and leading venture firms for its robotics foundation model already being deployed in early industrial use cases.\n\nMOUNTAIN VIEW, Calif., Dec. 17, 2025 (GLOBE NEWSWIRE) -- RLWRLD , a Physical AI startup building robotics foundation models for real-world deployment, has won first place in the Foundation Models, Robot Brains and Runtime category at the 2025 Nebius Robotics & Physical AI Awards, a global competition recognizing early-stage companies advancing next-generation robotics and Physical AI.\n\nHosted by Nebius (NASDAQ: NBIS) and supported by NVIDIA, the awards were announced at the Computer History Museum in Mountain View as part of the inaugural Nebius Robotics & Physical AI Awards and Summit. The program awarded $1.5 million in AI cloud compute and inference credits to startups selected from more than 250 applicants across 60+ countries.\nRLWRLD was selected as the top winner following evaluations by a judging panel that included leaders from NVIDIA, OpenAI, ABB, Physical Intelligence, and venture firms such as Khosla Ventures, Accel, Next47, and Shanda Grab Ventures. Judges assessed finalists on technical originality, scalability, and readiness for real-world deployment.\nAs the first-place winner in the Foundation Models category, RLWRLD received $150,000 in Nebius AI Cloud compute and inference credits, accelerated by NVIDIA AI infrastructure.\n\nThe Nebius Robotics & Physical AI Awards were created to spotlight startups building the models and systems required to deploy Physical AI in real industrial environments. Sixteen companies were recognized across categories spanning Foundation Models, Simulation, Robot Runtime, Industrial Deployment, and Vision AI.\nRLWRLD’s work focuses on building robot foundation models designed for high-difficulty manipulation and reliable industrial deployment, rather than technology demonstrations for general-purpose robotics. At the core of its platform is RLDX, a proprietary robotics foundation model capable of controlling a 15-degree-of-freedom robotic hand, enabling precise manipulation tasks that require human-level dexterity.\nJudges also cited RLWRLD’s use of high-fidelity, multimodal industrial data and its active collaboration with industry partners as indicators of the company’s commercial readiness, particularly for manufacturing and logistics environments where reliability and precision are critical.\n“Winning this category reinforces our belief that Physical AI needs foundation models built for the real world, not just controlled demos,” said Jung-hee Ryu, CEO of RLWRLD . “This recognition reflects the progress we’ve made working directly with industry partners to deploy our technology.”\n\nStory Continues\nFollowing the award, RLWRLD plans to expand global partnerships and accelerate commercial deployment of its foundation models across humanoid and industrial robotics, with a focus on manufacturing and logistics environments in the U.S. and Asia.\nAbout RLWRLD\nFounded in 2024, RLWRLD is a Physical AI startup developing robot foundation models that enable machines to see, sense, and act with human-like dexterity and cognition. The company operates across the United States, South Korea, and Japan, and trains its models using high-precision 4D+ multimodal industrial data collected through a proprietary multi-sensor capture system. RLWRLD is currently working with major manufacturing partners in South Korea and Japan and aims to become a global leader in industrial robotics AI.\nMedia Contact\nKite Hill\nRLWRLD@kitehillpr.com\nA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/4de89afb-3ddf-4e45-8150-57ee7810e073\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:28:45",
      "Source": "Yahoo Finance",
      "Title": "The stock market is being powered by 10 stocks that are fueling AI bubble fears",
      "URL": "https://finance.yahoo.com/news/the-stock-market-is-being-powered-by-10-stocks-that-are-fueling-ai-bubble-fears-142845016.html",
      "Content": "The stock market is being powered by 10 stocks that are fueling AI bubble fears\n\nBrian Sozzi · Executive Editor\nUpdated Wed, December 17, 2025 at 6:28 AM PST 2 min read\n\nIn this article: ^GSPC\n\n^DJI\n\n^IXIC\n\n^SPX\n\nGOOG\n\nIf you're in the \"stock market is in a bubble\" camp, look no further than the composition of the S&P 500 ( ^GSPC ).\nThe top 10 stocks now account for roughly 32% of S&P 500 earnings and over 41% of total market capitalization — levels not seen since at least 1980, according to new data from Barclays strategist Venu Krishna.\n\nThe \"Magnificent Seven\" stocks have been the primary driver of this market power concentration. Those seven companies — Microsoft ( MSFT ), Amazon ( AMZN ), Alphabet ( GOOGL ), Meta ( META ), Tesla ( TSLA ), Nvidia ( NVDA ), and Apple ( AAPL ) — are essentially powering the artificial intelligence boom.\nThese stocks are up on average 21% this year compared to a 15% gain for the S&P 500, according to Yahoo Finance data. Alphabet is the top performer with an advance of 62% amid optimism on its new Gemini 3 model.\nIn turn, the valuation of the S&P 500 has reached a level even most bulls would agree is on the rich side. Krishna's work reveals the S&P 500 is trading at the 91st percentile relative to its 10-year valuation history.\n\"Complacency\" could ignite an AI bubble, Deutsche Bank strategist Adrian Cox told me on Yahoo Finance's Opening Bid (video above).\nRead more: How AI, unemployment, and interest rates could shape the stock market and your investments next year\nIndeed, complacency appears to have settled in, despite the risks investors had to endure this year.\nRemember the \"Liberation Day\" tariff spectacle in April? The S&P 500 tanked 4.8% the day after President Trump unveiled sweeping tariffs on April 2. The Dow Jones Industrial Average ( ^DJI ) dropped a staggering 1,679 points.\n\nTariffs are now in effect, though they are not as severe as first advertised.\nAnd more recently, disappointments from AI darlings CoreWeave ( CRWV ) and Oracle ( ORCL ) have begun to call into question the near-term outlook for the AI trade.\n\"I think we're going to see some pretty massive bifurcation in 2026 in the AI trade,\" Sevens Report Research founder Tom Essaye said on Opening Bid .\nAlphabet is Essaye's top AI pick for 2026, though he acknowledges there are likely to be winners and losers from the Magnificent Seven complex next year.\n\"I think companies like Oracle that [are] not overextended financially but are sort of raising eyebrows with a lot of the spending that is tied to open AI, I think that companies like that could struggle,\" Essaye added. \"There's going to be some pretty serious bifurcation. We've seen it in the last, say, two months of 2025. I think that gets worse in 2026.\"\n\nStory Continues\nBrian Sozzi is Yahoo Finance's Executive Editor and a member of Yahoo Finance's editorial leadership team. Follow Sozzi on X @BrianSozzi , Instagram , and LinkedIn . Tips on stories? Email brian.sozzi@yahoofinance.com.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices\nRead the latest financial and business news from Yahoo Finance\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:27:00",
      "Source": "Business Wire",
      "Title": "Nebius AI Cloud 3.1 Delivers Next-Generation NVIDIA Blackwell Ultra Compute with Transparent Capacity Management for AI at Scale",
      "URL": "https://finance.yahoo.com/news/nebius-ai-cloud-3-1-142700460.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nNebius AI Cloud 3.1 Delivers Next-Generation NVIDIA Blackwell Ultra Compute with Transparent Capacity Management for AI at Scale\n\nBusiness Wire\nWed, December 17, 2025 at 6:27 AM PST 4 min read\n\nIn this article: NVDA\n\nNBIS\n\nNVIDIA HGX B300 and GB300 NVL72 systems with 800 Gbps NVIDIA Quantum-X800 InfiniBand — Europe’s first GB300 NVL72 on this fabric — deliver next-generation performance for large-scale AI training and inference\nNew Capacity Blocks and real-time dashboard features provide transparent visibility into GPU availability, enabling precise resource planning and operational efficiency at scale\n\nAether 3.1 also delivers enhanced AI/ML developer tooling, expanded ecosystem integrations and granular enterprise-grade governance controls, accelerating time-to-value while reducing risk\nAMSTERDAM, December 17, 2025 --( BUSINESS WIRE )--Nebius today announced Nebius AI Cloud 3.1, bringing next-generation NVIDIA Blackwell Ultra compute and enhanced operational capabilities to the latest release of its full-stack AI cloud platform. Version 3.1 builds on the foundations of Nebius AI Cloud \"Aether\" , adding transparent capacity management and expanded infrastructure to deliver the operational visibility and resource-planning capabilities that customers need as they scale AI in production.\nAs customers move beyond experiments to large-scale adoption, they are identifying clear operational priorities, including real-time visibility into GPU capacity across regions, transparent resource allocation for multi-team environments, and access to next-generation compute as models grow in complexity. Nebius AI Cloud 3.1 addresses these needs across three dimensions.\n\nNebius is deploying NVIDIA Blackwell Ultra infrastructure globally, with NVIDIA GB300 NVL72 systems and NVIDIA HGX B300 systems already being used by customers. Nebius is now the first cloud in Europe to operate both platforms in production. Nebius AI Cloud is also the first provider globally to run production GB300NVL72 systems on 800 Gbps NVIDIA Quantum-X800 InfiniBand interconnect — doubling throughput for distributed workloads. This, alongside hardware-accelerated networking and enhanced storage caching that eliminate infrastructure bottlenecks, further complements leading results in MLPerf® Training v5.1 benchmarks.\nTo meet enterprise demands for operational transparency, version 3.1 introduces Capacity Blocks and a real-time Capacity Dashboard that give customers complete visibility into their reserved GPU capacity and availability across all data center regions. Project-level quotas and new lifecycle object storage rules extend granular control over resource allocation and costs.\n\nThe Nebius AI Cloud platform ecosystem is also continuing to expand. Beyond a new native integration with Dstack, version 3.1 simplifies deployment and consumption of NVIDIA BioNeMo NIM microservices , including Boltz2, Evo-2, GenMol, and MolMIM, without requiring NGC keys or NVIDIA AI Enterprise licenses. Additional features focused on developer usability include enhanced Slurm-based orchestration with Manager Soperator, FOCUS-compliant billing exports and various console UX improvements.\n\nStory Continues\nThe latest release also builds on Aether's enterprise-ready security foundation with object storage data-plane audit logs for HIPAA compliance, per-object access controls, and VPC security groups. Enhanced IAM with Microsoft Entra ID integration and granular service roles provide stronger governance with simplified administration, advancing the compliance capabilities that enable customers in highly regulated sectors and government to deploy production AI workloads.\n\nNebius will hold a technical walkthrough webinar on Nebius AI Cloud 3.1 including a live Q&A session on January 29, at 6 p.m. CET / midday EST / 9 a.m. PST. Please register here for more information.\nNebius AI Cloud 3.1 — at a glance\nNext-generation compute\nNVIDIA HGX B300 and GB300 NVL72 systems with 800 Gbps NVIDIA Quantum-X800 InfiniBand\nHardware-accelerated networking, storage write-back caching, and expanded filesystem performance scaling\nLeading performance in MLPerf® Training v5.1 benchmarks\nOperational visibility and efficiency\nCapacity Blocks for reserved GPU planning and tracking\nCapacity Dashboard with real-time GPU availability across all regions\nProject-level quotas for granular resource control\nNew lifecycle object storage rules for cost optimization\n\nDeveloper productivity\nNVIDIA BioNemo NIM microservices for Healthcare & Life Sciences workflows\nSlurm-based scaling and Dstack native support FOCUS-compliant billing exports for FinOps integration\nSecurity and governance\nAudit logs with object storage data-plane events for HIPAA-compliant configurations and per-object access controls\nVPC Security Groups for network-level protection\nEnhanced IAM with Microsoft Entra ID login, visual SSO management, and granular service roles\nAdditional resources\nBlog post from our Product Management team\nBlog post on NVIDIA GB300 NVL72 systems now operational at our Finland data center\nBlog post on NVIDIA NIM microservices\nBlog post on Capacity Blocks, API and Dashboards\nWebinar and live Q&A registration\nAbout Nebius\n\nNebius is a technology company building full-stack cloud infrastructure for the global AI industry. Headquartered in Amsterdam and listed on Nasdaq (NASDAQ: NBIS), the company has a global footprint with R&D hubs across Europe, North America, and Israel.\nNebius AI Cloud has been built from the ground up for intensive AI workloads. With proprietary software and hardware designed in-house, Nebius gives AI builders the compute, storage, managed services, and tools they need to build, tune, and run their models.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251217322341/en/\nContacts\nInvestor Relations: askIR@nebius.com\nMedia Relations: media@nebius.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:25:16",
      "Source": "24/7 Wall St.",
      "Title": "Nvidia (NASDAQ: NVDA) Stock Price Prediction for 2026: Where Will It Be in 1 Year (Dec 17)",
      "URL": "https://finance.yahoo.com/m/fbc40b68-e691-3ac2-ac6e-c468b91245d1/nvidia-%28nasdaq%3A-nvda%29-stock.html",
      "Content": "Nvidia (NASDAQ: NVDA) Stock Price Prediction for 2026: Where Will It Be in 1 Year (Dec 17)\n\nJoel South\nWed, December 17, 2025 at 6:25 AM PST 6 min read\n\nIn this article: NVDA\n\nTM\n\nTOYOF\n\nTSM\n\nTSMWF\n\nShares of Nvidia Corp. ( NASDAQ: NVDA ) have retreated 3.4% in the past week, as it announced the acquisition of SchedMD and a partnership with Mistral AI, and in the wake of the White House approving sales of H200 chips to certain Chinese customers. Meanwhile, insiders continue to sell shares. Nvidia’s stock is 22.8% higher than six months ago, outperforming the S&P 500 and Nasdaq in that time.\n\n24/7 Wall St. Key Points U.S.-China trade relations have presented headwinds, but Nvidia Corp. ( NASDAQ: NVDA ) is also the dominant AI chipmaker in the market, and the company’s profitability remains strong.\nHere is a look at where Nvidia stock could be headed for the rest of this year and into the next.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality. Read more here .\n\nNote that gains for the chipmaker in that time have helped wipe away the steep drop the stock suffered early in 2025, after it reported it would take a $5.5 billion charge tied to the H20 chip export restrictions to China. While some analysts have raised price targets, others caution about ongoing headwinds due to uncertainty surrounding future U.S.-China trade relations and the potential for stricter regulations. The third-quarter report was stellar on the top and bottom lines due to strong growth in the data center segment.\nDespite its challenges, the company's pivot to U.S. AI infrastructure investments signals resilience. With analysts eyeing robust data center demand, 24/7 Wall St. here explores whether Nvidia can sustain its recovery and drive further growth.\n\nWhy Invest in Nvidia? Nvidia faces significant hurdles as it navigates U.S.-China trade restrictions and intense market expectations. In the first quarter, export controls on its H20 AI chip—which had been designed specifically to circumvent export restrictions on advanced technology to China—led to the substantial write-down noted above. Analysts believed the ban could result in a $9 billion revenue hit. Some $700 million would affect fiscal first-quarter results, with the remaining $8 billion spread across the second and third quarters.\n\nU.S. tariffs and China’s retaliatory measures also threatened supply chain costs, particularly for components sourced globally, while competition from Huawei’s Ascend chips grows. These factors had analysts warning of margin pressure. Yet, Nvidia's profitability remains robust. The company has reportedly raised prices 10% to 15% on some of its most popular GPUs as a result of the tariffs. Gaming processor prices jumped 5% to 10%, while it hiked high-end AI GPUs as much as 15% to account for surging manufacturing costs and to keep its earnings stable.\n\nStory Continues\nYet investments in U.S. AI infrastructure, supported by Taiwan Semiconductor Manufacturing's $165 billion Arizona fab expansion, bolster Nvidia's supply chains and are backed by its $37.6 billion cash reserve.\nCEO Huang announced during his recent trip to South Korea that Nvidia will supply more than 260,000 advanced graphics processing units (GPUs) to South Korean firms, including Samsung and Hyundai Motor. He believes AI has reached a \"virtuous cycle\" where improvements in the models lead to more investment, which in turn leads to further improvement and investment. He also expressed hope that trade talks between the U.S. and China might lead to a change in policy that allows Nvidia to resume sales of state-of-the-art chips in China. As mentioned, the U.S. president has now allowed the company to sell its advanced H200 AI chips to China.\n\nThe AI market is projected to grow at a 37% CAGR through 2030, according to Grand View Research. This supports Nvidia’s $170 billion fiscal 2026 revenue forecast, a 30% increase over the $130.5 billion it generated in 2025.\nNvidia as a Company In its third-quarter earnings report, Nvidia revenue totaled a record $57.01 billion, including $51.2 billion from its data center division. The total was up 66% year over year, largely fueled by the voracious demand for its AI chips.\nThe chipmaker invested $3.2 billion in capital expenditures in fiscal 2025, expanding Blackwell accelerator production and AI infrastructure. The company's capex has spiked over 200% this year to more than $3 billion to meet hyperscaler demand.\n\nU.S.-China trade restrictions still pose risks, even with the seeming thaw, tariffs could raise costs, which would explain the price hikes reportedly implemented. A 36% operating expense increase to $5.8 billion for R&D offset Nvidia's adjusted operating income of $37.8 billion.\nYet, Nvidia's growth is not solely tied to data centers. The company expanded its automotive segment, with a 32% year-over-year increase to $592 million, driven by partnerships with Toyota and Aurora Innovation for autonomous vehicles. This diversifies Nvidia's portfolio amid tariff uncertainties.\nNvidia has projected fiscal third-quarter revenue of $65 billion, plus or minus 2%. This outlook exceeded analysts' consensus projection.\nNvidia as a Stock This has been a rollercoaster year for Nvidia shareholders. The stock dropped to a 52-week low of $86.62 in April. After an announced pause in U.S.-China tariffs and the first-quarter results, the share price recovered. It hit an all-time high of $212.19 in October, which had the company's market cap briefly over $5 trillion.\n\nWhile some insiders have been selling shares, analyst sentiment remains bullish. Of 64 analysts who cover the stock, 60 recommend buying shares, 11 of them with Strong Buy ratings. Their consensus one-year price target is $250.93, which signals over 41% upside potential from its current price. Targets range from $140 to $352 per share.\nCitigroup, J.P. Morgan, Morgan Stanley, and others recently maintained their Buy-equivalent ratings. Evercore ISI has the street-high target price. It cited accelerating revenue growth, strong demand for Blackwell chips, an improving supply chain, and a significant pipeline. Yet, renowned investor Michael Burry is bearish on Nvidia.\nEstimate\nPrice Target\nChange From Current Price\nLow\n$140.00\n−21.2%\nMedian\n$250.93\n41.2%\nHigh\n$352.00\n98.1%\n\nNvidia's AI dominance, 93% data center growth, and automotive partnerships with Toyota positioned the company for gains in 2025. However, tariff risks and DeepSeek’s competitive AI models require caution. The AI market's growth and the chipmaker's $47 billion second-quarter revenue position Nvidia to achieve its $170 billion full-year revenue target, while its cash buffer and Stargate Project role offer stability. Still, valuation concerns linger. Nvidia is a buy for growth-oriented investors, but others should use caution.\n\n24/7 Wall St.'s 2026 year-end price target for Nvidia is $300.14 per share, which would be a 68.9% gain. That estimate accounts for tariff risks, competition from DeepSeek, and potential Blackwell supply constraints. It also reflects Nvidia's AI dominance and second-quarter 2026 revenue guidance.\nTime to Sell Nvidia Stock as Michael Burry Takes Aim?\n\nData Shows One Habit Doubles American’s Savings And Boosts Retirement Most Americans drastically underestimate how much they need to retire and overestimate how prepared they are. But data shows that people with one habit have more than double the savings of those who don’t.\nAnd no, it’s got nothing to do with increasing your income, savings, clipping coupons, or even cutting back on your lifestyle. It’s much more straightforward (and powerful) than any of that. Frankly, it’s shocking more people don’t adopt the habit given how easy it is .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:20:00",
      "Source": "Motley Fool",
      "Title": "Marvell Technology Looks Undervalued as Artificial Intelligence Spending Surges",
      "URL": "https://finance.yahoo.com/m/03fe6953-ee67-3c91-8978-50bad226be2d/marvell-technology-looks.html",
      "Content": "Marvell Technology Looks Undervalued as Artificial Intelligence Spending Surges\n\nMarc Guberti, The Motley Fool\nWed, December 17, 2025 at 6:20 AM PST 4 min read\n\nIn this article: NVDA\n\nPLTR\n\nKey Points Marvell Technology is one of the most undervalued AI stocks right now, and it's down by 25% this year.\nA sale and acquisition have positioned the company to become a long-term winner in the AI data center boom.\nA questionable rumor still weighs heavily on the stock despite Marvell Technology's CEO rebuking it.\n10 stocks we like better than Marvell Technology ›\n\nIf you want to find undervalued artificial intelligence (AI) stocks , you have to start with ones that aren't receiving as much hype. Nvidia is the most well-known growth stock right now, and Palantir Technologies is another AI leader that has attracted plenty of investors.\nHowever, fewer investors know about Marvell Technology (NASDAQ: MRVL) , and a few controversial rumors have made the stock even cheaper. Marvell Technology is a custom AI chipmaker that investors may want to monitor.\nDispelling the rumors Marvell Technology looked undervalued for most of the year. Its revenue growth rates have steadily outpaced the stock's 25% year-to-date decline. However, Marvell took another hit when rumors swirled around that the company lost a lot of business from Amazon and Microsoft .\nThat type of news would be devastating for the company. AI chipmakers make most of their revenue from a small handful of tech companies , and losing two of the largest hyperscalers in the industry would limit future growth opportunities. Other tech companies may be wary of doing business with an AI chipmaker that lost Amazon and Microsoft.\n\nHowever, Marvell Technology CEO Matt Murphy poured cold water on the rumors when speaking with CNBC's Jim Cramer. Murphy told viewers that Marvell did not lose any business from those tech giants.\nThe debunked rumor continues to weigh on the stock price, which presents an opportunity for long-term investors. However, the credibility around this rumor isn't the only reason investors should appreciate the dip in Marvell Technology stock.\nMarvell's valuation hasn't moved as quickly as its revenue Marvell Technology has a 23.5 forward P/E ratio and continues to post impressive revenue growth. The chipmaker boosted its sales by 37% year over year in the third quarter of its fiscal 2026, ended Nov. 1, while operating income increased by 23% year over year.\nThe net income figure for the third quarter isn't the best for gauging the stock since that number includes the proceeds from a $2.5 billion sale of its automotive Ethernet business. It's a one-off event that inflated Marvell Technology's net income growth, but the company has maintained a net profit margin of roughly 10% in previous quarters.\n\nStory continues\nThis isn't even the first quarter of strong growth for fiscal 2026. Marvell delivered 63% and 58% year-over-year revenue growth rates in the first and second quarters of fiscal 2026. Its revenue and net income are moving in the right direction despite its stock price suggesting that the complete opposite has happened.\n\nMarvell Technology is locked into AI chip growth Marvell's $2.5 billion divestiture gave it more capital while freeing up resources to prioritize custom AI chips. However, the company didn't just stop with selling off a slower part of its business. The AI chipmaker acquired photonic fabric provider Celestial AI for $3.25 billion. The total acquisition may be valued at $5.5 billion if certain sales objectives are achieved.\n\nThe deal should help Marvell Technology scale faster in the burgeoning AI data center industry and boost demand for its AI chips. AWS Vice President of Compute and Machine Learning Services Dave Brown praised the December acquisition, casting even more doubt into rumors that Marvell Technology lost business from two tech giants.\nMarvell swapped a slow-growth business for a high-growth one that complements its AI ambitions nicely. Investors have not yet priced in this reality. Marvell shares traded above $100 per share to start the year, and it may be due for a rally to all-time highs soon enough.\nIf the AI chipmaker continues to post 30%-plus year-over-year revenue growth in fiscal 2027 and beyond, the mismatch between revenue growth and its current valuation will become more difficult to ignore.\n\nShould you buy stock in Marvell Technology right now? Before you buy stock in Marvell Technology, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Marvell Technology wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,955 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,089,460 !*\nNow, it’s worth noting Stock Advisor’s total average return is 968 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nMarc Guberti has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon, Microsoft, Nvidia, and Palantir Technologies. The Motley Fool recommends Marvell Technology and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nMarvell Technology Looks Undervalued as Artificial Intelligence Spending Surges was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:19:00",
      "Source": "Business Wire",
      "Title": "Comparably Announces 2025 Best Compensation, Best CEO’s and Best Company Culture Awards",
      "URL": "https://finance.yahoo.com/news/comparably-announces-2025-best-compensation-141900368.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nComparably Announces 2025 Best Compensation, Best CEO’s and Best Company Culture Awards\n\nBusiness Wire\nWed, December 17, 2025 at 6:19 AM PST 2 min read\n\nIn this article: ADBE\n\nGTM\n\nGOOG\n\nNVDA\n\nElsevier, ADP, Adobe, Google, and NVIDIA lead 2025 rankings as employee sentiment highlights emerging and established workplace leaders\nVANCOUVER, Wash., December 17, 2025 --( BUSINESS WIRE )--Comparably (a ZoomInfo company) – a leading employee review platform for workplace culture and compensation – announced the winners of its 2025 Best Compensation, Best CEOs, and Best Company Culture Awards last week, highlighting organizations that employees rate highest for leadership, pay, and overall workplace experience.\n\nElsevier earned the #1 ranking for Best Company Culture among large companies, reinforcing its position as one of the most consistently admired workplaces. ADP claimed the top spot for Best CEOs, reflecting strong employee confidence in executive leadership, while Adobe secured #1 for Best Compensation, standing out for employee satisfaction with pay and rewards.\nWith more than 20 million ratings across 70,000 companies, Comparably's annual rankings provide comprehensive insights into workplace satisfaction and employee experience across diverse industries and organizational structures. The awards are based on anonymous feedback provided on Comparably.com over the past 12 months, representing millions of ratings from employees across companies of all sizes and industries.\n\n\"Based on millions of anonymous employee ratings, the Comparably Awards provide authentic, unfiltered proof points that top candidates demand,\" said Jon Bischke, GM of ZoomInfo Talent Solutions. \"For winning organizations, this is a badge of honor and powerful competitive advantage that directly influences their ability to attract and retain the best talent. Plus candidates can trust that they're based on real experiences, not marketing spin.\"\n2025 Best Company Culture (Large Companies):\nElsevier\nThe Breakers Palm Beach\nRingCentral\n2025 Best CEOs (Large Companies):\nADP\nElsevier\nAdobe\n2025 Best Compensation (Large Companies):\nAdobe\nNVIDIA\nGoogle\nThe full list of ranked companies can be found on Comparably’s Awards page .\nAbout Comparably\n\nComparably (a ZoomInfo company) is a leading platform for workplace culture insights and compensation data, empowering employees and job seekers to make more informed career decisions. With 20 million anonymous employee ratings across nearly 20 core culture metrics, covering 70,000 companies, Comparably provides one of the most comprehensive datasets on workplace culture, salaries, and leadership. Insights can be segmented by gender, ethnicity, age, experience, industry, department, location, and education, offering a deep and nuanced view of organizations of all sizes. Trusted by employers and job seekers alike, Comparably is the go-to resource for employer branding and workplace culture. For more information, visit www.comparably.com .\n\nStory Continues\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251217159518/en/\nContacts\nMedia:\nHolly Hamel\nComparably Awards Manager\nPhone: 206-850-2168\nEmail: holly.hamel@zoominfo.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:17:58",
      "Source": "Reuters",
      "Title": "Exclusive-How China built its ‘Manhattan Project’ to rival the West in AI chips",
      "URL": "https://finance.yahoo.com/news/exclusive-china-built-manhattan-project-141758929.html",
      "Content": "Exclusive-How China built its ‘Manhattan Project’ to rival the West in AI chips\n\nFanny Potkin\nWed, December 17, 2025 at 6:17 AM PST 11 min read\n\nIn this article: ASML\n\nINTC\n\nSSNLF\n\nNVDA\n\nAMD\n\nBy Fanny Potkin\nSINGAPORE Dec 17 - In a high-security Shenzhen laboratory, Chinese scientists have built what Washington has spent years trying to prevent: a prototype of a machine capable of producing the cutting-edge semiconductor chips that power artificial intelligence , smartphones and weapons central to Western military dominance, Reuters has learned.\n\nCompleted in early 2025 and now undergoing testing, the prototype fills nearly an entire factory floor. It was built by a team of former engineers from Dutch semiconductor giant ASML who reverse-engineered the company's extreme ultraviolet lithography machines or EUVs, according to two people with knowledge of the project.\nEUV machines sit at the heart of a technological Cold War. They use beams of extreme ultraviolet light to etch circuits thousands of times thinner than a human hair onto silicon wafers, currently a capability monopolized by the West. ​The smaller the circuits, the more powerful the chips.\nChina's machine is operational and successfully generating extreme ultraviolet light, but has not yet produced working chips, the people said.\n\nIn April, ASML CEO Christophe Fouquet said that China would need \"many, many years\" to develop such technology. But the existence of this prototype, reported by Reuters for the first time, suggests China may be years closer to achieving semiconductor independence than analysts anticipated.\nNevertheless, China still faces ‌major technical challenges, particularly in replicating the precision optical systems that Western suppliers produce.\nThe availability of parts from older ASML machines on secondary markets has allowed China to build a domestic prototype, with the government setting a goal of producing working chips on the prototype by 2028, according to the two people.\nBut those close to the project say a more realistic target is 2030, which is still years earlier than the decade that analysts believed it would take China to match the West on chips.\n\nChinese authorities did not respond to requests for comment.\nThe breakthrough marks the culmination of a six-year government ‌initiative to achieve semiconductor self-sufficiency, one of President Xi Jinping's highest priorities. While China's semiconductor goals have been public, the Shenzhen EUV project has been conducted in secret, according to the people.\nThe project falls under the country's semiconductor strategy, which state media has identified as being run by Xi Jinping confidant Ding Xuexiang, who heads the Communist Party's Central Science and Technology Commission.\n\nStory Continues\nChinese electronics giant Huawei plays a key role coordinating a web of companies and state research institutes across the country involving thousands of engineers, according to the two people and a third source.\nThe people described it as China's version of the Manhattan Project, the U.S. wartime effort to develop the atomic bomb.\n\n“The aim is for China to eventually be able to make advanced chips on machines that are entirely China-made,” one of the people said. \"China wants the United States 100% kicked out of its supply chains.\"\nHuawei, the State Council of China, the Chinese Embassy in Washington, and China's Ministry of Industry and Information Technology did not respond to requests for comment.\nUntil now, only one company has mastered EUV technology: ASML, headquartered in Veldhoven, Netherlands. Its machines, which cost around $250 million, are indispensable for manufacturing the most advanced chips designed by companies like Nvidia and AMD—and produced by chipmakers such as TSMC, Intel, and Samsung.\nASML built its first working prototype of EUV technology in 2001, and told Reuters it took nearly two decades and billions of euros in R&D spending before it produced its first commercially-available chips in 2019.\n\n“It makes sense that companies would want to replicate our technology, but doing so is no small ⁠feat,” ASML told Reuters in a statement.\nASML's EUV systems are currently available to U.S. allies including Taiwan, South Korea, and Japan.\nStarting in 2018, the United States began pressuring ‌the Netherlands to block ASML from selling EUV systems to China. The restrictions expanded in 2022, when the Biden administration imposed sweeping export controls designed to cut off China's access to advanced semiconductor technology.\nThe controls targeted not just EUV systems but also older deep ultraviolet (DUV) lithography machines that produce less-advanced chips like Huawei’s, aiming to keep China at least a generation behind in chipmaking capabilities.\n\nThe U.S. State Department said the Trump Administration has strengthened enforcement of export controls on advanced semiconductor manufacturing equipment and is working with partners \"to close loopholes as technology advances.”\nThe Dutch Ministry of Defence said the Netherlands is developing policies requiring “knowledge institutions” to perform personnel screenings to prevent access to sensitive technology “by individuals that have ill intentions or who are at risk of being pressured.”\nExport restrictions ‍have slowed China's progress toward semiconductor self-sufficiency for years, and constrained advanced chip production at Huawei, the two people and a third person said.\nThe sources spoke on condition they not be identified due to the confidentiality of the project.\n\nCHINA'S MANHATTAN PROJECT\nOne veteran Chinese engineer from ASML recruited to the project was surprised to find that his generous signing bonus came with an identification card issued under a false name, according to one of the people, who was familiar with his recruitment.\nOnce inside, he recognized other former ASML colleagues who were also working under aliases and was instructed to use their fake names at work to maintain secrecy, the person said. Another person independently confirmed that recruits were given fake IDs to conceal their identities from other workers inside the secure facility.\nThe guidance was clear, the two people said: Classified under national security, no one outside the compound could know what they were building—or that they were there at all.\n\nThe team includes recently retired, Chinese-born former ASML engineers and scientists—prime recruitment targets because they possess sensitive technical knowledge but face fewer professional constraints after leaving the company, ​the people said.\nTwo current ASML employees of Chinese nationality in the Netherlands told Reuters they have been approached by recruiters from Huawei since at least 2020.\nHuawei did not respond to requests for comment.\nEuropean privacy laws limit ASML's ability to track former employees. Though employees sign non-disclosure agreements, enforcing them across borders has proven difficult.\nASML won an $845 million judgment in 2019 against a former Chinese engineer accused of stealing trade secrets, but the defendant filed for bankruptcy and continues to ‌operate in Beijing with Chinese government support, according to court documents.\n\nASML told Reuters that it “vigilantly guards” trade secrets and confidential information.\n\"While ASML cannot control or restrict where former employees work, all employees are bound by the confidentiality clauses in their contracts,\" the company said, and it has \"successfully pursued legal action in response to the theft of trade secrets.”\nReuters was unable to determine if any legal actions have been taken against former ASML employees involved in China’s lithography program.\nThe company said it safeguards EUV knowledge by ensuring only select employees can access the information even inside the company.\nDutch intelligence warned in an April report that China \"used extensive espionage programmes in its attempts to obtain advanced technology and knowledge from Western countries,\" including recruiting \"Western scientists and employees of high-tech companies.”\n\nThe ASML veterans made the breakthrough in Shenzhen possible, the people said. Without their intimate knowledge of the technology, reverse-engineering the machines would have been nearly impossible.\nTheir recruitment was part of an aggressive drive China launched in 2019 for semiconductor experts working abroad, offering signing bonuses that started at 3 million to 5 million yuan ($420,000 to $700,000) and home-purchase subsidies, according to a Reuters review of government policy documents.\nRecruits included Lin Nan, ASML's former head of light source technology, whose team at the Chinese Academy of Sciences' Shanghai Institute of Optics has filed eight patents on EUV light sources in 18 months, according to patent filings.\nThe Shanghai Institute of Optics and Fine Mechanics did not respond to requests for comment. Lin could not be reached for comment.\n\nTwo additional people familiar with China’s recruitment efforts said some naturalized citizens of other countries were given Chinese passports and allowed to maintain dual citizenship.\nChina officially prohibits dual citizenship and did not answer questions on issuing passports.\nChinese authorities did not respond to requests for comment.\nINSIDE CHINA'S EUV FAB\nASML's most advanced EUV systems are roughly the size of a school bus, and weigh 180 tons. After failed attempts to replicate its size, the prototype inside the Shenzhen lab became many times larger to improve its ⁠power, according to the two people.\nThe Chinese prototype is crude compared to ASML's machines but operational enough for testing, the people said.\nChina's prototype lags behind ASML's machines largely because researchers have struggled to obtain optical systems like those from Germany's Carl Zeiss AG, one of ASML's ​key suppliers, the two people said.\n\nZeiss declined to comment.\nThe machines fire lasers at molten tin 50,000 times per second, generating plasma at 200,000 degrees Celsius. The light is focused using mirrors that take months to produce, according to Zeiss' website.\nChina's top research institutes have played key roles in developing homegrown ​alternatives, according to the two people.\nThe Changchun Institute of Optics, Fine Mechanics and Physics at the Chinese Academy of Sciences (CIOMP) achieved a breakthrough in integrating extreme-ultraviolet light into the prototype's optical system, enabling it to become operational in early 2025, one of the people said, though the optics still require significant refinement.\nCIOMP did not respond to requests for comment.\nIn a March online recruitment call on its website, the institute said it was offering \"uncapped\" salaries to PhD lithography researchers and research grants worth up to 4 million yuan ($560,000) plus 1 million yuan ($140,000) in personal subsidies.\n\nJeff Koch, an analyst at research firm SemiAnalysis and a former ASML engineer, said China will have achieved \"meaningful progress” if the “light source has enough power, is reliable, and doesn’t generate too much contamination.”\n\"No doubt this is technically feasible, it's ‍just a question of timeline,\" he said. \"China has the advantage that commercial EUV now exists, so they aren't starting from zero.\"\nTo ⁠get the required parts, China is salvaging components from older ASML machines and sourcing parts from ASML suppliers through secondhand markets, the two people said.\nNetworks of intermediary companies are sometimes used to mask the ultimate buyer, the people said.\nExport-restricted components from Japan’s Nikon and Canon are being used for the prototype, one of the people and an additional source said.\n\nNikon declined to comment. Canon said it was not aware of such reports. The Japanese Embassy in Washington did not respond to a request for comment.\nInternational banks regularly auction older semiconductor fabrication equipment, the sources said. Auctions in China sold older ASML lithography equipment as recently as October 2025, according to a review of listings on Alibaba Auction, an Alibaba-owned platform.\nA team of around 100 recent university graduates is focused on reverse-engineering components from both EUV and DUV lithography machines, according to the people.\nEach worker's desk is filmed by an individual camera ⁠to document their efforts to disassemble and reassemble parts—work the people described as key to China's lithography efforts.\n\nStaffers who successfully reassemble a component receive bonuses, the people said.\nHUAWEI SCIENTISTS SLEEP ON-SITE\nWhile the EUV project is run by the Chinese government, Huawei is involved in every step of the supply chain from chip design and fabrication equipment to manufacturing and final integration into products like smartphones, according to four people familiar with Huawei’s operations.\nCEO Ren Zhengfei briefs senior Chinese leaders on progress, according to one of the people.\nThe U.S. placed Huawei on an entity list in 2019, banning American companies from ‌doing business with them without a license.\nHuawei has deployed employees to offices, fabrication plants, and research centers across the country for the effort. Employees assigned to semiconductor teams often sleep on-site and are barred from returning home during the work week, with phone access restricted for teams handling more sensitive tasks, according to the people.\nInside Huawei, few employees know the scope of this work. \"The teams are kept isolated from ‌each other to protect the confidentiality of the project,\" one of the people said. “They don't know what the other teams work on.”\n(Reporting by Fanny Potkin in Singapore, additional reporting by Alexandra Alper in Washington, editing by Ken Li and Michael Learmonth)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "21:37:00",
      "Source": "Barrons.com",
      "Title": "Amazon in Talks Over $10 Billion OpenAI Move: Report. That’s Bad for Nvidia, Broadcom.",
      "URL": "https://finance.yahoo.com/m/b42fe308-59b5-32c1-bf2a-65c9908a7a1f/amazon-in-talks-over-%2410.html",
      "Content": "Amazon in Talks Over $10 Billion OpenAI Move: Report. That’s Bad for Nvidia, Broadcom.\n\nAdam Clark\nWed, December 17, 2025 at 5:37 AM PST 2 min read\n\nIn this article: AMZN\n\nMRVL\n\nNVDA\n\nAVGO\n\nOPAI.PVT\n\nAmazon’s investment would be tied to an agreement for OpenAI to use the e-commerce company’s in-house Trainium chips, according to a report.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 41
}