{
  "stock_id": "NVDA",
  "last_updated": "2025-12-17T14:24:20.832Z",
  "source": "Yahoo Finance Only",
  "news": [
    {
      "Date": "2025-12-17",
      "Time": "21:54:02",
      "Source": "Yahoo Finance",
      "Title": "Stock Market Today: Dow Rises In Wake Of Market Drop; Tesla Switches Gears (Live Coverage)",
      "URL": "https://finance.yahoo.com/m/08034984-b2ec-32ee-b4d6-81730f186925/stock-market-today%3A-dow-rises.html?.tsrc=rss",
      "Content": "Stock Market Today: Dow Rises In Wake Of Market Drop; Tesla Switches Gears (Live Coverage)\n\nSCOTT LEHTONEN\nWed, December 17, 2025 at 5:54 AM PST 2 min read\n\nIn this article: TSLA\n\nAMZN\n\nQQQ\n\nSPY\n\n^DJI\n\nStock Market Today: The Dow Jones index rose Wednesday after the indexes dropped Tuesday. Tesla stock looked to set more record highs.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "21:37:00",
      "Source": "Yahoo Finance",
      "Title": "Amazon in Talks Over $10 Billion OpenAI Move: Report. That’s Bad for Nvidia, Broadcom.",
      "URL": "https://finance.yahoo.com/m/b42fe308-59b5-32c1-bf2a-65c9908a7a1f/amazon-in-talks-over-%2410.html?.tsrc=rss",
      "Content": "Amazon in Talks Over $10 Billion OpenAI Move: Report. That’s Bad for Nvidia, Broadcom.\n\nAdam Clark\nWed, December 17, 2025 at 5:37 AM PST 2 min read\n\nIn this article: AMZN\n\nMRVL\n\nNVDA\n\nAVGO\n\nOPAI.PVT\n\nAmazon’s investment would be tied to an agreement for OpenAI to use the e-commerce company’s in-house Trainium chips, according to a report.\n\nContinue Reading\n\nCondizioni e Informativa sulla privacy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "21:31:09",
      "Source": "Yahoo Finance",
      "Title": "'I'm Super Excited About The Robots Elon's Working On' — Nvidia CEO Says New Careers Will Explode",
      "URL": "https://finance.yahoo.com/news/im-super-excited-robots-elons-133109049.html?.tsrc=rss",
      "Content": "'I'm Super Excited About The Robots Elon's Working On' — Nvidia CEO Says New Careers Will Explode\n\nCasey B. Renner\nWed, December 17, 2025 at 5:31 AM PST 3 min read\n\nIn this article: NVDA\n\nTSLA\n\nJPM\n\nGM\n\nA new generation of robot-driven jobs could soon reshape how work is done. The shift ties back to the push for large-scale manufacturing growth to support artificial intelligence , according to Nvidia (NASDAQ: NVDA ) CEO Jensen Huang .\n\"We want to re-industrialize the United States. We need to be back in manufacturing,\" Huang said recently on \"The Joe Rogan Experience\" podcast. He also said Americans do not need PhDs or elite credentials to succeed, emphasizing that manufacturing underpins AI companies like Nvidia and strengthens long-term job creation.\n\nDon't Miss:\nMissed Nvidia and Tesla? RAD Intel Could Be the Next AI Powerhouse — Just $0.85 a Share\nAn EA Co-Founder Shapes This VC Backed Marketplace— Now You Can Invest in Gaming's Next Big Platform\nPush To Bring Factory Work Back Huang told host Joe Rogan the country cannot build chip facilities, data centers, or supercomputing sites without reviving the trades that support them. He said as a result construction and electrical roles remain central to expanding national AI capacity.\nHe said U.S. President Donald Trump 's pro-growth energy direction allowed factories for AI, chips, and supercomputers to be built at scale. Without that foundation, Huang said construction and electrician jobs would be \"challenged,\" slowing the critical infrastructure development needed for AI progress.\n\nTrending: Deloitte's #1 Fastest-Growing Software Company Lets Users Earn Money Just by Scrolling — Accredited Investors Can Still Get In at $0.50/Share.\nYounger Workers Remain Wary Workforce shortages are rising in sectors critical to U.S. resilience, including manufacturing, AI and cybersecurity, according to a report by JPMorgan Chase & Co. (NYSE: JPM ).\nIt also said technology workforce needs are projected to grow twice as fast as the overall labor market. Manufacturing may require 3.8 million new employees by 2033, with about half of those jobs at risk of remaining unfilled.\n\nAt the same time, the National Association of Manufacturers says there were nearly 13 million manufacturing workers in September, with employment slipping by 6,000 from August as the sector moves back toward pre-pandemic levels.\nHuang told Rogan industrial work is indispensable because every AI breakthrough depends on physical systems that must be built, powered, and maintained. He said energy growth drives industrial growth, and that expansion drives job creation. Without that chain, he said prosperity weakens and national competitiveness declines.\nSee Also: GM-Backed EnergyX Is Solving the Lithium Supply Crisis — Invest Before They Scale Global Production\nRobots As Job Creators In addition, Huang said robotics will generate new industries that do not exist today. He pointed to Tesla (NASDAQ: TSLA ) CEO Elon Musk , who has said Tesla aims to use Optimus humanoid robots for internal tasks in its factories and eventually make them available to other companies.\n\nStory Continues\n\"I'm super excited about the robots Elon's working on. It's still a few years away. When it happens, there's a whole new industry of technicians and people who have to manufacture the robots,\" Huang told Rogan.\nHe said companies will need robot mechanics, long-term maintenance teams and specialists who support humanoid systems on production lines. Huang also said a whole apparel industry for robots could emerge as factories adopt humanoid systems.\n\nRead Next: From Moxy Hotels to $12B in Real Estate — The Firm Behind NYC's Trendiest Properties Is Letting Individual Investors In.\nImage: USA Today Network\nUp Next: Transform your trading with Benzinga Edge's one-of-a-kind market trade ideas and tools. Click now to access unique insights that can set you ahead in today's competitive market.\nGet the latest stock analysis from Benzinga:\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article 'I'm Super Excited About The Robots Elon's Working On' — Nvidia CEO Says New Careers Will Explode originally appeared on Benzinga.com\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "21:04:34",
      "Source": "Yahoo Finance",
      "Title": "OpenAI In Talks To Get $10 Billion Amazon Investment, Use Its Chips: The Information",
      "URL": "https://finance.yahoo.com/m/2726b9b8-789b-3d00-8ef3-494b9b80d8bf/openai-in-talks-to-get-%2410.html?.tsrc=rss",
      "Content": "OpenAI In Talks To Get $10 Billion Amazon Investment, Use Its Chips: The Information\n\nED CARSON\nWed, December 17, 2025 at 5:04 AM PST 1 min read\n\nIn this article: AMZN\n\nNVDA\n\nAVGO\n\nAMD\n\nORCL\n\nAmazon is in talks to invest at least $10 billion in OpenAI, which would use the e-commerce giant's in-house AI chips.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "21:00:55",
      "Source": "Yahoo Finance",
      "Title": "Nvidia vs. Broadcom: Which AI chip stock to own for 2026? Analyst answers",
      "URL": "https://finance.yahoo.com/news/nvidia-vs-broadcom-ai-chip-130055434.html?.tsrc=rss",
      "Content": "Nvidia vs. Broadcom: Which AI chip stock to own for 2026? Analyst answers\n\nSam Boughedda\nWed, December 17, 2025 at 5:00 AM PST 2 min read\n\nIn this article: AVGO\n\nNVDA\n\nInvesting.com -- The debate over which AI chip stock to own heading into 2026 remains central for investors, and Morgan Stanley says the outlook for next year still strongly favors the sector’s leaders.\nIn a 2026 semiconductor outlook, Morgan Stanley analyst Joseph Moore wrote that “the picture for CY26 appears very strong,” with AI spending supported by “the scaling up of token growth for complex inference, around usage of the models, not training.”\n\nMoore acknowledged ongoing skepticism around longer-term AI assumptions, noting it has “some skepticism on the 5-year views that make 2025 strength look like a rounding error.”\nStill, the bank said visibility for 2026 remains solid, helped by recent capital raises among major model developers and sustained demand for compute.\nWithin processors, Morgan Stanley “remain[s] OW NVDA and AVGO, maintaining a preference for NVDA.”\n“[Nvidia is] still the nucleus for the AI trade, and at an undemanding multiple we think it’s hard to look elsewhere in AI,” said Moore.\nThe analyst highlighted “growing enthusiasm for ASIC, where growth will be strong,” but added that “as various bottlenecks emerge we continue to think that NVIDIA will be the highest ROI solution in cloud, particularly as Vera Rubin ramps in 2h26.”\n\nMorgan Stanley also believes “the market is underestimating NVIDIA’s position.”\nBroadcom remains favored as part of Morgan Stanley’s overweight positioning, but Nvidia stands out as the preferred name.\nHowever, the bank wrote that “on the GPU alternatives debate, we prefer AVGO as the proven and enduring accelerator story beyond CY2026.”\n“We really like the growth story here, and while we tend to be vocal on GPUs maintaining market share leadership, we still see very strong growth potential for both custom silicon and networking at Broadcom ,” Moore added.\nRelated articles\nNvidia vs. Broadcom: Which AI chip stock to own for 2026? Analyst answers\n10 Beaten-Down Large-Cap Tech Stocks Offering Solid Upside Potential\nLoading Up HEAVY on These 3 Stocks by End of 2025 (+ 1 New ETF)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "21:00:00",
      "Source": "Yahoo Finance",
      "Title": "CoLab Joins NVIDIA Inception Program to Accelerate AI-Powered Engineering for the Physical World",
      "URL": "https://finance.yahoo.com/news/colab-joins-nvidia-inception-program-130000136.html?.tsrc=rss",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nCoLab Joins NVIDIA Inception Program to Accelerate AI-Powered Engineering for the Physical World\n\nBusiness Wire\nWed, December 17, 2025 at 5:00 AM PST 4 min read\n\nIn this article: NVDA\n\nST. JOHN’S, Newfoundland, December 17, 2025 --( BUSINESS WIRE )--CoLab today announced it has joined the NVIDIA Inception program, NVIDIA’s global ecosystem of AI innovators. As an NVIDIA Inception program member, CoLab will explore how NVIDIA technologies can accelerate the use of artificial intelligence for teams designing the world’s most complex physical products.\n\nBoth companies are focused on bringing AI into the physical world, where product development is governed by physics, materials, safety constraints, and long timelines. From vehicles and industrial equipment to medical devices and energy infrastructure, these products depend on engineering teams working through design iterations to meet performance, cost, and reliability requirements.\n\"This is about accelerating the development of products that matter,\" said Adam Keating, Co-Founder and CEO of CoLab. \"Whether it’s national security, healthcare, or the energy transition, progress in these areas depends on how quickly engineering teams can design, test, and refine complex physical systems. At CoLab, we envision a future where they can do those things much faster.\"\n\nUnlike digital products, physical products cannot be iterated quickly once they reach the real world. As a result, engineering teams rely heavily on advanced modeling, simulation, and digital twins to predict how designs will perform before anything is built. These digital methods are far faster and less expensive than physical testing, but they also generate massive volumes of data that must be interpreted and acted on.\nCoLab’s vision is to serve as the Engineering Operating System for the AI era: a human-in-the-loop decision-making interface where engineers collaborate, assess trade-offs, and make critical calls using AI-generated insights. By dramatically reducing the time it takes to move from one design iteration to the next, CoLab believes teams can collapse design cycles from months to days (or even hours) without removing engineers from the process.\n\n\"AI will accelerate how designs are generated and validated,\" said Jeremy Andrews, Co-Founder and CTO of CoLab. \"But the limiting factor will be decision-making. Our focus is on capturing design intent — the discussions, rationale, and trade-offs behind engineering decisions — and using that context to make AI outputs more relevant and consistent with how teams actually work.\"\nThrough the NVIDIA Inception program, CoLab will explore how NVIDIA technologies can complement this approach. NVIDIA’s platforms support advanced simulation, training environments, and synthetic data generation that model how physical systems behave. CoLab can bring those outputs into a structured decision-making workflow, ensuring the right data reaches the right engineer at the right time.\n\nStory Continues\nCoLab will also explore AI training and evaluation. CoLab’s platform captures a unique dataset of engineering knowledge through digital design reviews, creating a persistent record of why decisions were made, not just what changed. When paired with NVIDIA-powered simulation and training environments, that context can help improve the performance and consistency of AI agents like CoLab’s AutoReview.\n\n\"Joining the NVIDIA Inception program reflects our broader strategy,\" said Taylor Young, Chief Strategy Officer at CoLab. \"We’re building partnerships across the engineering AI landscape so our customers can take advantage of best-in-class capabilities, while CoLab provides the collaboration layer that turns those capabilities into faster, better decisions.\"\nFounded in 2017, CoLab works with leading global manufacturers across automotive, industrial, energy, and medical sectors. The company’s participation in the NVIDIA Inception program underscores its commitment to partnering with market leaders to shape the future of AI-powered engineering.\nAbout CoLab\nCoLab builds AI-powered software for mechanical engineering and product development teams. Its EngineeringOS platform helps engineers make better, faster design decisions by connecting people, data, and AI in one collaborative workspace—capturing expert knowledge as a natural part of day-to-day work.\n\nWith AI agents built into the platform, CoLab enables teams to apply that knowledge automatically to improve design quality and accelerate product development. Founded in 2017, CoLab is trusted by leading global manufacturers to drive decision velocity and bring better products to market, faster.\nAbout the NVIDIA Inception program\nNVIDIA Inception is a global program designed to support startups building innovative AI solutions through access to technology, expertise, and a collaborative ecosystem.\n© 2025 NVIDIA, the NVIDIA logo, and NVIDIA Inception are trademarks and/or registered trademarks of NVIDIA Corporation in the U.S. and other countries.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251217746315/en/\nContacts\npress@colabsoftware.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "20:47:10",
      "Source": "Yahoo Finance",
      "Title": "Cantor Sees Semiconductors Outperforming in 2026 as AI Spending Heats up",
      "URL": "https://finance.yahoo.com/news/cantor-sees-semiconductors-outperforming-2026-124710345.html?.tsrc=rss",
      "Content": "Cantor Sees Semiconductors Outperforming in 2026 as AI Spending Heats up\n\nMoz Farooque ACCA\nWed, December 17, 2025 at 4:47 AM PST 1 min read\n\nIn this article: NVDA\n\n^GSPC\n\nAVGO\n\nMU\n\nWDC\n\nThis article first appeared on GuruFocus .\nNVIDIA Corporation ( NVDA , Financials ) and the broader semiconductor sector may be poised for another strong year, according to a new outlook from Cantor. The firm expects chip stocks to outperform in 2026 as demand for AI infrastructure continues to surge and memory supply remains tight.\n\nWarning! GuruFocus has detected 4 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nCantor noted that the Philadelphia Semiconductor Index has climbed 40% this year, significantly outpacing the S&P 500 and Nasdaq. Analysts believe the same dynamics that powered this year's rally heavy investment from cloud providers, rapid adoption of AI compute, and ongoing supply constraints will carry into next year.\nThe firm highlighted several areas of strength, including AI processors, memory, storage, and semiconductor equipment. Companies tied to hyperscale data center spending, such as Nvidia and Broadcom, remain central to the buildout. At the same time, memory makers like Micron and Western Digital continue to benefit from constrained supply conditions that support pricing.\nCantor argued that the investment cycle behind AI is still in its early stages and should offer multi-year growth potential rather than the short-lived surge some investors feared. With cloud providers reporting strong returns on AI infrastructure, analysts see little sign that demand will taper in the near term.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "20:37:58",
      "Source": "Yahoo Finance",
      "Title": "OpenAI Gears Up For Bigger AI Battles, IPO Buzz In 2026",
      "URL": "https://finance.yahoo.com/m/fb493b14-4635-350c-b397-ec987b41eb8d/openai-gears-up-for-bigger-ai.html?.tsrc=rss",
      "Content": "OpenAI Gears Up For Bigger AI Battles, IPO Buzz In 2026\n\nREINHARDT KRAUSE\nWed, December 17, 2025 at 4:37 AM PST 7 min read\n\nIn this article: OPAI.PVT\n\nMETA\n\nGOOG\n\nANTH.PVT\n\nMSFT\n\nArtificial intelligence pioneer OpenAI in 2026 will aim to maintain AI model leadership, push into enterprise apps, and prepare for an IPO.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "20:33:47",
      "Source": "Yahoo Finance",
      "Title": "Hut 8 shares jump as ex-bitcoin miner signs $7 billion AI data center lease",
      "URL": "https://finance.yahoo.com/news/hut-8-shares-jump-ex-123347104.html?.tsrc=rss",
      "Content": "Hut 8 shares jump as ex-bitcoin miner signs $7 billion AI data center lease\n\nReuters\nUpdated Wed, December 17, 2025 at 5:13 AM PST 1 min read\n\nIn this article: HUT\n\nNVDA\n\nBTC-USD\n\nCRWV\n\nAPLD\n\nDec 17 (Reuters) - Hut 8 ( HUT ) has signed a deal valued at about $7 billion to lease a data center in ​Louisiana, it said on Wednesday, as former cryptocurrency miners pivot ‌to meet surging demand for artificial intelligence infrastructure.\nIts shares rose 21% in premarket trading, ‌adding to the roughly 80% jump this year.\n\nThe company will sign a 15-year lease agreement to develop a 245-megawatt data center in the River Bend campus. Construction of the first phase is expected to be completed ⁠by early 2027.\nThe transition ‌from crypto mining to AI hosting has become a key trend for firms like Hut 8, CoreWeave, ‍and Applied Digital that are repurposing their access to high-voltage power, cooling systems and specialized real estate. These assets are increasingly scarce as AI developers race ​to deploy Nvidia graphics processing units and other essential hardware.\n\nHut ‌8, once a pure-play bitcoin miner, has spent the last year repositioning itself as an energy infrastructure platform.\nThe new deal involves partnerships with AI model developer Anthropic and infrastructure provider Fluidstack. Alphabet-owned Google is providing a financial backstop for the 15-year term, a move that ⁠highlights major cloud providers' urgency to ​secure capacity for power-intensive AI technologies.\nThe agreement ​is also part of a broader collaboration between Hut 8 and Anthropic that could eventually scale to 2.3 gigawatts ‍of capacity. Last ⁠month, Anthropic announced a $50 billion investment to build data centers alongside Fluidstack.\nHut 8 said last month that it had a ⁠total power pipeline of 8.65 gigawatts, ranging from early-stage site diligence to 1.53 gigawatts ‌of late-stage projects under active development.\n(Reporting by Akash Sriram ‌in Bengaluru; Editing by Sahal Muhammed)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "20:00:00",
      "Source": "Yahoo Finance",
      "Title": "6 Top-Performing ETF Areas of Last Week",
      "URL": "https://finance.yahoo.com/news/6-top-performing-etf-areas-120000857.html?.tsrc=rss",
      "Content": "6 Top-Performing ETF Areas of Last Week\n\nSanghamitra Saha\nWed, December 17, 2025 at 4:00 AM PST 3 min read\n\nIn this article: AVGO\n\nSIL\n\nGDXJ\n\nSILJ\n\nCNBS\n\nWall Street was upbeat last week. The S&P 500 lost 0.6%, the Dow Jones advanced 1.1% and the Nasdaq retreated about 1.6% last week. The tech stocks were beaten down, taking a toll on the Nasdaq-100 as well as the S&P 500. Roundhill Magnificent Seven ETF MAGS lost 1.7% last week, while State Street Technology Select Sector SPDR ETF XLK was off 2.5%.\n\nInside the Tech Sell-off Oracle 's ORCL shares plummeted 14% last week as revenues missed expectations, dragging down related AI names like NVIDIA and Micron. Broadcom AVGO fell about 11% despite strong earnings and guidance, intensifying concerns over high capital spending and delayed AI revenue payoffs (read: ETFs to Watch as Oracle Dips Despite Beating on Q2 Earnings).\n\nFed Rate Cut The Fed enacted its final rate cut of the year last week. The move brings the benchmark federal funds rate to a range of 3.5% to 3.75% after a closely divided vote among policymakers.The Fed will now conclude the year facing a softer labor market and inflation still about one percentage point above its 2% target.\n\nAfter three rate cuts in 2025 totaling three-quarters of a percentage point, the Fed&rsquo;s outlook for 2026 looks more restrained. Policymakers continue to project just one rate cut next year, consistent with their September forecast (read: 'A Hawkish Cut' From Fed? ETFs to Gain).\nAgainst this backdrop, below we highlight a few winning exchange-traded fund (ETF) areas of last week.\nWinning ETF Areas in Focus Cannabis\nRoundhill Cannabis ETF WEED &ndash; Up 51.2%\nAmplify Seymour Cannabis ETF CNBS &ndash; Up 51.0%\nCannabis stocks surged significantly on Dec. 12, 2025, thanks to reports of President Trump's plans to ease federal marijuana regulations by reclassifying it to Schedule III from a Schedule I. This news sparked gains across major players, boosting investor optimism despite no final policy confirmation, as mentioned in CNBC.\n\nSilver Miners\nGlobal X Silver Miners ETF SIL &ndash; Up 8.4%\nAmplify Junior Silver Miners ETF SILJ &ndash; Up 7.6%\nSilver is often considered an industrial metal. Rising industrial usage in solar panels, electric vehicles, electronics, and AI data centers has fueled demand. Plus, persistent supply shortages have now been boosting silver prices. As a result, silver mining stocks soared in recent tradings.\nSpace Economy\nProcure Space ETF UFO &ndash; Up 7.8%\nRocket Lab Corp RKLB surged 22.8% last week. The stock is benefiting from the uptick in investors&rsquo; attention in the overall space economy.Rocket Lab&rsquo;s successful move in the next-gen Neutron rocket and securing of new funding from the Canadian Space Agency were other positives. There has been a report about a potential $1.5 trillion SpaceX IPO for 2026 (per Bloomberg, as quoted on Yahoo Finance). SpaceX news acted as a cornerstone for the entire space investing arena.\n\nStory Continues\nGold Miners\nVanEck Junior Gold Miners ETF GDXJ &ndash; Up 7.1%\nSPDR Gold Trust GLD gained 2.2% last week as the greenback weakened further. Since gold mining stocks act as leveraged plays of the underlying metal, GDXJ surged materially.\nPlatinum\nGraniteShares Platinum Trust PLTM &ndash; Up 6.3%\nPlatinum surged above $1,700 per ounce, touching its strongest level since 2011, per Tradingeconomics. The World Platinum Investment Council forecasts a 2025 deficit of 69,200 ounces, marking a third successive annual shortfall. However, 2026 could see a balance in the platinum market with a modest surplus of about 20,000 ounces, as quoted on Tradingeconomics.\n\nHealth Care\nRoundhill GLP-1 & Weight Loss ETF OZEM &ndash; Up 6.3%\nThe Roundhill GLP-1 & Weight Loss ETF is the world&rsquo;s first GLP-1 ETF. OZEM is an actively-managed ETF. The fund charges 59 bps and yields 0.16% annually. Roundhill believes that weight loss drugs, including GLP-1 agonists, offer one of the most groundbreaking advancements in the global pharmaceuticals industry (read: Best-Performing ETFs of November).\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nOracle Corporation (ORCL) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nSPDR Gold Shares (GLD): ETF Research Reports\nState Street Technology Select Sector SPDR ETF (XLK): ETF Research Reports\n\nVanEck Junior Gold Miners ETF (GDXJ): ETF Research Reports\nGlobal X Silver Miners ETF (SIL): ETF Research Reports\nAmplify Junior Silver Miners ETF (SILJ): ETF Research Reports\nProcure Space ETF (UFO): ETF Research Reports\nAmplify Seymour Cannabis ETF (CNBS): ETF Research Reports\nRocket Lab Corporation (RKLB) : Free Stock Analysis Report\nRoundhill Cannabis ETF (WEED): ETF Research Reports\nRoundhill GLP-1 & Weight Loss ETF (OZEM): ETF Research Reports\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "19:55:00",
      "Source": "Yahoo Finance",
      "Title": "Nvidia Stock Gains. This China Chip Company Jumps 700% as It Takes Aim at AI Leader.",
      "URL": "https://finance.yahoo.com/m/c8918d1e-b965-3ed0-a51c-bdab0cb06008/nvidia-stock-gains.-this.html?.tsrc=rss",
      "Content": "Nvidia Stock Gains. This China Chip Company Jumps 700% as It Takes Aim at AI Leader.\n\nAdam Clark\nWed, December 17, 2025 at 3:55 AM PST 2 min read\n\nIn this article: NVDA\n\n688795.SS\n\nAMZN\n\n688256.SS\n\nGOOG\n\nNvidia stock rises Wednesday. But the chip maker faces an increasing number of rivals in the U.S. and China.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "19:37:35",
      "Source": "Yahoo Finance",
      "Title": "AI Chips Update - AlphaTON Capital Expands AI Capabilities With NVIDIA B300 Integration",
      "URL": "https://finance.yahoo.com/news/ai-chips-alphaton-capital-expands-113735902.html?.tsrc=rss",
      "Content": "AI Chips Update - AlphaTON Capital Expands AI Capabilities With NVIDIA B300 Integration\n\nSimply Wall St\nWed, December 17, 2025 at 3:37 AM PST 1 min read\n\nIn this article: ATON\n\nMU\n\nAMD\n\nNVDA\n\nSMCI\n\nAlphaTON Capital has announced the acquisition of its first NVIDIA B300 GPUs, integrated into Supermicro's advanced HGX systems, through a partnership with Atlantic AI. This deployment aims to enhance the Cocoon AI Network by leveraging advanced compute power, thereby offering enterprise-level artificial intelligence capabilities with military-grade privacy protection to users worldwide. The NVIDIA B300 chips, renowned for their high-performance processing suitable for complex AI tasks, mark a significant advancement in delivering democratized AI infrastructure that prioritizes user privacy. This initiative underscores AlphaTON Capital's commitment to providing robust, privacy-focused AI solutions within the decentralized computing sector.\n\nNVIDIA last closed at $177.72 up 0.8%.\nIn other market news, Nexchip Semiconductor was trading firmly up 7.6% and closing at CN¥36.13. On Monday, the company was added to the SSE 180 Index. At the same time, Amkor Technology lagged, down 8.3% to close at $40.28.\nNVIDIA's AI-driven innovation and revenue growth forecast demand immediate investor attention. Click to explore the detailed narrative on the company's potential.\nCheck out our Market Insights article titled \"AI Companies Hit The Bond Market,\" where we examined AI companies' increasing reliance on bond markets for growth funding—move fast before opportunities shift.\nBest AI Chip Stocks Advanced Micro Devices closed at $209.17 up 0.8%. On Monday, December 15, 2025, AMD appointed Emily Ellis as their new Corporate Vice President and Chief Accounting Officer.\nBroadcom closed at $341.30 up 0.4%.\nMicron Technology ended the day at $232.51 down 2.1%.\nSeize The Opportunity Unlock our comprehensive list of 76 AI Chip Stocks like China Resources Microelectronics , Lattice Semiconductor and Entegris by clicking here.\nInterested In Other Possibilities? These 10 companies survived and thrived after COVID and have the right ingredients to survive Trump's tariffs. Discover why before your portfolio feels the trade war pinch.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nStory Continues\nSources:\nSimply Wall St\n\"AlphaTON Capital Secures First NVIDIA B300 Chips with Supermicro HGX Systems\" from AlphaTON Capital on GlobeNewswire (published 15 December 2025)\nCompanies discussed in this article include SHSE:688249 NasdaqGS:NVDA NasdaqGS:AMD NasdaqGS:AVGO NasdaqGS:MU and NasdaqGS:AMKR .\nThis article was originally published by Simply Wall St .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "18:46:09",
      "Source": "Yahoo Finance",
      "Title": "OpenAI in Initial Talks to Raise $10 Billion From Amazon",
      "URL": "https://finance.yahoo.com/video/openai-initial-talks-raise-10-104609545.html?.tsrc=rss",
      "Content": "OpenAI in Initial Talks to Raise $10 Billion From Amazon\n\nBloomberg\nWed, December 17, 2025 at 2:46 AM PST\n\nIn this video: OPAI.PVT\n\nAMZN\n\nNVDA\n\nOpenAI is in initial talks to raise at least $10 billion from Amazon and use its chips, a potential win for the online retailer's effort to broaden its AI industry presence and compete with Nvidia. The deal under discussion could value OpenAI north of $500 billion and see it adopt Amazon's Trainium chip, a person with knowledge of the matter said. Bloomberg's Peter Elstrom reports.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "17:12:00",
      "Source": "Yahoo Finance",
      "Title": "AZIO AI Valuation at Approximately $480 Million Enterprise Value, Underscoring Rapid Emergence as a Critical AI Infrastructure Platform",
      "URL": "https://finance.yahoo.com/news/azio-ai-valuation-approximately-480-091200456.html?.tsrc=rss",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nAZIO AI Valuation at Approximately $480 Million Enterprise Value, Underscoring Rapid Emergence as a Critical AI Infrastructure Platform\n\nPR Newswire\nWed, December 17, 2025 at 1:12 AM PST 3 min read\n\nIn this article: EVTV\n\nNVDA\n\nIndependent valuation highlights accelerating revenue, expanding GPU compute scale, and strategic transaction momentum, including ongoing engagement with Envirotech Vehicles, Inc. (NASDAQ: EVTV)\nLOS ANGELES , Dec. 17, 2025 /PRNewswire/ -- AZIO AI Corporation (\"AZIO\" or the \"Company\"), a rapidly scaling artificial intelligence and high-performance computing infrastructure platform, today announced the completion of an independent valuation analysis, which indicates an enterprise valuation of approximately $480 million, validating AZIO AI's emergence as an institutional-scale AI infrastructure company. The valuation milestone comes as AZIO AI continues to advance strategic transaction activity, including its previously disclosed LOI with Envirotech Vehicles, Inc. (NASDAQ: EVTV), reflecting growing convergence between AI compute infrastructure, energy-efficient systems, and next-generation industrial platforms.\nVALUATION GROUNDED IN CASH FLOW, COMPUTE SCALE, AND MARKET COMPARABLES\nAccording to the valuation report, AZIO AI's enterprise value was derived using income-based approaches across multiple deployment scenarios, including configurations utilizing NVIDIA B200 and next-generation NVIDIA B300 GPUs. These analyses produced a conservative indicated enterprise value of approximately $480 million that reflects a disciplined market positioning and execution assumptions.\n\nThe analysis further highlights substantial upside potential, with forward-looking valuation scenarios exceeding $1.4 billion, based on guideline public-company trading multiples, capital raise and execution, precedent M&A transactions across AI infrastructure, cloud computing, and digital infrastructure sectors.\nREVENUE GROWTH AND SCALABLE INFRASTRUCTURE MODEL\nAzio's valuation reflects projected revenue growth supported by a diversified mix of hardware distribution and higher-margin high-performance computing and GPU-as-a-Service offerings. Modeled revenues scale from approximately $349 million to more than $500 million, with projected EBITDA margins ranging from approximately 20% to over 30%, underscoring the operating leverage inherent in AZIO AI's infrastructure-driven platform.\n\nSTRATEGIC TRANSACTIONS AND PUBLIC-MARKET ALIGNMENT\nAs previously disclosed, AZIO AI is engaged in a LOI that purposes a strategic merger with Envirotech Vehicles, Inc. (NASDAQ: EVTV). Management believes such strategic alignments may enable AZIO AI to deploy AI compute infrastructure across industrial, energy, logistics, and sovereign applications while strengthening its public-market footprint.\n\nStory continues\n\"This independent valuation validates the scale, discipline, and long-term opportunity of the platform we are building,\" said Chris Young, Chief Executive Officer of AZIO AI. \"As global demand for AI compute accelerates, AZIO AI is positioned to support enterprise, government, and strategic partners with reliable, scalable, and economically efficient infrastructure.\"\n\nABOUT AZIO AI CORPORATION\nAZIO AI Corporation is an advanced artificial intelligence and high-performance computing infrastructure company focused on delivering enterprise-grade GPU compute, AI acceleration, and HPC solutions. The Company supports a wide range of applications across artificial intelligence, data analytics, and next-generation digital infrastructure.\nFORWARD-LOOKING STATEMENTS\nThis press release contains certain \"forward-looking statements\" within the meaning of the United States Private Securities Litigation Reform Act of 1995, including statements regarding valuation, projected revenues, strategic transactions, future growth, and market opportunities. These statements are based on current expectations and assumptions and are subject to risks and uncertainties that could cause actual results to differ materially. AZIO AI undertakes no obligation to update any forward-looking statements, except as required by law.\nMEDIA CONTACT\nPhoenix Management Consulting\nPress@PhoenixMGMTConsulting.com\n888-228-0122\nView original content to download multimedia: https://www.prnewswire.com/news-releases/azio-ai-valuation-at-approximately-480-million-enterprise-value-underscoring-rapid-emergence-as-a-critical-ai-infrastructure-platform-302644515.html\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "16:16:03",
      "Source": "Yahoo Finance",
      "Title": "Chinese Stocks Stage Sudden Rally as Tech Enthusiasm Roars Back",
      "URL": "https://finance.yahoo.com/news/chinese-stocks-stage-sudden-rally-081603529.html?.tsrc=rss",
      "Content": "Chinese Stocks Stage Sudden Rally as Tech Enthusiasm Roars Back\n\nBloomberg News\nWed, December 17, 2025 at 12:16 AM PST 2 min read\n\nIn this article: NVDA\n\n300394.SZ\n\n300502.SZ\n\nU10.SI\n\nHUATF\n\n(Bloomberg) -- Chinese stocks rose sharply on Wednesday as enthusiasm around the nation’s technology shares returned, fueled by large gains in recent initial public offerings.\nThe onshore benchmark CSI 300 Index jumped 1.8%, capping its best day in more than three months. Chinese hardware makers including Suzhou TFC Optical Communication Co. and Eoptolink Technology Inc. were among the top gainers. The tech‑focused ChiNext Index climbed more than 3%, and a gauge of major Chinese companies trading in Hong Kong rose 1% at the close.\n\nMost Read from Bloomberg\nHudson Tunnel Digging Work to Start as Boring Machines Ready\nCan Netflix Help Save the American Mall?\nHow This Chameleon UK Location Became a Little-Known Hollywood Backdrop\nNew York Says Cab, Rideshare Insurance Rates to Rise 25%\nNew York Utility Says Queue for Large Power Users Has Tripled\nInvestor confidence was boosted by MetaX Integrated Circuits Shanghai Co.’s blockbuster debut Wednesday. The GPU maker’s shares soared almost 700% at the close, reviving interest in China’s artificial intelligence-related stocks. It was the second big debut this month, after the so-called Nvidia challenger Moore Threads Technology Co. jumped 425% on its first trading day.\n“Chinese investors gained confidence with the help of technology IPOs at year-end, which made it easier for funds to drive the stock index higher,” said Shen Meng, director at Beijing-based investment bank Chanson & Co.\nChina Chipmaker MetaX Jumps 755% After Wildly Oversubscribed IPO\nThe afternoon spike also coincided with a jump in brokerages such as Huatai Securities Co., whose shares surged by the daily limit of 10% at one point. Turnover in eight exchange-traded funds — widely used by the so-called national team of state-linked investors — reached 19.2 billion yuan on Wednesday. That compares with 14.4 billion yuan on average over the past two months.\n\nTurnover in the top seven ETFs tied to the A500 Index hit a record 48.9 billion yuan.\n“There is some speculation of the national team buying ETFs, which is supporting market sentiment,” said Steven Leung, an executive director at Uob Kay Hian Hong Kong. “But overall there should be limited downside from here after the recent pullback.”\nStill, whether Wednesday’s rally can extend depends on the outlook for China’s economic recovery. Investor mood soured this week after fresh signs of weak growth, adding to earlier concerns about lofty tech valuations. The MSCI China Index has fallen into a technical correction, and the Hang Seng Tech Index is set to become the first key Chinese stock gauge to slip into a bear market.\n\nStory Continues\n--With assistance from Winnie Hsu and April Ma.\nMost Read from Bloomberg Businessweek\nThe Cracks in Crumbl’s Cookie Empire Are Showing\nDonald and Melania Trump’s Terrible, Tacky, Seemingly Legal Memecoin Adventure\nOracle’s $300 Billion AI Bet Has Fast Become a Bubble Barometer\nKalshi and Other Prediction Markets Should Scare Sports Leagues\nHow Billionaire Wes Edens’ Big Energy Dream Hit the Rocks\n©2025 Bloomberg L.P.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 15
}