{
  "stock_id": "NVDA",
  "last_updated": "2025-12-17T15:06:27.301Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-17",
      "Time": "22:49:03",
      "Source": "Investor's Business Daily",
      "Title": "OpenAI In Talks To Get $10 Billion Amazon Investment, Use Its Chips: The Information",
      "URL": "https://finance.yahoo.com/m/2726b9b8-789b-3d00-8ef3-494b9b80d8bf/openai-in-talks-to-get-%2410.html",
      "Content": "OpenAI In Talks To Get $10 Billion Amazon Investment, Use Its Chips: The Information\n\nED CARSON\nWed, December 17, 2025 at 6:49 AM PST 1 min read\n\nIn this article: AMZN\n\nNVDA\n\nAVGO\n\nAMD\n\nORCL\n\nAmazon is in talks to invest at least $10 billion in OpenAI, which would use the e-commerce giant's in-house AI chips.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:35:00",
      "Source": "Motley Fool",
      "Title": "This $200 Billion Streaming Giant Is Partnering With a Top AI Company (Hint: It's Not Nvidia)",
      "URL": "https://finance.yahoo.com/m/bd1b82a5-48d2-35de-a53e-59bc9c745190/this-%24200-billion-streaming.html",
      "Content": "This $200 Billion Streaming Giant Is Partnering With a Top AI Company (Hint: It's Not Nvidia)\n\nNeil Patel, The Motley Fool\nWed, December 17, 2025 at 6:35 AM PST 4 min read\n\nIn this article: NVDA\n\nKey Points A well-known media and entertainment powerhouse inked a three-year deal with the creator of the most popular large language model.\nThis move demonstrates just how valuable it is to own high-quality intellectual property, which can be monetized in unique ways.\nInvestors seeking value in today’s market are in luck.\n10 stocks we like better than Walt Disney ›\n\nDespite fears of a possible bubble bursting, artificial intelligence (AI) is a technology that increasingly looks like it's not going away. There are already businesses winning the AI race, whether they make hardware, operate cloud platforms, or run the large language models that have become so popular among consumers.\nBut other industries are starting to embrace AI instead of fighting it, showcasing how seriously executive teams are taking this new technology to bolster their competitive positions.\nIn fact, a prominent streaming giant just decided to partner with a top AI company in a move that could impact the media and entertainment sector. Investors should take notice.\nThe House of Mouse is leaning into AI It was announced on Dec. 11 that Walt Disney (NYSE: DIS) entered a three-year partnership with OpenAI , licensing more than 200 characters (including Mickey Mouse, characters from Inside Out and Frozen, and Marvel superheroes) for photo generation on ChatGPT and video generation on Sora by those apps' user bases. Disney can show these user-generated videos on Disney+, its streaming platform.\n\nWhat's more, Disney will invest $1 billion in OpenAI. And it will become a customer, integrating OpenAI's technology across its organization in various ways for its employees and to help create new products for customers.\nThis is clear evidence that Disney is leaning into AI, at a time when those in Hollywood worry about the tech's impact on content creation.\n\"Disney and OpenAI affirm a shared commitment to responsible use of AI that protects the safety of users and the rights of creators,\" the press release reads.\nThis is an encouraging statement for those in the industry, but it will be interesting to see how much appetite there is for watching AI-created videos from viewers.\nDisney benefits because it can potentially earn incremental revenue by leveraging its intellectual property in this new way. While it's not known if the business will make money from its characters' use on ChatGPT or Sora prompts, it can drive more engagement on Disney+ if this type of short-form content catches on. Disney could better compete with Meta Platforms ' Reels on Facebook and Instagram and Alphabet 's YouTube Shorts. There is intense competition for attention .\n\nStory Continues\nAnd it gives Disney a first-mover advantage. Perhaps if AI-generated videos go viral, investors could see similar moves by Netflix , for example.\nOne obvious critique of this decision might be that Disney is selling out and diluting the value of its intellectual property, making its famous characters available to the masses. With ChatGPT counting 800 million weekly users (as of early November), however, this is a good example of a media and entertainment powerhouse attempting to stay ahead of the curve.\n\nInvestors can find value in the streaming market This partnership highlights just how valuable Disney's intellectual property is. With characters, storylines, and franchises that span Disney, Pixar, Marvel, and Lucasfilm, no company can go toe-to-toe with this depth and breadth of content. It makes sense that OpenAI would want to sign a deal with an industry leader. This also suggests there has been significant demand from ChatGPT and Sora users to be more creative and work with Disney characters rather than other studios' intellectual property.\n\nFrom an investment point of view, those looking to put capital to work in the streaming industry might want to consider Disney. It has become a leader in the streaming wars, with Disney+, Hulu, and ESPN providing a full range of content for an entire household. And its experiences segment is extremely profitable.\nShares currently trade at a forward price-to-earnings ratio of 16.8. It's difficult to find value like this in the stock market these days.\nShould you buy stock in Walt Disney right now? Before you buy stock in Walt Disney, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Walt Disney wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,955 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,089,460 !*\nNow, it’s worth noting Stock Advisor’s total average return is 968 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nNeil Patel has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Meta Platforms, Netflix, and Walt Disney. The Motley Fool has a disclosure policy .\nThis $200 Billion Streaming Giant Is Partnering With a Top AI Company (Hint: It's Not Nvidia) was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:33:00",
      "Source": "GlobeNewswire",
      "Title": "RLWRLD Wins Foundation Models Category at Nebius Robotics & Physical AI Awards",
      "URL": "https://finance.yahoo.com/news/rlwrld-wins-foundation-models-category-143300885.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nRLWRLD Wins Foundation Models Category at Nebius Robotics & Physical AI Awards\n\nRLWRLD Inc.\nWed, December 17, 2025 at 6:33 AM PST 3 min read\n\nIn this article: NVDA\n\nOPAI.PVT\n\nNBIS\n\nThe Physical AI startup was recognized by judges from NVIDIA, OpenAI, and leading venture firms for its robotics foundation model already being deployed in early industrial use cases.\n\nMOUNTAIN VIEW, Calif., Dec. 17, 2025 (GLOBE NEWSWIRE) -- RLWRLD , a Physical AI startup building robotics foundation models for real-world deployment, has won first place in the Foundation Models, Robot Brains and Runtime category at the 2025 Nebius Robotics & Physical AI Awards, a global competition recognizing early-stage companies advancing next-generation robotics and Physical AI.\n\nHosted by Nebius (NASDAQ: NBIS) and supported by NVIDIA, the awards were announced at the Computer History Museum in Mountain View as part of the inaugural Nebius Robotics & Physical AI Awards and Summit. The program awarded $1.5 million in AI cloud compute and inference credits to startups selected from more than 250 applicants across 60+ countries.\nRLWRLD was selected as the top winner following evaluations by a judging panel that included leaders from NVIDIA, OpenAI, ABB, Physical Intelligence, and venture firms such as Khosla Ventures, Accel, Next47, and Shanda Grab Ventures. Judges assessed finalists on technical originality, scalability, and readiness for real-world deployment.\nAs the first-place winner in the Foundation Models category, RLWRLD received $150,000 in Nebius AI Cloud compute and inference credits, accelerated by NVIDIA AI infrastructure.\n\nThe Nebius Robotics & Physical AI Awards were created to spotlight startups building the models and systems required to deploy Physical AI in real industrial environments. Sixteen companies were recognized across categories spanning Foundation Models, Simulation, Robot Runtime, Industrial Deployment, and Vision AI.\nRLWRLD’s work focuses on building robot foundation models designed for high-difficulty manipulation and reliable industrial deployment, rather than technology demonstrations for general-purpose robotics. At the core of its platform is RLDX, a proprietary robotics foundation model capable of controlling a 15-degree-of-freedom robotic hand, enabling precise manipulation tasks that require human-level dexterity.\nJudges also cited RLWRLD’s use of high-fidelity, multimodal industrial data and its active collaboration with industry partners as indicators of the company’s commercial readiness, particularly for manufacturing and logistics environments where reliability and precision are critical.\n“Winning this category reinforces our belief that Physical AI needs foundation models built for the real world, not just controlled demos,” said Jung-hee Ryu, CEO of RLWRLD . “This recognition reflects the progress we’ve made working directly with industry partners to deploy our technology.”\n\nStory Continues\nFollowing the award, RLWRLD plans to expand global partnerships and accelerate commercial deployment of its foundation models across humanoid and industrial robotics, with a focus on manufacturing and logistics environments in the U.S. and Asia.\nAbout RLWRLD\nFounded in 2024, RLWRLD is a Physical AI startup developing robot foundation models that enable machines to see, sense, and act with human-like dexterity and cognition. The company operates across the United States, South Korea, and Japan, and trains its models using high-precision 4D+ multimodal industrial data collected through a proprietary multi-sensor capture system. RLWRLD is currently working with major manufacturing partners in South Korea and Japan and aims to become a global leader in industrial robotics AI.\nMedia Contact\nKite Hill\nRLWRLD@kitehillpr.com\nA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/4de89afb-3ddf-4e45-8150-57ee7810e073\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:28:45",
      "Source": "Yahoo Finance",
      "Title": "The stock market is being powered by 10 stocks that are fueling AI bubble fears",
      "URL": "https://finance.yahoo.com/news/the-stock-market-is-being-powered-by-10-stocks-that-are-fueling-ai-bubble-fears-142845016.html",
      "Content": "The stock market is being powered by 10 stocks that are fueling AI bubble fears\n\nBrian Sozzi · Executive Editor\nUpdated Wed, December 17, 2025 at 6:28 AM PST 2 min read\n\nIn this article: ^GSPC\n\n^DJI\n\n^IXIC\n\n^SPX\n\nGOOG\n\nIf you're in the \"stock market is in a bubble\" camp, look no further than the composition of the S&P 500 ( ^GSPC ).\nThe top 10 stocks now account for roughly 32% of S&P 500 earnings and over 41% of total market capitalization — levels not seen since at least 1980, according to new data from Barclays strategist Venu Krishna.\n\nThe \"Magnificent Seven\" stocks have been the primary driver of this market power concentration. Those seven companies — Microsoft ( MSFT ), Amazon ( AMZN ), Alphabet ( GOOGL ), Meta ( META ), Tesla ( TSLA ), Nvidia ( NVDA ), and Apple ( AAPL ) — are essentially powering the artificial intelligence boom.\nThese stocks are up on average 21% this year compared to a 15% gain for the S&P 500, according to Yahoo Finance data. Alphabet is the top performer with an advance of 62% amid optimism on its new Gemini 3 model.\nIn turn, the valuation of the S&P 500 has reached a level even most bulls would agree is on the rich side. Krishna's work reveals the S&P 500 is trading at the 91st percentile relative to its 10-year valuation history.\n\"Complacency\" could ignite an AI bubble, Deutsche Bank strategist Adrian Cox told me on Yahoo Finance's Opening Bid (video above).\nRead more: How AI, unemployment, and interest rates could shape the stock market and your investments next year\nIndeed, complacency appears to have settled in, despite the risks investors had to endure this year.\nRemember the \"Liberation Day\" tariff spectacle in April? The S&P 500 tanked 4.8% the day after President Trump unveiled sweeping tariffs on April 2. The Dow Jones Industrial Average ( ^DJI ) dropped a staggering 1,679 points.\n\nTariffs are now in effect, though they are not as severe as first advertised.\nAnd more recently, disappointments from AI darlings CoreWeave ( CRWV ) and Oracle ( ORCL ) have begun to call into question the near-term outlook for the AI trade.\n\"I think we're going to see some pretty massive bifurcation in 2026 in the AI trade,\" Sevens Report Research founder Tom Essaye said on Opening Bid .\nAlphabet is Essaye's top AI pick for 2026, though he acknowledges there are likely to be winners and losers from the Magnificent Seven complex next year.\n\"I think companies like Oracle that [are] not overextended financially but are sort of raising eyebrows with a lot of the spending that is tied to open AI, I think that companies like that could struggle,\" Essaye added. \"There's going to be some pretty serious bifurcation. We've seen it in the last, say, two months of 2025. I think that gets worse in 2026.\"\n\nStory Continues\nBrian Sozzi is Yahoo Finance's Executive Editor and a member of Yahoo Finance's editorial leadership team. Follow Sozzi on X @BrianSozzi , Instagram , and LinkedIn . Tips on stories? Email brian.sozzi@yahoofinance.com.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices\nRead the latest financial and business news from Yahoo Finance\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:27:00",
      "Source": "Business Wire",
      "Title": "Nebius AI Cloud 3.1 Delivers Next-Generation NVIDIA Blackwell Ultra Compute with Transparent Capacity Management for AI at Scale",
      "URL": "https://finance.yahoo.com/news/nebius-ai-cloud-3-1-142700460.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nNebius AI Cloud 3.1 Delivers Next-Generation NVIDIA Blackwell Ultra Compute with Transparent Capacity Management for AI at Scale\n\nBusiness Wire\nWed, December 17, 2025 at 6:27 AM PST 4 min read\n\nIn this article: NVDA\n\nNBIS\n\nNVIDIA HGX B300 and GB300 NVL72 systems with 800 Gbps NVIDIA Quantum-X800 InfiniBand — Europe’s first GB300 NVL72 on this fabric — deliver next-generation performance for large-scale AI training and inference\nNew Capacity Blocks and real-time dashboard features provide transparent visibility into GPU availability, enabling precise resource planning and operational efficiency at scale\n\nAether 3.1 also delivers enhanced AI/ML developer tooling, expanded ecosystem integrations and granular enterprise-grade governance controls, accelerating time-to-value while reducing risk\nAMSTERDAM, December 17, 2025 --( BUSINESS WIRE )--Nebius today announced Nebius AI Cloud 3.1, bringing next-generation NVIDIA Blackwell Ultra compute and enhanced operational capabilities to the latest release of its full-stack AI cloud platform. Version 3.1 builds on the foundations of Nebius AI Cloud \"Aether\" , adding transparent capacity management and expanded infrastructure to deliver the operational visibility and resource-planning capabilities that customers need as they scale AI in production.\nAs customers move beyond experiments to large-scale adoption, they are identifying clear operational priorities, including real-time visibility into GPU capacity across regions, transparent resource allocation for multi-team environments, and access to next-generation compute as models grow in complexity. Nebius AI Cloud 3.1 addresses these needs across three dimensions.\n\nNebius is deploying NVIDIA Blackwell Ultra infrastructure globally, with NVIDIA GB300 NVL72 systems and NVIDIA HGX B300 systems already being used by customers. Nebius is now the first cloud in Europe to operate both platforms in production. Nebius AI Cloud is also the first provider globally to run production GB300NVL72 systems on 800 Gbps NVIDIA Quantum-X800 InfiniBand interconnect — doubling throughput for distributed workloads. This, alongside hardware-accelerated networking and enhanced storage caching that eliminate infrastructure bottlenecks, further complements leading results in MLPerf® Training v5.1 benchmarks.\nTo meet enterprise demands for operational transparency, version 3.1 introduces Capacity Blocks and a real-time Capacity Dashboard that give customers complete visibility into their reserved GPU capacity and availability across all data center regions. Project-level quotas and new lifecycle object storage rules extend granular control over resource allocation and costs.\n\nThe Nebius AI Cloud platform ecosystem is also continuing to expand. Beyond a new native integration with Dstack, version 3.1 simplifies deployment and consumption of NVIDIA BioNeMo NIM microservices , including Boltz2, Evo-2, GenMol, and MolMIM, without requiring NGC keys or NVIDIA AI Enterprise licenses. Additional features focused on developer usability include enhanced Slurm-based orchestration with Manager Soperator, FOCUS-compliant billing exports and various console UX improvements.\n\nStory Continues\nThe latest release also builds on Aether's enterprise-ready security foundation with object storage data-plane audit logs for HIPAA compliance, per-object access controls, and VPC security groups. Enhanced IAM with Microsoft Entra ID integration and granular service roles provide stronger governance with simplified administration, advancing the compliance capabilities that enable customers in highly regulated sectors and government to deploy production AI workloads.\n\nNebius will hold a technical walkthrough webinar on Nebius AI Cloud 3.1 including a live Q&A session on January 29, at 6 p.m. CET / midday EST / 9 a.m. PST. Please register here for more information.\nNebius AI Cloud 3.1 — at a glance\nNext-generation compute\nNVIDIA HGX B300 and GB300 NVL72 systems with 800 Gbps NVIDIA Quantum-X800 InfiniBand\nHardware-accelerated networking, storage write-back caching, and expanded filesystem performance scaling\nLeading performance in MLPerf® Training v5.1 benchmarks\nOperational visibility and efficiency\nCapacity Blocks for reserved GPU planning and tracking\nCapacity Dashboard with real-time GPU availability across all regions\nProject-level quotas for granular resource control\nNew lifecycle object storage rules for cost optimization\n\nDeveloper productivity\nNVIDIA BioNemo NIM microservices for Healthcare & Life Sciences workflows\nSlurm-based scaling and Dstack native support FOCUS-compliant billing exports for FinOps integration\nSecurity and governance\nAudit logs with object storage data-plane events for HIPAA-compliant configurations and per-object access controls\nVPC Security Groups for network-level protection\nEnhanced IAM with Microsoft Entra ID login, visual SSO management, and granular service roles\nAdditional resources\nBlog post from our Product Management team\nBlog post on NVIDIA GB300 NVL72 systems now operational at our Finland data center\nBlog post on NVIDIA NIM microservices\nBlog post on Capacity Blocks, API and Dashboards\nWebinar and live Q&A registration\nAbout Nebius\n\nNebius is a technology company building full-stack cloud infrastructure for the global AI industry. Headquartered in Amsterdam and listed on Nasdaq (NASDAQ: NBIS), the company has a global footprint with R&D hubs across Europe, North America, and Israel.\nNebius AI Cloud has been built from the ground up for intensive AI workloads. With proprietary software and hardware designed in-house, Nebius gives AI builders the compute, storage, managed services, and tools they need to build, tune, and run their models.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251217322341/en/\nContacts\nInvestor Relations: askIR@nebius.com\nMedia Relations: media@nebius.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:25:16",
      "Source": "24/7 Wall St.",
      "Title": "Nvidia (NASDAQ: NVDA) Stock Price Prediction for 2026: Where Will It Be in 1 Year (Dec 17)",
      "URL": "https://finance.yahoo.com/m/fbc40b68-e691-3ac2-ac6e-c468b91245d1/nvidia-%28nasdaq%3A-nvda%29-stock.html",
      "Content": "Nvidia (NASDAQ: NVDA) Stock Price Prediction for 2026: Where Will It Be in 1 Year (Dec 17)\n\nJoel South\nWed, December 17, 2025 at 6:25 AM PST 6 min read\n\nIn this article: NVDA\n\nTM\n\nTOYOF\n\nTSM\n\nTSMWF\n\nShares of Nvidia Corp. ( NASDAQ: NVDA ) have retreated 3.4% in the past week, as it announced the acquisition of SchedMD and a partnership with Mistral AI, and in the wake of the White House approving sales of H200 chips to certain Chinese customers. Meanwhile, insiders continue to sell shares. Nvidia’s stock is 22.8% higher than six months ago, outperforming the S&P 500 and Nasdaq in that time.\n\n24/7 Wall St. Key Points U.S.-China trade relations have presented headwinds, but Nvidia Corp. ( NASDAQ: NVDA ) is also the dominant AI chipmaker in the market, and the company’s profitability remains strong.\nHere is a look at where Nvidia stock could be headed for the rest of this year and into the next.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality. Read more here .\n\nNote that gains for the chipmaker in that time have helped wipe away the steep drop the stock suffered early in 2025, after it reported it would take a $5.5 billion charge tied to the H20 chip export restrictions to China. While some analysts have raised price targets, others caution about ongoing headwinds due to uncertainty surrounding future U.S.-China trade relations and the potential for stricter regulations. The third-quarter report was stellar on the top and bottom lines due to strong growth in the data center segment.\nDespite its challenges, the company's pivot to U.S. AI infrastructure investments signals resilience. With analysts eyeing robust data center demand, 24/7 Wall St. here explores whether Nvidia can sustain its recovery and drive further growth.\n\nWhy Invest in Nvidia? Nvidia faces significant hurdles as it navigates U.S.-China trade restrictions and intense market expectations. In the first quarter, export controls on its H20 AI chip—which had been designed specifically to circumvent export restrictions on advanced technology to China—led to the substantial write-down noted above. Analysts believed the ban could result in a $9 billion revenue hit. Some $700 million would affect fiscal first-quarter results, with the remaining $8 billion spread across the second and third quarters.\n\nU.S. tariffs and China’s retaliatory measures also threatened supply chain costs, particularly for components sourced globally, while competition from Huawei’s Ascend chips grows. These factors had analysts warning of margin pressure. Yet, Nvidia's profitability remains robust. The company has reportedly raised prices 10% to 15% on some of its most popular GPUs as a result of the tariffs. Gaming processor prices jumped 5% to 10%, while it hiked high-end AI GPUs as much as 15% to account for surging manufacturing costs and to keep its earnings stable.\n\nStory Continues\nYet investments in U.S. AI infrastructure, supported by Taiwan Semiconductor Manufacturing's $165 billion Arizona fab expansion, bolster Nvidia's supply chains and are backed by its $37.6 billion cash reserve.\nCEO Huang announced during his recent trip to South Korea that Nvidia will supply more than 260,000 advanced graphics processing units (GPUs) to South Korean firms, including Samsung and Hyundai Motor. He believes AI has reached a \"virtuous cycle\" where improvements in the models lead to more investment, which in turn leads to further improvement and investment. He also expressed hope that trade talks between the U.S. and China might lead to a change in policy that allows Nvidia to resume sales of state-of-the-art chips in China. As mentioned, the U.S. president has now allowed the company to sell its advanced H200 AI chips to China.\n\nThe AI market is projected to grow at a 37% CAGR through 2030, according to Grand View Research. This supports Nvidia’s $170 billion fiscal 2026 revenue forecast, a 30% increase over the $130.5 billion it generated in 2025.\nNvidia as a Company In its third-quarter earnings report, Nvidia revenue totaled a record $57.01 billion, including $51.2 billion from its data center division. The total was up 66% year over year, largely fueled by the voracious demand for its AI chips.\nThe chipmaker invested $3.2 billion in capital expenditures in fiscal 2025, expanding Blackwell accelerator production and AI infrastructure. The company's capex has spiked over 200% this year to more than $3 billion to meet hyperscaler demand.\n\nU.S.-China trade restrictions still pose risks, even with the seeming thaw, tariffs could raise costs, which would explain the price hikes reportedly implemented. A 36% operating expense increase to $5.8 billion for R&D offset Nvidia's adjusted operating income of $37.8 billion.\nYet, Nvidia's growth is not solely tied to data centers. The company expanded its automotive segment, with a 32% year-over-year increase to $592 million, driven by partnerships with Toyota and Aurora Innovation for autonomous vehicles. This diversifies Nvidia's portfolio amid tariff uncertainties.\nNvidia has projected fiscal third-quarter revenue of $65 billion, plus or minus 2%. This outlook exceeded analysts' consensus projection.\nNvidia as a Stock This has been a rollercoaster year for Nvidia shareholders. The stock dropped to a 52-week low of $86.62 in April. After an announced pause in U.S.-China tariffs and the first-quarter results, the share price recovered. It hit an all-time high of $212.19 in October, which had the company's market cap briefly over $5 trillion.\n\nWhile some insiders have been selling shares, analyst sentiment remains bullish. Of 64 analysts who cover the stock, 60 recommend buying shares, 11 of them with Strong Buy ratings. Their consensus one-year price target is $250.93, which signals over 41% upside potential from its current price. Targets range from $140 to $352 per share.\nCitigroup, J.P. Morgan, Morgan Stanley, and others recently maintained their Buy-equivalent ratings. Evercore ISI has the street-high target price. It cited accelerating revenue growth, strong demand for Blackwell chips, an improving supply chain, and a significant pipeline. Yet, renowned investor Michael Burry is bearish on Nvidia.\nEstimate\nPrice Target\nChange From Current Price\nLow\n$140.00\n−21.2%\nMedian\n$250.93\n41.2%\nHigh\n$352.00\n98.1%\n\nNvidia's AI dominance, 93% data center growth, and automotive partnerships with Toyota positioned the company for gains in 2025. However, tariff risks and DeepSeek’s competitive AI models require caution. The AI market's growth and the chipmaker's $47 billion second-quarter revenue position Nvidia to achieve its $170 billion full-year revenue target, while its cash buffer and Stargate Project role offer stability. Still, valuation concerns linger. Nvidia is a buy for growth-oriented investors, but others should use caution.\n\n24/7 Wall St.'s 2026 year-end price target for Nvidia is $300.14 per share, which would be a 68.9% gain. That estimate accounts for tariff risks, competition from DeepSeek, and potential Blackwell supply constraints. It also reflects Nvidia's AI dominance and second-quarter 2026 revenue guidance.\nTime to Sell Nvidia Stock as Michael Burry Takes Aim?\n\nData Shows One Habit Doubles American’s Savings And Boosts Retirement Most Americans drastically underestimate how much they need to retire and overestimate how prepared they are. But data shows that people with one habit have more than double the savings of those who don’t.\nAnd no, it’s got nothing to do with increasing your income, savings, clipping coupons, or even cutting back on your lifestyle. It’s much more straightforward (and powerful) than any of that. Frankly, it’s shocking more people don’t adopt the habit given how easy it is .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:20:00",
      "Source": "Motley Fool",
      "Title": "Marvell Technology Looks Undervalued as Artificial Intelligence Spending Surges",
      "URL": "https://finance.yahoo.com/m/03fe6953-ee67-3c91-8978-50bad226be2d/marvell-technology-looks.html",
      "Content": "Marvell Technology Looks Undervalued as Artificial Intelligence Spending Surges\n\nMarc Guberti, The Motley Fool\nWed, December 17, 2025 at 6:20 AM PST 4 min read\n\nIn this article: NVDA\n\nPLTR\n\nKey Points Marvell Technology is one of the most undervalued AI stocks right now, and it's down by 25% this year.\nA sale and acquisition have positioned the company to become a long-term winner in the AI data center boom.\nA questionable rumor still weighs heavily on the stock despite Marvell Technology's CEO rebuking it.\n10 stocks we like better than Marvell Technology ›\n\nIf you want to find undervalued artificial intelligence (AI) stocks , you have to start with ones that aren't receiving as much hype. Nvidia is the most well-known growth stock right now, and Palantir Technologies is another AI leader that has attracted plenty of investors.\nHowever, fewer investors know about Marvell Technology (NASDAQ: MRVL) , and a few controversial rumors have made the stock even cheaper. Marvell Technology is a custom AI chipmaker that investors may want to monitor.\nDispelling the rumors Marvell Technology looked undervalued for most of the year. Its revenue growth rates have steadily outpaced the stock's 25% year-to-date decline. However, Marvell took another hit when rumors swirled around that the company lost a lot of business from Amazon and Microsoft .\nThat type of news would be devastating for the company. AI chipmakers make most of their revenue from a small handful of tech companies , and losing two of the largest hyperscalers in the industry would limit future growth opportunities. Other tech companies may be wary of doing business with an AI chipmaker that lost Amazon and Microsoft.\n\nHowever, Marvell Technology CEO Matt Murphy poured cold water on the rumors when speaking with CNBC's Jim Cramer. Murphy told viewers that Marvell did not lose any business from those tech giants.\nThe debunked rumor continues to weigh on the stock price, which presents an opportunity for long-term investors. However, the credibility around this rumor isn't the only reason investors should appreciate the dip in Marvell Technology stock.\nMarvell's valuation hasn't moved as quickly as its revenue Marvell Technology has a 23.5 forward P/E ratio and continues to post impressive revenue growth. The chipmaker boosted its sales by 37% year over year in the third quarter of its fiscal 2026, ended Nov. 1, while operating income increased by 23% year over year.\nThe net income figure for the third quarter isn't the best for gauging the stock since that number includes the proceeds from a $2.5 billion sale of its automotive Ethernet business. It's a one-off event that inflated Marvell Technology's net income growth, but the company has maintained a net profit margin of roughly 10% in previous quarters.\n\nStory continues\nThis isn't even the first quarter of strong growth for fiscal 2026. Marvell delivered 63% and 58% year-over-year revenue growth rates in the first and second quarters of fiscal 2026. Its revenue and net income are moving in the right direction despite its stock price suggesting that the complete opposite has happened.\n\nMarvell Technology is locked into AI chip growth Marvell's $2.5 billion divestiture gave it more capital while freeing up resources to prioritize custom AI chips. However, the company didn't just stop with selling off a slower part of its business. The AI chipmaker acquired photonic fabric provider Celestial AI for $3.25 billion. The total acquisition may be valued at $5.5 billion if certain sales objectives are achieved.\n\nThe deal should help Marvell Technology scale faster in the burgeoning AI data center industry and boost demand for its AI chips. AWS Vice President of Compute and Machine Learning Services Dave Brown praised the December acquisition, casting even more doubt into rumors that Marvell Technology lost business from two tech giants.\nMarvell swapped a slow-growth business for a high-growth one that complements its AI ambitions nicely. Investors have not yet priced in this reality. Marvell shares traded above $100 per share to start the year, and it may be due for a rally to all-time highs soon enough.\nIf the AI chipmaker continues to post 30%-plus year-over-year revenue growth in fiscal 2027 and beyond, the mismatch between revenue growth and its current valuation will become more difficult to ignore.\n\nShould you buy stock in Marvell Technology right now? Before you buy stock in Marvell Technology, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Marvell Technology wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,955 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,089,460 !*\nNow, it’s worth noting Stock Advisor’s total average return is 968 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nMarc Guberti has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon, Microsoft, Nvidia, and Palantir Technologies. The Motley Fool recommends Marvell Technology and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nMarvell Technology Looks Undervalued as Artificial Intelligence Spending Surges was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:19:00",
      "Source": "Business Wire",
      "Title": "Comparably Announces 2025 Best Compensation, Best CEO’s and Best Company Culture Awards",
      "URL": "https://finance.yahoo.com/news/comparably-announces-2025-best-compensation-141900368.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nComparably Announces 2025 Best Compensation, Best CEO’s and Best Company Culture Awards\n\nBusiness Wire\nWed, December 17, 2025 at 6:19 AM PST 2 min read\n\nIn this article: ADBE\n\nGTM\n\nGOOG\n\nNVDA\n\nElsevier, ADP, Adobe, Google, and NVIDIA lead 2025 rankings as employee sentiment highlights emerging and established workplace leaders\nVANCOUVER, Wash., December 17, 2025 --( BUSINESS WIRE )--Comparably (a ZoomInfo company) – a leading employee review platform for workplace culture and compensation – announced the winners of its 2025 Best Compensation, Best CEOs, and Best Company Culture Awards last week, highlighting organizations that employees rate highest for leadership, pay, and overall workplace experience.\n\nElsevier earned the #1 ranking for Best Company Culture among large companies, reinforcing its position as one of the most consistently admired workplaces. ADP claimed the top spot for Best CEOs, reflecting strong employee confidence in executive leadership, while Adobe secured #1 for Best Compensation, standing out for employee satisfaction with pay and rewards.\nWith more than 20 million ratings across 70,000 companies, Comparably's annual rankings provide comprehensive insights into workplace satisfaction and employee experience across diverse industries and organizational structures. The awards are based on anonymous feedback provided on Comparably.com over the past 12 months, representing millions of ratings from employees across companies of all sizes and industries.\n\n\"Based on millions of anonymous employee ratings, the Comparably Awards provide authentic, unfiltered proof points that top candidates demand,\" said Jon Bischke, GM of ZoomInfo Talent Solutions. \"For winning organizations, this is a badge of honor and powerful competitive advantage that directly influences their ability to attract and retain the best talent. Plus candidates can trust that they're based on real experiences, not marketing spin.\"\n2025 Best Company Culture (Large Companies):\nElsevier\nThe Breakers Palm Beach\nRingCentral\n2025 Best CEOs (Large Companies):\nADP\nElsevier\nAdobe\n2025 Best Compensation (Large Companies):\nAdobe\nNVIDIA\nGoogle\nThe full list of ranked companies can be found on Comparably’s Awards page .\nAbout Comparably\n\nComparably (a ZoomInfo company) is a leading platform for workplace culture insights and compensation data, empowering employees and job seekers to make more informed career decisions. With 20 million anonymous employee ratings across nearly 20 core culture metrics, covering 70,000 companies, Comparably provides one of the most comprehensive datasets on workplace culture, salaries, and leadership. Insights can be segmented by gender, ethnicity, age, experience, industry, department, location, and education, offering a deep and nuanced view of organizations of all sizes. Trusted by employers and job seekers alike, Comparably is the go-to resource for employer branding and workplace culture. For more information, visit www.comparably.com .\n\nStory Continues\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251217159518/en/\nContacts\nMedia:\nHolly Hamel\nComparably Awards Manager\nPhone: 206-850-2168\nEmail: holly.hamel@zoominfo.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:17:58",
      "Source": "Reuters",
      "Title": "Exclusive-How China built its ‘Manhattan Project’ to rival the West in AI chips",
      "URL": "https://finance.yahoo.com/news/exclusive-china-built-manhattan-project-141758929.html",
      "Content": "Exclusive-How China built its ‘Manhattan Project’ to rival the West in AI chips\n\nFanny Potkin\nWed, December 17, 2025 at 6:17 AM PST 11 min read\n\nIn this article: ASML\n\nINTC\n\nSSNLF\n\nNVDA\n\nAMD\n\nBy Fanny Potkin\nSINGAPORE Dec 17 - In a high-security Shenzhen laboratory, Chinese scientists have built what Washington has spent years trying to prevent: a prototype of a machine capable of producing the cutting-edge semiconductor chips that power artificial intelligence , smartphones and weapons central to Western military dominance, Reuters has learned.\n\nCompleted in early 2025 and now undergoing testing, the prototype fills nearly an entire factory floor. It was built by a team of former engineers from Dutch semiconductor giant ASML who reverse-engineered the company's extreme ultraviolet lithography machines or EUVs, according to two people with knowledge of the project.\nEUV machines sit at the heart of a technological Cold War. They use beams of extreme ultraviolet light to etch circuits thousands of times thinner than a human hair onto silicon wafers, currently a capability monopolized by the West. ​The smaller the circuits, the more powerful the chips.\nChina's machine is operational and successfully generating extreme ultraviolet light, but has not yet produced working chips, the people said.\n\nIn April, ASML CEO Christophe Fouquet said that China would need \"many, many years\" to develop such technology. But the existence of this prototype, reported by Reuters for the first time, suggests China may be years closer to achieving semiconductor independence than analysts anticipated.\nNevertheless, China still faces ‌major technical challenges, particularly in replicating the precision optical systems that Western suppliers produce.\nThe availability of parts from older ASML machines on secondary markets has allowed China to build a domestic prototype, with the government setting a goal of producing working chips on the prototype by 2028, according to the two people.\nBut those close to the project say a more realistic target is 2030, which is still years earlier than the decade that analysts believed it would take China to match the West on chips.\n\nChinese authorities did not respond to requests for comment.\nThe breakthrough marks the culmination of a six-year government ‌initiative to achieve semiconductor self-sufficiency, one of President Xi Jinping's highest priorities. While China's semiconductor goals have been public, the Shenzhen EUV project has been conducted in secret, according to the people.\nThe project falls under the country's semiconductor strategy, which state media has identified as being run by Xi Jinping confidant Ding Xuexiang, who heads the Communist Party's Central Science and Technology Commission.\n\nStory Continues\nChinese electronics giant Huawei plays a key role coordinating a web of companies and state research institutes across the country involving thousands of engineers, according to the two people and a third source.\nThe people described it as China's version of the Manhattan Project, the U.S. wartime effort to develop the atomic bomb.\n\n“The aim is for China to eventually be able to make advanced chips on machines that are entirely China-made,” one of the people said. \"China wants the United States 100% kicked out of its supply chains.\"\nHuawei, the State Council of China, the Chinese Embassy in Washington, and China's Ministry of Industry and Information Technology did not respond to requests for comment.\nUntil now, only one company has mastered EUV technology: ASML, headquartered in Veldhoven, Netherlands. Its machines, which cost around $250 million, are indispensable for manufacturing the most advanced chips designed by companies like Nvidia and AMD—and produced by chipmakers such as TSMC, Intel, and Samsung.\nASML built its first working prototype of EUV technology in 2001, and told Reuters it took nearly two decades and billions of euros in R&D spending before it produced its first commercially-available chips in 2019.\n\n“It makes sense that companies would want to replicate our technology, but doing so is no small ⁠feat,” ASML told Reuters in a statement.\nASML's EUV systems are currently available to U.S. allies including Taiwan, South Korea, and Japan.\nStarting in 2018, the United States began pressuring ‌the Netherlands to block ASML from selling EUV systems to China. The restrictions expanded in 2022, when the Biden administration imposed sweeping export controls designed to cut off China's access to advanced semiconductor technology.\nThe controls targeted not just EUV systems but also older deep ultraviolet (DUV) lithography machines that produce less-advanced chips like Huawei’s, aiming to keep China at least a generation behind in chipmaking capabilities.\n\nThe U.S. State Department said the Trump Administration has strengthened enforcement of export controls on advanced semiconductor manufacturing equipment and is working with partners \"to close loopholes as technology advances.”\nThe Dutch Ministry of Defence said the Netherlands is developing policies requiring “knowledge institutions” to perform personnel screenings to prevent access to sensitive technology “by individuals that have ill intentions or who are at risk of being pressured.”\nExport restrictions ‍have slowed China's progress toward semiconductor self-sufficiency for years, and constrained advanced chip production at Huawei, the two people and a third person said.\nThe sources spoke on condition they not be identified due to the confidentiality of the project.\n\nCHINA'S MANHATTAN PROJECT\nOne veteran Chinese engineer from ASML recruited to the project was surprised to find that his generous signing bonus came with an identification card issued under a false name, according to one of the people, who was familiar with his recruitment.\nOnce inside, he recognized other former ASML colleagues who were also working under aliases and was instructed to use their fake names at work to maintain secrecy, the person said. Another person independently confirmed that recruits were given fake IDs to conceal their identities from other workers inside the secure facility.\nThe guidance was clear, the two people said: Classified under national security, no one outside the compound could know what they were building—or that they were there at all.\n\nThe team includes recently retired, Chinese-born former ASML engineers and scientists—prime recruitment targets because they possess sensitive technical knowledge but face fewer professional constraints after leaving the company, ​the people said.\nTwo current ASML employees of Chinese nationality in the Netherlands told Reuters they have been approached by recruiters from Huawei since at least 2020.\nHuawei did not respond to requests for comment.\nEuropean privacy laws limit ASML's ability to track former employees. Though employees sign non-disclosure agreements, enforcing them across borders has proven difficult.\nASML won an $845 million judgment in 2019 against a former Chinese engineer accused of stealing trade secrets, but the defendant filed for bankruptcy and continues to ‌operate in Beijing with Chinese government support, according to court documents.\n\nASML told Reuters that it “vigilantly guards” trade secrets and confidential information.\n\"While ASML cannot control or restrict where former employees work, all employees are bound by the confidentiality clauses in their contracts,\" the company said, and it has \"successfully pursued legal action in response to the theft of trade secrets.”\nReuters was unable to determine if any legal actions have been taken against former ASML employees involved in China’s lithography program.\nThe company said it safeguards EUV knowledge by ensuring only select employees can access the information even inside the company.\nDutch intelligence warned in an April report that China \"used extensive espionage programmes in its attempts to obtain advanced technology and knowledge from Western countries,\" including recruiting \"Western scientists and employees of high-tech companies.”\n\nThe ASML veterans made the breakthrough in Shenzhen possible, the people said. Without their intimate knowledge of the technology, reverse-engineering the machines would have been nearly impossible.\nTheir recruitment was part of an aggressive drive China launched in 2019 for semiconductor experts working abroad, offering signing bonuses that started at 3 million to 5 million yuan ($420,000 to $700,000) and home-purchase subsidies, according to a Reuters review of government policy documents.\nRecruits included Lin Nan, ASML's former head of light source technology, whose team at the Chinese Academy of Sciences' Shanghai Institute of Optics has filed eight patents on EUV light sources in 18 months, according to patent filings.\nThe Shanghai Institute of Optics and Fine Mechanics did not respond to requests for comment. Lin could not be reached for comment.\n\nTwo additional people familiar with China’s recruitment efforts said some naturalized citizens of other countries were given Chinese passports and allowed to maintain dual citizenship.\nChina officially prohibits dual citizenship and did not answer questions on issuing passports.\nChinese authorities did not respond to requests for comment.\nINSIDE CHINA'S EUV FAB\nASML's most advanced EUV systems are roughly the size of a school bus, and weigh 180 tons. After failed attempts to replicate its size, the prototype inside the Shenzhen lab became many times larger to improve its ⁠power, according to the two people.\nThe Chinese prototype is crude compared to ASML's machines but operational enough for testing, the people said.\nChina's prototype lags behind ASML's machines largely because researchers have struggled to obtain optical systems like those from Germany's Carl Zeiss AG, one of ASML's ​key suppliers, the two people said.\n\nZeiss declined to comment.\nThe machines fire lasers at molten tin 50,000 times per second, generating plasma at 200,000 degrees Celsius. The light is focused using mirrors that take months to produce, according to Zeiss' website.\nChina's top research institutes have played key roles in developing homegrown ​alternatives, according to the two people.\nThe Changchun Institute of Optics, Fine Mechanics and Physics at the Chinese Academy of Sciences (CIOMP) achieved a breakthrough in integrating extreme-ultraviolet light into the prototype's optical system, enabling it to become operational in early 2025, one of the people said, though the optics still require significant refinement.\nCIOMP did not respond to requests for comment.\nIn a March online recruitment call on its website, the institute said it was offering \"uncapped\" salaries to PhD lithography researchers and research grants worth up to 4 million yuan ($560,000) plus 1 million yuan ($140,000) in personal subsidies.\n\nJeff Koch, an analyst at research firm SemiAnalysis and a former ASML engineer, said China will have achieved \"meaningful progress” if the “light source has enough power, is reliable, and doesn’t generate too much contamination.”\n\"No doubt this is technically feasible, it's ‍just a question of timeline,\" he said. \"China has the advantage that commercial EUV now exists, so they aren't starting from zero.\"\nTo ⁠get the required parts, China is salvaging components from older ASML machines and sourcing parts from ASML suppliers through secondhand markets, the two people said.\nNetworks of intermediary companies are sometimes used to mask the ultimate buyer, the people said.\nExport-restricted components from Japan’s Nikon and Canon are being used for the prototype, one of the people and an additional source said.\n\nNikon declined to comment. Canon said it was not aware of such reports. The Japanese Embassy in Washington did not respond to a request for comment.\nInternational banks regularly auction older semiconductor fabrication equipment, the sources said. Auctions in China sold older ASML lithography equipment as recently as October 2025, according to a review of listings on Alibaba Auction, an Alibaba-owned platform.\nA team of around 100 recent university graduates is focused on reverse-engineering components from both EUV and DUV lithography machines, according to the people.\nEach worker's desk is filmed by an individual camera ⁠to document their efforts to disassemble and reassemble parts—work the people described as key to China's lithography efforts.\n\nStaffers who successfully reassemble a component receive bonuses, the people said.\nHUAWEI SCIENTISTS SLEEP ON-SITE\nWhile the EUV project is run by the Chinese government, Huawei is involved in every step of the supply chain from chip design and fabrication equipment to manufacturing and final integration into products like smartphones, according to four people familiar with Huawei’s operations.\nCEO Ren Zhengfei briefs senior Chinese leaders on progress, according to one of the people.\nThe U.S. placed Huawei on an entity list in 2019, banning American companies from ‌doing business with them without a license.\nHuawei has deployed employees to offices, fabrication plants, and research centers across the country for the effort. Employees assigned to semiconductor teams often sleep on-site and are barred from returning home during the work week, with phone access restricted for teams handling more sensitive tasks, according to the people.\nInside Huawei, few employees know the scope of this work. \"The teams are kept isolated from ‌each other to protect the confidentiality of the project,\" one of the people said. “They don't know what the other teams work on.”\n(Reporting by Fanny Potkin in Singapore, additional reporting by Alexandra Alper in Washington, editing by Ken Li and Michael Learmonth)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "21:37:00",
      "Source": "Barrons.com",
      "Title": "Amazon in Talks Over $10 Billion OpenAI Move: Report. That’s Bad for Nvidia, Broadcom.",
      "URL": "https://finance.yahoo.com/m/b42fe308-59b5-32c1-bf2a-65c9908a7a1f/amazon-in-talks-over-%2410.html",
      "Content": "Amazon in Talks Over $10 Billion OpenAI Move: Report. That’s Bad for Nvidia, Broadcom.\n\nAdam Clark\nWed, December 17, 2025 at 5:37 AM PST 2 min read\n\nIn this article: AMZN\n\nMRVL\n\nNVDA\n\nAVGO\n\nOPAI.PVT\n\nAmazon’s investment would be tied to an agreement for OpenAI to use the e-commerce company’s in-house Trainium chips, according to a report.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 10
}