{
  "stock_id": "QCOM",
  "last_updated": "2025-12-17T14:23:37.815Z",
  "source": "Yahoo Finance Only",
  "news": [
    {
      "Date": "2025-12-17",
      "Time": "21:16:00",
      "Source": "Yahoo Finance",
      "Title": "Form 8.3 - Qualcomm Incorporated",
      "URL": "https://finance.yahoo.com/news/form-8-3-qualcomm-incorporated-131600565.html?.tsrc=rss",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nForm 8.3 - Qualcomm Incorporated\n\nSculptor Capital LP\nWed, December 17, 2025 at 5:16 AM PST 3 min read\n\nIn this article: QCOM\n\nFORM 8.3\nPUBLIC OPENING POSITION DISCLOSURE/DEALING DISCLOSURE BY\nA PERSON WITH INTERESTS IN RELEVANT SECURITIES REPRESENTING 1% OR MORE\nRule 8.3 of the Takeover Code (the “Code”)\n1. KEY INFORMATION\n(a) Full name of discloser:\nSculptor Capital LP and\nSculptor Capital Management Europe Limited\n(b) Owner or controller of interests and short positions disclosed, if different from 1(a):\nThe naming of nominee or vehicle companies is insufficient. For a trust, the trustee(s), settlor and beneficiaries must be named.\n(c) Name of offeror/offeree in relation to whose relevant securities this form relates:\nUse a separate form for each offeror/offeree\nQualcomm Incorporated\n(d) If an exempt fund manager connected with an offeror/offeree, state this and specify identity of offeror/offeree:\n(e) Date position held/dealing undertaken:\nFor an opening position disclosure, state the latest practicable date prior to the disclosure\n16 December 2025\n(f) In addition to the company in 1(c) above, is the discloser making disclosures in respect of any other party to the offer?\nIf it is a cash offer or possible cash offer, state “N/A”\nYes, Alphawave IP Group plc\n\n2. POSITIONS OF THE PERSON MAKING THE DISCLOSURE\nIf there are positions or rights to subscribe to disclose in more than one class of relevant securities of the offeror or offeree named in 1(c), copy table 2(a) or (b) (as appropriate) for each additional class of relevant security.\n(a) Interests and short positions in the relevant securities of the offeror or offeree to which the disclosure relates following the dealing (if any)\nClass of relevant security:\n\n1p ordinary (US7475251036)\n\nInterests\nShort positions\nNumber\n%\nNumber\n%\n(1) Relevant securities owned and/or controlled:\n(2) Cash-settled derivatives:\n\n68,500\n0.01\n(3) Stock-settled derivatives (including options) and agreements to purchase/sell:\n\nTOTAL:\n68,500\n0.01\n\nAll interests and all short positions should be disclosed.\nDetails of any open stock-settled derivative positions (including traded options), or agreements to purchase or sell relevant securities, should be given on a Supplemental Form 8 (Open Positions).\n(b) Rights to subscribe for new securities (including directors’ and other employee options)\nClass of relevant security in relation to which subscription right exists:\nDetails, including nature of the rights concerned and relevant percentages:\n\n3. DEALINGS (IF ANY) BY THE PERSON MAKING THE DISCLOSURE\nWhere there have been dealings in more than one class of relevant securities of the offeror or offeree named in 1(c), copy table 3(a), (b), (c) or (d) (as appropriate) for each additional class of relevant security dealt in.\n\nStory Continues\nThe currency of all prices and other monetary amounts should be stated.\n(a) Purchases and sales\nClass of relevant security\nPurchase/sale\n\nNumber of securities\nPrice per unit\n\n(b) Cash-settled derivative transactions\nClass of relevant security\nProduct description\ne.g. CFD\nNature of dealing\ne.g. opening/closing a long/short position, increasing/reducing a long/short position\nNumber of reference securities\nPrice per unit\n1p ordinary (US7475251036)\nCFD\nIncreasing a short position\n9,260\nUSD176.87\n1p ordinary (US7475251036)\nCFD\nIncreasing a short position\n22,160\nUSD176.76\n\n(c) Stock-settled derivative transactions (including options)\n(i) Writing, selling, purchasing or varying\nClass of relevant security\nProduct description e.g. call option\nWriting, purchasing, selling, varying etc.\nNumber of securities to which option relates\nExercise price per unit\nType\ne.g. American, European etc.\nExpiry date\nOption money paid/ received per unit\n\n(ii) Exercise\nClass of relevant security\nProduct description\ne.g. call option\nExercising/ exercised against\nNumber of securities\nExercise price per unit\n\n(d) Other dealings (including subscribing for new securities)\nClass of relevant security\nNature of dealing\ne.g. subscription, conversion\nDetails\nPrice per unit (if applicable)\n\n4. OTHER INFORMATION\n(a) Indemnity and other dealing arrangements\nDetails of any indemnity or option arrangement, or any agreement or understanding, formal or informal, relating to relevant securities which may be an inducement to deal or refrain from dealing entered into by the person making the disclosure and any party to the offer or any person acting in concert with a party to the offer:\nIrrevocable commitments and letters of intent should not be included. If there are no such agreements, arrangements or understandings, state “none”\n\n(b) Agreements, arrangements or understandings relating to options or derivatives\nDetails of any agreement, arrangement or understanding, formal or informal, between the person making the disclosure and any other person relating to:\n(i) the voting rights of any relevant securities under any option; or\n(ii) the voting rights or future acquisition or disposal of any relevant securities to which any derivative is referenced:\nIf there are no such agreements, arrangements or understandings, state “none”\n\n(c) Attachments\nIs a Supplemental Form 8 (Open Positions) attached?\nNO\n\nDate of disclosure:\n17 December 2025\nContact name:\nSculptor UK Compliance uk_compliance@sculptor.com\nTelephone number*:\n020 7758 4478\n\nPublic disclosures under Rule 8 of the Code must be made to a Regulatory Information Service.\nThe Panel’s Market Surveillance Unit is available for consultation in relation to the Code’s disclosure requirements on +44 (0)20 7638 0129.\n*If the discloser is a natural person, a telephone number does not need to be included, provided contact information has been provided to the Panel’s Market Surveillance Unit.\nThe Code can be viewed on the Panel’s website at www.thetakeoverpanel.org.uk .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "12:32:24",
      "Source": "Yahoo Finance",
      "Title": "2 S&P 500 Stocks with Promising Prospects and 1 We Ignore",
      "URL": "https://finance.yahoo.com/news/2-p-500-stocks-promising-043224401.html?.tsrc=rss",
      "Content": "2 S&P 500 Stocks with Promising Prospects and 1 We Ignore\n\nAnthony Lee\nTue, December 16, 2025 at 8:32 PM PST 4 min read\n\nIn this article: ^GSPC\n\nBX\n\nQCOM\n\nHPQ\n\nThe S&P 500 (^GSPC) is home to the biggest and most well-known companies in the market, making it a go-to index for investors seeking stability. But not all large-cap stocks are created equal - some are struggling with slowing growth, declining margins, or increased competition.\nSome large-cap stocks are past their peak, and StockStory is here to help you separate the winners from the laggards. That said, here are two S&P 500 stocks positioned to outperform and one best left off your watchlist.\n\nOne Stock to Sell: HP (HPQ) Market Cap: $22.79 billion\nBorn from the legendary Silicon Valley garage startup founded by Bill Hewlett and Dave Packard in 1939, HP (NYSE:HPQ) designs and sells personal computers, printers, and related technology products and services to consumers, businesses, and enterprises worldwide.\nWhy Should You Dump HPQ?\n\nFlat sales over the last five years suggest it must find different ways to grow during this cycle\nIncremental sales over the last two years were much less profitable as its earnings per share fell by 2.8% annually while its revenue grew\n4.1 percentage point decline in its free cash flow margin over the last five years reflects the company’s increased investments to defend its market position\nHP’s stock price of $24.78 implies a valuation ratio of 8x forward P/E. Dive into our free research report to see why there are better opportunities than HPQ .\nTwo Stocks to Watch: Qualcomm (QCOM) Market Cap: $187.6 billion\nHaving been at the forefront of developing the standards for cellular connectivity for over four decades, Qualcomm (NASDAQ:QCOM) is a leading innovator and a fabless manufacturer of wireless technology chips used in smartphones, autos and internet of things appliances.\nWhy Could QCOM Be a Winner?\n\nAnnual revenue growth of 15.3% over the past five years was outstanding, reflecting market share gains this cycle\nQCOM is a free cash flow machine with the flexibility to invest in growth initiatives or return capital to shareholders, and its recently improved profitability means it has even more resources to invest or distribute\nIndustry-leading 47% return on capital demonstrates management’s skill in finding high-return investments\nQualcomm is trading at $175.55 per share, or 14.9x forward P/E. Is now the right time to buy? Find out in our full research report, it’s free for active Edge members .\nBlackstone (BX) Market Cap: $119 billion\nWith over $1 trillion in assets under management and investments spanning real estate, private equity, credit, and hedge funds, Blackstone (NYSE:BX) is a global alternative asset manager that invests capital on behalf of pension funds, sovereign wealth funds, and other institutional investors.\n\nStory Continues\nWhy Are We Backing BX?\nAnnual revenue growth of 19.2% over the last five years was superb and indicates its market share increased during this cycle\nFee-related earnings improved by 22.7% annually over the last five years as it eliminated redundant costs\nEarnings per share grew by 19.7% annually over the last five years and easily exceeded the peer group average\n\nAt $152.51 per share, Blackstone trades at 24.6x forward P/E. Is now a good time to buy? See for yourself in our in-depth research report, it’s free for active Edge members .\nStocks We Like Even More If your portfolio success hinges on just 4 stocks, your wealth is built on fragile ground. You have a small window to secure high-quality assets before the market widens and these prices disappear.\nDon’t wait for the next volatility shock. Check out our Top 6 Stocks for this week . This is a curated list of our High Quality stocks that have generated a market-beating return of 244% over the last five years (as of June 30, 2025).\nStocks that made our list in 2020 include now familiar names such as Nvidia (+1,326% between June 2020 and June 2025) as well as under-the-radar businesses like the once-small-cap company Comfort Systems (+782% five-year return). Find your next big winner with StockStory today for free . Find your next big winner with StockStory today . Find your next big winner with StockStory today .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "01:39:00",
      "Source": "Yahoo Finance",
      "Title": "ARM Stock Declines 13% in a Year: Should You Buy the Dip?",
      "URL": "https://finance.yahoo.com/news/arm-stock-declines-13-buy-173900053.html?.tsrc=rss",
      "Content": "ARM Stock Declines 13% in a Year: Should You Buy the Dip?\n\nShuvra Shankar Dey\nTue, December 16, 2025 at 9:39 AM PST 3 min read\n\nIn this article: ARM\n\nShares of Arm Holdings plc ARM have declined 13% over the past year against the industry’s 36% growth. The decline raises a key question: will the fall continue, or is a rebound imminent? Let’s unpack the factors that you must look through before making an investment decision.\nImage Source: Zacks Investment Research\nARM’s Dual-Sided Network Effect Reinforces Its Leadership ARM’s competitive edge rests on a powerful dual-sided network effect that links software creators and hardware makers in a self-reinforcing loop.\nThe company’s architecture has become the default choice for device manufacturers because it already supports a massive universe of applications across Android, iOS, Windows and Linux ecosystems. This existing software breadth gives hardware producers confidence that chips based on ARM’s designs will integrate smoothly with global tools, platforms and services, making adoption a low-risk, high-benefit decision.\n\nOn the other side, developers are drawn to ARM because their applications immediately gain reach across an enormous installed base of devices. Every new hardware partner expands ARM’s footprint further, strengthening the incentive for developers to keep building for the platform. This creates a flywheel effect: more developers attract more manufacturers, which then bring in even more developers. Over time, this reinforcing cycle has grown into a deep moat that competitors struggle to penetrate.\nThis network-driven advantage has led to an extraordinary outcome. ARM effectively controls mobile CPU architecture. With its IP embedded in nearly every smartphone worldwide, the company operates from a position of unmatched scale, making its lead in mobile computing extremely difficult for rivals to challenge.\n\nNVIDIA NVDA competes with ARM in edge computing and AI-driven device workloads. NVIDIA benefits from its own ecosystem, but lacks ARM’s mobile reach. Even where NVIDIA pushes into low-power processors, the breadth of ARM compatibility limits its ability to displace existing standards.\nQualcomm QCOM remains one of ARM’s most essential partners, yet also a peer, because Qualcomm builds mobile chips around ARM cores. The company depends heavily on ARM’s architecture, and its success in smartphones reinforces ARM’s position. Yet Qualcomm continues investing in custom designs to diversify, although ARM’s scale still keeps Qualcomm aligned with the platform.\n\nStory Continues\nStrong Earnings and Revenue Growth Ahead for ARM The Zacks Consensus Estimate for ARM’s fiscal 2026 earnings is pegged at $1.72, indicating 5.5% growth from the year-ago level. Earnings for fiscal 2027 are expected to increase 28.2% from the prior-year actuals.\nThe company’s sales are expected to rise 23.5% and 21.6% year over year, respectively, in fiscal 2026 and 2027.\nImage Source: Zacks Investment Research\nARM's Valuation Remains Significantly Elevated ARM stock is currently expensive. It is priced at around 60 times forward 12-month earnings per share, significantly higher than the industry’s average of 37 times. When looking at the trailing 12-month EV-to-EBITDA ratio, ARM is trading at around 100 times, far exceeding the industry’s average of 25 times.\n\nHold Recommendation Despite the recent decline, ARM’s shares still reflect elevated expectations due to the company’s dominant market position and long-term growth narrative. The pullback improves risk-reward but does not yet fully offset valuation concerns, especially in a volatile market environment. ARM’s strong ecosystem, recurring royalty model and exposure to AI-driven demand support the long-term story, but near-term upside may remain capped. Investors already holding the stock can stay patient, while new investors may prefer a wait-and-watch approach, looking for clearer signs of sustained earnings acceleration or a more attractive entry point.\n\nARM currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nARM Holdings PLC Sponsored ADR (ARM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "00:31:00",
      "Source": "Yahoo Finance",
      "Title": "Can Intel's AI Focus Restore Its Competitive Edge & Boost Shares?",
      "URL": "https://finance.yahoo.com/news/intels-ai-focus-restore-competitive-163100510.html?.tsrc=rss",
      "Content": "Can Intel's AI Focus Restore Its Competitive Edge & Boost Shares?\n\nZacks Equity Research\nTue, December 16, 2025 at 8:31 AM PST 3 min read\n\nIn this article: INTC\n\nSANS.PVT\n\nPer a Bloomberg news report , Intel Corporation ( INTC ) is in advanced talks to acquire AI start-up SambaNova Systems for about $1.6 billion. SambaNova is known for designing custom AI chips and systems. Acquiring an AI-focused company facilitates Intel with a ready-made AI architecture, software stacks and engineering talent, minimizing years of internal development time and speeding up its AI development plans.\n\nIf the deal materializes, it will help Intel to modernize its CPUs with AI chips and software, providing cloud and enterprise customers with a complete AI system. By using AI chip technology, Intel can make chips in its own factories, increasing its manufacturing strength and allowing it to attract more foundry customers.\nIntel has launched new AI-powered chips that are faster and more energy-efficient, helping the company compete better in the growing AI market. It is gaining traction in AI infrastructure as Super Micro Computer has chosen Intel’s Xeon 6 processors for its high-performance enterprise servers.\nThe company has collaborated with Cisco to build a new integrated platform that supports distributed AI workloads. NVIDIA will invest $5 billion in Intel to build advanced technologies that will shape the future of AI infrastructure. Intel is actively investing in AI and is serious about competing in the fast-growing semiconductor market, signaling a credible comeback.\n\nHow Are Competitors Faring? Intel faces competition from Advanced Micro Devices ( AMD ) and Qualcomm Incorporated ( QCOM ). Qualcomm focuses on making advanced chips for AI-powered PCs. Qualcomm launched the AI 200 and AI 250 chips to meet rising AI processing needs in data centers. HUMAIN has chosen Qualcomm’s AI200 and AI250 chips to provide high-performance AI services in Saudi Arabia and worldwide.\n\nAMD is growing its AI business by launching new MI350 series accelerators and working with major partners like Amazon, Microsoft, Meta and Oracle to deliver faster and more powerful AI systems. AMD has entered into a long-term deal with OpenAI to power large AI systems using AMD’s Instinct GPUs starting in 2026. IBM and AMD are working with Zyphra to provide powerful AI infrastructure on IBM Cloud using AMD Instinct MI300X GPUs to train advanced AI models.\nINTC’s Price Performance, Valuation and Estimates Intel has rallied 79.3% over the past year compared with the industry ’s growth of 31.1%.\n\nImage Source: Zacks Investment Research\nGoing by the price/book ratio, the company's shares currently trade at 1.53 book value, lower than 30.63 of the industry average.\n\nStory Continues\n\nImage Source: Zacks Investment Research\nEarnings estimates for 2025 have increased 128.6% to 32 cents, while those for 2026 have declined 10.7% to 59 cents over the past 60 days.\n\nImage Source: Zacks Investment Research\nIntel stock currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "23:25:00",
      "Source": "Yahoo Finance",
      "Title": "Form 8.3",
      "URL": "https://finance.yahoo.com/news/form-8-3-152500395.html?.tsrc=rss",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nForm 8.3\n\nBusiness Wire\nTue, December 16, 2025 at 7:25 AM PST 5 min read\n\nIn this article: QCOM\n\nBOSTON, December 16, 2025 --( BUSINESS WIRE )--\nFORM 8.3\nPUBLIC OPENING POSITION DISCLOSURE/DEALING DISCLOSURE BY\nA PERSON WITH INTERESTS IN RELEVANT SECURITIES REPRESENTING 1% OR MORE\nRule 8.3 of the Takeover Code (the \"Code\")\n1. KEY INFORMATION\n(a) Full name of discloser:\nWeiss Asset Management LP (Investment Manager of Brookdale International Partners, L.P. and Brookdale Global Opportunity Fund)\n(b) Owner or controller of interests and short positions disclosed, if different from 1(a):\nThe naming of nominee or vehicle companies is insufficient. For a trust, the trustee(s), settlor and beneficiaries must be named.\nN/A\n(c) Name of offeror/offeree in relation to whose relevant securities this form relates:\nUse a separate form for each offeror/offeree\nAqua Acquisition Sub LLC (an indirect wholly-owned subsidiary of Qualcomm Incorporated)\n(d) If an exempt fund manager connected with an offeror/offeree, state this and specify identity of offeror/offeree:\nN/A\n(e) Date position held/dealing undertaken:\nFor an opening position disclosure, state the latest practicable date prior to the disclosure\n15 December 2025\n(f) In addition to the company in 1(c) above, is the discloser making disclosures in respect of any other party to the offer?\nIf it is a cash offer or possible cash offer, state \"N/A\"\nAlphawave IP Group plc –\n1p ordinary, ISIN GB00BNDRMJ14\n\n2. POSITIONS OF THE PERSON MAKING THE DISCLOSURE\nIf there are positions or rights to subscribe to disclose in more than one class of relevant securities of the offeror or offeree named in 1(c), copy table 2(a) or (b) (as appropriate) for each additional class of relevant security.\n(a) Interests and short positions in the relevant securities of the offeror or offeree to which the disclosure relates following the dealing (if any)\nClass of relevant security:\nUSD 0.0001 common – 1,065,316,212\n(ISIN: US7475251036)\nInterests\nShort Positions\nNumber\n%\nNumber\n%\n(1) Relevant securities owned and/or controlled:\n287,619\n0.03\n(2) Cash-settled derivatives:\n(3) Stock-settled derivatives (including options) and agreements to purchase/sell:\nTOTAL:\n287,619\n0.03\n\nAll interests and all short positions should be disclosed.\nDetails of any open stock-settled derivative positions (including traded options), or agreements to purchase or sell relevant securities, should be given on a Supplemental Form 8 (Open Positions).\n(b) Rights to subscribe for new securities (including directors’ and other employee options)\nClass of relevant security in relation to which subscription right exists:\nN/A\nDetails, including nature of the rights concerned and relevant percentages:\nN/A\n\n3. DEALINGS (IF ANY) BY THE PERSON MAKING THE DISCLOSURE\nWhere there have been dealings in more than one class of relevant securities of the offeror or offeree named in 1(c), copy table 3(a), (b), (c) or (d) (as appropriate) for each additional class of relevant security dealt in.\n\nStory Continues\nThe currency of all prices and other monetary amounts should be stated.\n(a) Purchases and sales\nClass of relevant security\nPurchase/Sale\nNumber of securities\nPrice per unit\nUSD 0.0001 common\nSale\n15,675\nUSD 179.1496\nUSD 0.0001 common\nSale\n6,937\nUSD 179.6719\nUSD 0.0001 common\nSale\n4,155\nUSD 179.6719\n\n(b) Cash-settled derivative transactions\nClass of relevant security\nProduct description e.g. CFD\nNature of dealing e.g. Opening/Closing a long/short position, increasing/reducing a long/short position\nNumber of reference securities\nPrice per unit\nN/A\nN/A\nN/A\nN/A\nN/A\n\n(c) Stock-settled derivative transactions (including options)\n(i) Writing, selling, purchasing or varying\nClass of relevant security\nProduct description e.g. call option\nWriting, purchasing, selling, varying etc.\nNumber of securities to which option relates\nExercise price per unit\nType\ne.g. American, European etc.\nExpiry date\nOption money paid/ received per unit\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\n\n(ii) Exercise\nClass of relevant security\nProduct description\ne.g. call option\nExercising/ exercised against\nNumber of securities\nExercise price per unit\nN/A\nN/A\nN/A\nN/A\nN/A\n\n(d) Other dealings (including subscribing for new securities)\nClass of relevant security\nNature of dealing\ne.g. subscription, conversion\nDetails\nPrice per unit (if applicable)\nN/A\nN/A\nN/A\nN/A\n\n4. OTHER INFORMATION\n(a) Indemnity and other dealing arrangements\nDetails of any indemnity or option arrangement, or any agreement or understanding, formal or informal, relating to relevant securities which may be an inducement to deal or refrain from dealing entered into by the person making the disclosure and any party to the offer or any person acting in concert with a party to the offer:\nIrrevocable commitments and letters of intent should not be included. If there are no such agreements, arrangements or understandings, state \"none\"\nNone\n\n(b) Agreements, arrangements or understandings relating to options or derivatives\nDetails of any agreement, arrangement or understanding, formal or informal, between the person making the disclosure and any other person relating to:\n(i) the voting rights of any relevant securities under any option; or\n(ii) the voting rights or future acquisition or disposal of any relevant securities to which any derivative is referenced:\nIf there are no such agreements, arrangements or understandings, state \"none\"\nNone\n\n(c) Attachments\nIs a Supplemental Form 8 (Open Positions) attached?\nNo\n\nDate of disclosure:\n16 December 2025\nContact name:\nMary Merrigan\nTelephone number:\n+1 617 778 7775\n\nPublic disclosures under Rule 8 of the Code must be made to a Regulatory Information Service.\nThe Panel’s Market Surveillance Unit is available for consultation in relation to the Code’s disclosure requirements on +44 (0)20 7638 0129.\nThe Code can be viewed on the Panel’s website at www.thetakeoverpanel.org.uk .\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251216466690/en/\nContacts\nWeiss Asset Management LP\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "22:00:05",
      "Source": "Yahoo Finance",
      "Title": "Investors Heavily Search QUALCOMM Incorporated (QCOM): Here is What You Need to Know",
      "URL": "https://finance.yahoo.com/news/investors-heavily-search-qualcomm-incorporated-140005147.html?.tsrc=rss",
      "Content": "Investors Heavily Search QUALCOMM Incorporated (QCOM): Here is What You Need to Know\n\nZacks Equity Research\nTue, December 16, 2025 at 6:00 AM PST 5 min read\n\nIn this article: QCOM\n\n^GSPC\n\nQualcomm (QCOM) has recently been on Zacks.com's list of the most searched stocks. Therefore, you might want to consider some of the key factors that could influence the stock's performance in the near future.\nShares of this chipmaker have returned +7.5% over the past month versus the Zacks S&P 500 composite's +1.3% change. The Zacks Electronics - Semiconductors industry, to which Qualcomm belongs, has gained 1.6% over this period. Now the key question is: Where could the stock be headed in the near term?\n\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nRevisions to Earnings Estimates Rather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nFor the current quarter, Qualcomm is expected to post earnings of $3.38 per share, indicating a change of -0.9% from the year-ago quarter. The Zacks Consensus Estimate has changed -0.3% over the last 30 days.\nFor the current fiscal year, the consensus earnings estimate of $12.15 points to a change of +1% from the prior year. Over the last 30 days, this estimate has changed +0.1%.\nFor the next fiscal year, the consensus earnings estimate of $12.6 indicates a change of +3.7% from what Qualcomm is expected to report a year ago. Over the past month, the estimate has changed -0.4%.\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Qualcomm is rated Zacks Rank #3 (Hold).\n\nStory Continues\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS Projected Revenue Growth While earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\n\nFor Qualcomm, the consensus sales estimate for the current quarter of $12.25 billion indicates a year-over-year change of +5%. For the current and next fiscal years, $45.69 billion and $46.14 billion estimates indicate +3.5% and +1% changes, respectively.\nLast Reported Results and Surprise History Qualcomm reported revenues of $11.27 billion in the last reported quarter, representing a year-over-year change of +10%. EPS of $3 for the same period compares with $2.69 a year ago.\nCompared to the Zacks Consensus Estimate of $10.79 billion, the reported revenues represent a surprise of +4.43%. The EPS surprise was +4.17%.\n\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates three times over this period.\nValuation Without considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects.\n\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\nThe Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an A is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nQualcomm is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\n\nConclusion The facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Qualcomm. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "02:04:56",
      "Source": "Yahoo Finance",
      "Title": "Streetwise | Is This the Dot-Com Bubble All Over Again?",
      "URL": "https://finance.yahoo.com/m/dbc91232-a585-3a86-82f7-7b8fc2e70930/streetwise-%7C-is-this-the.html?.tsrc=rss",
      "Content": "Streetwise | Is This the Dot-Com Bubble All Over Again?\n\nJames Mackintosh\nMon, December 15, 2025 at 10:04 AM PST 1 min read\n\nIn this article: CSCO\n\nQCOM\n\nBack in 1999 the internet was the first, and often the only, topic of conversation with investors. Today it’s AI. The parallels of today’s artificial-intelligence boom with the dot-com bubble go much further, but there’s also a very big difference: Stocks went up a lot more back then.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-13",
      "Time": "06:45:07",
      "Source": "Yahoo Finance",
      "Title": "Qualcomm (QCOM) Registers a Bigger Fall Than the Market: Important Facts to Note",
      "URL": "https://finance.yahoo.com/news/qualcomm-qcom-registers-bigger-fall-224507523.html?.tsrc=rss",
      "Content": "Qualcomm (QCOM) Registers a Bigger Fall Than the Market: Important Facts to Note\n\nZacks Equity Research\nFri, December 12, 2025 at 2:45 PM PST 3 min read\n\nIn this article: QCOM\n\n^GSPC\n\n^DJI\n\nIn the latest close session, Qualcomm (QCOM) was down 1.64% at $178.29. This change lagged the S&P 500's 1.07% loss on the day. On the other hand, the Dow registered a loss of 0.51%, and the technology-centric Nasdaq decreased by 1.69%.\nHeading into today, shares of the chipmaker had gained 3.88% over the past month, outpacing the Computer and Technology sector's gain of 1.6% and the S&P 500's gain of 0.94%.\n\nThe upcoming earnings release of Qualcomm will be of great interest to investors. The company is forecasted to report an EPS of $3.38, showcasing a 0.88% downward movement from the corresponding quarter of the prior year. Meanwhile, the latest consensus estimate predicts the revenue to be $12.25 billion, indicating a 4.99% increase compared to the same quarter of the previous year.\nFor the annual period, the Zacks Consensus Estimates anticipate earnings of $12.15 per share and a revenue of $45.69 billion, signifying shifts of +1% and +3.52%, respectively, from the last year.\nInvestors should also note any recent changes to analyst estimates for Qualcomm. These revisions help to show the ever-changing nature of near-term business trends. As a result, upbeat changes in estimates indicate analysts' favorable outlook on the business health and profitability.\n\nOur research demonstrates that these adjustments in estimates directly associate with imminent stock price performance. To exploit this, we've formed the Zacks Rank, a quantitative model that includes these estimate changes and presents a viable rating system.\nThe Zacks Rank system, which varies between #1 (Strong Buy) and #5 (Strong Sell), carries an impressive track record of exceeding expectations, confirmed by external audits, with stocks at #1 delivering an average annual return of +25% since 1988. Over the past month, there's been a 0.35% rise in the Zacks Consensus EPS estimate. Qualcomm is currently sporting a Zacks Rank of #3 (Hold).\nDigging into valuation, Qualcomm currently has a Forward P/E ratio of 14.92. This denotes a discount relative to the industry average Forward P/E of 37.08.\n\nOne should further note that QCOM currently holds a PEG ratio of 3.25. Comparable to the widely accepted P/E ratio, the PEG ratio also accounts for the company's projected earnings growth. Electronics - Semiconductors stocks are, on average, holding a PEG ratio of 2.04 based on yesterday's closing prices.\nThe Electronics - Semiconductors industry is part of the Computer and Technology sector. At present, this industry carries a Zacks Industry Rank of 75, placing it within the top 31% of over 250 industries.\n\nStory Continues\nThe Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nKeep in mind to rely on Zacks.com to watch all these stock-impacting metrics, and more, in the succeeding trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-13",
      "Time": "01:43:00",
      "Source": "Yahoo Finance",
      "Title": "QCOM Expands Into AI Video Intelligence Market: Will it Drive Growth?",
      "URL": "https://finance.yahoo.com/news/qcom-expands-ai-video-intelligence-174300924.html?.tsrc=rss",
      "Content": "QCOM Expands Into AI Video Intelligence Market: Will it Drive Growth?\n\nZacks Equity Research\nFri, December 12, 2025 at 9:43 AM PST 3 min read\n\nIn this article: QCOM\n\nMSI\n\nQualcomm Incorporated QCOM recently announced that it has formed a partnership with India’s leading video security company, CP PLUS. The collaboration aims to integrate advanced on-device AI and edge-processing capabilities of Qualcomm Dragonwing processors with the comprehensive product ecosystem and distribution network of CP PLUS.\n\nPer a report from Grand View Research, the AI video market size was $3.86 billion in 2024. It is projected to reach $42.29 billion in 2033 with a compound annual growth rate of 32.2%. North America currently dominates the AI video market; however, emerging markets such as India are catching up fast. With portfolio expansion and strategic collaborations with other industry leaders, Qualcomm is aiming to capitalize on this emerging market trend.\n\nAdvanced video security and edge AI provide the required scale, resilience and efficiency for the transformation of industrial and public infrastructure systems. Qualcomm boasts future-ready, intelligent video capabilities. Its edge AI enhances the security of sensitive data by reducing exposure to external networks. Its air-gapped architecture minimizes cybersecurity threats, which is critical for industrial and public infrastructure. The company will also provide the Qualcomm Insight Platform to deliver on-site video intelligence with reduced latency, minimizing server dependency. It will also provide real-time alerts and notifications with actionable insights.\n\nThe smartphone market has been a major revenue driver for Qualcomm. It is facing aggressive competition in this vertical. Several of its customers, such as Apple and Samsung, are moving to in-house chip development. It has been facing challenges from low-cost chip manufacturers like MediaTek and Rockchip as well. Amid this backdrop, Qualcomm is taking several steps to broaden its portfolio offerings and venture into emerging high-growth markets such as AI video intelligence. This bodes well for long-term growth.\n\nHow Are Competitors Faring? NVIDIA NVDA has positioned itself as a major player in AI-powered video analytics. NVIDIA GPUs expedite real-time video analytics, ensuring swift detection and tracking in surveillance systems. NVIDIA Metropolis is also set to gain market traction. The vision AI application platform facilitates the development and deployment of AI agents that can have a wide range of use cases, such as improving efficiency and safety in smart cities, manufacturing, retail and logistics.\n\nMotorola MSI remains a prominent provider of AI-enabled video intelligence solutions worldwide. The Motorola Avigilon cloud-based video and access control solutions offer innovative features such as appearance search, facial recognition, unusual activity detection and license plate recognition. Backed by such leading-edge capabilities, Motorola is gaining solid market traction across several public safety agencies worldwide. Motorola expects to record strong demand across video security and services, land mobile radio products and related software while benefiting from a solid foundation.\n\nStory Continues\nQCOM’s Price Performance, Valuation and Estimates Qualcomm shares have gained 14.1% over the past year compared with the industry’s growth of 54%.\n\nImage Source: Zacks Investment Research\nGoing by the price/earnings ratio, the company's shares currently trade at 14.81 forward earnings, lower than 41.02 for the industry.\n\nImage Source: Zacks Investment Research\nEarnings estimates for 2025 and 2026 have improved over the past 60 days.\n\nImage Source: Zacks Investment Research\nQualcomm stock currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nMotorola Solutions, Inc. (MSI) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-12",
      "Time": "19:24:00",
      "Source": "Yahoo Finance",
      "Title": "The Zacks Analyst Blog Highlights Caterpillar, Shopify, Qualcomm, Waterstone Financial and Tucows",
      "URL": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-caterpillar-112400134.html?.tsrc=rss",
      "Content": "The Zacks Analyst Blog Highlights Caterpillar, Shopify, Qualcomm, Waterstone Financial and Tucows\n\nZacks Equity Research\nFri, December 12, 2025 at 3:24 AM PST 7 min read\n\nIn this article: QCOM\n\nCAT\n\nSHOP\n\nWSBF\n\nTCX\n\nFor Immediate Release Chicago, IL &ndash; December 12, 2025 &ndash; Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Caterpillar Inc. CAT, Shopify Inc. SHOP, Qualcomm Inc. QCOM, Waterstone Financial, Inc. WSBF and Tucows Inc. TCX.\n\nHere are highlights from Thursday&rsquo;s Analyst Blog:\nTop Stock Reports for Caterpillar, Shopify and Qualcomm\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Caterpillar Inc., Shopify Inc. and Qualcomm Inc., as well as two micro-cap stocks Waterstone Financial, Inc. and Tucows Inc. The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\n\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\n\nYou can see all of today&rsquo;s research reports here >>>\n\nAhead of Wall Street\n\nThe daily 'Ahead of Wall Street' article is a must-read for all investors who would like to be ready for that day's trading action. The article comes out before the market opens, attempting to make sense of that morning's economic releases and how they will affect that day's market action. You can read this article for free on our home page and can actually sign up there to get an email notification as this article comes out each morning.\n\nYou can read today's AWS here >>> More Good News for Pre-market Trading: Jobless Claims & More\n\nToday's Featured Research Reports\n\nCaterpillar&rsquo;s shares have outperformed the Zacks Manufacturing - Construction and Mining industry over the past year (+63.5% vs. +61.3%). The company reported year-over-year growth in its third-quarter revenues after six quarters of declines. This improvement was attributed to volume growth in all of its segments.\n\nHowever, earnings declined in the quarter due to the impact of tariffs. This will continue through 2025 with the company expecting a $1.6-$1.75 billion impact for the year. The record high backlog of $39.9 billion should support its top line. Going forward, the Construction Industries segment will gain from increased construction activities in the United States and globally.\n\nResource Industries will be supported by commodity demand. The Energy & Transportation segment will gain on strong demand across all applications. Caterpillar&rsquo;s focus on aftermarket parts and service-related revenues (which generate high margins) will aid growth.\n\n(You can read the full research report on Caterpillar here >>> )\n\nShares of Shopify have gained +44.8% over the past year against the Zacks Internet - Services industry&rsquo;s gain of +62.3%. The company&rsquo;s prospects are benefiting from an expanding merchant base. New merchant-friendly tools like Shop Minis, Shop Cash, and Sign in with Shop along with Shop Pay solutions are helping SHOP win merchants regularly.\n\nShopify&rsquo;s investment in AI-driven tools, such as Catalog, Universal Cart, and Sidekick, is helping merchants improve customer engagement and streamline operations. Shopify&rsquo;s expanding international footprint with strong growth in Europe is a key catalyst. A rich partner base is helping SHOP expand its merchant base. Strong free cash flow margin reflects solid liquidity.\n\nHowever, Shopify faces gross margin pressure due to higher hosting costs, the three-month paid trial program, and the expanded PayPal partnership, which carries lower margin. Higher operating expenses are expected to hurt margins in the near term.\n\n(You can read the full research report on Shopify here >>> )\n\nQualcomm&rsquo;s shares have gained +16.9% over the past year against the Zacks Electronics - Semiconductors industry&rsquo;s gain of +79.1%. The company is foraying deeper into the realm of AI capabilities within the laptop and desktop business with the launch of the Snapdragon X chip for mid-range AI desktops and laptops. It is also benefiting from healthy fruition in the automotive business.\n\nAutomakers&rsquo; strategy of deploying high-performance, low-power computing and connectivity chips to bring next-generation experiences to consumers is driving demand for the Snapdragon Digital Chassis platform. Qualcomm Snapdragon mobile platforms are also gaining traction.\n\nHowever, a shift in the share among OEMs at the premium tier has reduced Qualcomm's near-term opportunity to sell integrated chipsets. Stiff competition in the mobile phone chipset market is also likely to hurt profits in the future. The strained bilateral Sino-US trade relationship clouds its revenue-generating potential.\n\n(You can read the full research report on Qualcommhere >>> )\n\nShares of Waterstone Financial have outperformed the Zacks Financial - Savings and Loan industry over the past year (+18.3% vs. -1.4%). This microcap company with a market capitalization of $309.89 million is seeing core earnings momentum driven by net interest margin expansion (2.76% in Q3 2025 vs. 2.14% YoY), aided by lower borrowing costs and improved funding mix.\n\nStrong capital ratios (Tier 1 leverage at 19.45%) provide financial resilience and support capital return flexibility. Credit trends improved with a net credit provision release of $0.3 million and stable non-accrual loans (0.35%). Operating efficiency rose as noninterest expenses declined, despite inflation.\n\nHowever, mortgage banking remains weak, with originations down 3.5%. CRE loan stress is rising, with collateral-dependent loans doubling and one large restructuring. Loan growth is concentrated in higher-risk real estate segments. Liquidity is solid, with $334 million in borrowing capacity. Despite mixed fundamentals, the stock is up 23% in the past six months and trades at a discount to peers on P/E and P/B.\n\n(You can read the full research report on Waterstone Financial here >>> )\n\nTucows&rsquo; shares have outperformed the Zacks Internet - Content industry over the past year (+33.9% vs. -13.7%). This microcap company with market capitalization of $235.29 million has its bull case resting on two high-margin engines. Domains is a steady cash generator &mdash; third-quarter 2025 revenues rose 5% year over year to $67.8 million and adjusted EBITDA reached $12.1 million despite a one-time wholesale customer moving in-house that reduced volumes.\n\nValue-added services and registry growth, with .IN live and about 10 million Radix domains migrating in 2026, add recurring upside ahead of the 2026 gTLD wave. Wavelo is scaling profitably, with revenues rising 18% to $11.9 million and adjusted EBITDA up 25% to $4.3 million as enterprise telecom deals expand.\n\nBear risks include Ting still being loss-making and shifting to partner networks that dilute unit economics, high leverage plus stranded corporate and Ting Mobile costs through early 2026, and continued domain volume pressure from reseller consolidation.\n\n(You can read the full research report on Tucows here >>> )\n\nStory Continues\nWhy Haven't You Looked at Zacks' Top Stocks?\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\nToday you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss . This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nCaterpillar Inc. (CAT) : Free Stock Analysis Report\nTucows Inc. (TCX) : Free Stock Analysis Report\nShopify Inc. (SHOP) : Free Stock Analysis Report\nWaterstone Financial, Inc. (WSBF) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-12",
      "Time": "08:16:23",
      "Source": "Yahoo Finance",
      "Title": "Why Analysts Think Qualcomm’s Story Is Shifting With New AI Deals And Mixed Wall Street Targets",
      "URL": "https://finance.yahoo.com/news/why-analysts-think-qualcomm-story-001623235.html?.tsrc=rss",
      "Content": "Why Analysts Think Qualcomm’s Story Is Shifting With New AI Deals And Mixed Wall Street Targets\n\nSimply Wall St\nThu, December 11, 2025 at 4:16 PM PST 5 min read\n\nIn this article: QCOM\n\nQualcomm’s latest narrative update nudges its price target higher, with fair value holding near $191.80 per share. A slightly lower discount rate and steady revenue growth expectations reflect growing confidence in its multi year AI and diversification strategy. Bulls point to premium Android momentum, auto and IoT expansion, and early AI accelerator wins as reasons for this incremental optimism. Skeptics warn that AI enthusiasm and the semiconductor cycle could still inject volatility into the story. Read on to see how you can monitor these shifting assumptions and stay updated on the evolving Qualcomm narrative.\n\nAnalyst Price Targets don't always capture the full story. Head over to our Company Report to find new ways to value QUALCOMM.\nWhat Wall Street Has Been Saying 🐂 Bullish Takeaways\nSeveral firms maintain constructive views on Qualcomm, with TD Cowen, Mizuho, and BofA all lifting price targets into the $200 to $215 range while reiterating Buy or Outperform ratings, signaling confidence that execution and growth momentum justify a premium to recent trading levels.\nTD Cowen and BofA highlight broad based strength in QCT, pointing to premium tier Android outperformance, strong share at Samsung, and double digit growth in autos and IoT as evidence that Qualcomm is executing well on diversification and product roadmap.\nBofA’s Tal Liani notes that top line upside supported a $0.12 EPS beat, and rolls estimates higher in line with guidance, underscoring analyst confidence in management’s ability to translate growth into earnings despite a competitive AI and handset backdrop.\nBernstein argues that Qualcomm may increasingly be valued as an AI play following new datacenter AI accelerator and rack scale announcements and the HUMAIN deployment agreement, suggesting some analysts see scope for a higher valuation multiple if AI traction continues.\n\n🐻 Bearish Takeaways\nNot all analysts are convinced the recent AI and accelerator news supports sustained multiple expansion, with Citi keeping a Neutral rating and Wells Fargo reiterating an Underweight and a relatively cautious $140 target. This indicates downside risk if execution or demand fall short.\nWells Fargo flags intense competition from Intel, AMD, and Nvidia in AI accelerators, implying that while Qualcomm’s HUMAIN deal could carry revenue potential in the ~$2B range, margins and long term share in this market are still uncertain relative to current enthusiasm.\nBaird trims its price target to $200 from $216 even while staying Outperform, and explicitly calls AI a wild card, signaling that some bullish analysts still see meaningful risk around how much AI upside is already reflected in Qualcomm’s valuation.\n\nStory Continues\nDo your thoughts align with the Bull or Bear Analysts? Perhaps you think there's more to the story. Head to the Simply Wall St Community to discover more perspectives or begin writing your own Narrative!\nWhat's in the News South Korea's antitrust watchdog raided Arm's Seoul offices following a Qualcomm complaint over licensing terms, heightening global regulatory focus on how Arm structures its chip IP deals.\nQualcomm and HUMAIN unveiled a large scale AI partnership in Saudi Arabia, planning to deploy 200 megawatts of AI200 and AI250 rack solutions from 2026 to power edge to cloud AI inference and support the Kingdom's ambitions as a global AI hub.\nA U.S. District Court granted Qualcomm a full win in Arm's lawsuit over Nuvia licenses, affirming a prior jury verdict and reinforcing Qualcomm's rights to roll out custom CPU cores under its own Arm architecture license.\nChina launched an antitrust probe into Qualcomm's acquisition of Autotalks after the deal closed without prior notification to Beijing, adding regulatory uncertainty around the company's push into connected vehicle technologies.\n\nHow This Changes the Fair Value For QUALCOMM Fair Value: Unchanged at approximately $191.80 per share, reflecting a steady view of intrinsic equity value.\nDiscount Rate: Fallen slightly from about 10.83% to 10.78%, implying a marginally lower required return on equity.\nRevenue Growth: Essentially unchanged at roughly 2.97%, indicating a stable outlook for long term top line expansion.\nNet Profit Margin: Stable at about 25.54%, with no material revision to long run profitability assumptions.\nFuture P/E: Edged down slightly from around 20.59x to 20.57x, signaling a modestly lower valuation multiple applied to forward earnings.\n\n🔔 Never Miss an Update: Follow The Narrative Narratives are simple, story driven investment theses that connect your view of a company to hard numbers like future revenue, earnings, margins, and fair value. On Simply Wall St’s Community page, millions of investors use Narratives to link Qualcomm’s evolving story to a financial forecast, compare Fair Value with today’s Price, and see when it may be time to buy or sell. As news, earnings, and AI updates arrive, these Narratives adjust dynamically so your investment view stays current.\n\nHead over to the Simply Wall St Community and follow the Narrative on QUALCOMM to stay on top of the latest thinking: QCOM: Premium Android Strength And Emerging AI Inference Will Drive Balanced Future Outcomes .\nTrack how diversification into AI devices, autos, and industrial IoT could lift margins while reducing reliance on any single customer or end market.\nSee the latest revenue, EPS, margin, and P/E assumptions behind a Fair Value of $191.80, and compare them with your own expectations.\nMonitor key risks, from geopolitical and regulatory pressure to handset cyclicality and AI execution, as they flow through to QUALCOMM’s forecast and valuation.\nCurious how numbers become stories that shape markets? Explore Community Narratives\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include QCOM .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-12",
      "Time": "05:28:00",
      "Source": "Yahoo Finance",
      "Title": "Top Stock Reports for Caterpillar, Shopify & Qualcomm",
      "URL": "https://finance.yahoo.com/news/top-stock-reports-caterpillar-shopify-212800937.html?.tsrc=rss",
      "Content": "Top Stock Reports for Caterpillar, Shopify & Qualcomm\n\nMark Vickery\nThu, December 11, 2025 at 1:28 PM PST 8 min read\n\nIn this article: QCOM\n\nTDG\n\nCAT\n\nSHOP\n\nWSBF\n\nThursday, December 11, 2025\n\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Caterpillar Inc. (CAT), Shopify Inc. (SHOP) and Qualcomm Inc. (QCOM), as well as two micro-cap stocks Waterstone Financial, Inc. (WSBF) and Tucows Inc. (TCX). The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\n\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\n\nYou can see all of today&rsquo;s research reports here >>>\n\nAhead of Wall Street\n\nThe daily 'Ahead of Wall Street' article is a must-read for all investors who would like to be ready for that day's trading action. The article comes out before the market opens, attempting to make sense of that morning's economic releases and how they will affect that day's market action. You can read this article for free on our home page and can actually sign up there to get an email notification as this article comes out each morning.\n\nYou can read today's AWS here >>> More Good News for Pre-market Trading: Jobless Claims & More\n\nToday's Featured Research Reports\n\nCaterpillar&rsquo;s shares have outperformed the Zacks Manufacturing - Construction and Mining industry over the past year (+63.5% vs. +61.3%). The company reported year-over-year growth in its third-quarter revenues after six quarters of declines. This improvement was attributed to volume growth in all of its segments.\n\nHowever, earnings declined in the quarter due to the impact of tariffs. This will continue through 2025 with the company expecting a $1.6-$1.75 billion impact for the year. The record high backlog of $39.9 billion should support its top line. Going forward, the Construction Industries segment will gain from increased construction activities in the United States and globally.\n\nResource Industries will be supported by commodity demand. The Energy & Transportation segment will gain on strong demand across all applications. Caterpillar&rsquo;s focus on aftermarket parts and service-related revenues (which generate high margins) will aid growth.\n\n(You can read the full research report on Caterpillar here >>> )\n\nShares of Shopify have gained +44.8% over the past year against the Zacks Internet - Services industry&rsquo;s gain of +62.3%. The company&rsquo;s prospects are benefiting from an expanding merchant base. New merchant-friendly tools like Shop Minis, Shop Cash, and Sign in with Shop along with Shop Pay solutions is helping SHOP win merchants regularly.\n\nShopify&rsquo;s investment in AI-driven tools, such as Catalog, Universal Cart, and Sidekick, are helping merchants improve customer engagement and streamline operations. Shopify&rsquo;s expanding international footprint with strong growth in Europe is a key catalyst. A rich partner base is helping SHOP expand its merchant base. Strong free cash flow margin reflects solid liquidity.\n\nHowever, Shopify faces gross margin pressure due to higher hosting costs, the three-month paid trial program, and the expanded PayPal partnership, which carries lower margins. Higher operating expenses are expected to hurt margins in the near term.\n\n(You can read the full research report on Shopify here >>> )\n\nQualcomm &rsquo;s shares have gained +16.9% over the past year against the Zacks Electronics - Semiconductors industry&rsquo;s gain of +79.1%. The company is foraying deeper into the realm of AI capabilities within the laptop and desktop business with the launch of the Snapdragon X chip for mid-range AI desktops and laptops. It is also benefiting from healthy fruition in the automotive business.\n\nAutomakers&rsquo; strategy of deploying high-performance, low-power computing and connectivity chips to bring next-generation experiences to consumers is driving demand for the Snapdragon Digital Chassis platform. Qualcomm Snapdragon mobile platforms are also gaining traction.\n\nHowever, a shift in the share among OEMs at the premium tier has reduced Qualcomm's near-term opportunity to sell integrated chipsets. Stiff competition in the mobile phone chipset market is also likely to hurt profits in the future. The strained bilateral Sino-US trade relationship clouds its revenue-generating potential.\n\n(You can read the full research report on Qualcomm here >>> )\n\nShares of Waterstone Financial have outperformed the Zacks Financial - Savings and Loan industry over the past year (+18.3% vs. -1.4%). This microcap company with a market capitalization of $309.89 million is seeing core earnings momentum driven by net interest margin expansion (2.76% in Q3 2025 vs. 2.14% YoY), aided by lower borrowing costs and improved funding mix.\n\nStrong capital ratios (Tier 1 leverage at 19.45%) provide financial resilience and support capital return flexibility. Credit trends improved with a net credit provision release of $0.3 million and stable non-accrual loans (0.35%). Operating efficiency rose as noninterest expenses declined, despite inflation.\n\nHowever, mortgage banking remains weak, with originations down 3.5%. CRE loan stress is rising, with collateral-dependent loans doubling and one large restructuring. Loan growth is concentrated in higher-risk real estate segments. Liquidity is solid, with $334 million in borrowing capacity. Despite mixed fundamentals, the stock is up 23% in the past six months and trades at a discount to peers on P/E and P/B.\n\n(You can read the full research report on Waterstone Financial here >>> )\n\nTucows&rsquo; shares have outperformed the Zacks Internet - Content industry over the past year (+33.9% vs. -13.7%). This microcap company with market capitalization of $235.29 million has its bull case resting on two high-margin engines. Domains is a steady cash generator &mdash; third-quarter 2025 revenues rose 5% year over year to $67.8 million and adjusted EBITDA reached $12.1 million despite a one-time wholesale customer moving in-house that reduced volumes.\n\nValue-added services and registry growth, with .IN live and about 10 million Radix domains migrating in 2026, add recurring upside ahead of the 2026 gTLD wave. Wavelo is scaling profitably, with revenues rising 18% to $11.9 million and adjusted EBITDA up 25% to $4.3 million as enterprise telecom deals expand.\n\nBear risks include Ting still being loss-making and shifting to partner networks that dilute unit economics, high leverage plus stranded corporate and Ting Mobile costs through early 2026, and continued domain volume pressure from reseller consolidation.\n\n(You can read the full research report on Tucows here >>> )\n\nOther noteworthy reports we are featuring today include Sanofi (SNY), TransDigm Group Inc. (TDG) and Monster Beverage Corp. (MNST).\n\nMark Vickery\nSenior Editor\n\nNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\n\nStory Continues\nToday's Must Read\nStrong Backlog and Volume Recovery Aid Caterpillar (CAT) As Tariff Ail\n\nProduct Rollouts and Growing Merchant Base Aid Shopify (SHOP)\n\nQualcomm (QCOM) Rides on AI Chips, Solid Automotive Business\n\nFeatured Reports\nDupixent to Remain Sanofi's (SNY) Key Top-Line Driver\nThe Zacks analyst expects Dupixent to remain Sanofi's key top-line driver as it enjoys strong demand. Competitive pressure on influenza vaccines and regular pipeline setbacks are key headwinds.\n\nImproving Air Traffic Aid TransDigm Group (TDG) Amid Labor Shortage\nPer the Zacks analyst, TransDigm Group is likely to benefit from the improving air traffic. Yet labor shortage result in delays and likely impact operating results.\nInorganic Growth Efforts Aid Raymond James (RJF), Costs Ail\nPer the Zacks analyst, while Raymond James' efforts to expand through acquisitions and its global diversification efforts are expected to result in higher costs, these will likely drive the top line.\nGartner (IT) Gains from Deep Domain Expertise, Liquidity Low\nPer the Zacks analysts, Gartner's domain expertise is key to providing insights and decision-support solutions for an informed decision-making process. Low liquidity remains a concern.\nLincoln (LNC) rides on Premium Growth, Elevated Expenses Hurt\nPer the Zacks analyst, Lincoln's growing premium is driven by new products and the enhancement of the existing ones, which keep driving its top line. However, escalating expenses remain a concern.\n\nPBF Energy (PBF) Benefits From Diversified Refining Footprint\nPer the Zacks analyst, PBF Energy's six well-placed U.S. refineries provide a diversified footprint that boosts flexibility and supports reliable product supply across shifting market conditions.\nSolid Codman Specialty Surgical Business Aids Integra (IART)\nThe Zacks analyst is impressed with the healthy demand for Integra's industry-leading products within the Codman Specialty Surgical. The business benefits from sustained global neurosurgery demand.\nNew Upgrades\nMonster Beverage's (MNST) Strength in Energy Drinks Seem Encouraging\nPer the Zacks analyst, Monster Beverage is experiencing continued strength in its energy drinks category, which is driving performance. Product innovation also remains a core growth driver.\n\nWestern Digital (WDC) Gains From Uptick in HDD Demand\nPer the Zacks analyst, Western Digital is gaining from strong HDD demand, adoption of 26TB CMR and 32TB UltraSMR, and advances in ePMR and HAMR tech, which are expected to drive top-line growth ahead.\nFive Below (FIVE) Gains on Higher Traffic, Strong Q3 Comps Growth\nPer the Zacks analyst, Five Below's strong Q3 comps were fueled by higher transactions, improved conversion, and increased customer traffic. The company expects fiscal 2025 comps growth of 9.4-10.1%.\nNew Downgrades\nLow Volume and Maintenance Outage Cost Hurt Packaging Corporation\nThe Zacks analyst is concerned that lower sales volumes in both of its segments due to weak customer spending as well as elevated maintenance outage expense will dent Packaging Corporation's results.\n\nHigh Costs and Macro Woes Hurt Meritage Homes' (MTH) Prospects\nPer the Zacks analyst, Meritage Homes business is being hurt by ongoing affordability concerns in the housing market. Also, increased financing incentives and higher lot costs are a concern.\nLouisiana-Pacific (LPX) Faces OSB Weakness Amid Housing Slowdown\nPer the Zacks analyst, persistent OSB pricing pressure, a sluggish housing market, and broader macro challenges continue to weigh on Louisiana-Pacific's performance.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nSanofi (SNY) : Free Stock Analysis Report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nCaterpillar Inc. (CAT) : Free Stock Analysis Report\nTransdigm Group Incorporated (TDG) : Free Stock Analysis Report\nTucows Inc. (TCX) : Free Stock Analysis Report\nMonster Beverage Corporation (MNST) : Free Stock Analysis Report\nShopify Inc. (SHOP) : Free Stock Analysis Report\nWaterstone Financial, Inc. (WSBF) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 12
}