{
  "stock_id": "QCOM",
  "last_updated": "2025-12-29T09:10:31.751Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-26",
      "Time": "23:35:00",
      "Source": "Zacks",
      "Title": "QCOM Rides on Strength in Premium Handset Market: Will it Sustain?",
      "URL": "https://finance.yahoo.com/news/qcom-rides-strength-premium-handset-153500215.html",
      "Content": "QCOM Rides on Strength in Premium Handset Market: Will it Sustain?\n\nZacks Equity Research\nFri, December 26, 2025 at 7:35 AM PST 3 min read\n\nIn this article: QCOM\n\n2454.TW\n\nAAPL\n\nSSNLF\n\nQualcomm Incorporated ( QCOM ) generated about $6.96 billion in handset revenues in the latest quarter, with a year-over-year increase of 14% and an estimated $27.8 billion in fiscal 2025, contributing roughly 63% of the total company’s revenues. Qualcomm’s strong handset revenues are driven by its increased customer demand for Snapdragon-powered premium Android smartphones.\n\nQualcomm faces strong competition from rivals like MediaTek, especially in mid-range and budget smartphones, which puts pressure on its market share and pricing. U.S.-China trade tensions have reduced companies' handset demand to a great extent. Qualcomm's handset business experienced ongoing challenges as global smartphone demand slowed down day by day. Moreover, major handset manufacturers, such as Apple and Samsung, are moving toward in-house chip development. This is a major challenge for Qualcomm.\nTo overcome challenges in the smartphone business, Qualcomm is focusing on premium Snapdragon chips to stay competitive in flagship devices. Qualcomm recently launched the Snapdragon 8 Gen 5, offering high-speed performance, advanced AI, improved graphics, and enhanced camera capabilities for flagship smartphones from global brands like iQOO , Honor, ASUS, OnePlus, and Vivo.\n\nPer a report from Precedence Research, the global 5G chipset market is expected to reach $126.4 billion by 2030 from $18.7 billion in 2022, with a CAGR of 27%, indicating strong underlying growth potential for Qualcomm’s handset segment in the near future. QCOM’s continuous innovation in powering flagship devices with cutting-edge features helps to boost its handset revenues, maintain leadership in the premium segment, and drive future revenue growth.\nOther Tech Companies Focused on Handset Chip Development Qualcomm faces competition from Apple, Inc. ( AAPL ) and Broadcom, Inc. ( AVGO ). Apple recently launched the new iPad Pro, MacBook Pro, and upgraded Vision Pro, all powered by their M5 chip. Apple’s iPhone 17 series uses the A19 chip, and the iPhone Air features the A19 Pro chip, both offering faster performance, better graphics, and advanced AI capabilities. These recent chips strengthen Apple’s position in the smartphone market and reduce its reliance on third-party suppliers.\n\nBroadcom recently launched Wi Fi 8 chips for smartphones and connected devices, improving speed, reliability, and efficiency. Broadcom, by providing essential smartphone components like Wi Fi, Bluetooth, and RF chips for major brands, remains important in the handset market. The company also focuses on affordable LTE chips for emerging markets, helping OEMs bring affordable smartphones to countries like India.\n\nStory Continues\nQCOM’s Price Performance, Valuation and Estimates Qualcomm shares have gained 11.1% over the past year compared with the industry ’s growth of 35.3%.\n\nImage Source: Zacks Investment Research\nGoing by the price/earnings ratio, the company's shares currently trade at 14.26 forward earnings, lower than 34.54 for the industry.\n\nImage Source: Zacks Investment Research\nEarnings estimates for 2025 have increased 2% to $12.15 over the past 60 days, while those for 2026 have risen 3.4% to $12.60.\n\nImage Source: Zacks Investment Research\nQualcomm stock currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nApple Inc. (AAPL) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "02:05:10",
      "Source": "GuruFocus.com",
      "Title": "INTC: Intel Foundry Push and Nvidia Backing Could Drive 2026 Growth",
      "URL": "https://finance.yahoo.com/news/intc-intel-foundry-push-nvidia-180510667.html",
      "Content": "INTC: Intel Foundry Push and Nvidia Backing Could Drive 2026 Growth\n\nNauman Khan\nMon, December 22, 2025 at 10:05 AM PST 2 min read\n\nIn this article: INTC\n\nNVDA\n\nSFTBF\n\nAAPL\n\nQCOM\n\nThis article first appeared on GuruFocus .\nIntel ( NASDAQ:INTC ) is entering 2026 with renewed investor interest after a management change and several large cash infusions, but its turnaround still hinges on landing a major external foundry client.\nNew CEO Lip-Bu Tan has trimmed costs and leaned on industry ties to steady the company after years of setbacks that left its manufacturing arm behind rivals.\n\nWarning! GuruFocus has detected 5 Warning Signs with INTC.\nIs INTC fairly valued? Test your thesis with our free DCF calculator.\nA rare U.S. government stake, plus investments from Nvidia ( NASDAQ:NVDA ) and SoftBank ( SFTBY ), bolstered the balance sheet, but analysts say the foundry needs scale to be viable.\nIntel's progress with advanced nodes, including its roadmap for 14A, will be watched closely. Success could persuade customers like Apple or Qualcomm to shift some production, analysts said, but longstanding ties to Taiwan's TSM ( NYSE:TSM ) complicate the pitch.\nInvestors say the next 12 to 18 months are critical: without a marquee external contract, Intel may struggle to justify continued heavy manufacturing investment.\nMarket watchers caution returns could be gradual even if technical milestones are met and shareholders.\n\nIs INTC Stock a Buy? Based on the one year price targets offered by 36 analysts, the average target price for Intel Corp is $36.79 with a high estimate of $52.00 and a low estimate of $18.00. The average target implies a upside of +0.13% from the current price of $36.74.\nBased on GuruFocus estimates, the estimated GF Value for Intel Corp in one year is $23.92, suggesting a downside of -34.89% from the current price of $36.74. gf value is gurufocus' estimate of the fair value that the stock should be traded at. it is calculated based on the historical multiples the stock has traded at previously, as well as past business growth and the future estimates of the business' performance. For deeper insights, visit the forecast page.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "21:40:01",
      "Source": "Insider Monkey",
      "Title": "England High Court  Sanctions QUALCOMM Incorporated (QCOM)’s Alphawave IP Group Acquisition",
      "URL": "https://finance.yahoo.com/news/england-high-court-sanctions-qualcomm-134001637.html",
      "Content": "England High Court Sanctions QUALCOMM Incorporated (QCOM)’s Alphawave IP Group Acquisition\n\nNeha Gupta\nMon, December 22, 2025 at 5:40 AM PST 2 min read\n\nIn this article: QCOM\n\nAWE.L\n\nQUALCOMM Incorporated (NASDAQ: QCOM ) is one of the best forever stocks to buy according to hedge funds . On December 16, the High Court of Justice in England sanctioned a scheme under which QUALCOMM Incorporated (NASDAQ:QCOM) agreed to acquire Alphawave IP Group plc.\nKārlis Dambrāns/Flickr\nThe scheme paves the way for Qualcomm’s wholly owned subsidiary, Aqua Acquisition Sub LLC (Bidco), to acquire all of Alphawave’s issued ordinary share capital. The acquisition follows shareholders’ approval of the $2.4 billion deal, which also met regulatory conditions. The acquisition is poised to accelerate and provide assets for Qualcomm’s expansion into data centers.\nAlphawave Semi has made a name for itself as a leader in high-speed wired connectivity and compute technologies. It delivers IP, custom silicon connectivity products, and chiplets to drive faster, more reliable data transfer.\nMeanwhile, on December 16, Cantor Fitzgerald raised Qualcomm’s price target to $185 from $170 while reiterating a neutral rating on the stock. The price target hike comes amid expectations that the company will capitalize on AI-driven demand across compute, networking, memory, and equipment.\nQUALCOMM Incorporated (NASDAQ:QCOM) is a leading wireless technology innovator that designs and supplies chips (SoCs), software, and platforms for mobile devices, cars, and the Internet of Things (IoT), driving connectivity with 5G, Wi-Fi, and AI breakthroughs, essentially powering the “smart, connected world” through its essential tech like Snapdragon processors, modems, and RF systems for phones, cars, PCs, and more.\n\nWhile we acknowledge the potential of QCOM as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: Top 10 Materials Stocks to Buy According to Analysts and 10 Best Organic Food and Farming Stocks to Buy Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "21:19:00",
      "Source": "Zacks",
      "Title": "Can Completion of Qualcomm's Alphawave Buyout Deal Propel Its Shares?",
      "URL": "https://finance.yahoo.com/news/completion-qualcomms-alphawave-buyout-deal-131900808.html",
      "Content": "Can Completion of Qualcomm's Alphawave Buyout Deal Propel Its Shares?\n\nSupriyo Bose\nMon, December 22, 2025 at 5:19 AM PST 3 min read\n\nIn this article: QCOM\n\nAWE.L\n\nQualcomm Incorporated QCOM has completed the acquisition of U.K.-based chip firm Alphawave Semi for an enterprise value of approximately $2.4 billion. The buyout offers Qualcomm an opportunity to expand its presence in high-growth applications, including data centers, artificial intelligence (AI), data networking and data storage.\n\nWith advanced technology solutions that are complementary to power-efficient CPU and NPU cores, Alphawave Semi delivers connectivity products and chiplets that drive faster, more reliable data transfer with higher performance and lower power consumption for 5G wireless, AI and data center applications. The acquisition, therefore, provides the firepower to enable Qualcomm to be the driving force of the next wave of AI innovation.\n\nOver the past few quarters, Qualcomm has aimed to expand its footprint in AI chips through focused R&D initiatives and strategic acquisitions. In April, the company acquired MovianAI, the former generative AI division of VinAI, a prominent Vietnam-based AI firm. The transaction provided Qualcomm access to VinAI’s comprehensive expertise in generative AI, machine learning, computer vision and natural language processing, significantly accelerating its fundamental AI research. The integration of VinAI’s portfolio with Qualcomm’s extensive R&D expertise facilitated the development of state-of-the-art AI-driven solutions for a wide range of industries, including smartphones, PCs, software-defined vehicles and more.\n\nOther Tech Firms Focusing on AI Chips Advanced Micro Devices, Inc. AMD has strengthened its position in the semiconductor market on the back of its evolution as an enterprise-focused company from a pure-bred consumer-PC chip provider. The latest MI300 series accelerator family strengthens its competitive position in the generative AI space. The accelerator from Advanced Micro is based on AMD CDNA 3 accelerator architecture. It supports up to 192 GB of HBM3 memory, enabling efficient running of large language model training (up to 80 billion parameters) and inference for generative AI workloads. Advanced Micro is also benefiting from strong enterprise adoption and expanded cloud deployments.\n\nIntel Corporation INTC has launched the Intel Core Ultra (Series 2) processors engineered to redefine mobile computing for a wide range of use cases, such as gaming, content creation, IT applications and various other businesses. This state-of-the-art lineup brings significant advancements in AI capabilities, improved performance and efficiency, setting new standards for AI computing. Intel has also introduced a new lineup of leading-edge processors to support AI workloads for edge devices. The Intel Core Ultra processors offer greater scalability, energy efficiency and impressive performance at the edge for a diverse range of use cases such as industrial IoT, autonomous vehicles and more.\n\nStory Continues\nQCOM’s Price Performance, Valuation and Estimates Qualcomm shares have gained 10.7% over the past year compared with the industry’s growth of 35.3%.\n\nImage Source: Zacks Investment Research\nGoing by the price/earnings ratio, the company's shares currently trade at 14.3 forward earnings, lower than 33.8 for the industry and the stock’s mean of 16.89.\n\nImage Source: Zacks Investment Research\nEarnings estimates for fiscal 2026 and fiscal 2027 have increased 2% to $12.15 per share and 3.4% to $12.60, respectively, over the past 60 days.\n\nImage Source: Zacks Investment Research\nQualcomm currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 4
}