{
  "stock_id": "QCOM",
  "last_updated": "2025-12-30T18:10:34.180Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-31",
      "Time": "01:28:23",
      "Source": "Insider Monkey",
      "Title": "QUALCOMM Incorporated (QCOM) Closes Alphawave Deal, Expands Push Into AI Data Centers",
      "URL": "https://finance.yahoo.com/news/qualcomm-incorporated-qcom-closes-alphawave-172823076.html",
      "Content": "QUALCOMM Incorporated (QCOM) Closes Alphawave Deal, Expands Push Into AI Data Centers\n\nLaiba Immad\nTue, December 30, 2025 at 9:28 AM PST 2 min read\n\nIn this article: QCOM\n\nAWEVF\n\nWe recently compiled a list of the 7 Most Promising Robotics Stocks According to Wall Street Analysts . QUALCOMM Incorporated is one of the most promising stocks.\nTheFly reported on December 18 that QCOM announced the completion of its $2.4 billion acquisition of Alphawave Semi, a global leader in high-speed wired connectivity. The deal closed approximately one quarter ahead of schedule, marking a significant milestone in Qualcomm’s infrastructure strategy. As part of the merger, Tony Pialis, the co-founder and former CEO of Alphawave Semi, has been appointed to lead Qualcomm’s newly expanded data center business.\n\nOn December 16, 2025, Cantor Fitzgerald analyst C.J. Muse maintained a Neutral rating on QCOM but significantly raised the price target by $35, moving it from $170 to $185. This adjustment reflects the firm’s increasing confidence in the company’s ability to capitalize on AI-driven demand across compute, networking, and memory segments.\nThe Alphawave acquisition is expected to integrate seamlessly with QUALCOMM Incorporated (NASDAQ:QCOM)’s proprietary Oryon CPU and Hexagon NPU architectures. By securing Alphawave’s high-speed SerDes (Serializer-Deserializer) and chiplet technology, QCOM is positioning itself to provide the core infrastructure for next-generation AI data centers.\n\nQUALCOMM Incorporated (NASDAQ:QCOM) is a global semiconductor and technology leader headquartered in San Diego, California. The company designs high-performance chips, AI processors, and connectivity solutions for mobile, automotive, IoT, and industrial applications. While not a traditional robotics manufacturer, QCOM plays a key role in robotics through its Robotics RB platforms, which enable autonomous robots, drones, and smart machines with edge AI, sensor fusion, and real-time 5G connectivity.\nWhile we acknowledge the potential of QCOM as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "00:50:00",
      "Source": "PR Newswire",
      "Title": "Frore Systems' AirJet®Mini G2 Powers Silent, Sustained AI Performance in the Qualcomm 2-in-1 Notebook and Mini PC Reference Designs",
      "URL": "https://finance.yahoo.com/news/frore-systems-airjet-mini-g2-165000747.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nFrore Systems' AirJet®Mini G2 Powers Silent, Sustained AI Performance in the Qualcomm 2-in-1 Notebook and Mini PC Reference Designs\n\nPR Newswire\nTue, December 30, 2025 at 8:50 AM PST 5 min read\n\nIn this article: QCOM\n\nFirst unveiled at COMPUTEX, AirJet ® Mini G2 can now be seen in real partner systems at CES — and has earned Frore Systems its third consecutive CES Innovation Award.\nSAN JOSE, Calif. , Dec. 30, 2025 /PRNewswire/ -- Frore Systems today highlighted the continued momentum of AirJet ® Mini G2 , the company's most powerful solid-state active cooling chip to-date, showcased in real partner systems at CES, including the Qualcomm Snapdragon X2 Elite 2-in-1 notebook and Mini-PC reference designs .\n\nFirst unveiled at COMPUTEX 2025 , AirJet ® Mini G2's rapid adoption by Qualcomm marks its transition from breakthrough technology to a deployable platform design , reflecting Frore's continued focus on translating thermal innovation into sustained, real-world performance as AI workloads increasingly move into compact, fanless devices.\nAirJet ® Mini G2 has also earned Frore Systems its third consecutive CES Innovation Award , underscoring continued industry recognition for solid-state active cooling technologies that remove thermal limits from next-generation AI systems.\nBuilding on Proven Commercial Deployments\nAirJet ® Mini G2 builds on a growing base of commercially deployed AirJet Mini designs already shipping today , including a mission-critical communication device used by first responders .\n\nAT&T's Sonim MegaConnect™ , the world's first ultra-compact Power Class 1 5G mobile hotspot , enabled by AirJet ® solid-state active cooling is now shipping for use on FirstNet ® , built with AT&T . Designed for frontline emergency response, MegaConnect delivers six times the transmission power of standard hotspots in a palm-sized, dustproof, water-resistant rugged form factor made possible by eliminating bulky thermal solutions and embracing AirJet ® .\nBy enabling high sustained power in compact, rugged designs, AirJet ® Mini has already proven itself in mission critical environments where performance, reliability, and trust are non-negotiable .\nAirJet ® - Built for the Rise of AI Reasoning Models\nAs edge AI evolves from simple inference toward AI reasoning models , workloads are becoming more sustained and compute-intensive. These models spend more time \"thinking,\" placing significantly greater thermal demands on edge devices.\n\nAirJet ® Mini G2 is designed specifically to support this shift. By increasing heat-removal capability by 50% over the original AirJet Mini , while maintaining the same ultra-compact footprint, the AirJet ® Mini G2 enables processors to sustain higher performance levels without throttling.\nThis advance aligns with Frore's Law , the company's long-term vision to double thermal performance every two years - keeping pace with AI compute.\n\nStory Continues\nSustained AI Performance Without Fans\nIn ultra-compact edge systems, thermal limits — not compute capability — are the primary constraint, and bulky heatsinks or thick noisy fans are not an option. AirJet ® Mini G2 overcomes this thermal challenge with a chip just ~2.65 mm thin .\nAt CES, Frore Systems is demonstrating AirJet ® Mini G2 in a range of applications including:\n\nQualcomm 2-in-1 notebook reference design enabling silent high performance in a ultra-thin device.\n\nQualcomm Mini-PC reference designs unlocking sustained desktop-class performance in ultra-compact form factors.\nThese devices leverage AirJet ® Mini G2 to maintain peak performance over time, rather than throttling after short bursts due to heat buildup.\nAirJet ® Mini G2 Technical Highlights\nHeat dissipation : 7.5 W (50% increase over AirJet Mini G1)\n\nDimensions: just 27mm × 41.5mm × 2.65 mm , supporting ultra-compact devices\n\nBack pressure: 1,750 Pa (~10× higher than a fan), supporting dustproof, water-resistant\n\nNoise level: 21 dBA , enabling silent operation\n\nDesign : solid-state, with no moving mechanical parts, delivering long life\nAirJet ® Mini G2 works by generating high-velocity pulsating air jets that efficiently eject heat from compact enclosures, enabling sleek, light, ultra-compact, silent, vibration-free, dustproof, and waterresistant device designs .\n\nAirJet's small size and scalable nature means manufacturers can achieve significantly increased heat removal for higher sustained performance in the ultra-compact devices consumers demand. AirJet enhances performance across numerous devices from Notebooks, tablets, Mini-PCs, smartphones, 5G WiFi Hotspots, cameras and SSDs, to the tsunami of consumer and industrial IOT devices, and in markets as diverse as the datacenter, defense, and automotive industries.\nThird Consecutive CES Innovation Award\nFrore Systems' third consecutive CES Innovation Award highlights growing recognition that thermal technology has become a core performance enabler for edge AI , not merely an afterthought.\n\"AI reasoning models demand sustained performance, not short bursts,\" said Seshu Madhavapeddy, CEO and Founder of Frore Systems. \"AirJet ® Mini G2 removes the thermal barriers that have traditionally limited ultra-compact systems, allowing consumer products like super slim 2-in-1 notebooks and Mini-PCs to think longer, run faster, and operate in silence. This award validates our belief that solid-state active cooling is foundational to the next generation of ultra-compact edge AI devices.\"\n\nLive Demonstrations at CES 2026 : Frore Systems will demonstrate edge AI devices with AirJet and Airjet PAK solid-state active air cooling featuring Industrial edge IoT platforms and consumer products, and Qualcomm Snapdragon X2 Elite compute reference platforms. Additional demonstrations include LiquidJet live at CES 2026 , showcasing: LiquidJet coldplate performance for cooling 1,950W NVIDIA Rubin, 600W/cm² extreme hotspot cooling , and single reticle 1,200W ASIC cooling .\nExperience the future of AI performance in the Frore Systems Demonstration Room, January 6–9 , Venetian Expo, Level 2, Room 2401B , Las Vegas.\nAbout Frore Systems\nFrore Systems is a pioneer in advanced thermal technologies that unleash performance across data centers and edge devices. The company's flagship solutions include LiquidJet™ , a multi-stage 3D shortloop jetchannel liquid cooling coldplate for data centers delivering higher GPU performance, improved PUE and reduced TCO; and AirJet ® , the world's first solid-state active cooling chip used in consumer, industrial, and IoT markets delivering higher performance in ultra-compact, silent, light, dustproof and water-resistant edge devices. Frore's patented cooling technologies are integrated into products from major OEMs and system builders worldwide. Frore Systems is headquartered in Silicon Valley, with manufacturing operations in Taiwan.\nView original content: https://www.prnewswire.com/news-releases/frore-systems-airjetmini-g2-powers-silent-sustained-ai-performance-in-the-qualcomm-2-in-1-notebook-and-mini-pc-reference-designs-302650801.html\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "23:45:00",
      "Source": "Zacks",
      "Title": "Can Intel's Investment-Driven Strategy Regain Its Competitive Edge?",
      "URL": "https://finance.yahoo.com/news/intels-investment-driven-strategy-regain-154500874.html",
      "Content": "Can Intel's Investment-Driven Strategy Regain Its Competitive Edge?\n\nZacks Equity Research\nTue, December 30, 2025 at 7:45 AM PST 3 min read\n\nIn this article: INTC\n\nQCOM\n\nAMD\n\nNVDA\n\nSFTBF\n\nIntel Corporation ( INTC ) has completed a previously announced $5 billion investment from NVIDIA Corporation ( NVDA ), under which the latter purchased around 214.7 million shares of the former at $23.28 per share. Earlier in December, this transaction received U.S. antitrust approval from the Federal Trade Commission. This purchase gives NVIDIA roughly a 4% equity stake in Intel through a private placement of shares.\n\nThe partnership aims to tightly combine Intel’s custom-designed x86 CPUs with NVIDIA’s AI GPUs and NVLink interconnect technology to create faster, more efficient AI systems and next-generation PCs with stronger AI and graphics performance. This could help Intel remain competitive in the AI era.\nIntel had also secured $8.9 billion in funds from the U.S. government to support semiconductor manufacturing and packaging projects in Arizona, New Mexico, Ohio and Oregon in order to boost the domestic chip industry. SoftBank has also invested $2 billion, providing funds to support Intel’s restructuring and AI projects.\nIntel is constantly making efforts to bring huge investments to strengthen its balance sheet, supporting heavy spending on new factories and R&D, boosting market confidence and enabling deeper technology collaboration with firms like NVIDIA.\n\nHow Are Rivals Performing? Intel faces competition from Qualcomm Incorporated ( QCOM ) and Advanced Micro Devices ( AMD ). Qualcomm recently completed its $2.4 billion acquisition of British semiconductor company Alphawave Semi to strengthen its AI, data center and high-speed connectivity technologies, boosting its competitiveness beyond smartphones. By strengthening its PC chip offerings through programs like Snapdragon X, Qualcomm can expand into new markets such as AI infrastructure, edge computing and personal computers. Qualcomm entered the AI infrastructure space by developing AI accelerators like AI200 & AI250.\n\nAMD is set to launch high-performance AI GPUs, EPYC server CPUs and full AI systems like Helios to compete with NVIDIA and provide faster, more efficient solutions for data centers and enterprises. AMD is partnering with companies like OpenAI and Oracle to expand across gaming, PCs and servers to increase revenues and stay competitive. The company continues to improve its ROCm open software stack and open hardware standards.\nINTC’s Price Performance, Valuation & Estimates Shares of Intel have surged 85% over the past year compared with the industry ’s growth of 34.1%.\n\nImage Source: Zacks Investment Research\nGoing by the price/book ratio, the company's shares currently trade at 1.5 book value, lower than 32.5 of the industry average.\n\nStory Continues\n\nImage Source: Zacks Investment Research\nINTC’s earnings estimates for 2025 have increased 6.3% to 34 cents per share, while those for 2026 have declined 6.5% to 58 cents over the past 60 days.\n\nImage Source: Zacks Investment Research\nIntel stock currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "03:53:16",
      "Source": "Barchart",
      "Title": "Intel Stock Had a Banner Year But Is Still 50% Off Its Record Highs. Are More Gains in Store for 2026?",
      "URL": "https://finance.yahoo.com/m/a8b42796-9593-3d38-85b1-72805ec62ca2/intel-stock-had-a-banner-year.html",
      "Content": "Intel Stock Had a Banner Year But Is Still 50% Off Its Record Highs. Are More Gains in Store for 2026?\n\nWajeeh Khan\nMon, December 29, 2025 at 11:53 AM PST 2 min read\n\nIn this article: INTC\n\nAMD\n\nQCOM\n\nTSM\n\nAAPL\n\nIntel (INTC) stock has been a major outperformer this year as CEO Lip-Bu Tan’ strategic vision renewed investor confidence in the company’s ability to compete in the global AI arms race.\nUnder his leadership, the company secured billions in private and federal investments, paving the way to advance its foundry ambitions.\n\nMore News from Barchart Micron Technology Bear Put Spread Could Return 197% in this Down Move\nSanta Claus Rally, Fed Minutes and Other Can't Miss Items this Week\nMP Materials Gained 230% in 2025. Should You Buy, Sell, or Hold MP Stock for 2026?\nTired of missing midday reversals? The FREE Barchart Brief newsletter keeps you in the know. Sign up now!\nVersus their pandemic high, however, Intel shares remain down some 50%, suggesting persistent structural and executions risks continue to weigh on sentiment.\nWhat to Expect From Intel Stock in 2026 The latest setback for INTC stock came from Nvidia (NVDA) that’s reportedly scrapped plans of producing its advanced chips using Intel’s 18A node.\nStill, Daniel Newman – the chief executive of Futurum Group – believes the longer term bull case remains intact for one simple reason: Taiwan Semi (TSM) just “can’t produce enough chips.”\n\nThe unprecedented AI-driven demand is making big names like Apple (AAPL), Qualcomm (QCOM), and even AMD (AMD) explore alternatives, reinforcing Intel’s role as an auxiliary capacity provider.\nAnd since demand is truly explosive, being only an adjunct resource for the semiconductor space may prove sufficient in driving Intel stock higher in 2026, he told CNBC in a recent interview.\nINTC Shares Remain Inexpensive to Own Newman doesn’t see NVDA news as a major setback for Intel shares since Lip-Bu Tan had already broadcast that the initial ramp-up of the firm’s 18A node is optimized for and dedicated to its own internal products.\nAccording to him, the real inflection point for Intel will be its upcoming “14A” process, expected to enter volume production in 2028.\n\n“This is the one where rubber meets the road for companies like Nvidia, Apple, and others.”\nFrom a valuation perspective, INTC shares are just as attractive. Despite an explosive year-to-date rally, they’re going for just over 3x sales at the time of writing, versus more than 35x for Nvidia.\nWall Street Disagrees with Newman on Intel Wall Street analysts do not entirely agree with Newman’s constructive view on Intel stock, though.\nThe consensus rating on INTC shares remains at “Hold” only with the mean target of nearly $37 already in line with the price at which they are trading currently.\n\nStory Continues\nThis article was created with the support of automated content tools from our partners at Sigma.AI. Together, our financial data and AI solutions help us to deliver more informed market headline analysis to readers faster than ever.\nOn the date of publication, Wajeeh Khan did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "22:15:14",
      "Source": "Insider Monkey",
      "Title": "Analysts Watch QUALCOMM Incorporated (QCOM)’s Expanding AI Data Center Footprint",
      "URL": "https://finance.yahoo.com/news/analysts-watch-qualcomm-incorporated-qcom-141514737.html",
      "Content": "Analysts Watch QUALCOMM Incorporated (QCOM)’s Expanding AI Data Center Footprint\n\nRameen Kasana\nMon, December 29, 2025 at 6:15 AM PST 2 min read\n\nIn this article: QCOM\n\nAWEVF\n\nQUALCOMM Incorporated (NASDAQ: QCOM ) is among the most undervalued tech giants to buy according to hedge funds . As of December 26, QUALCOMM Incorporated (NASDAQ:QCOM) has a ‘Buy’ or equivalent rating from half of the analysts covering the stock. With a median price target of $200, the stock has an upside potential of 14.28%. Among the analysts bullish on the stock is Fang Boon Foo, an analyst at DBS, who maintained a ‘Buy’ rating on the company on December 5 and a price target that mirrored the consensus estimate.\n\nLater, on December 18, QUALCOMM Incorporated (NASDAQ:QCOM) announced the completion of its acquisition of Alphawave IP Group plc, a quarter ahead of the expected timeline. This acquisition is a testament to the company’s strategy of establishing a foothold in the data center market. CEO and co-founder of Alphawave Semi, Tony Pialis, will lead the company’s data center business.\nKārlis Dambrāns/Flickr\nThe venture aims to create a leading player in AI compute and connectivity solutions across several fast-growing markets, particularly data center applications.\nSeparately, on December 16, C.J. Muse from Cantor Fitzgerald lifted the price target on QUALCOMM Incorporated (NASDAQ:QCOM) to $185 from $170 and maintained a ‘Neutral’ rating. The firm’s confidence in SOX (Philadelphia Semiconductor Index) to lead the market is driven by its outperformance versus S&P by approximately 30 points in CY25, The Fly reported.\n\nQUALCOMM Incorporated (NASDAQ:QCOM), headquartered in California, is a digital telecommunications provider operating across three segments: Qualcomm CDMA Technologies, Qualcomm Technology Licensing, and Qualcomm Strategic Initiatives.\nWhile we acknowledge the potential of QCOM as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money .\nDisclosure: None.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "22:00:06",
      "Source": "Zacks",
      "Title": "QUALCOMM Incorporated (QCOM) Is a Trending Stock: Facts to Know Before Betting on It",
      "URL": "https://finance.yahoo.com/news/qualcomm-incorporated-qcom-trending-stock-140006987.html",
      "Content": "QUALCOMM Incorporated (QCOM) Is a Trending Stock: Facts to Know Before Betting on It\n\nZacks Equity Research\nMon, December 29, 2025 at 6:00 AM PST 5 min read\n\nIn this article: QCOM\n\n^GSPC\n\nQualcomm (QCOM) has recently been on Zacks.com's list of the most searched stocks. Therefore, you might want to consider some of the key factors that could influence the stock's performance in the near future.\nOver the past month, shares of this chipmaker have returned +4%, compared to the Zacks S&P 500 composite's +2.6% change. During this period, the Zacks Electronics - Semiconductors industry, which Qualcomm falls in, has lost 6.3%. The key question now is: What could be the stock's future direction?\n\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nRevisions to Earnings Estimates Here at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock.\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nFor the current quarter, Qualcomm is expected to post earnings of $3.38 per share, indicating a change of -0.9% from the year-ago quarter. The Zacks Consensus Estimate remained unchanged over the last 30 days.\nFor the current fiscal year, the consensus earnings estimate of $12.15 points to a change of +1% from the prior year. Over the last 30 days, this estimate has remained unchanged.\nFor the next fiscal year, the consensus earnings estimate of $12.6 indicates a change of +3.7% from what Qualcomm is expected to report a year ago. Over the past month, the estimate has remained unchanged.\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #3 (Hold) for Qualcomm.\n\nStory Continues\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS Revenue Growth Forecast While earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\n\nIn the case of Qualcomm, the consensus sales estimate of $12.25 billion for the current quarter points to a year-over-year change of +5%. The $45.69 billion and $46.14 billion estimates for the current and next fiscal years indicate changes of +3.5% and +1%, respectively.\nLast Reported Results and Surprise History Qualcomm reported revenues of $11.27 billion in the last reported quarter, representing a year-over-year change of +10%. EPS of $3 for the same period compares with $2.69 a year ago.\nCompared to the Zacks Consensus Estimate of $10.79 billion, the reported revenues represent a surprise of +4.43%. The EPS surprise was +4.17%.\n\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates three times over this period.\nValuation No investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nWhile comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.\n\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nQualcomm is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nConclusion The facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Qualcomm. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "21:39:00",
      "Source": "MarketBeat",
      "Title": "Qualcomm Shares Are Back Near Their 2021 Price—Should Investors Be Worried or Excited?",
      "URL": "https://finance.yahoo.com/m/cca2f494-da36-35c6-9a19-75805b28bfec/qualcomm-shares-are-back-near.html",
      "Content": "Qualcomm Shares Are Back Near Their 2021 Price—Should Investors Be Worried or Excited?\n\nSam Quirke, MarketBeat\nMon, December 29, 2025 at 5:39 AM PST 4 min read\n\nIn this article: QCOM\n\nKey Points After a long reset, Qualcomm is ending the year near 2021 price levels.\nHowever, it’s hard to ignore the fact that the stock has quietly rallied more than 40% since April alone.\nAnalyst price targets suggest that the stock remains undervalued even now.\nInterested in QUALCOMM Incorporated? Here are five stocks we like better.\n\nTech giant Qualcomm Inc. (NASDAQ: QCOM) is trading around $175, a level that stands out for an unexpected, and undesirable, reason.\nDespite a strong rally in recent months, the stock is finishing the year close to where it closed out 2021.\n→ Gold and Silver Exploded—Now Copper May Be the Next Big Trade\nOn the surface, that might sound uninspiring, but look a little closer, and there’s an interesting story to be found about how the market is reassessing Qualcomm as we move into 2026.\nAfter years of uneven performance and repeated false starts, Qualcomm has finally put together one of its more sustained rallies in recent memory. The stock is up more than 40% since April, yet it still sits far from the euphoric valuations enjoyed by some of its semiconductor peers.\n\n→ Netflix Is Out of Favor—and That’s Why It’s Getting Interesting\nThe market’s question heading into 2026 is straightforward: Is Qualcomm stock simply bouncing within a long range, or is it finally earning a more durable re-rating?\nQualcomm Stock Back Near 2021 Prices After a Multiyear Reset Finishing near 2021 levels does not mean Qualcomm has gone nowhere. Instead, it reflects the long reset the stock has endured.\n→ Broadcom's Insider Selling: A Big Red Flag, or Business as Usual?\nSince that period, the company has worked through smartphone cycle volatility, supply chain disruption, and shifting investor expectations around its growth profile.\n\nWhat makes the current setup different is how the current rally has unfolded. Qualcomm’s move since April has been slow, steady, and sustainable, rather than volatile and explosive. The stock’s been making higher highs and higher lows without the kind of speculative frenzy that often marks short-term tops.\nImportantly, fundamentals have been doing more of the heavy lifting throughout this time. Qualcomm has consistently beat analyst expectations in its quarterly reports, putting the pressure back on the bears to prove this is a company on the back foot—something they have been unable to do.\nFrom that perspective, still being at 2021 price levels is not as bad as it may seem at first glance. The past year has not been so much about stagnation as it has been about reinventing itself and rebuilding credibility.\n\nStory Continues\nAnalyst Price Targets Signal Re-Rating Potential Recent analyst commentary captures that balance well. Susquehanna’s reiterated Buy rating on Qualcomm last month, and their $210 price target, paints the picture of a stock that’s heavily undervalued.\nThat target points to meaningful upside and signals confidence that the company’s improving fundamentals are not yet fully reflected in the share price.\n\nWhile Cantor Fitzgerald might have taken a more cautious stance this month with their Neutral rating, considering Qualcomm is currently trading around $175, their $185 price target also suggests it’s heavily undervalued right now.\nThe split is telling, with even the more cautious voices stopping short of calling for a trend reversal. Instead, the debate has shifted to whether Qualcomm deserves to continue trading around the upper end of its recent range, or if it should push on towards all-time highs.\nWhat Must Go Right for Qualcomm in 2026 From a forward-looking perspective, the key takeaway is that Qualcomm enters 2026 from a position of strength rather than speculation. The stock is not cheap by the standards of its recent history, but it is also not priced for perfection. Trading near 2021 levels after a multi-year reset leaves a ton of room for upside if execution continues.\n\nThe next leg will likely depend on whether Qualcomm can sustain its narrative shift. Continued earnings beats and revenue diversification would support the case for this rally continuing. In that scenario, the current price could look more like a base of support than a ceiling.\nOf course, risks remain. A renewed slowdown in key markets or a change in sentiment toward semiconductors more broadly could stall progress. But unlike prior rallies, this one is being underpinned by fundamentals rather than hope.\nEnding the year where it ended 2021 is not a sign that Qualcomm has been standing still. Instead, it feels like the company is finally making serious headway with its overall transformation, and could be ready to make 2026 the year it hits a fresh all-time high.\nThe article \" Qualcomm Shares Are Back Near Their 2021 Price—Should Investors Be Worried or Excited? \" was originally published by MarketBeat.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "23:35:00",
      "Source": "Zacks",
      "Title": "QCOM Rides on Strength in Premium Handset Market: Will it Sustain?",
      "URL": "https://finance.yahoo.com/news/qcom-rides-strength-premium-handset-153500215.html",
      "Content": "QCOM Rides on Strength in Premium Handset Market: Will it Sustain?\n\nZacks Equity Research\nFri, December 26, 2025 at 7:35 AM PST 3 min read\n\nIn this article: QCOM\n\n2454.TW\n\nAAPL\n\nSSNLF\n\nQualcomm Incorporated ( QCOM ) generated about $6.96 billion in handset revenues in the latest quarter, with a year-over-year increase of 14% and an estimated $27.8 billion in fiscal 2025, contributing roughly 63% of the total company’s revenues. Qualcomm’s strong handset revenues are driven by its increased customer demand for Snapdragon-powered premium Android smartphones.\n\nQualcomm faces strong competition from rivals like MediaTek, especially in mid-range and budget smartphones, which puts pressure on its market share and pricing. U.S.-China trade tensions have reduced companies' handset demand to a great extent. Qualcomm's handset business experienced ongoing challenges as global smartphone demand slowed down day by day. Moreover, major handset manufacturers, such as Apple and Samsung, are moving toward in-house chip development. This is a major challenge for Qualcomm.\nTo overcome challenges in the smartphone business, Qualcomm is focusing on premium Snapdragon chips to stay competitive in flagship devices. Qualcomm recently launched the Snapdragon 8 Gen 5, offering high-speed performance, advanced AI, improved graphics, and enhanced camera capabilities for flagship smartphones from global brands like iQOO , Honor, ASUS, OnePlus, and Vivo.\n\nPer a report from Precedence Research, the global 5G chipset market is expected to reach $126.4 billion by 2030 from $18.7 billion in 2022, with a CAGR of 27%, indicating strong underlying growth potential for Qualcomm’s handset segment in the near future. QCOM’s continuous innovation in powering flagship devices with cutting-edge features helps to boost its handset revenues, maintain leadership in the premium segment, and drive future revenue growth.\nOther Tech Companies Focused on Handset Chip Development Qualcomm faces competition from Apple, Inc. ( AAPL ) and Broadcom, Inc. ( AVGO ). Apple recently launched the new iPad Pro, MacBook Pro, and upgraded Vision Pro, all powered by their M5 chip. Apple’s iPhone 17 series uses the A19 chip, and the iPhone Air features the A19 Pro chip, both offering faster performance, better graphics, and advanced AI capabilities. These recent chips strengthen Apple’s position in the smartphone market and reduce its reliance on third-party suppliers.\n\nBroadcom recently launched Wi Fi 8 chips for smartphones and connected devices, improving speed, reliability, and efficiency. Broadcom, by providing essential smartphone components like Wi Fi, Bluetooth, and RF chips for major brands, remains important in the handset market. The company also focuses on affordable LTE chips for emerging markets, helping OEMs bring affordable smartphones to countries like India.\n\nStory Continues\nQCOM’s Price Performance, Valuation and Estimates Qualcomm shares have gained 11.1% over the past year compared with the industry ’s growth of 35.3%.\n\nImage Source: Zacks Investment Research\nGoing by the price/earnings ratio, the company's shares currently trade at 14.26 forward earnings, lower than 34.54 for the industry.\n\nImage Source: Zacks Investment Research\nEarnings estimates for 2025 have increased 2% to $12.15 over the past 60 days, while those for 2026 have risen 3.4% to $12.60.\n\nImage Source: Zacks Investment Research\nQualcomm stock currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nApple Inc. (AAPL) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 8
}