{
  "stock_id": "QCOM",
  "last_updated": "2025-12-29T15:10:33.504Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-29",
      "Time": "22:15:14",
      "Source": "Insider Monkey",
      "Title": "Analysts Watch QUALCOMM Incorporated (QCOM)’s Expanding AI Data Center Footprint",
      "URL": "https://finance.yahoo.com/news/analysts-watch-qualcomm-incorporated-qcom-141514737.html",
      "Content": "Analysts Watch QUALCOMM Incorporated (QCOM)’s Expanding AI Data Center Footprint\n\nRameen Kasana\nMon, December 29, 2025 at 6:15 AM PST 2 min read\n\nIn this article: QCOM\n\nAWEVF\n\nQUALCOMM Incorporated (NASDAQ: QCOM ) is among the most undervalued tech giants to buy according to hedge funds . As of December 26, QUALCOMM Incorporated (NASDAQ:QCOM) has a ‘Buy’ or equivalent rating from half of the analysts covering the stock. With a median price target of $200, the stock has an upside potential of 14.28%. Among the analysts bullish on the stock is Fang Boon Foo, an analyst at DBS, who maintained a ‘Buy’ rating on the company on December 5 and a price target that mirrored the consensus estimate.\n\nLater, on December 18, QUALCOMM Incorporated (NASDAQ:QCOM) announced the completion of its acquisition of Alphawave IP Group plc, a quarter ahead of the expected timeline. This acquisition is a testament to the company’s strategy of establishing a foothold in the data center market. CEO and co-founder of Alphawave Semi, Tony Pialis, will lead the company’s data center business.\nKārlis Dambrāns/Flickr\nThe venture aims to create a leading player in AI compute and connectivity solutions across several fast-growing markets, particularly data center applications.\nSeparately, on December 16, C.J. Muse from Cantor Fitzgerald lifted the price target on QUALCOMM Incorporated (NASDAQ:QCOM) to $185 from $170 and maintained a ‘Neutral’ rating. The firm’s confidence in SOX (Philadelphia Semiconductor Index) to lead the market is driven by its outperformance versus S&P by approximately 30 points in CY25, The Fly reported.\n\nQUALCOMM Incorporated (NASDAQ:QCOM), headquartered in California, is a digital telecommunications provider operating across three segments: Qualcomm CDMA Technologies, Qualcomm Technology Licensing, and Qualcomm Strategic Initiatives.\nWhile we acknowledge the potential of QCOM as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money .\nDisclosure: None.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "23:35:00",
      "Source": "Zacks",
      "Title": "QCOM Rides on Strength in Premium Handset Market: Will it Sustain?",
      "URL": "https://finance.yahoo.com/news/qcom-rides-strength-premium-handset-153500215.html",
      "Content": "QCOM Rides on Strength in Premium Handset Market: Will it Sustain?\n\nZacks Equity Research\nFri, December 26, 2025 at 7:35 AM PST 3 min read\n\nIn this article: QCOM\n\n2454.TW\n\nAAPL\n\nSSNLF\n\nQualcomm Incorporated ( QCOM ) generated about $6.96 billion in handset revenues in the latest quarter, with a year-over-year increase of 14% and an estimated $27.8 billion in fiscal 2025, contributing roughly 63% of the total company’s revenues. Qualcomm’s strong handset revenues are driven by its increased customer demand for Snapdragon-powered premium Android smartphones.\n\nQualcomm faces strong competition from rivals like MediaTek, especially in mid-range and budget smartphones, which puts pressure on its market share and pricing. U.S.-China trade tensions have reduced companies' handset demand to a great extent. Qualcomm's handset business experienced ongoing challenges as global smartphone demand slowed down day by day. Moreover, major handset manufacturers, such as Apple and Samsung, are moving toward in-house chip development. This is a major challenge for Qualcomm.\nTo overcome challenges in the smartphone business, Qualcomm is focusing on premium Snapdragon chips to stay competitive in flagship devices. Qualcomm recently launched the Snapdragon 8 Gen 5, offering high-speed performance, advanced AI, improved graphics, and enhanced camera capabilities for flagship smartphones from global brands like iQOO , Honor, ASUS, OnePlus, and Vivo.\n\nPer a report from Precedence Research, the global 5G chipset market is expected to reach $126.4 billion by 2030 from $18.7 billion in 2022, with a CAGR of 27%, indicating strong underlying growth potential for Qualcomm’s handset segment in the near future. QCOM’s continuous innovation in powering flagship devices with cutting-edge features helps to boost its handset revenues, maintain leadership in the premium segment, and drive future revenue growth.\nOther Tech Companies Focused on Handset Chip Development Qualcomm faces competition from Apple, Inc. ( AAPL ) and Broadcom, Inc. ( AVGO ). Apple recently launched the new iPad Pro, MacBook Pro, and upgraded Vision Pro, all powered by their M5 chip. Apple’s iPhone 17 series uses the A19 chip, and the iPhone Air features the A19 Pro chip, both offering faster performance, better graphics, and advanced AI capabilities. These recent chips strengthen Apple’s position in the smartphone market and reduce its reliance on third-party suppliers.\n\nBroadcom recently launched Wi Fi 8 chips for smartphones and connected devices, improving speed, reliability, and efficiency. Broadcom, by providing essential smartphone components like Wi Fi, Bluetooth, and RF chips for major brands, remains important in the handset market. The company also focuses on affordable LTE chips for emerging markets, helping OEMs bring affordable smartphones to countries like India.\n\nStory Continues\nQCOM’s Price Performance, Valuation and Estimates Qualcomm shares have gained 11.1% over the past year compared with the industry ’s growth of 35.3%.\n\nImage Source: Zacks Investment Research\nGoing by the price/earnings ratio, the company's shares currently trade at 14.26 forward earnings, lower than 34.54 for the industry.\n\nImage Source: Zacks Investment Research\nEarnings estimates for 2025 have increased 2% to $12.15 over the past 60 days, while those for 2026 have risen 3.4% to $12.60.\n\nImage Source: Zacks Investment Research\nQualcomm stock currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nApple Inc. (AAPL) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "02:05:10",
      "Source": "GuruFocus.com",
      "Title": "INTC: Intel Foundry Push and Nvidia Backing Could Drive 2026 Growth",
      "URL": "https://finance.yahoo.com/news/intc-intel-foundry-push-nvidia-180510667.html",
      "Content": "INTC: Intel Foundry Push and Nvidia Backing Could Drive 2026 Growth\n\nNauman Khan\nMon, December 22, 2025 at 10:05 AM PST 2 min read\n\nIn this article: INTC\n\nNVDA\n\nSFTBF\n\nAAPL\n\nQCOM\n\nThis article first appeared on GuruFocus .\nIntel ( NASDAQ:INTC ) is entering 2026 with renewed investor interest after a management change and several large cash infusions, but its turnaround still hinges on landing a major external foundry client.\nNew CEO Lip-Bu Tan has trimmed costs and leaned on industry ties to steady the company after years of setbacks that left its manufacturing arm behind rivals.\n\nWarning! GuruFocus has detected 5 Warning Signs with INTC.\nIs INTC fairly valued? Test your thesis with our free DCF calculator.\nA rare U.S. government stake, plus investments from Nvidia ( NASDAQ:NVDA ) and SoftBank ( SFTBY ), bolstered the balance sheet, but analysts say the foundry needs scale to be viable.\nIntel's progress with advanced nodes, including its roadmap for 14A, will be watched closely. Success could persuade customers like Apple or Qualcomm to shift some production, analysts said, but longstanding ties to Taiwan's TSM ( NYSE:TSM ) complicate the pitch.\nInvestors say the next 12 to 18 months are critical: without a marquee external contract, Intel may struggle to justify continued heavy manufacturing investment.\nMarket watchers caution returns could be gradual even if technical milestones are met and shareholders.\n\nIs INTC Stock a Buy? Based on the one year price targets offered by 36 analysts, the average target price for Intel Corp is $36.79 with a high estimate of $52.00 and a low estimate of $18.00. The average target implies a upside of +0.13% from the current price of $36.74.\nBased on GuruFocus estimates, the estimated GF Value for Intel Corp in one year is $23.92, suggesting a downside of -34.89% from the current price of $36.74. gf value is gurufocus' estimate of the fair value that the stock should be traded at. it is calculated based on the historical multiples the stock has traded at previously, as well as past business growth and the future estimates of the business' performance. For deeper insights, visit the forecast page.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 3
}