{
  "stock_id": "QCOM",
  "last_updated": "2025-12-22T15:10:34.242Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-22",
      "Time": "21:40:01",
      "Source": "Insider Monkey",
      "Title": "England High Court  Sanctions QUALCOMM Incorporated (QCOM)’s Alphawave IP Group Acquisition",
      "URL": "https://finance.yahoo.com/news/england-high-court-sanctions-qualcomm-134001637.html",
      "Content": "England High Court Sanctions QUALCOMM Incorporated (QCOM)’s Alphawave IP Group Acquisition\n\nNeha Gupta\nMon, December 22, 2025 at 5:40 AM PST 2 min read\n\nIn this article: QCOM\n\nAWE.L\n\nQUALCOMM Incorporated (NASDAQ: QCOM ) is one of the best forever stocks to buy according to hedge funds . On December 16, the High Court of Justice in England sanctioned a scheme under which QUALCOMM Incorporated (NASDAQ:QCOM) agreed to acquire Alphawave IP Group plc.\nKārlis Dambrāns/Flickr\nThe scheme paves the way for Qualcomm’s wholly owned subsidiary, Aqua Acquisition Sub LLC (Bidco), to acquire all of Alphawave’s issued ordinary share capital. The acquisition follows shareholders’ approval of the $2.4 billion deal, which also met regulatory conditions. The acquisition is poised to accelerate and provide assets for Qualcomm’s expansion into data centers.\nAlphawave Semi has made a name for itself as a leader in high-speed wired connectivity and compute technologies. It delivers IP, custom silicon connectivity products, and chiplets to drive faster, more reliable data transfer.\nMeanwhile, on December 16, Cantor Fitzgerald raised Qualcomm’s price target to $185 from $170 while reiterating a neutral rating on the stock. The price target hike comes amid expectations that the company will capitalize on AI-driven demand across compute, networking, memory, and equipment.\nQUALCOMM Incorporated (NASDAQ:QCOM) is a leading wireless technology innovator that designs and supplies chips (SoCs), software, and platforms for mobile devices, cars, and the Internet of Things (IoT), driving connectivity with 5G, Wi-Fi, and AI breakthroughs, essentially powering the “smart, connected world” through its essential tech like Snapdragon processors, modems, and RF systems for phones, cars, PCs, and more.\n\nWhile we acknowledge the potential of QCOM as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: Top 10 Materials Stocks to Buy According to Analysts and 10 Best Organic Food and Farming Stocks to Buy Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "21:19:00",
      "Source": "Zacks",
      "Title": "Can Completion of Qualcomm's Alphawave Buyout Deal Propel Its Shares?",
      "URL": "https://finance.yahoo.com/news/completion-qualcomms-alphawave-buyout-deal-131900808.html",
      "Content": "Can Completion of Qualcomm's Alphawave Buyout Deal Propel Its Shares?\n\nSupriyo Bose\nMon, December 22, 2025 at 5:19 AM PST 3 min read\n\nIn this article: QCOM\n\nAWE.L\n\nQualcomm Incorporated QCOM has completed the acquisition of U.K.-based chip firm Alphawave Semi for an enterprise value of approximately $2.4 billion. The buyout offers Qualcomm an opportunity to expand its presence in high-growth applications, including data centers, artificial intelligence (AI), data networking and data storage.\n\nWith advanced technology solutions that are complementary to power-efficient CPU and NPU cores, Alphawave Semi delivers connectivity products and chiplets that drive faster, more reliable data transfer with higher performance and lower power consumption for 5G wireless, AI and data center applications. The acquisition, therefore, provides the firepower to enable Qualcomm to be the driving force of the next wave of AI innovation.\n\nOver the past few quarters, Qualcomm has aimed to expand its footprint in AI chips through focused R&D initiatives and strategic acquisitions. In April, the company acquired MovianAI, the former generative AI division of VinAI, a prominent Vietnam-based AI firm. The transaction provided Qualcomm access to VinAI’s comprehensive expertise in generative AI, machine learning, computer vision and natural language processing, significantly accelerating its fundamental AI research. The integration of VinAI’s portfolio with Qualcomm’s extensive R&D expertise facilitated the development of state-of-the-art AI-driven solutions for a wide range of industries, including smartphones, PCs, software-defined vehicles and more.\n\nOther Tech Firms Focusing on AI Chips Advanced Micro Devices, Inc. AMD has strengthened its position in the semiconductor market on the back of its evolution as an enterprise-focused company from a pure-bred consumer-PC chip provider. The latest MI300 series accelerator family strengthens its competitive position in the generative AI space. The accelerator from Advanced Micro is based on AMD CDNA 3 accelerator architecture. It supports up to 192 GB of HBM3 memory, enabling efficient running of large language model training (up to 80 billion parameters) and inference for generative AI workloads. Advanced Micro is also benefiting from strong enterprise adoption and expanded cloud deployments.\n\nIntel Corporation INTC has launched the Intel Core Ultra (Series 2) processors engineered to redefine mobile computing for a wide range of use cases, such as gaming, content creation, IT applications and various other businesses. This state-of-the-art lineup brings significant advancements in AI capabilities, improved performance and efficiency, setting new standards for AI computing. Intel has also introduced a new lineup of leading-edge processors to support AI workloads for edge devices. The Intel Core Ultra processors offer greater scalability, energy efficiency and impressive performance at the edge for a diverse range of use cases such as industrial IoT, autonomous vehicles and more.\n\nStory Continues\nQCOM’s Price Performance, Valuation and Estimates Qualcomm shares have gained 10.7% over the past year compared with the industry’s growth of 35.3%.\n\nImage Source: Zacks Investment Research\nGoing by the price/earnings ratio, the company's shares currently trade at 14.3 forward earnings, lower than 33.8 for the industry and the stock’s mean of 16.89.\n\nImage Source: Zacks Investment Research\nEarnings estimates for fiscal 2026 and fiscal 2027 have increased 2% to $12.15 per share and 3.4% to $12.60, respectively, over the past 60 days.\n\nImage Source: Zacks Investment Research\nQualcomm currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "17:00:39",
      "Source": "MT Newswires",
      "Title": "Qualcomm Insider Sold Shares Worth $2,197,736, According to a Recent SEC Filing",
      "URL": "https://finance.yahoo.com/news/qualcomm-insider-sold-shares-worth-090039441.html",
      "Content": "PREMIUM\nQualcomm Insider Sold Shares Worth $2,197,736, According to a Recent SEC Filing\n\nMT Newswires\nMon, December 22, 2025 at 1:00 AM PST\n\nIn this article: QCOM\n\nAkash J. Palkhiwala, Executive Vice President, Chief Financial Officer and Chief Operating Officer,\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nAGB und Datenschutzerklärung\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "01:58:01",
      "Source": "Insider Monkey",
      "Title": "Analysts Bullish on Qualcomm Inc. (QCOM) As It Completes Alphawave Semi Acquisition",
      "URL": "https://finance.yahoo.com/news/analysts-bullish-qualcomm-inc-qcom-175801819.html",
      "Content": "Analysts Bullish on Qualcomm Inc. (QCOM) As It Completes Alphawave Semi Acquisition\n\nJabran Kundi\nSun, December 21, 2025 at 9:58 AM PST 2 min read\n\nIn this article: QCOM\n\nQualcomm Inc. (NASDAQ: QCOM ) is one of the 10 Most Undervalued Semiconductor Stocks to Invest in . On December 16, C J Muse of Cantor Fitzgerald maintained his Buy rating on Qualcomm Inc. (NASDAQ:QCOM) and raised the price target from $150 to $185. The research firm’s price target remains well below the $200 median target per CNN’s compilation of 36 analyst ratings.\nThe company has also announced on December 18 that it completed the acquisition of Alphawave Semi. The acquisition is intended to help Qualcomm enter the data center market, a move it made earlier this year after exiting the market in 2018.\nQualcomm Inc. (NASDAQ:QCOM) continues to surge amid analyst optimism and positive developments. The company’s Snapdragon Cockpit Elite technology will be on display at the CES 2026, according to LG Electronics’ press release on December 10. LG is set to showcase its Qualcomm-powered AI Cabin Platform at the event.\n\nQualcomm’s technology will enable the AI Cabin to perform all AI calculations on the device without requiring a connection to any external server. This will significantly improve real-time AI assistance. The press release mentioned examples where this technology will be useful. If a driver fails to notice a merging vehicle, they can be quickly alerted by the Qualcomm System-on-Chip (SoC). The lack of a cloud connection also reduces vulnerabilities, such as latency and hacking.\nQualcomm Inc. (NASDAQ:QCOM) develops and commercializes foundational technologies for the wireless industry worldwide. The company is operating through Qualcomm Technology Licensing (QTL), Qualcomm CDMA Technologies (QCT), and Qualcomm Strategic Initiatives (QSI).\nWhile we acknowledge the potential of QCOM as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: Cathie Wood’s Stock Portfolio: Top 10 Stocks to Buy and 30 Most Fantastic Stocks Every Investor Should Pay Attention To .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-21",
      "Time": "22:00:04",
      "Source": "Yahoo Finance",
      "Title": "Intel stock soared in 2025. But the chipmaker still has a long road ahead.",
      "URL": "https://finance.yahoo.com/news/intel-stock-soared-in-2025-but-the-chipmaker-still-has-a-long-road-ahead-140004121.html",
      "Content": "Intel stock soared in 2025. But the chipmaker still has a long road ahead.\n\nLaura Bratton\nSun, December 21, 2025 at 6:00 AM PST 5 min read\n\nIn this article: INTC\n\nSFTBY\n\nTSM\n\nNVDA\n\nSFTBF\n\nFor Intel ( INTC ), 2025 was an eventful year, but not one that necessarily changed its narrative .\nThe storied American chipmaker got a new CEO and won massive investments from the US government , Nvidia ( NVDA ), and SoftBank ( SFTBY ). Those developments helped push the stock up 86% for the year, ahead of gains for the \"Magnificent Seven\" Big Tech stocks and Intel rival Advanced Micro Devices ( AMD ). At the same time, Intel's crucial manufacturing segment still lacks a major external customer — something it needs to make the cash-bleeding business viable.\n\n\"Intel's exiting the year with some optimism that they will be a relevant chip manufacturer in the US at some point in time ... and that was definitely an uncertain statement at the start of the year,\" MorningStar analyst Brian Colello told Yahoo Finance.\nAt the same time, he noted, \"There wasn't the massive sort of deal that really establishes Intel, either, in manufacturing.\"\n\nThe company's technology is largely responsible for the digital revolution and Silicon Valley's reputation as a global innovation hub: Intel invented the world's first microprocessors, or computer chips, and the x86 architecture, a critical blueprint for designing computer chips. Its co-founder Gordon Moore created Moore's Law, a theory that defined the pace of innovation in the semiconductor industry for more than half a century. The company has continued to make its own computer chips, even as the rest of the industry has gone \"fabless\" — outsourcing manufacturing to firms like Taiwan's TSMC ( TSM ).\n\nBut years of missteps and poor investment decisions put Intel's manufacturing segment behind TSMC, which in turn caused its products to lose their edge to competitors. As its chips — CPUs for servers, laptops, and desktops — have lost market share to rivals AMD and Arm ( ARM ), its manufacturing business has been stripped of the scale it needs to remain viable.\nFour years of an aggressive turnaround effort by former CEO Pat Gelsinger to revive Intel's manufacturing arm by opening it to outside customers sent investors fleeing. The massive amount of spending required to reboot the foundry, along with its uncertain success, spooked Wall Street.\nThe arrival of Lip-Bu Tan , who was named chief executive in March following the board's ousting of Gelsinger in late 2024, began to renew faith in the company's potential turnaround. While Intel's strategy remains mostly unchanged under Tan, analysts explained, investors have applauded his sober tone, cost-cutting measures, and wide-ranging industry connections.\n\nStory Continues\nThat tepid faith transformed into confidence when the US government made a rare $9 billion investment in the company — albeit funds Intel was supposed to get anyway from the Biden-era CHIPS Act — following Tan's tiff with President Trump over the CEO's business ties to China.\nOnshoring semiconductor manufacturing has been a focus of the US government since the pandemic highlighted the risk of a tech supply chain reliant on Taiwan. Escalating tensions with China, including the threat of a Taiwan invasion, have further intensified the sense of urgency.\n\n\"Semiconductors are not only economically important, they're actually important from a national security perspective,\" Technalysis analyst Bob O'Donnell told Yahoo Finance. \"Intel has by far the largest infrastructure in place as a true, real American company.\"\nMany critics believe the broader US turn toward state capitalism under Trump, exemplified by the Intel investment, raises questions about national security and the government's conflicting interests. But analysts say the US government's 10% stake in Intel could lead to various positive outcomes for the company, such as Intel having a say in trade policy that affects semiconductors. More importantly, the US could step in to incentivize or force a major company like Apple to use the chipmaker's foundry.\n\nA $2 billion investment from SoftBank and $5 billion from Nvidia further boosted investor sentiment on Intel stock. The cash infusion helped stem the company's steep losses as it figures out a path forward. Notably, though, the Nvidia deal didn't include an agreement for Intel's foundry business to manufacture the AI giant's chips.\n'Everything hinges on 14A' Intel's biggest potential customers for its foundry business — Nvidia, Apple ( AAPL ), and Qualcomm ( QCOM ) — are also, to some degree, competitors of its products arm and have longstanding relationships with TSMC. Not to mention, TSMC is building $165 billion worth of manufacturing capacity in the US, diminishing the geopolitical argument for those companies to use Intel to produce their chips.\nTo win those customers, Intel will need to prove that its latest generation manufacturing processes are up to snuff. The chipmaker's 18A process, a massive technological feat initially marketed to outside customers, is now being used primarily to make Intel's own products. Whether those products — Intel's upcoming Panther Lake chips for PCs and Clearwater Forest chips for data centers — succeed could help convince companies to use its next-generation processes called 18AP and 14A, analysts said.\n\nAlready, rumors have circulated that Apple could use Intel's manufacturing, specifically its 18AP process, for its lowest-end computer chips.\nIntel has 12 to 18 months to secure a big external customer for 14A in order for that process to continue as planned, BNB Paribas analyst David O'Connor estimated.\nHe called the process \"the crux of Intel being successful on the foundry business or not, or potentially even exiting manufacturing long term.\"\n\"Everything hinges on 14A and the success of that,\" O'Connor said.\nOther analysts gave longer timelines for when Intel would see a turnaround.\nBernstein analyst Stacy Rasgon said, \"It took 10 years to break it. Why would it take less than 10 years to fix it?\"\nLaura Bratton is a reporter for Yahoo Finance. Follow her on Bluesky @laurabratton.bsky.social. Email her at laura.bratton@yahooinc.com.\nClick here for the latest technology news that will impact the stock market\nRead the latest financial and business news from Yahoo Finance\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "20:08:30",
      "Source": "Simply Wall St.",
      "Title": "Is It Too Late To Consider Qualcomm After Its Strong Multi Year Share Price Rally?",
      "URL": "https://finance.yahoo.com/news/too-consider-qualcomm-strong-multi-120830026.html",
      "Content": "Is It Too Late To Consider Qualcomm After Its Strong Multi Year Share Price Rally?\n\nSimply Wall St\nSat, December 20, 2025 at 4:08 AM PST 4 min read\n\nIn this article: QCOM\n\nIf you are wondering whether QUALCOMM is still attractively priced at current levels, or if the easier gains have already been realized, this article will walk through what the numbers indicate about its underlying value.\nDespite a recent 1.7% pullback over the last week, QUALCOMM is still up 5.5% in the past month and has delivered a 14.1% gain year to date, adding to a 69.2% return over three years.\nInvestors have been reacting to a steady stream of headlines around QUALCOMM's position in 5G handsets and infrastructure, as well as its expanding role in automotive and Internet of Things chips. At the same time, ongoing debates about smartphone demand cycles and competition in high performance processors have kept sentiment active rather than complacent.\nRight now QUALCOMM has a 3/6 valuation check score , suggesting it appears undervalued on some metrics but not others. In the next sections we will unpack those methods before circling back to a more comprehensive way to think about what the stock may be worth.\n\nFind out why QUALCOMM's 17.2% return over the last year is lagging behind its peers.\nApproach 1: QUALCOMM Discounted Cash Flow (DCF) Analysis A Discounted Cash Flow model estimates what a business is worth by projecting the cash it can generate in the future and then discounting those cash flows back to today in dollar terms.\nFor QUALCOMM, the 2 Stage Free Cash Flow to Equity model starts with last twelve months free cash flow of about $12.6 billion. Analyst forecasts and Simply Wall St extrapolations see this rising to around $18.4 billion by 2030, with intermediate annual projections gradually stepping higher over the coming decade as the business scales across handsets, automotive, and IoT.\n\nWhen all those future cash flows are discounted back, the model arrives at an estimated intrinsic value of roughly $205.12 per share. Compared with the current share price, this implies QUALCOMM is trading at about a 14.6% discount to its DCF based fair value, which indicates a margin of safety for long term investors rather than a fully priced story.\nResult: UNDERVALUED\nOur Discounted Cash Flow (DCF) analysis suggests QUALCOMM is undervalued by 14.6%. Track this in your watchlist or portfolio , or discover 914 more undervalued stocks based on cash flows .\nHead to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for QUALCOMM.\nApproach 2: QUALCOMM Price vs Earnings For profitable, established businesses like QUALCOMM, the price to earnings ratio is a useful yardstick because it directly links what investors are paying today to the profits the company is generating. Higher expected growth and lower perceived risk usually justify a higher PE, while slower growth or more uncertainty should push a fair PE lower.\n\nStory Continues\nQUALCOMM currently trades on a PE of about 33.6x, slightly below the broader Semiconductor industry average of roughly 36.8x and well below the peer group average of around 65.5x. While these comparisons are helpful context, they do not fully capture QUALCOMM's specific growth profile, margins, scale, and risk.\n\nSimply Wall St's Fair Ratio framework does this by estimating what a reasonable PE should be once factors such as earnings growth, profitability, industry, market cap and risk are considered together. For QUALCOMM, the Fair Ratio is approximately 33.3x, which is very close to its current PE of 33.6x. This suggests the market is pricing the stock in line with its fundamentals rather than offering a clear bargain or demanding a premium.\nResult: ABOUT RIGHT\nPE ratios tell one story, but what if the real opportunity lies elsewhere? Discover 1465 companies where insiders are betting big on explosive growth .\nUpgrade Your Decision Making: Choose your QUALCOMM Narrative Earlier we mentioned that there is an even better way to understand valuation, so let us introduce you to Narratives, which are simply your story about a company, translated into numbers like fair value, future revenue, earnings and margins. A Narrative links what you believe about QUALCOMM's business, such as edge AI leadership, smartphone cycles, or automotive growth, to an explicit financial forecast and then to a clear fair value estimate, so you can see how your view compares with the current share price. On Simply Wall St, Narratives are an easy, guided tool within the Community page, used by millions of investors, that help you compare your view of Fair Value to today’s Price and understand the potential upside or downside you are assuming. They also update dynamically as new information like earnings, news, or guidance arrives, so your story and valuation stay current without manual rework. For example, one QUALCOMM Narrative might see fair value near $300 with strong AI driven growth, while a more cautious Narrative might sit closer to $192 with modest growth and higher risk, giving you a concrete range to anchor your own view.\nDo you think there's more to the story for QUALCOMM? Head over to our Community to see what others are saying!\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include QCOM .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "20:08:00",
      "Source": "MarketBeat",
      "Title": "Qualcomm’s Monster Rally Has a Catch—Can the Stock Keep Climbing?",
      "URL": "https://finance.yahoo.com/m/b9144804-0456-3252-b853-4b2fef1f5b42/qualcomm%E2%80%99s-monster-rally-has.html",
      "Content": "Qualcomm’s Monster Rally Has a Catch—Can the Stock Keep Climbing?\n\nSam Quirke, MarketBeat\nFri, December 19, 2025 at 4:08 AM PST 4 min read\n\nIn this article: QCOM\n\nNVDA\n\nKey Points Qualcomm is on track to close out 2025 on strong footing, with its multi-month rally continuing to grind higher.\nBut that also means its P/E ratio is now at the highest level in more than ten years.\nHeading into 2026, investors are right to question whether this signals a bullish re-rating or a bearish warning.\nInterested in QUALCOMM Incorporated? Here are five stocks we like better.\n\nShares of Qualcomm Inc. (NASDAQ: QCOM) were trading just over $176 on the morning of Dec. 18, extending a run that has been easy to overlook in a market obsessed with mega-cap tech and artificial intelligence leaders. The stock is up about 12% year-to-date and more than 40% since April, marking one of Qualcomm’s strongest years in recent memory after a long stretch of underperformance versus peers.\nWhat has investors paying closer attention to now as we head into the final few sessions of the year is not just the price action, but the valuation that has come with it. Qualcomm’s price-to-earnings (P/E) ratio has climbed to levels not seen in more than a decade. Sometimes that kind of move is a warning sign that expectations are getting ahead of reality.\n\n→ Forget the Chips: 4 Industrial Plays for the AI Rebound\nOther times, it reflects a meaningful shift in how the market views a company’s future. For those of us on the sidelines and thinking about building a position in Qualcomm into 2026, that distinction matters. Let’s jump in and see what it could be, either a good sign or a red flag.\nWhy a Rising Valuation Can Be a Bullish Sign For much of the past decade, Qualcomm traded at a persistent discount relative to peers. As we flagged earlier this year, its P/E ratio of just 15 looked very attractive when compared to the likes of NVIDIA Corp (NASDAQ: NVDA) , which had a P/E ratio closer to 50. Qualcomm’s historical reliance on the smartphone cycle, periodic royalty disputes, and sluggish share price sanctions always seemed to keep a lid on its multiple, even during the broad semiconductor rally—his context matters when interpreting today’s higher valuation.\n\n→ 3 Cheap Dividend Stocks That Can Beat Inflation and Pay You to Wait\nThe recent jump suggests the market is starting to look at, and therefore to price, Qualcomm differently. Rather than viewing it purely as a handset-driven name, investors seem to be increasingly recognizing the benefits of a more diversified revenue mix. Automotive, IoT, and edge computing exposure have helped transform the market’s perception of the brand and build excitement about fresh long-term growth potential.\n\nStory Continues\nThis has been reflected in the stock’s sustained rally since April—while it mightn’t be winning awards for speed or scale anytime soon, it’s actually been one of Qualcomm’s most sustained moves in a long time. When viewed through this lens, a decade-high valuation can be interpreted less as a potential ceiling and more as confirmation that the market is reassessing what Qualcomm deserves to trade at.\n\n→ Post 35% Surge, Analysts Eye More Upside in Copper Giant Freeport\nWhy a Decade-High Multiple Still Deserves Scrutiny That said, a valuation that has more than doubled in just a few months has to come with a bit of risk, too. The higher stock price and underlying P/E ratio have raised the bar for execution, meaning Qualcomm can’t afford any slips heading into 2026’s earnings reports. The fact that it’s no longer priced as a deep-value laggard means any earnings stumble would likely be met with a good deal of investor panic.\n\nRecent analyst commentary reflects this. Just this week, the team at Cantor Fitzgerald reiterated its Neutral rating on the stock, urging caution around chasing it after the recent run. At the same time, the fact that Qualcomm is still trading well below its $185 price target suggests even more conservative analysts still see some upside from current levels.\nCountering this view are the more bullish updates in recent weeks that remain firmly intact. Both Cowen and Susquehanna have reiterated Buy or equivalent ratings in the past month, with Susquehanna’s $210 price target implying potential upside of 20% from current levels.\nDiverging Views Signal a Pivotal Year for Qualcomm in 2026 The split in analyst opinion is interesting and telling. Qualcomm’s bears are not exactly calling for a ton of downside so much as arguing that the stock is fairly valued, if not a bit undervalued, right now.\nThe bulls will counter that the ongoing multiple expansion is more than justified, and it’s high time Qualcomm’s shares start to log these multi-month rallies that have been the norm with their peers.\nEither way, 2026 is shaping up to be a pivotal year for Qualcomm, and one that investors will want to stay closely tuned into.\nThe article \" Qualcomm’s Monster Rally Has a Catch—Can the Stock Keep Climbing? \" was originally published by MarketBeat.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "18:22:03",
      "Source": "Verdict",
      "Title": "Qualcomm wraps up $2.4bn acquisition of Alphawave Semi",
      "URL": "https://finance.yahoo.com/m/43cbdd7e-ade6-3e92-8eb9-4efca27f4eaf/qualcomm-wraps-up-%242.4bn.html",
      "Content": "Qualcomm wraps up $2.4bn acquisition of Alphawave Semi\n\nRanjithKumar Dharma\nFri, December 19, 2025 at 2:22 AM PST 2 min read\n\nIn this article: QCOM\n\nQualcomm has concluded the acquisition of Alphawave Group, known as Alphawave Semi, for an implied enterprise value of around $2.4bn (£1.79bn).\nThe company reported that the transaction was completed a quarter ahead of schedule.\nAnnounced in June 2025, the deal was originally expected to close in the first quarter of 2026.\n\nTony Pialis, CEO and co-founder of Alphawave Semi, will lead Qualcomm’s data centre business.\nPialis said: “Joining Qualcomm marks an exciting new chapter for Alphawave Semi.\n“We are ready to bring our leadership in high-speed connectivity and custom silicon to help shape the future of data centre innovation.”\nAccording to Qualcomm, the acquisition is intended to provide key assets for its strategy to expand into data centres.\nThe company noted that its Oryon CPU and Hexagon NPU processors are positioned to address growing demand in high-performance, low-power computing, which is linked to increased AI inferencing and a move towards custom central processing units (CPUs) in data centres.\nAlphawave Semi develops high-speed wired connectivity and compute technologies. These include IP, custom silicon, connectivity products, and chiplets aimed at improving data transfer performance, reliability and power efficiency.\n\nIts products are used as part of infrastructure supporting next-generation services across applications such as data centres, AI, data networking and data storage.\nQualcomm president and CEO Cristiano Amon said: “Alphawave Semi’s expertise in high-speed connectivity technologies complements our Qualcomm Oryon CPU and Hexagon NPU [neural processing unit] processors.\n“Qualcomm delivers high-performance, energy-efficient compute and AI solutions, and the addition of Alphawave’s technologies will strengthen our platforms and optimise performance for next-generation AI data centres.”\nEarlier this month, Qualcomm announced its acquisition of Ventana Micro Systems.\nThe acquisition is expected to support Qualcomm’s work on the RISC-V standard and ecosystem, and to enhance its CPU capabilities by adding Ventana’s expertise in RISC-V ISA development.\n\nVentana’s team is expected to work alongside Qualcomm’s existing RISC-V initiatives and its custom Oryon CPU development, with the aim of advancing AI-related technology across the company’s businesses.\n\"Qualcomm wraps up $2.4bn acquisition of Alphawave Semi\" was originally created and published by Verdict , a GlobalData owned brand.\n\nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "06:45:07",
      "Source": "Zacks",
      "Title": "Qualcomm (QCOM) Surpasses Market Returns: Some Facts Worth Knowing",
      "URL": "https://finance.yahoo.com/news/qualcomm-qcom-surpasses-market-returns-224507025.html",
      "Content": "Qualcomm (QCOM) Surpasses Market Returns: Some Facts Worth Knowing\n\nZacks Equity Research\nThu, December 18, 2025 at 2:45 PM PST 3 min read\n\nIn this article: QCOM\n\n^GSPC\n\n^DJI\n\n^IXIC\n\nIn the latest trading session, Qualcomm (QCOM) closed at $174.19, marking a +1.07% move from the previous day. The stock's change was more than the S&P 500's daily gain of 0.79%. Elsewhere, the Dow gained 0.14%, while the tech-heavy Nasdaq added 1.38%.\nShares of the chipmaker have appreciated by 3.75% over the course of the past month, outperforming the Computer and Technology sector's loss of 0.85%, and the S&P 500's gain of 0.87%.\n\nThe investment community will be paying close attention to the earnings performance of Qualcomm in its upcoming release. It is anticipated that the company will report an EPS of $3.38, marking a 0.88% fall compared to the same quarter of the previous year. Our most recent consensus estimate is calling for quarterly revenue of $12.25 billion, up 4.99% from the year-ago period.\nLooking at the full year, the Zacks Consensus Estimates suggest analysts are expecting earnings of $12.15 per share and revenue of $45.69 billion. These totals would mark changes of +1% and +3.52%, respectively, from last year.\nAdditionally, investors should keep an eye on any recent revisions to analyst forecasts for Qualcomm. These recent revisions tend to reflect the evolving nature of short-term business trends. As a result, upbeat changes in estimates indicate analysts' favorable outlook on the business health and profitability.\n\nOur research reveals that these estimate alterations are directly linked with the stock price performance in the near future. To exploit this, we've formed the Zacks Rank, a quantitative model that includes these estimate changes and presents a viable rating system.\nThe Zacks Rank system, ranging from #1 (Strong Buy) to #5 (Strong Sell), possesses a remarkable history of outdoing, externally audited, with #1 stocks returning an average annual gain of +25% since 1988. The Zacks Consensus EPS estimate has moved 0.07% higher within the past month. Qualcomm is currently sporting a Zacks Rank of #3 (Hold).\nFrom a valuation perspective, Qualcomm is currently exchanging hands at a Forward P/E ratio of 14.19. This indicates a discount in contrast to its industry's Forward P/E of 32.69.\n\nInvestors should also note that QCOM has a PEG ratio of 3.09 right now. The PEG ratio is akin to the commonly utilized P/E ratio, but this measure also incorporates the company's anticipated earnings growth rate. The Electronics - Semiconductors was holding an average PEG ratio of 1.83 at yesterday's closing price.\nThe Electronics - Semiconductors industry is part of the Computer and Technology sector. Currently, this industry holds a Zacks Industry Rank of 75, positioning it in the top 31% of all 250+ industries.\n\nStory Continues\nThe Zacks Industry Rank evaluates the power of our distinct industry groups by determining the average Zacks Rank of the individual stocks forming the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nBe sure to use Zacks.com to monitor all these stock-influencing metrics, and more, throughout the forthcoming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "05:52:29",
      "Source": "Yahoo Finance Video",
      "Title": "AI trade is helping build out the 'next new economy': Strategist",
      "URL": "https://finance.yahoo.com/video/ai-trade-helping-build-next-215229607.html",
      "Content": "AI trade is helping build out the 'next new economy': Strategist\n\nYahoo Finance Video and Josh Lipton\nThu, December 18, 2025 at 1:52 PM PST\n\nIn this video: QCOM\n\nNVDA\n\nAMZN\n\nGOOG\n\nTXN\n\nAs the AI boom continues, investors hedge their bets on what's next for the AI trade as companies spend trillions building out AI infrastructure. Pence Capital Management CIO Dryden Pence sits down with Market Domination Host Josh Lipton to talk about his expectations for the AI space.\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination .\n\nVideo Transcript\n\n00:00 Speaker A\nbroadly when you look at that AI trade, you see some evidence that maybe investors are getting a little some jitters are popping up, some nerves.\n00:07 Speaker A\nBut then you see the companies drawing like I my micron earnings after the bell. I did a double take on that guidance. I thought I had been reading it wrong, right? It was that much of a beat. That thing reported and surged and it's this story of demand strong, supply tight. I'm just curious what you make of that.\n00:23 Speaker B\nWe are in the we're in the infrastructure\n00:30 Speaker B\nbuilding period\n00:32 Speaker B\nof the next new economy. This is like the transcontinental railroad, which transformed our entire economy uh with transportation stuff, you know, back in the 1870s.\n00:43 Speaker B\nSo when you look at right now, we're spending a tremendous amount of money, not all the companies are going to be winners. You got to look at it one by one. But\n00:51 Speaker B\nwhen you recognize the amount of capital that's going into this, we're just in the early stages. We're in the infrastructure stage.\n00:58 Speaker B\nWhat's going to happen when we go to the implementation stage where companies are now going to use this AI technology and all of this infrastructure to increase labor productivity and and and jobs. That's that's really going to push earnings not just for the Mac 7,\n01:11 Speaker B\nbut for the entire economy.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "04:12:03",
      "Source": "StockStory",
      "Title": "Marvell Technology (MRVL) Stock Is Up, What You Need To Know",
      "URL": "https://finance.yahoo.com/news/marvell-technology-mrvl-stock-know-201203934.html",
      "Content": "Marvell Technology (MRVL) Stock Is Up, What You Need To Know\n\nPetr Huřťák\nThu, December 18, 2025 at 12:12 PM PST 2 min read\n\nIn this article: MRVL\n\nTSM\n\nMU\n\nQCOM\n\nINTC\n\nWhat Happened? Shares of networking chips designer Marvell Technology (NASDAQ: MRVL) jumped 3.2% in the afternoon session after positive results from peer company Micron lifted the broader semiconductor sector.\nThe strong report created a ripple effect, boosting sentiment for chip-related companies. Marvell climbed alongside other industry players, as firms connected to memory and storage saw some of the most notable gains. For instance, Taiwan Semiconductor Manufacturing, Intel, Broadcom, and Qualcomm all recorded increases. The move highlighted investor optimism across the semiconductor space, reinforcing the view that companies like Marvell, which are key to AI infrastructure, were well-positioned.\n\nAfter the initial pop the shares cooled down to $84.30, up 3.1% from previous close.\nIs now the time to buy Marvell Technology? Access our full analysis report here .\nWhat Is The Market Telling Us Marvell Technology’s shares are extremely volatile and have had 42 moves greater than 5% over the last year. In that context, today’s move indicates the market considers this news meaningful but not something that would fundamentally change its perception of the business.\nThe previous big move we wrote about was 7 days ago when the stock dropped 3.8% on the news that reports revealed that China is moving to substitute US technology by adding domestic AI chips to its government procurement list.\n\nThis development is part of a broader \"buy local\" campaign aimed at reducing China's reliance on foreign technology, particularly from the United States, amid persistent trade and tech tensions. The Chinese government has updated its guidelines to include AI chips from homegrown companies like Huawei and Cambricon. This policy shift effectively steers government and state-affiliated buyers away from American semiconductor firms. For US chipmakers, this signals a potential loss of market share in one of the world's largest tech markets, raising concerns among investors about future revenue streams from the region.\nMarvell Technology is down 25.8% since the beginning of the year, and at $84.30 per share, it is trading 33.1% below its 52-week high of $126.06 from January 2025. Investors who bought $1,000 worth of Marvell Technology’s shares 5 years ago would now be looking at an investment worth $1,774.\nWhile Wall Street chases Nvidia at all-time highs, an under-the-radar semiconductor supplier is dominating a critical AI component these giants can’t build without. Click here to access our full research report .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "01:34:57",
      "Source": "GuruFocus.com",
      "Title": "Qualcomm Stock Rises After $2.4 Billion Alphawave Semi Deal",
      "URL": "https://finance.yahoo.com/news/qualcomm-stock-rises-2-4-173457920.html",
      "Content": "Qualcomm Stock Rises After $2.4 Billion Alphawave Semi Deal\n\nNauman Khan\nThu, December 18, 2025 at 9:34 AM PST 1 min read\n\nIn this article: QCOM\n\nAWEVF\n\nThis article first appeared on GuruFocus .\nQualcomm ( NASDAQ:QCOM ) shares rose about 2% on Thursday morning following the completion of its $2.4 billion acquisition of British semiconductor firm Alphawave Semi.\nThe deal strengthens Qualcomm's capabilities in high-speed connectivity and complements its Oryon CPU and Hexagon NPU processors. CEO Cristiano Amon said Alphawave's technologies will enhance performance and efficiency for next-generation AI data centers.\n\nWarning! GuruFocus has detected 7 Warning Signs with QCOM.\nIs QCOM fairly valued? Test your thesis with our free DCF calculator.\nTony Pialis, Alphawave's co-founder and CEO, will lead Qualcomm's data center business. Qualcomm first announced its intent to acquire Alphawave in June, citing the need to expand further into enterprise and AI markets.\nAlphawave specializes in serializer-deserializer technology, which determines the speed at which information moves on and off chipsa key factor for large-scale AI workloads requiring multiple chips to operate in tandem.\nThe acquisition is expected to boost Qualcomm's position in AI and data center solutions while leveraging Alphawave's high-speed wired connectivity. Analysts say the move signals Qualcomm's continued focus on next-generation compute and AI infrastructure.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:10:06",
      "Source": "MT Newswires",
      "Title": "Sector Update: Tech Stocks Rise Premarket Thursday",
      "URL": "https://finance.yahoo.com/news/sector-tech-stocks-rise-premarket-141006424.html",
      "Content": "PREMIUM\nSector Update: Tech Stocks Rise Premarket Thursday\n\nMT Newswires\nThu, December 18, 2025 at 6:10 AM PST 1 min read\n\nIn this article: XSD\n\nMU\n\nXLK\n\nQCOM\n\nERIC\n\nTechnology stocks were rising premarket Thursday, with the State Street Technology Select Sector SPD\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "19:24:42",
      "Source": "MT Newswires",
      "Title": "Qualcomm Completes Acquisition of Alphawave Ahead of Schedule",
      "URL": "https://finance.yahoo.com/news/qualcomm-completes-acquisition-alphawave-ahead-112442079.html",
      "Content": "PREMIUM\nQualcomm Completes Acquisition of Alphawave Ahead of Schedule\n\nMT Newswires\nThu, December 18, 2025 at 3:24 AM PST\n\nIn this article: QCOM\n\nAWEVF\n\nQualcomm (QCOM) said Thursday it has completed the acquisition of Alphawave IP roughly a quarter ahe\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "18:20:00",
      "Source": "Business Wire",
      "Title": "Qualcomm Completes Acquisition of Alphawave Semi",
      "URL": "https://finance.yahoo.com/news/qualcomm-completes-acquisition-alphawave-semi-102000780.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nQualcomm Completes Acquisition of Alphawave Semi\n\nBusiness Wire\nThu, December 18, 2025 at 2:20 AM PST 2 min read\n\nIn this article: QCOM\n\nAWEVF\n\nAlphawave Semi’s High-Speed Wired Connectivity Complements Qualcomm’s Next Generation Qualcomm Oryon CPU and Qualcomm Hexagon NPU Processors\nThe combination of Qualcomm and Alphawave Semi creates a leading player in AI compute and connectivity solutions for a wide array of high growth areas, including data center\n\nSAN DIEGO, December 18, 2025 --( BUSINESS WIRE )--Qualcomm Incorporated (NASDAQ: QCOM) today announced that it has completed its acquisition of Alphawave IP Group plc (AWE.L) (\"Alphawave Semi\"), approximately one quarter ahead of schedule. The acquisition of Alphawave Semi aims to further accelerate and provide key assets for Qualcomm’s expansion into the data center. Tony Pialis, CEO and co-founder of Alphawave Semi, will lead the Qualcomm data center business.\n\"Alphawave Semi’s expertise in high-speed connectivity technologies complements our Qualcomm Oryon CPU and Hexagon NPU processors,\" said Cristiano Amon, President and CEO of Qualcomm Incorporated. \"Qualcomm delivers high-performance, energy-efficient compute and AI solutions, and the addition of Alphawave’s technologies will strengthen our platforms and optimize performance for next-generation AI data centers.\"\n\n\"Joining Qualcomm marks an exciting new chapter for Alphawave Semi,\" Pialis said. \"We’re ready to bring our leadership in high-speed connectivity and custom silicon to help shape the future of data center innovation.\"\nAlphawave Semi is a global leader in high-speed wired connectivity delivering custom silicon, connectivity products and chiplets that drive faster, more reliable data transfer with higher performance and lower power consumption. Alphawave Semi’s products form a part of the core infrastructure enabling next-generation services in a wide array of high growth areas, including data centers, AI, data networking and data storage.\nThe full announcement can be found on our website at: https://investor.qualcomm.com/update-details/update-details-offer .\n\nAbout Qualcomm\nQualcomm relentlessly innovates to deliver intelligent computing everywhere, helping the world tackle some of its most important challenges. Building on our 40 years of technology leadership in creating era-defining breakthroughs, we deliver a broad portfolio of solutions built with our leading-edge AI, high-performance, low-power computing, and unrivaled connectivity. Our Snapdragon® platforms power extraordinary consumer experiences, and our Qualcomm Dragonwing™ products empower businesses and industries to scale to new heights. Together with our ecosystem partners, we enable next-generation digital transformation to enrich lives, improve businesses, and advance societies. At Qualcomm, we are engineering human progress.\n\nStory continues\nQualcomm Incorporated includes our licensing business, QTL, and the vast majority of our patent portfolio. Qualcomm Technologies, Inc., a subsidiary of Qualcomm Incorporated, operates, along with its subsidiaries, substantially all of our engineering and research and development functions and substantially all of our products and services businesses, including our QCT semiconductor business. Snapdragon and Qualcomm branded products are products of Qualcomm Technologies, Inc. and/or its subsidiaries. Qualcomm patents are licensed by Qualcomm Incorporated.\nQualcomm, Snapdragon, Qualcomm Dragonwing, Qualcomm Oryon, and Hexagon are trademarks or registered trademarks of Qualcomm Incorporated.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251218292351/en/\nContacts\nContact Information:\nMauricio Lopez-Hodoyan\nInvestor Relations\n1-858-658-4813\nir@qualcomm.com\nClare Conley\nMedia Relations\n1-858-845-5959\ncorpcomm@qualcomm.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "05:08:50",
      "Source": "Simply Wall St.",
      "Title": "Evaluating Qualcomm (QCOM)’s Valuation After Its Recent Multi-Month Share Price Gains",
      "URL": "https://finance.yahoo.com/news/evaluating-qualcomm-qcom-valuation-recent-210850349.html",
      "Content": "Evaluating Qualcomm (QCOM)’s Valuation After Its Recent Multi-Month Share Price Gains\n\nSimply Wall St\nWed, December 17, 2025 at 1:08 PM PST 2 min read\n\nIn this article: QCOM\n\nQUALCOMM (QCOM) has quietly added about 1% over the past month and 7% in the past 3 months, even as its latest annual revenue and net income growth reshape how investors think about its earnings power.\nSee our latest analysis for QUALCOMM.\nZooming out, QUALCOMM’s roughly 15% year to date share price return and robust three year total shareholder return above 65% suggest momentum is still building as investors lean into its wireless and AI exposure.\n\nIf QUALCOMM’s recent move has you thinking about what else is gaining traction in chips and automation, now is a good time to explore high growth tech and AI stocks .\nWith shares hovering below analyst targets and trading at a modest intrinsic discount despite solid revenue and net income growth, are investors overlooking QUALCOMM’s next leg of AI driven upside or already fully pricing in its future earnings power?\nMost Popular Narrative Narrative: 8.2% Undervalued With QUALCOMM closing at $176.12 versus a most popular narrative fair value near $191.80, the story leans toward upside if its assumptions hold.\nRead the complete narrative.\nWant to see what powers that valuation gap? The narrative leans on steady top line gains, resilient margins, and a richer earnings multiple. Curious which projections really move the needle?\nResult: Fair Value of $191.80 (UNDERVALUED)\nHave a read of the narrative in full and understand what's behind the forecasts.\n\nHowever, execution missteps in Qualcomm’s ambitious AI and data center push, or renewed regulatory pressure on its licensing model, could quickly erode that perceived valuation gap.\nFind out about the key risks to this QUALCOMM narrative.\nBuild Your Own QUALCOMM Narrative If you see the story differently or want to dig into the numbers yourself, you can build a custom narrative in just a few minutes: Do it your way .\nA great starting point for your QUALCOMM research is our analysis highlighting 3 key rewards and 1 important warning sign that could impact your investment decision.\n\nLooking for more investment ideas? Step up your research game and use the Simply Wall St Screener to spot fresh opportunities before the crowd, so you are not left watching from the sidelines.\nExplore early stage opportunities by reviewing these 3636 penny stocks with strong financials that combine lower share prices with relatively strong financial profiles.\nResearch the next wave of automation leaders through these 26 AI penny stocks focused on companies developing real world AI products and platforms.\nSeek steadier portfolio income by assessing these 13 dividend stocks with yields > 3% that aim to balance yield with sustainable payout ratios.\n\nStory Continues\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include QCOM .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "21:16:00",
      "Source": "GlobeNewswire",
      "Title": "Form 8.3 - Qualcomm Incorporated",
      "URL": "https://finance.yahoo.com/news/form-8-3-qualcomm-incorporated-131600565.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nForm 8.3 - Qualcomm Incorporated\n\nSculptor Capital LP\nWed, December 17, 2025 at 5:16 AM PST 3 min read\n\nIn this article: QCOM\n\nFORM 8.3\nPUBLIC OPENING POSITION DISCLOSURE/DEALING DISCLOSURE BY\nA PERSON WITH INTERESTS IN RELEVANT SECURITIES REPRESENTING 1% OR MORE\nRule 8.3 of the Takeover Code (the “Code”)\n1. KEY INFORMATION\n(a) Full name of discloser:\nSculptor Capital LP and\nSculptor Capital Management Europe Limited\n(b) Owner or controller of interests and short positions disclosed, if different from 1(a):\nThe naming of nominee or vehicle companies is insufficient. For a trust, the trustee(s), settlor and beneficiaries must be named.\n(c) Name of offeror/offeree in relation to whose relevant securities this form relates:\nUse a separate form for each offeror/offeree\nQualcomm Incorporated\n(d) If an exempt fund manager connected with an offeror/offeree, state this and specify identity of offeror/offeree:\n(e) Date position held/dealing undertaken:\nFor an opening position disclosure, state the latest practicable date prior to the disclosure\n16 December 2025\n(f) In addition to the company in 1(c) above, is the discloser making disclosures in respect of any other party to the offer?\nIf it is a cash offer or possible cash offer, state “N/A”\nYes, Alphawave IP Group plc\n\n2. POSITIONS OF THE PERSON MAKING THE DISCLOSURE\nIf there are positions or rights to subscribe to disclose in more than one class of relevant securities of the offeror or offeree named in 1(c), copy table 2(a) or (b) (as appropriate) for each additional class of relevant security.\n(a) Interests and short positions in the relevant securities of the offeror or offeree to which the disclosure relates following the dealing (if any)\nClass of relevant security:\n\n1p ordinary (US7475251036)\n\nInterests\nShort positions\nNumber\n%\nNumber\n%\n(1) Relevant securities owned and/or controlled:\n(2) Cash-settled derivatives:\n\n68,500\n0.01\n(3) Stock-settled derivatives (including options) and agreements to purchase/sell:\n\nTOTAL:\n68,500\n0.01\n\nAll interests and all short positions should be disclosed.\nDetails of any open stock-settled derivative positions (including traded options), or agreements to purchase or sell relevant securities, should be given on a Supplemental Form 8 (Open Positions).\n(b) Rights to subscribe for new securities (including directors’ and other employee options)\nClass of relevant security in relation to which subscription right exists:\nDetails, including nature of the rights concerned and relevant percentages:\n\n3. DEALINGS (IF ANY) BY THE PERSON MAKING THE DISCLOSURE\nWhere there have been dealings in more than one class of relevant securities of the offeror or offeree named in 1(c), copy table 3(a), (b), (c) or (d) (as appropriate) for each additional class of relevant security dealt in.\n\nStory Continues\nThe currency of all prices and other monetary amounts should be stated.\n(a) Purchases and sales\nClass of relevant security\nPurchase/sale\n\nNumber of securities\nPrice per unit\n\n(b) Cash-settled derivative transactions\nClass of relevant security\nProduct description\ne.g. CFD\nNature of dealing\ne.g. opening/closing a long/short position, increasing/reducing a long/short position\nNumber of reference securities\nPrice per unit\n1p ordinary (US7475251036)\nCFD\nIncreasing a short position\n9,260\nUSD176.87\n1p ordinary (US7475251036)\nCFD\nIncreasing a short position\n22,160\nUSD176.76\n\n(c) Stock-settled derivative transactions (including options)\n(i) Writing, selling, purchasing or varying\nClass of relevant security\nProduct description e.g. call option\nWriting, purchasing, selling, varying etc.\nNumber of securities to which option relates\nExercise price per unit\nType\ne.g. American, European etc.\nExpiry date\nOption money paid/ received per unit\n\n(ii) Exercise\nClass of relevant security\nProduct description\ne.g. call option\nExercising/ exercised against\nNumber of securities\nExercise price per unit\n\n(d) Other dealings (including subscribing for new securities)\nClass of relevant security\nNature of dealing\ne.g. subscription, conversion\nDetails\nPrice per unit (if applicable)\n\n4. OTHER INFORMATION\n(a) Indemnity and other dealing arrangements\nDetails of any indemnity or option arrangement, or any agreement or understanding, formal or informal, relating to relevant securities which may be an inducement to deal or refrain from dealing entered into by the person making the disclosure and any party to the offer or any person acting in concert with a party to the offer:\nIrrevocable commitments and letters of intent should not be included. If there are no such agreements, arrangements or understandings, state “none”\n\n(b) Agreements, arrangements or understandings relating to options or derivatives\nDetails of any agreement, arrangement or understanding, formal or informal, between the person making the disclosure and any other person relating to:\n(i) the voting rights of any relevant securities under any option; or\n(ii) the voting rights or future acquisition or disposal of any relevant securities to which any derivative is referenced:\nIf there are no such agreements, arrangements or understandings, state “none”\n\n(c) Attachments\nIs a Supplemental Form 8 (Open Positions) attached?\nNO\n\nDate of disclosure:\n17 December 2025\nContact name:\nSculptor UK Compliance uk_compliance@sculptor.com\nTelephone number*:\n020 7758 4478\n\nPublic disclosures under Rule 8 of the Code must be made to a Regulatory Information Service.\nThe Panel’s Market Surveillance Unit is available for consultation in relation to the Code’s disclosure requirements on +44 (0)20 7638 0129.\n*If the discloser is a natural person, a telephone number does not need to be included, provided contact information has been provided to the Panel’s Market Surveillance Unit.\nThe Code can be viewed on the Panel’s website at www.thetakeoverpanel.org.uk .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "12:32:24",
      "Source": "StockStory",
      "Title": "2 S&P 500 Stocks with Promising Prospects and 1 We Ignore",
      "URL": "https://finance.yahoo.com/news/2-p-500-stocks-promising-043224401.html",
      "Content": "2 S&P 500 Stocks with Promising Prospects and 1 We Ignore\n\nAnthony Lee\nTue, December 16, 2025 at 8:32 PM PST 4 min read\n\nIn this article: ^GSPC\n\nBX\n\nQCOM\n\nHPQ\n\nThe S&P 500 (^GSPC) is home to the biggest and most well-known companies in the market, making it a go-to index for investors seeking stability. But not all large-cap stocks are created equal - some are struggling with slowing growth, declining margins, or increased competition.\nSome large-cap stocks are past their peak, and StockStory is here to help you separate the winners from the laggards. That said, here are two S&P 500 stocks positioned to outperform and one best left off your watchlist.\n\nOne Stock to Sell: HP (HPQ) Market Cap: $22.79 billion\nBorn from the legendary Silicon Valley garage startup founded by Bill Hewlett and Dave Packard in 1939, HP (NYSE:HPQ) designs and sells personal computers, printers, and related technology products and services to consumers, businesses, and enterprises worldwide.\nWhy Should You Dump HPQ?\n\nFlat sales over the last five years suggest it must find different ways to grow during this cycle\nIncremental sales over the last two years were much less profitable as its earnings per share fell by 2.8% annually while its revenue grew\n4.1 percentage point decline in its free cash flow margin over the last five years reflects the company’s increased investments to defend its market position\nHP’s stock price of $24.78 implies a valuation ratio of 8x forward P/E. Dive into our free research report to see why there are better opportunities than HPQ .\nTwo Stocks to Watch: Qualcomm (QCOM) Market Cap: $187.6 billion\nHaving been at the forefront of developing the standards for cellular connectivity for over four decades, Qualcomm (NASDAQ:QCOM) is a leading innovator and a fabless manufacturer of wireless technology chips used in smartphones, autos and internet of things appliances.\nWhy Could QCOM Be a Winner?\n\nAnnual revenue growth of 15.3% over the past five years was outstanding, reflecting market share gains this cycle\nQCOM is a free cash flow machine with the flexibility to invest in growth initiatives or return capital to shareholders, and its recently improved profitability means it has even more resources to invest or distribute\nIndustry-leading 47% return on capital demonstrates management’s skill in finding high-return investments\nQualcomm is trading at $175.55 per share, or 14.9x forward P/E. Is now the right time to buy? Find out in our full research report, it’s free for active Edge members .\nBlackstone (BX) Market Cap: $119 billion\nWith over $1 trillion in assets under management and investments spanning real estate, private equity, credit, and hedge funds, Blackstone (NYSE:BX) is a global alternative asset manager that invests capital on behalf of pension funds, sovereign wealth funds, and other institutional investors.\n\nStory Continues\nWhy Are We Backing BX?\nAnnual revenue growth of 19.2% over the last five years was superb and indicates its market share increased during this cycle\nFee-related earnings improved by 22.7% annually over the last five years as it eliminated redundant costs\nEarnings per share grew by 19.7% annually over the last five years and easily exceeded the peer group average\n\nAt $152.51 per share, Blackstone trades at 24.6x forward P/E. Is now a good time to buy? See for yourself in our in-depth research report, it’s free for active Edge members .\nStocks We Like Even More If your portfolio success hinges on just 4 stocks, your wealth is built on fragile ground. You have a small window to secure high-quality assets before the market widens and these prices disappear.\nDon’t wait for the next volatility shock. Check out our Top 6 Stocks for this week . This is a curated list of our High Quality stocks that have generated a market-beating return of 244% over the last five years (as of June 30, 2025).\nStocks that made our list in 2020 include now familiar names such as Nvidia (+1,326% between June 2020 and June 2025) as well as under-the-radar businesses like the once-small-cap company Comfort Systems (+782% five-year return). Find your next big winner with StockStory today for free . Find your next big winner with StockStory today . Find your next big winner with StockStory today .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "08:09:43",
      "Source": "Morningstar Research",
      "Title": "Analyst Report: Arm Holdings plc",
      "URL": "https://finance.yahoo.com/m/31edc9e6-490d-3964-a785-cecc769e369b/analyst-report%3A-arm-holdings.html",
      "Content": "Analyst Report: Arm Holdings plc\n\nMorningstar Research\nTue, December 16, 2025 at 4:09 PM PST 1 min read\n\nIn this article: ARM\n\nAAPL\n\nQCOM\n\nArm Holdings is the IP owner and developer of the ARM architecture, which is used in 99% of the world’s smartphone CPU cores, and it also has high market share in other battery-powered devices like wearables, tablets, or sensors. Arm licenses its architecture for a fee, offering different types of licenses depending on the flexibility the customer needs. Customers like Apple or Qualcomm buy architectural licenses, which allow them to modify the architecture and add or delete instructions to tailor the chips to their specific needs. Other clients directly buy off-the-shelf designs from Arm. Both off-the-shelf and architectural customers pay a royalty fee per chip shipped.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "01:39:00",
      "Source": "Zacks",
      "Title": "ARM Stock Declines 13% in a Year: Should You Buy the Dip?",
      "URL": "https://finance.yahoo.com/news/arm-stock-declines-13-buy-173900053.html",
      "Content": "ARM Stock Declines 13% in a Year: Should You Buy the Dip?\n\nShuvra Shankar Dey\nTue, December 16, 2025 at 9:39 AM PST 3 min read\n\nIn this article: ARM\n\nShares of Arm Holdings plc ARM have declined 13% over the past year against the industry’s 36% growth. The decline raises a key question: will the fall continue, or is a rebound imminent? Let’s unpack the factors that you must look through before making an investment decision.\nImage Source: Zacks Investment Research\nARM’s Dual-Sided Network Effect Reinforces Its Leadership ARM’s competitive edge rests on a powerful dual-sided network effect that links software creators and hardware makers in a self-reinforcing loop.\nThe company’s architecture has become the default choice for device manufacturers because it already supports a massive universe of applications across Android, iOS, Windows and Linux ecosystems. This existing software breadth gives hardware producers confidence that chips based on ARM’s designs will integrate smoothly with global tools, platforms and services, making adoption a low-risk, high-benefit decision.\n\nOn the other side, developers are drawn to ARM because their applications immediately gain reach across an enormous installed base of devices. Every new hardware partner expands ARM’s footprint further, strengthening the incentive for developers to keep building for the platform. This creates a flywheel effect: more developers attract more manufacturers, which then bring in even more developers. Over time, this reinforcing cycle has grown into a deep moat that competitors struggle to penetrate.\nThis network-driven advantage has led to an extraordinary outcome. ARM effectively controls mobile CPU architecture. With its IP embedded in nearly every smartphone worldwide, the company operates from a position of unmatched scale, making its lead in mobile computing extremely difficult for rivals to challenge.\n\nNVIDIA NVDA competes with ARM in edge computing and AI-driven device workloads. NVIDIA benefits from its own ecosystem, but lacks ARM’s mobile reach. Even where NVIDIA pushes into low-power processors, the breadth of ARM compatibility limits its ability to displace existing standards.\nQualcomm QCOM remains one of ARM’s most essential partners, yet also a peer, because Qualcomm builds mobile chips around ARM cores. The company depends heavily on ARM’s architecture, and its success in smartphones reinforces ARM’s position. Yet Qualcomm continues investing in custom designs to diversify, although ARM’s scale still keeps Qualcomm aligned with the platform.\n\nStory Continues\nStrong Earnings and Revenue Growth Ahead for ARM The Zacks Consensus Estimate for ARM’s fiscal 2026 earnings is pegged at $1.72, indicating 5.5% growth from the year-ago level. Earnings for fiscal 2027 are expected to increase 28.2% from the prior-year actuals.\nThe company’s sales are expected to rise 23.5% and 21.6% year over year, respectively, in fiscal 2026 and 2027.\nImage Source: Zacks Investment Research\nARM's Valuation Remains Significantly Elevated ARM stock is currently expensive. It is priced at around 60 times forward 12-month earnings per share, significantly higher than the industry’s average of 37 times. When looking at the trailing 12-month EV-to-EBITDA ratio, ARM is trading at around 100 times, far exceeding the industry’s average of 25 times.\n\nHold Recommendation Despite the recent decline, ARM’s shares still reflect elevated expectations due to the company’s dominant market position and long-term growth narrative. The pullback improves risk-reward but does not yet fully offset valuation concerns, especially in a volatile market environment. ARM’s strong ecosystem, recurring royalty model and exposure to AI-driven demand support the long-term story, but near-term upside may remain capped. Investors already holding the stock can stay patient, while new investors may prefer a wait-and-watch approach, looking for clearer signs of sustained earnings acceleration or a more attractive entry point.\n\nARM currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\nARM Holdings PLC Sponsored ADR (ARM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "00:31:00",
      "Source": "Zacks",
      "Title": "Can Intel's AI Focus Restore Its Competitive Edge & Boost Shares?",
      "URL": "https://finance.yahoo.com/news/intels-ai-focus-restore-competitive-163100510.html",
      "Content": "Can Intel's AI Focus Restore Its Competitive Edge & Boost Shares?\n\nZacks Equity Research\nTue, December 16, 2025 at 8:31 AM PST 3 min read\n\nIn this article: INTC\n\nSANS.PVT\n\nPer a Bloomberg news report , Intel Corporation ( INTC ) is in advanced talks to acquire AI start-up SambaNova Systems for about $1.6 billion. SambaNova is known for designing custom AI chips and systems. Acquiring an AI-focused company facilitates Intel with a ready-made AI architecture, software stacks and engineering talent, minimizing years of internal development time and speeding up its AI development plans.\n\nIf the deal materializes, it will help Intel to modernize its CPUs with AI chips and software, providing cloud and enterprise customers with a complete AI system. By using AI chip technology, Intel can make chips in its own factories, increasing its manufacturing strength and allowing it to attract more foundry customers.\nIntel has launched new AI-powered chips that are faster and more energy-efficient, helping the company compete better in the growing AI market. It is gaining traction in AI infrastructure as Super Micro Computer has chosen Intel’s Xeon 6 processors for its high-performance enterprise servers.\nThe company has collaborated with Cisco to build a new integrated platform that supports distributed AI workloads. NVIDIA will invest $5 billion in Intel to build advanced technologies that will shape the future of AI infrastructure. Intel is actively investing in AI and is serious about competing in the fast-growing semiconductor market, signaling a credible comeback.\n\nHow Are Competitors Faring? Intel faces competition from Advanced Micro Devices ( AMD ) and Qualcomm Incorporated ( QCOM ). Qualcomm focuses on making advanced chips for AI-powered PCs. Qualcomm launched the AI 200 and AI 250 chips to meet rising AI processing needs in data centers. HUMAIN has chosen Qualcomm’s AI200 and AI250 chips to provide high-performance AI services in Saudi Arabia and worldwide.\n\nAMD is growing its AI business by launching new MI350 series accelerators and working with major partners like Amazon, Microsoft, Meta and Oracle to deliver faster and more powerful AI systems. AMD has entered into a long-term deal with OpenAI to power large AI systems using AMD’s Instinct GPUs starting in 2026. IBM and AMD are working with Zyphra to provide powerful AI infrastructure on IBM Cloud using AMD Instinct MI300X GPUs to train advanced AI models.\nINTC’s Price Performance, Valuation and Estimates Intel has rallied 79.3% over the past year compared with the industry ’s growth of 31.1%.\n\nImage Source: Zacks Investment Research\nGoing by the price/book ratio, the company's shares currently trade at 1.53 book value, lower than 30.63 of the industry average.\n\nStory Continues\n\nImage Source: Zacks Investment Research\nEarnings estimates for 2025 have increased 128.6% to 32 cents, while those for 2026 have declined 10.7% to 59 cents over the past 60 days.\n\nImage Source: Zacks Investment Research\nIntel stock currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nIntel Corporation (INTC) : Free Stock Analysis Report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "23:25:00",
      "Source": "Business Wire",
      "Title": "Form 8.3",
      "URL": "https://finance.yahoo.com/news/form-8-3-152500395.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nForm 8.3\n\nBusiness Wire\nTue, December 16, 2025 at 7:25 AM PST 5 min read\n\nIn this article: QCOM\n\nBOSTON, December 16, 2025 --( BUSINESS WIRE )--\nFORM 8.3\nPUBLIC OPENING POSITION DISCLOSURE/DEALING DISCLOSURE BY\nA PERSON WITH INTERESTS IN RELEVANT SECURITIES REPRESENTING 1% OR MORE\nRule 8.3 of the Takeover Code (the \"Code\")\n1. KEY INFORMATION\n(a) Full name of discloser:\nWeiss Asset Management LP (Investment Manager of Brookdale International Partners, L.P. and Brookdale Global Opportunity Fund)\n(b) Owner or controller of interests and short positions disclosed, if different from 1(a):\nThe naming of nominee or vehicle companies is insufficient. For a trust, the trustee(s), settlor and beneficiaries must be named.\nN/A\n(c) Name of offeror/offeree in relation to whose relevant securities this form relates:\nUse a separate form for each offeror/offeree\nAqua Acquisition Sub LLC (an indirect wholly-owned subsidiary of Qualcomm Incorporated)\n(d) If an exempt fund manager connected with an offeror/offeree, state this and specify identity of offeror/offeree:\nN/A\n(e) Date position held/dealing undertaken:\nFor an opening position disclosure, state the latest practicable date prior to the disclosure\n15 December 2025\n(f) In addition to the company in 1(c) above, is the discloser making disclosures in respect of any other party to the offer?\nIf it is a cash offer or possible cash offer, state \"N/A\"\nAlphawave IP Group plc –\n1p ordinary, ISIN GB00BNDRMJ14\n\n2. POSITIONS OF THE PERSON MAKING THE DISCLOSURE\nIf there are positions or rights to subscribe to disclose in more than one class of relevant securities of the offeror or offeree named in 1(c), copy table 2(a) or (b) (as appropriate) for each additional class of relevant security.\n(a) Interests and short positions in the relevant securities of the offeror or offeree to which the disclosure relates following the dealing (if any)\nClass of relevant security:\nUSD 0.0001 common – 1,065,316,212\n(ISIN: US7475251036)\nInterests\nShort Positions\nNumber\n%\nNumber\n%\n(1) Relevant securities owned and/or controlled:\n287,619\n0.03\n(2) Cash-settled derivatives:\n(3) Stock-settled derivatives (including options) and agreements to purchase/sell:\nTOTAL:\n287,619\n0.03\n\nAll interests and all short positions should be disclosed.\nDetails of any open stock-settled derivative positions (including traded options), or agreements to purchase or sell relevant securities, should be given on a Supplemental Form 8 (Open Positions).\n(b) Rights to subscribe for new securities (including directors’ and other employee options)\nClass of relevant security in relation to which subscription right exists:\nN/A\nDetails, including nature of the rights concerned and relevant percentages:\nN/A\n\n3. DEALINGS (IF ANY) BY THE PERSON MAKING THE DISCLOSURE\nWhere there have been dealings in more than one class of relevant securities of the offeror or offeree named in 1(c), copy table 3(a), (b), (c) or (d) (as appropriate) for each additional class of relevant security dealt in.\n\nStory Continues\nThe currency of all prices and other monetary amounts should be stated.\n(a) Purchases and sales\nClass of relevant security\nPurchase/Sale\nNumber of securities\nPrice per unit\nUSD 0.0001 common\nSale\n15,675\nUSD 179.1496\nUSD 0.0001 common\nSale\n6,937\nUSD 179.6719\nUSD 0.0001 common\nSale\n4,155\nUSD 179.6719\n\n(b) Cash-settled derivative transactions\nClass of relevant security\nProduct description e.g. CFD\nNature of dealing e.g. Opening/Closing a long/short position, increasing/reducing a long/short position\nNumber of reference securities\nPrice per unit\nN/A\nN/A\nN/A\nN/A\nN/A\n\n(c) Stock-settled derivative transactions (including options)\n(i) Writing, selling, purchasing or varying\nClass of relevant security\nProduct description e.g. call option\nWriting, purchasing, selling, varying etc.\nNumber of securities to which option relates\nExercise price per unit\nType\ne.g. American, European etc.\nExpiry date\nOption money paid/ received per unit\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\nN/A\n\n(ii) Exercise\nClass of relevant security\nProduct description\ne.g. call option\nExercising/ exercised against\nNumber of securities\nExercise price per unit\nN/A\nN/A\nN/A\nN/A\nN/A\n\n(d) Other dealings (including subscribing for new securities)\nClass of relevant security\nNature of dealing\ne.g. subscription, conversion\nDetails\nPrice per unit (if applicable)\nN/A\nN/A\nN/A\nN/A\n\n4. OTHER INFORMATION\n(a) Indemnity and other dealing arrangements\nDetails of any indemnity or option arrangement, or any agreement or understanding, formal or informal, relating to relevant securities which may be an inducement to deal or refrain from dealing entered into by the person making the disclosure and any party to the offer or any person acting in concert with a party to the offer:\nIrrevocable commitments and letters of intent should not be included. If there are no such agreements, arrangements or understandings, state \"none\"\nNone\n\n(b) Agreements, arrangements or understandings relating to options or derivatives\nDetails of any agreement, arrangement or understanding, formal or informal, between the person making the disclosure and any other person relating to:\n(i) the voting rights of any relevant securities under any option; or\n(ii) the voting rights or future acquisition or disposal of any relevant securities to which any derivative is referenced:\nIf there are no such agreements, arrangements or understandings, state \"none\"\nNone\n\n(c) Attachments\nIs a Supplemental Form 8 (Open Positions) attached?\nNo\n\nDate of disclosure:\n16 December 2025\nContact name:\nMary Merrigan\nTelephone number:\n+1 617 778 7775\n\nPublic disclosures under Rule 8 of the Code must be made to a Regulatory Information Service.\nThe Panel’s Market Surveillance Unit is available for consultation in relation to the Code’s disclosure requirements on +44 (0)20 7638 0129.\nThe Code can be viewed on the Panel’s website at www.thetakeoverpanel.org.uk .\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251216466690/en/\nContacts\nWeiss Asset Management LP\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "22:00:05",
      "Source": "Zacks",
      "Title": "Investors Heavily Search QUALCOMM Incorporated (QCOM): Here is What You Need to Know",
      "URL": "https://finance.yahoo.com/news/investors-heavily-search-qualcomm-incorporated-140005147.html",
      "Content": "Investors Heavily Search QUALCOMM Incorporated (QCOM): Here is What You Need to Know\n\nZacks Equity Research\nTue, December 16, 2025 at 6:00 AM PST 5 min read\n\nIn this article: QCOM\n\n^GSPC\n\nQualcomm (QCOM) has recently been on Zacks.com's list of the most searched stocks. Therefore, you might want to consider some of the key factors that could influence the stock's performance in the near future.\nShares of this chipmaker have returned +7.5% over the past month versus the Zacks S&P 500 composite's +1.3% change. The Zacks Electronics - Semiconductors industry, to which Qualcomm belongs, has gained 1.6% over this period. Now the key question is: Where could the stock be headed in the near term?\n\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nRevisions to Earnings Estimates Rather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nFor the current quarter, Qualcomm is expected to post earnings of $3.38 per share, indicating a change of -0.9% from the year-ago quarter. The Zacks Consensus Estimate has changed -0.3% over the last 30 days.\nFor the current fiscal year, the consensus earnings estimate of $12.15 points to a change of +1% from the prior year. Over the last 30 days, this estimate has changed +0.1%.\nFor the next fiscal year, the consensus earnings estimate of $12.6 indicates a change of +3.7% from what Qualcomm is expected to report a year ago. Over the past month, the estimate has changed -0.4%.\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Qualcomm is rated Zacks Rank #3 (Hold).\n\nStory Continues\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS Projected Revenue Growth While earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\n\nFor Qualcomm, the consensus sales estimate for the current quarter of $12.25 billion indicates a year-over-year change of +5%. For the current and next fiscal years, $45.69 billion and $46.14 billion estimates indicate +3.5% and +1% changes, respectively.\nLast Reported Results and Surprise History Qualcomm reported revenues of $11.27 billion in the last reported quarter, representing a year-over-year change of +10%. EPS of $3 for the same period compares with $2.69 a year ago.\nCompared to the Zacks Consensus Estimate of $10.79 billion, the reported revenues represent a surprise of +4.43%. The EPS surprise was +4.17%.\n\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates three times over this period.\nValuation Without considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects.\n\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\nThe Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an A is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nQualcomm is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\n\nConclusion The facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Qualcomm. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "07:13:57",
      "Source": "Motley Fool",
      "Title": "Stock Market Today, Dec. 15: Broadcom Slides After AI Margin Concerns Weigh on Stock",
      "URL": "https://finance.yahoo.com/m/b8b0c94d-4ddb-3c78-be98-fe095769d1a7/stock-market-today%2C-dec.-15%3A.html",
      "Content": "Stock Market Today, Dec. 15: Broadcom Slides After AI Margin Concerns Weigh on Stock\n\nJosh Kohn-Lindquist, The Motley Fool\nMon, December 15, 2025 at 3:13 PM PST 2 min read\n\nIn this article: AVGO\n\n^GSPC\n\n^IXIC\n\nQCOM\n\nNVDA\n\nBroadcom (NASDAQ:AVGO) , designer and supplier of semiconductor devices and infrastructure software solutions worldwide, closed Monday’s session at $339.86, down 5.6%. Trading volume reached 55.8 million shares, which is approximately 126% above its three-month average of 24.7 million shares.\nHow the markets moved today Monday’s trading featured renewed pressure on Broadcom after recent earnings, with investors focusing on AI-driven revenue growth versus margin pressure and valuation. The S&P 500 (SNPINDEX:^GSPC) slipped 0.16% to finish at 6,816, while the Nasdaq Composite (NASDAQINDEX:^IXIC) fell 0.59% to close at 23,057.\n\nRivals Qualcomm and Nvidia both gained modestly, underscoring how competition and shifting sentiment across the chipmaking industry are shaping expectations for Broadcom’s AI chip demand and profitability.\nWhat this means for investors Broadcom shares continued their post-earnings slide from Friday, as Wall Street worried over management's mention of lower AI margins. Although Broadcom's projected first-quarter revenue of $19.1 billion exceeded estimates, management guided for a 100-basis-point decline in gross margin due to lower margins from its AI systems. As the tech industry hurtles toward an AI-powered world, these margin concerns reinforced investor debate over growth quality versus profitability.\n\nWhile Broadcom's earnings and guidance were satisfactory -- most analysts increased their price targets -- the company was priced for perfection at 72 times free cash flow before Thursday's earnings and simply didn't meet these flawless expectations. Ultimately, the launch of a new AI accelerator by Qualcomm and ongoing competition with Nvidia create an intensifying AI chip rivalry, which will keep Broadcom's stock volatile.\nDon’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $453,954 !*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $52,940 !*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $513,353 !*\nRight now, we’re issuing “Double Down” alerts for three incredible companies , available when you join Stock Advisor , and there may not be another chance like this anytime soon.\n\nStory Continues\nSee the 3 stocks »\n*Stock Advisor returns as of December 15, 2025\nJosh Kohn-Lindquist has positions in Nvidia. The Motley Fool has positions in and recommends Nvidia and Qualcomm. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nStock Market Today, Dec. 15: Broadcom Slides After AI Margin Concerns Weigh on Stock was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "02:04:56",
      "Source": "The Wall Street Journal",
      "Title": "Streetwise | Is This the Dot-Com Bubble All Over Again?",
      "URL": "https://finance.yahoo.com/m/dbc91232-a585-3a86-82f7-7b8fc2e70930/streetwise-%7C-is-this-the.html",
      "Content": "Streetwise | Is This the Dot-Com Bubble All Over Again?\n\nJames Mackintosh\nMon, December 15, 2025 at 10:04 AM PST 1 min read\n\nIn this article: CSCO\n\nQCOM\n\nBack in 1999 the internet was the first, and often the only, topic of conversation with investors. Today it’s AI. The parallels of today’s artificial-intelligence boom with the dot-com bubble go much further, but there’s also a very big difference: Stocks went up a lot more back then.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-15",
      "Time": "23:10:00",
      "Source": "MarketBeat",
      "Title": "3 Companies Turning Big Cash Flow Into Bigger Shareholder Gains",
      "URL": "https://finance.yahoo.com/m/2751f348-04a7-3fc8-ac77-f0ab84543020/3-companies-turning-big-cash.html",
      "Content": "3 Companies Turning Big Cash Flow Into Bigger Shareholder Gains\n\nNathan Reiff, MarketBeat\nMon, December 15, 2025 at 7:10 AM PST 4 min read\n\nIn this article: QCOM\n\nAMAT\n\nGILD\n\nKey Points Capital returns in the form of share buybacks and dividend payments are an attractive element for many investors, helping to boost value in ways other than through share price growth.\nIn the current environment, companies able to provide solid cash flow for these returns are increasingly rare.\nThree names to keep an eye on for their cash flow and returns include Gilead Sciences, Applied Materials, and Qualcomm.\nInterested in Gilead Sciences, Inc.? Here are five stocks we like better.\n\nInflation, interest rates, and broader economic uncertainty have forced companies across many sectors to prioritize efficiency. In this environment, it can be particularly challenging for firms to maintain cash flow, which is vital to their continued healthy operations and growth. Strong free cash flow also positions companies more favorably to make smart capital returns to investors in the form of dividends or share buybacks.\nInvestors seeking Buy-rated companies that have managed to thrive in the area of cash flow and that are using this cash effectively to enhance value for shareholders might start by looking at three names in the healthcare and technology spaces below.\n→ Rivian’s Autonomy Bombshell Changes Everything—Even Its Valuation\nImpressive Healthcare Portfolio Contributes to Solid Dividend History Biopharmaceuticals giant Gilead Sciences Inc. (NASDAQ: GILD) is known for its antiviral medications and those with applications in oncology and inflammatory diseases. The company has a history of strong cash generation—in the latest quarter, it reported free cash flow of nearly $4 billion and operating cash flow of $4.1 billion—thanks to its high-margin products and strong sales.\n\nGilead's portfolio of drugs is sizable and varied, including major medicines for the treatment of HIV, liver disease, and much more. The strength and breadth of this portfolio helps to ensure that Gilead sees healthy sales each quarter, which it can then feed back into further R&D and, notably for investors, an attractive dividend distribution.\n→ Super Micro's Sell-Off Is a Mirage—Here’s Why the Rally May Come Back Fast\nThe company has paid a 79-cent dividend in each of the last four quarters, after a 2-cent boost early in the year. This translates to a dividend yield of 2.65%, above the average for the healthcare sector. Gilead has been able to sustain dividend growth while maintaining a relatively low payout ratio of around 49%, suggesting that it should be able to maintain these capital returns going forward.\nShares of GILD are up close to 30% this year, and as an added bonus, analysts see another 9.5% in upside in the company's future.\n\nStory Continues\n→ 3 Companies Turning Big Cash Flow Into Bigger Shareholder Gains\nVital AI and Data Center Technology Yields Healthy Cash Flow Applied Materials Inc. (NASDAQ: AMAT) plays an essential role in the semiconductor industry by providing technology vital to the fabrication of chips of many kinds. This has made the company increasingly indispensable as the AI and data center industries have boomed and has caused AMAT shares to be an analyst favorite for growing earnings.\n\nWhen Applied Materials reported its fiscal 2025 fourth-quarter results in mid-November, it impressed on multiple fronts: record results included revenue of more than $28 billion for the year and gross margin of 48.8%, up 120 basis points year-over-year. The fiscal year also included strong free cash flow of $5.7 billion, despite headwinds to the company's business in China due to trade restrictions. Importantly for investors, Applied Materials returned more than $6 billion in capital via dividend distributions and buybacks.\nThe company has applied this cash toward dividend growth, achieving a five-year annualized dividend increase of close to 15%. Its dividend yield is 0.69%, but its payout ratio of 21.2% is especially impressive—this also appears to be a company with a healthy dividend that is sustainable over the long term.\n\nTop- and Bottom-Line Growth Alongside Big Cash Flow Another crucial player in the chip-making space, Qualcomm Inc. (NASDAQ: QCOM) has traditionally focused primarily on wireless communication technology, although it has more recently also expanded into AI and data center efforts, among others. With strong technical indicators in recent periods, QCOM shares may be reversing a downward trend from earlier in the fall.\n\nHaving also reported its fiscal 2025 fourth-quarter earnings results in November, Qualcomm noted full-year revenue and earnings per share (EPS) gains of 13% and 18%, respectively, thanks to a strong showing from its core QCT business.\nCash flow from operations for the latest quarter was an impressive $4 billion, and capital expenditure tends to remain low for the tech sector. This means that Qualcomm is freed up to deploy its cash reserves toward buybacks and, especially dividends. QCOM pays a dividend yield of 2.02%, having boosted its quarterly distribution by nearly 5% earlier in the year. With an additional 9% in possible upside anticipated across Wall Street, Qualcomm could be poised to deliver on both passive income and capital appreciation for investors.\nThe article \" 3 Companies Turning Big Cash Flow Into Bigger Shareholder Gains \" was originally published by MarketBeat.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 26
}