{
  "stock_id": "QCOM",
  "last_updated": "2025-12-29T23:10:35.167Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-30",
      "Time": "03:53:16",
      "Source": "Barchart",
      "Title": "Intel Stock Had a Banner Year But Is Still 50% Off Its Record Highs. Are More Gains in Store for 2026?",
      "URL": "https://finance.yahoo.com/m/a8b42796-9593-3d38-85b1-72805ec62ca2/intel-stock-had-a-banner-year.html",
      "Content": "Intel Stock Had a Banner Year But Is Still 50% Off Its Record Highs. Are More Gains in Store for 2026?\n\nWajeeh Khan\nMon, December 29, 2025 at 11:53 AM PST 2 min read\n\nIn this article: INTC\n\nAMD\n\nQCOM\n\nTSM\n\nAAPL\n\nIntel (INTC) stock has been a major outperformer this year as CEO Lip-Bu Tan’ strategic vision renewed investor confidence in the company’s ability to compete in the global AI arms race.\nUnder his leadership, the company secured billions in private and federal investments, paving the way to advance its foundry ambitions.\n\nMore News from Barchart Micron Technology Bear Put Spread Could Return 197% in this Down Move\nSanta Claus Rally, Fed Minutes and Other Can't Miss Items this Week\nMP Materials Gained 230% in 2025. Should You Buy, Sell, or Hold MP Stock for 2026?\nTired of missing midday reversals? The FREE Barchart Brief newsletter keeps you in the know. Sign up now!\nVersus their pandemic high, however, Intel shares remain down some 50%, suggesting persistent structural and executions risks continue to weigh on sentiment.\nWhat to Expect From Intel Stock in 2026 The latest setback for INTC stock came from Nvidia (NVDA) that’s reportedly scrapped plans of producing its advanced chips using Intel’s 18A node.\nStill, Daniel Newman – the chief executive of Futurum Group – believes the longer term bull case remains intact for one simple reason: Taiwan Semi (TSM) just “can’t produce enough chips.”\n\nThe unprecedented AI-driven demand is making big names like Apple (AAPL), Qualcomm (QCOM), and even AMD (AMD) explore alternatives, reinforcing Intel’s role as an auxiliary capacity provider.\nAnd since demand is truly explosive, being only an adjunct resource for the semiconductor space may prove sufficient in driving Intel stock higher in 2026, he told CNBC in a recent interview.\nINTC Shares Remain Inexpensive to Own Newman doesn’t see NVDA news as a major setback for Intel shares since Lip-Bu Tan had already broadcast that the initial ramp-up of the firm’s 18A node is optimized for and dedicated to its own internal products.\nAccording to him, the real inflection point for Intel will be its upcoming “14A” process, expected to enter volume production in 2028.\n\n“This is the one where rubber meets the road for companies like Nvidia, Apple, and others.”\nFrom a valuation perspective, INTC shares are just as attractive. Despite an explosive year-to-date rally, they’re going for just over 3x sales at the time of writing, versus more than 35x for Nvidia.\nWall Street Disagrees with Newman on Intel Wall Street analysts do not entirely agree with Newman’s constructive view on Intel stock, though.\nThe consensus rating on INTC shares remains at “Hold” only with the mean target of nearly $37 already in line with the price at which they are trading currently.\n\nStory Continues\nThis article was created with the support of automated content tools from our partners at Sigma.AI. Together, our financial data and AI solutions help us to deliver more informed market headline analysis to readers faster than ever.\nOn the date of publication, Wajeeh Khan did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "22:15:14",
      "Source": "Insider Monkey",
      "Title": "Analysts Watch QUALCOMM Incorporated (QCOM)’s Expanding AI Data Center Footprint",
      "URL": "https://finance.yahoo.com/news/analysts-watch-qualcomm-incorporated-qcom-141514737.html",
      "Content": "Analysts Watch QUALCOMM Incorporated (QCOM)’s Expanding AI Data Center Footprint\n\nRameen Kasana\nMon, December 29, 2025 at 6:15 AM PST 2 min read\n\nIn this article: QCOM\n\nAWEVF\n\nQUALCOMM Incorporated (NASDAQ: QCOM ) is among the most undervalued tech giants to buy according to hedge funds . As of December 26, QUALCOMM Incorporated (NASDAQ:QCOM) has a ‘Buy’ or equivalent rating from half of the analysts covering the stock. With a median price target of $200, the stock has an upside potential of 14.28%. Among the analysts bullish on the stock is Fang Boon Foo, an analyst at DBS, who maintained a ‘Buy’ rating on the company on December 5 and a price target that mirrored the consensus estimate.\n\nLater, on December 18, QUALCOMM Incorporated (NASDAQ:QCOM) announced the completion of its acquisition of Alphawave IP Group plc, a quarter ahead of the expected timeline. This acquisition is a testament to the company’s strategy of establishing a foothold in the data center market. CEO and co-founder of Alphawave Semi, Tony Pialis, will lead the company’s data center business.\nKārlis Dambrāns/Flickr\nThe venture aims to create a leading player in AI compute and connectivity solutions across several fast-growing markets, particularly data center applications.\nSeparately, on December 16, C.J. Muse from Cantor Fitzgerald lifted the price target on QUALCOMM Incorporated (NASDAQ:QCOM) to $185 from $170 and maintained a ‘Neutral’ rating. The firm’s confidence in SOX (Philadelphia Semiconductor Index) to lead the market is driven by its outperformance versus S&P by approximately 30 points in CY25, The Fly reported.\n\nQUALCOMM Incorporated (NASDAQ:QCOM), headquartered in California, is a digital telecommunications provider operating across three segments: Qualcomm CDMA Technologies, Qualcomm Technology Licensing, and Qualcomm Strategic Initiatives.\nWhile we acknowledge the potential of QCOM as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money .\nDisclosure: None.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "22:00:06",
      "Source": "Zacks",
      "Title": "QUALCOMM Incorporated (QCOM) Is a Trending Stock: Facts to Know Before Betting on It",
      "URL": "https://finance.yahoo.com/news/qualcomm-incorporated-qcom-trending-stock-140006987.html",
      "Content": "QUALCOMM Incorporated (QCOM) Is a Trending Stock: Facts to Know Before Betting on It\n\nZacks Equity Research\nMon, December 29, 2025 at 6:00 AM PST 5 min read\n\nIn this article: QCOM\n\n^GSPC\n\nQualcomm (QCOM) has recently been on Zacks.com's list of the most searched stocks. Therefore, you might want to consider some of the key factors that could influence the stock's performance in the near future.\nOver the past month, shares of this chipmaker have returned +4%, compared to the Zacks S&P 500 composite's +2.6% change. During this period, the Zacks Electronics - Semiconductors industry, which Qualcomm falls in, has lost 6.3%. The key question now is: What could be the stock's future direction?\n\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nRevisions to Earnings Estimates Here at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock.\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nFor the current quarter, Qualcomm is expected to post earnings of $3.38 per share, indicating a change of -0.9% from the year-ago quarter. The Zacks Consensus Estimate remained unchanged over the last 30 days.\nFor the current fiscal year, the consensus earnings estimate of $12.15 points to a change of +1% from the prior year. Over the last 30 days, this estimate has remained unchanged.\nFor the next fiscal year, the consensus earnings estimate of $12.6 indicates a change of +3.7% from what Qualcomm is expected to report a year ago. Over the past month, the estimate has remained unchanged.\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #3 (Hold) for Qualcomm.\n\nStory Continues\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS Revenue Growth Forecast While earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\n\nIn the case of Qualcomm, the consensus sales estimate of $12.25 billion for the current quarter points to a year-over-year change of +5%. The $45.69 billion and $46.14 billion estimates for the current and next fiscal years indicate changes of +3.5% and +1%, respectively.\nLast Reported Results and Surprise History Qualcomm reported revenues of $11.27 billion in the last reported quarter, representing a year-over-year change of +10%. EPS of $3 for the same period compares with $2.69 a year ago.\nCompared to the Zacks Consensus Estimate of $10.79 billion, the reported revenues represent a surprise of +4.43%. The EPS surprise was +4.17%.\n\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates three times over this period.\nValuation No investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nWhile comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.\n\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nQualcomm is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nConclusion The facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Qualcomm. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "23:35:00",
      "Source": "Zacks",
      "Title": "QCOM Rides on Strength in Premium Handset Market: Will it Sustain?",
      "URL": "https://finance.yahoo.com/news/qcom-rides-strength-premium-handset-153500215.html",
      "Content": "QCOM Rides on Strength in Premium Handset Market: Will it Sustain?\n\nZacks Equity Research\nFri, December 26, 2025 at 7:35 AM PST 3 min read\n\nIn this article: QCOM\n\n2454.TW\n\nAAPL\n\nSSNLF\n\nQualcomm Incorporated ( QCOM ) generated about $6.96 billion in handset revenues in the latest quarter, with a year-over-year increase of 14% and an estimated $27.8 billion in fiscal 2025, contributing roughly 63% of the total company’s revenues. Qualcomm’s strong handset revenues are driven by its increased customer demand for Snapdragon-powered premium Android smartphones.\n\nQualcomm faces strong competition from rivals like MediaTek, especially in mid-range and budget smartphones, which puts pressure on its market share and pricing. U.S.-China trade tensions have reduced companies' handset demand to a great extent. Qualcomm's handset business experienced ongoing challenges as global smartphone demand slowed down day by day. Moreover, major handset manufacturers, such as Apple and Samsung, are moving toward in-house chip development. This is a major challenge for Qualcomm.\nTo overcome challenges in the smartphone business, Qualcomm is focusing on premium Snapdragon chips to stay competitive in flagship devices. Qualcomm recently launched the Snapdragon 8 Gen 5, offering high-speed performance, advanced AI, improved graphics, and enhanced camera capabilities for flagship smartphones from global brands like iQOO , Honor, ASUS, OnePlus, and Vivo.\n\nPer a report from Precedence Research, the global 5G chipset market is expected to reach $126.4 billion by 2030 from $18.7 billion in 2022, with a CAGR of 27%, indicating strong underlying growth potential for Qualcomm’s handset segment in the near future. QCOM’s continuous innovation in powering flagship devices with cutting-edge features helps to boost its handset revenues, maintain leadership in the premium segment, and drive future revenue growth.\nOther Tech Companies Focused on Handset Chip Development Qualcomm faces competition from Apple, Inc. ( AAPL ) and Broadcom, Inc. ( AVGO ). Apple recently launched the new iPad Pro, MacBook Pro, and upgraded Vision Pro, all powered by their M5 chip. Apple’s iPhone 17 series uses the A19 chip, and the iPhone Air features the A19 Pro chip, both offering faster performance, better graphics, and advanced AI capabilities. These recent chips strengthen Apple’s position in the smartphone market and reduce its reliance on third-party suppliers.\n\nBroadcom recently launched Wi Fi 8 chips for smartphones and connected devices, improving speed, reliability, and efficiency. Broadcom, by providing essential smartphone components like Wi Fi, Bluetooth, and RF chips for major brands, remains important in the handset market. The company also focuses on affordable LTE chips for emerging markets, helping OEMs bring affordable smartphones to countries like India.\n\nStory Continues\nQCOM’s Price Performance, Valuation and Estimates Qualcomm shares have gained 11.1% over the past year compared with the industry ’s growth of 35.3%.\n\nImage Source: Zacks Investment Research\nGoing by the price/earnings ratio, the company's shares currently trade at 14.26 forward earnings, lower than 34.54 for the industry.\n\nImage Source: Zacks Investment Research\nEarnings estimates for 2025 have increased 2% to $12.15 over the past 60 days, while those for 2026 have risen 3.4% to $12.60.\n\nImage Source: Zacks Investment Research\nQualcomm stock currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here .\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nQUALCOMM Incorporated (QCOM) : Free Stock Analysis Report\nApple Inc. (AAPL) : Free Stock Analysis Report\nBroadcom Inc. (AVGO) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 4
}