{
  "stock_id": "TSLA",
  "last_updated": "2025-12-18T17:11:59.574Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-19",
      "Time": "00:59:24",
      "Source": "Investor's Business Daily",
      "Title": "Stock Market Today: Indexes Rise; Nvidia, Tesla Rally; This Nuke Play Sets Up (Live Coverage)",
      "URL": "https://finance.yahoo.com/m/3c54efeb-8d61-3f56-90ba-bb013f26d2f0/stock-market-today%3A-indexes.html",
      "Content": "Stock Market Today: Indexes Rise; Nvidia, Tesla Rally; This Nuke Play Sets Up (Live Coverage)\n\nSCOTT LEHTONEN and DAVID SAITO-CHUNG\nThu, December 18, 2025 at 8:59 AM PST 5 min read\n\nIn this article: NVDA\n\nCLS\n\nMU\n\nCEG\n\nTSLA\n\nStock Market Today: The Dow Jones index rose Thursday on a surprise CPI inflation report. Nvidia stock and Tesla rallied.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "00:45:30",
      "Source": "Benzinga",
      "Title": "Bill Gates Could Have Been 'World's First Trillionaire' By Ignoring Buffett's Advice — Instead, He Lost $10 Billion Shorting Tesla, Says Elon Musk",
      "URL": "https://finance.yahoo.com/news/bill-gates-could-worlds-first-164530436.html",
      "Content": "Bill Gates Could Have Been 'World's First Trillionaire' By Ignoring Buffett's Advice — Instead, He Lost $10 Billion Shorting Tesla, Says Elon Musk\n\nVishaal Sanjay\nThu, December 18, 2025 at 8:45 AM PST 3 min read\n\nIn this article: TSLA\n\nMSFT\n\nNVDA\n\nBRK.A\n\nBillionaire entrepreneur and Tesla Inc. (NASDAQ: TSLA ) CEO, Elon Musk , once again reignited the debate surrounding Microsoft Corp. (NASDAQ: MSFT ) co-founder, Bill Gates ‘ massive wealth, and what it could have been, had he not conformed to conventional wealth planning norms.\nBill Gates Could Have Been ‘World’s First Trillionaire’ On Wednesday, in a post on X, investor Michael Arouet highlighted the current top 10 richest people in the world, a list that no longer includes the Microsoft co-founder but does feature former CEO Steve Ballmer at No. 8, with an estimated net worth of $166 billion.\nThis comes after being ranked as the world’s wealthiest person by Forbes magazine for 18 of the 24 years between 1995 and 2017.\n\nDon't Miss:\nAmericans With a Financial Plan Can 4X Their Wealth — Get Your Personalized Plan from a CFP Pro\n$100k+ in investable assets? Match with a fiduciary advisor for free to learn how you can maximize your retirement and save on taxes – no cost, no obligation.\nArouet shared the story of Gates’ decision to sell his position in Microsoft on the advice of legendary investor and Berkshire Hathaway Inc. (NYSE: BRK ) (NYSE: BRK ) CEO, Warren Buffett , who asked him to diversify his holdings.\nAccording to Arouet, if Gates hadn’t listened to Buffett, he would now be “the world's first trillionaire, worth twice as much as Elon.”\nAs Microsoft shares continue to soar, and its market capitalization is now at $3.6 trillion, Gates’ net worth would have stood at a staggering $1.5 trillion if he had retained all of his shares in the company and hadn’t embarked on the massive philanthropic journey with his ex-wife, Melinda Gates .\nTo be fair, it's difficult to fault Buffett for that advice. Few could have anticipated Microsoft's extraordinary surge over the past decade, particularly after the stock spent years largely treading water following the dot-com crash, taking roughly 15 years to reclaim its prior peak.\nSee Also: Buffett's Secret to Wealth? Private Real Estate— Get Institutional Access Yourself\nLost $10 Billion In Tesla Short Position Musk weighed in on the post, once again bringing attention to the short position that he claimed Gates has held against Tesla for the past eight years.\nIn his reply to the post, Musk said “Bill Gates placed a massive short bet against Tesla,” which he said was 1% of the company’s total shares outstanding, while adding that the position has since cost the Microsoft co-founder as much as $10 billion, as Tesla shares soared over the past few years.\n\nStory Continues\nShares of Tesla were down 4.62% on Wednesday, closing at $467.26, while Microsoft was down 0.05%, at $476.12. Tesla scores high on Momentum and Growth in Benzinga’s Edge Stock Rankings , with a favorable price trend in the short, medium and long terms. Click here to see how it compares with Microsoft.\n\nRead More:\nMissed Nvidia and Tesla? RAD Intel Could Be the Next AI Powerhouse — Just $0.85 a Share\nWall Street's $12B Real Estate Manager Is Opening Its Doors to Individual Investors — Without the Crowdfunding Middlemen\nPhoto courtesy: Alexandros Michailidis on Shutterstock\nUNLOCKED: 5 NEW TRADES EVERY WEEK. Click now to get top trade ideas daily , plus unlimited access to cutting-edge tools and strategies to gain an edge in the markets.\nGet the latest stock analysis from Benzinga:\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Bill Gates Could Have Been 'World's First Trillionaire' By Ignoring Buffett's Advice — Instead, He Lost $10 Billion Shorting Tesla, Says Elon Musk originally appeared on Benzinga.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:46:01",
      "Source": "Investor's Business Daily",
      "Title": "Stock Market Today: Indexes Rise; Nvidia, Tesla Rally But Some Electronics Firms Struggle (Live Coverage)",
      "URL": "https://finance.yahoo.com/m/3c54efeb-8d61-3f56-90ba-bb013f26d2f0/stock-market-today%3A-indexes.html",
      "Content": "Stock Market Today: Indexes Rise; Nvidia, Tesla Rally But Some Electronics Firms Struggle (Live Coverage)\n\nSCOTT LEHTONEN and DAVID SAITO-CHUNG\nThu, December 18, 2025 at 7:46 AM PST 3 min read\n\nIn this article: ^DJI\n\nSMH\n\nDRI\n\nKMX\n\nASML\n\nStock Market Today: The Dow Jones index rose Thursday on a surprise CPI inflation report. Nvidia stock and Tesla rallied.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:37:47",
      "Source": "Bloomberg",
      "Title": "Tesla’s ‘Musk Premium’ in Focus With SpaceX IPO in View",
      "URL": "https://finance.yahoo.com/news/tesla-musk-premium-focus-spacex-120001761.html",
      "Content": "Tesla’s ‘Musk Premium’ in Focus With SpaceX IPO in View\n\nJordan Fitzgerald\nThu, December 18, 2025 at 7:37 AM PST 6 min read\n\nIn this article: TSLA\n\n^GSPC\n\n(Bloomberg) — Elon Musk is selling investors a future of driverless cars, robot assistants and life on Mars. The problem for investors is there’s only one way to buy into his vision: Tesla Inc.’s stock.\nMost Read from Bloomberg\nHudson Tunnel Digging Work to Start as Boring Machines Ready\nNYC High Line-Area Building Floats $53 Million Bankruptcy Sale\nHow This Chameleon UK Location Became a Little-Known Hollywood Backdrop\nNew York Says Cab, Rideshare Insurance Rates to Rise 25%\nNew York Utility Says Queue for Large Power Users Has Tripled\n\nThe electric-vehicle maker’s shares were up nearly 3% on Thursday. They hit their first record of the year on Tuesday amid gains of more than 20% over the last four weeks. Since tumbling to a low on April 8 during the height of panic over the Trump administration’s tariffs, the stock has soared almost 120%, putting it among the 20 best performers in the S&P 500 Index.\n\nThe rally is a testament to Wall Street’s faith in Musk’s artificial intelligence ambitions, particularly since Tesla’s core auto business is struggling. But it has also made Tesla shares extremely expensive. At 214 times earnings over the next 12 months, the stock has the second highest valuation in the S&P 500, trailing only Warner Bros Discovery Inc. and far ahead of number three, Palantir Technologies Inc., another high-flyer that trades at 178 times forward earnings as of Wednesday’s close.\n\n“The valuation doesn’t make any sense,” said Vikram Rai, portfolio manager and macro trader at First New York, which sold its Tesla position earlier this year after Musk and President Donald Trump had a very public fallout on social media.\nA Tesla representative didn’t reply to a request for comment.\nWith Musk’s SpaceX possibly going public next year, stock traders looking for “Elon exposure” will likely have another way to get it before long. The space exploration company is planning an insider share sale that would value it at $800 billion, making it the most expensive privately held business in the world. Its initial public offering would be the largest ever.\n\n“A SpaceX IPO could lead to some selling pressure on Tesla shares,” said Dmitry Shlyapnikov, an analyst at Horizon Investments who works with portfolio managers. “There are investors that own Tesla for exposure to Elon’s ideas and not for the car company attached to the ticker.”\nOf course, there’s another school of thought that a SpaceX public stock offering would shine a spotlight on Musk, giving Tesla another jolt of momentum.\n“Historically, when one of Musk’s companies achieves a major milestone, it tends to lift sentiment for the others,” said Adam Sarhan, chief executive officer of 50 Park Investments. “A high-profile SpaceX IPO could attract a fresh wave of investors who are drawn to his innovation story — and that enthusiasm often spills over into Tesla.”\n\nStory Continues\nSo far, Tesla’s stock price is getting a boost from the hype surrounding SpaceX, according to Bloomberg Intelligence analyst Steve Man. The missions of the two companies are interlinked, he said, describing a future where Tesla’s Optimus robots help with Musk’s ambition to colonize Mars, and SpaceX’s Starlink satellite system bolsters vehicle connectivity on Earth.\n\nThe companies also share lofty valuations. But Tesla skeptics question whether the company’s fundamentals can support those numbers. Its sales are slowing and profits are falling, while regulations rise and consumers spend less on cars.\n“If you’ve been long Tesla stock, you’ve made money, there’s no denying it,” said Thomas Thornton, founder of Hedge Fund Telemetry, who has a small short position in Tesla. “It’s just bizarre to me because the fundamentals are so bad.”\n‘Double-Down on Elon’ Optimists, on the other hand, point to Tesla’s growth prospects with opportunities in autonomous driving and robotaxis. Musk’s goal is to transform Tesla from an auto manufacturer to an artificial intelligence and robotics company. He wrote in a September X post that 80% of the firm’s profits will eventually come from robots.\n\n“We believe Tesla’s earnings are going to be growing at 30% to 35% over the next two to three years based on the innovation that they have in the automotive segment,” said Brian Mulberry, client portfolio manager at Zacks Investment Management, which owns the company’s shares.\nIf Musk can pull that off, Tesla’s stock market valuation would make more sense. If he can’t, that’s where SpaceX comes in. Publicly traded shares of SpaceX would give investors the opportunity to own a piece of Musk’s vision without Tesla’s baggage.\n“I think most investors will not want to double-down on Elon,” First New York’s Rai said. “That is a lot of risk to carry.”\nNeedham analyst Chris Pierce disagrees.\n“We don’t see investors making an either/or choice, but instead backing both companies,” he said. “Investors that have made money in Tesla are likely to want to back another Musk venture.”\n\nFor now, the reality for investors is Tesla is the only way to bet on Musk’s vision. The immediate risk is the stock’s valuation, which is getting close to dangerous territory. On a technical level, the shares had been close to being considered overbought earlier this week. When they last reached that level in early October, the stock fell 10% over the next seven sessions.\n“In the short term, it’s probably ready for a bit of a cooling off type of period after having that all-time high,” Mulberry said.\nBut to long-term Musk believers, the valuation may indeed be a short-term concern. Over the next few years, however, many see Tesla as a buy regardless of the price — possibly even more than SpaceX.\n“I fully believe that at some point there will be a commercial mission to Mars, but probably not in my lifetime,” said Mulberry, who is 51 years old. “Does that mean I want to invest in that stock today? You’d have to have a really long view of that, whereas you could see the impact of robotaxis and robots probably in the next three to five years.”\n\nSign up for Yahoo Finance's Week in Tech\n\nBy subscribing, you are agreeing to Yahoo's\n\nTerms\n\nand\n\nPrivacy Policy\n\nSubscribe\nTop Tech News\nMicron Technology Inc., the largest US maker of computer memory chips, gave an upbeat forecast for the current quarter, a sign that surging demand and supply shortages are allowing the company to charge more for products.\nThe growing acrimony over the biggest deal in Hollywood is spilling into the open. On Wednesday, Warner Bros. Discovery Inc., the parent of HBO and CNN, advised its shareholders to reject a hostile takeover bid by Paramount Skydance Corp. in favor of its original agreement with streaming giant Netflix Inc.\nOpenAI and Anthropic are looking to expand their office footprints in Dublin, a move that underscores both firms’ growing presence in Europe and the race to boost global uptake of their artificial intelligence services.\nApple Inc. is making changes to its iOS software in Japan to comply with a new local law aimed at fostering competition, part of broader efforts by the iPhone maker to adapt to regulations around the world.\nThe Academy Awards will move to Alphabet Inc.’s YouTube service in 2029, ending more than a half century on the ABC network and more than 70 years on broadcast TV.\nEarnings Due Thursday\nNo major earnings expected\n—With assistance from Matt Turner, David Watkins and Nathaniel Popper.\nMost Read from Bloomberg Businessweek\nThe Cracks in Crumbl’s Cookie Empire Are Showing\nUniqlo Founder and Japan’s Richest Man Loves a $32 Pair of Slacks\nDonald and Melania Trump’s Terrible, Tacky, Seemingly Legal Memecoin Adventure\nPrivate Equity Is Ruining a Beloved Fly-Fishing Brand, Retailers Say\nOracle’s $300 Billion AI Bet Has Fast Become a Bubble Barometer\n©2025 Bloomberg L.P.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:57:46",
      "Source": "Coinspeaker",
      "Title": "Kraken-Backed xStocks Has Gone Live on TON Blockchain",
      "URL": "https://finance.yahoo.com/m/22348a09-5695-3217-95c4-3b482c036797/kraken-backed-xstocks-has.html",
      "Content": "Kraken-Backed xStocks Has Gone Live on TON Blockchain\n\nGodfrey Benjamin\nThu, December 18, 2025 at 6:57 AM PST 2 min read\n\nIn this article: KRAK.PVT\n\nTSLA\n\nNVDA\n\n^GSPC\n\nKraken exchange announced that xStocks, the gold standard for tokenized equities, has launched on TON , the open network linked to Telegram.\nThis means that users of the social media platform will have access to tokenized versions of US stocks and Exchange Traded Funds (ETFs) through the app’s wallet.\n\nNo Broker Account, No Complex Onboarding With xStocks With xStocks now live on the TON network, users have exposure to permissionless, onchain U.S. equity.\nAs a result of this integration, users can buy, hold, and transfer tokenized representations of equities like Tesla, Nvidia, and the S&P 500 ETF without going out of the messaging app.\nResearch and strategy lead at Unstoppable Wallet, Dan Dadybayo, acknowledged this as a big win.\n\n“Embedding tokenized U.S. stocks into Telegram Wallet is a massive UX unlock,” in Dadybayo&#8217;s opinion. This development makes “stocks start to feel like a native internet object, not a brokerage product.”\nHe applauded the initiative by further stating that several users across the U.S. or EU may be getting such access for the first time ever. They need no broker account and no complex onboarding.\nIt is fractional by default, and all that is required for access is one tap. The launch is supported by seamless integration with non-custodial TON Wallet, which is natively embedded in Telegram.\nApart from the expansion of xStocks’ use cases, this integration marks a major advancement for real-world asset adoption on TON.\nxStocks Experiences Quick Adoption in Six Months Crypto exchange Backed officially launched xStocks in mid-2025 , bridging the gap between Traditional Finance (TradFi) and decentralized finance (DeFi).\nThis made over 60 tokenized equities available across major platforms including Bybit, Kraken, and the Solana blockchain.\nOn xStocks, users can trade blue-chip equities like Apple, Tesla, Amazon, NVIDIA, and Microsoft.\nThey are also privy to ETFs and shares of emerging crypto-native firms, all secured and settled at blockchain speed.\nIn August, Kraken, Backed Finance and TRON DAO collaborated to integrate “xStocks” with the TRON blockchain.\nAbout three months ago, xStocks pushed out into the European Union, allowing clients in the region to trade digital versions of popular equities.\nRead original story Kraken-Backed xStocks Has Gone Live on TON Blockchain by Godfrey Benjamin at Coinspeaker.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:37:07",
      "Source": "Investor's Business Daily",
      "Title": "Stock Market Today: Dow Rises On Surprise Inflation Data; Nvidia, Tesla Rally (Live Coverage)",
      "URL": "https://finance.yahoo.com/m/3c54efeb-8d61-3f56-90ba-bb013f26d2f0/stock-market-today%3A-dow-rises.html",
      "Content": "Stock Market Today: Dow Rises On Surprise Inflation Data; Nvidia, Tesla Rally (Live Coverage)\n\nSCOTT LEHTONEN\nThu, December 18, 2025 at 6:37 AM PST 2 min read\n\nIn this article: NVDA\n\nKMX\n\nDRI\n\nBIRK\n\nMU\n\nStock Market Today: The Dow Jones index rose Thursday on a surprise CPI inflation report. Nvidia stock and Tesla rallied.\n\nContinue Reading\n\nCondiciones y Política de privacidad\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:21:00",
      "Source": "GlobeNewswire",
      "Title": "SunCar Technology Reports Third Quarter 2025 Results",
      "URL": "https://finance.yahoo.com/news/suncar-technology-reports-third-quarter-142100758.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nSunCar Technology Reports Third Quarter 2025 Results\n\nSunCar Technology Group Inc.\nThu, December 18, 2025 at 6:21 AM PST 15 min read\n\nIn this article: SDA\n\nTSLA\n\nNEW YORK, Dec. 18, 2025 (GLOBE NEWSWIRE) -- SunCar Technology Group Inc. (the \"Company\" or \"SunCar\") (NASDAQ: SDA), an innovative leader in AI cloud-based B2B auto eInsurance and auto services in China, today reported third quarter 2025 financial results for the quarter ended September 30, 2025.\n\nThird Quarter 2025 Highlights\nRevenue for third quarter 2025 increased 6% to $115.8 million, compared to $109.6 million in third quarter 2024\nNet Income of $1.4 million, a $2.8 million increase compared to a net loss of $1.4 million in the third quarter of 2024\nAdjusted EBITDA for the third quarter 2025 increased 128% to $4.9 million compared to $2.2 million for the third quarter of 2024\nTesla: Successfully launched insurance business at authorized Tesla body repair centers. SunCar is partnering with Tesla to help the automaker penetrate third- and fourth-tier cities, offering better service without the need for delivery centers\nNIO: NIO leveraged the advantages of SunCar’s order processing platform to reduce delivery times by 50% and lower the cost of vehicle deliveries\nXPeng: Collaborated with XPeng's branded stores on insurance renewals, helping to improve renewal rates at these stores\nLi Auto: Launched a successful online pilot program in Shanghai, Chongqing, Xinjiang, Qingdao, Inner Mongolia, and Anhui. Nationwide rollout of the program is planned for 2026\n\nManagement Commentary\n“I’m proud of the team for achieving positive net income this quarter, a key milestone that underscores SunCar is growing profitably. Alongside our leadership in AI-powered auto insurance and services, this performance reflects a strong and scalable profit model. Our deep EV partner relationships—particularly our expanding AI co-development efforts with leaders like Tesla and Xpeng—continue to drive both growth and value creation,” said Zaichang Ye, Chairman and CEO of SunCar.\nInsurance Review\nTesla: Successfully launched insurance business at authorized Tesla body repair centers. SunCar is partnering with Tesla to help the automaker penetrate third- and fourth-tier cities, offering better service without the need for delivery centers in those cities\nNIO: Leveraged the SunCar platform’s innovative order processing technology to reduce delivery times by 50% and lower the cost of vehicle deliveries\nXPeng: Collaborated with XPeng's branded stores on insurance renewals, dramatically improving the renewal rates at these stores\nLi Auto: Launched successful online insurance pilot programs in Shanghai, Chongqing, Xinjiang, Qingdao, Inner Mongolia, and Anhui with nationwide rollout planned for 2026\nLeapmotor: SunCar’s system usage increased as Leapmotor expanded its rollout of SunCar’s solution from directly operated stores to dealer partner stores.\nXiaomi: Collaborated with Xiaomi to create a new insurance/renewal customer service process, jointly setting an industry benchmark for EV customer service\nHuawei : HIMA has completed internal testing and successfully completed testing of SunCar’s platform on the HarmonyOS app. The next phase will be full-scale commercial deployment.\nStrengthened Property & Casualty (“P&C”) Relationships: Continued to strengthen P&C partnerships, signing strategic cooperation agreements with Huatai P&C Insurance and Bohai P&C Insurance\nInsurance Agency Acquisitions: Completed the acquisition of Jiayi Auto Insurance and initiated the acquisition of Dalian Jinhainiu Insurance, expanding the Company's regional coverage and business development efforts.\n\nStory Continues\nAuto Services Review\nStrawberry Music Festival: SunCar was contracted to provide VIP transport services for artists at the Strawberry Music Festival, the largest music festival in China. This contract marks the beginning of a strategic partnership with Strawberry. It highlights SunCar’s nationwide service capabilities and expertise working with event management customers. The customer will hold 25 events across China in 2026. The contract is estimated to be worth approximately $3 million per year for the next 3 years.\nChina Resources Group: SunCar managed concierge chauffeur services for the first nationwide event launched by China Resources Group. The Company received praise from both partners and clients, successfully supporting the first roll-out of the customer's high-end concierge services.\nCAR Inc(“CAR”): SunCar signed a strategic partnership with CAR to jointly develop the SMB market\nZheshang Bank: SunCar was selected to provide global business travel privileges for VIP clients of the Bank, with the project officially launching in December.\n\nIntegrated Services\nSunCar is gradually realizing synergies between its Auto Insurance and Auto Services segments. Below are examples of two projects awarded because the Company offers integrated Auto Insurance and Auto Services:\nChina Life P&C: Auto Services won its first bid for the non-accident roadside assistance service project at China Life’s headquarters, with the opportunity to sign additional cooperation agreements with provincial branches of China Life P&C for in-policy roadside assistance services.\nPICC and Ping An: The Company initiated the technical integration process for chauffeur services with the headquarters of PICC and Ping An. PICC's chauffeur service went live in July 2025 and Ping An P&C's service will go live by the end of 2025. These agreements may expand into future cooperation with the provincial branches of PICC and Ping An.\n\nAI Product Development\nSunCar continues to integrate ByteDance’s Doubao LLM into its database of 60 million vehicles, creating new AI-powered applications for its partners. These applications include dynamic policy pricing, claims risk assessment, predictive maintenance, service provider ratings, image and video analytics, and driver data analytics.\nThird Quarter 2025 Financial Results\nNet Income of $1.4 million for the three months ended September 30, 2025, a $2.8 million increase compared to a net loss of $1.4 million for the same period in 2024.\nRevenue increased by 6% to $115.8 million for the three months ended September 30, 2025, compared to $109.6 million for the same period in 2024. Revenue for the first nine months of September 2025 increased 8% to $338.1 million, compared to $312.7 million for the first nine months of 2024\nAuto Insurance revenue increased by 13% to $51.4 million for the three months ended September 30, 2025, compared to $45.4 million in the prior-year period, driven by a higher volume of insurance policies sold through SunCar’s platform\nTechnology Services revenue increased by 0.4% to $12.2 million for the three months ended September 30, 2025, compared to $12.2 million in the third quarter of 2024.\nAuto Services revenue increased slightly to $52.2 million for the three months ended September 30, 2025, compared to $52.1 million for the same period last year.\nOperating costs and expenses increased to $112.9 million in the third quarter of 2025, from $109.4 million in the third quarter of 2024.\nIntegrated service costs rose to $52.8 million for the third quarter of 2025, from $51.2 million in the prior-year quarter.\nPromotional service expenses increased to $51.0 million for the third quarter of 2025, from $42.7 million in the third quarter of 2024, reflecting continued investments to drive market expansion.\nSelling expenses decreased to $4.9 million for the three months ended September 30, 2025, compared to $10.5 million in the prior-year period, primarily due to a decrease in marketing and distribution expenses.\nGeneral and administrative expenses decreased to $2.5 million, from $3.5 million in the third quarter of 2024.\nResearch and development expenses grew to $1.7 million, up from $1.4 million in the third quarter of 2024, reflecting continued investment in product development and technology enhancement.\nOperating profit increased to $2.9 million in the third quarter of 2025, compared to $0.2 million in the prior-year period.\nAdjusted EBITDA, a non-GAAP metric that excludes certain non-recurring and non-cash items, is helpful in evaluating our operational performance alongside GAAP metrics. Adjusted EBITDA for the third quarter of 2025 increased 128% to $4.9 million, compared to $2.2 million in the third quarter of 2024.\n\nNet Income (Loss) and Adjusted EBITDA\nThe Company believes that Adjusted EBITDA, as defined below, is useful in evaluating our operational performance distinct and apart from certain expenses that may not be indicative of our recurring core business operating results and non-operational expenses. Adjusted EBITDA is defined as Net loss adjusted for depreciation and amortization, financial expenses, net, investment income, other non-recurring income, net, income tax benefit, share-based compensation, and non-recurring expenses related to capital raises.\nNet Loss Margin is defined as net loss divided by total revenues, and Adjusted EBITDA Margin is defined as Adjusted EBITDA divided by total revenues.\nThe following tables reconcile Net loss to Adjusted EBITDA for the nine months ended September 30, 2024 and 2025.\n\nFor the nine months ended September 30,\n\n2024\n\n2025\n\n(In thousands)\nNet loss\n\n$\n(61,573\n)\n\n$\n(4,126\n)\nDepreciation and amortization\n\n3,320\n\n4,622\n\nFinancial expenses, net\n\n3,463\n\n3,143\n\nInvestment income\n\n(418\n)\n\n(358\n)\nOther non-recurring (income)/loss, net\n\n(769\n)\n\n2,208\n\nIncome tax expense\n\n931\n\n840\n\nShare-based compensation (1)\n\n63,161\n\n1,117\n\nTransaction fees (2)\n\n79\n\n15\n\nAdjusted EBITDA\n\n$\n8,194\n\n$\n7,461\n\nNet loss Margin\n\n-19.7%\n\n-1.2%\n\nAdjusted EBITDA Margin\n\n2.6 %\n\n2.2 %\n\nAbout SunCar Technology Group Inc.\nFounded in 2007, SunCar is transforming the customer journey for auto services and auto insurance in China, the largest passenger vehicle market in the world. SunCar develops and operates AI cloud-based platforms that seamlessly connect drivers with a wide range of auto services and insurance coverage options through a nationwide network of sales partners. As a result, SunCar has established itself as the leader in China in the auto eInsurance market for electric vehicles and the B2B auto services market. The Company's intelligent cloud platform empowers its enterprise customers to access, manage, and optimize their auto eInsurance and auto service offerings. Through SunCar, drivers gain access to a wide variety of high-quality services from tens of thousands of independent providers, all from a single application. For more information, please visit: https://suncartech.com .\n\nForward-Looking Statements\nThis press release contains information about the Company's view of its future expectations, plans, and prospects that constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Actual results may differ materially from historical results or those indicated by these forward-looking statements as a result of a variety of factors including, but not limited to, risks and uncertainties associated with its ability to raise additional funding, its ability to maintain and grow its business, variability of operating results, its ability to maintain and enhance its brand, its development and introduction of new products and services, the successful integration of acquired companies, technologies and assets into its portfolio of products and services, marketing and other business development initiatives, competition in the industry, general government regulation, economic conditions, dependence on key personnel, the ability to attract, hire and retain personnel who possess the technical skills and experience necessary to meet the requirements of its clients, and its ability to protect its intellectual property. -For a detailed discussion of these risks, please refer to the Company's Annual Report on Form 20-F and other filings with the Securities and Exchange Commission. Forward-looking statements speak only as of the date of this press release, and the Company undertakes no obligation to update or revise these statements, except as required by law.\nContact Information:\nSunCar:\nInvestor Relations: Mr. Breaux Walker\nEmail: IR@suncartech.com\nLegal: Ms. Li Chen\nEmail: chenli@suncartech.com\nU.S. Investor Relations\nTom Cook\nManaging Director\nICR\nEmail: Tom.Cook@icrinc.com\nSOURCE SunCar Tech\n\nSUNCAR TECHNOLOGY GROUP INC\n\nCONDENSED CONSOLIDATED BALANCE SHEETS (UNAUDITED)\n\n(In U.S. Dollar thousands, except for share and per share data, or otherwise noted)\n\nAs of December 31,\n\nAs of September 30,\n\n2024\n\n2025\n\nASSETS\n\nCurrent assets\n\nCash\n\n$\n26,865\n\n$\n23,704\n\nRestricted cash\n\n2,647\n\n2,789\n\nShort-term investments\n\n20,985\n\n21,643\n\nAccounts receivable, net\n\n75,605\n\n75,338\n\nPrepaid expenses and other current assets, net\n\n70,171\n\n96,572\n\nTotal current assets\n\n196,273\n\n220,046\n\nNon-current assets\n\nLong-term investment\n\n274\n\n281\n\nProperty, software and equipment, net\n\n27,664\n\n24,768\n\nDeferred tax assets, net\n\n10,453\n\n11,355\n\nOther non-current assets\n\n11,458\n\n17,289\n\nRight-of-use assets\n\n606\n\n237\n\nTotal non-current assets\n\n50,455\n\n53,930\n\nTOTAL ASSETS\n\n$\n246,728\n\n$\n273,976\n\nLIABILITIES AND SHAREHOLDERS’ EQUITY\n\nCurrent liabilities\n\nShort-term loan\n\n$\n83,597\n\n$\n87,540\n\nAccounts payable\n\n56,812\n\n65,977\n\nDeferred revenue\n\n2,421\n\n2,285\n\nTax payable\n\n1,361\n\n2,195\n\nAccrued expenses and other current liabilities\n\n5,792\n\n7,609\n\nAmount due to related parties, current\n\n6,238\n\n6,671\n\nOperating lease liability, current\n\n544\n\n137\n\nTotal current liabilities\n\n156,765\n\n172,414\n\nNon-current liabilities\n\nOperating lease liability, non-current\n\n21\n\n32\n\nAmount due to a related party, non-current\n\n22,761\n\n11,813\n\nWarrant liabilities\n\n947\n\n947\n\nTotal non-current liabilities\n\n23,729\n\n12,792\n\nTotal liabilities\n\n$\n180,494\n\n$\n185,206\n\nCommitments and contingencies (Note 17)\n\nShareholders' equity\n\nClass A Ordinary shares (par value of US$0.0001 per share; 400,000,000 Class A Ordinary shares authorized as of December 31, 2024 and September 30, 2025, respectively; 51,845,493 and 51,645,493 Class A Ordinary shares issued and outstanding as of December 31, 2024, respectively; 59,208,351 and 55,569,794 Class A Ordinary shares issued and outstanding as of September 30, 2025, respectively)\n\n$\n5\n\n$\n6\n\nClass B Ordinary shares (par value of US$0.0001 per share; 100,000,000 Class B December 31, 2024 and September 30, 2025, respectively; 46,659,565 and 46,439,565 Class B Ordinary shares issued and outstanding as of December 31, 2024 and September 30, 2025, respectively)\n\n5\n\n5\n\nAdditional paid in capital\n\n208,701\n\n233,369\n\nAccumulated deficit\n\n(195,387\n)\n\n(202,872\n)\nAccumulated other comprehensive loss\n\n(1,432\n)\n\n(1,376\n)\nTotal SUNCAR TECHNOLOGY GROUP INC’s shareholders' equity\n\n11,892\n\n29,132\n\nNon-controlling interests\n\n54,342\n\n59,638\n\nTotal shareholders’ equity\n\n66,234\n\n88,770\n\nTOTAL LIABILITIES AND SHARESHOLDERS’ EQUITY\n$\n246,728\n\n$\n273,976\n\nSUNCAR TECHNOLOGY GROUP INC\n\nUNAUDITED CONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE LOSS\n\n(In U.S. Dollar thousands, except for share and per share data, or otherwise noted)\n\nFor the nine months ended September 30,\n\n2024\n\n2025\n\nRevenues\n\nAuto eInsurance service\n\n$\n119,108\n\n$\n149,243\n\nTechnology service\n\n34,046\n\n36,549\n\nAuto service\n\n159,555\n\n152,292\n\nTotal revenues\n\n312,709\n\n338,084\n\nOperating cost and expenses\n\nIntegrated service cost\n\n(158,843\n)\n\n(154,286\n)\n\nPromotional service expenses\n\n(113,845\n)\n\n(145,109\n)\n\nSelling expenses\n\n(20,683\n)\n\n(15,867\n)\n\nGeneral and administrative expenses\n\n(44,079\n)\n\n(17,678\n)\n\nResearch and development expenses\n\n(33,625\n)\n\n(3,437\n)\n\nTotal operating costs and expenses\n\n(371,075\n)\n\n(336,377\n)\n\nOperating (loss)/income\n\n(58,366\n)\n\n1,707\n\nOther expenses\n\nFinancial expenses, net\n\n(3,463\n)\n\n(3,143\n)\n\nInvestment income\n\n418\n\n358\n\nOther income/(expense), net\n\n769\n\n(2,208\n)\n\nTotal other expenses, net\n\n(2,276\n)\n\n(4,993\n)\n\nLoss before income tax expense\n\n(60,642\n)\n\n(3,286\n)\n\nIncome tax expense\n\n(931\n)\n\n(840\n)\n\nNet loss\n\n(61,573\n)\n\n(4,126\n)\n\nLess: Net income attributable to non-controlling interests\n\n3,174\n\n3,359\n\nNet loss attributable to the Company’s ordinary shareholders\n\n(64,747\n)\n\n(7,485\n)\n\nNet loss per ordinary share\n\nBasic and diluted\n\n$\n(0.68\n)\n\n$\n(0.07\n)\n\nWeighted average shares outstanding used in calculating basic and diluted loss per share\n\nBasic and diluted\n\n95,221,846\n\n102,106,309\n\nOther comprehensive loss\n\nForeign currency translation difference\n\n813\n\n1,577\n\nTotal other comprehensive loss (income)\n\n813\n\n1,577\n\nTotal comprehensive loss\n\n(60,760\n)\n\n(2,549\n)\n\nLess: total comprehensive income attributable to non-controlling interest\n\n3,900\n\n4,880\n\nTotal comprehensive loss attributable to the SUNCAR TECHNOLOGY GROUP INC’s shareholders\n\n$\n(64,660\n)\n\n$\n(7,429\n)\n\nSUNCAR TECHNOLOGY GROUP INC\n\nUNAUDITED CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS\n\n(In U.S. Dollar thousands, except for share and per share data, or otherwise noted)\n\nCASH FLOWS FROM INVESTING ACTIVITIES\n\nPurchase of property, software and equipment\n\n(564\n)\n\n(256\n)\n\nProceeds from disposal of property, software and equipment\n\n43\n\n1\n\nPurchase of short-term investment\n\n(21,265\n)\n\n(358\n)\n\nProceeds from the redemption of short-term investment\n\n21,335\n\n234\n\nRepurchase of non-controlling interests\n\n-\n\n(2,214\n)\n\nPurchase of other non-current assets\n\n(9,341\n)\n\n(6,420\n)\n\nTotal net cash used in investing activities\n\n(9,792\n)\n\n(9,013\n)\n\nCASH FLOWS FROM FINANCING ACTIVITIES\n\nProceeds from short-term loan\n\n79,943\n\n86,633\n\nRepayments of short-term loan\n\n(80,569\n)\n\n(84,833\n)\n\nRepayments of payables to a related party\n\n(1,699\n)\n\n(11,398\n)\n\nShares repurchase\n\n-\n\n(15,760\n)\n\nProceeds from issuance of ordinary shares, net of issuance cost\n\n-\n\n41,631\n\nTotal net cash provided by financing activities\n\n(2,325\n)\n\n16,273\n\nEffect of exchange rate changes\n\n329\n\n793\n\nNet change in cash and restricted cash\n\n(10,606\n)\n\n(3,019\n)\n\nCash and restricted cash, beginning of the year\n\n$\n33,595\n\n$\n29,512\n\nCash and restricted cash, end of the year\n\n$\n22,989\n\n$\n26,493\n\nReconciliation of cash and restricted cash to the unaudited condensed consolidated balance sheets:\n\nCash\n\n$\n20,239\n\n$\n23,704\n\nRestricted cash\n\n$\n2,750\n\n$\n2,789\n\nTotal cash and restricted cash\n\n$\n22,989\n\n$\n26,493\n\nSupplemental disclosures of cash flow information:\n\nIncome tax paid\n\n$\n778\n\n$\n679\n\nInterest expense paid\n\n$\n2,816\n\n$\n2,636\n\nSupplemental disclosures of non-cash flow information:\n\nObtaining right-of-use assets in exchange for operating lease liabilities\n\n$\n93\n\n$\n156\n\nPrepaid financing expense related to issuance of GEM Warrants\n\n$\n987\n\n$\n382\n\nDecrease of accrued expenses and other current liabilities due to vest of restricted shares\n\n$\n311\n\n$\n311\n\nRepayments of payables to a related party\n\n$\n4,503\n\n$\n-\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:14:12",
      "Source": "Cryptonews",
      "Title": "Kraken-Backed xStocks Launch on TON, Bringing Tokenized US Stocks to Telegram",
      "URL": "https://finance.yahoo.com/m/5a9190e8-6054-32c7-af8b-eb699c006583/kraken-backed-xstocks-launch.html",
      "Content": "Kraken-Backed xStocks Launch on TON, Bringing Tokenized US Stocks to Telegram The tokens offer onchain price exposure without share ownership and are restricted by jurisdiction.\n\nAmin Ayan\nThu, December 18, 2025 at 6:14 AM PST 3 min read\n\nIn this article: KRAK.PVT\n\n^GSPC\n\nTSLA\n\nNVDA\n\nKraken-backed xStocks have gone live on the TON blockchain, allowing users to access tokenized versions of US stocks and exchange-traded funds directly inside Telegram through its built-in TON Wallet.\nKey Takeaways:\nxStocks bring tokenized US stocks and ETFs directly into Telegram via TON Wallet.\nThe tokens offer onchain price exposure without share ownership and are restricted by jurisdiction.\nThe launch tests whether mass distribution can drive adoption of tokenized equities.\n\nThe move brings tokenized equities into one of the world’s largest messaging platforms, potentially expanding their reach beyond traditional crypto trading venues, according to a Thursday announcement.\nThrough the integration, users can buy, hold and transfer onchain representations of assets such as Tesla, Nvidia and the S&#038;P 500 ETF without leaving the Telegram app.\nxStocks Offer Onchain Price Exposure Without Direct Share Ownership xStocks are designed as fully collateralized products, backed one-to-one by underlying equities and ETFs held through regulated partners.\nThe tokens track the price of the underlying assets but do not confer direct ownership of the shares, offering users price exposure in an onchain format.\nThe service is not available to US users and is restricted to jurisdictions where the tokens can be legally offered.\n\nxStocks has not registered under the US Securities Act of 1933, meaning distribution relies on jurisdictional controls.\nTokenized equities are not new, but previous attempts struggled to gain traction. Liquidity constraints, regulatory uncertainty and limited distribution often confined earlier offerings to niche crypto platforms.\nBy embedding tokenized stocks inside a mainstream messaging app, Kraken and its partners appear to be testing whether access and ease of use can unlock broader adoption.\nThe TON Foundation framed the launch as a step toward bringing real-world assets into everyday digital activity.\nTON Foundation president and CEO Max Crown said the integration allows users to hold and trade tokenized U.S. equities “with the same ease as sending a message,” while maintaining self-custody through TON Wallet.\n\nFor Telegram’s wallet ecosystem, the move builds on earlier experiments. Wallet in Telegram previously launched custodial access to stocks and ETFs through its Crypto Wallet product, which saw early demand despite limited geographic availability.\nTelegram claims more than 900 million global users, while TON Wallet reports close to 100 million users, giving xStocks immediate exposure to a large consumer base.\n\nStory Continues\nRWA Tokenization Gains Momentum Earlier this month, Libeara, the blockchain infrastructure platform backed by Standard Chartered’s venture arm SC Ventures, rolled out a new tokenized gold investment fund in Singapore, bringing one of the world’s oldest safe-haven assets onto digital rails.\nThe fund, launched in partnership with FundBridge Capital, allows professional investors to gain exposure to gold through blockchain-based tokens issued on Libeara’s ledger.\n\nIn a recent research, Web3 digital property firm Animoca Brands said that tokenization of RWAs could unlock a $400 trillion traditional finance market.\nAnimoca researchers Andrew Ho and Ming Ruan said the global market for private credit, treasury debt, commodities, stocks, alternative funds, and bonds represents a vast runway for growth.\n“The estimated $400 trillion addressable TradFi market underscores the potential growth runway for RWA tokenization,” they wrote.\nMeanwhile, according to the 2025 Skynet RWA Security Report, the market for tokenized RWAs could grow to $16 trillion by 2030 .\nRead original story Kraken-Backed xStocks Launch on TON, Bringing Tokenized US Stocks to Telegram by Amin Ayan at Cryptonews.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:23:13",
      "Source": "Insider Monkey",
      "Title": "Cantor Fitzgerald Bullish On Tesla, Inc. (TSLA)",
      "URL": "https://finance.yahoo.com/news/cantor-fitzgerald-bullish-tesla-inc-132313619.html",
      "Content": "Cantor Fitzgerald Bullish On Tesla, Inc. (TSLA)\n\nFatima Gulzar\nThu, December 18, 2025 at 5:23 AM PST 2 min read\n\nIn this article: TSLA\n\nOUST\n\nSERV\n\nTesla, Inc. (NASDAQ: TSLA ) is among the 8 High Growth EV Stocks to Buy Now.\nAccording to a research note by Cantor Fitzgerald analyst Andres Sheppard, President Trump’s support of a U.S. manufacturing program for inexpensive “tiny cars” might help businesses like Tesla, Inc. (NASDAQ:TSLA), Ouster Inc., and Serve Robotics, as reported by The Fly on December 8, 2025.\nAccording to Sheppard, the program includes vehicles with internal combustion engines and electric models that cost between $8,000 and $13,000. Production will adhere to Department of Transportation safety regulations and testing. The analyst added that the Trump administration is thinking of issuing an executive order to support the domestic robotics industry. This might accelerate the use of humanoids and autonomous delivery robots in the United States, the analyst added.\n\nSeparately, Reuters reported on December 11, 2025, that Tesla, Inc. (NASDAQ:TSLA)’s U.S. sales plummeted to a near three-year low in November, even with the automaker’s introduction of new, lower-cost models of its Model Y SUV and Model 3 compact sedan. Total U.S. sales fell by about 23% to 39,800 vehicles in November from 51,513 vehicles a year earlier, the lowest since January 2022, according to data from Cox Automotive.\nStephanie Valdez Streaty, director of industry insights at Cox Automotive, stated that demand for the less expensive “Standard” versions seemed to reduce sales of premium models rather than increase overall sales.\nTesla, Inc. (NASDAQ:TSLA) is a vertically integrated battery-electric vehicle manufacturer and developer of real-world artificial intelligence software, such as self-driving cars and humanoid robots.\nWhile we acknowledge the potential of TSLA as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 10 High-Growth EV Stocks to Invest In and 13 Best Car Stocks to Buy in 2025 .\nDisclosure. None\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:05:00",
      "Source": "Motley Fool",
      "Title": "Where Will Tesla Be in 1 Year?",
      "URL": "https://finance.yahoo.com/m/5eb95767-ceae-313f-bb92-bd1d2bc8ef1c/where-will-tesla-be-in-1-year%3F.html",
      "Content": "Where Will Tesla Be in 1 Year?\n\nLee Samaha, The Motley Fool\nThu, December 18, 2025 at 5:05 AM PST 5 min read\n\nIn this article: TSLA\n\nKey Points Tesla's production ramp, including Cybercabs, must be supported by regulatory approvals.\nThe company is likely to have a stronger second half in 2026 than its first.\nThis could be the year that Tesla finally delivers on its unsupervised full self-driving and robotaxi aims.\nThese 10 stocks could mint the next wave of millionaires ›\n\nTesla 's (NASDAQ: TSLA) management described 2025 as the \"year of the Y,\" but what will define 2026?\nOne way to describe it could be a year when the chips went all in. The roadmap was set during the third-quarter earnings call, and Tesla is betting big on full self-driving (FSD) and robotaxis. That said, it's likely to be a second-half-weighted year for the company, so investors need to be patient through the year. Here's why.\nA tale of two halves Tesla will release its fourth-quarter earnings in early 2026, and they are likely to show a sequential decline in electric vehicle ( EV ) deliveries, which could extend into the second quarter. The reason comes down to the pull-forward in deliveries in the U.S. third quarter, driven by the expiration of the federal EV tax credit at the end of September. That will undoubtedly lead to slowing sales in the fourth quarter.\nAs such, don't be surprised if Tesla's overall sales decline sequentially in the fourth quarter of 2025 and the first quarter of 2026. Indeed, the Wall Street analyst consensus is just such an event, before returning to sequential and year-on-year growth from the second quarter onwards.\nFurthermore, CFO Vaibhav Taneja has already informed investors that Tesla plans to increase capital spending \"increase substantially\" in 2026, from approximately $9 billion in 2025. The expenditures to support ramping up EV production (more on that shortly) and to invest in Tesla's AI initiatives, including the Optimus robot. For reference, CEO Elon Musk aims to have the third generation of the Optimus robot in the first quarter of 2026.\n\nTesla's big ramp-up in 2026 Musk couldn't have been any clearer on the earnings call in October, due to \"clarity on achieving full self-driving, unsupervised full self-driving, I should say, I feel confident in expanding Tesla's production. So that is our intent to expand as quickly as we can our future production.\"\nMusk went on to reiterate the determination to ramp production and said that the dedicated robotaxi, Cybercab, would be the \"single biggest expansion in production\" and start in the second quarter of 2026.\nTesla's big bet The production and capital spending ramp up, not to mention the focus on Cybercabs, speaks to Musk's confidence in the ongoing development of Tesla's robotaxi rollout and its unsupervised FSD. Musk recently affirmed via a post on X that robotaxi testing (without any occupant in the car) is underway in Austin, Texas. That would be somewhat in accordance with Musk's aim of having \"no safety drivers in at least large parts of Austin by the end of this year.\"\n\nStory Continues\nFurthermore, Tesla is hoping that the Netherlands vehicle authority (RDW) will approve its FSD in February 2026, an act that could open up a pathway to EUwide approval or, failing that, country-level approvals in Europe.\nThat would be a significant plus for opening new markets for Tesla's FSD software sales and laying the groundwork for the potential deployment of Tesla's robotaxis in Europe. It could also boost Tesla's EV sales, as FSD is a key differentiator for the company's EVs.\nWhere will Tesla be at the end of 2026? If all goes to plan, Tesla will continue to expand its robotaxi coverage, having achieved approval for unsupervised robotaxis (a feature a Cybercab requires, as Musk's initial conception is for them not to have steering wheels and pedals), and growth in EV sales from the second quarter onward.\nAs such, it could end the year with the robotaxi rollout in strong growth mode, backed by Cybercab deployment and FSD growth in Europe. In addition, Tesla's EV sales could receive a boost, with more releases of stripped-down versions of its Y and 3 models.\n\nAlternatively, the production ramp and capital spending ramp up may prove misplaced if Tesla doesn't achieve unsupervised robotaxi and FSD approvals (Europe) in a timely fashion. Risk is rising, but so is the potential reward.\nWhichever way, next year is the year of the all-in bet on FSD. Hopefully, Tesla and the regulatory bodies will deliver.\nDon’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $460,957 !*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $52,242 !*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $509,955 !*\nRight now, we’re issuing “Double Down” alerts for three incredible companies , available when you join Stock Advisor , and there may not be another chance like this anytime soon.\nSee the 3 stocks »\n*Stock Advisor returns as of December 15, 2025\nLee Samaha has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Tesla. The Motley Fool has a disclosure policy .\nWhere Will Tesla Be in 1 Year? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:02:29",
      "Source": "Yahoo Finance",
      "Title": "Rivian CEO on self-driving, designing AI chips, and why Tesla needs more competition",
      "URL": "https://finance.yahoo.com/news/rivian-ceo-on-self-driving-designing-ai-chips-and-why-tesla-needs-more-competition-130229526.html",
      "Content": "Rivian CEO on self-driving, designing AI chips, and why Tesla needs more competition\n\nPras Subramanian · Senior Reporter\nThu, December 18, 2025 at 5:02 AM PST 7 min read\n\nIn this article: RIVN\n\nTSLA\n\nVLKAF\n\nNVDA\n\nTSM\n\nAt Rivian's ( RIVN ) Autonomy and AI Day on Dec. 11, the pure-play EV maker outlined a whole range of tech and software products, with a focus on vertical integration — meaning doing everything from end to end in-house.\nCEO RJ Scaringe launched the company's new Autonomy platform at the event — and during a trying time for the EV sector, in which so far only Tesla has achieved profitability. While Rivian has achieved gross profits in recent quarters, actual bottom-line (or net) profits have been elusive.\n\nScaringe, who founded the company in 2011, saw Rivian go public in 2021 and reach stratospheric heights of $120 a share before the stock came back down to earth, now at $18. A crucial cash infusion from Volkswagen ( VWAGY ) of nearly $6 billion via a joint venture between the two companies has given Rivian much-needed breathing room.\nThe following is a condensed version of Yahoo Finance's conversation with Scaringe, touching on the company's path toward full self-driving (FSD), or personal L4, as Rivian calls it, building in-house chips, and where the overall EV industry is headed.\nYahoo Finance: Thanks for having us here, RJ. Rivian's Autonomy platform — talk to me about the progression from where Rivian is right now to what's going to come out in the near term and its vision for the future.\nRJ Scaringe: Autonomy has been a journey for us. We followed the launch of our Gen 1 vehicles at the end of 2021. In early 2022, we realized we wanted to do a clean-sheet approach to our Autonomy platform. So we started the process on that, and that involved developing a camera platform, redesigning the compute platform, and architecting the whole system around an AI-centric approach.\n\nThat was what went into our [current] Gen 2 vehicles that we ultimately launched in the middle of 2024, and the compute relative to our Gen 1 [vehicles] increased by about 10x — that's the inference on the vehicle. When we launched that, there was 55 megapixels of cameras, an array of radars, and that began the process of building the data stream to really train this model.\nOn our Gen 3 platform, it's [built using] an in-house chip ... This is a platform that can process 5 billion pixels per second, so that's roughly 5x the best in class today. This is very, very high processing capability. And that not only raises the performance level of this platform, but it also allows us to build the model more efficiently and more quickly.\nCurrently, Rivian offers Universal Hands-Free, which is akin to GM's Supercruise, and that will be expanded to more roads. What comes next?\nIn 2026, we'll add \"point to point.\" So you can get in the car from your driveway, type the address, and it does everything, hands-free, eyes-on, etc. ... But it's still supervised.\n\nStory Continues\nThen the platform expands to the next big step, which is eyes-off — and eyes-off is really powerful. That's when you can start to be in the car, be on your phone, be reading a book. Essentially, your role in driving the car diminishes to nothing. You're just a passenger.\nAnd then the next step beyond that is what we call personal Level 4, which is the idea that the vehicle can completely operate on its own, even without anybody in the car. And so things like picking the kids up from school, an airport drop-off, or grabbing groceries.",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:39:25",
      "Source": "GuruFocus.com",
      "Title": "Waymo in Talks to Raise More Than $15 Billion at Nearly $100 Billion Valuation",
      "URL": "https://finance.yahoo.com/news/waymo-talks-raise-more-15-123925476.html",
      "Content": "Waymo in Talks to Raise More Than $15 Billion at Nearly $100 Billion Valuation\n\nMoz Farooque ACCA\nThu, December 18, 2025 at 4:39 AM PST 1 min read\n\nIn this article: GOOG\n\nTSLA\n\nUBER\n\nLYFT\n\nThis article first appeared on GuruFocus .\nAlphabet Inc. ( GOOGL , Financials ) is stepping in to assist Waymo get a big new round of investment . The self-driving car company is said to be aiming to raise more than $15 billion. If the acquisition goes through, Waymo's value would be close to $100 billion, which is one of the biggest in the new robotaxi market.People who know about the negotiations said that the new money is meant to help Waymo keep rolling out autonomous ride services, which have been growing into additional U.S. cities over the last year. The business has been getting bigger fleets, better technology, and collaborating with local governments to make sure that safety and operating standards are followed.Alphabet's action shows that they still believe in the long-term future of self-driving cars, even while other companies like Tesla, Uber, and Lyft are still working on their own driver-assistance and ride-hailing plans. Waymo has made success recently, which implies that there is a growing demand for services that don't need a driver. More money might help speed up that move.Investors will be looking to see whether Waymo can close the transaction and utilize the extra money to accelerate up its ambitions to grow in 2026.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:27:00",
      "Source": "Barrons.com",
      "Title": "Tesla Stock Rebounds After AI Selloff. Why the Fears Didn’t Make Sense.",
      "URL": "https://finance.yahoo.com/m/449fc3c8-8626-3dc1-8213-5369f278dcc1/tesla-stock-rebounds-after-ai.html",
      "Content": "Tesla Stock Rebounds After AI Selloff. Why the Fears Didn’t Make Sense.\n\nAl Root\nThu, December 18, 2025 at 4:27 AM PST 1 min read\n\nIn this article: TSLA\n\nNVDA\n\nGEV\n\nThe shares got caught up in the artificial-intelligence panic after hitting a record high earlier in the day.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:00:39",
      "Source": "Yahoo Finance Video",
      "Title": "Amazon, Apple, Google, etc.: Why the Mag 7 needs to 'recalibrate'",
      "URL": "https://finance.yahoo.com/video/amazon-apple-google-etc-why-120039409.html",
      "Content": "Amazon, Apple, Google, etc.: Why the Mag 7 needs to 'recalibrate'\n\nYahoo Finance Video and Brian Sozzi\nThu, December 18, 2025 at 4:00 AM PST\n\nIn this video: TSLA\n\n^GSPC\n\nAAPL\n\nGOOG\n\nMSFT\n\nThe S&P 500 ( ^GSPC ) is concentrated primarily in the top ten technology stocks, according to Barclays.\nPNC Asset Management Group chief investment officer Amanda Agati, Yahoo Finance Senior Business Reporter Ines Ferré , and Yahoo Finance Senior Reporter Brooke DiPalma join Opening Bid host Brian Sozzi to discuss the market's concentration in tech and whether it's time for investors to start selling the \"Magnificent Seven.\"\nTo watch more expert insights and analysis on the latest market action, check out more Opening Bid .\n\nVideo Transcript\n\n00:00 Speaker A\nWhat I mentioned at the top about how much concentration risk there is in the S&P 500. What does that mean exactly for investors as we gear up for next year?\n00:10 Amanda\nWell, it's a great question and it's great to be with all of you again.\n00:15 Amanda\nIt's tough out there. Uh certainly for active managers to try and own enough of those top seven or top 10 names to really make a difference in terms of trying to keep up with, let alone outperform the S&P 500.\n00:30 Amanda\nSo for multi- asset investors, it's I think it's just going to continue to be a challenging environment to keep up with the S&P 500. It's hard to bet against them though.\n00:43 Amanda\nBut I think for 2026, it's going to be less about valuation multiple expansion and much more about what happens to the bottom 490 or 493, however you want to calculate it. I think that market breadth story, it was a little bit elusive this year, but I think it's going to come to the forefront next year and make a difference for multi- asset investor positioning.\n01:00 Speaker A\nAmanda, that's good points. Uh is the sell-offs we're seeing in Oracle and CoreWeave over the past few weeks, is that the signal Amanda to investors to start lightning the load on the Mag 7?\n01:11 Amanda\nI don't know that it's necessarily a signal to start selling. Again, we're not trying to bet against that story. It's it's very secular, thematic, long runway, still very much early innings. So we're all in on it. I think just the reality of where valuations have moved to is a little bit, I don't want to say nonsensical, but I just said nonsensical.\n01:28 Amanda\nIt feel it feels like we need to recalibrate a little bit. And so I think what's happening here is some seasonality, selling some of those winners and hoping that we get another crack at it, maybe early in the new year.\n01:40 Speaker A\nInez, this is all one big fat bubble, right?\n01:44 Ines\nLook, uh Sozzi, uh like Amanda was saying, I mean, yes, there is this concentration uh and also Goldman Sachs uh just recently put out a note as well talking about that concentration for earnings growth for next year and concentrated in the largest uh S&P 500, the largest seven stocks of the S&P 500.\n02:05 Ines\nHowever, like what Amanda was just saying, there is this expectation that for the other 493, that you will see a bit of an acceleration of earnings growth for those companies as well. So there may be a little tiny bit of broadening out when it comes to that.\n02:22 Ines\nBut a lot of this of course is the AI theme that we've been talking about and this is what Wall Street has been bullish on, is this AI theme that AI uh driven productivity will also be supporting earnings.\n02:37 Speaker A\nUh important point here Brooke is that within these 10 stocks that have uh essentially taken over the S&P 500 and taken over the minds of investors. These companies have earnings, the earnings are good and they're still accelerating. So I guess to Amanda's point, it's going to be hard to bet against these names next year.\n02:53 Brooke\nBrian, but I think what the key point here that investors have really weighed in on is the future outlook of these companies, the guidance that they're putting out.\n03:02 Brooke\nAnd I think that's why we're seeing investors fall disappointed based upon what these companies say will be the end results or what exactly the end result could potentially be for revenue when it comes to all the AI investments that they're currently making, the spending that they're currently doing.\n03:20 Brooke\nAnd and that's why sometimes we're not seeing the same return that we see from other uh stocks, other investments because of the fact that these these uh guidance, these outlook that these companies put out just doesn't meet the very high bar that these investors have set for these sort of companies.\n03:42 Brooke\nAnd also, we are seeing a bit of a different fold. Over the past three months, we've seen Tesla, Apple, and Alphabet outperform the broader uh Mag 7.\n03:51 Brooke\nAnd that's largely because of the fact that investors seem to be liking the way in which these companies are now pursuing AI. And so we're seeing this bit of a uh a differ, you know, a difference in what we're seeing in these latter parts of the month than maybe earlier this year when we really saw Nvidia, Amazon, Microsoft, as well as Meta really lead the way within this AI tech rally, especially over the summer months.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:00:02",
      "Source": "Barchart",
      "Title": "2 Option Trade Ideas To Consider This Thursday",
      "URL": "https://finance.yahoo.com/m/7f74816b-c588-3841-8bc3-bbf8e0508cb0/2-option-trade-ideas-to.html",
      "Content": "2 Option Trade Ideas To Consider This Thursday\n\nGavin McMaster\nThu, December 18, 2025 at 4:00 AM PST 3 min read\n\nIn this article: TSLA\n\nAAPL\n\nToday, we are using the stock screener to find stocks with a Buy rating and then looking at a couple of bullish option trade ideas.\nFirst the stock scanner:\nMore News from Barchart Oracle's Unusual Put Options Activity - A Contrarian Signal - Should Investors Buy ORCL Stock?\n3 Barchart Stock Screeners to Help You Find Better Call Option Trades\nHow to Buy CSCO for a 2.5% Discount, or Achieve a 19% Annual Return\nMarkets move fast. Keep up by reading our FREE midday Barchart Brief newsletter for exclusive charts, analysis, and headlines.\nWhich produces these results:\nThe two companies we’re going to look at that meet our criteria are Tesla (TSLA) and Apple (AAPL).\nTesla Bull Put Spread\nA bull put spread is a defined risk option strategy that profits if the stock closes above the short strike at expiry.\nTo execute a bull put spread an investor would sell an out-of-the-money put and then buy a further out-of-the-money put.\nThis bull put spread comes from the vertical spread screener on the TSLA page.\nThis bull put spread trade involves selling the January expiry $410 strike put and buying the $400 strike put.\nSelling this spread results in a credit of around $1.35 or $135 per contract. That is also the maximum possible gain on the trade. The maximum potential loss can be calculated by taking the spread width, less the premium received and multiplying by 100. That give us:\n\n10 – 1.35 x 100 = $865.\nIf we take the maximum gain divided by the maximum loss, we see the trade has a return potential of 15.61%.\nThe loss probability is 17.0%, although this is just an estimate.\nThe Barchart Technical Opinion rating is a 100% Buy with a Average short term outlook on maintaining the current direction.\nLong term indicators fully support a continuation of the trend.\nApple Bull Put Spread\nFor Apple, let’s also look at the Bull Put Spread results for January.\nLet’s use the first line item as an example. This bull put spread trade involves selling the January expiry $265 strike put and buying the $255 strike put.\nSelling this spread results in a credit of around $1.74 or $174 per contract. That is also the maximum possible gain on the trade. The maximum potential loss can be calculated by taking the spread width, less the premium received and multiplying by 100. That give us:\n10 – 1.74 x 100 = $826.\nIf we take the maximum gain divided by the maximum loss, we see the trade has a return potential of 21.07%.\nThe loss probability is 28.8%, although this is just an estimate.\nThe Barchart Technical Opinion rating is a 80% Buy with a Weakening short term outlook on maintaining the current direction.\n\nStory Continues\nLong term indicators fully support a continuation of the trend.\nRelative Strength just crossed below 50%. The market is indicating support for a bearish trend.\nConclusion\nThere you have two bullish trade ideas on two different stocks. Remember to always manage risk and have stop losses in place.\nPlease remember that options are risky, and investors can lose 100% of their investment. This article is for education purposes only and not a trade recommendation. Remember to always do your own due diligence and consult your financial advisor before making any investment decisions.\nOn the date of publication, Gavin McMaster did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:00:01",
      "Source": "Bloomberg",
      "Title": "Tesla’s ‘Musk Premium’ in Focus With SpaceX IPO on the Horizon",
      "URL": "https://finance.yahoo.com/news/tesla-musk-premium-focus-spacex-120001761.html",
      "Content": "Tesla’s ‘Musk Premium’ in Focus With SpaceX IPO on the Horizon\n\nJordan Fitzgerald\nThu, December 18, 2025 at 4:00 AM PST 6 min read\n\nIn this article: TSLA\n\n^GSPC\n\n(Bloomberg) -- Elon Musk is selling investors a future of driverless cars, robot assistants and life on Mars. The problem is there’s only one way to buy into his vision: Tesla Inc.’s stock.\nThe electric-vehicle maker’s shares, which hit their first record of the year on Tuesday, are up roughly 20% in the last four weeks. Since tumbling to a low on April 8 during the height of panic over the Trump administration’s tariffs, the stock has soared 111%, putting it among the 20 best performers in the S&P 500 Index.\n\nMost Read from Bloomberg\nHudson Tunnel Digging Work to Start as Boring Machines Ready\nNYC High Line-Area Building Floats $53 Million Bankruptcy Sale\nHow This Chameleon UK Location Became a Little-Known Hollywood Backdrop\nNew York Says Cab, Rideshare Insurance Rates to Rise 25%\nNew York Utility Says Queue for Large Power Users Has Tripled\nThe rally is a testament to Wall Street’s faith in Musk’s artificial intelligence ambitions, particularly since Tesla’s core auto business is struggling. But it has also made Tesla shares extremely expensive. At 214 times earnings over the next 12 months, the stock has the second highest valuation in the S&P 500, trailing only Warner Bros Discovery Inc. and far ahead of number three Palantir Technologies Inc., another high-flyer that trades at 178 times forward earnings.\n\n“The valuation doesn’t make any sense,” said Vikram Rai, portfolio manager and macro trader at First New York, which sold its Tesla position earlier this year after Musk and President Donald Trump had a very public fallout over social media.\nA Tesla representative didn’t reply to a request for comment.\nWith Musk’s SpaceX possibly going public next year, stock traders looking for “Elon exposure” will likely have another way to get it before long. The space exploration company is planning an insider share sale that would value it at $800 billion, making it the most expensive privately held business in the world. Its initial public offering would be the largest ever.\n\n“A SpaceX IPO could lead to some selling pressure on Tesla shares,” said Dmitry Shlyapnikov, an analyst at Horizon Investments who works with portfolio managers. “There are investors that own Tesla for exposure to Elon’s ideas and not for the car company attached to the ticker.”\nOf course, there’s another school of thought that a SpaceX public stock offering would shine a spotlight on Musk, giving Tesla another jolt of momentum.\n“Historically, when one of Musk’s companies achieves a major milestone, it tends to lift sentiment for the others,” said Adam Sarhan, chief executive officer of 50 Park Investments. “A high-profile SpaceX IPO could attract a fresh wave of investors who are drawn to his innovation story — and that enthusiasm often spills over into Tesla.”\n\nStory Continues\nSo far, Tesla’s stock price is getting a boost from the hype surrounding SpaceX, according to Bloomberg Intelligence analyst Steve Man. The missions of the two companies are interlinked, he said, describing a future where Tesla’s Optimus robots help with Musk’s ambition to colonize Mars, and SpaceX’s Starlink satellite system bolsters vehicle connectivity on earth.\n\nThe companies also share lofty valuations. But Tesla skeptics question whether the company’s fundamentals can support those numbers. Its sales are slowing and profits are falling, while regulations rise and consumers spend less on cars.\n“If you’ve been long Tesla stock, you’ve made money, there’s no denying it,” said Thomas Thornton, founder of Hedge Fund Telemetry, who has a small short position in Tesla. “It’s just bizarre to me because the fundamentals are so bad.”\n‘Double-Down on Elon’\nOptimists, on the other hand, point to Tesla’s growth prospects with opportunities in autonomous driving and robotaxis. Musk’s goal is to transform Tesla from an auto manufacturer to an artificial intelligence and robotics company, writing in a September X post that 80% of the firm’s profits will eventually come from robots.\n\n“We believe Tesla’s earnings are going to be growing at 30% to 35% over the next two to three years based on the innovation that they have in the automotive segment,” said Brian Mulberry, client portfolio manager at Zacks Investment Management, which owns the company’s shares.\nIf Musk can pull that off, Tesla’s stock market valuation would make more sense. If he can’t, that’s where SpaceX comes in. Publicly traded shares of SpaceX would give investors the opportunity to own a piece of Musk’s vision without Tesla’s baggage.\n“I think most investors will not want to double-down on Elon,” First New York’s Rai said. “That is a lot of risk to carry.”\nNeedham analyst Chris Pierce disagrees.\n“We don’t see investors making an either/or choice, but instead backing both companies,” he said. “Investors that have made money in Tesla are likely to want to back another Musk venture.”\n\nFor now, the reality for investors is Tesla is the only one way to bet on Musk’s vision. The immediate risk is the stock’s valuation, which is getting close to dangerous territory. On a technical level, the shares had been close to being considered overbought earlier this week. When they last reached that level in early October, the stock fell 10% over the next seven sessions.\n“In the short term, it’s probably ready for a bit of a cooling off type of period after having that all-time high,” Mulberry said.\nBut to long-term Musk believers, the valuation is what Mulberry described, a short-term concern. Over the next few years, however, many see Tesla as a buy regardless of the price — possibly even more than SpaceX.\n“I fully believe that at some point there will be a commercial mission to Mars, but probably not in my lifetime,” said Mulberry, who’s 51 years old. “Does that mean I want to invest in that stock today? You’d have to have a really long view of that, whereas you could see the impact of robotaxis and robots probably in the next three to five years.”\n\nTop Tech News\nMicron Technology Inc., the largest US maker of computer memory chips, gave an upbeat forecast for the current quarter, a sign that surging demand and supply shortages are allowing the company to charge more for products.\nThe growing acrimony over the biggest deal in Hollywood is spilling into the open. On Wednesday, Warner Bros. Discovery Inc., the parent of HBO and CNN, advised its shareholders to reject a hostile takeover bid by Paramount Skydance Corp. in favor of its original agreement with streaming giant Netflix Inc.\nOpenAI and Anthropic are looking to expand their office footprints in Dublin, a move that underscores both firms’ growing presence in Europe and the race to boost global uptake of their artificial intelligence services.\nApple Inc. is making changes to its iOS software in Japan to comply with a new local law aimed at fostering competition, part of broader efforts by the iPhone maker to adapt to regulations around the world.\nThe Academy Awards will move to Alphabet Inc.’s YouTube service in 2029, ending more than a half century on the ABC network and more than 70 years on broadcast TV.\nEarnings Due Thursday\nNo major earnings expected\n--With assistance from Matt Turner and David Watkins.\nMost Read from Bloomberg Businessweek\nThe Cracks in Crumbl’s Cookie Empire Are Showing\nDonald and Melania Trump’s Terrible, Tacky, Seemingly Legal Memecoin Adventure\nUniqlo Founder and Japan’s Richest Man Loves a $32 Pair of Slacks\nOracle’s $300 Billion AI Bet Has Fast Become a Bubble Barometer\nThe Prosperity Gap Between Big and Small Businesses\n©2025 Bloomberg L.P.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:00:00",
      "Source": "Fortune",
      "Title": "Rivian CEO says midprice EV sales are still 50% Tesla: ‘That’s not a reflection of a healthy market’",
      "URL": "https://finance.yahoo.com/news/rivian-ceo-says-midprice-ev-120000346.html",
      "Content": "Rivian CEO says midprice EV sales are still 50% Tesla: ‘That’s not a reflection of a healthy market’\n\nSasha Rogelberg\nThu, December 18, 2025 at 4:00 AM PST 2 min read\n\nIn this article: RIVN\n\nTSLA\n\nIt’s not that Americans don’t want electric vehicles, according to the chief executive of American EV-maker Rivian. It’s just that they don’t have many good options.\nAt the Fortune Brainstorm AI conference in San Francisco earlier this month, Rivian CEO RJ Scaringe pointed to the scant choices consumers have in picking a midprice EV, noting that Tesla has continued to dominate sales, making up about 50% of the market share, with few other competitors making an impression.\n\n“That&#8217;s not a reflection of a healthy market with lots of choice,” Scaringe said. “If you think of it as a consumer, you have 300 different internal combustion engine choices at that price or lower, and you have maybe one highly compelling EV choice.”\nEV demand in the U.S. has continued to lag behind other parts of the world, making up just about 5% of new car sales, according to November data from Edmunds. In China, meanwhile, EVs make up more than 50% of the auto market share, China Association of Automobile Manufacturers data shows. Battery-electric cars make up about 16% of the EU market share, per the European Automobile Manufacturers&#8217; Association.\nU.S. automakers are feeling the squeeze from middling demand, with Ford pivoting away from heavy EV investment, citing lackluster American interest. It announced this week it would take a $19.5 billion charge and refocus on gas- and hybrid-powered vehicles, discontinuing some larger EV models.\n\nSparking American’s EV curiosity Scaringe hopes his automaker’s own focus on more affordable EVs can rev up demand in the sector. Rivian’s R1, a seven-seat premium SUV, starts at about $70,000 and can run up to about $120,000. The R2, expected to launch in the first half of next year, will have a $45,000 price tag.\n“We see, with R2, an opportunity to really bring a whole host of new customers that haven&#8217;t had a choice that&#8217;s electric that really appealed to them yet,” Scaringe said.\n\nPrice appears to be at the forefront of the CEO’s mind. While automakers like Ford said the end of the $7,500 EV tax credit tempered demand for new cars, Scaringe reportedly took a different perspective . In a memo to employees, reported by the Wall Street Journal , Scaringe said the end of the incentive puts pressure on EV companies, including Rivian, to lower prices.\nBut increased competition has not always been greeted so fondly. Canada imposed a 100% tariff on Chinese EVs in 2024, hoping to protect the burgeoning domestic market of electric cars. Scaringe, however, sees room for his rivals in the U.S.\n\nStory Continues\n“I really think the constraint isn&#8217;t the demand side. I think it&#8217;s the supply side,” Scaringe said. “I do think that the existence of choice will help drive more penetration, and it actually creates a unique opportunity in the United States.”\nThis story was originally featured on Fortune.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 17
}