{
  "stock_id": "TSLA",
  "last_updated": "2025-12-19T20:11:35.789Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-20",
      "Time": "03:16:48",
      "Source": "Simply Wall St.",
      "Title": "Tesla (TSLA) Is Up 8.2% After New SPIE Megapack Deal in Europe - Has The Bull Case Changed?",
      "URL": "https://finance.yahoo.com/news/tesla-tsla-8-2-spie-191648475.html",
      "Content": "Tesla (TSLA) Is Up 8.2% After New SPIE Megapack Deal in Europe - Has The Bull Case Changed?\n\nSimply Wall St\nFri, December 19, 2025 at 11:16 AM PST 3 min read\n\nIn this article: TSLA\n\nIn mid-December 2025, SPIE announced a renewable three-year European framework agreement with Tesla to deploy Megapack-based battery energy storage systems, covering its expert subsidiaries and standardising legal and operational conditions for projects across multiple countries.\nThe deal points to Tesla’s energy segment becoming more embedded in Europe’s grid infrastructure, adding a second pillar of demand alongside its autonomous and robotics ambitions.\nAgainst this backdrop, we’ll now examine how the expanded Megapack partnership in Europe could reshape Tesla’s AI-and-autonomy-focused investment narrative.\n\nExplore 28 top quantum computing companies leading the revolution in next-gen technology and shaping the future with breakthroughs in quantum algorithms, superconducting qubits, and cutting-edge research.\nTesla Investment Narrative Recap Tesla’s investment case still rests on investors believing it can evolve from an automaker into an AI, autonomy and energy platform company. The SPIE Megapack deal reinforces the energy pillar, but the key near term catalyst remains progress and approvals on robotaxis, while regulatory pushback on self driving in places like California is the most immediate risk to that narrative.\n\nThe SPIE framework agreement matters because it ties Tesla’s Megapacks more closely to Europe’s grids just as analysts argue that energy could rival or exceed the auto segment in value. That connection makes the energy business an increasingly important offset to softer EV demand and the uncertainty around how quickly regulators will allow Tesla to scale paid autonomy services.\nYet investors also need to consider how fast regulators in the US and Europe actually sign off on Tesla’s self driving ambitions before assuming that...\nRead the full narrative on Tesla (it's free!)\nTesla's narrative projects $148.1 billion revenue and $15.4 billion earnings by 2028.\nUncover how Tesla's forecasts yield a $391.35 fair value , a 19% downside to its current price.\n\nExploring Other Perspectives 215 fair value estimates from the Simply Wall St Community span roughly US$70 to over US$2,700 per share, showing just how far opinions can diverge. Many are watching how quickly Tesla can convert its autonomy and robotaxi vision into approved, monetized services, since regulatory delays could weigh heavily on the business even if AI progress continues.\n\nExplore 215 other fair value estimates on Tesla - why the stock might be worth over 5x more than the current price!\nBuild Your Own Tesla Narrative Disagree with existing narratives? Create your own in under 3 minutes - extraordinary investment returns rarely come from following the herd.\n\nStory Continues\nA great starting point for your Tesla research is our analysis highlighting 1 key reward and 2 important warning signs that could impact your investment decision.\nOur free Tesla research report provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate Tesla's overall financial health at a glance.\n\nLooking For Alternative Opportunities? Right now could be the best entry point. These picks are fresh from our daily scans. Don't delay:\nThe latest GPUs need a type of rare earth metal called Neodymium and there are only 34 companies in the world exploring or producing it . Find the list for free.\nTrump's oil boom is here - pipelines are primed to profit. Discover the 22 US stocks riding the wave .\nUncover the next big thing with financially sound penny stocks that balance risk and reward .\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include TSLA .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "02:19:31",
      "Source": "Investor's Business Daily",
      "Title": "Tesla Bull Calls 2026 An 'Inflection Year' For Rivian With The Stock At Its Highest Since 2023",
      "URL": "https://finance.yahoo.com/m/98fc0798-3532-3686-ae84-ded812ad5da2/tesla-bull-calls-2026-an.html",
      "Content": "Tesla Bull Calls 2026 An 'Inflection Year' For Rivian With The Stock At Its Highest Since 2023\n\nKIT NORTON\nFri, December 19, 2025 at 10:19 AM PST 3 min read\n\nIn this article: RIVN\n\nTSLA\n\nRivian has been on a hot-streak since its \"Autonomy & AI Day,\" where the EV startup announced an in-house silicon AI chip and outlined its next-generation AI platform. In addition, a longtime Tesla bull raised his RIVN price target, calling 2026 an \"inflection year\" for the brand. Wedbush Securities analyst Dan Ives on Friday hiked his Rivian stock price target to 25 from 16, maintaining his outperform rating on the shares.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "01:43:13",
      "Source": "Reuters",
      "Title": "Morgan Stanley seen as front-runner for SpaceX IPO, sources say",
      "URL": "https://finance.yahoo.com/news/morgan-stanley-seen-front-runner-174313230.html",
      "Content": "Morgan Stanley seen as front-runner for SpaceX IPO, sources say\n\nEcho Wang, Joey Roulette and Milana Vinn\nFri, December 19, 2025 at 9:43 AM PST 4 min read\n\nIn this article: TSLA\n\nXAAI.PVT\n\nBy Echo Wang, Joey Roulette and Milana Vinn\nNEW YORK, Dec 19 (Reuters) - Morgan Stanley is emerging as a leading contender for a key role in SpaceX's blockbuster initial public offering, as the bank's close ties to CEO Elon Musk give it an edge in his decision, according to three people familiar with the matter.\n\nA selection process, ​or \"bake-off,\" for the IPO is still underway, with a select group of banks, including Morgan Stanley, Goldman Sachs and JPMorgan, vying for roles, four people familiar with the matter said, ‌adding that there is no certainty Morgan Stanley will secure the coveted \"lead left\" underwriting position, the sources said.\nMusk's ties to Morgan Stanley run deep, dating back at least 15 years, leaving it widely viewed as the leading contender to run the syndicate ‌of underwriters, three of the people said, though no banks have been selected yet and the discussions remain fluid.\nThe sources spoke on condition of anonymity because the discussions are confidential. Morgan Stanley, Goldman Sachs and JPMorgan declined to comment, while SpaceX did not respond to a request for comment.\n\nSpaceX is one of the world’s largest private companies and its potential IPO would be highly complex.\nWhile Musk has not yet picked the lead banks, a decision could come before the end of the year, with the full syndicate likely to be finalized afterward, two of the people added.\nThe people cautioned that while plans are progressing, the IPO ⁠remains contingent on market conditions, and SpaceX could choose to delay ‌or abandon the offering altogether.\nLINKS TO TESLA 'S IPO\nMorgan Stanley, which has advised Musk for years, was among the banks that took Tesla public in 2010, alongside Goldman Sachs, the lead left, JPMorgan and Deutsche Bank. Morgan Stanley later advised Musk and led the financing for his 2022 acquisition of Twitter, now X.\nMusk ‍recently tapped one of his Morgan Stanley bankers on that deal, Anthony Armstrong, to become chief financial officer of his artificial intelligence venture xAI.\n\nThe connection runs even deeper through Musk’s family office in Austin, Texas. Another former Morgan Stanley banker who advised Musk on various Wall Street dealings over the years, Jared Birchall, built and runs Excession, which manages his personal assets, Reuters previously reported.\nSTAFF MEMO\nIn a staff memo sent last week, SpaceX Chief Financial ​Officer Bret Johnsen informed staff that the company was preparing for a public offering in 2026.\n\"Whether it actually happens, when it happens, and at what valuation are still highly uncertain, but the ‌thinking is that if we execute brilliantly and the markets cooperate, a public offering could raise a significant amount of capital,\" Johnsen wrote.\n\nStory Continues\nReuters has previously reported that SpaceX is seeking to raise more than $25 billion in an IPO that could come next year, a sum that would make it one of the biggest public listings ever globally.\nThe decision to go public caught some by surprise, given SpaceX's status as one of the world's largest private companies.\n\nWhile Musk has long expressed a preference for keeping SpaceX private, people familiar with his thinking indicated that the company’s growing valuation and the success of its Starlink satellite-internet service have prompted a shift in strategy.\nSpaceX, long known for its dominant rocket launch business, has become the world's largest satellite operator through Starlink, a network of nearly 10,000 satellites beaming ⁠broadband internet to consumers, governments and enterprise customers.\nWhile there had been previous speculation about Starlink going public on ​its own, these people say the IPO could include both businesses, though the plans remain subject to change.\nAI FUELS NEED ​FOR CAPITAL\nSpaceX, Johnsen wrote in his email, would use the capital raised from an IPO to increase the flight rate of its next-generation Starship rocket under development and deploy AI data centers in space, an effort complementary to its Starlink business that would more closely tie the company to the AI boom.\n\nThe company would ‍also build \"Moonbase Alpha,\" a base on the lunar surface ⁠that Musk has mentioned. SpaceX is a core contractor in NASA's Artemis moon program with a $4 billion contract to land astronauts on the lunar surface using Starship.\nSending humans and robots to Mars has been Musk's long-held vision for SpaceX, with revenues from Starlink contributing to development of Starship, which is also envisioned to serve as a Mars transportation system.\nMusk, during ⁠his stint as a government efficiency czar with U.S. President Donald Trump, had pushed for a greater American focus on Mars and advocated for a former associate, Jared Isaacman, to lead NASA. Isaacman became NASA chief on Tuesday.\nStarlink remains SpaceX's ‌top revenue-generating business. The company is expanding the satellite network into the wireless market with Starlink Mobile, which it trademarked in October.\n(Reporting by Echo Wang and Milana Vinn ‌in New York and Joey Roulette in Washington; Editing by Dawn Kopecki, Jamie Freed and Nick Zieminski)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "01:31:06",
      "Source": "Benzinga",
      "Title": "Tesla's License To Sell And Make Vehicles In California Suspended By Judge For 30 Days, Elon Musk-Led Company Ordered To Rebrand 'Autopilot'",
      "URL": "https://finance.yahoo.com/news/teslas-license-sell-vehicles-california-173106555.html",
      "Content": "Tesla's License To Sell And Make Vehicles In California Suspended By Judge For 30 Days, Elon Musk-Led Company Ordered To Rebrand 'Autopilot'\n\nVishaal Sanjay\nFri, December 19, 2025 at 9:31 AM PST 3 min read\n\nIn this article: TSLA\n\nGM\n\nA California Administrative Law Judge has ruled that Tesla Inc.’s (NASDAQ: TSLA ) marketing around its Autopilot and full self-driving systems has been deceptive, and has since suggested punitive measures against the company and its operations in the state.\n30-Day Suspension of Sales And Manufacturing On Tuesday, Steve Gordon , the Director of the California Department of Motor Vehicles , said during a press briefing that a California court has recommended the suspension of Tesla’s license to sell and manufacture vehicles in the state for 30 days, according to a report by Business Insider.\nOn November 21, Judge Juliet Cox made a proposed decision on whether the automaker had misled consumers on its autonomous driving features, based on a lawsuit filed by the California DMV earlier this year.\n\nDon't Miss:\nMissed Nvidia and Tesla? RAD Intel Could Be the Next AI Powerhouse — Just $0.85 a Share\nAn EA Co-Founder Shapes This VC Backed Marketplace— Now You Can Invest in Gaming's Next Big Platform\nThe state regulator found Tesla’s branding of its driver assistance technologies as “Full Self-Driving” and “Autopilot” to be misleading, with the company’s website describing its FSD driver assistance system as being “designed to be able to conduct short and long-distance trips with no action required by the person in the driver’s seat.”\nYet, during the hearings, Attorney Matthew Benedetto , a member of Tesla’s legal team said, “Cars with Full Self-Driving capabilities are currently not capable of driving themselves.”\nThe proposed decision was sent to the DMV for consideration, but was withheld from the public, and will not be released until December 22.\n\nThe DMV, however, has decided not to pursue the suspension of its license to manufacture and has imposed a 90-day stay on the suspension of its license to sell, allowing the company sufficient time to amend its marketing practices and rebrand the term “Autopilot” across its marketing materials.\n“We want to be fair to them and give them a chance to see if they can find a resolution now that there is a ruling from the administrative law judge,” Gordon said.\nSee Also: Deloitte's #1 Fastest-Growing Software Company Lets Users Earn Money Just by Scrolling — Accredited Investors Can Still Get In at $0.50/Share.\nTesla Shares Touch New Record High Despite this regulatory headwind in its biggest domestic market, Tesla shares soared 3.07% to a new record high on Tuesday, closing at $489.88 per share, and are down 0.89% overnight.\nThis comes as optimism continues to mount regarding the company’s autonomous driving features, with CEO Elon Musk confirming this week that Tesla had begun testing its robotaxis in Austin without a human “safety monitor” in the passenger seat.\n\nStory Continues\nTesla shares score high on Momentum and Quality in Benzinga’s Edge Stock Rankings , with a favorable price trend in the short, medium and long terms. Click here for deeper insights into the stock, its peers and competitors.\nRead More:\nGM-Backed EnergyX Is Solving the Lithium Supply Crisis — Invest Before They Scale Global Production\n$100k+ in investable assets? Match with a fiduciary advisor for free to learn how you can maximize your retirement and save on taxes – no cost, no obligation.\n\nPhoto Courtesy: Jonathan Weiss / Shutterstock.com\nUp Next: Transform your trading with Benzinga Edge's one-of-a-kind market trade ideas and tools. Click now to access unique insights that can set you ahead in today's competitive market.\nGet the latest stock analysis from Benzinga:\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Tesla's License To Sell And Make Vehicles In California Suspended By Judge For 30 Days, Elon Musk-Led Company Ordered To Rebrand 'Autopilot' originally appeared on Benzinga.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "01:30:00",
      "Source": "Yahoo Finance Video",
      "Title": "Strategist says this Mag 7 name is the 'sneakiest' AI play",
      "URL": "https://finance.yahoo.com/video/strategist-says-mag-7-name-173000008.html",
      "Content": "Strategist says this Mag 7 name is the 'sneakiest' AI play\n\nYahoo Finance Video and Brian Sozzi\nFri, December 19, 2025 at 9:30 AM PST\n\nIn this video: AMZN\n\nMSFT\n\nTSLA\n\nGOOG\n\nAAPL\n\nAhead of 2026's kick-off, investors are putting heavy consideration into how to play the AI trade . B. Riley Wealth chief market strategist Art Hogan joins Opening Bid with Brian Sozzi to talk about his expectations for the Magnificent Seven and the broader AI trade.\nTo watch more expert insights and analysis on the latest market action, check out more Opening Bid .\n\nVideo Transcript\n\n00:00 Speaker A\nWhat is the future of the AI trade and how are you playing it next year? Art, is it Max 7 or bust for you?\n00:09 Art\nUh, it's not. and I'll tell you this. I think this was the year after uh three years of AI uh being rolled out and the revolution starting where investors clearly had to start to differentiate. Now the differentiation point really came to the fact that\n00:27 Art\nif you were spending massive amounts of money on CAPEX to build out your large language model, that's fine if it's coming from free cash flow. If you're putting a lot of debt out there, your return on invested capital is starting to be called into question and rightly so. We know there's six large language models being developed right now. We know there's not going to be six at the end of this revolution or at the end of the rainbow here.\n00:52 Art\nSo the winners will have to be picked and largely right now that's happening in a form of how much debt are you laying out to make this happen and how long is it going to take to return that investment? So I I agree with one of the hits that you just put on and I think Google uh is in the in the lead. It goes back and forth between chat GPT 4.0 and open AI. We really don't know if they'll ever become public, so that's not an investment opportunity. But where you want to be careful is in those names that continue to lay out debt.\n01:14 Art\nUh companies like uh Corven and Oracle clearly have been the poster child of you're spending too much money and we don't think you're going to get it back.\n01:21 Speaker A\nAre you unsettled by the valuations on some of these AI names?\n01:26 Art\nWell, let's look at Nvidia trading at 24 times next year's earnings. Uh they've laid they've laid out what the demand is for the Blackwell and and they'll have another offering by the middle of next year. So clearly, they are at the tip of the sword of where the CAPEX is going and they're profiting from it and here and now. So there's no question about their return on invested capital. So in in that case, I'm not whatsoever concerned.\n01:46 Art\nUh Alphabet's trading at a reasonable multiple, 33 times forward, continues to have uh strong free cash flows and, you know, all the concerns that we had about the relationship with Google, I mean with Apple. Now they're going to be a partner with Apple with Gemini. So that's going to be where your smart Apple Apple intelligence comes from. So in those two names, no. I think when you move down the ladder and look at some of the names like Meta,\n02:05 Art\nTesla, I don't throw into that basket because it's not exactly uh artificial intelligence play.\n02:08 Speaker A\nWe're still trying to figure out what what Tesla is at this point, Art. You're not alone.\n02:10 Art\nYeah, I I still think you know what? I think they're trying to figure it out too. It's always about the future and what they're able to deliver. But I think the sneakiest of the uh AI plays is Apple and continues to be. Everyone said they had no AI strategy, all of a sudden they've delivered that. They've been blowout returns for the iPhone 17 and they're they're going to buy it. They're not going to build it. So, you know, they're going to partner with uh Alphabet here than somebody else internationally and and clearly they will be the winner and that's how we'll likely consume artificial intelligence next year.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "01:07:55",
      "Source": "Yahoo Finance Video",
      "Title": "Big 3 automakers scaling back EV plans for 2026",
      "URL": "https://finance.yahoo.com/video/big-3-automakers-scaling-back-170755708.html",
      "Content": "Big 3 automakers scaling back EV plans for 2026\n\nYahoo Finance Video\nFri, December 19, 2025 at 9:07 AM PST\n\nIn this video: F\n\nGM\n\nSTLA\n\nRIVN\n\nTSLA\n\nThe Big 3 automakers Ford ( F ), General Motors ( GM ), and Stellantis ( STLA ) are all paring back their plans for EVs in 2026. Earlier this week, Ford announced major pivots toward hybrid vehicles for 2026 while cutting its F-150 Lightning electric pickup line.\nYahoo Finance senior autos reporter Pras Subramanian outlines the performance of each automaker's EV segments.\nTo watch more expert insights and analysis on the latest market action, check out more Market Catalysts .\n\nVideo Transcript\n\n00:00 Speaker A\n2025 marked a turning point for the auto industry with the big three auto makers, Ford, GM and Stelantis all backing away from their lofty electric vehicle ambitions. Senior Auto reporter Pras is here now with a closer look at the pivot. So let's take them one by one. And let's take forward first, which just gave us more information recently about their pivot.\n00:20 Pras Subramanian\nRight, right. and you know, we assumed things would be changing at the end of 2023, uh change a new administration. So there was a preview of things to come and Ford basically a year later now sort of in revealed their big pivot. A 19.5 billion dollar charge to the EV business. I mean that's a huge number. one of the biggest that I I think we've ever seen from a a write down from both the cash and special items charges there. So but basically what they're going to do they're going to convert to more hybrids, build more gas-powered cars, fewer\n00:54 Pras Subramanian\nEVs, they killed off the F-150 Lightning EV pickup, which was such a a big deal when it came out in 2022, right? Uh so they're still going to make potentially small to mid-sized EVs. I think that's the sweet spot for where people need to what they want and what the market is underserving right now. So that's their plan. but the downside is, what happens you got to pivot again? There's there's a lot of talk that the EVs might make a comeback, right? Because technology is getting better, better charging, more chargers.\n1:21 Pras Subramanian\nUh that's the problem for Ford is they're they're taking such a swing back in the other direction. Can they still re pivot again?\n1:25 Speaker A\nYeah, I mean that's something Itay Michaeli who I talked to from TD Cowen, he was on the show yesterday and he is optimistic for EVs going into next year. He said because of price and innovation that we will still see demand.\n1:36 Pras Subramanian\nWe'll see.\n1:37 Speaker A\nWhat about General Motors?\n1:38 Pras Subramanian\nI mean, uh I actually quoted in my piece talking about GM being that they're they're better at execution and they're they're sort of a broader portfolio of EVs. So, let's talk about them. Yes, they do have a broader portfolio of EVs. They have the cheaper EVs from the Equinox all the way up to $100,000 Sierra EV truck, right? So they have the whole sort of market there for EVs. Now, obviously the higher end of the market is very challenged. People don't want to spend that kind of money. So they took a charge on that 1.6 billion\n2:08 Pras Subramanian\nlast quarter uh to try to address those EV pivots and things like that, right? But they indicate there's more to come. There's more charges to come. Maybe not 19.5 but more to come. But uh people like talk about how when that tide does turn, GM which is known as a better more efficient operator, they actually have their EVs are a bit more efficient from a cost basis. They can probably capitalize on that and get back into the game, the EV game when and if the market turns.\n2:36 Speaker A\nOkay, and Stellantis, how do they fit into all of this?\n2:39 Pras Subramanian\nSorry, I don't mean to laugh. But um Stelantis has been sort of fits and starts. They were very late to the game. Their their prior CEO Carlos Tovars said, I'm not I don't believe the EV the EV sort of uh road map is going to happen this fast. And he was let go and he may have been right because it was now that Slan's EVs are coming out, there's no one to buy them. In fact, they're uh their their charger uh sports car that was going to be all EV only is now pivoting to gas and\n3:13 Pras Subramanian\nelectric. Uh they're also the Wagoneer is the only other EV they have and it's not really selling that well. It's a Jeep vehicle. Uh and then they're going to bring back the old Hemi V8 to the to the sports cars and the RAM trucks and they got rid of the RAM EV truck. So it's it's more of the same with and other and other automakers here, but I guess the problem is that they sort of they waited so long and they finally came out with the vehicles and then now they're not hitting the mark.\n3:41 Pras Subramanian\nBut the other thing is that they indicated they're going to take charges for the EV business. They have not said so. It's probably going to come out in their second half results. So we'll be watching that. Uh but there's also the euro factor for them. They're very European based, right? And so they have a lot of markets in Europe that do want EVs and they they're able to make smaller EVs with their partnerships. So that's a an interesting thing for them because they have two different very different markets and they have to sort of cater to both.\n4:05 Speaker A\nWell, of course, in Europe though, they're they're competing with Chinese EVs, are they not? And those are are pretty competitive.\n4:11 Speaker A\nUm, you know, it's so interesting to me. It seems like they've really pivoted from like transitioning to EVs to let's offer you a menu, right? And you'll have gasoline powered cars, you'll have hybrids, you'll have EVs and sort of let the consumer make the decision about what they want. But I guess the issue is if consumers really don't want one of those.\n4:37 Pras Subramanian\nWell, I I think it's it's it sounds easier said than done, right? We'll give them whatever they want, but that's billions of dollars in investment. You can't, you know, invest in like making 10,000 EVs. It needs to be a million, right? to make it make sense from an economic point of view. So that's the really big hard place that they find themselves right now is as they pivot to spending more building gas-powered factories for gas-powered cars, what happens when that changes? That's that's the big question.\n5:09 Speaker A\nYes, and will it change whoever the next administration for example is of being. when you're making these long-term big spending plans and you have that kind of uncertainty.\n5:19 Pras Subramanian\nRight, exactly.\n5:20 Speaker A\nNot to mention tariffs, gosh, we didn't even talk about those. There's there's we could do this all day.\n5:24 Pras Subramanian\nI didn't want to get into that.\n5:25 Speaker A\nRight. Fair enough. A little more focused. Thanks, Pras.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "01:06:37",
      "Source": "GuruFocus.com",
      "Title": "EV Dreams Delayed: Why Hybrids Are Suddenly Hot Again",
      "URL": "https://finance.yahoo.com/news/ev-dreams-delayed-why-hybrids-170637026.html",
      "Content": "EV Dreams Delayed: Why Hybrids Are Suddenly Hot Again\n\nKhac Phu Nguyen\nFri, December 19, 2025 at 9:06 AM PST 2 min read\n\nIn this article: TSLA\n\nThis article first appeared on GuruFocus .\nIndustry observers suggest the global transition to zero-emission vehicles is unfolding more slowly than many policymakers and automakers once anticipated, prompting a reassessment of how road transport decarbonization could realistically progress. Recent policy signals from Europe appear to support that view. In December, the European Union moved away from a quasi-ban on combustion-engine cars planned for 2035 and instead positioned hybrid vehicles as part of its pathway toward net-zero emissions by 2050. That shift implies regulators are increasingly open to transitional technologies as they balance climate ambitions with consumer affordability and infrastructure readiness.\n\nIs TSLA fairly valued? Test your thesis with our free DCF calculator.\nFrom the demand side, analysts note that hybrids are gaining traction as fully electric vehicles struggle to broaden their appeal beyond early adopters. EV-focused manufacturers led by Tesla ( NASDAQ:TSLA ) helped drive rapid adoption earlier in the decade, but from around 2023, growth has faced headwinds as price sensitivity, range limitations, charging availability and battery longevity concerns weighed on buyers, particularly in Western markets. Hybrids, which pair internal combustion engines with electric motors and smaller batteries, are being viewed by many consumers as a lower-cost way to reduce emissions without changing refueling behavior. Against that backdrop, Western automakers such as Ford Motor ( NYSE:F ) and Volkswagen have been reallocating capital toward hybrids, while Asian manufacturers like Toyota ( NYSE:TM ) and Honda ( NYSE:HMC ), which maintained a multi-pathway strategy, appear increasingly aligned with shifting consumer preferences, especially in parts of southern Europe.\n\nAt the same time, analysts caution that the environmental case for hybrids remains under scrutiny, particularly for plug-in models. Advocacy group Transport & Environment has pointed to data suggesting plug-in hybrids emit about 19% less CO2 per kilometer than petrol and diesel cars on average, with real-world emissions substantially higher than official test results indicate. BloombergNEF has said the EU is in the process of updating its vehicle emissions testing regime, a development that could influence how many hybrids manufacturers are permitted to sell depending on measured emissions performance. As a result, while hybrids could play a more durable role in the transition than previously expected, their regulatory treatment and long-term positioning remain subject to evolving policy and data outcomes.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "01:01:07",
      "Source": "Benzinga",
      "Title": "Ron DeSantis Thinks F-150 Lightning Production Scrap Could Benefit Tesla Cybertruck — JerryRigEverything Says Ford Sold '2X' More Trucks",
      "URL": "https://finance.yahoo.com/news/ron-desantis-thinks-f-150-170107847.html",
      "Content": "Ron DeSantis Thinks F-150 Lightning Production Scrap Could Benefit Tesla Cybertruck — JerryRigEverything Says Ford Sold '2X' More Trucks\n\nBadar Shaikh\nFri, December 19, 2025 at 9:01 AM PST 3 min read\n\nIn this article: TSLA\n\nF\n\nNVDA\n\nFlorida Governor Ron DeSantis (R) has said that the Ford Motor Co. (NYSE: F ) F-150 Lightning EV pickup truck's production scrap could benefit Tesla Inc. (NASDAQ: TSLA ) and its polarizing Cybertruck.\nTesla Has A Strong Following, Says Ron DeSantis Taking to the social media platform X on Wednesday, DeSantis shared that Tesla has \"a strong following,\" adding that the Cybertruck has become a popular choice among customers. He added that there was no reason to \"think that following would transfer to Ford trucks.\"\nDon't Miss:\nMissed Nvidia and Tesla? RAD Intel Could Be the Next AI Powerhouse — Just $0.85 a Share\nAn EA Co-Founder Shapes This VC Backed Marketplace— Now You Can Invest in Gaming's Next Big Platform\nJerryRigEverything Weighs In Quoting DeSantis' post on X, YouTuber Zack Nelson , aka JerryRigEverything, shared his thoughts and took a sarcastic jibe at DeSantis. He shared that the Florida Governor \"doesn’t know that Ford sold 2X more Electric trucks than Tesla.\" He also shared that the Cybertruck was \"less popular\" than a canceled truck, which was \"unpopular.\"\nTesla's Falling Sales, Unsupervised FSD The comments come amid a decline in the automaker's sales, which, as the latest figures indicated, showed a steep 23% decline during November. The decline comes as EV demand fell in the U.S. amid regulatory headwinds due to President Donald Trump 's policies, like relaxing Corporate Average Fuel Economy (CAFE) norms in the country.\n\nTrending: Deloitte's #1 Fastest-Growing Software Company Lets Users Earn Money Just by Scrolling — Accredited Investors Can Still Get In at $0.50/Share.\nHowever, with Ford scaling back EV efforts, experts like Gene Munster of Deepwater Asset Management think that the pullback could prove to be beneficial for companies like Tesla, which is also focusing on deploying driverless taxis across the U.S. — a major goal for Musk.\nCalifornia Suspends Tesla License Tesla also faces a sales license suspension in California due to the marketing around the Autopilot and full self-driving systems, after a court ruled within the state that the automaker has been deceptive.\n\nStory Continues\nRead Next:\nGM-Backed EnergyX Is Solving the Lithium Supply Crisis — Invest Before They Scale Global Production\n$100k+ in investable assets? Match with a fiduciary advisor for free to learn how you can maximize your retirement and save on taxes – no cost, no obligation.\nPhoto courtesy: Shutterstock\nUNLOCKED: 5 NEW TRADES EVERY WEEK. Click now to get top trade ideas daily , plus unlimited access to cutting-edge tools and strategies to gain an edge in the markets.\nGet the latest stock analysis from Benzinga:\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Ron DeSantis Thinks F-150 Lightning Production Scrap Could Benefit Tesla Cybertruck — JerryRigEverything Says Ford Sold '2X' More Trucks originally appeared on Benzinga.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "00:43:00",
      "Source": "Barrons.com",
      "Title": "Tesla Stock Drops Back, Showing Car Sales Still Matter",
      "URL": "https://finance.yahoo.com/m/47367a9c-8dc2-37c8-b7fa-b2148123c60e/tesla-stock-drops-back%2C.html",
      "Content": "Tesla Stock Drops Back, Showing Car Sales Still Matter\n\nAl Root\nFri, December 19, 2025 at 8:43 AM PST 3 min read\n\nIn this article: TSLA\n\nTFC\n\nA forecast that the company could have robo-taxis in 30 cities by the end of next year lifted the share price early on Friday.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "00:05:00",
      "Source": "Barrons.com",
      "Title": "Trump Media Is Making a Big Pivot. Kodak Tried That, Too.",
      "URL": "https://finance.yahoo.com/m/1353dc31-d5c5-375b-8fe4-7f9fde7967c2/trump-media-is-making-a-big.html",
      "Content": "Trump Media Is Making a Big Pivot. Kodak Tried That, Too.\n\nAl Root\nFri, December 19, 2025 at 8:05 AM PST 3 min read\n\nIn this article: KODK\n\nDJT\n\nTSLA\n\n^DJI\n\n^GSPC\n\nYes, we are talking about the merger between social-media platform Trump Media & Technology and nuclear fusion start-up TAE Technologies. The deal values TAE at some $3 billion, creating the world’s first publicly traded nuclear fusion company, which produces energy the way a star does. Trump Media stock was up 13% on Friday, leaving it down 51% for the year.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-20",
      "Time": "00:01:40",
      "Source": "MT Newswires",
      "Title": "Lyft Faces Rising Autonomous Vehicle Disruption Risk, Wedbush Says",
      "URL": "https://finance.yahoo.com/news/lyft-faces-rising-autonomous-vehicle-160140990.html",
      "Content": "PREMIUM\nLyft Faces Rising Autonomous Vehicle Disruption Risk, Wedbush Says\n\nMT Newswires\nFri, December 19, 2025 at 8:01 AM PST 1 min read\n\nIn this article: LYFT\n\nGOOG\n\nTSLA\n\nLyft (LYFT) faces growing risk from the accelerating shift toward autonomous vehicles, which Wedbush\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "23:11:09",
      "Source": "Bloomberg",
      "Title": "Bubbles and Boring Bets: What’s Coming for Tech Stocks in 2026",
      "URL": "https://finance.yahoo.com/news/bubbles-boring-bets-coming-tech-100000437.html",
      "Content": "Bubbles and Boring Bets: What’s Coming for Tech Stocks in 2026\n\nJeran Wittenstein, Ryan Vlastelica and Carmen Reinicke\nFri, December 19, 2025 at 7:11 AM PST 6 min read\n\nIn this article: ORCL\n\nOPAI.PVT\n\nPLTR\n\nTSLA\n\n^GSPC\n\n(Bloomberg) -- Investors will remember 2025 as the year the artificial intelligence rally broadened out and the fears became more pronounced — not only of a bubble in the stocks, but also of the disruption the technology represents.\nWhile tech giants like Alphabet Inc. and Nvidia Corp. delivered strong gains, unsung corners of the industry, like memory chips and hard disk drives, proved to be far better places for investors. Meanwhile, the threat of competition from deep-pocketed heavyweights and upstarts like OpenAI and Anthropic weighed on software makers that are considered most at risk from challengers.\n\nMost Read from Bloomberg\nHudson Tunnel Digging Work to Start as Boring Machines Ready\nNYC High Line-Area Building Floats $53 Million Bankruptcy Sale\nICE Plans Detention Expansion With Deal to Design 'Mega Centers'\nHow This Chameleon UK Location Became a Little-Known Hollywood Backdrop\nNYC’s Adams Names Four to Rent Board in Challenge to Mamdani\nWith the bull market in US stocks stretching into a fourth year, there are more concerns than ever about the sustainability of heavy spending on AI computing and whether the returns will justify the investments.\n“There’s a lot of optimism around AI, but also a lot of hype,” said Anthony Saglimbene, chief market strategist at Ameriprise. “2026 will be more about the proof of AI. What’s the ROI on the hyperscalers that have been spending? Will they see profit growth continue to accelerate?”\n\nHere’s a look at some of the biggest stock market stories for the tech industry in 2025 and the outlook for each in the new year.\nNeocloud Nerves\nNeoclouds, which are companies that provide cloud-computing services tailored to AI customers, were the rage for most of 2025. But heading into 2026 they look more like proxies for AI bubble risk.\nGrowing scrutiny over OpenAI’s lack of profitability has raised questions about its ability to pay for its massive spending commitments, including a cloud-computing deal with Oracle Corp. said to be worth $300 billion over five years. Oracle was expected to be a major beneficiary of AI growth, but its stock is down more than 45% through Thursday’s close since hitting a peak in September as its exposure to OpenAI becomes a major concern. Oracle shares were up about 6% in early trading Friday as TikTok said it is being bought by a group of buyers led by the software company.\n“There is a lot of fear with OpenAI and the commitments it has made,” said Adam Rich, who helps oversee more than $17 billion in assets as deputy chief investment officer and portfolio manager at Vaughan Nelson. “People can only forecast what we know, and right now there’s a lot we don’t know. So long as that’s the case, it will be hard for companies like Oracle to regain their luster.”\n\nStory Continues\nOracle has other issues, including the amount of money it’s spending on data center leases, reported delays in some data center projects, and financing questions. Its growing debt load is particularly concerning to investors, as a measure of the company’s credit risk has skyrocketed to its highest level since the financial crisis.\n\nBeyond Oracle, neocloud provider CoreWeave Inc. has lost about two-thirds of its market value since hitting a high in June. And Nebius Group NV shares are down more than 42% from an October peak through Thursday’s close.\nBoring Tech\nInvestors discovered new AI trades in 2025 by following where the billions of dollars in pledged capital expenditures are going. You can see it just by looking at the top performers in the S&P 500 Index. Memory and storage company Sandisk Corp. leads the list, followed by Western Digital Corp, which makes hard disk drives, and its rival Seagate Technology Holdings Plc. Micron Technology Inc., the biggest US-based maker of memory chips, is fifth.\nThe trend is expected to continue in 2026 as capital expenditures keep growing. Investors are increasingly thinking about where the next wave is headed, with some eyeing beaten-down software stocks.\n“Things at the edge are interesting,” said Melissa Otto, who heads technology, media and telecommunications research at Visible Alpha. “There is this AI ecosystem that orbits around the AI infrastructure itself.”\n\nSoftware Slump\nSoftware stocks traded at attractive market valuations in 2025, but that did little to entice investors. Shares of software-as-a-service, or SaaS, companies were hit particularly hard. Much of the weakness reflects growing fears that the group will be disrupted by AI, as offerings from services like ChatGPT and Alphabet’s Gemini cut into demand or pricing power.\nAI represents “existential competition” for some software companies as “AI chatbot and agent dominance becomes the core battlefield,” analysts at RBC Capital Markets wrote in a research note this week.\nCompanies like ServiceNow Inc., Adobe Inc., and Salesforce Inc. were among the weakest performers in the tech sector this year. A Morgan Stanley index of SaaS companies is down 10%, compared with a gain of about 6% for a broader software index that includes perceived AI winners like Microsoft Corp.\nWhether software’s underperformance continues will be a key stock market theme in 2026. Some Wall Street pros already think it’s overdone. The SaaS group “is trading anywhere between a 30-40% discount relative to what its fundamentals would suggest,” KeyBanc Capital Markets analysts wrote in a note to clients late last month.\n\nPricey Got Pricier\nConcerns that nose-bleed valuations would hamper the ascent of some of 2024’s hottest stocks in 2025 proved misplaced. Palantir Technologies Inc. turned out to be one of the year’s best performers despite trading at more than 200 times estimated profits for much of the year. The stock’s nearly 150% advance ranks eighth in the S&P 500.\nWall Street has long been skeptical of Palantir, mainly because of the stock’s lofty valuation. Of the 29 the analysts covering the maker of data analysis software, just nine rate the stock a buy. Still, the company is expected to expand at an enviable clip, with revenue projected to jump 43% in 2026 and 39% in 2027, according to the average of analyst estimates compiled by Bloomberg.\nElectric-vehicle maker Tesla Inc. also overcame concerns about its valuation, which is by far the most expensive among the so-called Magnificent Seven. The stock hit a record this week despite trading at more than 200 times anticipated profits and facing a number of headwinds from slowing EV sales to concerns about safety.\n\nInvestors are optimistic about Chief Executive Officer Elon Musk’s vision of a self-driving car future and nascent push into robotics. After two years of stagnant revenue growth, Tesla’s sales are expected to expand 13% in 2026 and 19% in 2027.\nAll of which leaves the tech landscape heading into 2026 roughly where it was a year ago. Yes, the stocks are pricey. But the opportunities for growth are there. It’s up to the companies to deliver.\n“Expectations are high and valuations are expensive,” Ameriprise’s Saglimbene said. “That means they have more to prove, and they will really have to exceed expectations to move higher.”\n--With assistance from Phil Serafino and Stephen Kirkland.\n(Updates stock moves throughout, adds detail in paragraph seven.)\nMost Read from Bloomberg Businessweek\nUniqlo Founder and Japan’s Richest Man Loves a $32 Pair of Slacks\nPrivate Equity Is Ruining a Beloved Fly-Fishing Brand, Retailers Say\nThe Cracks in Crumbl’s Cookie Empire Are Showing\nDonald and Melania Trump’s Terrible, Tacky, Seemingly Legal Memecoin Adventure\nOracle’s $300 Billion AI Bet Has Fast Become a Bubble Barometer\n©2025 Bloomberg L.P.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "23:03:10",
      "Source": "Investor's Business Daily",
      "Title": "Tesla Bull Calls 2026 An 'Inflection Year' For Rivian With The Stock At Its Highest Since January 2024",
      "URL": "https://finance.yahoo.com/m/98fc0798-3532-3686-ae84-ded812ad5da2/tesla-bull-calls-2026-an.html",
      "Content": "Tesla Bull Calls 2026 An 'Inflection Year' For Rivian With The Stock At Its Highest Since January 2024\n\nKIT NORTON\nFri, December 19, 2025 at 7:03 AM PST 3 min read\n\nIn this article: RIVN\n\nTSLA\n\nRivian has been on a hot-streak since its \"Autonomy & AI Day,\" where the EV startup announced an in-house silicon AI chip and outlined its next-generation AI platform. In addition, a longtime Tesla bull raised his RIVN price target, calling 2026 an \"inflection year\" for the brand. Wedbush Securities analyst Dan Ives on Friday hiked his Rivian stock price target to 25 from 16, maintaining his outperform rating on the shares.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "22:21:00",
      "Source": "Barrons.com",
      "Title": "Does Trump Media’s Merger With TAE Make It Kodak or Something Else? Lessons From History.",
      "URL": "https://finance.yahoo.com/m/1353dc31-d5c5-375b-8fe4-7f9fde7967c2/does-trump-media%E2%80%99s-merger.html",
      "Content": "Does Trump Media’s Merger With TAE Make It Kodak or Something Else? Lessons From History.\n\nAl Root\nFri, December 19, 2025 at 6:21 AM PST 3 min read\n\nIn this article: TATE.PVT\n\nKODK\n\nTSLA\n\n^GSPC\n\nDJT\n\nYes, we are talking about the merger between social-media platform Trump Media & Technology and nuclear fusion start-up TAE Technologies. The deal values TAE at some $3 billion, creating the world’s first publicly traded nuclear fusion company, which produces energy the way a star does. Trump Media stock added 41.9% closing at $14.86 on Thursday, while the and rose 0.7% and 0.1%, respectively.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "22:01:19",
      "Source": "Benzinga",
      "Title": "Nvidia Vs. Alphabet: Which Could Be The World's Biggest Company By End-2026?",
      "URL": "https://finance.yahoo.com/news/nvidia-vs-alphabet-could-worlds-140119294.html",
      "Content": "Nvidia Vs. Alphabet: Which Could Be The World's Biggest Company By End-2026?\n\nPiero Cingari\nFri, December 19, 2025 at 6:01 AM PST 4 min read\n\nIn this article: NVDA\n\nGOOG\n\nAAPL\n\nAMZN\n\nMSFT\n\nNvidia Corp. (NASDAQ: NVDA ) and Alphabet Inc. (NASDAQ: GOOG ) (NASDAQ: GOOGL ) have quietly become the two most dominant forces inside the Magnificent Seven, riding different paths to the same destination: artificial intelligence supremacy.\nNvidia's GPUs remain the backbone of the global AI buildout, powering everything from data centers to cutting-edge model training.\n\nAlphabet, meanwhile, is pushing its own vertically integrated AI stack — from custom TPUs to Gemini — embedding intelligence directly across Search, Cloud and consumer products.\nThe market thus far has rewarded both approaches. Nvidia is up 33% year-to-date through Dec. 17, while Alphabet has surged 62%.\nDon't Miss:\nMissed Nvidia and Tesla? RAD Intel Could Be the Next AI Powerhouse — Just $0.85 a Share\nAn EA Co-Founder Shapes This VC Backed Marketplace— Now You Can Invest in Gaming's Next Big Platform\nZooming out further tells an even more dramatic story: since early 2023, Alphabet shares are up roughly 250%, while Nvidia has delivered a staggering 1,120% return.\nThat explosive run has made Nvidia the world's biggest company today, with a market capitalization of about $4.318 trillion — even briefly touching $5 trillion earlier this year. Alphabet ranks third at approximately $3.7 trillion, behind Apple's $4.05 trillion valuation.\n\nYet traders see a far closer race ahead.\nOn Polymarket, both Nvidia and Alphabet are assigned a 35% probability of being the world's most valuable company by the end of 2026.\nA $100 bet on Alphabet overtaking Nvidia to become the world's biggest company by the end of next year would pay out $265 if it happens — with nearly identical returns available for those wagering that Nvidia holds onto the crown.\nTrending: Deloitte's #1 Fastest-Growing Software Company Lets Users Earn Money Just by Scrolling — Accredited Investors Can Still Get In at $0.50/Share.\nApple Inc. (NASDAQ: AAPL ) trails with a 14% chance, followed by Microsoft Corp. (NYSE: MSFT ) at 9%.\nTesla Inc . (NASDAQ: TSLA ) and Amazon.com Inc. (NASDAQ: AMZN ) sit further back, at 4% and 3%, respectively.\n\nHow Could Alphabet Overtake Nvidia As World’s Biggest Company? For Alphabet to dethrone Nvidia as world’s biggest company, it needs to outperform by a meaningful margin.\nThe current valuation gap between the two companies is about $600 billion.\nIf Nvidia's market cap were to grow 10% in 2026, it would climb from roughly $4.3 trillion to about $4.75 trillion. For Alphabet to leapfrog Nvidia in that scenario, its shares would need to outperform Nvidia by roughly 19 percentage points.\n\nStory Continues\nIn practical terms, that would mean Alphabet gaining about 29% in a year where Nvidia rises 10%, lifting Google's valuation to around $4.77 trillion.\nAny performance gap of 19 percentage points in Alphabet's favor could hand it the crown — assuming today's market caps as the starting line.\n\nThe bet, then, is whether Alphabet's AI monetization, advertising leverage and cloud growth can accelerate faster than Nvidia's already-dominant chip business.\nSee Also: GM-Backed EnergyX Is Solving the Lithium Supply Crisis — Invest Before They Scale Global Production\nWall Street Still Backs Nvidia Where traders see a coin flip, Wall Street analysts remain more decisive.\nBased on median 12-month price targets, analysts expect Nvidia's reign to continue. Consensus estimates point to Nvidia shares reaching about $250 over the next year, or roughly 40% upside from the current price near $177.\nAlphabet's outlook is far more muted by comparison. Analysts see a median 12-month target of $330, implying just 6% upside from its current level around $306.\n\nThat gap underscores the tension at the core of the debate: prediction markets see a neck-and-neck race for the world's largest company, while Wall Street analysts continue to model an extended run of Nvidia's dominance.\nBy the end of 2026, the outcome may hinge on a single question: will the AI arms race ultimately reward the company supplying the picks and shovels, or the one embedding intelligence into every layer of the digital economy?\nRead Next: $100k+ in investable assets? Match with a fiduciary advisor for free to learn how you can maximize your retirement and save on taxes – no cost, no obligation.\nImage created using artificial intelligence via Gemini.\nUp Next: Transform your trading with Benzinga Edge's one-of-a-kind market trade ideas and tools. Click now to access unique insights that can set you ahead in today's competitive market.\nGet the latest stock analysis from Benzinga:\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Nvidia Vs. Alphabet: Which Could Be The World's Biggest Company By End-2026? originally appeared on Benzinga.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "21:38:00",
      "Source": "Barrons.com",
      "Title": "SpaceX Could Go Public by Merging With EchoStar. It Isn’t a Crazy Idea.",
      "URL": "https://finance.yahoo.com/m/6414ce44-9a06-389e-ae7b-fb6e0ac65e0d/spacex-could-go-public-by.html",
      "Content": "SpaceX Could Go Public by Merging With EchoStar. It Isn’t a Crazy Idea.\n\nAndrew Bary\nFri, December 19, 2025 at 5:38 AM PST 5 min read\n\nIn this article: SATS\n\nTSLA\n\nT\n\nT-PA\n\nThe companies already have done business together. SpaceX bought spectrum from EchoStar that it can use for its Starlink satellite broadband service.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "21:29:10",
      "Source": "MT Newswires",
      "Title": "Truist Securities Adjusts Price Target on Tesla to $444 From $406, Maintains Hold Rating",
      "URL": "https://finance.yahoo.com/news/truist-securities-adjusts-price-target-132910373.html",
      "Content": "PREMIUM\nTruist Securities Adjusts Price Target on Tesla to $444 From $406, Maintains Hold Rating\n\nMT Newswires\nFri, December 19, 2025 at 5:29 AM PST\n\nIn this article: TSLA\n\nTesla (TSLA) has an average rating of hold and mean price target of $419.78, according to analysts p\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "21:26:00",
      "Source": "Barrons.com",
      "Title": "How a Wild 2026 Prediction Could Be Lifting Tesla Stock",
      "URL": "https://finance.yahoo.com/m/47367a9c-8dc2-37c8-b7fa-b2148123c60e/how-a-wild-2026-prediction.html",
      "Content": "How a Wild 2026 Prediction Could Be Lifting Tesla Stock\n\nAl Root\nFri, December 19, 2025 at 5:26 AM PST 2 min read\n\nIn this article: TSLA\n\nTFC\n\nForget a muted price-target increase. Can the company really have robo-taxis in 30 cities by the end of next year?\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "20:33:28",
      "Source": "GuruFocus.com",
      "Title": "Cathie Wood Keeps Dumping Tesla Stock -- Here is Why",
      "URL": "https://finance.yahoo.com/news/cathie-wood-keeps-dumping-tesla-123328808.html",
      "Content": "Cathie Wood Keeps Dumping Tesla Stock -- Here is Why\n\nNauman Khan\nFri, December 19, 2025 at 4:33 AM PST 1 min read\n\nIn this article: TSLA\n\nSLMT\n\nCOIN\n\nARKK\n\nRXRX\n\nThis article first appeared on GuruFocus .\nCathie Wood's ARK Invest once again trimmed its stake in Tesla ( NASDAQ:TSLA ) while increasing exposure to crypto-related stocks, according to a Thursday filing with the SEC.\nThe fund sold 23,110 shares of Tesla through its ARK Innovation ETF ( ARKK ), worth about $11.2 million. The move comes after Tesla shares pulled back from record highs earlier in the week. TSLA closed Thursday up about 3%, at $483.37.\n\nWarning! GuruFocus has detected 3 Warning Sign with NKE.\nIs TSLA fairly valued? Test your thesis with our free DCF calculator.\nARK shifted the capital to cryptocurrency-focused names, including Coinbase Global ( NASDAQ:COIN ) and Brera Holdings (SLMT). It bought 17,386 shares of COIN across multiple ETFs for roughly $4.15 million. The purchase follows Coinbase's plan to launch commission-free U.S. stock trading with extended hours.\nThe firm also added 575,644 shares of Brera Holdings, valued at about $1.4 million. Brera has drawn attention for its Solana-based treasury strategy. Brera shares rose about 1% to $2.39 on Thursday.\nBeyond crypto, ARK bought 755,538 shares of Recursion Pharmaceuticals ( NASDAQ:RXRX ) across ARKG and ARKK. Analysts continue to track Tesla stock closely, maintaining a Hold consensus with an average price target implying more than 21% downside risk.\nCathie Wood's ARK Invest has been selling portions of its Tesla holdings not because she's turned bearish long-term, but to rebalance portfolios and manage risk after gains, reduce concentration in a huge flagship position and fund buys in other high-conviction names like Robinhood, Block and crypto-related stocks.\nRecent filings show systematic sales across ARK ETFs while still keeping Tesla as a top holding, suggesting profit-taking and strategic repositioning rather than a full exit.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "20:29:13",
      "Source": "MT Newswires",
      "Title": "Update: Stellantis, Tesla, BYD, Volkswagen Probe Closed by Italian Regulator",
      "URL": "https://finance.yahoo.com/news/stellantis-tesla-byd-volkswagen-probe-122913408.html",
      "Content": "PREMIUM\nUpdate: Stellantis, Tesla, BYD, Volkswagen Probe Closed by Italian Regulator\n\nMT Newswires\nFri, December 19, 2025 at 4:29 AM PST 1 min read\n\nIn this article: BYDDF\n\nTSLA\n\nSTLA\n\nVLKAF\n\n(Updates to include a response from BYD in the last paragraph.) Stellantis (STLA), Tesla (TSLA),\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "20:20:10",
      "Source": "MT Newswires",
      "Title": "Deutsche Bank Adjusts Price Target on Tesla to $500 From $470, Maintains Buy Rating",
      "URL": "https://finance.yahoo.com/news/deutsche-bank-adjusts-price-target-122010725.html",
      "Content": "PREMIUM\nDeutsche Bank Adjusts Price Target on Tesla to $500 From $470, Maintains Buy Rating\n\nMT Newswires\nFri, December 19, 2025 at 4:20 AM PST\n\nIn this article: TSLA\n\nTesla (TSLA) has an average rating of hold and mean price target of $419.78, according to analysts p\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "20:15:11",
      "Source": "MT Newswires",
      "Title": "Social Buzz: Wallstreetbets Stocks Mostly Higher Pre-Bell Friday; Tesla, Micron to Advance",
      "URL": "https://finance.yahoo.com/news/social-buzz-wallstreetbets-stocks-mostly-121511395.html",
      "Content": "PREMIUM\nSocial Buzz: Wallstreetbets Stocks Mostly Higher Pre-Bell Friday; Tesla, Micron to Advance\n\nMT Newswires\nFri, December 19, 2025 at 4:15 AM PST 1 min read\n\nIn this article: MU\n\nDJT\n\nGOOGL\n\nNKE\n\nTSLA\n\nThe most-talked-about stocks in the Reddit subforum Wallstreetbets were mostly higher hours before F\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "20:00:02",
      "Source": "Barchart",
      "Title": "How to Turn the Volatility in Tesla Stock into a 20% Upside Opportunity with Just 0.3% Downside Risk",
      "URL": "https://finance.yahoo.com/m/df17effe-51e9-33c2-90cc-494fd3c8d4f7/how-to-turn-the-volatility-in.html",
      "Content": "How to Turn the Volatility in Tesla Stock into a 20% Upside Opportunity with Just 0.3% Downside Risk\n\nRob Isbitts\nFri, December 19, 2025 at 4:00 AM PST 3 min read\n\nIn this article: TSLA\n\nTesla (TSLA) is on another run. It has more than doubled since April, and recently shrugged off a 20% decline. In other words, nothing out of the ordinary for Elon Musk’s $1.6 trillion market cap baby.\nTo say that TSLA is a great trading stock is the understatement of the year. When a stock essentially moves like a 4x ETF, there’s plenty of opportunities to get in. And out, in, and out again. Often all within a matter of months, if not weeks, depending on a trader’s time frame.\n\nMore News from Barchart Exposing the Hidden Geometry of Palo Alto (PANW) Stock Most Investors Will Miss\n2 Option Trade Ideas To Consider This Thursday\nThis Unusually Active Avantor Put Raises the Question: Who’s the Patsy?\nStop Missing Market Moves: Get the FREE Barchart Brief – your midday dose of stock movers, trending sectors, and actionable trade ideas, delivered right to your inbox. Sign Up Now!\n\nYet Wall Street, perhaps finding difficulty in taming the beast that is TSLA’s stock price, much less its forward-looking fundamentals, has a net “Hold” rating on it. And has for a few months now. With a stock like this, there are uber-long-term holders, who embrace the vision of Musk, and traders who have made a nice living buying and selling it on every 10%-30% wiggle.\nThe company has had a tumultuous year, which started with the Department of Government Efficiency (DOGE) in DC, continued with a pay package for the ages, and currently could be described as a double top. As in, the stock price’s return to the $490 area.\nOne of the math games I like to use in coaching investors and traders goes like this: Which would you rather own?\nA stock up 50% in less than 4 months?\nA stock flat for 12 months?\nThe good news for Tesla fans is that they get both! The returns for different time frames below add up to chaos, for long-term holders.\nAnd we should assume TSLA will not go quietly into the future. So let’s examine the charts and consider one possibility that probably does not make the headlines.\nA darling stock selling at more than 400x forward earnings is going to be volatile. And 16x sales is pretty elevated, to put it mildly. So let’s go with the idea that for some investors, while they are comfortable holding some shares of TSLA stock, they’d consider having a portion of it act more like a bond. Or perhaps a buffer note ETF.\nTLSA bulls will point to this and see “breakout coming.” And they might be right. But bears might see a retrenchment from around these levels.\nWhat Risk Manager Rob Sees I see, from among many TSLA collar combinations, a way to own TSLA, write calls and buy puts on it, go out 2 years, and set myself up so that the worst case is I break even. My upside? About 10% a year, or close to 20% over 2 years. My stress level? Very low.\n\nStory Continues\nAnd as I see it, if the stock, which I’m daring to go above $550 during that time, does so, I can just buy some more shares. Or rebalance the collar levels. 20% upside, and 0.3% downside over 2 years, on this stock? THAT is turning volatility into opportunity.\nRob Isbitts, founder of Sungarden Investment Publishing, is a semi-retired chief investment officer, whose current research is found here at Barchart, and at his ETF Yourself subscription service on Substack . To copy-trade Rob’s portfolios, check out the new Pi Trade app.\nOn the date of publication, Rob Isbitts did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "20:00:00",
      "Source": "GlobeNewswire",
      "Title": "Safe & Green Holdings Completes Strategic Acquisition of Giant Containers",
      "URL": "https://finance.yahoo.com/news/safe-green-holdings-completes-strategic-120000277.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nSafe & Green Holdings Completes Strategic Acquisition of Giant Containers\n\nSafe and Green Holdings Corp.\nFri, December 19, 2025 at 4:00 AM PST 3 min read\n\nIn this article: SGBX\n\nTSLA\n\nAMZN\n\nGM\n\nNKE\n\nConroe, Texas, Dec. 19, 2025 (GLOBE NEWSWIRE) -- CONROE, Texas, Dec 19, 2025 (GLOBE NEWSWIRE) -- via IBN - Safe & Green Holdings Corp. (NASDAQ: SGBX) (“Safe & Green” or the “Company”), announced that it has successfully closed the acquisition of Giant Containers Inc. (“Giant Containers”), a leading manufacturer of custom modular shipping container solutions for residential, commercial, industrial, and institutional applications. The transaction was completed through a combination of cash and stock consideration.\n\nThe acquisition of Giant Containers represents a key milestone in Safe & Green’s long-term strategy to become a value-added infrastructure solutions provider, strengthening its capabilities across design, engineering, sales, and project execution.\nGiant Containers brings a highly recognized brand with an established customer base that includes globally recognized organizations such as Tesla, Amazon, General Motors, Nike, and Yale University. At the time of acquisition, Giant Containers has over $5 million in projects under contract, with an additional $22.5 million in its pipeline.\nThe combination of the two companies addresses complementary strengths. Giant Containers’ core strength in sales, marketing, and project management align with areas of strategic focus for Safe & Green, while Safe & Green’s in-house production and manufacturing capabilities directly address Giant Containers’ need for scalable domestic fabrication, an increasingly critical requirement for larger enterprise and government customers.\n\nIn addition, Giant Containers contributes deep expertise in sourcing and managing purpose-built container systems from offshore suppliers, creating cost and quality advantages for complex, multi-container projects designed to integrate seamlessly at scale.\nAs part of the transaction, Daniel Kroft, Founder and CEO of Giant Containers, elected to receive a portion of the consideration in restricted Safe & Green Holdings common stock, reinforcing long-term alignment with the Company’s growth strategy.\n“We are very excited about this strategic acquisition of Giant Containers. It was a key foundation stone in our corporate strategy to become a value-added energy provider, and we are now empowered with sales, design, and engineering capabilities for containerized power generation, crypto mining, and data center solutions. The current AI-driven trend is hungry for power, and we are well positioned to meet that demand using our own resources. Our streamlined vision is to control the supply chain from subsurface to end user, and with Giant Containers onboard, we now have a critical component to execute that strategy,” said Michael McLaren, CEO of Safe & Green.\n\nStory continues\nDaniel Kroft, Founder and CEO of Giant Containers, added, “Giant Containers is thrilled to announce being acquired by Safe & Green Holdings, a move that positions the company to advance its growth plans with even greater confidence. This transaction provides the infrastructure necessary to support larger, more complex projects and introduces our new production facility in Texas, enhancing our capacity to serve clients nationwide and abroad.”\n\n“The acquisition capitalizes on strong synergies between both teams and the depth of human capital across the organizations, fueling optimism through a shared vision and aligned goals for Giant Containers. I’m particularly excited about entering an entirely new market by developing solutions tailored to the oil, gas, and energy industry, guided by the expertise of Mike McLaren and the team at Olenox. This new framework allows us to dedicate even more manpower to business development and the global rollout of our unique product offerings.”\nAbout Giant Containers\nFounded in 2017, Giant Containers is a leading designer and integrator of custom container-based solutions for commercial, industrial, and institutional customers. The company specializes in transforming shipping containers into highly engineered structures for applications ranging from modular buildings to specialized infrastructure solutions, serving clients across North America and internationally.\n\nAbout Safe & Green Holdings Corp.\nSafe & Green Holdings Corp., a leading modular solutions company, operates under core capabilities which include the development, design, and fabrication of modular structures, meeting the demand for safe and green solutions across various industries. The firm supports third-party and in-house developers, architects, builders, and owners in achieving faster execution, greener construction, and buildings of higher value.\nInvestors:\ninvestors@safeandgreenholdings.com\nCorporate Communications\nIBN\nAustin, Texas\nwww.InvestorBrandNetwork.com\n512.354.7000 Office\nEditor@InvestorBrandNetwork.com\nhttps://www.investorbrandnetwork.com/clients/\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "19:35:54",
      "Source": "Simply Wall St.",
      "Title": "Top Growth Companies With Strong Insider Ownership December 2025",
      "URL": "https://finance.yahoo.com/news/top-growth-companies-strong-insider-113554465.html",
      "Content": "Top Growth Companies With Strong Insider Ownership December 2025\n\nSimply Wall St\nFri, December 19, 2025 at 3:35 AM PST 3 min read\n\nIn this article: SES\n\nT\n\nT-PA\n\nTPC\n\nMMI\n\nAs the U.S. stock market faces a downturn with major indexes like the S&P 500 and Dow Jones Industrial Average posting consecutive losses, investors are increasingly cautious about tech stocks amid concerns of an AI bubble. In such volatile times, companies with strong insider ownership often attract attention as they may indicate confidence from those who know the business best.\n\nTop 10 Growth Companies With High Insider Ownership In The United States Name\nInsider Ownership\nEarnings Growth\nSuper Micro Computer (SMCI)\n13.9%\n50.7%\nStubHub Holdings (STUB)\n14.2%\n73.9%\nSES AI (SES)\n12%\n68.9%\nPrairie Operating (PROP)\n31.3%\n100%\nNiu Technologies (NIU)\n37.2%\n93.7%\nCredo Technology Group Holding (CRDO)\n10.2%\n30.7%\nCorcept Therapeutics (CORT)\n11.4%\n52.7%\nAtour Lifestyle Holdings (ATAT)\n18%\n24.4%\nAstera Labs (ALAB)\n11.7%\n29.0%\nAppLovin (APP)\n27.4%\n27.1%\n\nClick here to see the full list of 207 stocks from our Fast Growing US Companies With High Insider Ownership screener.\nLet's explore several standout options from the results in the screener.\nTesla Simply Wall St Growth Rating: ★★★★☆☆\nOverview: Tesla, Inc. is engaged in the design, development, manufacture, leasing, and sale of electric vehicles as well as energy generation and storage systems globally, with a market cap of approximately $1.55 trillion.\nOperations: Tesla's revenue primarily comes from its Automotive segment, generating $83.64 billion, and its Energy Generation and Storage segment, contributing $11.99 billion.\n\nInsider Ownership: 28.2%\nTesla's growth prospects are bolstered by its significant insider ownership, although recent months have seen substantial insider selling. The company is expected to achieve robust annual earnings growth of 33.8%, outpacing the broader US market, despite a forecasted low return on equity of 9.2% in three years. Recent collaborations, such as the European framework agreement with SPIE for battery energy storage projects, highlight Tesla's strategic initiatives in renewable energy infrastructure expansion across Europe.\nClick here to discover the nuances of Tesla with our detailed analytical future growth report.\nThe analysis detailed in our Tesla valuation report hints at an inflated share price compared to its estimated value.\nMarcus & Millichap Simply Wall St Growth Rating: ★★★★☆☆\nOverview: Marcus & Millichap, Inc. is an investment brokerage company offering real estate investment brokerage and financing services to commercial real estate buyers and sellers in the United States and Canada, with a market cap of $1.09 billion.\nOperations: The company generates revenue primarily from its Commercial Real Estate Services segment, which amounted to $751.28 million.\n\nStory Continues\nInsider Ownership: 37.2%\nMarcus & Millichap's insider ownership aligns with its growth trajectory, as the company focuses on strategic acquisitions and technology investments. Recent earnings show a revenue increase to US$193.89 million for Q3 2025, with net income turning positive at US$0.24 million from a prior loss. Forecasts indicate revenue growth of 12.8% annually, outpacing the US market average, while profitability is projected in three years, despite current dividend sustainability concerns due to low coverage by earnings.\nNavigate through the intricacies of Marcus & Millichap with our comprehensive analyst estimates report here.\nInsights from our recent valuation report point to the potential overvaluation of Marcus & Millichap shares in the market.\nTutor Perini Simply Wall St Growth Rating: ★★★★★☆\nOverview: Tutor Perini Corporation is a construction company offering general contracting, construction management, and design-build services to private and public clients globally, with a market cap of $3.57 billion.\nOperations: The company's revenue segments are comprised of Civil (Including Management Services) at $2.86 billion, Building (Including Management Services) at $1.77 billion, and Specialty Contractors at $742.35 million.\n\nInsider Ownership: 14.2%\nTutor Perini's high insider ownership supports its growth potential, with insiders buying more shares recently. The company reported Q3 2025 sales of US$1.42 billion, up from US$1.08 billion a year ago, and net income of US$3.63 million compared to a significant loss previously. Earnings are forecast to grow at 95.88% annually, while revenue is expected to rise by 13.2%, surpassing the broader market's growth rate and indicating robust future performance prospects.\nGet an in-depth perspective on Tutor Perini's performance by reading our analyst estimates report here.\nAccording our valuation report, there's an indication that Tutor Perini's share price might be on the cheaper side.\nTurning Ideas Into Actions Investigate our full lineup of 207 Fast Growing US Companies With High Insider Ownership right here.\nSeeking Other Investments? Diversify your portfolio with solid dividend payers offering reliable income streams to weather potential market turbulence.\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.The analysis only considers stock directly held by insiders. It does not include indirectly owned stock through other vehicles such as corporate and/or trust entities. All forecast revenue and earnings growth rates quoted are in terms of annualised (per annum) growth rates over 1-3 years.\nCompanies discussed in this article include TSLA MMI and TPC .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "19:33:50",
      "Source": "GuruFocus.com",
      "Title": "TSLA: Tesla Shares Jump as SpaceX Ramps Up Cybertruck Purchases",
      "URL": "https://finance.yahoo.com/news/tsla-tesla-shares-jump-spacex-113350169.html",
      "Content": "TSLA: Tesla Shares Jump as SpaceX Ramps Up Cybertruck Purchases\n\nNauman Khan\nFri, December 19, 2025 at 3:33 AM PST 1 min read\n\nIn this article: TSLA\n\nThis article first appeared on GuruFocus .\nTesla ( NASDAQ:TSLA ) shares climbed more than 3.5% after reports that SpaceX has been buying a sizable number of Tesla Cybertrucks.\nSpaceX may have spent tens of millions of dollars on the electric pickup trucks, Electrek reported, with sources saying the space?launch company could acquire more than 2,000 vehicles over time.\n\nIs TSLA fairly valued? Test your thesis with our free DCF calculator.\nThe purchases come as Tesla's Cybertruck production and sales lag earlier expectations. Industry data show roughly 39,000 Cybertrucks sold in 2024 and little improvement in 2025. Inventories appear to be building, and analysts now view the model as a low?volume product rather than the high?volume rollout once envisioned.\nIt is unclear how SpaceX plans to use the vehicles, though legal experts say the purchases are permitted under current regulations.\nTesla did not immediately comment on the reported deal. SpaceX has indicated plans for a 2026 initial public offering, which could be one of the largest in history.\nSome analysts say the truck buys may help manage excess inventory, while others see them as part of SpaceX's ground?fleet needs.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "19:00:24",
      "Source": "Yahoo Finance Video",
      "Title": "The top 10 trending tickers of 2025 on Yahoo Finance",
      "URL": "https://finance.yahoo.com/video/top-10-trending-tickers-2025-110024376.html",
      "Content": "The top 10 trending tickers of 2025 on Yahoo Finance\n\nYahoo Finance Video and Jared Blikre\nFri, December 19, 2025 at 3:00 AM PST\n\nIn this video: TSLA\n\nNVDA\n\nSMCI\n\nPLTR\n\nAMD\n\nNvidia ( NVDA ), Tesla ( TSLA ), and Palantir ( PLTR ) are some of the top-viewed ticker pages on Yahoo Finance in 2025.\nYahoo Finance Markets and Data Editor Jared Blikre , who also hosts Yahoo Finance's Stocks in Translation podcast , examines the 10 most popular ticker pages on Yahoo Finance, with AI names dominating the list, with the exception of bitcoin ( BTC-USD ).\nCatch more Stocks in Translation , with new episodes every Tuesday and Thursday.\nTo watch more expert insights and analysis on the latest market action, check out more Market Catalysts .\n\nVideo Transcript\n\n00:04 Speaker A\n2025 has been a year of surprises. At the outset, many pros were doubting that year three of this bull market could match the outside gains of the prior two.\n00:13 Speaker A\nBut the AI trade keeps driving attention and driving behavior. And on today's stocks in translation, we're not looking at the best performers of 2025. We are looking at the names that you, the viewers, checked in on the most on the Yahoo Finance platform. And we're breaking down our top 10 trending tickers of 2025.\n00:32 Speaker A\nSo let's take a look at the scores on the door. and here we got the top 10 tickers. The first thing you might notice is that this is an AI dominated list with maybe Bitcoin in the middle as the exception.\n00:46 Speaker A\nThen you're going to see the perennial favorites, uh that's Nvidia and Tesla to the left there. They are in a different zip code. Our Nvidia quote page has a cool quarter billion page views this year, while Tesla clocks in at over 180 million.\n01:03 Speaker A\nAnd while Apple is usually top three, it was edged out this year by Palantir with nearly 100 million views. And from there things stabilize as AMD, Amazon, Bitcoin, Meta, Super Micro and Intel, they all clocked 40 to 60 million viewers each.\n01:17 Speaker A\nNow, let's take a look at this list from a different perspective. This is our Yahoo Finance heat map and we're looking at the box size right here. So each box size corresponds to the market cap of the company and all of these are large to mega caps with two in the $4 trillion bucket. That would be Nvidia and Apple,\n01:36 Speaker A\nall the way down to Intel over here at 180 billion. and in the far lower right, you almost can't see it there. You can see Super Micro, which is just shy of $20 billion. But the other thing you might notice is that the only losing ticker this year is Bitcoin, although Amazon is pretty close to break even too.\n01:52 Speaker A\nSo each of these has a different story. Now let's dive into some of the charts that really uh tell this story and this is going to be a year-to-date. So we'll start with Nvidia here. This has arguably been the poster child for the entire AI trade and you can see it got kind of sucked into the post liberation day redness there, but it has bounced back strong.\n02:09 Speaker A\nReally hasn't done much over the last few months, but with 30% gains in a year after almost being up, what is it? a thousand percent over the last three years. There you go, 963%. I think investors are going to take that.\n02:19 Speaker A\nNow Tesla. Tesla's really interesting because over the last year, and this is a three-year chart too, it has traced out a cup and handle formation. If it can break above 480, it has the ability to really break out and 2026 could be the year to do this. If it fails at this level, well, maybe it's got to consolidate a little bit longer.\n02:37 Speaker A\nNow, let's take a look at Palantir. This stock is up 2,500% over the last three years. Let's dial down to a year-to-date and you can see like Nvidia, it hasn't really done much over the last few months, but still sitting on 140% year-to-date gains.\n02:50 Speaker A\nNow, Apple year to date, this stock is only up 9%, but it has come back nicely after it just kind of stalled out after the liberation day uh melee where a lot of stocks were taking off, it was going sideways, but it finally caught up over the last few months. and so Apple has been generating recent record highs even as Nvidia has been going sideways.\n03:07 Speaker A\nNow here's AMD to round out the top five, 71% year to date. This is a very volatile stock, but again, I think investors will uh happily hold on to gains like that for a stock like AMD.\n03:16 Speaker A\nNow, Amazon, barely positive for the year. This is a stock you kind of got to look at over this entire three-year bull market. Still up 150%, but this was a year of consolidation. We'll have to see if 2026 breaks to the upside or the downside.\n03:30 Speaker A\nAnd you know what? Bitcoin is a very similar story, sitting on more gains over the last three years, but this has been a year of consolidation. It happens to be down about 10% right now, and 75,000 is a line in the sand that I am watching. I think that gets hit before it takes off again.\n03:44 Speaker A\nThen Meta, this is another three-year story. Uh hasn't done much this year, but we'll have to see if it can continue the trend. 445%, very strong over this bull market.\n03:53 Speaker A\nGetting towards the end here. Super Micro is a very volatile stock and while it's up this year a decent percentage, you can see it was up a lot more in early 2024. So this is one of those high beta plays you got to trade with caution, but guess what, the Yahoo Finance audience loves to day trade this stock.\n04:06 Speaker A\nAnd finally here's Intel. This is another kind of uh sine wave pattern here. Let me just dial this down to year to date so you can see it has really taken off over the last few months. It's become a volatile stock, but it was doing nothing for the first 6, seven, eight months of the year. So I think investors at the end of the day, at the end of the year going to be pleased with this one.\n04:24 Speaker A\nSo let us dial it back down here. I got a few things that are going to tell us what to watch in 2026. So just think of these as the questions that move these tickers. First is the AI spend payback test. Investors are going to want to see the revenue and not just the profits of these uh companies, not just the spending.\n04:42 Speaker A\nAnd the next up is margins versus Mega Cap spending. Can these giants keep growing without the profit engine getting dented? Third, keep an eye on the chip cycle inflection point. Does demand for semiconductors, does it broaden out or is it just stay limited to AI?\n04:59 Speaker A\nFourth, watch those crypto regulation headlines. 2025 was arguably the best year ever for crypto regulation and Bitcoin isn't even positive. So let's see if sentiment can shift. And finally, monitor those rate cuts versus the real economy. If we get more cuts, ask why. Is it a soft landing scenario or are we sinking into recession?\n05:17 Speaker A\nBottom line, these were the tickers investors just could not stop watching in 2025. Next year, what matters is whether the stories hold up and that's where the rubber meets the road. And tune into the Stocks and Translation podcast for more jargon busting deep dives. New episodes can be found Tuesdays and Thursdays on Yahoo Finance's website or wherever you find your podcast.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "18:54:00",
      "Source": "Zacks",
      "Title": "Zacks Investment Ideas feature highlights CAPITAL ONE, MARRIOTT INTERNATIONAL and Tesla's",
      "URL": "https://finance.yahoo.com/news/zacks-investment-ideas-feature-highlights-105400548.html",
      "Content": "Zacks Investment Ideas feature highlights CAPITAL ONE, MARRIOTT INTERNATIONAL and Tesla's\n\nZacks Equity Research\nFri, December 19, 2025 at 2:54 AM PST 4 min read\n\nIn this article: TSLA\n\nCOF\n\nCOF-PK\n\nCOF-PL\n\nCOF-PN\n\nFor Immediate Release Chicago, IL &ndash; December 19, 2025 &ndash; Today, Zacks Investment Ideas feature highlights CAPITAL ONE COF, MARRIOTT INTERNATIONAL MAR and Tesla's TSLA\n3 STOCKS TO WATCH NEAR ALL-TIME HIGHS: COF, MAR, TSLA An easing in inflation pressures helped stabilize markets in Thursday's trading session, although a few notable stocks had already printed fresh highs ahead of November's favorable CPI report. Being leaders in their respective industries, investors are surely wondering if higher highs are in store for three of these popular stocks in particular. This makes it an ideal time to take a look at the trend of earnings estimate revisions, the primary influencer to the Zacks Rank.\n\nCAPITAL ONE ZACKS RANK #1 (STRONG BUY) With its stock hitting a new all-time high of $244 a share, Capital On is in more wallets following the successful acquisition of Discover Financial earlier in the year.\nAcquiring Discover has transformed Capital One into a market leader by giving it both size and infrastructure, combining one of the largest credit card issuers with a major payments network. Becoming a vertically integrated powerhouse in consumer finance, Capital One stock is up +35% in 2025, and EPS revisions have continued to soar thanks to strong financial results and shareholder-friendly buybacks.\n\nCapital One's annual earnings are now expected to leap 41% in fiscal 2025 to $19.77 per share compared to EPS of $13.96 last year. Plus, FY26 EPS is projected at over $20.00, and COF trades at a very attractive 12X forward earnings multiple.\nMARRIOTT INTERNATIONAL ZACKS RANK #3 (HOLD) $311 a share set a record for the renowned hotel operator's stock on Wednesday, but the price performance here has been less captivating. Marriott International's stock is up +10% year to date, and its steady EPS growth is accompanied by a modest 0.86% annual dividend yield that's currently at $2.80. It's also intriguing that Marriott has increased its dividend by 28% in the last five years, and its 27% payout ratio indicates there is plenty of room for more hikes in the future as one of the most established and well-managed hospitality companies. Although a sound long-term investment, Marriott's somewhat stagnant stock performance may continue, as FY25 EPS estimates have barely increased in the last 90 days and FY26 revisions are slightly down.\n\nTESLA ZACKS RANK #3 (HOLD) Fresh all-time highs of $495 a share come as investors have been more excited about Tesla's robotaxi program, AI integration, androbotics ambitions, even as EV sales have slowed. Notably, Tesla has been testing driverless robotaxis without safety\n\nLeer más\nmonitors, a major milestone that investors see as proof of progress toward autonomous mobility. Elon Musk has also announced that Tesla's in-car systems will integrate Grok, an AI chatbot, boosting confidence in Tesla's ability to monetize AI. Regarding robotics, Tesla's humanoid robot project, Optimus, is seen as a long-term growth driver, adding to the narrative that Tesla is more than just an EV company. While these are exciting developments, EPS revisions are modestly lower in the last 60 days for FY25 and FY26. Considering such, the recent momentum in TSLA could be short-lived, with most of the +20% YTD gains coming in the last month. Still, Tesla has been able to avoid a sell rating as a sharp rebound is expected on its top and bottom lines next year.\n\nWhy Haven't You Looked at Zacks' Top Stocks? Since 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMarriott International, Inc. (MAR) : Free Stock Analysis Report\nCapital One Financial Corporation (COF) : Free Stock Analysis Report\nTesla, Inc. (TSLA) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nCondiciones y Política de privacidad\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "18:19:42",
      "Source": "MT Newswires",
      "Title": "Stellantis, Tesla, BYD, Volkswagen Probe Closed by Italian Regulator",
      "URL": "https://finance.yahoo.com/news/stellantis-tesla-byd-volkswagen-probe-101942500.html",
      "Content": "PREMIUM\nStellantis, Tesla, BYD, Volkswagen Probe Closed by Italian Regulator\n\nMT Newswires\nFri, December 19, 2025 at 2:19 AM PST 1 min read\n\nIn this article: STLA\n\nTSLA\n\nBYDDF\n\nVLKAF\n\nStellantis (STLA), Tesla (TSLA), BYD, and Volkswagen Group's investigations by Italy's competition a\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "16:50:19",
      "Source": "Insider Monkey",
      "Title": "Mizuho Raises Tesla Price Target to $530, Backs Robotaxi Momentum",
      "URL": "https://finance.yahoo.com/news/mizuho-raises-tesla-price-target-085019919.html",
      "Content": "Mizuho Raises Tesla Price Target to $530, Backs Robotaxi Momentum\n\nGhazal Ahmed\nFri, December 19, 2025 at 12:50 AM PST 2 min read\n\nIn this article: TSLA\n\nTesla, Inc. (NASDAQ: TSLA ) is one of the Buzzing AI Stocks on Wall Street. On December 16, Mizuho reiterated the stock as “Outperform” and raised its price target to $530 from $475. The firm said it's bullish on Tesla's robotaxi efforts.\nThe stock has been on the radar recently, particularly due to its robotaxi efforts. CEO Elon Musk tweeted earlier how Tesla has been testing robo-taxis without safety monitors in the car. This marks another step forward for the company towards services expansion across the U.S.\nWhile the company’s robo-taxi service launched with safety monitors sitting in the front passenger seat, Musk hopes to remove the monitors by year’s end.\nThe analyst looked at Alphabet’s Waymo to figure out how Tesla’s improvements can translate into more robo-taxi business. Waymo delivers 450,000 fully automated rides per week, and aims to reach 1 million trips per week by the end of 2026.\nTesla, Inc. (NASDAQ:TSLA) is an automotive and clean energy company that leverages advanced artificial intelligence in its autonomous driving technology and robotics initiatives.\nWhile we acknowledge the potential of TSLA as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 10 Trending AI Stocks on Wall Street and 11 AI Stocks Analysts Are Watching Closely .\nDisclosure: None.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "14:20:00",
      "Source": "Motley Fool",
      "Title": "Are Democrats Still Buying Teslas? Are Republicans Replacing Lost Buyers? Here's What the Data Says",
      "URL": "https://finance.yahoo.com/m/eb3c0e68-288b-3afd-a0cb-5563cc4f1d1d/are-democrats-still-buying.html",
      "Content": "Are Democrats Still Buying Teslas? Are Republicans Replacing Lost Buyers? Here's What the Data Says\n\nWilliam Dahl, The Motley Fool\nThu, December 18, 2025 at 10:20 PM PST 5 min read\n\nIn this article: TSLA\n\nABI.BR\n\nKey Points In these polarized times, Elon Musk's vocal political activity risked alienating millions of potential customers in a niche of the consumer discretionary sector.\n2024 marked Tesla's first fall in car sales in 12 years.\nMusk's political activity likely hurt the company, but Tesla faces bigger questions in 2026 and beyond.\nThese 10 stocks could mint the next wave of millionaires ›\n\nIn some businesses, CEOs can wade into politics without fearing a consumer backlash. On the left, George Soros doesn't need to raise capital from Republican voters. On the right, boycotts of Koch Industries would be difficult since its asphalt, electronic components, advanced fabrics, and other products aren't consumer-facing.\nBut in the consumer discretionary sector, it's a different story. Anyone can change their beer order on a dime, as Anheuser-Busch InBev discovered when Bud Light lost its crown as America's top-selling beer after backlash from a 2023 advertising campaign. It's the same with fast food, which may be why Chick-fil-A's CEO expressed regret for linking his company to the culture wars.\nElectric vehicles are as \"consumer discretionary\" as it gets. Consumers can even opt out of buying them entirely, as around 90% of U.S. drivers still did as of early 2025.\nSo, in a nation where 75 million people voted for Kamala Harris for president, has Tesla CEO Elon Musk's full-throated support for President Donald Trump cost Tesla (NASDAQ: TSLA) ?\n\nA study by four Yale University professors found that since 2022, Tesla saw a sharp decline in sales in blue counties that wasn't offset by gains in red areas. The researchers concluded that Musk's political activities cost the company 1.26 million vehicles sold.\nIt's a rigorous study, but it's still just one study. Are signs of this brand damage showing up in Tesla's balance sheets? Here's what the numbers say.\nHow were Tesla sales last year? In the fourth quarter of 2024, with the election in full swing and political sensitivities at their highest, Tesla reported an 8% decrease in car sales year-over-year. For Q1 2025, as Musk came to be seen as a key player in the Trump administration, revenue from car sales fell 20% year-over-year. Third-quarter sales saw a spike, up 6% from the previous year, but that was most likely caused by buyers rushing to complete purchase before a $7,500 federal EV tax credit expired Sept. 30.\nTesla bulls might point out that, over the span of Musk's three-year political journey, which began in 2022, Tesla saw a 67% increase in revenue and a 43% rise in net income before taxes. Those increases are well above the 20% inflation that has taken place since 2021.\n\nStory Continues\nHowever, Tesla's profits took a hit in 2024, falling from $15 billion in 2023 to $7.1 billion, and annual sales fell 1.8 million from 2023. That was the first decline in car sales that Tesla experienced in 12 years, which is striking considering that Tesla cut prices. It's strong evidence that the Yale study is correct that political brand damage hurt Tesla sales.\n\nIs Tesla a buy today? In the month following Election Day last November, Tesla shares rose 69%, as traders priced in the expected value of a CEO with the president-elect's ear. With hindsight, the rally appears misguided, as the Trump administration seems to have harmed Tesla on balance.\nAccording to J.P. Morgan analyst Ryan Brinkman, Tesla could lose over half of its annual earnings from the administration's policies, like the loss of the $7,500 federal EV tax credit . As one company executive told The Financial Times , \"There's no question that Tesla will be hit harder than most.\"\n\nYet Tesla is more than just a car company. In 2024, roughly 10% of its revenue came from energy generation and storage, while 10.5% came from other services. Musk has said that 80% of Tesla's value will one day come from its Optimus robots, which would begin mass production in late 2026 at the earliest. During last quarter's earnings call , Musk said Optimus has the potential to be \"the biggest product of all time.\"\nTesla has several paths to glory, and any brand damage from politics is already priced into shares. But their price-to-earnings ratio of 312 is, for such an established company, a little too steep for me. With so many question marks around the company, from the success or failure of Optimus to the battle for market share, Tesla's \"priced for perfection\" valuation seems unreasonable. I'm taking a \"wait and see\" approach on the stock.\n\nDon’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $443,371 !*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $51,715 !*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $511,196 !*\nRight now, we’re issuing “Double Down” alerts for three incredible companies , available when you join Stock Advisor , and there may not be another chance like this anytime soon.\nSee the 3 stocks »\n*Stock Advisor returns as of December 15, 2025\nJPMorgan Chase is an advertising partner of Motley Fool Money. William Dahl has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends JPMorgan Chase and Tesla. The Motley Fool has a disclosure policy .\nAre Democrats Still Buying Teslas? Are Republicans Replacing Lost Buyers? Here's What the Data Says was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "10:25:00",
      "Source": "Motley Fool",
      "Title": "If You Had Invested $1,000 in Tesla Stock 1 Year Ago, Here's How Much You Would Have Today",
      "URL": "https://finance.yahoo.com/m/6ba3db48-ac29-3fd6-8792-ad2bbfaab0b0/if-you-had-invested-%241%2C000-in.html",
      "Content": "If You Had Invested $1,000 in Tesla Stock 1 Year Ago, Here's How Much You Would Have Today\n\nNeil Patel, The Motley Fool\nThu, December 18, 2025 at 6:25 PM PST 2 min read\n\nIn this article: TSLA\n\nKey Points Tesla's performance over the past 12 months comes up short of the overall market's gain.\nThe stock's current valuation shows just how bullish market sentiment has become, with Tesla having no room for error.\nThese 10 stocks could mint the next wave of millionaires ›\nBy disrupting the massive global automobile industry, Tesla (NASDAQ: TSLA) became one of the best performing stocks on the market. Shares have rocketed higher over the past decade. And they currently trade at record levels.\nMore recently, though, shareholders have dealt with a different reality. If you had invested $1,000 in Tesla shares one year ago, here's how much you'd have today.\nShareholders need to fasten their seatbelts Tesla proves that even the most valuable companies can experience heightened levels of volatility. During the three months leading up to mid-March this year, the stock had dropped 49%. Shares have more than doubled over the following nine months, as market sentiment improved drastically.\nAll told, this electric vehicle (EV) stock is up 9% over the past 12 months (as of Dec. 16). A $1,000 starting investment would be worth $1,090 today. That's not impressive.\n\nExpectations could not be higher Despite underperforming the market in the last year, Tesla shares trade at a nosebleed valuation. The current price-to-earnings ratio of 318 shows just how bullish investors have become about the company's autonomous driving and humanoid robotics efforts. Progress is being made, but there is still a lot of long-term uncertainty around tech development and customer adoption.\n\nTesla needs to execute flawlessly to live up to the valuation. Any missteps could send the stock tanking in no time.\nDon’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $443,371 !*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $51,715 !*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $511,196 !*\nRight now, we’re issuing “Double Down” alerts for three incredible companies , available when you join Stock Advisor , and there may not be another chance like this anytime soon.\n\nStory Continues\nSee the 3 stocks »\n*Stock Advisor returns as of December 15, 2025\nNeil Patel has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Tesla. The Motley Fool has a disclosure policy .\nIf You Had Invested $1,000 in Tesla Stock 1 Year Ago, Here's How Much You Would Have Today was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "07:08:00",
      "Source": "TheStreet",
      "Title": "Top-rated analyst drops curt 8-word take on Tesla stock",
      "URL": "https://finance.yahoo.com/m/eb702393-451c-3df7-ae0b-3adcbb62973f/top-rated-analyst-drops-curt.html",
      "Content": "Top-rated analyst drops curt 8-word take on Tesla stock\n\nMoz Farooque\nThu, December 18, 2025 at 3:08 PM PST 4 min read\n\nIn this article: TSLA\n\n“Only about $30-$40 per share in that business.”\nThat curt assessment comes from five-star analyst Jed Dorsheimer of William Blair, highlighting just how differently the market now views Tesla stock.\nAlthough EVs still generate the lion’s share of its sales ( over 75% in Q3), Dorsheimer feels that investors value Tesla more like an AI and robotics player .\n\nRecent gains in Tesla stock are reflective of that shift.\nFor perspective, Tesla stock has risen a remarkable 48% over the past six months and 14.3% in the past month alone.\nConsequently, Tesla stock is now trading at over 380 times forward GAAP earnings , a dizzying 1,820% higher than the sector median.\nAdditionally, it trades at over 17 times forward sales estimates , which is roughly 1,672% higher than the sector median.\nFollowing its superb run-up, Wall Street consensus estimates point to a 15.3% downside , to $395.73, expecting a bumpy road ahead for the stock.\nThose gains point to a growing optimism around Tesla’s potent robotaxi division, full self-driving progress, and its much-talked-about Optimus robot, which has helped shift the narrative away from the sluggishness in its EV division.\nNaturally, that creates a clear disconnect that the investing world just can’t ignore.\nHence, Tesla’s valuation is tied to future breakthroughs. However, its bottom-line health is still dependent on what has become a highly regulated, competitive auto market, creating an obvious dichotomy.\nTesla’s valuation has quietly moved beyond cars Dorsheimer isn’t approaching Tesla stock through the lens we’ve grown accustomed to over the years, and that difference matters.\nAccording to TipRanks , William Blair analyst Jed Dorsheimer is a five-star analyst who is ranked #308 out of 10,192 Wall Street analysts, positioning him at the top tier of all tracked analysts.\n\nDorsheimer’s calls have generated an average return of +26.9% per rating, underscoring strong upside capture when he’s right.\nMore Tesla:\nTesla fatal crash lawsuit takes a wild turn\nTesla: what must happen for the $1 trillion payout\nTesla accused of not following key law\nTesla has more bad news for Cybertruck lovers\nIn his analysis, Tesla’s valuation quietly moved away from its hugely popular vehicle business toward longer-term (some would say moon-shot) bets in autonomy and energy.\nTherefore, if we encounter an uninspiring quarterly delivery report or pricing issues, the stock is unlikely to react in the same manner as it did in the past.\nHe believes Tesla is in the midst of a strategic transition, with investor interest focused on full self-driving technology, robotics, and a growing energy platform.\n\nStory Continues\nDorsheimer offered further detail on Yahoo Finance .\nIn Dorsheimer’s model, autonomy currently accounts for approximately 70% of Tesla’s value, where execution on future technologies becomes all the more important.\n“If you value Tesla as an auto company, it's just the wrong framework,” CEO Elon Musk shared in Tesla’s Q1 2024 earnings call from last year.\n\nRelated: History of Tesla & its stock: Timeline, facts & milestones\nWhat major banks say Tesla stock is really worth The shift in how Tesla stock is valued isn’t limited to a single analyst.\nAcross Wall Street, Tesla is being modeled more as a portfolio of future technologies instead of an EV giant.\nAlthough differences over the upside remain, the common thread is virtually the same, in that Tesla’s car business plays a shrinking role.\n\nRelated: Veteran analyst makes jaw-dropping call on Tesla stock\nAdditionally, a significant portion of Tesla’s non-automotive promise is already reflected in the stock price, offering virtually no margin for error.\nBank of America employs a sum-of-the-parts model, assigning 45% of Tesla’s value to Robotaxis, 17% to Full Self-Driving, and 19% to Optimus. In comparison, it assigns just 12% for core automotive, describing the setup as mostly “stretched.”\nMorgan Stanley concurs with BofA and has reduced the weight of the auto business (valued at $55 per share) , with a focus on network services, Robotaxis, and humanoid robots. Additionally, it raised its price target on the stock to $425 from $410 while downgrading it, arguing that much of the upside from non-auto initiatives is already priced in.\nGoldman Sachs remains neutral while framing autonomy as Tesla’s key growth engine. Its caution mainly centers on its bottom line, with competition and regulation likely to cap margin growth.\nRelated: Facebook makes daring move to challenge Disney, Netflix\nThis story was originally published by TheStreet on Dec 18, 2025, where it first appeared in the Investing section. Add TheStreet as a Preferred Source by clicking here.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "06:47:01",
      "Source": "Motley Fool",
      "Title": "Stock Market Today, Dec. 18: Rivian Automotive Surges To 52-Week High After Analyst Upgrade and Higher Price Target",
      "URL": "https://finance.yahoo.com/m/e3d5a176-deac-351b-94ec-c966dd19ad9a/stock-market-today%2C-dec.-18%3A.html",
      "Content": "Stock Market Today, Dec. 18: Rivian Automotive Surges To 52-Week High After Analyst Upgrade and Higher Price Target\n\nHoward Smith, The Motley Fool\nThu, December 18, 2025 at 2:47 PM PST 2 min read\n\nIn this article: RIVN\n\n^GSPC\n\n^IXIC\n\nTSLA\n\nF\n\nRivian Automotive (NASDAQ:RIVN) , electric truck and SUV maker, closed Thursday’s session at $20.28, up 15.03%. Rivian Automotive IPO'd in 2021 and has fallen about 75% since going public. Trading volume reached 66.4 million shares, about 36% above its three-month average of 49 million shares.\n\nThursday’s move followed a Robert W. Baird upgrade and new price target, while investors are watching how Rivian executes its autonomy roadmap and 2026 R2 launch.\n\nHow the markets moved today The S&P 500 (SNPINDEX: ^GSPC) added 0.79% to finish at 6,774, while the Nasdaq Composite (NASDAQINDEX: ^IXIC) gained 1.38% to 23,006. Within electric vehicle (EV) manufacturing, industry peers Tesla (NASDAQ:TSLA) rose 3.45% and Ford Motor Company (NYSE:F) edged higher by 0.08%, highlighting diverging reactions to product and strategy updates across major EV names.\n\nWhat this means for investors Baird's new price target still implies upside of 25% from Rivian's closing price today. The Wall Street firm's \"buy\" rating comes as Rivian is poised to increase sales and brand recognition with its upcoming R2 SUV.\nRivian also gave investors a roadmap for its path to produce a fully autonomous vehicle in its autonomy and AI day presentation last week. It impressed investors by revealing an in-house AI chip for its autonomy platform. That would likely spur demand further and offer Rivian a new revenue source.\n\nDon’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $443,371 !*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $51,715 !*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $511,196 !*\nRight now, we’re issuing “Double Down” alerts for three incredible companies , available when you join Stock Advisor , and there may not be another chance like this anytime soon.\nSee the 3 stocks »\n*Stock Advisor returns as of December 15, 2025\nHoward Smith has positions in Rivian Automotive and Tesla. The Motley Fool has positions in and recommends Tesla. The Motley Fool has a disclosure policy .\nStock Market Today, Dec. 18: Rivian Automotive Surges To 52-Week High After Analyst Upgrade and Higher Price Target was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "06:30:00",
      "Source": "Yahoo Finance Video",
      "Title": "Mag 7 stocks are 'back in favor' among retail investors: Robinhood",
      "URL": "https://finance.yahoo.com/video/mag-7-stocks-back-favor-223000208.html",
      "Content": "Mag 7 stocks are 'back in favor' among retail investors: Robinhood\n\nYahoo Finance Video and Josh Lipton\nThu, December 18, 2025 at 2:30 PM PST\n\nIn this video: GOOG\n\nNVDA\n\nTSLA\n\nMETA\n\nHOOD\n\nRobinhood's ( HOOD ) chief brokerage officer, Steve Quirk, joins Market Domination host Josh Lipton to talk about trends among retail investors before 2025 draws to a close.\nWatch the video above to hear more about retail investor behavior on the platform.\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination .\n\nVideo Transcript\n\n00:00 Speaker A\nYou know, Steve, more broadly, I always love having you on because you have such unique line of sight into the retail investors and and what they're doing with their money, Steve. Um, November trading volumes are they're interesting, uh, Steve for you all. It looks like equity and options volumes if I'm reading this right, they were up year-over-year but they were down month-over month. Then it looks like crypto, Steve, uh, it looks down both ways. How how should we be interpreting this?\n00:26 Speaker B\nUm, I would I would look at it in the context of the whole year. If you look at in the whole in the context of the whole year, um, the months pre prior to that were the some of the all all-time high months um in in our history. So, I wouldn't look at it as a a real slowdown. I would look at it as more what I'd call a little bit more of a return to norm even from this year. But even what we're seeing today and and by the way, I I think there's a lot of hope that this is the start of the Santa Claus rally which typically happens mid mid December. Um we've been four days down, so I think people have been waiting for this. Um, I think you're seeing people that are still pretty engaged. You know, they're wrapping up the year and kind of rounding out the portfolio and making sure that everything is in order um before the new year.\n01:12 Speaker A\nIn terms of of of uh specific names, Steve, always curious to hear. what are what are you seeing? What are some of the more popular commonly held stocks?\n01:21 Speaker B\nYou know, it's funny, they there's a lot of rotation that happens. People are their own uh portfolio managers. Um but what we've seen recently is they've rolled out of names that have had some appreciation like Rivian and rolled into back to the mag seven, which, you know, for a while kind of fell out of favor but now they're it's back in favor. So, you know, this rotation is is something that's really fun to watch. And as we we watch customers typically take gains and sort of rotate into ones that they think have opportunities for appreciation.\n01:54 Speaker A\nAnother another stat that jumped out Steve, margin balances. I see here they're up about 150% year-over-year. What do you make of that? Is that to you Steve, do you see that, okay, that's a sign of is that a sign of confidence, risk appetite? What's your read?\n02:09 Speaker B\nUh I think it's a it's uh it's it's a it's really a factor of two things. Number one, we've been growing our margin business. So a lot of that is just net growth of that business, attracting new customers who are utilizing margin. And then the second component of it is again with elevated trading and elevated interest in the market, you're naturally going to see those margin balances go up. But you're right, the um the the um increase has been pretty extreme.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "06:08:30",
      "Source": "Fox Business",
      "Title": "Elon Musk's net worth soars, now more than double his closest rival’s as Tesla stock continues to surge",
      "URL": "https://finance.yahoo.com/m/e73694ed-2e8e-3ece-8595-b2ff71d5e0de/elon-musk%27s-net-worth-soars%2C.html",
      "Content": "Elon Musk's net worth soars, now more than double his closest rival’s as Tesla stock continues to surge\n\nEric Revell\nThu, December 18, 2025 at 2:08 PM PST 2 min read\n\nIn this article: TSLA\n\nGOOG\n\nAMZN\n\nORCL\n\nElon Musk's net worth is now doubling the next closest billionaire in the rankings of the world's wealthiest people amid a surge in Tesla stock.\nThe Forbes Real-Time Billionaires List showed that as of Thursday afternoon, Musk's net worth is about $681 billion as the Tesla CEO and entrepreneur expanded his lead as the world's wealthiest person.\n\nThat's more than double the next closest billionaire on the list, Google co-founder Larry Page, whose wealth totaled $249 billion on Thursday.\nRounding out the top five are Amazon founder Jeff Bezos at $239 billion, Google co-founder Sergey Brin at $229.9 billion, and Oracle co-founder Larry Ellison at $229.6 billion.\nMusk Predicts Ai Will Create 'Universal High Income' And Make Saving Money Unnecessary\nEarlier this week, Tesla stock hit its first new record closing high since Dec. 17, 2024, when its last record close was recorded.\nRead On The Fox Business App\nThe stock was boosted after Musk said on Monday that the electric vehicle (EV) maker was testing its robotaxis without safety monitors in the front passenger seat.\nElon Musk's Tesla Faces Fresh Criticism From 'Big Short' Investor Michael Burry\n\nTesla shares were also boosted by an announcement that the California Department of Motor Vehicles will pause the 30-day sales suspension it imposed after regulators determined Tesla's marketing of its self-driving tech using the brand names Autopilot and Full Self-Driving was misleading, as the tech requires supervision and isn't autonomous.\nThe California DMV delayed the suspension by 90 days to give Tesla an opportunity to remedy the situation. A separate suspension of its manufacturing license for 30 days was put on hold indefinitely.\nTesla Shareholders Approve Musk's $1T Pay Package\nDMV Director Steve Gordon told reporters on Tuesday that the regulator's concern is now focused on the term Autopilot, as Tesla took steps to address concerns around the term Full-Self Driving .\n\nTesla's Autopilot feature helps Tesla vehicles accelerate, brake and stay in lanes on highways, while its Full-Self Driving feature gives vehicles the ability to change lanes and obey traffic signals on city streets.\nThe company is now including the term \"Supervised\" in describing FSD in passenger vehicles. It uses an unsupervised version of the software when moving cars from assembly lines to deliver lots at some of its factories. It also uses FSD for a robotaxi service in Austin, Texas, with human safety monitors in front passenger seats and remote support.\n\nStory Continues\nReuters contributed to this report.\n\nOriginal article source: Elon Musk's net worth soars, now more than double his closest rival’s as Tesla stock continues to surge\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "05:55:00",
      "Source": "Zacks",
      "Title": "3 Stocks to Watch Near All-Time Highs: COF, MAR, TSLA",
      "URL": "https://finance.yahoo.com/news/3-stocks-watch-near-time-215500267.html",
      "Content": "3 Stocks to Watch Near All-Time Highs: COF, MAR, TSLA\n\nShaun Pruitt\nThu, December 18, 2025 at 1:55 PM PST 3 min read\n\nIn this article: COF\n\nCOF-PK\n\nCOF-PL\n\nCOF-PN\n\nTSLA\n\nAn easing in inflation pressures helped stabilize markets in Thursday’s trading session, although a few notable stocks had already printed fresh highs ahead of November's favorable CPI report.\nBeing leaders in their respective industries, investors are surely wondering if higher highs are in store for three of these popular stocks in particular.\n\nThis makes it an ideal time to take a look at the trend of earnings estimate revisions, the primary influencer to the Zacks Rank.\n\nCapital One – COF Zacks Rank #1 (Strong Buy) With its stock hitting a new all-time high of $244 a share, Capital One COF is in more wallets following the successful acquisition of Discover Financial earlier in the year.\nAcquiring Discover has transformed Capital One into a market leader by giving it both size and infrastructure, combining one of the largest credit card issuers with a major payments network. Becoming a vertically integrated powerhouse in consumer finance, Capital One stock is up +35% in 2025, and EPS revisions have continued to soar thanks to strong financial results and shareholder-friendly buybacks.\nCapital One’s annual earnings are now expected to leap 41% in fiscal 2025 to $19.77 per share compared to EPS of $13.96 last year. Plus, FY26 EPS is projected at over $20.00, and COF trades at a very attractive 12X forward earnings multiple.\n\nImage Source: Zacks Investment Research\n\nMarriott International – MAR Zacks Rank #3 (Hold) $311 a share set a record for the renowned hotel operator's stock on Wednesday, but the price performance here has been less captivating. Marriott International's MAR stock is up +10% year to date, and its steady EPS growth is accompanied by a modest 0.86% annual dividend yield that’s currently at $2.80.\n\nImage Source: Zacks Investment Research\nIt’s also intriguing that Marriott has increased its dividend by 28% in the last five years, and its 27% payout ratio indicates there is plenty of room for more hikes in the future as one of the most established and well-managed hospitality companies.\nAlthough a sound long-term investment, Marriott’s somewhat stagnant stock performance may continue, as FY25 EPS estimates have barely increased in the last 90 days and FY26 revisions are slightly down.\n\nImage Source: Zacks Investment Research\n\nTesla – TSLA Zacks Rank #3 (Hold) Fresh all-time highs of $495 a share come as investors have been more excited about Tesla’s TSLA robotaxi program, AI integration, and robotics ambitions, even as EV sales have slowed.\nNotably, Tesla has been testing driverless robotaxis without safety monitors, a major milestone that investors see as proof of progress toward autonomous mobility. Elon Musk has also announced that Tesla’s in-car systems will integrate Grok, an AI chatbot, boosting confidence in Tesla’s ability to monetize AI. Regarding robotics, Tesla’s humanoid robot project, Optimus, is seen as a long-term growth driver, adding to the narrative that Tesla is more than just an EV company.\n\nStory Continues\nWhile these are exciting developments, EPS revisions are modestly lower in the last 60 days for FY25 and FY26. Considering such, the recent momentum in TSLA could be short-lived, with most of the +20% YTD gains coming in the last month. Still, Tesla has been able to avoid a sell rating as a sharp rebound is expected on its top and bottom lines next year.\n\nImage Source: Zacks Investment Research\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMarriott International, Inc. (MAR) : Free Stock Analysis Report\nCapital One Financial Corporation (COF) : Free Stock Analysis Report\nTesla, Inc. (TSLA) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "05:22:13",
      "Source": "Investor's Business Daily",
      "Title": "Stock Market Today: Indexes Keep Gains; Western Digital On A Streak As Carvana, Nuke Play Set Up (Live Coverage)",
      "URL": "https://finance.yahoo.com/m/3c54efeb-8d61-3f56-90ba-bb013f26d2f0/stock-market-today%3A-indexes.html",
      "Content": "Stock Market Today: Indexes Keep Gains; Western Digital On A Streak As Carvana, Nuke Play Set Up (Live Coverage)\n\nSCOTT LEHTONEN and DAVID SAITO-CHUNG\nThu, December 18, 2025 at 1:22 PM PST 10 min read\n\nIn this article: ^DJI\n\nWDC\n\nNVDA\n\n^GSPC\n\nTSLA\n\nStock Market Today: The Dow Jones index rose Thursday on a surprise CPI inflation report. Nvidia stock and Tesla rallied.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "04:40:00",
      "Source": "Motley Fool",
      "Title": "Should You Buy Tesla While It's Below $500?",
      "URL": "https://finance.yahoo.com/m/610e508a-d27a-308d-b2fc-65ef4013f686/should-you-buy-tesla-while.html",
      "Content": "Should You Buy Tesla While It's Below $500?\n\nChris Neiger, The Motley Fool\nThu, December 18, 2025 at 12:40 PM PST 5 min read\n\nIn this article: TSLA\n\nKey Points Tesla's operating expenses increased by 50% in the third quarter and are likely to remain elevated as it spends billions of dollars to expand into robotics and autonomy.\nMeanwhile, Tesla's core EV business is suffering, and vehicle sales fell below 40,000 in November.\nTesla's stock is priced for perfection at a time when the company is trying to get back on track.\nThese 10 stocks could mint the next wave of millionaires ›\n\nTesla (NASDAQ: TSLA) has been a fantastic stock for long-term investors, with returns exceeding 3,100% over the past decade. However, the company currently faces significant headwinds, as sales of its electric vehicles (EVs) are slowing, costs are rising, and it places big bets on unproven markets including robotics and autonomous vehicles (AVs).\nIt's no surprise, then, that many investors are trying to determine what to do with Tesla stock. Is it a good time to buy with its shares priced under $500, or is it too early to take a risk on the company transitioning toward future technologies when its EV business is slumping?\nHere are three reasons why I believe it's best not to buy Tesla stock right now.\n1. Expenses are rising fast Tesla CEO Elon Musk is transitioning his company toward an autonomous vehicle and robotics company. The idea is for Tesla to mass-produce its Optimus robots -- up to 1 million by 2030 -- and for the company to vastly expand its fledgling robotaxi service that's currently only in a handful of cities. It's worth noting Musk said in July the service would cover half the country by the end of the year, which is now, and it's nowhere near achieving this.\n\nThere's nothing wrong with Tesla focusing on these two opportunities, considering that AVs could eventually be worth $1.4 trillion by 2040, and humanoid robotics will be worth an estimated $5 trillion by 2050.\nBut to achieve its goals, Tesla is spending heavily, and it's likely to increase from here. The company's operating expenses rose by 50% to $3.4 billion in the third quarter, and research and development (R&D) costs jumped 57% to $1.6 billion. Management specifically said the operating cost increase was \"driven by SG&A [selling, general, and administrative], AI and other R&D projects.\"\nFor Tesla to expand into nascent robotics and AV markets, additional billions of dollars will need to be spent at a time when the company's core business -- selling electric vehicles -- isn't doing so hot.\n\n2. Tesla's core business is suffering It's easy to get caught up in Tesla's big plans to be an autonomous vehicle and robotics company, but Tesla is still primarily an electric vehicle company right now. Unfortunately, business is not so good.\n\nStory Continues\nTesla's net income fell 37% to $1.4 billion in the third quarter, leaving the company with significantly less money to reinvest in the business.\nThings could be getting worse, too. Following the expiration of the federal EV tax credits, Tesla's vehicle sales fell below 40,000 in November -- its lowest monthly sales in years. Tesla's third-quarter results temporarily received a boost as customers rushed to take advantage before credits expired at the end of September, which helped lift Tesla's revenue 12% to $28 billion in the quarter.\n\nHowever, the November vehicle sales numbers indicate that Tesla and other EV manufacturers have a significant problem on their hands. EVs often cost more than traditional gas-powered vehicles, and after years of inflation and high interest rates, and no more tax credits, there's less demand for EVs than in the recent past.\nThis would be a significant problem on its own for Tesla, but it's compounded by the fact that the company is spending so much to move into robotics and AVs.\n3. Its stock is expensive Even if Tesla somehow pulls off its transition to AVs and robotics and turns around its stumbling EV business, it doesn't eliminate the fact that investors are paying a high premium for a company as it makes risky moves.\nTesla's shares currently have a price-to-earnings ratio of 206, far above the tech sector's average P/E ratio of about 45.\n\nThis means Tesla's stock is already priced for perfection at a time of significant transition, falling profit, and increasing expenses. That's too risky for my liking, even if Tesla eventually achieves its goals. I think investors are better off not buying Tesla stock right now, at least waiting until the company can prove that it can reinvigorate sales and earnings from its electric vehicle business.\nDon’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $443,371 !*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $51,715 !*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $511,196 !*\nRight now, we’re issuing “Double Down” alerts for three incredible companies , available when you join Stock Advisor , and there may not be another chance like this anytime soon.\nSee the 3 stocks »\n*Stock Advisor returns as of December 15, 2025\nChris Neiger has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Tesla. The Motley Fool has a disclosure policy .\nShould You Buy Tesla While It's Below $500? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "04:11:13",
      "Source": "StockStory",
      "Title": "Why Tesla (TSLA) Stock Is Trading Up Today",
      "URL": "https://finance.yahoo.com/news/why-tesla-tsla-stock-trading-201113901.html",
      "Content": "Why Tesla (TSLA) Stock Is Trading Up Today\n\nRadek Strnad\nThu, December 18, 2025 at 12:11 PM PST 2 min read\n\nIn this article: TSLA\n\nSPIIY\n\nWhat Happened? Shares of electric vehicle pioneer Tesla (NASDAQ:TSLA) jumped 4.4% in the afternoon session after the stock's positive momentum continued as reports revealed a significant Cybertruck purchase by Elon Musk's SpaceX.\nThe electric vehicle maker's stock rebounded after it was revealed that SpaceX bought tens of millions of dollars' worth of Cybertrucks. This move was seen as a way to boost demand, as it was reported that demand for the truck had not yet met Tesla's planned production capacity. Adding to the positive news, Tesla's energy arm also made headlines. The company entered a three-year European agreement with French services provider SPIE SA to deliver battery energy storage system projects using its Megapack solutions.\n\nAfter the initial pop the shares cooled down to $487.21, up 4.1% from previous close.\nIs now the time to buy Tesla? Access our full analysis report here .\nWhat Is The Market Telling Us Tesla’s shares are extremely volatile and have had 41 moves greater than 5% over the last year. In that context, today’s move indicates the market considers this news meaningful but not something that would fundamentally change its perception of the business.\nThe previous big move we wrote about was 3 days ago when the stock gained 3.8% on the news that Wedbush analyst Dan Ives reiterated his $600 price target, declaring 2026 a pivotal \"monster year\" for the EV giant.\n\nIves argued that Tesla is \"taking major steps in advancing its AI Revolution path,\" with autonomy and robotics set to be the \"game changer\" that defines the company's future. Optimism was further strengthened by reports of driverless Model Y testing in Austin, validating the thesis that the robotaxi timeline is accelerating.\nTesla is up 28.5% since the beginning of the year, and at $487.21 per share, it is trading close to its 52-week high of $489.88 from December 2025. Investors who bought $1,000 worth of Tesla’s shares 5 years ago would now be looking at an investment worth $2,103.\nThe 1999 book Gorilla Game predicted Microsoft and Apple would dominate tech before it happened. Its thesis? Identify the platform winners early. Today, enterprise software companies embedding generative AI are becoming the new gorillas. Click here for access to our special report that reveals one profitable leader already riding this wave .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "04:01:46",
      "Source": "TechCrunch",
      "Title": "Pickle Robot adds Tesla veteran as first CFO",
      "URL": "https://finance.yahoo.com/news/pickle-robot-adds-tesla-veteran-200146013.html",
      "Content": "Pickle Robot adds Tesla veteran as first CFO\n\nRebecca Szkutak\nThu, December 18, 2025 at 12:01 PM PST 1 min read\n\nIn this article: UPS\n\nTSLA\n\nPickle Robot, which builds autonomous unloading robots for warehouses and distribution centers, announced a new chief financial officer just days after a report of a major deal with UPS.\nThe Charlestown, Massachusetts-based company announced that it hired Jeff Evanson as its CFO on Thursday. Evanson had been consulting for the company since September and recently joined full time.\n\nEvanson previously served as the vice president of global investor relations and strategy at Tesla from 2011 to 2017. In that role, he worked directly with Elon Musk and helped the company raise debt and equity financing to support the launch of multiple Tesla vehicle lines and company acquisitions.\nEvanson will be Pickle’s first CFO and joins as the company — founded in 2018 with around $100 million in venture capital raised — reportedly expands its partnership with shipping giant UPS. According to Bloomberg, UPS is investing $120 million to purchase 400 of Pickle’s robots, with deployment beginning in late 2026 and early 2027.\nPickle declined to comment on this week’s UPS news. A Pickle spokesperson did confirm that UPS has been a Pickle customer for a few years but wouldn’t confirm when the partnership started.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "03:49:58",
      "Source": "Investor's Business Daily",
      "Title": "Stock Market Today: Indexes Keep Gains; This Stock In Buy Range As Carvana, Nuke Play Set Up (Live Coverage)",
      "URL": "https://finance.yahoo.com/m/3c54efeb-8d61-3f56-90ba-bb013f26d2f0/stock-market-today%3A-indexes.html",
      "Content": "Stock Market Today: Indexes Keep Gains; This Stock In Buy Range As Carvana, Nuke Play Set Up (Live Coverage)\n\nSCOTT LEHTONEN and DAVID SAITO-CHUNG\nThu, December 18, 2025 at 11:49 AM PST 9 min read\n\nIn this article: ^DJI\n\nMU\n\nCEG\n\nESLT\n\nNEM\n\nStock Market Today: The Dow Jones index rose Thursday on a surprise CPI inflation report. Nvidia stock and Tesla rallied.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "03:28:03",
      "Source": "Motley Fool",
      "Title": "Why Tesla Stock Popped Thursday",
      "URL": "https://finance.yahoo.com/m/72e0efd1-dee1-3d56-990b-5ad7060df450/why-tesla-stock-popped.html",
      "Content": "Why Tesla Stock Popped Thursday\n\nRich Smith, The Motley Fool\nThu, December 18, 2025 at 11:28 AM PST 3 min read\n\nIn this article: TSLA\n\nKey Points Tesla is reported to have sold 1,000 or even 2,000 Cybertrucks to SpaceX.\nMath suggests that Tesla has had trouble selling Cybertrucks to customers that Elon Musk does not own.\nThese 10 stocks could mint the next wave of millionaires ›\nTesla (NASDAQ: TSLA) stock jumped 4.5% through 1:45 p.m. ET Thursday on some apparently bad news -- that might turn out to be good news for Tesla stock, and for SpaceX stock, too ( once SpaceX IPOs ).\nAs EV news specialist Electrek reports, deep in the heart of Texas, Elon Musk's SpaceX is snapping up tens of millions of dollars' worth of Tesla Cybertrucks to work at its Starbase spaceport.\nHow is this bad news? Electrek explains: Tesla originally planned to build 250,000 Cybertrucks a year, ramping as high as 500,000 units per year if the demand justified it.\nBut demand didn't justify it.\nCrunching the numbers on Tesla's non-Model 3 and non-Model Y sales (Tesla groups S, X, and Cybertruck sales all together), Electrek calculates Tesla sold perhaps 20,000 Cybertrucks this year, turning Cybertruck into a gigantic \"commercial flop.\"\n\nExcept for one thing: SpaceX.\nSqueezing corporate lemons and turning them into lemonade, Musk's SpaceX rode to the rescue of Musk's Tesla, buying between 1,000 and 2,000 Cybertrucks for SpaceX's work fleet. At $80,000 per unit, that's $80 million to $160 million in revenue for Tesla.\nTurning bad news into good news Electrek sees this as bad news and a potential concern to investors in an upcoming SpaceX IPO. Viewed another way, though, if SpaceX needs trucks for its ground operations, why wouldn't it buy Cybertrucks from another Musk-owned company, if the alternative is giving money to a Musk competitor like Ford Motor Co. (NYSE: F) or General Motors (NYSE: GM) ?\n\nSeems to me, keeping the money in the family (so to speak) is actually a bright idea.\nAnd if it means Tesla now has a captive customer in SpaceX, which can help Tesla make its sales numbers when it needs to, that's probably a good thing for Tesla stock.\nDon’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $443,371 !*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $51,715 !*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $511,196 !*\n\nStory Continues\nRight now, we’re issuing “Double Down” alerts for three incredible companies , available when you join Stock Advisor , and there may not be another chance like this anytime soon.\nSee the 3 stocks »\n*Stock Advisor returns as of December 15, 2025\nRich Smith has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Tesla. The Motley Fool recommends General Motors. The Motley Fool has a disclosure policy .\nWhy Tesla Stock Popped Thursday was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "02:31:58",
      "Source": "MT Newswires",
      "Title": "Market Chatter: GM's Anderson Emerging as Frontrunner to Succeed Barra as CEO",
      "URL": "https://finance.yahoo.com/news/market-chatter-gm-apos-anderson-183158398.html",
      "Content": "PREMIUM\nMarket Chatter: GM's Anderson Emerging as Frontrunner to Succeed Barra as CEO\n\nMT Newswires\nThu, December 18, 2025 at 10:31 AM PST 1 min read\n\nIn this article: GM\n\nTSLA\n\nGeneral Motors (GM) Chief Product Officer Sterling Anderson is emerging as the favorite to succeed C\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "02:28:58",
      "Source": "Investor's Business Daily",
      "Title": "Stock Market Today: Gains Strengthen Again As Carvana, Newmont, Nuclear Play Set Up Entries (Live Coverage)",
      "URL": "https://finance.yahoo.com/m/3c54efeb-8d61-3f56-90ba-bb013f26d2f0/stock-market-today%3A-gains.html",
      "Content": "Stock Market Today: Gains Strengthen Again As Carvana, Newmont, Nuclear Play Set Up Entries (Live Coverage)\n\nSCOTT LEHTONEN and DAVID SAITO-CHUNG\nThu, December 18, 2025 at 10:28 AM PST 7 min read\n\nIn this article: ^DJI\n\nCVNA\n\nNEM\n\nNVDA\n\n^GSPC\n\nStock Market Today: The Dow Jones index rose Thursday on a surprise CPI inflation report. Nvidia stock and Tesla rallied.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "01:39:32",
      "Source": "Investor's Business Daily",
      "Title": "Stock Market Today: Index Gains Moderate; Carvana Outperforms As This Nuclear Play Sets Up (Live Coverage)",
      "URL": "https://finance.yahoo.com/m/3c54efeb-8d61-3f56-90ba-bb013f26d2f0/stock-market-today%3A-index.html",
      "Content": "Stock Market Today: Index Gains Moderate; Carvana Outperforms As This Nuclear Play Sets Up (Live Coverage)\n\nSCOTT LEHTONEN and DAVID SAITO-CHUNG\nThu, December 18, 2025 at 9:39 AM PST 6 min read\n\nIn this article: CVNA\n\nCEG\n\nCLS\n\nMU\n\n^IXIC\n\nStock Market Today: The Dow Jones index rose Thursday on a surprise CPI inflation report. Nvidia stock and Tesla rallied.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "01:22:38",
      "Source": "GuruFocus.com",
      "Title": "Elon Fever Hits Wall Street: Tesla Soars as SpaceX IPO Hype Builds",
      "URL": "https://finance.yahoo.com/news/elon-fever-hits-wall-street-172238594.html",
      "Content": "Elon Fever Hits Wall Street: Tesla Soars as SpaceX IPO Hype Builds\n\nKhac Phu Nguyen\nThu, December 18, 2025 at 9:22 AM PST 2 min read\n\nIn this article: TSLA\n\n^GSPC\n\nThis article first appeared on GuruFocus .\nTesla ( NASDAQ:TSLA ) has returned to the center of investor attention as markets continue to price in Elon Musk's longer-term ambitions in artificial intelligence, robotics, and space, even as the company's core automotive business faces mounting pressure. The shares reached their first record high of the year on Tuesday and have climbed roughly 20% over the past four weeks, extending a sharp rebound of 111% from an April 8 low that coincided with heightened tariff-related market anxiety during President Donald Trump's administration. The move has placed Tesla among the top 20 performers in the S&P 500 Index, underscoring how sentiment around Musk's broader vision is currently outweighing concerns tied to near-term vehicle sales and profitability.\n\nIs TSLA fairly valued? Test your thesis with our free DCF calculator.\nThat optimism has come with a notable expansion in valuation. Tesla is now trading at about 214 times forward earnings, making it the second-most expensive stock in the S&P 500, behind Warner Bros Discovery Inc. and ahead of Palantir Technologies Inc. Some investors argue the multiple is difficult to reconcile with slowing sales, declining profits, increased regulation, and more cautious consumer spending on cars, prompting a number of funds to reduce or exit positions. Others remain focused on Tesla's potential transformation into an AI and robotics company, highlighting Musk's stated goal of shifting the profit mix toward autonomous driving, robotaxis, and humanoid robots over time.\n\nLooking ahead, the possibility of a SpaceX public listing is adding another dimension to the Tesla debate. SpaceX is planning an insider share sale valuing the company at around $800 billion and could possibly pursue an initial public offering next year, which would create a new avenue for investors seeking exposure to Musk's ideas. Some market participants suggest this could lead to selling pressure in Tesla as capital rotates, while others believe a high-profile SpaceX listing could lift sentiment across Musk's ecosystem and support Tesla shares indirectly. For now, Tesla remains the only publicly traded vehicle for that vision, even as technical signals recently hinted the stock was approaching overbought levels, raising the prospect of a near-term pause following its latest surge.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "01:00:00",
      "Source": "The Wall Street Journal",
      "Title": "This Year’s Biggest News Stories, From the White House to the L.A. Fires to the Middle East, as Told by WSJ",
      "URL": "https://finance.yahoo.com/m/710f8644-385c-3807-b364-e3e78e961db4/this-year%E2%80%99s-biggest-news.html",
      "Content": "This Year’s Biggest News Stories, From the White House to the L.A. Fires to the Middle East, as Told by WSJ\n\nWilliam Power\nThu, December 18, 2025 at 9:00 AM PST 27 min read\n\nIn this article: TSLA\n\nA torrent of news happened in 2025. Here’s a timeline of some of the most important stories, including some of the year’s best photos.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "00:59:24",
      "Source": "Investor's Business Daily",
      "Title": "Stock Market Today: Indexes Rise; Nvidia, Tesla Rally; This Nuke Play Sets Up (Live Coverage)",
      "URL": "https://finance.yahoo.com/m/3c54efeb-8d61-3f56-90ba-bb013f26d2f0/stock-market-today%3A-indexes.html",
      "Content": "Stock Market Today: Indexes Rise; Nvidia, Tesla Rally; This Nuke Play Sets Up (Live Coverage)\n\nSCOTT LEHTONEN and DAVID SAITO-CHUNG\nThu, December 18, 2025 at 8:59 AM PST 5 min read\n\nIn this article: NVDA\n\nCLS\n\nMU\n\nCEG\n\nTSLA\n\nStock Market Today: The Dow Jones index rose Thursday on a surprise CPI inflation report. Nvidia stock and Tesla rallied.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-19",
      "Time": "00:45:30",
      "Source": "Benzinga",
      "Title": "Bill Gates Could Have Been 'World's First Trillionaire' By Ignoring Buffett's Advice — Instead, He Lost $10 Billion Shorting Tesla, Says Elon Musk",
      "URL": "https://finance.yahoo.com/news/bill-gates-could-worlds-first-164530436.html",
      "Content": "Bill Gates Could Have Been 'World's First Trillionaire' By Ignoring Buffett's Advice — Instead, He Lost $10 Billion Shorting Tesla, Says Elon Musk\n\nVishaal Sanjay\nThu, December 18, 2025 at 8:45 AM PST 3 min read\n\nIn this article: TSLA\n\nMSFT\n\nNVDA\n\nBRK.A\n\nBillionaire entrepreneur and Tesla Inc. (NASDAQ: TSLA ) CEO, Elon Musk , once again reignited the debate surrounding Microsoft Corp. (NASDAQ: MSFT ) co-founder, Bill Gates ‘ massive wealth, and what it could have been, had he not conformed to conventional wealth planning norms.\nBill Gates Could Have Been ‘World’s First Trillionaire’ On Wednesday, in a post on X, investor Michael Arouet highlighted the current top 10 richest people in the world, a list that no longer includes the Microsoft co-founder but does feature former CEO Steve Ballmer at No. 8, with an estimated net worth of $166 billion.\nThis comes after being ranked as the world’s wealthiest person by Forbes magazine for 18 of the 24 years between 1995 and 2017.\n\nDon't Miss:\nAmericans With a Financial Plan Can 4X Their Wealth — Get Your Personalized Plan from a CFP Pro\n$100k+ in investable assets? Match with a fiduciary advisor for free to learn how you can maximize your retirement and save on taxes – no cost, no obligation.\nArouet shared the story of Gates’ decision to sell his position in Microsoft on the advice of legendary investor and Berkshire Hathaway Inc. (NYSE: BRK ) (NYSE: BRK ) CEO, Warren Buffett , who asked him to diversify his holdings.\nAccording to Arouet, if Gates hadn’t listened to Buffett, he would now be “the world's first trillionaire, worth twice as much as Elon.”\nAs Microsoft shares continue to soar, and its market capitalization is now at $3.6 trillion, Gates’ net worth would have stood at a staggering $1.5 trillion if he had retained all of his shares in the company and hadn’t embarked on the massive philanthropic journey with his ex-wife, Melinda Gates .\nTo be fair, it's difficult to fault Buffett for that advice. Few could have anticipated Microsoft's extraordinary surge over the past decade, particularly after the stock spent years largely treading water following the dot-com crash, taking roughly 15 years to reclaim its prior peak.\nSee Also: Buffett's Secret to Wealth? Private Real Estate— Get Institutional Access Yourself\nLost $10 Billion In Tesla Short Position Musk weighed in on the post, once again bringing attention to the short position that he claimed Gates has held against Tesla for the past eight years.\nIn his reply to the post, Musk said “Bill Gates placed a massive short bet against Tesla,” which he said was 1% of the company’s total shares outstanding, while adding that the position has since cost the Microsoft co-founder as much as $10 billion, as Tesla shares soared over the past few years.\n\nStory Continues\nShares of Tesla were down 4.62% on Wednesday, closing at $467.26, while Microsoft was down 0.05%, at $476.12. Tesla scores high on Momentum and Growth in Benzinga’s Edge Stock Rankings , with a favorable price trend in the short, medium and long terms. Click here to see how it compares with Microsoft.\n\nRead More:\nMissed Nvidia and Tesla? RAD Intel Could Be the Next AI Powerhouse — Just $0.85 a Share\nWall Street's $12B Real Estate Manager Is Opening Its Doors to Individual Investors — Without the Crowdfunding Middlemen\nPhoto courtesy: Alexandros Michailidis on Shutterstock\nUNLOCKED: 5 NEW TRADES EVERY WEEK. Click now to get top trade ideas daily , plus unlimited access to cutting-edge tools and strategies to gain an edge in the markets.\nGet the latest stock analysis from Benzinga:\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Bill Gates Could Have Been 'World's First Trillionaire' By Ignoring Buffett's Advice — Instead, He Lost $10 Billion Shorting Tesla, Says Elon Musk originally appeared on Benzinga.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:46:01",
      "Source": "Investor's Business Daily",
      "Title": "Stock Market Today: Indexes Rise; Nvidia, Tesla Rally But Some Electronics Firms Struggle (Live Coverage)",
      "URL": "https://finance.yahoo.com/m/3c54efeb-8d61-3f56-90ba-bb013f26d2f0/stock-market-today%3A-indexes.html",
      "Content": "Stock Market Today: Indexes Rise; Nvidia, Tesla Rally But Some Electronics Firms Struggle (Live Coverage)\n\nSCOTT LEHTONEN and DAVID SAITO-CHUNG\nThu, December 18, 2025 at 7:46 AM PST 3 min read\n\nIn this article: ^DJI\n\nSMH\n\nDRI\n\nKMX\n\nASML\n\nStock Market Today: The Dow Jones index rose Thursday on a surprise CPI inflation report. Nvidia stock and Tesla rallied.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "23:37:47",
      "Source": "Bloomberg",
      "Title": "Tesla’s ‘Musk Premium’ in Focus With SpaceX IPO in View",
      "URL": "https://finance.yahoo.com/news/tesla-musk-premium-focus-spacex-120001761.html",
      "Content": "Tesla’s ‘Musk Premium’ in Focus With SpaceX IPO in View\n\nJordan Fitzgerald\nThu, December 18, 2025 at 7:37 AM PST 6 min read\n\nIn this article: TSLA\n\n^GSPC\n\n(Bloomberg) — Elon Musk is selling investors a future of driverless cars, robot assistants and life on Mars. The problem for investors is there’s only one way to buy into his vision: Tesla Inc.’s stock.\nMost Read from Bloomberg\nHudson Tunnel Digging Work to Start as Boring Machines Ready\nNYC High Line-Area Building Floats $53 Million Bankruptcy Sale\nHow This Chameleon UK Location Became a Little-Known Hollywood Backdrop\nNew York Says Cab, Rideshare Insurance Rates to Rise 25%\nNew York Utility Says Queue for Large Power Users Has Tripled\n\nThe electric-vehicle maker’s shares were up nearly 3% on Thursday. They hit their first record of the year on Tuesday amid gains of more than 20% over the last four weeks. Since tumbling to a low on April 8 during the height of panic over the Trump administration’s tariffs, the stock has soared almost 120%, putting it among the 20 best performers in the S&P 500 Index.\n\nThe rally is a testament to Wall Street’s faith in Musk’s artificial intelligence ambitions, particularly since Tesla’s core auto business is struggling. But it has also made Tesla shares extremely expensive. At 214 times earnings over the next 12 months, the stock has the second highest valuation in the S&P 500, trailing only Warner Bros Discovery Inc. and far ahead of number three, Palantir Technologies Inc., another high-flyer that trades at 178 times forward earnings as of Wednesday’s close.\n\n“The valuation doesn’t make any sense,” said Vikram Rai, portfolio manager and macro trader at First New York, which sold its Tesla position earlier this year after Musk and President Donald Trump had a very public fallout on social media.\nA Tesla representative didn’t reply to a request for comment.\nWith Musk’s SpaceX possibly going public next year, stock traders looking for “Elon exposure” will likely have another way to get it before long. The space exploration company is planning an insider share sale that would value it at $800 billion, making it the most expensive privately held business in the world. Its initial public offering would be the largest ever.\n\n“A SpaceX IPO could lead to some selling pressure on Tesla shares,” said Dmitry Shlyapnikov, an analyst at Horizon Investments who works with portfolio managers. “There are investors that own Tesla for exposure to Elon’s ideas and not for the car company attached to the ticker.”\nOf course, there’s another school of thought that a SpaceX public stock offering would shine a spotlight on Musk, giving Tesla another jolt of momentum.\n“Historically, when one of Musk’s companies achieves a major milestone, it tends to lift sentiment for the others,” said Adam Sarhan, chief executive officer of 50 Park Investments. “A high-profile SpaceX IPO could attract a fresh wave of investors who are drawn to his innovation story — and that enthusiasm often spills over into Tesla.”\n\nStory Continues\nSo far, Tesla’s stock price is getting a boost from the hype surrounding SpaceX, according to Bloomberg Intelligence analyst Steve Man. The missions of the two companies are interlinked, he said, describing a future where Tesla’s Optimus robots help with Musk’s ambition to colonize Mars, and SpaceX’s Starlink satellite system bolsters vehicle connectivity on Earth.\n\nThe companies also share lofty valuations. But Tesla skeptics question whether the company’s fundamentals can support those numbers. Its sales are slowing and profits are falling, while regulations rise and consumers spend less on cars.\n“If you’ve been long Tesla stock, you’ve made money, there’s no denying it,” said Thomas Thornton, founder of Hedge Fund Telemetry, who has a small short position in Tesla. “It’s just bizarre to me because the fundamentals are so bad.”\n‘Double-Down on Elon’ Optimists, on the other hand, point to Tesla’s growth prospects with opportunities in autonomous driving and robotaxis. Musk’s goal is to transform Tesla from an auto manufacturer to an artificial intelligence and robotics company. He wrote in a September X post that 80% of the firm’s profits will eventually come from robots.\n\n“We believe Tesla’s earnings are going to be growing at 30% to 35% over the next two to three years based on the innovation that they have in the automotive segment,” said Brian Mulberry, client portfolio manager at Zacks Investment Management, which owns the company’s shares.\nIf Musk can pull that off, Tesla’s stock market valuation would make more sense. If he can’t, that’s where SpaceX comes in. Publicly traded shares of SpaceX would give investors the opportunity to own a piece of Musk’s vision without Tesla’s baggage.\n“I think most investors will not want to double-down on Elon,” First New York’s Rai said. “That is a lot of risk to carry.”\nNeedham analyst Chris Pierce disagrees.\n“We don’t see investors making an either/or choice, but instead backing both companies,” he said. “Investors that have made money in Tesla are likely to want to back another Musk venture.”\n\nFor now, the reality for investors is Tesla is the only way to bet on Musk’s vision. The immediate risk is the stock’s valuation, which is getting close to dangerous territory. On a technical level, the shares had been close to being considered overbought earlier this week. When they last reached that level in early October, the stock fell 10% over the next seven sessions.\n“In the short term, it’s probably ready for a bit of a cooling off type of period after having that all-time high,” Mulberry said.\nBut to long-term Musk believers, the valuation may indeed be a short-term concern. Over the next few years, however, many see Tesla as a buy regardless of the price — possibly even more than SpaceX.\n“I fully believe that at some point there will be a commercial mission to Mars, but probably not in my lifetime,” said Mulberry, who is 51 years old. “Does that mean I want to invest in that stock today? You’d have to have a really long view of that, whereas you could see the impact of robotaxis and robots probably in the next three to five years.”\n\nSign up for Yahoo Finance's Week in Tech\n\nBy subscribing, you are agreeing to Yahoo's\n\nTerms\n\nand\n\nPrivacy Policy\n\nSubscribe\nTop Tech News\nMicron Technology Inc., the largest US maker of computer memory chips, gave an upbeat forecast for the current quarter, a sign that surging demand and supply shortages are allowing the company to charge more for products.\nThe growing acrimony over the biggest deal in Hollywood is spilling into the open. On Wednesday, Warner Bros. Discovery Inc., the parent of HBO and CNN, advised its shareholders to reject a hostile takeover bid by Paramount Skydance Corp. in favor of its original agreement with streaming giant Netflix Inc.\nOpenAI and Anthropic are looking to expand their office footprints in Dublin, a move that underscores both firms’ growing presence in Europe and the race to boost global uptake of their artificial intelligence services.\nApple Inc. is making changes to its iOS software in Japan to comply with a new local law aimed at fostering competition, part of broader efforts by the iPhone maker to adapt to regulations around the world.\nThe Academy Awards will move to Alphabet Inc.’s YouTube service in 2029, ending more than a half century on the ABC network and more than 70 years on broadcast TV.\nEarnings Due Thursday\nNo major earnings expected\n—With assistance from Matt Turner, David Watkins and Nathaniel Popper.\nMost Read from Bloomberg Businessweek\nThe Cracks in Crumbl’s Cookie Empire Are Showing\nUniqlo Founder and Japan’s Richest Man Loves a $32 Pair of Slacks\nDonald and Melania Trump’s Terrible, Tacky, Seemingly Legal Memecoin Adventure\nPrivate Equity Is Ruining a Beloved Fly-Fishing Brand, Retailers Say\nOracle’s $300 Billion AI Bet Has Fast Become a Bubble Barometer\n©2025 Bloomberg L.P.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:57:46",
      "Source": "Coinspeaker",
      "Title": "Kraken-Backed xStocks Has Gone Live on TON Blockchain",
      "URL": "https://finance.yahoo.com/m/22348a09-5695-3217-95c4-3b482c036797/kraken-backed-xstocks-has.html",
      "Content": "Kraken-Backed xStocks Has Gone Live on TON Blockchain\n\nGodfrey Benjamin\nThu, December 18, 2025 at 6:57 AM PST 2 min read\n\nIn this article: KRAK.PVT\n\nTSLA\n\nNVDA\n\n^GSPC\n\nKraken exchange announced that xStocks, the gold standard for tokenized equities, has launched on TON , the open network linked to Telegram.\nThis means that users of the social media platform will have access to tokenized versions of US stocks and Exchange Traded Funds (ETFs) through the app’s wallet.\n\nNo Broker Account, No Complex Onboarding With xStocks With xStocks now live on the TON network, users have exposure to permissionless, onchain U.S. equity.\nAs a result of this integration, users can buy, hold, and transfer tokenized representations of equities like Tesla, Nvidia, and the S&P 500 ETF without going out of the messaging app.\nResearch and strategy lead at Unstoppable Wallet, Dan Dadybayo, acknowledged this as a big win.\n\n“Embedding tokenized U.S. stocks into Telegram Wallet is a massive UX unlock,” in Dadybayo&#8217;s opinion. This development makes “stocks start to feel like a native internet object, not a brokerage product.”\nHe applauded the initiative by further stating that several users across the U.S. or EU may be getting such access for the first time ever. They need no broker account and no complex onboarding.\nIt is fractional by default, and all that is required for access is one tap. The launch is supported by seamless integration with non-custodial TON Wallet, which is natively embedded in Telegram.\nApart from the expansion of xStocks’ use cases, this integration marks a major advancement for real-world asset adoption on TON.\nxStocks Experiences Quick Adoption in Six Months Crypto exchange Backed officially launched xStocks in mid-2025 , bridging the gap between Traditional Finance (TradFi) and decentralized finance (DeFi).\nThis made over 60 tokenized equities available across major platforms including Bybit, Kraken, and the Solana blockchain.\nOn xStocks, users can trade blue-chip equities like Apple, Tesla, Amazon, NVIDIA, and Microsoft.\nThey are also privy to ETFs and shares of emerging crypto-native firms, all secured and settled at blockchain speed.\nIn August, Kraken, Backed Finance and TRON DAO collaborated to integrate “xStocks” with the TRON blockchain.\nAbout three months ago, xStocks pushed out into the European Union, allowing clients in the region to trade digital versions of popular equities.\nRead original story Kraken-Backed xStocks Has Gone Live on TON Blockchain by Godfrey Benjamin at Coinspeaker.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:37:07",
      "Source": "Investor's Business Daily",
      "Title": "Stock Market Today: Dow Rises On Surprise Inflation Data; Nvidia, Tesla Rally (Live Coverage)",
      "URL": "https://finance.yahoo.com/m/3c54efeb-8d61-3f56-90ba-bb013f26d2f0/stock-market-today%3A-dow-rises.html",
      "Content": "Stock Market Today: Dow Rises On Surprise Inflation Data; Nvidia, Tesla Rally (Live Coverage)\n\nSCOTT LEHTONEN\nThu, December 18, 2025 at 6:37 AM PST 2 min read\n\nIn this article: NVDA\n\nKMX\n\nDRI\n\nBIRK\n\nMU\n\nStock Market Today: The Dow Jones index rose Thursday on a surprise CPI inflation report. Nvidia stock and Tesla rallied.\n\nContinue Reading\n\nCondiciones y Política de privacidad\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:21:00",
      "Source": "GlobeNewswire",
      "Title": "SunCar Technology Reports Third Quarter 2025 Results",
      "URL": "https://finance.yahoo.com/news/suncar-technology-reports-third-quarter-142100758.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nSunCar Technology Reports Third Quarter 2025 Results\n\nSunCar Technology Group Inc.\nThu, December 18, 2025 at 6:21 AM PST 15 min read\n\nIn this article: SDA\n\nTSLA\n\nNEW YORK, Dec. 18, 2025 (GLOBE NEWSWIRE) -- SunCar Technology Group Inc. (the \"Company\" or \"SunCar\") (NASDAQ: SDA), an innovative leader in AI cloud-based B2B auto eInsurance and auto services in China, today reported third quarter 2025 financial results for the quarter ended September 30, 2025.\n\nThird Quarter 2025 Highlights\nRevenue for third quarter 2025 increased 6% to $115.8 million, compared to $109.6 million in third quarter 2024\nNet Income of $1.4 million, a $2.8 million increase compared to a net loss of $1.4 million in the third quarter of 2024\nAdjusted EBITDA for the third quarter 2025 increased 128% to $4.9 million compared to $2.2 million for the third quarter of 2024\nTesla: Successfully launched insurance business at authorized Tesla body repair centers. SunCar is partnering with Tesla to help the automaker penetrate third- and fourth-tier cities, offering better service without the need for delivery centers\nNIO: NIO leveraged the advantages of SunCar’s order processing platform to reduce delivery times by 50% and lower the cost of vehicle deliveries\nXPeng: Collaborated with XPeng's branded stores on insurance renewals, helping to improve renewal rates at these stores\nLi Auto: Launched a successful online pilot program in Shanghai, Chongqing, Xinjiang, Qingdao, Inner Mongolia, and Anhui. Nationwide rollout of the program is planned for 2026\n\nManagement Commentary\n“I’m proud of the team for achieving positive net income this quarter, a key milestone that underscores SunCar is growing profitably. Alongside our leadership in AI-powered auto insurance and services, this performance reflects a strong and scalable profit model. Our deep EV partner relationships—particularly our expanding AI co-development efforts with leaders like Tesla and Xpeng—continue to drive both growth and value creation,” said Zaichang Ye, Chairman and CEO of SunCar.\nInsurance Review\nTesla: Successfully launched insurance business at authorized Tesla body repair centers. SunCar is partnering with Tesla to help the automaker penetrate third- and fourth-tier cities, offering better service without the need for delivery centers in those cities\nNIO: Leveraged the SunCar platform’s innovative order processing technology to reduce delivery times by 50% and lower the cost of vehicle deliveries\nXPeng: Collaborated with XPeng's branded stores on insurance renewals, dramatically improving the renewal rates at these stores\nLi Auto: Launched successful online insurance pilot programs in Shanghai, Chongqing, Xinjiang, Qingdao, Inner Mongolia, and Anhui with nationwide rollout planned for 2026\nLeapmotor: SunCar’s system usage increased as Leapmotor expanded its rollout of SunCar’s solution from directly operated stores to dealer partner stores.\nXiaomi: Collaborated with Xiaomi to create a new insurance/renewal customer service process, jointly setting an industry benchmark for EV customer service\nHuawei : HIMA has completed internal testing and successfully completed testing of SunCar’s platform on the HarmonyOS app. The next phase will be full-scale commercial deployment.\nStrengthened Property & Casualty (“P&C”) Relationships: Continued to strengthen P&C partnerships, signing strategic cooperation agreements with Huatai P&C Insurance and Bohai P&C Insurance\nInsurance Agency Acquisitions: Completed the acquisition of Jiayi Auto Insurance and initiated the acquisition of Dalian Jinhainiu Insurance, expanding the Company's regional coverage and business development efforts.\n\nStory Continues\nAuto Services Review\nStrawberry Music Festival: SunCar was contracted to provide VIP transport services for artists at the Strawberry Music Festival, the largest music festival in China. This contract marks the beginning of a strategic partnership with Strawberry. It highlights SunCar’s nationwide service capabilities and expertise working with event management customers. The customer will hold 25 events across China in 2026. The contract is estimated to be worth approximately $3 million per year for the next 3 years.\nChina Resources Group: SunCar managed concierge chauffeur services for the first nationwide event launched by China Resources Group. The Company received praise from both partners and clients, successfully supporting the first roll-out of the customer's high-end concierge services.\nCAR Inc(“CAR”): SunCar signed a strategic partnership with CAR to jointly develop the SMB market\nZheshang Bank: SunCar was selected to provide global business travel privileges for VIP clients of the Bank, with the project officially launching in December.\n\nIntegrated Services\nSunCar is gradually realizing synergies between its Auto Insurance and Auto Services segments. Below are examples of two projects awarded because the Company offers integrated Auto Insurance and Auto Services:\nChina Life P&C: Auto Services won its first bid for the non-accident roadside assistance service project at China Life’s headquarters, with the opportunity to sign additional cooperation agreements with provincial branches of China Life P&C for in-policy roadside assistance services.\nPICC and Ping An: The Company initiated the technical integration process for chauffeur services with the headquarters of PICC and Ping An. PICC's chauffeur service went live in July 2025 and Ping An P&C's service will go live by the end of 2025. These agreements may expand into future cooperation with the provincial branches of PICC and Ping An.\n\nAI Product Development\nSunCar continues to integrate ByteDance’s Doubao LLM into its database of 60 million vehicles, creating new AI-powered applications for its partners. These applications include dynamic policy pricing, claims risk assessment, predictive maintenance, service provider ratings, image and video analytics, and driver data analytics.\nThird Quarter 2025 Financial Results\nNet Income of $1.4 million for the three months ended September 30, 2025, a $2.8 million increase compared to a net loss of $1.4 million for the same period in 2024.\nRevenue increased by 6% to $115.8 million for the three months ended September 30, 2025, compared to $109.6 million for the same period in 2024. Revenue for the first nine months of September 2025 increased 8% to $338.1 million, compared to $312.7 million for the first nine months of 2024\nAuto Insurance revenue increased by 13% to $51.4 million for the three months ended September 30, 2025, compared to $45.4 million in the prior-year period, driven by a higher volume of insurance policies sold through SunCar’s platform\nTechnology Services revenue increased by 0.4% to $12.2 million for the three months ended September 30, 2025, compared to $12.2 million in the third quarter of 2024.\nAuto Services revenue increased slightly to $52.2 million for the three months ended September 30, 2025, compared to $52.1 million for the same period last year.\nOperating costs and expenses increased to $112.9 million in the third quarter of 2025, from $109.4 million in the third quarter of 2024.\nIntegrated service costs rose to $52.8 million for the third quarter of 2025, from $51.2 million in the prior-year quarter.\nPromotional service expenses increased to $51.0 million for the third quarter of 2025, from $42.7 million in the third quarter of 2024, reflecting continued investments to drive market expansion.\nSelling expenses decreased to $4.9 million for the three months ended September 30, 2025, compared to $10.5 million in the prior-year period, primarily due to a decrease in marketing and distribution expenses.\nGeneral and administrative expenses decreased to $2.5 million, from $3.5 million in the third quarter of 2024.\nResearch and development expenses grew to $1.7 million, up from $1.4 million in the third quarter of 2024, reflecting continued investment in product development and technology enhancement.\nOperating profit increased to $2.9 million in the third quarter of 2025, compared to $0.2 million in the prior-year period.\nAdjusted EBITDA, a non-GAAP metric that excludes certain non-recurring and non-cash items, is helpful in evaluating our operational performance alongside GAAP metrics. Adjusted EBITDA for the third quarter of 2025 increased 128% to $4.9 million, compared to $2.2 million in the third quarter of 2024.\n\nNet Income (Loss) and Adjusted EBITDA\nThe Company believes that Adjusted EBITDA, as defined below, is useful in evaluating our operational performance distinct and apart from certain expenses that may not be indicative of our recurring core business operating results and non-operational expenses. Adjusted EBITDA is defined as Net loss adjusted for depreciation and amortization, financial expenses, net, investment income, other non-recurring income, net, income tax benefit, share-based compensation, and non-recurring expenses related to capital raises.\nNet Loss Margin is defined as net loss divided by total revenues, and Adjusted EBITDA Margin is defined as Adjusted EBITDA divided by total revenues.\nThe following tables reconcile Net loss to Adjusted EBITDA for the nine months ended September 30, 2024 and 2025.\n\nFor the nine months ended September 30,\n\n2024\n\n2025\n\n(In thousands)\nNet loss\n\n$\n(61,573\n)\n\n$\n(4,126\n)\nDepreciation and amortization\n\n3,320\n\n4,622\n\nFinancial expenses, net\n\n3,463\n\n3,143\n\nInvestment income\n\n(418\n)\n\n(358\n)\nOther non-recurring (income)/loss, net\n\n(769\n)\n\n2,208\n\nIncome tax expense\n\n931\n\n840\n\nShare-based compensation (1)\n\n63,161\n\n1,117\n\nTransaction fees (2)\n\n79\n\n15\n\nAdjusted EBITDA\n\n$\n8,194\n\n$\n7,461\n\nNet loss Margin\n\n-19.7%\n\n-1.2%\n\nAdjusted EBITDA Margin\n\n2.6 %\n\n2.2 %\n\nAbout SunCar Technology Group Inc.\nFounded in 2007, SunCar is transforming the customer journey for auto services and auto insurance in China, the largest passenger vehicle market in the world. SunCar develops and operates AI cloud-based platforms that seamlessly connect drivers with a wide range of auto services and insurance coverage options through a nationwide network of sales partners. As a result, SunCar has established itself as the leader in China in the auto eInsurance market for electric vehicles and the B2B auto services market. The Company's intelligent cloud platform empowers its enterprise customers to access, manage, and optimize their auto eInsurance and auto service offerings. Through SunCar, drivers gain access to a wide variety of high-quality services from tens of thousands of independent providers, all from a single application. For more information, please visit: https://suncartech.com .\n\nForward-Looking Statements\nThis press release contains information about the Company's view of its future expectations, plans, and prospects that constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Actual results may differ materially from historical results or those indicated by these forward-looking statements as a result of a variety of factors including, but not limited to, risks and uncertainties associated with its ability to raise additional funding, its ability to maintain and grow its business, variability of operating results, its ability to maintain and enhance its brand, its development and introduction of new products and services, the successful integration of acquired companies, technologies and assets into its portfolio of products and services, marketing and other business development initiatives, competition in the industry, general government regulation, economic conditions, dependence on key personnel, the ability to attract, hire and retain personnel who possess the technical skills and experience necessary to meet the requirements of its clients, and its ability to protect its intellectual property. -For a detailed discussion of these risks, please refer to the Company's Annual Report on Form 20-F and other filings with the Securities and Exchange Commission. Forward-looking statements speak only as of the date of this press release, and the Company undertakes no obligation to update or revise these statements, except as required by law.\nContact Information:\nSunCar:\nInvestor Relations: Mr. Breaux Walker\nEmail: IR@suncartech.com\nLegal: Ms. Li Chen\nEmail: chenli@suncartech.com\nU.S. Investor Relations\nTom Cook\nManaging Director\nICR\nEmail: Tom.Cook@icrinc.com\nSOURCE SunCar Tech\n\nSUNCAR TECHNOLOGY GROUP INC\n\nCONDENSED CONSOLIDATED BALANCE SHEETS (UNAUDITED)\n\n(In U.S. Dollar thousands, except for share and per share data, or otherwise noted)\n\nAs of December 31,\n\nAs of September 30,\n\n2024\n\n2025\n\nASSETS\n\nCurrent assets\n\nCash\n\n$\n26,865\n\n$\n23,704\n\nRestricted cash\n\n2,647\n\n2,789\n\nShort-term investments\n\n20,985\n\n21,643\n\nAccounts receivable, net\n\n75,605\n\n75,338\n\nPrepaid expenses and other current assets, net\n\n70,171\n\n96,572\n\nTotal current assets\n\n196,273\n\n220,046\n\nNon-current assets\n\nLong-term investment\n\n274\n\n281\n\nProperty, software and equipment, net\n\n27,664\n\n24,768\n\nDeferred tax assets, net\n\n10,453\n\n11,355\n\nOther non-current assets\n\n11,458\n\n17,289\n\nRight-of-use assets\n\n606\n\n237\n\nTotal non-current assets\n\n50,455\n\n53,930\n\nTOTAL ASSETS\n\n$\n246,728\n\n$\n273,976\n\nLIABILITIES AND SHAREHOLDERS’ EQUITY\n\nCurrent liabilities\n\nShort-term loan\n\n$\n83,597\n\n$\n87,540\n\nAccounts payable\n\n56,812\n\n65,977\n\nDeferred revenue\n\n2,421\n\n2,285\n\nTax payable\n\n1,361\n\n2,195\n\nAccrued expenses and other current liabilities\n\n5,792\n\n7,609\n\nAmount due to related parties, current\n\n6,238\n\n6,671\n\nOperating lease liability, current\n\n544\n\n137\n\nTotal current liabilities\n\n156,765\n\n172,414\n\nNon-current liabilities\n\nOperating lease liability, non-current\n\n21\n\n32\n\nAmount due to a related party, non-current\n\n22,761\n\n11,813\n\nWarrant liabilities\n\n947\n\n947\n\nTotal non-current liabilities\n\n23,729\n\n12,792\n\nTotal liabilities\n\n$\n180,494\n\n$\n185,206\n\nCommitments and contingencies (Note 17)\n\nShareholders' equity\n\nClass A Ordinary shares (par value of US$0.0001 per share; 400,000,000 Class A Ordinary shares authorized as of December 31, 2024 and September 30, 2025, respectively; 51,845,493 and 51,645,493 Class A Ordinary shares issued and outstanding as of December 31, 2024, respectively; 59,208,351 and 55,569,794 Class A Ordinary shares issued and outstanding as of September 30, 2025, respectively)\n\n$\n5\n\n$\n6\n\nClass B Ordinary shares (par value of US$0.0001 per share; 100,000,000 Class B December 31, 2024 and September 30, 2025, respectively; 46,659,565 and 46,439,565 Class B Ordinary shares issued and outstanding as of December 31, 2024 and September 30, 2025, respectively)\n\n5\n\n5\n\nAdditional paid in capital\n\n208,701\n\n233,369\n\nAccumulated deficit\n\n(195,387\n)\n\n(202,872\n)\nAccumulated other comprehensive loss\n\n(1,432\n)\n\n(1,376\n)\nTotal SUNCAR TECHNOLOGY GROUP INC’s shareholders' equity\n\n11,892\n\n29,132\n\nNon-controlling interests\n\n54,342\n\n59,638\n\nTotal shareholders’ equity\n\n66,234\n\n88,770\n\nTOTAL LIABILITIES AND SHARESHOLDERS’ EQUITY\n$\n246,728\n\n$\n273,976\n\nSUNCAR TECHNOLOGY GROUP INC\n\nUNAUDITED CONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE LOSS\n\n(In U.S. Dollar thousands, except for share and per share data, or otherwise noted)\n\nFor the nine months ended September 30,\n\n2024\n\n2025\n\nRevenues\n\nAuto eInsurance service\n\n$\n119,108\n\n$\n149,243\n\nTechnology service\n\n34,046\n\n36,549\n\nAuto service\n\n159,555\n\n152,292\n\nTotal revenues\n\n312,709\n\n338,084\n\nOperating cost and expenses\n\nIntegrated service cost\n\n(158,843\n)\n\n(154,286\n)\n\nPromotional service expenses\n\n(113,845\n)\n\n(145,109\n)\n\nSelling expenses\n\n(20,683\n)\n\n(15,867\n)\n\nGeneral and administrative expenses\n\n(44,079\n)\n\n(17,678\n)\n\nResearch and development expenses\n\n(33,625\n)\n\n(3,437\n)\n\nTotal operating costs and expenses\n\n(371,075\n)\n\n(336,377\n)\n\nOperating (loss)/income\n\n(58,366\n)\n\n1,707\n\nOther expenses\n\nFinancial expenses, net\n\n(3,463\n)\n\n(3,143\n)\n\nInvestment income\n\n418\n\n358\n\nOther income/(expense), net\n\n769\n\n(2,208\n)\n\nTotal other expenses, net\n\n(2,276\n)\n\n(4,993\n)\n\nLoss before income tax expense\n\n(60,642\n)\n\n(3,286\n)\n\nIncome tax expense\n\n(931\n)\n\n(840\n)\n\nNet loss\n\n(61,573\n)\n\n(4,126\n)\n\nLess: Net income attributable to non-controlling interests\n\n3,174\n\n3,359\n\nNet loss attributable to the Company’s ordinary shareholders\n\n(64,747\n)\n\n(7,485\n)\n\nNet loss per ordinary share\n\nBasic and diluted\n\n$\n(0.68\n)\n\n$\n(0.07\n)\n\nWeighted average shares outstanding used in calculating basic and diluted loss per share\n\nBasic and diluted\n\n95,221,846\n\n102,106,309\n\nOther comprehensive loss\n\nForeign currency translation difference\n\n813\n\n1,577\n\nTotal other comprehensive loss (income)\n\n813\n\n1,577\n\nTotal comprehensive loss\n\n(60,760\n)\n\n(2,549\n)\n\nLess: total comprehensive income attributable to non-controlling interest\n\n3,900\n\n4,880\n\nTotal comprehensive loss attributable to the SUNCAR TECHNOLOGY GROUP INC’s shareholders\n\n$\n(64,660\n)\n\n$\n(7,429\n)\n\nSUNCAR TECHNOLOGY GROUP INC\n\nUNAUDITED CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS\n\n(In U.S. Dollar thousands, except for share and per share data, or otherwise noted)\n\nCASH FLOWS FROM INVESTING ACTIVITIES\n\nPurchase of property, software and equipment\n\n(564\n)\n\n(256\n)\n\nProceeds from disposal of property, software and equipment\n\n43\n\n1\n\nPurchase of short-term investment\n\n(21,265\n)\n\n(358\n)\n\nProceeds from the redemption of short-term investment\n\n21,335\n\n234\n\nRepurchase of non-controlling interests\n\n-\n\n(2,214\n)\n\nPurchase of other non-current assets\n\n(9,341\n)\n\n(6,420\n)\n\nTotal net cash used in investing activities\n\n(9,792\n)\n\n(9,013\n)\n\nCASH FLOWS FROM FINANCING ACTIVITIES\n\nProceeds from short-term loan\n\n79,943\n\n86,633\n\nRepayments of short-term loan\n\n(80,569\n)\n\n(84,833\n)\n\nRepayments of payables to a related party\n\n(1,699\n)\n\n(11,398\n)\n\nShares repurchase\n\n-\n\n(15,760\n)\n\nProceeds from issuance of ordinary shares, net of issuance cost\n\n-\n\n41,631\n\nTotal net cash provided by financing activities\n\n(2,325\n)\n\n16,273\n\nEffect of exchange rate changes\n\n329\n\n793\n\nNet change in cash and restricted cash\n\n(10,606\n)\n\n(3,019\n)\n\nCash and restricted cash, beginning of the year\n\n$\n33,595\n\n$\n29,512\n\nCash and restricted cash, end of the year\n\n$\n22,989\n\n$\n26,493\n\nReconciliation of cash and restricted cash to the unaudited condensed consolidated balance sheets:\n\nCash\n\n$\n20,239\n\n$\n23,704\n\nRestricted cash\n\n$\n2,750\n\n$\n2,789\n\nTotal cash and restricted cash\n\n$\n22,989\n\n$\n26,493\n\nSupplemental disclosures of cash flow information:\n\nIncome tax paid\n\n$\n778\n\n$\n679\n\nInterest expense paid\n\n$\n2,816\n\n$\n2,636\n\nSupplemental disclosures of non-cash flow information:\n\nObtaining right-of-use assets in exchange for operating lease liabilities\n\n$\n93\n\n$\n156\n\nPrepaid financing expense related to issuance of GEM Warrants\n\n$\n987\n\n$\n382\n\nDecrease of accrued expenses and other current liabilities due to vest of restricted shares\n\n$\n311\n\n$\n311\n\nRepayments of payables to a related party\n\n$\n4,503\n\n$\n-\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:14:12",
      "Source": "Cryptonews",
      "Title": "Kraken-Backed xStocks Launch on TON, Bringing Tokenized US Stocks to Telegram",
      "URL": "https://finance.yahoo.com/m/5a9190e8-6054-32c7-af8b-eb699c006583/kraken-backed-xstocks-launch.html",
      "Content": "Kraken-Backed xStocks Launch on TON, Bringing Tokenized US Stocks to Telegram The tokens offer onchain price exposure without share ownership and are restricted by jurisdiction.\n\nAmin Ayan\nThu, December 18, 2025 at 6:14 AM PST 3 min read\n\nIn this article: KRAK.PVT\n\n^GSPC\n\nTSLA\n\nNVDA\n\nKraken-backed xStocks have gone live on the TON blockchain, allowing users to access tokenized versions of US stocks and exchange-traded funds directly inside Telegram through its built-in TON Wallet.\nKey Takeaways:\nxStocks bring tokenized US stocks and ETFs directly into Telegram via TON Wallet.\nThe tokens offer onchain price exposure without share ownership and are restricted by jurisdiction.\nThe launch tests whether mass distribution can drive adoption of tokenized equities.\n\nThe move brings tokenized equities into one of the world’s largest messaging platforms, potentially expanding their reach beyond traditional crypto trading venues, according to a Thursday announcement.\nThrough the integration, users can buy, hold and transfer onchain representations of assets such as Tesla, Nvidia and the S&#038;P 500 ETF without leaving the Telegram app.\nxStocks Offer Onchain Price Exposure Without Direct Share Ownership xStocks are designed as fully collateralized products, backed one-to-one by underlying equities and ETFs held through regulated partners.\nThe tokens track the price of the underlying assets but do not confer direct ownership of the shares, offering users price exposure in an onchain format.\nThe service is not available to US users and is restricted to jurisdictions where the tokens can be legally offered.\n\nxStocks has not registered under the US Securities Act of 1933, meaning distribution relies on jurisdictional controls.\nTokenized equities are not new, but previous attempts struggled to gain traction. Liquidity constraints, regulatory uncertainty and limited distribution often confined earlier offerings to niche crypto platforms.\nBy embedding tokenized stocks inside a mainstream messaging app, Kraken and its partners appear to be testing whether access and ease of use can unlock broader adoption.\nThe TON Foundation framed the launch as a step toward bringing real-world assets into everyday digital activity.\nTON Foundation president and CEO Max Crown said the integration allows users to hold and trade tokenized U.S. equities “with the same ease as sending a message,” while maintaining self-custody through TON Wallet.\n\nFor Telegram’s wallet ecosystem, the move builds on earlier experiments. Wallet in Telegram previously launched custodial access to stocks and ETFs through its Crypto Wallet product, which saw early demand despite limited geographic availability.\nTelegram claims more than 900 million global users, while TON Wallet reports close to 100 million users, giving xStocks immediate exposure to a large consumer base.\n\nStory Continues\nRWA Tokenization Gains Momentum Earlier this month, Libeara, the blockchain infrastructure platform backed by Standard Chartered’s venture arm SC Ventures, rolled out a new tokenized gold investment fund in Singapore, bringing one of the world’s oldest safe-haven assets onto digital rails.\nThe fund, launched in partnership with FundBridge Capital, allows professional investors to gain exposure to gold through blockchain-based tokens issued on Libeara’s ledger.\n\nIn a recent research, Web3 digital property firm Animoca Brands said that tokenization of RWAs could unlock a $400 trillion traditional finance market.\nAnimoca researchers Andrew Ho and Ming Ruan said the global market for private credit, treasury debt, commodities, stocks, alternative funds, and bonds represents a vast runway for growth.\n“The estimated $400 trillion addressable TradFi market underscores the potential growth runway for RWA tokenization,” they wrote.\nMeanwhile, according to the 2025 Skynet RWA Security Report, the market for tokenized RWAs could grow to $16 trillion by 2030 .\nRead original story Kraken-Backed xStocks Launch on TON, Bringing Tokenized US Stocks to Telegram by Amin Ayan at Cryptonews.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "22:11:39",
      "Source": "Barchart",
      "Title": "Is Cathie Wood Jumping Ship on Tesla Stock?",
      "URL": "https://finance.yahoo.com/m/d3053324-3c24-37ad-95e2-aa5dfec43649/is-cathie-wood-jumping-ship.html",
      "Content": "Is Cathie Wood Jumping Ship on Tesla Stock?\n\nEbube Jones\nThu, December 18, 2025 at 6:11 AM PST 4 min read\n\nIn this article: TSLA\n\nCathie Wood, founder and CEO of Ark Invest, does not usually back away from her highest‑conviction ideas, which is exactly why her steady selling of Tesla (TSLA) shares has everyone’s attention. Ark Invest has been trimming Tesla even as the stock trades near $475 and has a record free cash flow of nearly $4 billion.\n\nEarlier in the year, the tone was very different as Ark leaned into weakness rather than backing away from the story. When Tesla sold off after its Q2 2025 earnings report, Ark stepped in and bought the post-earnings dip, scooping up 143,190 TSLA shares across three flagship exchange-traded funds (ETFs).\nMore News from Barchart Cathie Wood Keeps Buying the Dip in CoreWeave Stock. Should You?\nBroadcom Stock Is Up 120% in the Past Year. This Analyst Thinks It Is One of the Highest-Quality Stocks to Buy for the Next Year Too.\nJPMorgan Says the Dip in Broadcom Stock Is a Screaming Buy. Are You Loading Up on Shares Now?\nOur exclusive Barchart Brief newsletter is your FREE midday guide to what's moving stocks, sectors, and investor sentiment - delivered right when you need the info most. Subscribe today!\n\nThat makes today’s selling harder to ignore for anyone trying to read the next chapter in the TSLA story. So the real question for investors is simple. If one of Tesla’s most famous long-term bulls is taking chips off the table at these prices, should you be following her out the door, leaning into the story, or doing something in between? Let’s dive in.\nTesla’s Rally Runs Into Margins Tesla is an American electric vehicle (EV) and clean energy manufacturer headquartered in Austin, Texas, focused on EVs, batteries, and software-driven mobility solutions.\nTesla currently trades around $467, with a year-to-date gain of 15.7%.\n​It now carries a market capitalization of roughly $1.5 trillion, supported by a trailing price-to-earnings (P/E) ratio of 337.85x versus a sector median of 16.58x and a forward P/E of 415.72x against 17.76x. This valuation backdrop helps explain why even long-time bulls may feel compelled to trim holdings.​\n\nTesla’s latest earnings report for the third quarter underscores that tension between lofty expectations and mixed fundamentals. TSLA delivered earnings per share (EPS) of $0.37, missing the $0.41 consensus by $0.04 and posting a negative surprise of 9.76%. This result came despite revenue of $28.10 billion, which exceeded estimates of $26.37 billion and showed that demand remains robust at the top line.​\nTSLA’s profitability metrics paint a more cautious picture. Tesla’s operating expenses jumped 50% year-over-year to $3.43 billion as spending ramped on robotaxis and Optimus, driving operating margins down to 5.8% from 10.8%. This left gross profit up just 1% on 12% revenue growth, showing how much investment is pressuring near-term earnings power. Tesla still generated $4.8 billion in free cash flow, a record that dwarfs the prior quarter’s $146 million.\n\nStory Continues\nWhy Tesla’s Story Still Sells Tesla recently locked in a supply agreement with Samsung SDI, valued at roughly $2.1 billion over three years. The agreement will help Tesla secure battery cells for its energy storage systems, including Megapack and Powerwall products. This deal directly addresses the company's production constraints in energy storage, a segment that contributed 12% of total revenue in Q3.\n\nBeyond batteries, robotaxis remain the headline-grabbing catalyst. Elon Musk announced plans to remove safety drivers from Austin robotaxis within three weeks. He also teased a next-generation Full Self-Driving model that is “an order of magnitude bigger,” with a possible launch window in January or February 2026.\nTesla is even hiring robotaxi operators in New York City, which hints at ambitions to push into one of the toughest urban driving environments. The catch is that regulatory approval remains uncertain, full autonomy at scale is still years away, and competitors like Waymo already have more than 100 million miles logged without safety drivers.\nMeanwhile, another narrative is the idea of Tesla growing into an $8.5 trillion company, tied to a proposed $1 trillion CEO pay package. This is exactly the setup that can prompt Ark Invest to sell shares into strength, because the stock becomes increasingly driven by milestones and sentiment.\n\nWall Street’s TSLA Reality Check The next earnings release is slated for February, which could either validate the narrative or fuel more trimming. For the current quarter, the average EPS estimate is $0.35 versus $0.66 in the prior year.\nLooking one quarter out, the average EPS estimate is $0.34, compared with $0.15 last year. In other words, expectations call for a rebound, but from a depressed base.​\nConsensus positioning stays cautious, with the consensus rating on Tesla currently a “Hold.” The average 12‑month price target comes in at $385.41, which implies roughly 19% downside from its current price.\nIn Conclusion Cathie Wood is not bailing on Tesla so much as dialing back risk after a massive rerating, and that nuance matters for anyone watching her trades. Given stretched valuations, choppy near-term earnings, and neutral analyst targets, TSLA looks more likely to cool off or move sideways than rip higher from here in a straight line. Over a multi-year window, the odds still favor higher prices if robotaxis and energy storage deliver, but sizing and patience will matter.\nOn the date of publication, Ebube Jones did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:23:13",
      "Source": "Insider Monkey",
      "Title": "Cantor Fitzgerald Bullish On Tesla, Inc. (TSLA)",
      "URL": "https://finance.yahoo.com/news/cantor-fitzgerald-bullish-tesla-inc-132313619.html",
      "Content": "Cantor Fitzgerald Bullish On Tesla, Inc. (TSLA)\n\nFatima Gulzar\nThu, December 18, 2025 at 5:23 AM PST 2 min read\n\nIn this article: TSLA\n\nOUST\n\nSERV\n\nTesla, Inc. (NASDAQ: TSLA ) is among the 8 High Growth EV Stocks to Buy Now.\nAccording to a research note by Cantor Fitzgerald analyst Andres Sheppard, President Trump’s support of a U.S. manufacturing program for inexpensive “tiny cars” might help businesses like Tesla, Inc. (NASDAQ:TSLA), Ouster Inc., and Serve Robotics, as reported by The Fly on December 8, 2025.\nAccording to Sheppard, the program includes vehicles with internal combustion engines and electric models that cost between $8,000 and $13,000. Production will adhere to Department of Transportation safety regulations and testing. The analyst added that the Trump administration is thinking of issuing an executive order to support the domestic robotics industry. This might accelerate the use of humanoids and autonomous delivery robots in the United States, the analyst added.\n\nSeparately, Reuters reported on December 11, 2025, that Tesla, Inc. (NASDAQ:TSLA)’s U.S. sales plummeted to a near three-year low in November, even with the automaker’s introduction of new, lower-cost models of its Model Y SUV and Model 3 compact sedan. Total U.S. sales fell by about 23% to 39,800 vehicles in November from 51,513 vehicles a year earlier, the lowest since January 2022, according to data from Cox Automotive.\nStephanie Valdez Streaty, director of industry insights at Cox Automotive, stated that demand for the less expensive “Standard” versions seemed to reduce sales of premium models rather than increase overall sales.\nTesla, Inc. (NASDAQ:TSLA) is a vertically integrated battery-electric vehicle manufacturer and developer of real-world artificial intelligence software, such as self-driving cars and humanoid robots.\nWhile we acknowledge the potential of TSLA as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 10 High-Growth EV Stocks to Invest In and 13 Best Car Stocks to Buy in 2025 .\nDisclosure. None\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:05:00",
      "Source": "Motley Fool",
      "Title": "Where Will Tesla Be in 1 Year?",
      "URL": "https://finance.yahoo.com/m/5eb95767-ceae-313f-bb92-bd1d2bc8ef1c/where-will-tesla-be-in-1-year%3F.html",
      "Content": "Where Will Tesla Be in 1 Year?\n\nLee Samaha, The Motley Fool\nThu, December 18, 2025 at 5:05 AM PST 5 min read\n\nIn this article: TSLA\n\nKey Points Tesla's production ramp, including Cybercabs, must be supported by regulatory approvals.\nThe company is likely to have a stronger second half in 2026 than its first.\nThis could be the year that Tesla finally delivers on its unsupervised full self-driving and robotaxi aims.\nThese 10 stocks could mint the next wave of millionaires ›\n\nTesla 's (NASDAQ: TSLA) management described 2025 as the \"year of the Y,\" but what will define 2026?\nOne way to describe it could be a year when the chips went all in. The roadmap was set during the third-quarter earnings call, and Tesla is betting big on full self-driving (FSD) and robotaxis. That said, it's likely to be a second-half-weighted year for the company, so investors need to be patient through the year. Here's why.\nA tale of two halves Tesla will release its fourth-quarter earnings in early 2026, and they are likely to show a sequential decline in electric vehicle ( EV ) deliveries, which could extend into the second quarter. The reason comes down to the pull-forward in deliveries in the U.S. third quarter, driven by the expiration of the federal EV tax credit at the end of September. That will undoubtedly lead to slowing sales in the fourth quarter.\nAs such, don't be surprised if Tesla's overall sales decline sequentially in the fourth quarter of 2025 and the first quarter of 2026. Indeed, the Wall Street analyst consensus is just such an event, before returning to sequential and year-on-year growth from the second quarter onwards.\nFurthermore, CFO Vaibhav Taneja has already informed investors that Tesla plans to increase capital spending \"increase substantially\" in 2026, from approximately $9 billion in 2025. The expenditures to support ramping up EV production (more on that shortly) and to invest in Tesla's AI initiatives, including the Optimus robot. For reference, CEO Elon Musk aims to have the third generation of the Optimus robot in the first quarter of 2026.\n\nTesla's big ramp-up in 2026 Musk couldn't have been any clearer on the earnings call in October, due to \"clarity on achieving full self-driving, unsupervised full self-driving, I should say, I feel confident in expanding Tesla's production. So that is our intent to expand as quickly as we can our future production.\"\nMusk went on to reiterate the determination to ramp production and said that the dedicated robotaxi, Cybercab, would be the \"single biggest expansion in production\" and start in the second quarter of 2026.\nTesla's big bet The production and capital spending ramp up, not to mention the focus on Cybercabs, speaks to Musk's confidence in the ongoing development of Tesla's robotaxi rollout and its unsupervised FSD. Musk recently affirmed via a post on X that robotaxi testing (without any occupant in the car) is underway in Austin, Texas. That would be somewhat in accordance with Musk's aim of having \"no safety drivers in at least large parts of Austin by the end of this year.\"\n\nStory Continues\nFurthermore, Tesla is hoping that the Netherlands vehicle authority (RDW) will approve its FSD in February 2026, an act that could open up a pathway to EUwide approval or, failing that, country-level approvals in Europe.\nThat would be a significant plus for opening new markets for Tesla's FSD software sales and laying the groundwork for the potential deployment of Tesla's robotaxis in Europe. It could also boost Tesla's EV sales, as FSD is a key differentiator for the company's EVs.\nWhere will Tesla be at the end of 2026? If all goes to plan, Tesla will continue to expand its robotaxi coverage, having achieved approval for unsupervised robotaxis (a feature a Cybercab requires, as Musk's initial conception is for them not to have steering wheels and pedals), and growth in EV sales from the second quarter onward.\nAs such, it could end the year with the robotaxi rollout in strong growth mode, backed by Cybercab deployment and FSD growth in Europe. In addition, Tesla's EV sales could receive a boost, with more releases of stripped-down versions of its Y and 3 models.\n\nAlternatively, the production ramp and capital spending ramp up may prove misplaced if Tesla doesn't achieve unsupervised robotaxi and FSD approvals (Europe) in a timely fashion. Risk is rising, but so is the potential reward.\nWhichever way, next year is the year of the all-in bet on FSD. Hopefully, Tesla and the regulatory bodies will deliver.\nDon’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $460,957 !*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $52,242 !*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $509,955 !*\nRight now, we’re issuing “Double Down” alerts for three incredible companies , available when you join Stock Advisor , and there may not be another chance like this anytime soon.\nSee the 3 stocks »\n*Stock Advisor returns as of December 15, 2025\nLee Samaha has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Tesla. The Motley Fool has a disclosure policy .\nWhere Will Tesla Be in 1 Year? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:02:29",
      "Source": "Yahoo Finance",
      "Title": "Rivian CEO on self-driving, designing AI chips, and why Tesla needs more competition",
      "URL": "https://finance.yahoo.com/news/rivian-ceo-on-self-driving-designing-ai-chips-and-why-tesla-needs-more-competition-130229526.html",
      "Content": "Rivian CEO on self-driving, designing AI chips, and why Tesla needs more competition\n\nPras Subramanian · Senior Reporter\nThu, December 18, 2025 at 5:02 AM PST 7 min read\n\nIn this article: RIVN\n\nTSLA\n\nVLKAF\n\nNVDA\n\nTSM\n\nAt Rivian's ( RIVN ) Autonomy and AI Day on Dec. 11, the pure-play EV maker outlined a whole range of tech and software products, with a focus on vertical integration — meaning doing everything from end to end in-house.\nCEO RJ Scaringe launched the company's new Autonomy platform at the event — and during a trying time for the EV sector, in which so far only Tesla has achieved profitability. While Rivian has achieved gross profits in recent quarters, actual bottom-line (or net) profits have been elusive.\n\nScaringe, who founded the company in 2011, saw Rivian go public in 2021 and reach stratospheric heights of $120 a share before the stock came back down to earth, now at $18. A crucial cash infusion from Volkswagen ( VWAGY ) of nearly $6 billion via a joint venture between the two companies has given Rivian much-needed breathing room.\nThe following is a condensed version of Yahoo Finance's conversation with Scaringe, touching on the company's path toward full self-driving (FSD), or personal L4, as Rivian calls it, building in-house chips, and where the overall EV industry is headed.\nYahoo Finance: Thanks for having us here, RJ. Rivian's Autonomy platform — talk to me about the progression from where Rivian is right now to what's going to come out in the near term and its vision for the future.\nRJ Scaringe: Autonomy has been a journey for us. We followed the launch of our Gen 1 vehicles at the end of 2021. In early 2022, we realized we wanted to do a clean-sheet approach to our Autonomy platform. So we started the process on that, and that involved developing a camera platform, redesigning the compute platform, and architecting the whole system around an AI-centric approach.\n\nThat was what went into our [current] Gen 2 vehicles that we ultimately launched in the middle of 2024, and the compute relative to our Gen 1 [vehicles] increased by about 10x — that's the inference on the vehicle. When we launched that, there was 55 megapixels of cameras, an array of radars, and that began the process of building the data stream to really train this model.\nOn our Gen 3 platform, it's [built using] an in-house chip ... This is a platform that can process 5 billion pixels per second, so that's roughly 5x the best in class today. This is very, very high processing capability. And that not only raises the performance level of this platform, but it also allows us to build the model more efficiently and more quickly.\nCurrently, Rivian offers Universal Hands-Free, which is akin to GM's Supercruise, and that will be expanded to more roads. What comes next?\nIn 2026, we'll add \"point to point.\" So you can get in the car from your driveway, type the address, and it does everything, hands-free, eyes-on, etc. ... But it's still supervised.\n\nStory Continues\nThen the platform expands to the next big step, which is eyes-off — and eyes-off is really powerful. That's when you can start to be in the car, be on your phone, be reading a book. Essentially, your role in driving the car diminishes to nothing. You're just a passenger.\nAnd then the next step beyond that is what we call personal Level 4, which is the idea that the vehicle can completely operate on its own, even without anybody in the car. And so things like picking the kids up from school, an airport drop-off, or grabbing groceries.",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:39:25",
      "Source": "GuruFocus.com",
      "Title": "Waymo in Talks to Raise More Than $15 Billion at Nearly $100 Billion Valuation",
      "URL": "https://finance.yahoo.com/news/waymo-talks-raise-more-15-123925476.html",
      "Content": "Waymo in Talks to Raise More Than $15 Billion at Nearly $100 Billion Valuation\n\nMoz Farooque ACCA\nThu, December 18, 2025 at 4:39 AM PST 1 min read\n\nIn this article: GOOG\n\nTSLA\n\nUBER\n\nLYFT\n\nThis article first appeared on GuruFocus .\nAlphabet Inc. ( GOOGL , Financials ) is stepping in to assist Waymo get a big new round of investment . The self-driving car company is said to be aiming to raise more than $15 billion. If the acquisition goes through, Waymo's value would be close to $100 billion, which is one of the biggest in the new robotaxi market.People who know about the negotiations said that the new money is meant to help Waymo keep rolling out autonomous ride services, which have been growing into additional U.S. cities over the last year. The business has been getting bigger fleets, better technology, and collaborating with local governments to make sure that safety and operating standards are followed.Alphabet's action shows that they still believe in the long-term future of self-driving cars, even while other companies like Tesla, Uber, and Lyft are still working on their own driver-assistance and ride-hailing plans. Waymo has made success recently, which implies that there is a growing demand for services that don't need a driver. More money might help speed up that move.Investors will be looking to see whether Waymo can close the transaction and utilize the extra money to accelerate up its ambitions to grow in 2026.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:27:00",
      "Source": "Barrons.com",
      "Title": "Tesla Stock Rebounds After AI Selloff. Why the Fears Didn’t Make Sense.",
      "URL": "https://finance.yahoo.com/m/449fc3c8-8626-3dc1-8213-5369f278dcc1/tesla-stock-rebounds-after-ai.html",
      "Content": "Tesla Stock Rebounds After AI Selloff. Why the Fears Didn’t Make Sense.\n\nAl Root\nThu, December 18, 2025 at 4:27 AM PST 1 min read\n\nIn this article: TSLA\n\nNVDA\n\nGEV\n\nThe shares got caught up in the artificial-intelligence panic after hitting a record high earlier in the day.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:00:39",
      "Source": "Yahoo Finance Video",
      "Title": "Amazon, Apple, Google, etc.: Why the Mag 7 needs to 'recalibrate'",
      "URL": "https://finance.yahoo.com/video/amazon-apple-google-etc-why-120039409.html",
      "Content": "Amazon, Apple, Google, etc.: Why the Mag 7 needs to 'recalibrate'\n\nYahoo Finance Video and Brian Sozzi\nThu, December 18, 2025 at 4:00 AM PST\n\nIn this video: TSLA\n\n^GSPC\n\nAAPL\n\nGOOG\n\nMSFT\n\nThe S&P 500 ( ^GSPC ) is concentrated primarily in the top ten technology stocks, according to Barclays.\nPNC Asset Management Group chief investment officer Amanda Agati, Yahoo Finance Senior Business Reporter Ines Ferré , and Yahoo Finance Senior Reporter Brooke DiPalma join Opening Bid host Brian Sozzi to discuss the market's concentration in tech and whether it's time for investors to start selling the \"Magnificent Seven.\"\nTo watch more expert insights and analysis on the latest market action, check out more Opening Bid .\n\nVideo Transcript\n\n00:00 Speaker A\nWhat I mentioned at the top about how much concentration risk there is in the S&P 500. What does that mean exactly for investors as we gear up for next year?\n00:10 Amanda\nWell, it's a great question and it's great to be with all of you again.\n00:15 Amanda\nIt's tough out there. Uh certainly for active managers to try and own enough of those top seven or top 10 names to really make a difference in terms of trying to keep up with, let alone outperform the S&P 500.\n00:30 Amanda\nSo for multi- asset investors, it's I think it's just going to continue to be a challenging environment to keep up with the S&P 500. It's hard to bet against them though.\n00:43 Amanda\nBut I think for 2026, it's going to be less about valuation multiple expansion and much more about what happens to the bottom 490 or 493, however you want to calculate it. I think that market breadth story, it was a little bit elusive this year, but I think it's going to come to the forefront next year and make a difference for multi- asset investor positioning.\n01:00 Speaker A\nAmanda, that's good points. Uh is the sell-offs we're seeing in Oracle and CoreWeave over the past few weeks, is that the signal Amanda to investors to start lightning the load on the Mag 7?\n01:11 Amanda\nI don't know that it's necessarily a signal to start selling. Again, we're not trying to bet against that story. It's it's very secular, thematic, long runway, still very much early innings. So we're all in on it. I think just the reality of where valuations have moved to is a little bit, I don't want to say nonsensical, but I just said nonsensical.\n01:28 Amanda\nIt feel it feels like we need to recalibrate a little bit. And so I think what's happening here is some seasonality, selling some of those winners and hoping that we get another crack at it, maybe early in the new year.\n01:40 Speaker A\nInez, this is all one big fat bubble, right?\n01:44 Ines\nLook, uh Sozzi, uh like Amanda was saying, I mean, yes, there is this concentration uh and also Goldman Sachs uh just recently put out a note as well talking about that concentration for earnings growth for next year and concentrated in the largest uh S&P 500, the largest seven stocks of the S&P 500.\n02:05 Ines\nHowever, like what Amanda was just saying, there is this expectation that for the other 493, that you will see a bit of an acceleration of earnings growth for those companies as well. So there may be a little tiny bit of broadening out when it comes to that.\n02:22 Ines\nBut a lot of this of course is the AI theme that we've been talking about and this is what Wall Street has been bullish on, is this AI theme that AI uh driven productivity will also be supporting earnings.\n02:37 Speaker A\nUh important point here Brooke is that within these 10 stocks that have uh essentially taken over the S&P 500 and taken over the minds of investors. These companies have earnings, the earnings are good and they're still accelerating. So I guess to Amanda's point, it's going to be hard to bet against these names next year.\n02:53 Brooke\nBrian, but I think what the key point here that investors have really weighed in on is the future outlook of these companies, the guidance that they're putting out.\n03:02 Brooke\nAnd I think that's why we're seeing investors fall disappointed based upon what these companies say will be the end results or what exactly the end result could potentially be for revenue when it comes to all the AI investments that they're currently making, the spending that they're currently doing.\n03:20 Brooke\nAnd and that's why sometimes we're not seeing the same return that we see from other uh stocks, other investments because of the fact that these these uh guidance, these outlook that these companies put out just doesn't meet the very high bar that these investors have set for these sort of companies.\n03:42 Brooke\nAnd also, we are seeing a bit of a different fold. Over the past three months, we've seen Tesla, Apple, and Alphabet outperform the broader uh Mag 7.\n03:51 Brooke\nAnd that's largely because of the fact that investors seem to be liking the way in which these companies are now pursuing AI. And so we're seeing this bit of a uh a differ, you know, a difference in what we're seeing in these latter parts of the month than maybe earlier this year when we really saw Nvidia, Amazon, Microsoft, as well as Meta really lead the way within this AI tech rally, especially over the summer months.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:00:02",
      "Source": "Barchart",
      "Title": "2 Option Trade Ideas To Consider This Thursday",
      "URL": "https://finance.yahoo.com/m/7f74816b-c588-3841-8bc3-bbf8e0508cb0/2-option-trade-ideas-to.html",
      "Content": "2 Option Trade Ideas To Consider This Thursday\n\nGavin McMaster\nThu, December 18, 2025 at 4:00 AM PST 3 min read\n\nIn this article: TSLA\n\nAAPL\n\nToday, we are using the stock screener to find stocks with a Buy rating and then looking at a couple of bullish option trade ideas.\nFirst the stock scanner:\nMore News from Barchart Oracle's Unusual Put Options Activity - A Contrarian Signal - Should Investors Buy ORCL Stock?\n3 Barchart Stock Screeners to Help You Find Better Call Option Trades\nHow to Buy CSCO for a 2.5% Discount, or Achieve a 19% Annual Return\nMarkets move fast. Keep up by reading our FREE midday Barchart Brief newsletter for exclusive charts, analysis, and headlines.\nWhich produces these results:\nThe two companies we’re going to look at that meet our criteria are Tesla (TSLA) and Apple (AAPL).\nTesla Bull Put Spread\nA bull put spread is a defined risk option strategy that profits if the stock closes above the short strike at expiry.\nTo execute a bull put spread an investor would sell an out-of-the-money put and then buy a further out-of-the-money put.\nThis bull put spread comes from the vertical spread screener on the TSLA page.\nThis bull put spread trade involves selling the January expiry $410 strike put and buying the $400 strike put.\nSelling this spread results in a credit of around $1.35 or $135 per contract. That is also the maximum possible gain on the trade. The maximum potential loss can be calculated by taking the spread width, less the premium received and multiplying by 100. That give us:\n\n10 – 1.35 x 100 = $865.\nIf we take the maximum gain divided by the maximum loss, we see the trade has a return potential of 15.61%.\nThe loss probability is 17.0%, although this is just an estimate.\nThe Barchart Technical Opinion rating is a 100% Buy with a Average short term outlook on maintaining the current direction.\nLong term indicators fully support a continuation of the trend.\nApple Bull Put Spread\nFor Apple, let’s also look at the Bull Put Spread results for January.\nLet’s use the first line item as an example. This bull put spread trade involves selling the January expiry $265 strike put and buying the $255 strike put.\nSelling this spread results in a credit of around $1.74 or $174 per contract. That is also the maximum possible gain on the trade. The maximum potential loss can be calculated by taking the spread width, less the premium received and multiplying by 100. That give us:\n10 – 1.74 x 100 = $826.\nIf we take the maximum gain divided by the maximum loss, we see the trade has a return potential of 21.07%.\nThe loss probability is 28.8%, although this is just an estimate.\nThe Barchart Technical Opinion rating is a 80% Buy with a Weakening short term outlook on maintaining the current direction.\n\nStory Continues\nLong term indicators fully support a continuation of the trend.\nRelative Strength just crossed below 50%. The market is indicating support for a bearish trend.\nConclusion\nThere you have two bullish trade ideas on two different stocks. Remember to always manage risk and have stop losses in place.\nPlease remember that options are risky, and investors can lose 100% of their investment. This article is for education purposes only and not a trade recommendation. Remember to always do your own due diligence and consult your financial advisor before making any investment decisions.\nOn the date of publication, Gavin McMaster did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:00:01",
      "Source": "Bloomberg",
      "Title": "Tesla’s ‘Musk Premium’ in Focus With SpaceX IPO on the Horizon",
      "URL": "https://finance.yahoo.com/news/tesla-musk-premium-focus-spacex-120001761.html",
      "Content": "Tesla’s ‘Musk Premium’ in Focus With SpaceX IPO on the Horizon\n\nJordan Fitzgerald\nThu, December 18, 2025 at 4:00 AM PST 6 min read\n\nIn this article: TSLA\n\n^GSPC\n\n(Bloomberg) -- Elon Musk is selling investors a future of driverless cars, robot assistants and life on Mars. The problem is there’s only one way to buy into his vision: Tesla Inc.’s stock.\nThe electric-vehicle maker’s shares, which hit their first record of the year on Tuesday, are up roughly 20% in the last four weeks. Since tumbling to a low on April 8 during the height of panic over the Trump administration’s tariffs, the stock has soared 111%, putting it among the 20 best performers in the S&P 500 Index.\n\nMost Read from Bloomberg\nHudson Tunnel Digging Work to Start as Boring Machines Ready\nNYC High Line-Area Building Floats $53 Million Bankruptcy Sale\nHow This Chameleon UK Location Became a Little-Known Hollywood Backdrop\nNew York Says Cab, Rideshare Insurance Rates to Rise 25%\nNew York Utility Says Queue for Large Power Users Has Tripled\nThe rally is a testament to Wall Street’s faith in Musk’s artificial intelligence ambitions, particularly since Tesla’s core auto business is struggling. But it has also made Tesla shares extremely expensive. At 214 times earnings over the next 12 months, the stock has the second highest valuation in the S&P 500, trailing only Warner Bros Discovery Inc. and far ahead of number three Palantir Technologies Inc., another high-flyer that trades at 178 times forward earnings.\n\n“The valuation doesn’t make any sense,” said Vikram Rai, portfolio manager and macro trader at First New York, which sold its Tesla position earlier this year after Musk and President Donald Trump had a very public fallout over social media.\nA Tesla representative didn’t reply to a request for comment.\nWith Musk’s SpaceX possibly going public next year, stock traders looking for “Elon exposure” will likely have another way to get it before long. The space exploration company is planning an insider share sale that would value it at $800 billion, making it the most expensive privately held business in the world. Its initial public offering would be the largest ever.\n\n“A SpaceX IPO could lead to some selling pressure on Tesla shares,” said Dmitry Shlyapnikov, an analyst at Horizon Investments who works with portfolio managers. “There are investors that own Tesla for exposure to Elon’s ideas and not for the car company attached to the ticker.”\nOf course, there’s another school of thought that a SpaceX public stock offering would shine a spotlight on Musk, giving Tesla another jolt of momentum.\n“Historically, when one of Musk’s companies achieves a major milestone, it tends to lift sentiment for the others,” said Adam Sarhan, chief executive officer of 50 Park Investments. “A high-profile SpaceX IPO could attract a fresh wave of investors who are drawn to his innovation story — and that enthusiasm often spills over into Tesla.”\n\nStory Continues\nSo far, Tesla’s stock price is getting a boost from the hype surrounding SpaceX, according to Bloomberg Intelligence analyst Steve Man. The missions of the two companies are interlinked, he said, describing a future where Tesla’s Optimus robots help with Musk’s ambition to colonize Mars, and SpaceX’s Starlink satellite system bolsters vehicle connectivity on earth.\n\nThe companies also share lofty valuations. But Tesla skeptics question whether the company’s fundamentals can support those numbers. Its sales are slowing and profits are falling, while regulations rise and consumers spend less on cars.\n“If you’ve been long Tesla stock, you’ve made money, there’s no denying it,” said Thomas Thornton, founder of Hedge Fund Telemetry, who has a small short position in Tesla. “It’s just bizarre to me because the fundamentals are so bad.”\n‘Double-Down on Elon’\nOptimists, on the other hand, point to Tesla’s growth prospects with opportunities in autonomous driving and robotaxis. Musk’s goal is to transform Tesla from an auto manufacturer to an artificial intelligence and robotics company, writing in a September X post that 80% of the firm’s profits will eventually come from robots.\n\n“We believe Tesla’s earnings are going to be growing at 30% to 35% over the next two to three years based on the innovation that they have in the automotive segment,” said Brian Mulberry, client portfolio manager at Zacks Investment Management, which owns the company’s shares.\nIf Musk can pull that off, Tesla’s stock market valuation would make more sense. If he can’t, that’s where SpaceX comes in. Publicly traded shares of SpaceX would give investors the opportunity to own a piece of Musk’s vision without Tesla’s baggage.\n“I think most investors will not want to double-down on Elon,” First New York’s Rai said. “That is a lot of risk to carry.”\nNeedham analyst Chris Pierce disagrees.\n“We don’t see investors making an either/or choice, but instead backing both companies,” he said. “Investors that have made money in Tesla are likely to want to back another Musk venture.”\n\nFor now, the reality for investors is Tesla is the only one way to bet on Musk’s vision. The immediate risk is the stock’s valuation, which is getting close to dangerous territory. On a technical level, the shares had been close to being considered overbought earlier this week. When they last reached that level in early October, the stock fell 10% over the next seven sessions.\n“In the short term, it’s probably ready for a bit of a cooling off type of period after having that all-time high,” Mulberry said.\nBut to long-term Musk believers, the valuation is what Mulberry described, a short-term concern. Over the next few years, however, many see Tesla as a buy regardless of the price — possibly even more than SpaceX.\n“I fully believe that at some point there will be a commercial mission to Mars, but probably not in my lifetime,” said Mulberry, who’s 51 years old. “Does that mean I want to invest in that stock today? You’d have to have a really long view of that, whereas you could see the impact of robotaxis and robots probably in the next three to five years.”\n\nTop Tech News\nMicron Technology Inc., the largest US maker of computer memory chips, gave an upbeat forecast for the current quarter, a sign that surging demand and supply shortages are allowing the company to charge more for products.\nThe growing acrimony over the biggest deal in Hollywood is spilling into the open. On Wednesday, Warner Bros. Discovery Inc., the parent of HBO and CNN, advised its shareholders to reject a hostile takeover bid by Paramount Skydance Corp. in favor of its original agreement with streaming giant Netflix Inc.\nOpenAI and Anthropic are looking to expand their office footprints in Dublin, a move that underscores both firms’ growing presence in Europe and the race to boost global uptake of their artificial intelligence services.\nApple Inc. is making changes to its iOS software in Japan to comply with a new local law aimed at fostering competition, part of broader efforts by the iPhone maker to adapt to regulations around the world.\nThe Academy Awards will move to Alphabet Inc.’s YouTube service in 2029, ending more than a half century on the ABC network and more than 70 years on broadcast TV.\nEarnings Due Thursday\nNo major earnings expected\n--With assistance from Matt Turner and David Watkins.\nMost Read from Bloomberg Businessweek\nThe Cracks in Crumbl’s Cookie Empire Are Showing\nDonald and Melania Trump’s Terrible, Tacky, Seemingly Legal Memecoin Adventure\nUniqlo Founder and Japan’s Richest Man Loves a $32 Pair of Slacks\nOracle’s $300 Billion AI Bet Has Fast Become a Bubble Barometer\nThe Prosperity Gap Between Big and Small Businesses\n©2025 Bloomberg L.P.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "20:00:00",
      "Source": "Fortune",
      "Title": "Rivian CEO says midprice EV sales are still 50% Tesla: ‘That’s not a reflection of a healthy market’",
      "URL": "https://finance.yahoo.com/news/rivian-ceo-says-midprice-ev-120000346.html",
      "Content": "Rivian CEO says midprice EV sales are still 50% Tesla: ‘That’s not a reflection of a healthy market’\n\nSasha Rogelberg\nThu, December 18, 2025 at 4:00 AM PST 2 min read\n\nIn this article: RIVN\n\nTSLA\n\nIt’s not that Americans don’t want electric vehicles, according to the chief executive of American EV-maker Rivian. It’s just that they don’t have many good options.\nAt the Fortune Brainstorm AI conference in San Francisco earlier this month, Rivian CEO RJ Scaringe pointed to the scant choices consumers have in picking a midprice EV, noting that Tesla has continued to dominate sales, making up about 50% of the market share, with few other competitors making an impression.\n\n“That&#8217;s not a reflection of a healthy market with lots of choice,” Scaringe said. “If you think of it as a consumer, you have 300 different internal combustion engine choices at that price or lower, and you have maybe one highly compelling EV choice.”\nEV demand in the U.S. has continued to lag behind other parts of the world, making up just about 5% of new car sales, according to November data from Edmunds. In China, meanwhile, EVs make up more than 50% of the auto market share, China Association of Automobile Manufacturers data shows. Battery-electric cars make up about 16% of the EU market share, per the European Automobile Manufacturers&#8217; Association.\nU.S. automakers are feeling the squeeze from middling demand, with Ford pivoting away from heavy EV investment, citing lackluster American interest. It announced this week it would take a $19.5 billion charge and refocus on gas- and hybrid-powered vehicles, discontinuing some larger EV models.\n\nSparking American’s EV curiosity Scaringe hopes his automaker’s own focus on more affordable EVs can rev up demand in the sector. Rivian’s R1, a seven-seat premium SUV, starts at about $70,000 and can run up to about $120,000. The R2, expected to launch in the first half of next year, will have a $45,000 price tag.\n“We see, with R2, an opportunity to really bring a whole host of new customers that haven&#8217;t had a choice that&#8217;s electric that really appealed to them yet,” Scaringe said.\n\nPrice appears to be at the forefront of the CEO’s mind. While automakers like Ford said the end of the $7,500 EV tax credit tempered demand for new cars, Scaringe reportedly took a different perspective . In a memo to employees, reported by the Wall Street Journal , Scaringe said the end of the incentive puts pressure on EV companies, including Rivian, to lower prices.\nBut increased competition has not always been greeted so fondly. Canada imposed a 100% tariff on Chinese EVs in 2024, hoping to protect the burgeoning domestic market of electric cars. Scaringe, however, sees room for his rivals in the U.S.\n\nStory Continues\n“I really think the constraint isn&#8217;t the demand side. I think it&#8217;s the supply side,” Scaringe said. “I do think that the existence of choice will help drive more penetration, and it actually creates a unique opportunity in the United States.”\nThis story was originally featured on Fortune.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 66
}