{
  "stock_id": "TSM",
  "last_updated": "2025-12-18T14:42:28.734Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-18",
      "Time": "22:27:00",
      "Source": "Motley Fool",
      "Title": "Prediction: This Will Be TSMC's Stock Price in 2026",
      "URL": "https://finance.yahoo.com/m/a51c8b0b-3207-3f94-bcdd-e8a5a1ea4cd0/prediction%3A-this-will-be.html",
      "Content": "Prediction: This Will Be TSMC's Stock Price in 2026\n\nHarsh Chauhan, The Motley Fool\nThu, December 18, 2025 at 6:27 AM PST 5 min read\n\nIn this article: TSM\n\nKey Points TSMC is sitting on solid catalysts that should allow it to crush Wall Street's expectations in 2026.\nThe healthy demand for AI chips, TSMC's capacity expansion efforts, and the potential increase in prices of its chip nodes should pave the way for robust revenue and earnings growth.\n10 stocks we like better than Taiwan Semiconductor Manufacturing ›\n\nAs 2025 draws to a close, those who invested in shares of Taiwan Semiconductor Manufacturing (NYSE: TSM) at the beginning of the year would be pretty happy with their decision. After all, the foundry giant has appreciated an impressive 45% so far this year (as of Dec. 16), and that's not surprising given the robust growth in its revenue and earnings throughout the year.\nPopularly known as TSMC, the Taiwan-based company is playing a critical role in the global artificial intelligence (AI) chip market. Not surprisingly, analysts are upbeat about TSMC stock's prospects in the coming year. Let's check out the company's catalysts for 2026 and find out how much upside investors can expect from TSMC stock in the new year.\nInvestors can expect TSMC's growth to accelerate in 2026 TSMC's financial performance improved this year. The company's revenue in the first 11 months of the year jumped by 33% from the same period last year. Consensus estimates project a 48% spike in its earnings for 2025 to $10.42 per share. Those numbers will be an improvement over last year, when TSMC recorded a 36% spike in earnings on a 30% jump in revenue to just over $90 billion.\n\nAnalysts, however, expect TSMC's growth to slow down in 2026. Consensus estimates point toward a 20% increase in revenue and earnings next year. However, there is ample evidence indicating that it could ultimately perform much better than that.\nThe first major reason why TSMC's growth rate in 2026 could accelerate is its improving advanced chip packaging capacity. Equity research and brokerage firm Bernstein expects TSMC's advanced chip packaging chip-on-wafer-on-substrate (CoWoS) capacity to hit 125,000 wafers per month by the end of 2026.\nThat points toward a terrific increase of around 66% from TSMC's current CoWoS capacity of 75,000 wafers. Importantly, the higher capacity that TSMC is set to bring online throughout next year is said to be fully booked out, as reported by market research firm TrendForce. This isn't surprising as the foundry giant needs to fulfill orders for AI and high-performance computing (HPC) chips from companies like Nvidia (NASDAQ: NVDA) , Amazon , MediaTek, Google, and others.\n\nStory Continues\nTSMC's customers, which also include Broadcom , Marvell , Apple , and others, have been experiencing robust demand for their devices and AI chips. Nvidia, for instance, still has a massive order backlog of around $307 billion that it needs to fulfill over the next five quarters. That's well above Nvidia's trailing-12-month revenue of $187 billion.\n\nMoreover, Nvidia has been cleared by the Trump administration to sell its advanced H200 data center graphics processing units (GPUs) to Chinese customers. This could help the chipmaker land more orders for its chips in 2026 and ensure that the additional capacity that TSMC is bringing online is indeed sold out.\nSo, the substantial increase in TSMC's advanced chipmaking capacity should translate into a much bigger jump than the 20% top-line increase that analysts forecast for next year. Another important thing worth noting is that TSMC will likely hike the prices of its various process nodes next year. TrendForce points out that TSMC could hike the prices of its advanced chip nodes, which are used for manufacturing AI chips, by 3% to 5% next month.\n\nOther estimates indicate that there may be a price hike of up to 10% for TSMC's advanced chip nodes. Also, the new 2-nanometer (nm) process node that TSMC will start producing next year is expected to carry a 10% to 20% premium over the existing flagship, the 2nm node. Therefore, it won't be surprising to see TSMC's earnings growing at a much faster pace than the 20% increase that analysts expect next year, and that could set this semiconductor stock up for terrific gains.\nHere's how much upside investors can expect next year TSMC carries a 12-month median price target of $355, according to 50 analysts covering the stock. That suggests 23% gains from current levels. However, TSMC can easily beat that median price target in 2026.\nWe have already seen why the company is on track to exceed Wall Street's revenue and earnings growth estimates for next year. Assuming its earnings jump by 40%, as compared to the consensus estimate of 20% in 2026, its bottom line could hit $14.59 per share (based on the 2025 earnings estimate of $10.42 per share). If TSMC trades at 33 times earnings after a year, in line with the tech-laden Nasdaq-100 index, its stock price could hit $481. That would represent a 67% increase from current levels.\n\nInvestors looking to buy an AI stock that can make them richer in 2026 can consider taking a closer look at TSMC before it soars higher.\nShould you invest $1,000 in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $511,196 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,047,897 !*\nNow, it’s worth noting Stock Advisor’s total average return is 954 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nHarsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom and Marvell Technology. The Motley Fool has a disclosure policy .\nPrediction: This Will Be TSMC's Stock Price in 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:28:39",
      "Source": "Investing.com",
      "Title": "Morgan Stanley recommends adding to this major chip stock ahead of 2026",
      "URL": "https://finance.yahoo.com/news/morgan-stanley-recommends-adding-major-132839928.html",
      "Content": "Morgan Stanley recommends adding to this major chip stock ahead of 2026\n\nSam Boughedda\nThu, December 18, 2025 at 5:28 AM PST 1 min read\n\nIn this article: MS\n\nTSM\n\nTSMWF\n\nInvesting.com -- Morgan Stanley told investors in a note Thursday that it recommends increasing positions in one key semiconductor stock ahead of 2026, raising its price target and reiterating the stock as a top pick, citing accelerating AI-driven growth and expanding margins.\nThe bank lifted its target on Taiwan Semiconductor Manufacturing to NT$1,888 from NT$1,688 and reaffirmed an Overweight rating, according to Morgan Stanley analyst Charlie Chan.\n\n“[We] recommend increasing positions in TSMC before the start of 2026,” wrote Chan.\nThe firm expects TSMC to guide 2026 revenue growth in the mid-20% range, while ultimately delivering closer to 30% year-over-year growth.\nBased on the forecast 2026 capital expenditure of $49 billion and continued 3-nanometer capacity expansion, Morgan Stanley models 2026 revenue growth of 30%, well above the Street consensus of 22%.\nThe bank noted that management may initially take a conservative stance but expects growth to exceed guidance in later quarters.\nMorgan Stanley also raised its longer-term outlook, revising its estimate for AI semiconductor foundry revenue growth to a 60% compound annual rate from 2024 to 2029.\nThe firm estimates the total AI chip market could reach $550 billion by 2029, with TSMC generating about $107 billion from AI chip foundry services, or roughly 43% of total revenue.\nThe bank raised its 2026 and 2027 earnings estimates and said the stock “remains attractive at 16x or 13x our 2026/2027 average EPS,” maintaining its bullish stance as AI demand continues to drive global semiconductor growth, according to Morgan Stanley.\nRelated articles\nMorgan Stanley recommends adding to this major chip stock ahead of 2026\n10 Beaten-Down Large-Cap Tech Stocks Offering Solid Upside Potential\n3 Dependable Non-Tech Stocks Poised for Steady Gains in Uncertain Times\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "21:02:29",
      "Source": "Yahoo Finance",
      "Title": "Rivian CEO on self-driving, designing AI chips, and why Tesla needs more competition",
      "URL": "https://finance.yahoo.com/news/rivian-ceo-on-self-driving-designing-ai-chips-and-why-tesla-needs-more-competition-130229526.html",
      "Content": "Rivian CEO on self-driving, designing AI chips, and why Tesla needs more competition\n\nPras Subramanian · Senior Reporter\n更新時間 Thu, December 18, 2025 at 5:05 AM PST 7 min read\n\nIn this article: RIVN\n\nTSLA\n\nVLKAF\n\nNVDA\n\nTSM\n\nAt Rivian's ( RIVN ) Autonomy and AI Day on Dec. 11, the pure-play EV maker outlined a whole range of tech and software products, with a focus on vertical integration — meaning doing everything from end to end in-house.\nCEO RJ Scaringe launched the company's new Autonomy platform at the event — and during a trying time for the EV sector, in which so far only Tesla has achieved profitability. While Rivian has achieved gross profits in recent quarters, actual bottom-line (or net) profits have been elusive.\n\nScaringe, who founded the company in 2011, saw Rivian go public in 2021 and reach stratospheric heights of $120 a share before the stock came back down to earth, now at $18. A crucial cash infusion from Volkswagen ( VWAGY ) of nearly $6 billion via a joint venture between the two companies has given Rivian much-needed breathing room.\nThe following is a condensed version of Yahoo Finance's conversation with Scaringe, touching on the company's path toward full self-driving (FSD), or personal L4, as Rivian calls it, building in-house chips, and where the overall EV industry is headed.\nYahoo Finance: Thanks for having us here, RJ. Rivian's Autonomy platform — talk to me about the progression from where Rivian is right now to what's going to come out in the near term and its vision for the future.\nRJ Scaringe: Autonomy has been a journey for us. We followed the launch of our Gen 1 vehicles at the end of 2021. In early 2022, we realized we wanted to do a clean-sheet approach to our Autonomy platform. So we started the process on that, and that involved developing a camera platform, redesigning the compute platform, and architecting the whole system around an AI-centric approach.\n\nThat was what went into our [current] Gen 2 vehicles that we ultimately launched in the middle of 2024, and the compute relative to our Gen 1 [vehicles] increased by about 10x — that's the inference on the vehicle. When we launched that, there was 55 megapixels of cameras, an array of radars, and that began the process of building the data stream to really train this model.\nOn our Gen 3 platform, it's [built using] an in-house chip ... This is a platform that can process 5 billion pixels per second, so that's roughly 5x the best in class today. This is very, very high processing capability. And that not only raises the performance level of this platform, but it also allows us to build the model more efficiently and more quickly.\nCurrently, Rivian offers Universal Hands-Free, which is akin to GM's Supercruise, and that will be expanded to more roads. What comes next?\nIn 2026, we'll add \"point to point.\" So you can get in the car from your driveway, type the address, and it does everything, hands-free, eyes-on, etc. .... But it's still supervised.\n\n繼續閱讀\nThen the platform expands to the next big step, which is eyes-off — and eyes-off is really powerful. That's when you can start to be in the car, be on your phone, be reading a book. Essentially, your role in driving the car diminishes to nothing. You're just a passenger.\nAnd then the next step beyond that is what we call personal Level 4, which is the idea that the vehicle can completely operate on its own, even without anybody in the car. And so things like picking the kids up from school, an airport drop-off, or grabbing groceries.\n\nRead more: How to find the best luxury car insurance\nYou mentioned the custom silicon Riving is making in-house. Talk to me about why that's important for you to make that the next jump in the next few years. Why not use an off-the-shelf self-driving product like Nvidia's?\nWe made the decision years and years ago to build our entire vertical software platform in-house and not rely on tier-one suppliers for any of that content ... We then built teams of thousands of people to go put all that together. [We] spent many, many, many hundreds of millions of dollars to develop those systems. And when we've approached autonomy and our overall AI roadmap, we had a very similar view, which is this is going to be the most important technical shift in transportation, I would say, more than anything else, more than anything since the beginning of the car. And we wanted to control our own destiny...\n\nYou [also] need a partnership with someone like a TSMC, which in our case is our partner. [Although Rivian designed its chip in-house, a chipmaker is needed to actually produce the chip.] And what we're going to get is better performance, something that's very specific to vision-based robotics ... And then we needed to build this data flywheel, and so lots of offline training, that means lots of GPUs.\nI want to mention Tesla because it is doing the same thing with regard to going fully vertical. It has its own chips. It's doing its own data centers. But unlike Tesla, Rivian uses sensors as opposed to just camera vision. Do you think Rivian can meet, and even surpass, where Tesla FSD is in the next couple of years?\n\nOur goal is to be world-class. Tesla, to be clear, is a great product. They've built a really impressive platform. We're very much aligned with them on believing it needs to be a neural-net-based approach, building an end-to-end trained model that's using a fleet of vehicles, building a data flywheel that trains the model with reinforcement learning. So we really agree here.\nWe do have a different view on the benefits of a diverse set of perception modalities. In our case, still being camera-heavy, call it camera-primary. But by including radar and lidar [light detection and ranging], it allows us to turn our entire fleet into a \"ground truth\" fleet. So every vehicle on the road is very helpful in training our model. [Similar to Tesla, Rivian's EVs will send massive amounts of data collected via sensors and cameras to train its self-driving model.]\nI want to ask you about the bigger picture of the EV industry in America. The tax credit went away in Q4. How are things going for you now as a result? I've heard people talk about how the pure-play EV makers might actually benefit from this because we have fewer competitors in the market.\nI think what you postulated in your question is probably somewhat right. I think you are seeing a lot of manufacturers pull back. I think that's unfortunate. I think it'd be healthier for the auto industry if everybody was focused on electrification. I think that pullback means there's going to be less choice, which is bad for customers. But I do think because there's less choice, it means it's going to be a less competitive environment...\n\nIf you were to look at the segment of vehicles with price points that start under $50,000, there's very few highly compelling choices, and as a result of that, a single company, Tesla, has accumulated around 50% market share ... and that's not a reflection of a healthy industry. It's a reflection of an underserved market. And so if we want to see electrification go from its 8% adoption, which is what it is in the United States today, to let's say 25 or 30 or ultimately 100%, we need to have more than one great choice.\nAnd of course, I think Rivian is one of those [great choices] with our R2. I think it's going to be exceptional. The car itself is just amazing, but I hope there's others.\nPras Subramanian is Lead Auto Reporter for Yahoo Finance. You can follow him on X and on Instagram .\nClick here for the latest technology news that will impact the stock market\nRead the latest financial and business news from Yahoo Finance\n\n條款 及 私隱政策\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "14:15:07",
      "Source": "Insider Monkey",
      "Title": "Bernstein Asserts Outperform Rating as Taiwan Semiconductor Manufacturing Company Limited (TSM) Monthly Sales Track Ahead of Guidance",
      "URL": "https://finance.yahoo.com/news/bernstein-asserts-outperform-rating-taiwan-061507559.html",
      "Content": "Bernstein Asserts Outperform Rating as Taiwan Semiconductor Manufacturing Company Limited (TSM) Monthly Sales Track Ahead of Guidance\n\nNeha Gupta\nWed, December 17, 2025 at 10:15 PM PST 2 min read\n\nIn this article: TSM\n\nTSMWF\n\nTaiwan Semiconductor Manufacturing Company Limited (NYSE: TSM ) is one of billionaire David Tepper’s top stock picks heading into 2026 . On December 10, analysts at Bernstein SocGen Group reiterated an Outperform rating and a $330 price target on Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM). The positive stance is in response to the company tracking ahead of its fourth quarter guidance and consensus estimates.\nthe-main-processor-3334336_1280\nThe company’s revenues in November were down 6.5% month over month to NT$344 billion but represented a 24.5% year-over-year increase. The year-over-year increase aligns with the 37% revenue growth over the past 12 months. The company’s revenue for October and November totaled NT$711 billion, accounting for 71% of the fourth quarter guidance.\n\nConsequently, Taiwan Semiconductor is on course to deliver fourth-quarter revenue at the upper end of its historical range. Should the momentum from the past two months persist in December, Bernstein expects the company’s Q4 revenue to exceed the midpoint of guidance and consensus estimates by 3-4%.\nThe expected revenue growth is being driven by the robust production of artificial intelligence chips for Nvidia and Broadcom. The company is also capitalizing on the strong demand for Apple’s mobile phone chips.\nAnalysts at Bank of America have already raised their price target for the stock to $360, citing a strong view of TSMC’s AI growth trajectory.\nTaiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) is the world’s largest dedicated semiconductor foundry, meaning it manufactures chips designed by other companies, rather than designing its own brands.\n\nWhile we acknowledge the potential of TSM as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 12 Best Industrial Stocks to Buy According to Wall Street Analysts and 12 Best 52-Week High Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "12:20:00",
      "Source": "Motley Fool",
      "Title": "What Are 3 of the Best AI Stocks to Hold for the Next 10 Years?",
      "URL": "https://finance.yahoo.com/m/c309c74a-0589-37fc-a12b-bc26aa49a084/what-are-3-of-the-best-ai.html",
      "Content": "What Are 3 of the Best AI Stocks to Hold for the Next 10 Years?\n\nStefon Walters, The Motley Fool\nWed, December 17, 2025 at 8:20 PM PST 6 min read\n\nIn this article: TSM\n\nMSFT\n\nNVDA\n\nKey Points TSMC has a technological monopoly on advanced AI chip manufacturing.\nNvidia is responsible for designing critical pieces of the modern data center.\nMicrosoft can easily monetize AI by inserting it into its software ecosystem.\n10 stocks we like better than Taiwan Semiconductor Manufacturing ›\nWhile artificial intelligence (AI) is solidifying its mark in the world, it would be naive not to expect that some of today's AI-focused companies won't stand the test of time. In some cases, these companies may be too niche to remain independent and will ultimately become acquisition targets. Others simply won't survive.\nWhen I think about AI stocks I want to hold for the next decade, I look for companies that are key players in different phases of the AI pipeline. The following three companies fit that description and appear to be good long-term investments.\n1. Taiwan Semiconductor Manufacturing Company Taiwan Semiconductor Manufacturing Company (NYSE: TSM) isn't an AI stock in the traditional sense, but it's one of the more important companies in the space. As the world's leading third-party semiconductor foundry, TSMC manufactures chips designed by \"fabless\" companies that don't own the facilities to produce them themselves.\n\nWhen it comes to manufacturing the types of advanced AI chips used in data centers, TSMC essentially has a monopoly . With its superior technology and efficiency, it's the go-to company, and there's not a close second.\nCompanies like Intel and Samsung also operate foundries that can deliver chips using some of the most cutting-edge process nodes, but they have issues -- such as production delays and low yields -- that make them far less reliable. Not only has this made AI chips a large part of TSMC's business, but it has also given it more pricing power.\nBoth TSMC's revenue and operating income (profit from core operations) have grown impressively over the past couple of years; however, its dominance in advanced AI chips has enabled it to grow its profits at a significantly faster pace.\n2. Nvidia Whereas TSMC is the manufacturer that brings chips to life, Nvidia (NASDAQ: NVDA) is the designer behind critical parts of the AI ecosystem. Its lead in the parallel processor market, in particular, is why the stock skyrocketed over the past few years, turning it into the world's most valuable public company, with a market cap of nearly $4.2 trillion.\n\nFor a time, Nvidia was known for making graphics processing units (GPUs) that were primarily used to improve the performance of video games. However, the company and other clients realized that its parallel processors were useful for other types of computing workloads, and it began to pivot its focus toward those markets. Its latest pivot came as the AI trend picked up steam, and demand soared for hardware capable of handling the massive data sets involved in that technology. Many of the data center chips used for training and operating AI systems come from Nvidia.\n\nStory Continues\nOf the $57 billion in revenue Nvidia made in the third quarter (up 62% year over year), $51.2 billion (up 66%) came from its data center segment.\nWhile Nvidia's GPUs and other hardware have gotten a lot of attention, CUDA -- its parallel computing platform and application programming interface -- has flown under the radar a bit. CUDA allows Nvidia's chips to be programmed for specific tasks, and the developers who work in AI are widely familiar with it, which adds to the company's moat. Moreover, CUDA programs only run on Nvidia chips, which further increases the switching costs associated with purchasing AI accelerator chips from competitors.\n\nOther major tech companies, including Alphabet and Amazon , have begun designing their own AI chips, often with the assistance of Broadcom; however, Nvidia has a significant head start. It will inevitably lose some market share over the next decade, but as the size of the overall AI chip market continues to grow, it should remain relatively stable.\n3. Microsoft Microsoft (NASDAQ: MSFT) has two major things working in its favor regarding AI. First, Microsoft Azure is the second-largest cloud infrastructure platform in the world, and a go-to choice for many companies to build and host their own AI apps. Azure's AI capabilities have helped it close the gap a bit with segment leader Amazon Web Services.\n\nThe second major factor is that Microsoft's software portfolio comprises numerous titles and services that hundreds of millions of people use regularly, including Microsoft 365 (Excel, Word, Teams, PowerPoint, Outlook, etc.), LinkedIn, GitHub, and the Windows operating system, among others.\nThis allows Microsoft to act as a seamless AI distributor because it can easily add this new technology to software that people are already using, and then monetize it. For many corporations and individuals, paying a relatively small additional fee for Microsoft 365 Copilot is a straightforward decision. It has become another reliable revenue source for Microsoft, and it should only get better as adopting these tools becomes the norm for corporations.\n\nWhile pure-play AI companies, by definition, rely solely on this new tech for their revenues, for Microsoft, AI is more of a bonus. The company's business is well-diversified, spanning software, tech hardware, gaming, cloud computing, and professional networking. Even if the AI hype cools over the next decade, Microsoft's business will remain strong and highly profitable.\nShould you buy stock in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,955 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,089,460 !*\nNow, it’s worth noting Stock Advisor’s total average return is 968 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nStefon Walters has positions in Microsoft and Taiwan Semiconductor Manufacturing. The Motley Fool has positions in and recommends Alphabet, Amazon, Intel, Microsoft, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nWhat Are 3 of the Best AI Stocks to Hold for the Next 10 Years? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "08:11:00",
      "Source": "Morningstar Research",
      "Title": "Analyst Report: Applied Materials, Inc.",
      "URL": "https://finance.yahoo.com/m/9bbcbf4a-0fb9-3662-b261-40536851795c/analyst-report%3A-applied.html",
      "Content": "Analyst Report: Applied Materials, Inc.\n\nWilliam Kerwin\nWed, December 17, 2025 at 4:11 PM PST\n\nIn this article: AMAT\n\nTSM\n\nINTC\n\nSSNLF\n\nApplied Materials is the largest semiconductor wafer fabrication equipment manufacturer in the world. It has a broad portfolio spanning nearly every corner of the WFE ecosystem. Applied Materials holds leading market share in deposition, which entails the layering of new materials on semiconductor wafers. It is more exposed to general-purpose logic chips made at integrated device manufacturers and foundries. It counts the largest chipmakers in the world as customers, including TSMC, Intel, and Samsung.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-18",
      "Time": "06:45:03",
      "Source": "Zacks",
      "Title": "TSMC (TSM) Registers a Bigger Fall Than the Market: Important Facts to Note",
      "URL": "https://finance.yahoo.com/news/tsmc-tsm-registers-bigger-fall-224503857.html",
      "Content": "TSMC (TSM) Registers a Bigger Fall Than the Market: Important Facts to Note\n\nZacks Equity Research\nWed, December 17, 2025 at 2:45 PM PST 3 min read\n\nIn this article: TSM\n\nTSMWF\n\n^GSPC\n\n^DJI\n\nIn the latest close session, TSMC (TSM) was down 3.45% at $276.96. The stock fell short of the S&P 500, which registered a loss of 1.16% for the day. Meanwhile, the Dow experienced a drop of 0.47%, and the technology-dominated Nasdaq saw a decrease of 1.81%.\nShares of the chip company have appreciated by 3.22% over the course of the past month, outperforming the Computer and Technology sector's gain of 1%, and the S&P 500's gain of 1.03%.\n\nThe upcoming earnings release of TSMC will be of great interest to investors. The company's upcoming EPS is projected at $2.72, signifying a 21.43% increase compared to the same quarter of the previous year. Meanwhile, the latest consensus estimate predicts the revenue to be $32.6 billion, indicating a 21.26% increase compared to the same quarter of the previous year.\nRegarding the entire year, the Zacks Consensus Estimates forecast earnings of $10.13 per share and revenue of $120.47 billion, indicating changes of +43.89% and +33.73%, respectively, compared to the previous year.\nInvestors should also note any recent changes to analyst estimates for TSMC. These revisions typically reflect the latest short-term business trends, which can change frequently. As a result, we can interpret positive estimate revisions as a good sign for the business outlook.\n\nOur research shows that these estimate changes are directly correlated with near-term stock prices. To capitalize on this, we've crafted the Zacks Rank, a unique model that incorporates these estimate changes and offers a practical rating system.\nThe Zacks Rank system, which varies between #1 (Strong Buy) and #5 (Strong Sell), carries an impressive track record of exceeding expectations, confirmed by external audits, with stocks at #1 delivering an average annual return of +25% since 1988. Over the past month, there's been a 0.18% fall in the Zacks Consensus EPS estimate. TSMC presently features a Zacks Rank of #4 (Sell).\nFrom a valuation perspective, TSMC is currently exchanging hands at a Forward P/E ratio of 28.33. For comparison, its industry has an average Forward P/E of 28.33, which means TSMC is trading at no noticeable deviation to the group.\n\nIt is also worth noting that TSM currently has a PEG ratio of 0.99. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. The Semiconductor - Circuit Foundry was holding an average PEG ratio of 0.99 at yesterday's closing price.\nThe Semiconductor - Circuit Foundry industry is part of the Computer and Technology sector. At present, this industry carries a Zacks Industry Rank of 230, placing it within the bottom 7% of over 250 industries.\n\nStory Continues\nThe Zacks Industry Rank assesses the vigor of our specific industry groups by computing the average Zacks Rank of the individual stocks incorporated in the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nBe sure to use Zacks.com to monitor all these stock-influencing metrics, and more, throughout the forthcoming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nTaiwan Semiconductor Manufacturing Company Ltd. (TSM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "23:00:00",
      "Source": "PR Newswire",
      "Title": "EMASS Pushes the Edge Further with 16nm ECS-DoT",
      "URL": "https://finance.yahoo.com/news/emass-pushes-edge-further-16nm-150000178.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nEMASS Pushes the Edge Further with 16nm ECS-DoT\n\nPR Newswire\nWed, December 17, 2025 at 7:00 AM PST 4 min read\n\nIn this article: NNVUF\n\nTSM\n\nNext-generation ultra-low-power Edge AI SoC for always-on intelligence\nLOS ANGELES , Dec. 17, 2025 /PRNewswire/ -- EMASS, a Nanoveu subsidiary with next-generation semiconductor technology, today announced that its next-generation ECS-DoT SoC built on a 16nm process node has entered the final phases of development, headed toward graphic data system (GDS) sign-off, tape-out and fabrication at TSMC. This new device builds on EMASS's existing 22nm ECS-DoT offering and strengthens the company's leadership in ultra-low-power Edge AI by extending always-on intelligence into more demanding and highly integrated applications.\n\nThe new 16nm ECS-DoT builds on the 22nm's performance, energy consumption, compute capability and on-chip resources, while preserving the architectural concepts, developer workflow and ultra-low-power mission that define the ECS-DoT family. It continues to advance edge technology by integrating an on-chip Bluetooth Low Energy (BLE) subsystem, expanding on-chip SRAM with a new power management system and AI and processing acceleration enhancements.\n\"With the 16nm ECS-DoT, we reach a defining moment for EMASS as we scale our architecture into new classes of applications demanding more intelligence, more speed and even lower power,\" said Mark Goranson, CEO of EMASS. \"By migrating to 16nm, we've unlocked all new use-cases and identities that allow customers to push machine learning to the absolute edge, without sacrificing battery life or form-factor constraints.\"\n\nEnabling the Next Stage of Edge Intelligence\nThe 16nm ECS-DoT advances EMASS's edge AI capabilities through higher integration, expanded on-chip resources and improved power efficiency, enabling more capable always-on intelligence without increasing system complexity or energy demand. Key enhancements include:\nFully integrated BLE subsystem — Eliminates the need for external wireless ICs, reducing board area, bill-of-materials cost and design complexity.\nExpanded on-chip memory — Supports larger AI models and higher-throughput workloads while minimizing off-chip memory access for improved efficiency.\nAdaptive fine-grained power-management architecture — Optimizes energy use for always-on, battery-powered and energy-harvesting applications.\nDedicated object-detection accelerator — Offloads vision workloads to increase throughput and reduce inference latency for edge vision use cases.\nIntegrated floating-point unit (FP16/FP32) — Accelerates DSP and mixed-precision AI workflows while simplifying developer toolchains and code migration.\n\nStory Continues\nSeamless Upgrade Path for Developers\nThe new SoC maintains complete software and workflow compatibility with the current ECS-DoT family. This allows developers to deploy applications on either the 22nm or 16nm version with minimal redesign, while supporting larger and more demanding workloads without compromising ultra-low-power operation.\n\nStrengthening EMASS's \"Atoms-to-Apps\" Vision\nThe 16nm ECS-DoT also advances EMASS's \"Atoms-to-Apps\" methodology, connecting application requirements, algorithm design, silicon architecture and real-world deployment into a unified development philosophy.\n\"This next generation of ECS-DoT represents a significant architectural advance for EMASS, bringing together always-on intelligence, deeper on-chip resources and higher levels of integration within a single ultra-low-power Edge AI platform,\" said Dr. Mohamed Sabry, founder and CTO of EMASS. \"By extending our architecture to support more demanding workloads without sacrificing energy efficiency, we are strengthening EMASS's leadership in ultra-low-power Edge AI and expanding what's possible at the edge for our partners and customers.\"\n\nAbout EMASS\nEMASS – a subsidiary of Nanoveu Ltd (ASX: NVU) – is an advanced semiconductor company specializing in ultra-low-power AI system-on-chip (SoC) solutions for edge computing. The company's flagship ECS-DoT chip delivers high-performance AI processing for vision, audio, and sensor data directly on-device, maximizing energy efficiency through its RISC-V architecture and non-volatile memory technologies. This always-on intelligence solution is optimized for power- and space-constrained applications including drones, wearables, healthcare devices and industrial IoT systems. For more information, visit nanoveu.com/emass .\nAbout Nanoveu\nNanoveu is a listed company advancing human–machine experiences at the edge through a portfolio that spans ultra-low-power AI and glasses-free 3D technologies. Its subsidiary EMASS designs advanced system-on-chip (SoC) solutions that deliver efficient, scalable on-device AI for smart devices, IoT applications and 3D content transformation – enhancing Nanoveu's reach across rapidly growing AI, edge computing and 3D content markets. EyeFly3D™ is Nanoveu's end-to-end platform for glasses-free 3D, uniting proprietary screen technology with sophisticated content processing software and, now, EMASS's ultra-low-power SoC to bring immersive 3D to a wide range of devices and industries. The Company also develops and markets an advanced range of self-disinfecting and hydrophobic films and coatings under the Nanoshield™ brand, designed for applications including large-scale CSP and photovoltaic solar installations. Together, Nanoveu's businesses deliver practical innovation that makes devices smarter, environments safer and experiences more immersive.\nMedia Contact\nBryar Keyes\nBryar.Keyes@publitek.com\n+1 (503) 358-9597\nView original content: https://www.prnewswire.com/news-releases/emass-pushes-the-edge-further-with-16nm-ecs-dot-302644081.html\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:30:07",
      "Source": "Zacks",
      "Title": "Brokers Suggest Investing in TSMC (TSM): Read This Before Placing a Bet",
      "URL": "https://finance.yahoo.com/news/brokers-suggest-investing-tsmc-tsm-143007380.html",
      "Content": "Brokers Suggest Investing in TSMC (TSM): Read This Before Placing a Bet\n\nZacks Equity Research\nWed, December 17, 2025 at 6:30 AM PST 4 min read\n\nIn this article: TSM\n\nTSMWF\n\nWhen deciding whether to buy, sell, or hold a stock, investors often rely on analyst recommendations. Media reports about rating changes by these brokerage-firm-employed (or sell-side) analysts often influence a stock's price, but are they really important?\nBefore we discuss the reliability of brokerage recommendations and how to use them to your advantage, let's see what these Wall Street heavyweights think about TSMC (TSM).\n\nTSMC currently has an average brokerage recommendation (ABR) of 1.38, on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell, etc.) made by 13 brokerage firms. An ABR of 1.38 approximates between Strong Buy and Buy.\nOf the 13 recommendations that derive the current ABR, 10 are Strong Buy and one is Buy. Strong Buy and Buy respectively account for 76.9% and 7.7% of all recommendations.\nBrokerage Recommendation Trends for TSM Check price target & stock forecast for TSMC here>>>\nThe ABR suggests buying TSMC, but making an investment decision solely on the basis of this information might not be a good idea. According to several studies, brokerage recommendations have little to no success guiding investors to choose stocks with the most potential for price appreciation.\n\nAre you wondering why? The vested interest of brokerage firms in a stock they cover often results in a strong positive bias of their analysts in rating it. Our research shows that for every \"Strong Sell\" recommendation, brokerage firms assign five \"Strong Buy\" recommendations.\nThis means that the interests of these institutions are not always aligned with those of retail investors, giving little insight into the direction of a stock's future price movement. It would therefore be best to use this information to validate your own analysis or a tool that has proven to be highly effective at predicting stock price movements.\nWith an impressive externally audited track record, our proprietary stock rating tool, the Zacks Rank, which classifies stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), is a reliable indicator of a stock's near-term price performance. So, validating the Zacks Rank with ABR could go a long way in making a profitable investment decision.\n\nABR Should Not Be Confused With Zacks Rank In spite of the fact that Zacks Rank and ABR both appear on a scale from 1 to 5, they are two completely different measures.\nThe ABR is calculated solely based on brokerage recommendations and is typically displayed with decimals (example: 1.28). In contrast, the Zacks Rank is a quantitative model allowing investors to harness the power of earnings estimate revisions. It is displayed in whole numbers -- 1 to 5.\n\nStory Continues\nAnalysts employed by brokerage firms have been and continue to be overly optimistic with their recommendations. Since the ratings issued by these analysts are more favorable than their research would support because of the vested interest of their employers, they mislead investors far more often than they guide.\n\nOn the other hand, earnings estimate revisions are at the core of the Zacks Rank. And empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\nIn addition, the different Zacks Rank grades are applied proportionately to all stocks for which brokerage analysts provide current-year earnings estimates. In other words, this tool always maintains a balance among its five ranks.\nAnother key difference between the ABR and Zacks Rank is freshness. The ABR is not necessarily up-to-date when you look at it. But, since brokerage analysts keep revising their earnings estimates to account for a company's changing business trends, and their actions get reflected in the Zacks Rank quickly enough, it is always timely in indicating future price movements.\n\nIs TSM a Good Investment? In terms of earnings estimate revisions for TSMC, the Zacks Consensus Estimate for the current year has declined 0.2% over the past month to $10.13.\nAnalysts' growing pessimism over the company's earnings prospects, as indicated by strong agreement among them in revising EPS estimates lower, could be a legitimate reason for the stock to plunge in the near term.\n\nThe size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #4 (Sell) for TSMC. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>>\nTherefore, it could be wise to take the Buy-equivalent ABR for TSMC with a grain of salt.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nTaiwan Semiconductor Manufacturing Company Ltd. (TSM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:25:16",
      "Source": "24/7 Wall St.",
      "Title": "Nvidia (NASDAQ: NVDA) Stock Price Prediction for 2026: Where Will It Be in 1 Year (Dec 17)",
      "URL": "https://finance.yahoo.com/m/fbc40b68-e691-3ac2-ac6e-c468b91245d1/nvidia-%28nasdaq%3A-nvda%29-stock.html",
      "Content": "Nvidia (NASDAQ: NVDA) Stock Price Prediction for 2026: Where Will It Be in 1 Year (Dec 17)\n\nJoel South\nWed, December 17, 2025 at 6:25 AM PST 7 min read\n\nIn this article: MSFT\n\nNVDA\n\nTM\n\nTOYOF\n\nTSM\n\nShares of Nvidia Corp. ( NASDAQ: NVDA ) have retreated 3.4% in the past week, as it announced the acquisition of SchedMD and a partnership with Mistral AI, and in the wake of the White House approving sales of H200 chips to certain Chinese customers. Meanwhile, insiders continue to sell shares. Nvidia’s stock is 22.8% higher than six months ago, outperforming the S&P 500 and Nasdaq in that time.\n\n24/7 Wall St. Key Points U.S.-China trade relations have presented headwinds, but Nvidia Corp. ( NASDAQ: NVDA ) is also the dominant AI chipmaker in the market, and the company’s profitability remains strong.\nHere is a look at where Nvidia stock could be headed for the rest of this year and into the next.\nIf you’re thinking about retiring or know someone who is, there are three quick questions causing many Americans to realize they can retire earlier than expected. take 5 minutes to learn more here\n\nNote that gains for the chipmaker in that time have helped wipe away the steep drop the stock suffered early in 2025, after it reported it would take a $5.5 billion charge tied to the H20 chip export restrictions to China. While some analysts have raised price targets, others caution about ongoing headwinds due to uncertainty surrounding future U.S.-China trade relations and the potential for stricter regulations. The third-quarter report was stellar on the top and bottom lines due to strong growth in the data center segment.\nDespite its challenges, the company's pivot to U.S. AI infrastructure investments signals resilience. With analysts eyeing robust data center demand, 24/7 Wall St. here explores whether Nvidia can sustain its recovery and drive further growth.\n\nWhy Invest in Nvidia? Nvidia faces significant hurdles as it navigates U.S.-China trade restrictions and intense market expectations. In the first quarter, export controls on its H20 AI chip—which had been designed specifically to circumvent export restrictions on advanced technology to China—led to the substantial write-down noted above. Analysts believed the ban could result in a $9 billion revenue hit. Some $700 million would affect fiscal first-quarter results, with the remaining $8 billion spread across the second and third quarters.\n\nU.S. tariffs and China’s retaliatory measures also threatened supply chain costs, particularly for components sourced globally, while competition from Huawei’s Ascend chips grows. These factors had analysts warning of margin pressure. Yet, Nvidia's profitability remains robust. The company has reportedly raised prices 10% to 15% on some of its most popular GPUs as a result of the tariffs. Gaming processor prices jumped 5% to 10%, while it hiked high-end AI GPUs as much as 15% to account for surging manufacturing costs and to keep its earnings stable.\n\nStory Continues\nYet investments in U.S. AI infrastructure, supported by Taiwan Semiconductor Manufacturing's $165 billion Arizona fab expansion, bolster Nvidia's supply chains and are backed by its $37.6 billion cash reserve.\nCEO Huang announced during his recent trip to South Korea that Nvidia will supply more than 260,000 advanced graphics processing units (GPUs) to South Korean firms, including Samsung and Hyundai Motor. He believes AI has reached a \"virtuous cycle\" where improvements in the models lead to more investment, which in turn leads to further improvement and investment. He also expressed hope that trade talks between the U.S. and China might lead to a change in policy that allows Nvidia to resume sales of state-of-the-art chips in China. As mentioned, the U.S. president has now allowed the company to sell its advanced H200 AI chips to China.\n\nThe AI market is projected to grow at a 37% CAGR through 2030, according to Grand View Research. This supports Nvidia’s $170 billion fiscal 2026 revenue forecast, a 30% increase over the $130.5 billion it generated in 2025.\nNvidia as a Company In its third-quarter earnings report, Nvidia revenue totaled a record $57.01 billion, including $51.2 billion from its data center division. The total was up 66% year over year, largely fueled by the voracious demand for its AI chips.\nThe chipmaker invested $3.2 billion in capital expenditures in fiscal 2025, expanding Blackwell accelerator production and AI infrastructure. The company's capex has spiked over 200% this year to more than $3 billion to meet hyperscaler demand.\n\nU.S.-China trade restrictions still pose risks, even with the seeming thaw, tariffs could raise costs, which would explain the price hikes reportedly implemented. A 36% operating expense increase to $5.8 billion for R&D offset Nvidia's adjusted operating income of $37.8 billion.\nYet, Nvidia's growth is not solely tied to data centers. The company expanded its automotive segment, with a 32% year-over-year increase to $592 million, driven by partnerships with Toyota and Aurora Innovation for autonomous vehicles. This diversifies Nvidia's portfolio amid tariff uncertainties.\nNvidia has projected fiscal third-quarter revenue of $65 billion, plus or minus 2%. This outlook exceeded analysts' consensus projection.\nNvidia as a Stock This has been a rollercoaster year for Nvidia shareholders. The stock dropped to a 52-week low of $86.62 in April. After an announced pause in U.S.-China tariffs and the first-quarter results, the share price recovered. It hit an all-time high of $212.19 in October, which had the company's market cap briefly over $5 trillion.\n\nWhile some insiders have been selling shares, analyst sentiment remains bullish. Of 64 analysts who cover the stock, 60 recommend buying shares, 11 of them with Strong Buy ratings. Their consensus one-year price target is $250.93, which signals over 41% upside potential from its current price. Targets range from $140 to $352 per share.\nCitigroup, J.P. Morgan, Morgan Stanley, and others recently maintained their Buy-equivalent ratings. Evercore ISI has the street-high target price. It cited accelerating revenue growth, strong demand for Blackwell chips, an improving supply chain, and a significant pipeline. Yet, renowned investor Michael Burry is bearish on Nvidia.\nEstimate\nPrice Target\nChange From Current Price\nLow\n$140.00\n−21.2%\nMedian\n$250.93\n41.2%\nHigh\n$352.00\n98.1%\n\nNvidia's AI dominance, 93% data center growth, and automotive partnerships with Toyota positioned the company for gains in 2025. However, tariff risks and DeepSeek’s competitive AI models require caution. The AI market's growth and the chipmaker's $47 billion second-quarter revenue position Nvidia to achieve its $170 billion full-year revenue target, while its cash buffer and Stargate Project role offer stability. Still, valuation concerns linger. Nvidia is a buy for growth-oriented investors, but others should use caution.\n\n24/7 Wall St.'s 2026 year-end price target for Nvidia is $300.14 per share, which would be a 68.9% gain. That estimate accounts for tariff risks, competition from DeepSeek, and potential Blackwell supply constraints. It also reflects Nvidia's AI dominance and second-quarter 2026 revenue guidance.\nTime to Sell Nvidia Stock as Michael Burry Takes Aim?\n\nData Shows One Habit Doubles American’s Savings And Boosts Retirement Most Americans drastically underestimate how much they need to retire and overestimate how prepared they are. But data shows that people with one habit have more than double the savings of those who don’t.\nAnd no, it’s got nothing to do with increasing your income, savings, clipping coupons, or even cutting back on your lifestyle. It’s much more straightforward (and powerful) than any of that. Frankly, it’s shocking more people don’t adopt the habit given how easy it is .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "07:39:00",
      "Source": "MarketBeat",
      "Title": "Why Taiwan Semiconductor's 6.5% Dip Could Be a Smart Buy",
      "URL": "https://finance.yahoo.com/m/bfaa1f3c-f741-3107-8edc-8b9fe91b136a/why-taiwan-semiconductor%27s.html",
      "Content": "Why Taiwan Semiconductor's 6.5% Dip Could Be a Smart Buy\n\nJeffrey Neal Johnson, MarketBeat\nTue, December 16, 2025 at 3:39 PM PST 6 min read\n\nIn this article: TSM\n\nAAPL\n\nTSMWF\n\nKey Points TSMC saw a discrepancy between seasonal inventory adjustments and massive YOY growth, which triggered a compelling entry point for long-term investors.\nHigh-performance computing has overtaken mobile as the primary revenue driver for the company, signaling a permanent shift toward structural growth in AI.\nManagement has signaled strong confidence in future cash flows by pre-announcing a dividend increase, underscoring the durability of the business model.\nInterested in Taiwan Semiconductor Manufacturing Company Ltd.? Here are five stocks we like better.\n\nThe stock market is often described as a weighing machine in the long run, but a voting machine in the short run. In today's high-speed trading environment, that voting machine is frequently run by algorithms that react instantly to headlines, often without understanding the context.\nThis dynamic appears to be the primary driver behind the recent movement in Taiwan Semiconductor Manufacturing (NYSE: TSM) (TSMC). Following the release of the company's November revenue report on Dec. 10, the stock has pulled back approximately 6%, currently trading near the $287 level.\n→ Rivian’s Autonomy Bombshell Changes Everything—Even Its Valuation\nThe trigger for this sell-off was a specific data point from the revenue report: November revenue declined 6.5% from October, coming in at approximately 343.61 billion New Taiwan dollars (NT$), or roughly $10.93 billion.\n\nTo a computer program or a nervous day trader, a month-over-month drop looks like a warning that momentum is slowing.\n→ ServiceNow’s $7 Billion Gamble: Panic or Opportunity?\nHowever, for a rational investor willing to look past the daily volatility, the picture is entirely different. While the monthly number dipped, the year-over-year (YOY) performance tells the real story. Compared to November 2024, revenue surged by an impressive 24.5%.\nThis divergence between short-term trading signals and long-term fundamentals has created a potential disconnect between TSMC’s stock price and its true strength. The miss that the market is worried about is likely a false alarm, while the long-term growth story remains one of the strongest in the technology sector.\n\n→ 3 Companies Turning Big Cash Flow Into Bigger Shareholder Gains\nDoing the Math: Why the Miss Is a Myth To understand why the recent selling is irrational, investors simply need to perform a basic check of the company’s own financial guidance. On the previous earnings call, management projected fourth-quarter revenue to range from $32.2 billion to $33.4 billion. In local currency, this translates to approximately NT$1 trillion.\n\nStory Continues\nWe now have two-thirds of the data for the quarter, and the math is overwhelmingly positive.\nOctober Performance: The company posted record-breaking revenue.\nNovember Performance: Despite the dip, the company brought in NT$343.61 billion (approximately $10.93 billion).\nThe Running Total: The combined revenue for October and November stands at NT$711.09 billion (approximately $22.64 billion).\n\nThis total puts TSMC in a commanding position heading into year-end. To hit the upper end of their guidance range, the company only needs to generate roughly NT$300 billion (about $9.55 billion) in December.\nContext is key here. TSMC has consistently posted monthly revenue well above NT$300 billion (roughly $9.55 billion) in recent months. Therefore, hitting the top end of the guidance, or even beating it, is not just possible; it is probable. The miss in November was not a sign of failure. It was simply a mathematical result of October being a tough act to follow.\nStructural vs. Seasonal: The Two Engines of Growth If the company is on track, why did revenue drop from October to November? The answer lies in understanding the difference between seasonal cycles and structural growth.\nTSMC powers two main ecosystems: consumer electronics (smartphones/PCs) and high-performance computing (AI data centers).\nThe Seasonal Engine (Smartphones): This sector is dictated by the calendar. Companies like Apple (NASDAQ: AAPL) rush to stock up on chips in September and October to ensure they have enough iPhones for the holiday shopping season. By November, that inventory build-up naturally cools down. The 6.5% monthly decline is likely just a reflection of this normal seasonal pattern.\nThe Structural Engine (AI): This sector is driven by a technological revolution. Data centers are being built and upgraded year-round, regardless of holiday shopping trends.\n\nIn the third-quarter earnings report, TSMC revealed a critical shift: High-Performance Computing (HPC) now accounts for 57% of total revenue. This means the AI engine is now larger and more important than the smartphone engine. While the mobile market wobbles with the seasons, the AI market is accelerating structurally. The dominant revenue driver is no longer the phone in a consumer's pocket, but the massive server farms powering the future of the global economy.\nA Dividend Signal You Can't Ignore Revenue figures tell us what happened in the past, but dividends tell us what management expects for the future. In the semiconductor industry, building factories is costly. When companies fear a downturn, they hoard cash to protect their balance sheets. They almost never promise to pay shareholders more.\n\nTSMC is sending a very different signal. The stock recently traded ex-dividend on Dec. 11, but the real news is the forward outlook. Management has signaled an intention to increase the dividend to approximately 97 cents per share, payable in April 2026.\nThis pre-announced hike is a definitive vote of confidence. It suggests that the executives who see the internal order books expect strong, sustainable cash flows to continue well into next year.\nFrom a valuation standpoint, the recent pullback has created a window of opportunity. The stock is currently trading at a price-to-earnings ratio (P/E) of approximately 29.5.\nGross Margins: 59.5% (The company keeps nearly 60 cents of profit on every dollar of sales).\nRevenue Growth: Exceeding 30% year-to-date.\n\nTypically, high-growth monopolies with margins this high command a premium valuation significantly higher than 30 times earnings. The current price reflects a rare disparity between the stock's price and the quality of the business.\nOpportunity Knocks: A Tactical Entry Point The stock market's reaction to the November revenue report appears to be a classic case of short-term thinking overpowering long-term analysis. The 6.5% monthly drop is a backward-looking, seasonal blip. The 24.5% YOY growth is the forward-looking reality.\nFor investors, this disconnect offers a clear tactical advantage. The stock is currently trading near $287. This is significantly below the average analyst price target of $355, suggesting a potential upside of more than 23%.\nThe AI supercycle is not stalling; it is maturing. TSMC remains the toll road for that growth. For those looking to add exposure to the world's most important manufacturing company, this seasonal dip represents a compelling entry point.\nThe article \" Why Taiwan Semiconductor's 6.5% Dip Could Be a Smart Buy \" was originally published by MarketBeat.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "04:10:00",
      "Source": "Motley Fool",
      "Title": "This AI Chip Stock Could Be the Real Winner as Data Center Demand Explodes in 2026",
      "URL": "https://finance.yahoo.com/m/44024ba4-94cd-3322-aca4-b07aa90fdf28/this-ai-chip-stock-could-be.html",
      "Content": "This AI Chip Stock Could Be the Real Winner as Data Center Demand Explodes in 2026\n\nStefon Walters, The Motley Fool\nTue, December 16, 2025 at 12:10 PM PST 5 min read\n\nIn this article: TSM\n\nNVDA\n\nKey Points Spending on data centers is expected to increase by billions in the coming years.\nTSMC is the go-to company for manufacturing advanced AI chips used in data centers.\nIts stock is reasonably priced compared to top artificial intelligence chip designers.\n10 stocks we like better than Taiwan Semiconductor Manufacturing ›\n\nIf you said that artificial intelligence (AI) has taken the tech world by storm, you'd probably be underselling it. It seems it has consumed every tech-related conversation and caused pivots for many companies in the industry.\nThe AI boom has been multifaceted. You have consumer-facing applications like ChatGPT that have driven much of its mainstream popularity, massive investments in data centers and cloud infrastructure, and high-performance hardware companies like Nvidia that supply many critical pieces that power data centers.\nThe data center portion of it seems to be on the earlier end of what many are expecting (or, rather, hoping) it can be. Many companies -- especially hyperscalers like Alphabet , Amazon , and Microsoft -- have committed to spending billions to build them out in the next year and beyond.\nAlthough there are many moving parts to these anticipated data center build-outs, one company in particular stands to gain a lot: Taiwan Semiconductor Manufacturing (NYSE: TSM) , also known as TSMC. Here's why.\nThe importance of data centers in AI For AI to work on the scale we see today, it must be trained on tons of data -- and that's putting it lightly. This data can't be stored in traditional ways, either. It must be stored in data centers that can process massive amounts of information at high speeds and supply the electricity that's needed to power them 24/7. Some estimates say an AI query uses 10 times as much electricity as a standard Google search.\n\nData centers' importance to training and scaling AI is why we've seen an explosion in spending related to them. Nvidia's CEO, Jensen Huang, has said that he anticipates companies spending $3 trillion to $4 trillion by 2030 on building out this AI infrastructure. This spending should trickle down, and at the beginning of the AI supply chain, TSMC will be waiting.\nWhy TSMC stands out as the real potential winner Companies like Nvidia, Advanced Micro Devices , Alphabet, and Amazon design the AI chips used in data centers. However, every single one of them relies on TSMC to manufacture the chips and bring them to life. If we're using cars as a comparison, those companies are the designers and brands, but TSMC is the factory that actually builds the engines.\n\nStory Continues\nThere's a good reason for that, too. No company compares to TSMC's efficiency and scale, which is why its market share on advanced AI chips is well into the upper-90% range. Samsung and Intel both manufacture chips, but neither comes close to TSMC.\nThe reliance on TSMC for its AI chip manufacturing has also begun to show in its financials. In the third quarter, high-performance computing (HPC) accounted for 57% of TSMC's $33.1 billion in revenue. Three years ago, in Q3 2022, HPC was only 39% of TSMC's revenue.\n\nBefore HPC, smartphones accounted for most of TSMC's revenue. This new shift in demand works in TSMC's favor because smartphones tend to be more about consumer upgrade cycles, while AI chips are poised to be sustained investments.\nPlaying into the hands of the electricity-conscious tech companies TSMC's moat is already wide, but one thing that's furthering its advantage is that its chips are not only faster, but also more power-efficient. Its new A14 manufacturing process is expected to produce chips that are 15% faster and use 30% less power. That should be music to data center operators' ears because it could noticeably reduce energy consumption.\n\nAside from the original build-out, maintaining a data center costs companies millions annually. Being able to run it with more power-efficient chips could mean meaningful savings.\nTSMC seems to be fairly priced For a company operating in a virtual monopoly, TSMC's stock isn't as expensive as one might expect it to be. At the time of this writing, it's trading at 28 times its projected earnings over the next 12 months. That's much cheaper than companies like Nvidia, AMD, and Broadcom , while still delivering strong earnings growth.\nThere's no doubt that TSMC stands to gain from the projected data center build-outs. However, even if plans change (such as companies reducing their anticipated spending), TSMC remains a great investment because its business is vital to virtually all technology, not just the AI boom. It's a stock I personally plan to hold for the long haul.\n\nShould you buy stock in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $505,695 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,080,694 !*\nNow, it’s worth noting Stock Advisor’s total average return is 962 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nStefon Walters has positions in Microsoft and Taiwan Semiconductor Manufacturing. The Motley Fool has positions in and recommends Alphabet, Amazon, Intel, Microsoft, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nThis AI Chip Stock Could Be the Real Winner as Data Center Demand Explodes in 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "04:06:25",
      "Source": "Simply Wall St.",
      "Title": "How Investors May Respond To KLA (KLAC) Analyst Upgrades Tied To AI‑Driven Chipmaking Demand",
      "URL": "https://finance.yahoo.com/news/investors-may-respond-kla-klac-200625876.html",
      "Content": "How Investors May Respond To KLA (KLAC) Analyst Upgrades Tied To AI‑Driven Chipmaking Demand\n\nSimply Wall St\nTue, December 16, 2025 at 12:06 PM PST 3 min read\n\nIn this article: KLAC\n\nTSM\n\nIn recent days, KLA has attracted a wave of analyst upgrades and bullish research highlighting its leadership in process control and advanced packaging for AI and high‑bandwidth memory manufacturing. These views build on KLA’s strong cash generation and capital returns, as well as industry forecasts for higher wafer fab equipment spending supported by leading customers like TSMC and DRAM makers.\nWhat stands out is how multiple firms now frame KLA as a critical enabler of the AI infrastructure buildout, with its tools becoming more essential as chip designs grow more complex and process control intensity rises across both leading‑edge logic and memory fabs.\nNext, we’ll examine how this growing analyst conviction around AI‑driven semiconductor equipment demand could influence KLA’s existing investment narrative.\n\nThe end of cancer? These 29 emerging AI stocks are developing tech that will allow early identification of life changing diseases like cancer and Alzheimer's.\nKLA Investment Narrative Recap To own KLA, you need to believe that AI, high‑bandwidth memory and advanced packaging will keep pushing process control spending higher, and that KLA can defend its margin profile despite tariffs, export controls and rising R&D. The recent wave of analyst upgrades reinforces AI as the key near term catalyst but does not materially change the biggest risk, which remains potential disruption or slower spending in major markets such as China.\n\nJefferies’ upgrade to Buy with a US$1,500 price target, tied to expectations for an AI driven wafer fab equipment uplift from the second half of 2026, directly connects to KLA’s exposure to leading edge logic, memory and advanced packaging. That call, alongside Morgan Stanley’s steady but rising WFE forecasts and KLA’s record US$1,066.0 million quarterly cash flow, supports the view that AI infrastructure spending could offset some volatility from normalizing backlogs and more cyclical demand.\nYet behind this optimism, investors should be aware that KLA’s heavy reliance on AI linked capex could become a vulnerability if...\nRead the full narrative on KLA (it's free!)\nKLA's narrative projects $14.8 billion revenue and $5.3 billion earnings by 2028.\n\nUncover how KLA's forecasts yield a $1297 fair value , a 6% upside to its current price.\nExploring Other Perspectives Six fair value estimates from the Simply Wall St Community span roughly US$633 to US$1,297 per share, showing how far apart individual views can be. Against this, KLA’s dependence on sustained AI and advanced packaging capex highlights why it may help to compare several of these perspectives before deciding how its growth story fits into your own expectations.\n\nStory Continues\nExplore 6 other fair value estimates on KLA - why the stock might be worth 48% less than the current price!\nBuild Your Own KLA Narrative Disagree with existing narratives? Create your own in under 3 minutes - extraordinary investment returns rarely come from following the herd.\nA great starting point for your KLA research is our analysis highlighting 2 key rewards that could impact your investment decision.\nOur free KLA research report provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate KLA's overall financial health at a glance.\n\nSeeking Other Investments? Markets shift fast. These stocks won't stay hidden for long. Get the list while it matters:\nFind companies with promising cash flow potential yet trading below their fair value .\nThese 10 companies survived and thrived after COVID and have the right ingredients to survive Trump's tariffs . Discover why before your portfolio feels the trade war pinch.\nOutshine the giants: these 25 early-stage AI stocks could fund your retirement .\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include KLAC .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "02:44:59",
      "Source": "Insider Monkey",
      "Title": "Why is Taiwan Semiconductor (TSM) One of the Most Profitable NYSE Stocks to Buy Right Now?",
      "URL": "https://finance.yahoo.com/news/why-taiwan-semiconductor-tsm-one-184459827.html",
      "Content": "Why is Taiwan Semiconductor (TSM) One of the Most Profitable NYSE Stocks to Buy Right Now?\n\nNoor Ul Ain Rehman\nTue, December 16, 2025 at 10:44 AM PST 2 min read\n\nIn this article: TSM\n\nTSMWF\n\nTaiwan Semiconductor Manufacturing Company Limited (NYSE: TSM ) is one of the most profitable NYSE stocks to buy right now . Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) received a rating update from Bank of America Securities analyst Mike Yang on December 10, who reaffirmed a Buy rating on the stock and set a $390 price target.\nThe rating update came the same day Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) reported its November 2025 revenue report. Revenue for November 2025 on a consolidated basis reached around NT$343.61 billion, reflecting a drop of 6.5% from October 2025 and an increase of 24.5% compared to November 2024.\n\nManagement further reported that revenue for January through November of 2025 reached a total of NT$3,474.05 billion, which translates to a growth of 32.8% compared to the same period in 2024.\nFor reference, Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) reported consolidated revenue of NT$989.92 billion in its fiscal Q3 2025 results, along with a net income of NT$452.30 billion, and diluted earnings per share of NT$17.44. Year-over-year fiscal Q3 revenue rose 30.3%, while net income and diluted EPS grew 39.1% and 39.0%, respectively. Fiscal Q3 2025 results reflected a 6.0% increase in revenue and a 13.6% increase in net income compared to fiscal Q2 2025. Q3 revenue in US dollars was $33.10 billion, up 40.8% year-over-year and up 10.1% compared to the previous quarter.\n\nTaiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) is the largest contract semiconductor manufacturer in the world. Some of its prominent customers include semiconductor companies that outsource all or part of their chip production, including Advanced Micro Devices, Nvidia, Broadcom, and more.\nWhile we acknowledge the potential of TSM as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "23:29:03",
      "Source": "Reuters",
      "Title": "AI boom seen lifting chipmaking equipment sales 9% to $126 billion in 2026",
      "URL": "https://finance.yahoo.com/news/ai-boom-seen-lifting-chipmaking-152903092.html",
      "Content": "AI boom seen lifting chipmaking equipment sales 9% to $126 billion in 2026\n\nReuters\nTue, December 16, 2025 at 7:29 AM PST 1 min read\n\nIn this article: TSM\n\nKLAC\n\nASML\n\nSSNLF\n\n000660.KS\n\nAMSTERDAM, Dec 16 (Reuters) - Sales of equipment used to make computer chip wafers ​will rise about 9% to $126 billion ‌in 2026 and a further 7.3% to $135 billion in ‌2027, as chipmakers expand capacity for logic and memory chips used in artificial intelligence , industry group SEMI forecast on Tuesday.\n\nMost chips are ⁠made in Asia, ‌and SEMI expects China, Taiwan and South Korea to remain the top ‍markets for equipment through 2027, with China investing the most overall.\nTaiwan, home to top chipmaker TSMC ( TSM ), ​will expand leading-edge capacity, while South ‌Korea, home to Samsung ( 005930.KS ) and SK Hynix ( 000660.KS ), is investing in advanced memory chips used for AI.\n\n\"All other regions tracked are (also) expected to see equipment spending increase in 2026 and ⁠2027, supported by government ​incentives, regionalization efforts and ​targeted specialty capacity expansions,\" SEMI said.\n\nSign up for Yahoo Finance's Week in Tech\n\nBy subscribing, you are agreeing to Yahoo's\n\nTerms\n\nand\n\nPrivacy Policy\n\nSubscribe\nThe biggest supplier of chip equipment, ASML ‍of the Netherlands, ⁠accounts for about a quarter of sales. Other top firms include Applied Materials ( AMAT ), ⁠KLA Corp ( KLAC ) and Lam Research ( LRCX ) of the U.S., ‌and Japan’s Tokyo Electron.\n(Reporting by Toby ‌SterlingEditing by Mark Potter)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "20:23:36",
      "Source": "Insider Monkey",
      "Title": "Taiwan Semiconductor Manufacturing Company Limited (TSM) Surged on Strong Market Sentiment",
      "URL": "https://finance.yahoo.com/news/taiwan-semiconductor-manufacturing-company-limited-122336171.html",
      "Content": "Taiwan Semiconductor Manufacturing Company Limited (TSM) Surged on Strong Market Sentiment\n\nSoumya Eswaran\nTue, December 16, 2025 at 4:23 AM PST 3 min read\n\nIn this article: TSM\n\nTSMWF\n\nMagellan Asset Management , an investment management company, released the third quarter 2025 investor letter for “Magellan Global Fund”. A copy of the letter can be downloaded here . The fund focuses on outstanding companies at attractive prices and, at the same time, leverages a deep understanding of the macroeconomic landscape to manage risk. As measured by the MSCI World Index in USD, the global equities rose 7.3% in the September quarter. The portfolio underperformed the index in the quarter due strong performance of more speculative companies in the risk-on environment. In addition, please check the fund’s top five holdings to know its best picks in 2025.\n\nIn its third-quarter 2025 investor letter, Magellan Global Fund highlighted stocks such as Taiwan Semiconductor Manufacturing Company Limited (NYSE: TSM ). Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) manufactures, packages, tests, and sells integrated circuits and other semiconductor devices. The one-month return for Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) was 3.54%, and its shares gained 43.40% over the last 52 weeks. On December 15, 2025, Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) stock closed at $287.74 per share, with a market capitalization of $1.492 trillion.\nMagellan Global Fund stated the following regarding Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) in its third quarter 2025 investor letter:\nTaiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) is in 9th position on our list of 30 Most Popular Stocks Among Hedge Funds . As per our database, 194 hedge fund portfolios held Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) at the end of the third quarter, compared to 187 in the previous quarter. In the third quarter of 2025, Taiwan Semiconductor Manufacturing Company Limited’s (NYSE:TSM) revenue increased 6% sequentially in NT. While we acknowledge the potential of Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\n\nStory Continues\nIn another article , we covered Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) and shared Janus Henderson Forty Fund's views on the company. In addition, please check out our hedge fund investor letters Q3 2025 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "08:15:19",
      "Source": "Simply Wall St.",
      "Title": "Does TSMC’s AI Chip Surge Still Offer Value After Its Massive Multi Year Rally?",
      "URL": "https://finance.yahoo.com/news/does-tsmc-ai-chip-surge-001519939.html",
      "Content": "Does TSMC’s AI Chip Surge Still Offer Value After Its Massive Multi Year Rally?\n\nSimply Wall St\nMon, December 15, 2025 at 4:15 PM PST 5 min read\n\nIn this article: TSM\n\nTSMWF\n\nWondering if Taiwan Semiconductor Manufacturing is still a smart buy after its massive run, or if the easy money has already been made? You are not alone, and that is exactly what this breakdown is going to unpack.\nThe stock has cooled off slightly in the last week with a -4.7% move, but it is still up 1.0% over 30 days, 42.7% year to date and 43.8% over the past year, with a 292.2% gain over three years and 193.1% over five years.\nThose moves have come as TSM has cemented its role as the go-to manufacturer for leading-edge chips used in AI data centers, smartphones and high-performance computing, while global demand for advanced semiconductors has stayed robust despite macro uncertainty. Investors are also paying close attention to ongoing US-China tech tensions and TSM's progress on new fabs in the US and Japan, which both add excitement and new execution risks to the story.\nOn our valuation checks, Taiwan Semiconductor Manufacturing scores a 3/6 valuation score , suggesting it looks undervalued on some metrics but not all, which makes it a useful case for comparing different valuation approaches and, later on, exploring a more complete way to think about its worth.\n\nTaiwan Semiconductor Manufacturing delivered 43.8% returns over the last year. See how this stacks up to the rest of the Semiconductor industry.\nApproach 1: Taiwan Semiconductor Manufacturing Discounted Cash Flow (DCF) Analysis A Discounted Cash Flow model estimates what a business is worth today by projecting the cash it can generate in the future and discounting those cash flows back to the present. For Taiwan Semiconductor Manufacturing, the model uses a 2 stage Free Cash Flow to Equity approach based on cash flow projections.\n\nThe latest twelve month free cash flow is about NT$802.4 Billion, and analysts expect this to keep growing as demand for advanced chips remains strong. By 2029, free cash flow is projected to reach roughly NT$2.4 Trillion, with further gains extrapolated by Simply Wall St out to 2035 as growth gradually slows from today’s elevated levels.\nWhen all these future cash flows are discounted back to today, the model arrives at an intrinsic value of about $216.49 per share. Compared with the current share price, this implies the stock is around 32.9% overvalued on a pure cash flow basis, suggesting a lot of optimism is already priced in.\nResult: OVERVALUED\nOur Discounted Cash Flow (DCF) analysis suggests Taiwan Semiconductor Manufacturing may be overvalued by 32.9%. Discover 908 undervalued stocks or create your own screener to find better value opportunities.\n\nStory Continues\nHead to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for Taiwan Semiconductor Manufacturing.\nApproach 2: Taiwan Semiconductor Manufacturing Price vs Earnings For a mature, consistently profitable business like Taiwan Semiconductor Manufacturing, the price to earnings, or PE, ratio is a useful way to gauge what investors are willing to pay for each dollar of current earnings. In general, companies with faster and more reliable earnings growth, and lower perceived risk, tend to justify a higher PE, while slower growth or greater uncertainty usually calls for a lower, more conservative multiple.\n\nTSM currently trades on a PE of about 23.9x, well below both the semiconductor industry average of roughly 37.0x and the broader peer group average of around 60.8x. On the surface, that discount might suggest the stock is attractively priced, but simple comparisons can be misleading because they ignore company specific factors like growth outlook, margins and risk profile.\nTo address this, Simply Wall St uses a proprietary Fair Ratio, which estimates what a more appropriate multiple should be after considering TSM’s earnings growth, profitability, industry, market cap and risk factors. For TSM, this Fair Ratio is 37.6x, materially above the current 23.9x. This indicates that, given its fundamentals, the market may not be fully recognizing its earnings power.\nResult: UNDERVALUED\nPE ratios tell one story, but what if the real opportunity lies elsewhere? Discover 1447 companies where insiders are betting big on explosive growth .\nUpgrade Your Decision Making: Choose your Taiwan Semiconductor Manufacturing Narrative Earlier we mentioned that there is an even better way to understand valuation. On Simply Wall St this takes the form of Narratives, which are simple, story driven snapshots where investors connect their view of a company’s future revenue, earnings and margins to a financial forecast, and then to a Fair Value that can be compared against today’s share price to decide whether to buy, hold or sell. Narratives are available on the Community page and are designed to be easy and accessible. They dynamically update as new information like earnings, guidance or major news comes in. For Taiwan Semiconductor Manufacturing, for example, one optimistic Narrative might assume rapid AI driven growth, resilient margins and a Fair Value of around $310 per share. A more cautious Narrative could factor in geopolitical risk, margin pressure from overseas fabs and a much lower Fair Value. By comparing where price sits relative to each Narrative’s Fair Value, you can quickly see which story you believe and what that implies for your next move.\nDo you think there's more to the story for Taiwan Semiconductor Manufacturing? Head over to our Community to see what others are saying!\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include TSM .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "05:17:17",
      "Source": "Investor's Business Daily",
      "Title": "Nvidia Reportedly Seeing High Demand From China For H200 AI Chips",
      "URL": "https://finance.yahoo.com/m/8ae748d1-7ab4-38f4-8019-b2a0eda5d63f/nvidia-reportedly-seeing-high.html",
      "Content": "Nvidia Reportedly Seeing High Demand From China For H200 AI Chips\n\nPATRICK SEITZ\nMon, December 15, 2025 at 1:17 PM PST 1 min read\n\nIn this article: NVDA\n\nTSM\n\nBABA\n\nNvidia reportedly is seeing strong interest in the artificial intelligence chip giant's H200 AI processors from customers in China after President Donald Trump last week moved to ease trade restrictions. Nvidia stock rose Monday. Nvidia is considering adding production capacity for H200 chips as orders are exceeding current output levels, Reuters reported.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 18
}