{
  "stock_id": "TSM",
  "last_updated": "2025-12-17T17:12:31.722Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-17",
      "Time": "23:00:00",
      "Source": "PR Newswire",
      "Title": "EMASS Pushes the Edge Further with 16nm ECS-DoT",
      "URL": "https://finance.yahoo.com/news/emass-pushes-edge-further-16nm-150000178.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nEMASS Pushes the Edge Further with 16nm ECS-DoT\n\nPR Newswire\nWed, December 17, 2025 at 7:00 AM PST 4 min read\n\nIn this article: NNVUF\n\nTSM\n\nNext-generation ultra-low-power Edge AI SoC for always-on intelligence\nLOS ANGELES , Dec. 17, 2025 /PRNewswire/ -- EMASS, a Nanoveu subsidiary with next-generation semiconductor technology, today announced that its next-generation ECS-DoT SoC built on a 16nm process node has entered the final phases of development, headed toward graphic data system (GDS) sign-off, tape-out and fabrication at TSMC. This new device builds on EMASS's existing 22nm ECS-DoT offering and strengthens the company's leadership in ultra-low-power Edge AI by extending always-on intelligence into more demanding and highly integrated applications.\n\nThe new 16nm ECS-DoT builds on the 22nm's performance, energy consumption, compute capability and on-chip resources, while preserving the architectural concepts, developer workflow and ultra-low-power mission that define the ECS-DoT family. It continues to advance edge technology by integrating an on-chip Bluetooth Low Energy (BLE) subsystem, expanding on-chip SRAM with a new power management system and AI and processing acceleration enhancements.\n\"With the 16nm ECS-DoT, we reach a defining moment for EMASS as we scale our architecture into new classes of applications demanding more intelligence, more speed and even lower power,\" said Mark Goranson, CEO of EMASS. \"By migrating to 16nm, we've unlocked all new use-cases and identities that allow customers to push machine learning to the absolute edge, without sacrificing battery life or form-factor constraints.\"\n\nEnabling the Next Stage of Edge Intelligence\nThe 16nm ECS-DoT advances EMASS's edge AI capabilities through higher integration, expanded on-chip resources and improved power efficiency, enabling more capable always-on intelligence without increasing system complexity or energy demand. Key enhancements include:\nFully integrated BLE subsystem — Eliminates the need for external wireless ICs, reducing board area, bill-of-materials cost and design complexity.\nExpanded on-chip memory — Supports larger AI models and higher-throughput workloads while minimizing off-chip memory access for improved efficiency.\nAdaptive fine-grained power-management architecture — Optimizes energy use for always-on, battery-powered and energy-harvesting applications.\nDedicated object-detection accelerator — Offloads vision workloads to increase throughput and reduce inference latency for edge vision use cases.\nIntegrated floating-point unit (FP16/FP32) — Accelerates DSP and mixed-precision AI workflows while simplifying developer toolchains and code migration.\n\nWeiterlesen\nSeamless Upgrade Path for Developers\nThe new SoC maintains complete software and workflow compatibility with the current ECS-DoT family. This allows developers to deploy applications on either the 22nm or 16nm version with minimal redesign, while supporting larger and more demanding workloads without compromising ultra-low-power operation.\n\nStrengthening EMASS's \"Atoms-to-Apps\" Vision\nThe 16nm ECS-DoT also advances EMASS's \"Atoms-to-Apps\" methodology, connecting application requirements, algorithm design, silicon architecture and real-world deployment into a unified development philosophy.\n\"This next generation of ECS-DoT represents a significant architectural advance for EMASS, bringing together always-on intelligence, deeper on-chip resources and higher levels of integration within a single ultra-low-power Edge AI platform,\" said Dr. Mohamed Sabry, founder and CTO of EMASS. \"By extending our architecture to support more demanding workloads without sacrificing energy efficiency, we are strengthening EMASS's leadership in ultra-low-power Edge AI and expanding what's possible at the edge for our partners and customers.\"\n\nAbout EMASS\nEMASS – a subsidiary of Nanoveu Ltd (ASX: NVU) – is an advanced semiconductor company specializing in ultra-low-power AI system-on-chip (SoC) solutions for edge computing. The company's flagship ECS-DoT chip delivers high-performance AI processing for vision, audio, and sensor data directly on-device, maximizing energy efficiency through its RISC-V architecture and non-volatile memory technologies. This always-on intelligence solution is optimized for power- and space-constrained applications including drones, wearables, healthcare devices and industrial IoT systems. For more information, visit nanoveu.com/emass .\nAbout Nanoveu\nNanoveu is a listed company advancing human–machine experiences at the edge through a portfolio that spans ultra-low-power AI and glasses-free 3D technologies. Its subsidiary EMASS designs advanced system-on-chip (SoC) solutions that deliver efficient, scalable on-device AI for smart devices, IoT applications and 3D content transformation – enhancing Nanoveu's reach across rapidly growing AI, edge computing and 3D content markets. EyeFly3D™ is Nanoveu's end-to-end platform for glasses-free 3D, uniting proprietary screen technology with sophisticated content processing software and, now, EMASS's ultra-low-power SoC to bring immersive 3D to a wide range of devices and industries. The Company also develops and markets an advanced range of self-disinfecting and hydrophobic films and coatings under the Nanoshield™ brand, designed for applications including large-scale CSP and photovoltaic solar installations. Together, Nanoveu's businesses deliver practical innovation that makes devices smarter, environments safer and experiences more immersive.\nMedia Contact\nBryar Keyes\nBryar.Keyes@publitek.com\n+1 (503) 358-9597\nView original content: https://www.prnewswire.com/news-releases/emass-pushes-the-edge-further-with-16nm-ecs-dot-302644081.html\n\nAGB und Datenschutzerklärung\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:30:07",
      "Source": "Zacks",
      "Title": "Brokers Suggest Investing in TSMC (TSM): Read This Before Placing a Bet",
      "URL": "https://finance.yahoo.com/news/brokers-suggest-investing-tsmc-tsm-143007380.html",
      "Content": "Brokers Suggest Investing in TSMC (TSM): Read This Before Placing a Bet\n\nZacks Equity Research\nWed, December 17, 2025 at 6:30 AM PST 4 min read\n\nIn this article: TSM\n\nTSMWF\n\nWhen deciding whether to buy, sell, or hold a stock, investors often rely on analyst recommendations. Media reports about rating changes by these brokerage-firm-employed (or sell-side) analysts often influence a stock's price, but are they really important?\nBefore we discuss the reliability of brokerage recommendations and how to use them to your advantage, let's see what these Wall Street heavyweights think about TSMC (TSM).\n\nTSMC currently has an average brokerage recommendation (ABR) of 1.38, on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell, etc.) made by 13 brokerage firms. An ABR of 1.38 approximates between Strong Buy and Buy.\nOf the 13 recommendations that derive the current ABR, 10 are Strong Buy and one is Buy. Strong Buy and Buy respectively account for 76.9% and 7.7% of all recommendations.\nBrokerage Recommendation Trends for TSM Check price target & stock forecast for TSMC here>>>\nThe ABR suggests buying TSMC, but making an investment decision solely on the basis of this information might not be a good idea. According to several studies, brokerage recommendations have little to no success guiding investors to choose stocks with the most potential for price appreciation.\n\nAre you wondering why? The vested interest of brokerage firms in a stock they cover often results in a strong positive bias of their analysts in rating it. Our research shows that for every \"Strong Sell\" recommendation, brokerage firms assign five \"Strong Buy\" recommendations.\nThis means that the interests of these institutions are not always aligned with those of retail investors, giving little insight into the direction of a stock's future price movement. It would therefore be best to use this information to validate your own analysis or a tool that has proven to be highly effective at predicting stock price movements.\nWith an impressive externally audited track record, our proprietary stock rating tool, the Zacks Rank, which classifies stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), is a reliable indicator of a stock's near-term price performance. So, validating the Zacks Rank with ABR could go a long way in making a profitable investment decision.\n\nABR Should Not Be Confused With Zacks Rank In spite of the fact that Zacks Rank and ABR both appear on a scale from 1 to 5, they are two completely different measures.\nThe ABR is calculated solely based on brokerage recommendations and is typically displayed with decimals (example: 1.28). In contrast, the Zacks Rank is a quantitative model allowing investors to harness the power of earnings estimate revisions. It is displayed in whole numbers -- 1 to 5.\n\nStory continues\nAnalysts employed by brokerage firms have been and continue to be overly optimistic with their recommendations. Since the ratings issued by these analysts are more favorable than their research would support because of the vested interest of their employers, they mislead investors far more often than they guide.\n\nOn the other hand, earnings estimate revisions are at the core of the Zacks Rank. And empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\nIn addition, the different Zacks Rank grades are applied proportionately to all stocks for which brokerage analysts provide current-year earnings estimates. In other words, this tool always maintains a balance among its five ranks.\nAnother key difference between the ABR and Zacks Rank is freshness. The ABR is not necessarily up-to-date when you look at it. But, since brokerage analysts keep revising their earnings estimates to account for a company's changing business trends, and their actions get reflected in the Zacks Rank quickly enough, it is always timely in indicating future price movements.\n\nIs TSM a Good Investment? In terms of earnings estimate revisions for TSMC, the Zacks Consensus Estimate for the current year has declined 0.2% over the past month to $10.13.\nAnalysts' growing pessimism over the company's earnings prospects, as indicated by strong agreement among them in revising EPS estimates lower, could be a legitimate reason for the stock to plunge in the near term.\n\nThe size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #4 (Sell) for TSMC. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>>\nTherefore, it could be wise to take the Buy-equivalent ABR for TSMC with a grain of salt.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nTaiwan Semiconductor Manufacturing Company Ltd. (TSM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "22:25:16",
      "Source": "24/7 Wall St.",
      "Title": "Nvidia (NASDAQ: NVDA) Stock Price Prediction for 2026: Where Will It Be in 1 Year (Dec 17)",
      "URL": "https://finance.yahoo.com/m/fbc40b68-e691-3ac2-ac6e-c468b91245d1/nvidia-%28nasdaq%3A-nvda%29-stock.html",
      "Content": "Nvidia (NASDAQ: NVDA) Stock Price Prediction for 2026: Where Will It Be in 1 Year (Dec 17)\n\nJoel South\nWed, December 17, 2025 at 6:25 AM PST 7 min read\n\nIn this article: TM\n\nTOYOF\n\nTSM\n\nTSMWF\n\nMSFT\n\nShares of Nvidia Corp. ( NASDAQ: NVDA ) have retreated 3.4% in the past week, as it announced the acquisition of SchedMD and a partnership with Mistral AI, and in the wake of the White House approving sales of H200 chips to certain Chinese customers. Meanwhile, insiders continue to sell shares. Nvidia’s stock is 22.8% higher than six months ago, outperforming the S&P 500 and Nasdaq in that time.\n\n24/7 Wall St. Key Points U.S.-China trade relations have presented headwinds, but Nvidia Corp. ( NASDAQ: NVDA ) is also the dominant AI chipmaker in the market, and the company’s profitability remains strong.\nHere is a look at where Nvidia stock could be headed for the rest of this year and into the next.\nIf you’re thinking about retiring or know someone who is, there are three quick questions causing many Americans to realize they can retire earlier than expected. take 5 minutes to learn more here\n\nNote that gains for the chipmaker in that time have helped wipe away the steep drop the stock suffered early in 2025, after it reported it would take a $5.5 billion charge tied to the H20 chip export restrictions to China. While some analysts have raised price targets, others caution about ongoing headwinds due to uncertainty surrounding future U.S.-China trade relations and the potential for stricter regulations. The third-quarter report was stellar on the top and bottom lines due to strong growth in the data center segment.\nDespite its challenges, the company's pivot to U.S. AI infrastructure investments signals resilience. With analysts eyeing robust data center demand, 24/7 Wall St. here explores whether Nvidia can sustain its recovery and drive further growth.\n\nWhy Invest in Nvidia? Nvidia faces significant hurdles as it navigates U.S.-China trade restrictions and intense market expectations. In the first quarter, export controls on its H20 AI chip—which had been designed specifically to circumvent export restrictions on advanced technology to China—led to the substantial write-down noted above. Analysts believed the ban could result in a $9 billion revenue hit. Some $700 million would affect fiscal first-quarter results, with the remaining $8 billion spread across the second and third quarters.\n\nU.S. tariffs and China’s retaliatory measures also threatened supply chain costs, particularly for components sourced globally, while competition from Huawei’s Ascend chips grows. These factors had analysts warning of margin pressure. Yet, Nvidia's profitability remains robust. The company has reportedly raised prices 10% to 15% on some of its most popular GPUs as a result of the tariffs. Gaming processor prices jumped 5% to 10%, while it hiked high-end AI GPUs as much as 15% to account for surging manufacturing costs and to keep its earnings stable.\n\nStory Continues\nYet investments in U.S. AI infrastructure, supported by Taiwan Semiconductor Manufacturing's $165 billion Arizona fab expansion, bolster Nvidia's supply chains and are backed by its $37.6 billion cash reserve.\nCEO Huang announced during his recent trip to South Korea that Nvidia will supply more than 260,000 advanced graphics processing units (GPUs) to South Korean firms, including Samsung and Hyundai Motor. He believes AI has reached a \"virtuous cycle\" where improvements in the models lead to more investment, which in turn leads to further improvement and investment. He also expressed hope that trade talks between the U.S. and China might lead to a change in policy that allows Nvidia to resume sales of state-of-the-art chips in China. As mentioned, the U.S. president has now allowed the company to sell its advanced H200 AI chips to China.\n\nThe AI market is projected to grow at a 37% CAGR through 2030, according to Grand View Research. This supports Nvidia’s $170 billion fiscal 2026 revenue forecast, a 30% increase over the $130.5 billion it generated in 2025.\nNvidia as a Company In its third-quarter earnings report, Nvidia revenue totaled a record $57.01 billion, including $51.2 billion from its data center division. The total was up 66% year over year, largely fueled by the voracious demand for its AI chips.\nThe chipmaker invested $3.2 billion in capital expenditures in fiscal 2025, expanding Blackwell accelerator production and AI infrastructure. The company's capex has spiked over 200% this year to more than $3 billion to meet hyperscaler demand.\n\nU.S.-China trade restrictions still pose risks, even with the seeming thaw, tariffs could raise costs, which would explain the price hikes reportedly implemented. A 36% operating expense increase to $5.8 billion for R&D offset Nvidia's adjusted operating income of $37.8 billion.\nYet, Nvidia's growth is not solely tied to data centers. The company expanded its automotive segment, with a 32% year-over-year increase to $592 million, driven by partnerships with Toyota and Aurora Innovation for autonomous vehicles. This diversifies Nvidia's portfolio amid tariff uncertainties.\nNvidia has projected fiscal third-quarter revenue of $65 billion, plus or minus 2%. This outlook exceeded analysts' consensus projection.\nNvidia as a Stock This has been a rollercoaster year for Nvidia shareholders. The stock dropped to a 52-week low of $86.62 in April. After an announced pause in U.S.-China tariffs and the first-quarter results, the share price recovered. It hit an all-time high of $212.19 in October, which had the company's market cap briefly over $5 trillion.\n\nWhile some insiders have been selling shares, analyst sentiment remains bullish. Of 64 analysts who cover the stock, 60 recommend buying shares, 11 of them with Strong Buy ratings. Their consensus one-year price target is $250.93, which signals over 41% upside potential from its current price. Targets range from $140 to $352 per share.\nCitigroup, J.P. Morgan, Morgan Stanley, and others recently maintained their Buy-equivalent ratings. Evercore ISI has the street-high target price. It cited accelerating revenue growth, strong demand for Blackwell chips, an improving supply chain, and a significant pipeline. Yet, renowned investor Michael Burry is bearish on Nvidia.\nEstimate\nPrice Target\nChange From Current Price\nLow\n$140.00\n−21.2%\nMedian\n$250.93\n41.2%\nHigh\n$352.00\n98.1%\n\nNvidia's AI dominance, 93% data center growth, and automotive partnerships with Toyota positioned the company for gains in 2025. However, tariff risks and DeepSeek’s competitive AI models require caution. The AI market's growth and the chipmaker's $47 billion second-quarter revenue position Nvidia to achieve its $170 billion full-year revenue target, while its cash buffer and Stargate Project role offer stability. Still, valuation concerns linger. Nvidia is a buy for growth-oriented investors, but others should use caution.\n\n24/7 Wall St.'s 2026 year-end price target for Nvidia is $300.14 per share, which would be a 68.9% gain. That estimate accounts for tariff risks, competition from DeepSeek, and potential Blackwell supply constraints. It also reflects Nvidia's AI dominance and second-quarter 2026 revenue guidance.\nTime to Sell Nvidia Stock as Michael Burry Takes Aim?\n\nData Shows One Habit Doubles American’s Savings And Boosts Retirement Most Americans drastically underestimate how much they need to retire and overestimate how prepared they are. But data shows that people with one habit have more than double the savings of those who don’t.\nAnd no, it’s got nothing to do with increasing your income, savings, clipping coupons, or even cutting back on your lifestyle. It’s much more straightforward (and powerful) than any of that. Frankly, it’s shocking more people don’t adopt the habit given how easy it is .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "04:10:00",
      "Source": "Motley Fool",
      "Title": "This AI Chip Stock Could Be the Real Winner as Data Center Demand Explodes in 2026",
      "URL": "https://finance.yahoo.com/m/44024ba4-94cd-3322-aca4-b07aa90fdf28/this-ai-chip-stock-could-be.html",
      "Content": "This AI Chip Stock Could Be the Real Winner as Data Center Demand Explodes in 2026\n\nStefon Walters, The Motley Fool\nTue, December 16, 2025 at 12:10 PM PST 5 min read\n\nIn this article: TSM\n\nNVDA\n\nKey Points Spending on data centers is expected to increase by billions in the coming years.\nTSMC is the go-to company for manufacturing advanced AI chips used in data centers.\nIts stock is reasonably priced compared to top artificial intelligence chip designers.\n10 stocks we like better than Taiwan Semiconductor Manufacturing ›\n\nIf you said that artificial intelligence (AI) has taken the tech world by storm, you'd probably be underselling it. It seems it has consumed every tech-related conversation and caused pivots for many companies in the industry.\nThe AI boom has been multifaceted. You have consumer-facing applications like ChatGPT that have driven much of its mainstream popularity, massive investments in data centers and cloud infrastructure, and high-performance hardware companies like Nvidia that supply many critical pieces that power data centers.\nThe data center portion of it seems to be on the earlier end of what many are expecting (or, rather, hoping) it can be. Many companies -- especially hyperscalers like Alphabet , Amazon , and Microsoft -- have committed to spending billions to build them out in the next year and beyond.\nAlthough there are many moving parts to these anticipated data center build-outs, one company in particular stands to gain a lot: Taiwan Semiconductor Manufacturing (NYSE: TSM) , also known as TSMC. Here's why.\nThe importance of data centers in AI For AI to work on the scale we see today, it must be trained on tons of data -- and that's putting it lightly. This data can't be stored in traditional ways, either. It must be stored in data centers that can process massive amounts of information at high speeds and supply the electricity that's needed to power them 24/7. Some estimates say an AI query uses 10 times as much electricity as a standard Google search.\n\nData centers' importance to training and scaling AI is why we've seen an explosion in spending related to them. Nvidia's CEO, Jensen Huang, has said that he anticipates companies spending $3 trillion to $4 trillion by 2030 on building out this AI infrastructure. This spending should trickle down, and at the beginning of the AI supply chain, TSMC will be waiting.\nWhy TSMC stands out as the real potential winner Companies like Nvidia, Advanced Micro Devices , Alphabet, and Amazon design the AI chips used in data centers. However, every single one of them relies on TSMC to manufacture the chips and bring them to life. If we're using cars as a comparison, those companies are the designers and brands, but TSMC is the factory that actually builds the engines.\n\nStory Continues\nThere's a good reason for that, too. No company compares to TSMC's efficiency and scale, which is why its market share on advanced AI chips is well into the upper-90% range. Samsung and Intel both manufacture chips, but neither comes close to TSMC.\nThe reliance on TSMC for its AI chip manufacturing has also begun to show in its financials. In the third quarter, high-performance computing (HPC) accounted for 57% of TSMC's $33.1 billion in revenue. Three years ago, in Q3 2022, HPC was only 39% of TSMC's revenue.\n\nBefore HPC, smartphones accounted for most of TSMC's revenue. This new shift in demand works in TSMC's favor because smartphones tend to be more about consumer upgrade cycles, while AI chips are poised to be sustained investments.\nPlaying into the hands of the electricity-conscious tech companies TSMC's moat is already wide, but one thing that's furthering its advantage is that its chips are not only faster, but also more power-efficient. Its new A14 manufacturing process is expected to produce chips that are 15% faster and use 30% less power. That should be music to data center operators' ears because it could noticeably reduce energy consumption.\n\nAside from the original build-out, maintaining a data center costs companies millions annually. Being able to run it with more power-efficient chips could mean meaningful savings.\nTSMC seems to be fairly priced For a company operating in a virtual monopoly, TSMC's stock isn't as expensive as one might expect it to be. At the time of this writing, it's trading at 28 times its projected earnings over the next 12 months. That's much cheaper than companies like Nvidia, AMD, and Broadcom , while still delivering strong earnings growth.\nThere's no doubt that TSMC stands to gain from the projected data center build-outs. However, even if plans change (such as companies reducing their anticipated spending), TSMC remains a great investment because its business is vital to virtually all technology, not just the AI boom. It's a stock I personally plan to hold for the long haul.\n\nShould you buy stock in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $505,695 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,080,694 !*\nNow, it’s worth noting Stock Advisor’s total average return is 962 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nStefon Walters has positions in Microsoft and Taiwan Semiconductor Manufacturing. The Motley Fool has positions in and recommends Alphabet, Amazon, Intel, Microsoft, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nThis AI Chip Stock Could Be the Real Winner as Data Center Demand Explodes in 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "04:06:25",
      "Source": "Simply Wall St.",
      "Title": "How Investors May Respond To KLA (KLAC) Analyst Upgrades Tied To AI‑Driven Chipmaking Demand",
      "URL": "https://finance.yahoo.com/news/investors-may-respond-kla-klac-200625876.html",
      "Content": "How Investors May Respond To KLA (KLAC) Analyst Upgrades Tied To AI‑Driven Chipmaking Demand\n\nSimply Wall St\nTue, December 16, 2025 at 12:06 PM PST 3 min read\n\nIn this article: KLAC\n\nTSM\n\nIn recent days, KLA has attracted a wave of analyst upgrades and bullish research highlighting its leadership in process control and advanced packaging for AI and high‑bandwidth memory manufacturing. These views build on KLA’s strong cash generation and capital returns, as well as industry forecasts for higher wafer fab equipment spending supported by leading customers like TSMC and DRAM makers.\nWhat stands out is how multiple firms now frame KLA as a critical enabler of the AI infrastructure buildout, with its tools becoming more essential as chip designs grow more complex and process control intensity rises across both leading‑edge logic and memory fabs.\nNext, we’ll examine how this growing analyst conviction around AI‑driven semiconductor equipment demand could influence KLA’s existing investment narrative.\n\nThe end of cancer? These 29 emerging AI stocks are developing tech that will allow early identification of life changing diseases like cancer and Alzheimer's.\nKLA Investment Narrative Recap To own KLA, you need to believe that AI, high‑bandwidth memory and advanced packaging will keep pushing process control spending higher, and that KLA can defend its margin profile despite tariffs, export controls and rising R&D. The recent wave of analyst upgrades reinforces AI as the key near term catalyst but does not materially change the biggest risk, which remains potential disruption or slower spending in major markets such as China.\n\nJefferies’ upgrade to Buy with a US$1,500 price target, tied to expectations for an AI driven wafer fab equipment uplift from the second half of 2026, directly connects to KLA’s exposure to leading edge logic, memory and advanced packaging. That call, alongside Morgan Stanley’s steady but rising WFE forecasts and KLA’s record US$1,066.0 million quarterly cash flow, supports the view that AI infrastructure spending could offset some volatility from normalizing backlogs and more cyclical demand.\nYet behind this optimism, investors should be aware that KLA’s heavy reliance on AI linked capex could become a vulnerability if...\nRead the full narrative on KLA (it's free!)\nKLA's narrative projects $14.8 billion revenue and $5.3 billion earnings by 2028.\n\nUncover how KLA's forecasts yield a $1297 fair value , a 6% upside to its current price.\nExploring Other Perspectives Six fair value estimates from the Simply Wall St Community span roughly US$633 to US$1,297 per share, showing how far apart individual views can be. Against this, KLA’s dependence on sustained AI and advanced packaging capex highlights why it may help to compare several of these perspectives before deciding how its growth story fits into your own expectations.\n\nWeiterlesen\nExplore 6 other fair value estimates on KLA - why the stock might be worth 48% less than the current price!\nBuild Your Own KLA Narrative Disagree with existing narratives? Create your own in under 3 minutes - extraordinary investment returns rarely come from following the herd.\nA great starting point for your KLA research is our analysis highlighting 2 key rewards that could impact your investment decision.\nOur free KLA research report provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate KLA's overall financial health at a glance.\n\nSeeking Other Investments? Markets shift fast. These stocks won't stay hidden for long. Get the list while it matters:\nFind companies with promising cash flow potential yet trading below their fair value .\nThese 10 companies survived and thrived after COVID and have the right ingredients to survive Trump's tariffs . Discover why before your portfolio feels the trade war pinch.\nOutshine the giants: these 25 early-stage AI stocks could fund your retirement .\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include KLAC .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nAGB und Datenschutzerklärung\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-17",
      "Time": "02:44:59",
      "Source": "Insider Monkey",
      "Title": "Why is Taiwan Semiconductor (TSM) One of the Most Profitable NYSE Stocks to Buy Right Now?",
      "URL": "https://finance.yahoo.com/news/why-taiwan-semiconductor-tsm-one-184459827.html",
      "Content": "Why is Taiwan Semiconductor (TSM) One of the Most Profitable NYSE Stocks to Buy Right Now?\n\nNoor Ul Ain Rehman\nTue, December 16, 2025 at 10:44 AM PST 2 min read\n\nIn this article: TSM\n\nTSMWF\n\nTaiwan Semiconductor Manufacturing Company Limited (NYSE: TSM ) is one of the most profitable NYSE stocks to buy right now . Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) received a rating update from Bank of America Securities analyst Mike Yang on December 10, who reaffirmed a Buy rating on the stock and set a $390 price target.\nThe rating update came the same day Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) reported its November 2025 revenue report. Revenue for November 2025 on a consolidated basis reached around NT$343.61 billion, reflecting a drop of 6.5% from October 2025 and an increase of 24.5% compared to November 2024.\n\nManagement further reported that revenue for January through November of 2025 reached a total of NT$3,474.05 billion, which translates to a growth of 32.8% compared to the same period in 2024.\nFor reference, Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) reported consolidated revenue of NT$989.92 billion in its fiscal Q3 2025 results, along with a net income of NT$452.30 billion, and diluted earnings per share of NT$17.44. Year-over-year fiscal Q3 revenue rose 30.3%, while net income and diluted EPS grew 39.1% and 39.0%, respectively. Fiscal Q3 2025 results reflected a 6.0% increase in revenue and a 13.6% increase in net income compared to fiscal Q2 2025. Q3 revenue in US dollars was $33.10 billion, up 40.8% year-over-year and up 10.1% compared to the previous quarter.\n\nTaiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) is the largest contract semiconductor manufacturer in the world. Some of its prominent customers include semiconductor companies that outsource all or part of their chip production, including Advanced Micro Devices, Nvidia, Broadcom, and more.\nWhile we acknowledge the potential of TSM as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "23:29:03",
      "Source": "Reuters",
      "Title": "AI boom seen lifting chipmaking equipment sales 9% to $126 billion in 2026",
      "URL": "https://finance.yahoo.com/news/ai-boom-seen-lifting-chipmaking-152903092.html",
      "Content": "AI boom seen lifting chipmaking equipment sales 9% to $126 billion in 2026\n\nReuters\nTue, December 16, 2025 at 7:29 AM PST 1 min read\n\nIn this article: TSM\n\nKLAC\n\nASML\n\nSSNLF\n\n000660.KS\n\nAMSTERDAM, Dec 16 (Reuters) - Sales of equipment used to make computer chip wafers ​will rise about 9% to $126 billion ‌in 2026 and a further 7.3% to $135 billion in ‌2027, as chipmakers expand capacity for logic and memory chips used in artificial intelligence , industry group SEMI forecast on Tuesday.\n\nMost chips are ⁠made in Asia, ‌and SEMI expects China, Taiwan and South Korea to remain the top ‍markets for equipment through 2027, with China investing the most overall.\nTaiwan, home to top chipmaker TSMC ( TSM ), ​will expand leading-edge capacity, while South ‌Korea, home to Samsung ( 005930.KS ) and SK Hynix ( 000660.KS ), is investing in advanced memory chips used for AI.\n\n\"All other regions tracked are (also) expected to see equipment spending increase in 2026 and ⁠2027, supported by government ​incentives, regionalization efforts and ​targeted specialty capacity expansions,\" SEMI said.\n\nSign up for Yahoo Finance's Week in Tech\n\nBy subscribing, you are agreeing to Yahoo's\n\nTerms\n\nand\n\nPrivacy Policy\n\nSubscribe\nThe biggest supplier of chip equipment, ASML ‍of the Netherlands, ⁠accounts for about a quarter of sales. Other top firms include Applied Materials ( AMAT ), ⁠KLA Corp ( KLAC ) and Lam Research ( LRCX ) of the U.S., ‌and Japan’s Tokyo Electron.\n(Reporting by Toby ‌SterlingEditing by Mark Potter)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "20:23:36",
      "Source": "Insider Monkey",
      "Title": "Taiwan Semiconductor Manufacturing Company Limited (TSM) Surged on Strong Market Sentiment",
      "URL": "https://finance.yahoo.com/news/taiwan-semiconductor-manufacturing-company-limited-122336171.html",
      "Content": "Taiwan Semiconductor Manufacturing Company Limited (TSM) Surged on Strong Market Sentiment\n\nSoumya Eswaran\nTue, December 16, 2025 at 4:23 AM PST 3 min read\n\nIn this article: TSM\n\nTSMWF\n\nMagellan Asset Management , an investment management company, released the third quarter 2025 investor letter for “Magellan Global Fund”. A copy of the letter can be downloaded here . The fund focuses on outstanding companies at attractive prices and, at the same time, leverages a deep understanding of the macroeconomic landscape to manage risk. As measured by the MSCI World Index in USD, the global equities rose 7.3% in the September quarter. The portfolio underperformed the index in the quarter due strong performance of more speculative companies in the risk-on environment. In addition, please check the fund’s top five holdings to know its best picks in 2025.\n\nIn its third-quarter 2025 investor letter, Magellan Global Fund highlighted stocks such as Taiwan Semiconductor Manufacturing Company Limited (NYSE: TSM ). Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) manufactures, packages, tests, and sells integrated circuits and other semiconductor devices. The one-month return for Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) was 3.54%, and its shares gained 43.40% over the last 52 weeks. On December 15, 2025, Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) stock closed at $287.74 per share, with a market capitalization of $1.492 trillion.\nMagellan Global Fund stated the following regarding Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) in its third quarter 2025 investor letter:\nTaiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) is in 9th position on our list of 30 Most Popular Stocks Among Hedge Funds . As per our database, 194 hedge fund portfolios held Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) at the end of the third quarter, compared to 187 in the previous quarter. In the third quarter of 2025, Taiwan Semiconductor Manufacturing Company Limited’s (NYSE:TSM) revenue increased 6% sequentially in NT. While we acknowledge the potential of Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\n\nStory Continues\nIn another article , we covered Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) and shared Janus Henderson Forty Fund's views on the company. In addition, please check out our hedge fund investor letters Q3 2025 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "08:15:19",
      "Source": "Simply Wall St.",
      "Title": "Does TSMC’s AI Chip Surge Still Offer Value After Its Massive Multi Year Rally?",
      "URL": "https://finance.yahoo.com/news/does-tsmc-ai-chip-surge-001519939.html",
      "Content": "Does TSMC’s AI Chip Surge Still Offer Value After Its Massive Multi Year Rally?\n\nSimply Wall St\nMon, December 15, 2025 at 4:15 PM PST 5 min read\n\nIn this article: TSM\n\nTSMWF\n\nWondering if Taiwan Semiconductor Manufacturing is still a smart buy after its massive run, or if the easy money has already been made? You are not alone, and that is exactly what this breakdown is going to unpack.\nThe stock has cooled off slightly in the last week with a -4.7% move, but it is still up 1.0% over 30 days, 42.7% year to date and 43.8% over the past year, with a 292.2% gain over three years and 193.1% over five years.\nThose moves have come as TSM has cemented its role as the go-to manufacturer for leading-edge chips used in AI data centers, smartphones and high-performance computing, while global demand for advanced semiconductors has stayed robust despite macro uncertainty. Investors are also paying close attention to ongoing US-China tech tensions and TSM's progress on new fabs in the US and Japan, which both add excitement and new execution risks to the story.\nOn our valuation checks, Taiwan Semiconductor Manufacturing scores a 3/6 valuation score , suggesting it looks undervalued on some metrics but not all, which makes it a useful case for comparing different valuation approaches and, later on, exploring a more complete way to think about its worth.\n\nTaiwan Semiconductor Manufacturing delivered 43.8% returns over the last year. See how this stacks up to the rest of the Semiconductor industry.\nApproach 1: Taiwan Semiconductor Manufacturing Discounted Cash Flow (DCF) Analysis A Discounted Cash Flow model estimates what a business is worth today by projecting the cash it can generate in the future and discounting those cash flows back to the present. For Taiwan Semiconductor Manufacturing, the model uses a 2 stage Free Cash Flow to Equity approach based on cash flow projections.\n\nThe latest twelve month free cash flow is about NT$802.4 Billion, and analysts expect this to keep growing as demand for advanced chips remains strong. By 2029, free cash flow is projected to reach roughly NT$2.4 Trillion, with further gains extrapolated by Simply Wall St out to 2035 as growth gradually slows from today’s elevated levels.\nWhen all these future cash flows are discounted back to today, the model arrives at an intrinsic value of about $216.49 per share. Compared with the current share price, this implies the stock is around 32.9% overvalued on a pure cash flow basis, suggesting a lot of optimism is already priced in.\nResult: OVERVALUED\nOur Discounted Cash Flow (DCF) analysis suggests Taiwan Semiconductor Manufacturing may be overvalued by 32.9%. Discover 908 undervalued stocks or create your own screener to find better value opportunities.\n\nStory Continues\nHead to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for Taiwan Semiconductor Manufacturing.\nApproach 2: Taiwan Semiconductor Manufacturing Price vs Earnings For a mature, consistently profitable business like Taiwan Semiconductor Manufacturing, the price to earnings, or PE, ratio is a useful way to gauge what investors are willing to pay for each dollar of current earnings. In general, companies with faster and more reliable earnings growth, and lower perceived risk, tend to justify a higher PE, while slower growth or greater uncertainty usually calls for a lower, more conservative multiple.\n\nTSM currently trades on a PE of about 23.9x, well below both the semiconductor industry average of roughly 37.0x and the broader peer group average of around 60.8x. On the surface, that discount might suggest the stock is attractively priced, but simple comparisons can be misleading because they ignore company specific factors like growth outlook, margins and risk profile.\nTo address this, Simply Wall St uses a proprietary Fair Ratio, which estimates what a more appropriate multiple should be after considering TSM’s earnings growth, profitability, industry, market cap and risk factors. For TSM, this Fair Ratio is 37.6x, materially above the current 23.9x. This indicates that, given its fundamentals, the market may not be fully recognizing its earnings power.\nResult: UNDERVALUED\nPE ratios tell one story, but what if the real opportunity lies elsewhere? Discover 1447 companies where insiders are betting big on explosive growth .\nUpgrade Your Decision Making: Choose your Taiwan Semiconductor Manufacturing Narrative Earlier we mentioned that there is an even better way to understand valuation. On Simply Wall St this takes the form of Narratives, which are simple, story driven snapshots where investors connect their view of a company’s future revenue, earnings and margins to a financial forecast, and then to a Fair Value that can be compared against today’s share price to decide whether to buy, hold or sell. Narratives are available on the Community page and are designed to be easy and accessible. They dynamically update as new information like earnings, guidance or major news comes in. For Taiwan Semiconductor Manufacturing, for example, one optimistic Narrative might assume rapid AI driven growth, resilient margins and a Fair Value of around $310 per share. A more cautious Narrative could factor in geopolitical risk, margin pressure from overseas fabs and a much lower Fair Value. By comparing where price sits relative to each Narrative’s Fair Value, you can quickly see which story you believe and what that implies for your next move.\nDo you think there's more to the story for Taiwan Semiconductor Manufacturing? Head over to our Community to see what others are saying!\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include TSM .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-16",
      "Time": "05:17:17",
      "Source": "Investor's Business Daily",
      "Title": "Nvidia Reportedly Seeing High Demand From China For H200 AI Chips",
      "URL": "https://finance.yahoo.com/m/8ae748d1-7ab4-38f4-8019-b2a0eda5d63f/nvidia-reportedly-seeing-high.html",
      "Content": "Nvidia Reportedly Seeing High Demand From China For H200 AI Chips\n\nPATRICK SEITZ\nMon, December 15, 2025 at 1:17 PM PST 1 min read\n\nIn this article: NVDA\n\nTSM\n\nBABA\n\nNvidia reportedly is seeing strong interest in the artificial intelligence chip giant's H200 AI processors from customers in China after President Donald Trump last week moved to ease trade restrictions. Nvidia stock rose Monday. Nvidia is considering adding production capacity for H200 chips as orders are exceeding current output levels, Reuters reported.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 10
}