{
  "stock_id": "TSM",
  "last_updated": "2026-01-01T12:11:08.444Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2026-01-01",
      "Time": "19:08:00",
      "Source": "Motley Fool",
      "Title": "Could This Be the Best Artificial Intelligence (AI) Stock to Buy in January?",
      "URL": "https://finance.yahoo.com/m/efaf1e13-a940-3518-9d7e-deb40b5e0a26/could-this-be-the-best.html",
      "Content": "Could This Be the Best Artificial Intelligence (AI) Stock to Buy in January?\n\nJustin Pope, The Motley Fool\nThu, January 1, 2026 at 3:08 AM PST 5 min read\n\nIn this article: TSM\n\nNVDA\n\nKey Points Taiwan Semiconductor (TSMC for short) has been a clear winner in the AI era, steadily increasing its market share.\nNvidia's growth outlook appears strong, with its Rubin chip's impending arrival expected to also boost TSMC.\nTSMC's stock remains a compelling value despite its strong performance in 2025.\n10 stocks we like better than Taiwan Semiconductor Manufacturing ›\n\nThere's something refreshing about the new year. It's an excellent opportunity for a fresh start, which means new ideas for your stock portfolio.\nAlthough the calendar is turning a page, artificial intelligence (AI) remains a hot theme for 2026, just as it has been for most of the past few years. Despite immense hype and soaring share prices, some AI stocks still represent compelling value today.\nTaiwan Semiconductor Manufacturing (NYSE: TSM) , also known as TSMC, was no slouch in 2025. The stock rose by more than 50%. Yet, it may still be the best AI stock to buy in January. Here's why shares could continue heading higher.\nGobbling up market share in the AI era Everything electronic, from data centers for AI to your smartphone, uses microchips. Many companies that sell them, such as Nvidia or Advanced Micro Devices , design them and outsource the manufacturing to companies called foundries, which have the expertise and equipment to build them.\nTaiwan Semiconductor is the world's largest foundry, and to say that it dominates its industry could somehow be an understatement. According to estimates from Counterpoint Research, TSMC's market share (by revenue) of the global foundry market was approximately 72% at the end of the third quarter. Samsung was the closest competitor at just 7%.\n\nPerhaps what's more impressive is that despite surging demand for AI chips, TSMC has actually increased its market share amid this AI investment cycle. Its share was 65% midway through 2024.\nManufacturing chips is a complicated task. Given the money at stake -- there are hundreds of billions of dollars pouring into AI -- chip companies are flocking to TSMC's scale, equipment, and proprietary processes.\nNo other company can build as many high-end chips as quickly as this one can. They are the sure thing, and that has value.\nNvidia's Rubin chip is arriving soon The top AI company, Nvidia, has partnered closely with TSMC for its graphics processing units (GPUs), including its Hopper architecture and its successor, Blackwell. Naturally, innovation continues, and its Rubin architecture is next in line, set to arrive on the market in 2026.\n\nStory continues\nTSMC is building Rubin using its advanced 3-nanometer process, to achieve higher performance with less power consumption. Nvidia recently touted a $500 billion order backlog -- meaning that a company with $187 billion in sales over the past four quarters is poised to continue its impressive growth trajectory.\nNvidia's AI success is affecting TSMC, whose own revenue growth has accelerated dramatically over the past few years. In fact, Nvidia has challenged Apple as TSMC's largest customer at this point.\nFantastic growth at a compelling price Barring an unexpected widespread collapse in AI spending, Nvidia's huge backlog is likely to help propel TSMC's business to new heights as those orders flow through its foundries. Fortunately for investors, there appears to be room for the stock to continue its ascent.\nIts price-to-earnings ratio is just under 30 times TSMC's full-2025 earnings estimates. While that may seem high, the company is likely to continue growing rapidly, as discussed above. Analysts estimate that it will increase earnings by an average of nearly 29% annually over the next three to five years.\n\nUsing the price/earnings-to-growth ratio (PEG) to compare TSMC's growth rate to its valuation, its ratio of roughly 1 signals the stock is very attractive at its current price. I am often willing to pay up for a PEG ratio of about 2 to 2.5 for a high-quality stock, and TSMC certainly meets that standard as the world's leading chip foundry.\nSo even if TSMC's growth falls a bit short of analyst estimates, investors still have a good chance of achieving strong returns over the long term. The company's mission-critical role in the AI boom gives the stock a relatively high floor with enough upside to make it a leading investment idea heading into January.\nShould you invest $1,000 in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $505,749 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,149,658 !*\nNow, it’s worth noting Stock Advisor’s total average return is 979 % — a market-crushing outperformance compared to 195% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 29, 2025\nJustin Pope has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Apple, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy .\nCould This Be the Best Artificial Intelligence (AI) Stock to Buy in January? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "17:44:37",
      "Source": "24/7 Wall St.",
      "Title": "Nvidia Is About to Deliver a Huge Late Christmas Gift to Investors",
      "URL": "https://finance.yahoo.com/m/04b1e315-d13f-3155-912f-0b44c8ee0c14/nvidia-is-about-to-deliver-a.html",
      "Content": "Nvidia Is About to Deliver a Huge Late Christmas Gift to Investors\n\nRich Duprey\nThu, January 1, 2026 at 1:44 AM PST 4 min read\n\nIn this article: NVDA\n\nTSM\n\nQuick Read Nvidia ( NVDA ) reportedly received orders exceeding 2 million H200 chips from Chinese tech companies for 2026 delivery. Current inventory stands at only 700,000 units.\nNvidia asked Taiwan Semiconductor to ramp up H200 production starting in Q2 2026 to address the shortfall.\nH200 chips are priced at $27,000 per unit for China-specific variants. Shipments could help recover billions in lost Chinese sales from this year.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "16:53:00",
      "Source": "Motley Fool",
      "Title": "Is Intel Keeping a (Wonderful) Secret From the Market Regarding Its 18A Node?",
      "URL": "https://finance.yahoo.com/m/df1585d3-1c2e-34e0-b5cf-957c1f9ee4c7/is-intel-keeping-a.html",
      "Content": "Is Intel Keeping a (Wonderful) Secret From the Market Regarding Its 18A Node?\n\nBilly Duberstein, The Motley Fool\nThu, January 1, 2026 at 12:53 AM PST 11 min read\n\nIn this article: INTC\n\nTSM\n\nKey Points Intel will be the first chipmaker to use high-NA EUV lithography, giving it a potential advantage over TSMC.\nThe company has long pointed to its 14A node in 2028 as the first node in which it will use high-NA.\nHowever, there have been hints Intel may insert high-NA earlier into its 18A node, which is ramping up today.\n10 stocks we like better than Intel ›\n\nThere's a conventional wisdom among investors that Intel (NASDAQ: INTC) is significantly behind Taiwan Semiconductor Manufacturing (NYSE: TSM) , and that it will take years for the company to catch up to TSMC's technological lead -- if it ever happens at all.\nLast week, sell-side analyst Stacy Rasgon of Bernstein said that since it took a decade to \"break\" Intel, investors shouldn't expect it to take less than 10 years to fix. Notwithstanding Intel's heavy lift turnaround really began in 2021 with the appointment of former CEO Pat Gelsinger, the turnaround may actually be closer than Rasgon expects.\nOne key element for Intel being able to leapfrog TSMC would be the earlier implementation of high-NA EUV lithography technology. While Intel has publicly stated that it won't introduce high-NA until its 14A node in 2028, there were numerous indications over the past year that Intel may in fact accelerate HNA into its current 18A manufacturing process.\n\nIf that happens, the semiconductor industry could change very quickly.\nWhat is high-NA EUV? High-NA EUV lithography is the latest and most advanced version of extreme ultraviolet lithography technology (EUV), pioneered and developed by ASML Holdings (NASDAQ: ASML) . Twenty years in the making, chipmakers first used EUV lithography in 2019, enabling the efficient production of chips with pitches as small as 7 nanometers between transistors.\n\nAbout a decade ago, Intel delayed its implementation of EUV, instead opting for double, triple, or even quadruple patterning with older DUV technology. That delay allowed TSMC to leapfrog Intel, giving the Taiwanese giant a manufacturing lead it has held to this day.\nHigh-NA is the next jump forward in this technology. HNA EUV machines can \"write\" chip patterns in a thickness of just 8nm, more precisely than the 13.5-nm light beams of low-NA EUV. Like its predecessor, the new technology enables single-patterning, higher-density chips with fewer process steps. Fewer process steps generally means higher yields than multi-patterning with older tools.\nDetermined not to repeat mistakes of the past, Intel has jumped to the front of the line as the first to implement high-NA EUV machines. Ironically, it's TSMC this time that has opted to wait to use the new technology, with TSMC management citing cost reasons.\n\nStory continues\nBut both Intel and ASML have claimed that high-NA machines are working as intended now. In early 2024, ASML's CEO took issue with critics of HNA, saying it is \"very clearly the most cost-effective solution both in logic and memory.\"\nThen at a technology conference in February 2025, Intel executive Steve Carson noted Intel already had HNA \"in production,\" and that the tool was \"more reliable\" at this stage than low-NA was at the equivalent time in the past. Carson also noted high-NA enabled Intel to do the same work with one machine and a \"single-digit\" number of process steps that it took a low-NA machine three exposures and roughly 40 processing steps. So, there appear to be clear advantages for HNA in terms of productivity, especially when one gets to leading-edge nodes that require triple-patterning on low-NA tools.\n\nNow, there are technology obstacles to using HNA tools effectively, and the tool costs about double that of a low-NA tool. Still, given the productivity enhancements, HNA lines should net out to overall cost savings when properly implemented.\nIntel has at least three HNA machines and tons of experience with HNA already Another reason Intel may be ready to use HNA EUV today is that it has already bought, installed, and utilized at least three tools it has disclosed to the public, and possibly more that it hasn't.\nIntel announced the receipt of its first HNA machine at its Oregon R&D facility in late 2023/early 2024, then announced \"first light\" on the machine in late February 2024. Intel next followed that up with the disclosure of a second HNA machine installation in August 2024 at its Oregon facility.\n\nThen, just two weeks ago in mid-December, Intel announced it had achieved \"acceptance testing\" of ASML's EXE:5200 HNA machine, the upgraded version of last year's EXE:5000 high-NA machine, which features enhanced throughput for high-volume manufacturing. Acceptance testing means Intel has the HNA machine working in the fab, meeting high-volume manufacturing benchmarks and customer specifications.\nNotably, ASML didn't start shipping the 5200 until early 2025, indicating that Intel has at least one more than the two it officially announced in 2024. In addition, Intel has not disclosed specifically where the third machine, the 5200, was installed. Notably, Intel has been preparing Fab 52 in Arizona for 18A production this year.\n\nIt's also quite possible, if not probable, that Intel has purchased even more HNA machines. In May 2024, industry publication The Elec reported that Intel had secured all of ASML's high-NA EUV production for 2024, which would encompass five to six machines. Given Intel received its first machines in late 2023, that would bring its total to six or seven.\nThis was just one unconfirmed report, and Pat Gelsinger's resignation in late 2024 may have changed this order pattern. Nevertheless, it's likely a fair bet that Intel has purchased more than the three HNA machines it has officially disclosed.\nWith so much progress, why wait until 14A? In light of all this, it's curious Intel has pointed to 14A, due out in 2028, as the point in which it will use high-NA. And it's especially curious that Intel would purchase so many HNA machines, given that this past summer, Intel disclosed that if it doesn't secure a significant external customer, it might not proceed with 14A development at all.\n\nIf Intel weren't sure it would develop 14A, and since it has pointed to 14A being the first HNA node, why would Intel buy so many expensive HNA machines, which cost $400 million each? And why would it do so when the company was already cash flow negative, to the point where the company took in dilutive equity investments this past summer?\nIntel has also already accomplished a tremendous amount of work with HNA tools. At the February tech conference I mentioned, Intel disclosed that it was processing 30,000 wafers per quarter on high-NA tools. That's a huge number of wafers to be processing for mere research and development purposes. Meanwhile, the recent disclosure of \"acceptance testing\" means that the tool has passed a formal evaluation process that determines the tool can function according to contractual specifications in a formal manufacturing setting.\n\nSince the tool appears to be working in manufacturing settings, Intel has extensive experience with it, and HNA reportedly provides material advantages, why wouldn't Intel integrate HNA into the current 18A process?\nIndications HNA may be in Intel's Fab 52 for 18A While Intel has obviously never said it would use high-NA EUV for 18A, the company has nevertheless dropped clues it would be possible to do so over the past year. Meanwhile, outsiders have begun to speculate over the possibility of high-NA machines in Fab 52.\nReporting on the aforementioned February 2025 technology conference, Reuters initially reported that Intel was developing 18A with high-NA technology; however, Intel later had Reuters correct the story to say that Intel was \"using its 18A manufacturing technology, which is scheduled for mass production with a new generation of PC chip later this year, to test the high NA tools.\"\n\nSo, Intel was at least \"testing\" high-NA on its 18A process as of February.\nThen at Intel's Foundry Direct event in April, Intel's chief technology and operations officer Naga Chandrasekaran stated that Intel had achieved \"yield parity\" between testing both low-NA multi-patterning and high-NA single-patterning on both the 18A and 14A nodes.\nMore recently in October, Intel invited technology journalists into Fab 52 for Intel's \"Tech Tour\" to show off the fab and its 18A node. While all of the journalists were under nondisclosure agreements, a vlogger for Level1Techs told his viewers that he saw \"something\" in Fab 52, asked about it, and was told by Intel to please refrain from disclosing what he saw.\nDuring this portion of the vlog, the Level1 presenter showed a video of the original HNA machine being installed in Oregon. After discussing the EUV machines he saw, without specifying the model, the presenter said, \"That's probably the extent of the detail I'm comfortable giving you.\"\n\nWhy would Intel keep this a secret? For the record, there's no evidence that Intel is using HNA EUV on 18A. But given its purported advantages, why keep it a secret if it were?\nThere could be a number of reasons. One might be the competitive advantage of keeping cards close to the vest, surprising the competition and thereby lengthening Intel's first-mover advantage with HNA. There may also be a concern over setting expectations too high for cost savings, yield, and performance with the first incarnation of the tool's use. After all, numerous rumors were circulated about Intel and 18A's progress over the past year, with many being quite negative.\n\nAdditionally, even if Intel does use high-NA tools for 18A, it may only do so on a few layers of each chip. Current leading-edge 3nm-class chips include about 20 EUV layers, and it's expected upcoming 2nm-class chips, of which 18A is a part, will see that EUV layer count jump by 30% into the mid-20s.\nMoreover, a recent short documentary about Fab 52 by CNBC appeared to show low-NA EUV tools in the fab. Therefore, even if HNA is used on 18A, it may only be for certain products, or perhaps only for a few critical layers, with the majority still handled by low-NA tools.\nThus, Intel may be wary of labeling 18A a \"high-NA\" node if most layers are still completed using low-NA tools. It's also possible that Intel may be using low-NA tools for 18A, but will actually insert HNA tools for the next variant of the node called 18AP, which is supposed to ramp later in 2026 and deliver an 8% improvement in performance-per-watt over 18A.\n\nIntel may never reveal its tool set for 18A Investors may never know whether Intel is actually using HNA tools on 18A, given the secrecy that generally accompanies semiconductor manufacturing. If Intel does choose to disclose it, next week's CES in Las Vegas could be the ideal time and place, given that Intel will formally unveil its first 18A-produced chip, called Panther Lake.\n\nNevertheless, given the company's tight-lipped posture regarding the 18A process, it may very well remain a mystery as to whether Intel is using high-NA EUV for its critical 18A node.\nShould you buy stock in Intel right now? Before you buy stock in Intel, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Intel wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $505,749 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,149,658 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 979 % — a market-crushing outperformance compared to 195% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 29, 2025\nBilly Duberstein and/or his clients has positions in ASML, Intel, and Taiwan Semiconductor Manufacturing. The Motley Fool has positions in and recommends ASML, Intel, and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy .\nIs Intel Keeping a (Wonderful) Secret From the Market Regarding Its 18A Node? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "12:05:00",
      "Source": "PR Newswire",
      "Title": "GAC's Global Ecosystem Takes Shape as Overseas Sales Nearly Triple in Two Years",
      "URL": "https://finance.yahoo.com/news/gacs-global-ecosystem-takes-shape-040500706.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nGAC's Global Ecosystem Takes Shape as Overseas Sales Nearly Triple in Two Years\n\nPR Newswire\nWed, December 31, 2025 at 8:05 PM PST 2 min read\n\nIn this article: GNZUF\n\nGUANGZHOU, China , Jan. 1, 2026 /PRNewswire/ -- GAC released its 2025 overseas performance report, announcing exports of over 130,000 vehicles, a year‑on‑year increase of 45%. Over the past two years, GAC's international business has achieved leapfrog growth in ecosystem building and sales performance.\n\nIn 2023, overseas sales of 45,000 units marked the first breakthrough. In 2024, exports rose to 90,000 units. By the end of 2025, exports exceeded 130,000 units, representing growth of more than 45% year‑on‑year, ranking GAC among the top eight Chinese independent brands by export volume. In two years, GAC's overseas sales have nearly tripled.\nBehind this strong momentum lies solid ecosystem‑building capability. As the first state‑owned automaker to go global with its integrated energy ecosystem, GAC has remained committed to \"Tech‑Driven GAC, Advancing Global Reach with a Full‑Chain Ecosystem\". By leveraging high quality, advanced technology, premium services and a full‑value‑chain ecosystem, GAC is charting a path to global expansion. At the Bangkok International Motor Show in 2025, GAC upgraded its One GAC global strategy to \"One GAC 2.0\". Centered on one vision, one goal and one brand image, one localized initiative and five key measures, the strategy enables more efficient, precise market deployment and builds a unified global image.\n\nGuided by One GAC 2.0, localized programs such as the \"Thailand Action\", \"Brazil Action\" and \"Australia Action\" have been rolled out. Through five pillars of product, network, service, intelligent manufacturing, energy ecosystem and mobility solutions, GAC builds local market presence and drives sales by being \"In Local, For Local, Integrated Locally, Serving Locally, Contributing Locally.\"\nIn 2025, GAC launched five new models overseas and entered 16 new markets, including Brazil, Poland, Portugal, Australia and Argentina, expanding to 86 countries and regions. The global network grew by 281 outlets to 630. KD production in Indonesia and Malaysia commenced on schedule, while the Europe KD project is progressing steadily, and five overseas plants are in operation.\n\nBuilding on this, 2026 will be pivotal for scaling GAC's overseas business in volume and quality. GAC has set an export target of 250,000 units, aiming to create a \"second growth curve\" following the landmark \"Panyu Action\" and to become a benchmark for the global expansion of Chinese automotive brands.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "11:53:00",
      "Source": "PR Newswire",
      "Title": "Global Times: Top 10 Chinese and international sports news of 2025 announced",
      "URL": "https://finance.yahoo.com/news/global-times-top-10-chinese-035300594.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nGlobal Times: Top 10 Chinese and international sports news of 2025 announced\n\nPR Newswire\nWed, December 31, 2025 at 7:53 PM PST 11 min read\n\nBEIJING , Dec. 31, 2025 /PRNewswire/ -- Top 10 Chinese Sports News and Top 10 International Sports News of 2025 have been announced, jointly selected by the People's Daily Sports Department, Chief Editor's Office, and New Media Center, in collaboration with People's Daily Online and the Global Times.\n\nTop 10 Chinese Sports News of 2025\n9th Asian Winter Games successfully held in Harbin, Heilongjiang Province\nThe 9th Asian Winter Games were successfully held in Harbin, Heilongjiang Province from February 7 to 14. Chinese President Xi Jinping attended the opening ceremony and declared the opening of the Asian Winter Games. More than 1,200 athletes from 34 Asian countries and regions participated in the Games. The Chinese delegation won 32 gold medals and 85 medals in total, ranking first on both the gold and overall medal tables, marking its best performance in the history of its participation in the Asian Winter Games. Upholding the concept of a \"green, inclusive, open, and clean\" Games, China received widespread praise from the Olympic Council of Asia and the international community for its world-class venues and outstanding organizational services.\n\n15th National Games, 12th National Games for Persons with Disabilities and the 9th National Special Olympic Games successfully held in Greater Bay Area\nThe opening ceremony of 15th National Games was held in Guangzhou, Guangdong Province, on November 9. Chinese President Xi Jinping declared the 15th National Games open. Xi, also general secretary of the Communist Party of China Central Committee and chairman of the Central Military Commission, attended the opening ceremony of the Games.\nFor the first time, Guangdong, Hong Kong, and Macao jointly hosted a major sporting event, marking an innovation in the National Games history and an innovative application of the \"One Country, Two Systems\" in sport. The Games featured 34 competition sports events and 23 mass participation events, with more than 14,000 athletes and about 11,000 amateur participants. Over the course of the competition, eight world records were broken, 13 Asian records were set or surpassed, and 14 national records were established.\n\nThe 12th National Games for Persons with Disabilities and the 9th National Special Olympic Games concluded in Shenzhen, Guangdong Province, on December 15. Guangdong, Hong Kong, and Macao jointly hosted the National Para Games and Special Olympics for the first time, reflecting the high priority the CPC Central Committee, with Xi at its core, places on disability-inclusive development and its deep commitment to people with disabilities. This edition featured 46 sports, with 7,824 athletes from 34 delegations nationwide registering to compete, setting new records for both delegation size and the number of mass-participation athletes.\n\nStory Continues\nModel units and individuals in national mass sports and competitive sports commended\nChinese President Xi Jinping met with representatives of national model units and individuals in mass sports and competitive sports in Guangzhou, Guangdong Province, on November 9, 2025. Xi, also general secretary of the Communist Party of China Central Committee and chairman of the Central Military Commission, extended his congratulations to the honorees, encouraging them to push their limits, strive for new heights, and make new contributions to building China into a sports powerhouse.\n\nOn November 10, the commendation conference for the representatives of national model units and individuals in mass sports and competitive sports was held in Guangzhou.\n12th World Games held in Chengdu; Chinese delegation tops gold, medal tables for the first time\nThe 12th World Games was held in Chengdu, Sichuan Province, from August 7 to 17. Nearly 4,000 athletes from 116 countries and regions competed. The Chinese sports delegation won 36 gold, 17 silver, and 11 bronze medals, totaling 64 medals, and ranked first on both the gold and overall medal tables for the first time, achieving its best result in its history of participating in World Games.\nState Council issues guidelines to promote high-quality development of sports industries\nOn September 4, the General Office of the State Council issued a set of guidelines to unleash the consumption potential of the sports economy, as part of broader efforts to drive the high-quality development of sports industries. The guidelines outline 20 measures in six fields, including those related to the expansion of the supply of sports products and events, the boosting of sports consumption, support for sports businesses, and the cultivation of new growth drivers in relevant industries. The document sets out that by 2030, a number of sports enterprises and sporting events with global influence will be cultivated, the level of sports industry development will leap significantly, with a total scale exceeding 7 trillion yuan, playing an important role in the establishment of a new development pattern.\n\n'Suchao' popularity sparks city- and county-level leagues boom\nSince the beginning of this year, a wave of mass sports events has swept across the country. The Jiangsu City Football League, more widely known as the 'Suchao', has surged in popularity, repeatedly setting new attendance records during competition periods. Riding on the momentum generated by the Suchao, similar city-based league tournaments have sprung up in many regions. At the same time, a variety of grassroots village-level sports events have gained widespread popularity, emerging as phenomenon-level cultural spectacles. The expanding \"sports plus\" approach continues to unlock new scenarios, stimulate fresh consumer vitality and inject new momentum into economic and social development as well as comprehensive rural revitalization.\n\nJu Wenjun wins Women's World Chess Championship for the 5th time\nOn April 16, the ninth game of the 2025 FIDE Women's World Chess Championship Match concluded in Fuling, Chongqing Municipality. Defending champion Ju Wenjun defeated challenger Tan Zhongyi with a total score of 6.5-2.5, winning the Women's World Chess Championship title for a fifth consecutive time. This marks the 16th time that a Chinese player has claimed the Women's World Chess Championship. Ju has also surpassed Xie Jun and Hou Yifan to become the first player in the history of Chinese women's chess to win the world title five times in a row.\nChangchun in Jilin Province wins bid to host 33rd Winter Universiade\nOn November 26, Changchun in Jilin Province successfully won the bid to host the 33rd Winter World University Games. The International University Sports Federation (FISU), the Chinese University Sports Association, and the Changchun municipal government jointly signed the host city contract for the Changchun 2027 Winter World University Games. This marks the return of the Winter World University Games to China following the 2009 Harbin edition. It will also be another major international comprehensive ice-and-snow sports event hosted by China, after the Beijing 2022 Winter Olympics and the Harbin 2025 Asian Winter Games. The 33rd Winter World University Games are scheduled to take place from January 15 to 25, 2027, featuring 93 events in 12 sports.\n\nWuhan team wins inaugural Asian Women's Champions League title\nOn May 24, in the final of the 2024-25 Asian Women's Champions League held in Wuhan, Hubei Province, Wuhan Jiangda and Australia's Melbourne City played to a 1-1 draw. After extra time, Wuhan won 5-4 on penalties to claim the first‑ever Asian Women's Champions League title, marking the best performance by a Chinese women's club on the Asian stage.\nChina's badminton team wins Sudirman Cup for 4th consecutive time\nOn May 4, at the 2025 BWF Sudirman Cup mixed team world badminton championships in Xiamen, Fujian Province, China defeated South Korea 3-1 in the final to claim the title. This victory marked China's fourth straight Sudirman Cup championship and the 14th time overall the Chinese team has lifted the Sudirman Cup.\n\nTop 10 International Sports News of 2025\nKirsty Coventry takes office as 10th President of IOC\nOn March 20, at the 144th Session of the International Olympic Committee (IOC) held on the coast of Navarino, Greece, 41‑year‑old Kirsty Coventry was elected as the new president of the IOC. Coventry, from Zimbabwe, competed in five Olympics and won two gold, four silver and one bronze medals during her swimming career. On June 23, Coventry officially took over from Thomas Bach, becoming the 10th President of the IOC, and the first President in IOC history from Africa and the first female IOC President.\nUN General Assembly adopts Milan‑Cortina Winter Games Olympic Truce Resolution\nOn November 19, the 80th UN General Assembly adopted the Olympic Truce Resolution for the 2026 Milan‑Cortina Winter Olympic and Paralympic Games. The resolution calls on UN Member States to observe the Olympic Truce from seven days before the opening of the 2026 Milan‑Cortina Winter Olympic Games (February 6-22, 2026) until seven days after the closing of the Winter Paralympic Games (March 6-15, 2026), ensuring the safe passage and participation of athletes and officials.\n\nCompetition events for the 2028 Los Angeles Olympics finalized\nOn April 9, the IOC Executive Board approved the competition program and athlete quotas for the 2028 Los Angeles Olympic Games, with a total of 351 medal events, an increase of 22 events compared with the Paris Olympics. Among these, swimming will add six new events in men's and women's 50m butterfly, backstroke, and breaststroke. In table tennis, a mixed team event will debut, with men's doubles and women's doubles replacing the men's and women's team events.\nGroup draw results for the 2026 FIFA World Cup revealed\nOn December 5, the group stage draw for the 2026 FIFA World Cup was held in Washington, the US. In Group A, Mexico and South Africa will kick off the tournament on June 11 in Mexico City. The tournament will be jointly hosted by the US, Canada, and Mexico, and for the first time expanded to 48 teams in 12 groups from A to L.\n\nMultiple world records set in athletics\nAt the World Athletics Championships held in Tokyo in September, Swedish star Armand Duplantis cleared 6.30 meters in the men's pole vault final, improving his own world record by 1 centimeter.\nLithuanian discus thrower Mykolas Alekna set a new world record of 75.56 meters at the Oklahoma Throw Series in April. On July 5, Kenyan athlete Beatrice Chebet set a new women's 5,000 meters world record with 13:58.06, improving the mark by 2.15 seconds; in the women's 1,500 meters, another Kenyan athlete Faith Kipyegon set a new world record with 3:48.68.\nUNESCO designates March 21 as International Taijiquan Day\nOn November 5, the UNESCO adopted a resolution to establish March 21 (the spring equinox in the Northern Hemisphere) as International Taijiquan Day at its 43rd General Conference. Taijiquan originated in China and currently has hundreds of millions of practitioners worldwide in more than 180 countries and regions.\n\nWorld Aquatics Championships held in Singapore; China tops gold medal table\nThe 2025 World Aquatics Championships were held in Singapore from July 11 to August 3. The Chinese national team performed strongly, finishing first on the gold medal table with 15 golds, 12 silvers, and 10 bronzes. Additionally, three world records were rewritten in swimming at the world championships.\nPortland Trail Blazers selects Chinese player Yang Hansen in NBA Draft\nIn the 2025 NBA Draft, the Portland Trail Blazers selected Chinese player Yang Hansen with the 16th overall pick in the first round. This marks the return of a Chinese player to the NBA first round in nearly 20 years.\nWorld Table Tennis announces multiple reform measures\nIn February, the World Table Tennis (WTT) announced a series of reforms, including changes to mandatory player participation rules, awarding wildcards to Olympic champions, increasing prize money, and granting players two annual exemptions from mandatory participation in WTT Champions events to help them arrange and plan their schedules.\n\nDembélé and Bonmati win 2025 Ballon d'Or men's and women's awards\nOn September 22, the 2025 Ballon d'Or ceremony was held in Paris. Paris Saint‑Germain player Ousmane Dembélé won his first men's Ballon d'Or award, having scored 35 goals and provided 16 assists, helping PSG to win the European Champions League, Ligue 1, and the French Cup. Aitana Bonmati from Barcelona FC won the women's Ballon d'Or award for the third consecutive year.\nIn the Best FIFA Football Awards unveiled at the end of 2025, both Dembélé and Bonmati were also named Best Men's and Women's Players of the Year.\nView original content: https://www.prnewswire.com/news-releases/global-times-top-10-chinese-and-international-sports-news-of-2025-announced-302651483.html\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "11:50:08",
      "Source": "AFP",
      "Title": "Champagnie, Wemby lead Spurs comeback in Knicks thriller",
      "URL": "https://finance.yahoo.com/m/ba587cbf-2d60-3a02-980b-c423c02b90d4/champagnie%2C-wemby-lead-spurs.html",
      "Content": "Champagnie, Wemby lead Spurs comeback in Knicks thriller\n\nAFP\nWed, December 31, 2025 at 7:50 PM PST 3 min read\n\nJulian Champagnie rattled in 11 three-pointers and Victor Wembanyama scored 31 points as the San Antonio Spurs came from behind to defeat the New York Knicks 134-132 in a New Year's Eve thriller on Wednesday.\nSan Antonio, beaten by the Knicks in the NBA Cup final two weeks ago, avenged that loss in sensational fashion after clawing their way back from a 19-point second quarter deficit to score a superb win.\n\nFrench prodigy Wembanyama was instrumental in the victory, leading a determined fightback that included 31 points and 13 rebounds before he exited with a leg injury early in the fourth quarter.\nWembanyama later returned to sit on the bench and celebrated with teammates as the Spurs closed out a roller coaster victory that sees them improve to 24-9 and remain second in the Western Conference.\nWhile Wembanyama played a crucial role in the comeback win, Champagnie provided the offensive spark, unleashing an incredible three-point barrage to finishing with 36 points.\nChampagnie's three-point blitz included four threes in the fourth quarter as San Antonio drew level before pulling clear.\n\"It feels great man -- just go out there and do my job,\" Champagnie said afterwards. \"That's all I can do...I was just trying to shoot the basketball.\"\n\nA crowd of 18,602 at San Antonio's Frost Bank Center had been subdued earlier in the fourth quarter when Wembanyama hobbled off the court following an awkward landing from a rebound.\nWembanyama though later said he expected to make a quick recovery from what he called a left knee hyper-extension.\n\"My body's feeling good, just sore,\" Wembanyama said. \"I'm very confident, optimistic.\n\"I expect to be back next game -- I don't know that (the team) expects,\" he added.\nJalen Brunson led the Knicks scoring with 29 points, with Karl-Anthony Towns finishing with 20.\n- 'Magical' Curry -\nIn other games on Wednesday, the Golden State Warriors maintained their impressive recent run of form with a 132-125 road win over the Charlotte Hornets.\n\nStephen Curry, playing in front of his hometown fans, led the Golden State scoring with 26 points including five three-pointers as the Warriors bagged their fifth victory from their last six games to improve to 18-16 in the Western Conference standings.\nJimmy Butler and Brandin Podziemski backed Curry with 19 points apiece.\nCurry, who had been serenaded with chants of \"MVP\" during a road game in Brooklyn on Monday, was given a warm reception by a record Charlotte crowd of 19.685 fans.\n\nStory Continues\n\"It never ceases to amaze me the support he has everywhere,\" Warriors coach Steve Kerr said of Curry. \"It makes sense given who he is, what he's accomplished, what kind of human being he is...It's a sign of how much Steph impacts people; there's something magical about him.\"\n\nThe Oklahoma City Thunder cruised to a 124-95 victory over the Portland Trail Blazers, with Shai Gilgeous-Alexander scoring 30 points.\nIn other results, the Atlanta Hawks thumped the Minnesota Timberwolves 126-102 thanks to a 34-point display from Jalen Johnson while the Orlando Magic squeezed past the Indiana Pacers 112-110 after 29 points from Paolo Banchero.\nIn Cleveland, Donovan Mitchell outdueled Devin Booker to lead the Cavaliers to a 129-113 blowout over the Phoenix Suns. Mitchell scored 34 points with 10 rebounds and seven assists while Booker finished with 32 points in a losing effort.\nrcw/sla\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "11:40:17",
      "Source": "Simply Wall St.",
      "Title": "Retail investors account for 36% of Tolu Minerals Limited's (ASX:TOK) ownership, while institutions account for 25%",
      "URL": "https://finance.yahoo.com/news/retail-investors-account-36-tolu-034017815.html",
      "Content": "Retail investors account for 36% of Tolu Minerals Limited's (ASX:TOK) ownership, while institutions account for 25%\n\nSimply Wall St\nWed, December 31, 2025 at 7:40 PM PST 4 min read\n\nIn this article: TOLUF\n\nKey Insights The considerable ownership by retail investors in Tolu Minerals indicates that they collectively have a greater say in management and business strategy\n51% of the business is held by the top 12 shareholders\nInsiders have been selling lately\nTrump has pledged to \"unleash\" American oil and gas and these 15 US stocks have developments that are poised to benefit.\n\nA look at the shareholders of Tolu Minerals Limited ( ASX:TOK ) can tell us which group is most powerful. With 36% stake, retail investors possess the maximum shares in the company. That is, the group stands to benefit the most if the stock rises (or lose the most if there is a downturn).\nInstitutions, on the other hand, account for 25% of the company's stockholders. Insiders often own a large chunk of younger, smaller, companies while huge companies tend to have institutions as shareholders.\nLet's take a closer look to see what the different types of shareholders can tell us about Tolu Minerals.\nView our latest analysis for Tolu Minerals\nWhat Does The Institutional Ownership Tell Us About Tolu Minerals? Institutional investors commonly compare their own returns to the returns of a commonly followed index. So they generally do consider buying larger companies that are included in the relevant benchmark index.\nTolu Minerals already has institutions on the share registry. Indeed, they own a respectable stake in the company. This suggests some credibility amongst professional investors. But we can't rely on that fact alone since institutions make bad investments sometimes, just like everyone does. It is not uncommon to see a big share price drop if two large institutional investors try to sell out of a stock at the same time. So it is worth checking the past earnings trajectory of Tolu Minerals, (below). Of course, keep in mind that there are other factors to consider, too.\nHedge funds don't have many shares in Tolu Minerals. Our data shows that ASA Gold and Precious Metals Limited is the largest shareholder with 9.6% of shares outstanding. Meanwhile, the second and third largest shareholders, hold 6.1% and 5.7%, of the shares outstanding, respectively. Furthermore, CEO Christopher Muller is the owner of 0.8% of the company's shares.\n\nLooking at the shareholder registry, we can see that 51% of the ownership is controlled by the top 12 shareholders, meaning that no single shareholder has a majority interest in the ownership.\nWhile studying institutional ownership for a company can add value to your research, it is also a good practice to research analyst recommendations to get a deeper understand of a stock's expected performance. As far as we can tell there isn't analyst coverage of the company, so it is probably flying under the radar.\n\nStory Continues\nInsider Ownership Of Tolu Minerals The definition of an insider can differ slightly between different countries, but members of the board of directors always count. Management ultimately answers to the board. However, it is not uncommon for managers to be executive board members, especially if they are a founder or the CEO.\nI generally consider insider ownership to be a good thing. However, on some occasions it makes it more difficult for other shareholders to hold the board accountable for decisions.\n\nOur information suggests that insiders maintain a significant holding in Tolu Minerals Limited. It has a market capitalization of just AU$342m, and insiders have AU$53m worth of shares in their own names. We would say this shows alignment with shareholders, but it is worth noting that the company is still quite small; some insiders may have founded the business. You can click here to see if those insiders have been buying or selling.\nGeneral Public Ownership With a 36% ownership, the general public, mostly comprising of individual investors, have some degree of sway over Tolu Minerals. This size of ownership, while considerable, may not be enough to change company policy if the decision is not in sync with other large shareholders.\nPrivate Company Ownership Our data indicates that Private Companies hold 24%, of the company's shares. Private companies may be related parties. Sometimes insiders have an interest in a public company through a holding in a private company, rather than in their own capacity as an individual. While it's hard to draw any broad stroke conclusions, it is worth noting as an area for further research.\n\nNext Steps: While it is well worth considering the different groups that own a company, there are other factors that are even more important. Consider for instance, the ever-present spectre of investment risk. We've identified 4 warning signs with Tolu Minerals (at least 3 which are significant) , and understanding them should be part of your investment process.\n\nIf you would prefer check out another company -- one with potentially superior financials -- then do not miss this free list of interesting companies, backed by strong financial data.\nNB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "11:32:53",
      "Source": "Simply Wall St.",
      "Title": "ReadyTech Holdings Limited's (ASX:RDY) top owners are private equity firms with 30% stake, while 25% is held by institutions",
      "URL": "https://finance.yahoo.com/news/readytech-holdings-limiteds-asx-rdy-033253082.html",
      "Content": "ReadyTech Holdings Limited's (ASX:RDY) top owners are private equity firms with 30% stake, while 25% is held by institutions\n\nSimply Wall St\nWed, December 31, 2025 at 7:32 PM PST 5 min read\n\nIn this article: RDY.AX\n\nKey Insights Significant control over ReadyTech Holdings by private equity firms implies that the general public has more power to influence management and governance-related decisions\nThe top 4 shareholders own 54% of the company\n25% of ReadyTech Holdings is held by Institutions\nWe've found 21 US stocks that are forecast to pay a dividend yield of over 6% next year. See the full list for free.\n\nA look at the shareholders of ReadyTech Holdings Limited ( ASX:RDY ) can tell us which group is most powerful. The group holding the most number of shares in the company, around 30% to be precise, is private equity firms. Put another way, the group faces the maximum upside potential (or downside risk).\nInstitutions, on the other hand, account for 25% of the company's stockholders. Generally speaking, as a company grows, institutions will increase their ownership. Conversely, insiders often decrease their ownership over time.\nIn the chart below, we zoom in on the different ownership groups of ReadyTech Holdings.\nSee our latest analysis for ReadyTech Holdings\nWhat Does The Institutional Ownership Tell Us About ReadyTech Holdings? Institutions typically measure themselves against a benchmark when reporting to their own investors, so they often become more enthusiastic about a stock once it's included in a major index. We would expect most companies to have some institutions on the register, especially if they are growing.\n\nAs you can see, institutional investors have a fair amount of stake in ReadyTech Holdings. This suggests some credibility amongst professional investors. But we can't rely on that fact alone since institutions make bad investments sometimes, just like everyone does. If multiple institutions change their view on a stock at the same time, you could see the share price drop fast. It's therefore worth looking at ReadyTech Holdings' earnings history below. Of course, the future is what really matters.\nOur data indicates that hedge funds own 5.0% of ReadyTech Holdings. That worth noting, since hedge funds are often quite active investors, who may try to influence management. Many want to see value creation (and a higher share price) in the short term or medium term. Our data shows that Pemba Capital Partners Pty Limited is the largest shareholder with 30% of shares outstanding. In comparison, the second and third largest shareholders hold about 14% and 5.1% of the stock. In addition, we found that Marc Washbourne, the CEO has 3.6% of the shares allocated to their name.\nOn looking further, we found that 54% of the shares are owned by the top 4 shareholders. In other words, these shareholders have a meaningful say in the decisions of the company.\n\nStory Continues\nResearching institutional ownership is a good way to gauge and filter a stock's expected performance. The same can be achieved by studying analyst sentiments. Quite a few analysts cover the stock, so you could look into forecast growth quite easily.\nInsider Ownership Of ReadyTech Holdings The definition of an insider can differ slightly between different countries, but members of the board of directors always count. Management ultimately answers to the board. However, it is not uncommon for managers to be executive board members, especially if they are a founder or the CEO.\nInsider ownership is positive when it signals leadership are thinking like the true owners of the company. However, high insider ownership can also give immense power to a small group within the company. This can be negative in some circumstances.\n\nWe can report that insiders do own shares in ReadyTech Holdings Limited. As individuals, the insiders collectively own AU$17m worth of the AU$303m company. Some would say this shows alignment of interests between shareholders and the board. But it might be worth checking if those insiders have been selling.\nGeneral Public Ownership With a 24% ownership, the general public, mostly comprising of individual investors, have some degree of sway over ReadyTech Holdings. This size of ownership, while considerable, may not be enough to change company policy if the decision is not in sync with other large shareholders.\nPrivate Equity Ownership With an ownership of 30%, private equity firms are in a position to play a role in shaping corporate strategy with a focus on value creation. Sometimes we see private equity stick around for the long term, but generally speaking they have a shorter investment horizon and -- as the name suggests -- don't invest in public companies much. After some time they may look to sell and redeploy capital elsewhere.\n\nPrivate Company Ownership We can see that Private Companies own 11%, of the shares on issue. It's hard to draw any conclusions from this fact alone, so its worth looking into who owns those private companies. Sometimes insiders or other related parties have an interest in shares in a public company through a separate private company.\n\nNext Steps: While it is well worth considering the different groups that own a company, there are other factors that are even more important.\nI always like to check for a history of revenue growth . You can too, by accessing this free chart of historic revenue and earnings in this detailed graph .\nUltimately the future is most important . You can access this free report on analyst forecasts for the company .\n\nNB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "11:32:40",
      "Source": "Simply Wall St.",
      "Title": "Qassim Cement And 2 Other Undiscovered Gems In The Middle East",
      "URL": "https://finance.yahoo.com/news/qassim-cement-2-other-undiscovered-033240066.html",
      "Content": "Qassim Cement And 2 Other Undiscovered Gems In The Middle East\n\nSimply Wall St\nWed, December 31, 2025 at 7:32 PM PST 4 min read\n\nIn this article: GOLD.TA\n\nRPAC.TA\n\n7211.SR\n\n3002.SR\n\n3040.SR\n\nThe Middle East markets have shown a mixed performance, with Egypt's stock exchange outpacing its Gulf counterparts in 2025, while oil prices and regional tensions have weighed on Saudi Arabia's market sentiment. Amid these dynamics, identifying stocks that can thrive involves looking for companies with strong local economic fundamentals and resilience to broader market fluctuations.\n\nTop 10 Undiscovered Gems With Strong Fundamentals In The Middle East Name\nDebt To Equity\nRevenue Growth\nEarnings Growth\nHealth Rating\nY.D. More Investments\n51.67%\n27.49%\n36.12%\n★★★★★★\nSaudi Azm for Communication and Information Technology\n3.26%\n17.17%\n23.30%\n★★★★★★\nAnalyst I.M.S. Investment Management Services\nNA\n31.20%\n44.24%\n★★★★★★\nTerminal X Online\n12.94%\n13.43%\n44.27%\n★★★★★★\nNajran Cement\n14.49%\n-4.20%\n-30.16%\n★★★★★★\nC. Mer Industries\n76.92%\n13.56%\n68.93%\n★★★★★☆\nAmanat Holdings PJSC\n10.86%\n27.51%\n-0.92%\n★★★★★☆\nAmir Marketing and Investments in Agriculture\n32.43%\n3.87%\n6.98%\n★★★★☆☆\nAjman Bank PJSC\n53.89%\n16.11%\n18.02%\n★★★★☆☆\nBirikim Varlik Yonetim Anonim Sirketi\n59.38%\n42.42%\n36.01%\n★★★★☆☆\n\nClick here to see the full list of 182 stocks from our Middle Eastern Undiscovered Gems With Strong Fundamentals screener.\nBelow we spotlight a couple of our favorites from our exclusive screener.\nQassim Cement Simply Wall St Value Rating: ★★★★★★\nOverview: Qassim Cement Company is involved in the manufacture and sale of cement within the Kingdom of Saudi Arabia, with a market capitalization of SAR4.62 billion.\nOperations: Revenue from manufacturing and selling cement is SAR1.15 billion. The net profit margin has shown fluctuations over recent periods, reflecting changes in operational efficiency and market conditions.\n\nQassim Cement, a debt-free player in the Middle East cement industry, has shown resilience despite some challenges. Over the past year, its earnings grew by 11%, outperforming the Basic Materials sector's -4% performance. Trading at approximately 31% below its estimated fair value, it appears undervalued. Recent earnings for Q3 reported sales of SAR 246 million and net income of SAR 41 million, down from SAR 65 million last year. For nine months ending September 2025, sales reached SAR 843 million with net income at SAR 191 million. The company also declared a quarterly dividend of SAR 0.80 per share payable in December.\nNavigate through the intricacies of Qassim Cement with our comprehensive health report here.\nGain insights into Qassim Cement's historical performance by reviewing our past performance report.\nGold Bond Group Simply Wall St Value Rating: ★★★★★☆\nOverview: The Gold Bond Group Ltd. provides storage, conveyance, and logistical solutions for cargoes and containers, with a market capitalization of ₪904.55 million.\n\nStory Continues\nOperations: Gold Bond Group generates revenue primarily from Free Activities (₪91.88 million), FCL Terminal Operations (₪74.75 million), LCL Terminal Operations (₪57.23 million), and Ecommerce Activity (₪15.76 million).\nGold Bond Group, a smaller player in the Middle East market, has shown impressive earnings growth of 34% over the past year, outpacing its industry peers. The company has effectively reduced its debt to equity ratio from 16.2% to 2.7% in five years and maintains high-quality earnings with more cash than total debt. Recent results highlight sales of ILS 63 million for Q3, up from ILS 52 million last year, though net income saw a slight dip to ILS 7.15 million from ILS 7.43 million. Despite this, Gold Bond remains profitable with strong free cash flow generation and interest coverage capabilities.\nDive into the specifics of Gold Bond Group here with our thorough health report.\nUnderstand Gold Bond Group's track record by examining our Past report.\nRapac Communication & Infrastructure Simply Wall St Value Rating: ★★★★☆☆\nOverview: Rapac Communication & Infrastructure Ltd operates in trade commerce, electrical projects, government services, and electricity production sectors in Israel with a market capitalization of ₪1.14 billion.\nOperations: Rapac Communication & Infrastructure generates revenue primarily from electricity projects (₪779.02 million), trade (₪40.37 million), and power generation (₪7.40 million). The company's net profit margin reflects its financial performance, with adjustments impacting the overall figures.\n\nRapac Communication & Infrastructure, a small-cap player in the Middle East, has seen its earnings grow by 116.9% over the past year, outpacing the construction industry's 3.6%. Despite this impressive growth, the company's interest payments are not well covered by EBIT at 2.7 times coverage. Over five years, Rapac's debt-to-equity ratio improved significantly from 361.8% to a satisfactory 48%, indicating better financial management. However, recent results show a net loss of ILS 8.67 million for Q3 and ILS 4.14 million over nine months in contrast to last year's profits of ILS 20.22 million and ILS 194.53 million respectively.\nClick here to discover the nuances of Rapac Communication & Infrastructure with our detailed analytical health report.\nLearn about Rapac Communication & Infrastructure's historical performance.\nKey Takeaways Access the full spectrum of 182 Middle Eastern Undiscovered Gems With Strong Fundamentals by clicking on this link.\nInvested in any of these stocks? Simplify your portfolio management with Simply Wall St and stay ahead with our alerts for any critical updates on your stocks.\nUnlock the power of informed investing with Simply Wall St, your free guide to navigating stock markets worldwide.\n\nLooking For Alternative Opportunities? Explore high-performing small cap companies that haven't yet garnered significant analyst attention.\nFuel your portfolio with companies showing strong growth potential, backed by optimistic outlooks both from analysts and management .\nFind companies with promising cash flow potential yet trading below their fair value .\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include SASE:3040 TASE:GOLD and TASE:RPAC.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "11:31:35",
      "Source": "Simply Wall St.",
      "Title": "Discover 3 Middle Eastern Dividend Stocks Yielding Up To 6.4%",
      "URL": "https://finance.yahoo.com/news/discover-3-middle-eastern-dividend-033135587.html",
      "Content": "Discover 3 Middle Eastern Dividend Stocks Yielding Up To 6.4%\n\nSimply Wall St\nWed, December 31, 2025 at 7:31 PM PST 4 min read\n\nIn this article: 1010.SR\n\nMZTFF\n\nCBD.AE\n\nYGGYO.IS\n\nNGI.AE\n\nThe Middle Eastern stock markets have shown varied performances recently, with Egypt's bourse outpacing its Gulf counterparts in 2025, while oil prices have weighed on Saudi Arabia's market. In this dynamic environment, dividend stocks can offer investors a potential source of steady income, particularly when local economic fundamentals and corporate earnings are strong.\n\nTop 10 Dividend Stocks In The Middle East Name\nDividend Yield\nDividend Rating\nYeni Gimat Gayrimenkul Yatirim Ortakligi (IBSE:YGGYO)\n5.46%\n★★★★★★\nSaudi Awwal Bank (SASE:1060)\n6.18%\n★★★★★☆\nRiyad Bank (SASE:1010)\n6.45%\n★★★★★☆\nNational General Insurance (P.J.S.C.) (DFM:NGI)\n7.15%\n★★★★★☆\nEmaar Properties PJSC (DFM:EMAAR)\n7.12%\n★★★★★☆\nComputer Direct Group (TASE:CMDR)\n7.35%\n★★★★★☆\nCommercial Bank of Dubai PSC (DFM:CBD)\n5.47%\n★★★★★☆\nBanque Saudi Fransi (SASE:1050)\n6.54%\n★★★★★☆\nArab National Bank (SASE:1080)\n6.01%\n★★★★★☆\nAnadolu Hayat Emeklilik Anonim Sirketi (IBSE:ANHYT)\n5.92%\n★★★★★☆\n\nClick here to see the full list of 59 stocks from our Top Middle Eastern Dividend Stocks screener.\nLet's explore several standout options from the results in the screener.\nRiyad Bank Simply Wall St Dividend Rating: ★★★★★☆\nOverview: Riyad Bank offers banking and investment services in the Kingdom of Saudi Arabia and has a market capitalization of SAR81.08 billion.\nOperations: Riyad Bank's revenue is primarily derived from its Corporate Banking segment at SAR8.94 billion, followed by Retail Banking at SAR4.23 billion, Treasury and Investments at SAR2.39 billion, and Investment Banking and Brokerage at SAR1.07 billion.\n\nDividend Yield: 6.4%\nRiyad Bank's dividend payments are currently covered by earnings with a payout ratio of 54.7%, and future forecasts suggest continued coverage at 49.4%. Despite past volatility, dividends have grown over the last decade, placing Riyad Bank among the top 25% of dividend payers in its market. Recent board changes include appointing Ms. Mona Mohammed Al-Tawil as Audit Committee Chairman, potentially impacting governance positively. The bank's strategic headquarters relocation aligns with its transformation plan.\nClick to explore a detailed breakdown of our findings in Riyad Bank's dividend report.\nIn light of our recent valuation report, it seems possible that Riyad Bank is trading behind its estimated value.\nMouwasat Medical Services Simply Wall St Dividend Rating: ★★★★★☆\nOverview: Mouwasat Medical Services Company operates hospitals, medical centers, drug stores, and pharmacies in Saudi Arabia and has a market cap of SAR13.33 billion.\nOperations: Mouwasat Medical Services Company generates revenue from its Pharmaceuticals segment, which accounts for SAR466.90 million, and its Medical Services segment, contributing SAR2.63 billion.\n\nStory Continues\nDividend Yield: 3%\nMouwasat Medical Services offers a stable dividend yield of 3%, supported by earnings with a payout ratio of 79.4% and cash flows at 56.9%. The company's dividends have been reliable over the past decade, though not among the highest in its market. Recent earnings showed growth, with net income rising to SAR 199.66 million for Q3 2025. Expansion plans include a new hospital in Abha, financed through local banks and internal funds, potentially enhancing future revenue streams.\nNavigate through the intricacies of Mouwasat Medical Services with our comprehensive dividend report here.\nAccording our valuation report, there's an indication that Mouwasat Medical Services' share price might be on the cheaper side.\nMizrahi Tefahot Bank Simply Wall St Dividend Rating: ★★★★☆☆\nOverview: Mizrahi Tefahot Bank Ltd., along with its subsidiaries, offers international, commercial, domestic, and personal banking services to individuals and businesses in Israel and internationally, with a market cap of ₪57.81 billion.\nOperations: Mizrahi Tefahot Bank Ltd. generates revenue through its diverse range of banking services, catering to both individual and business clients across international and domestic markets.\n\nDividend Yield: 3.8%\nMizrahi Tefahot Bank's dividend yield of 3.79% is modest compared to top-tier Israeli dividend payers, but its payout ratio of 45.2% indicates dividends are well-covered by earnings, with future coverage projected at 43.5%. Despite a decade-long increase in payments, the bank's dividends have been volatile and unreliable due to significant annual drops. Recent Q3 results show stable earnings growth with net income reaching ILS 1.48 billion, supporting continued dividend sustainability amidst market fluctuations.\nClick here and access our complete dividend analysis report to understand the dynamics of Mizrahi Tefahot Bank.\nIn light of our recent valuation report, it seems possible that Mizrahi Tefahot Bank is trading beyond its estimated value.\nKey Takeaways Investigate our full lineup of 59 Top Middle Eastern Dividend Stocks right here.\nAre any of these part of your asset mix? Tap into the analytical power of Simply Wall St's portfolio to get a 360-degree view on how they're shaping up.\nEnhance your investing ability with the Simply Wall St app and enjoy free access to essential market intelligence spanning every continent.\n\nReady To Venture Into Other Investment Styles? Explore high-performing small cap companies that haven't yet garnered significant analyst attention.\nFuel your portfolio with companies showing strong growth potential, backed by optimistic outlooks both from analysts and management .\nFind companies with promising cash flow potential yet trading below their fair value .\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include SASE:1010 SASE:4002 and TASE:MZTF.\nThis article was originally published by Simply Wall St .\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "11:30:58",
      "Source": "Benzinga",
      "Title": "Paul Krugman Says Trump's Policies Hurting MAGA's Small Business Base, Economist Warns America Moved Rapidly Toward 'Crony Capitalism'",
      "URL": "https://finance.yahoo.com/news/paul-krugman-says-trumps-policies-033058379.html",
      "Content": "Paul Krugman Says Trump's Policies Hurting MAGA's Small Business Base, Economist Warns America Moved Rapidly Toward 'Crony Capitalism'\n\nVishaal Sanjay\nWed, December 31, 2025 at 7:30 PM PST 3 min read\n\nSmall business owners, long considered the core of President Donald Trump’s political base, are now increasingly feeling the brunt of his policies during his second term in office, according to economist Paul Krugman .\n2025 Was A ‘Miserable Year’ For Small Businesses In his newsletter on Monday, Krugman stated that the small business community, which had celebrated Trump’s return to the White House, had a “miserable” year in 2025, and warned that “2026 will be worse.”\nThe Nobel Prize-winning economist cited research that showed “the experience of being a small business owner leads people to adopt conservative views on government regulation,” but he said these expectations have since collided with policy reality over the past year.\n\nDon't Miss:\nIf there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it ?\n7 Million Gamers Already Trust Gameflip With Their Digital Assets — Now You Can Own a Stake in the Platform\nKrugman said the combined impact of Trump's tariffs and immigration enforcement has created significant operational strain for small business owners.\n“High tariffs have been a body blow” to companies dependent on imported products, he said, adding that “mass arrests of immigrants have also been highly disruptive for businesses, such as construction contractors, that depend on foreign-born workers.”\nWhile these pressures affect all companies, Krugman said large corporations have been better positioned to adapt by finding new suppliers, exploiting trade agreement exemptions and leveraging political influence.\n\n“Under Trump, the United States has moved rapidly toward crony capitalism,” Krugman said, citing the example of Apple Inc. (NASDAQ: AAPL ) receiving exemptions on its smartphone imports from India, despite punitive tariffs on the country’s other exports.\nTrending: Earn While You Scroll: The Deloitte-Ranked #1 Software Company Growing 32,481% Is Opening Its $0.50/Share Round to Accredited Investors.\nSmall businesses, on the other hand, cannot get such preferential exemptions based on their political connections, Krugman said.\nThis pressure is now being compounded by rising health care costs, Krugman said, while noting that “almost half of the adults receiving health insurance via the government-run exchanges” either own or work for small businesses, which means the expiration of federal subsidies has had an outsized impact.\n\nSmall Businesses And Exporters Hit By Tariffs There have been several stories recently, covering small businesses that became unsustainable and were even driven to bankruptcy following Trump’s tariffs on India and China.\n\nStory Continues\nSee Also: Missed Tesla? EnergyX Is Tackling the Next $200 Billion Opportunity — Lithium\nOwners have railed against skyrocketing input costs, canceled contracts and looming bankruptcies, while increasingly contrasting former President Ronald Reagan's pro-trade legacy with the tariff-heavy direction of Trump and the modern Republican Party.\n\nAccording to former U.S. Trade Representative Roy Kirk , the chaos surrounding Trump’s tariff policies is doing great harm to small businesses and even exporters.\n“Over 90% of US exporters are small businesses and family-owned businesses. And this is just driving them nuts trying to figure out what the rules of the road are going to be,” he said.\nRead Next: Have $100k+ to invest? Charlie Munger says that's the toughest milestone — don't stall now. Get matched with a fiduciary advisor and keep building\nPhoto Courtesy: A.PAES on Shutterstock.com\nUNLOCKED: 5 NEW TRADES EVERY WEEK. Click now to get top trade ideas daily , plus unlimited access to cutting-edge tools and strategies to gain an edge in the markets.\nGet the latest stock analysis from Benzinga:\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Paul Krugman Says Trump's Policies Hurting MAGA's Small Business Base, Economist Warns America Moved Rapidly Toward 'Crony Capitalism' originally appeared on Benzinga.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "11:20:00",
      "Source": "Variety",
      "Title": "This Year’s Top New Year’s Eve Broadcasts — and Where to Stream Them Live Online Free",
      "URL": "https://finance.yahoo.com/m/260d0583-e1de-3349-b135-6feb7ff85244/this-year%E2%80%99s-top-new-year%E2%80%99s.html",
      "Content": "This Year’s Top New Year’s Eve Broadcasts — and Where to Stream Them Live Online Free\n\nAnna Tingley\nWed, December 31, 2025 at 7:20 PM PST 2 min read\n\nIf you purchase an independently reviewed product or service through a link on our website, Variety may receive an affiliate commission.\nAs the calendar flips and viewers once again choose between braving the cold or celebrating from the couch, television networks are rolling out their annual New Year’s Eve spectacles. This year’s lineup includes a mix of musical performances, celebrity hosts and live countdowns designed to carry audiences into the new year. From “Dick Clark’s New Year’s Rockin’ Eve” to Anderson Cooper and Andy Cohen’s more PG-13 CNN special, here’s a look at the biggest New Year’s Eve broadcasts airing this year and how to stream them live at home.\n\nMore from Variety\nEmmy-Winning Producer Bill Bracken Joins Dick Clark Prods. as Exec VP of Production\nCBS Seals 5-Year Deal for American Music Awards, Expanding Partnership With Dick Clark Prods.\nDick Clark Productions Hires Mike Chuthakieo as Company's First-Ever Chief Commercial Officer\n‘Dick Clark’s New Year’s Rockin’ Eve’ ABC once again anchors the night with “Dick Clark’s New Year’s Rockin’ Eve,” the most watched New Year’s Eve program on television. Hosted by Ryan Seacrest, the long-running special kicks off in primetime and stretches through midnight, offering a steady parade of chart-topping performances and live check-ins from Times Square and other U.S. cities before culminating in the iconic ball drop. Cable-cutters can watch the broadcast live via streaming TV services that carry ABC, including DirecTV , Sling TV, Hulu + Live TV and Fubo .\n\nSTREAM LIVE ON DIRECTV Free Trial\n‘CNN New Year’s Eve Live’ Over on cable, CNN continues to position itself as the looser, adult-leaning alternative with “CNN New Year’s Eve Live,” hosted by Anderson Cooper and Andy Cohen. Broadcasting live from Times Square, this year’s special promises special guests such as Brandi Carlisle, Sarah Squirm, Leanne Morgan and Patti LaBelle. The broadcast will air live on CNN and is also available to stream through live-TV streaming bundles such as DirecTV , Hulu + Live TV and Sling TV (with the news add-on).\n\nSTREAM LIVE ON DIRECTV Free Trial\n‘New Year’s Eve Live: Nashville’s Big Bash’ CBS offers a different flavor of celebration with New Year’s Eve Live: Nashville’s Big Bash, which broadcasts from downtown Nashville and leans heavily into country music and live performances. Airing in primetime on CBS, the concert-style special doubles as a showcase for the network’s music-event programming strategy and has become a reliable alternative for viewers less interested in Times Square spectacle. The show streams live for subscribers to Paramount+ with Showtime , while CBS affiliates also carry the broadcast over the air.\n\nSTREAM LIVE ON PARAMOUNT+ Free Trial\n‘A Toast to the New Year’ NBC rounds out the major-network offerings with “A Toast to the New Year,” which this year reunites former “Today” co-hosts Hoda Kotb and Jenna Bush. The dynamic duo will take a look back at the year’s most memorable moments, with special guest appearances from Howie Mandel, Kristin Chenowethm Ethan Slater, Jim Gaffigan and more. The broadcast airs live on NBC and is available to stream in real time on Peacock for subscribers.\nSTREAM LIVE ON PEACOCK $7.99/Month\n\nBest of Variety\nNew Movies Out Now in Theaters: What to See This Week\nWhat’s Coming to Netflix in January 2026\nOscar Predictions: Post-Shortlist Shake-Up as Studio Behemoths Rule and International Cinema Cracks the Door Wider\nSign up for Variety's Newsletter . For the latest news, follow us on Facebook , Twitter , and Instagram .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "11:20:00",
      "Source": "Motley Fool",
      "Title": "Prediction: This Will Be the Next AI Stock That Berkshire Hathaway Buys",
      "URL": "https://finance.yahoo.com/m/42624a10-9ce8-3ead-a5bd-92216bc5aae5/prediction%3A-this-will-be-the.html",
      "Content": "Prediction: This Will Be the Next AI Stock That Berkshire Hathaway Buys\n\nKeithen Drury, The Motley Fool\nWed, December 31, 2025 at 7:20 PM PST 5 min read\n\nIn this article: BRK.A\n\nAMZN\n\nKey Points Warren Buffett retired at the end of 2025, and Greg Abel will take his place in 2026.\nAmazon stock might be back on the menu for Berkshire, but there are a few caveats.\n10 stocks we like better than Amazon ›\nWith legendary CEO Warren Buffett's time complete with Berkshire Hathaway , many investors are wondering where the company will go under the direction of new CEO Greg Abel. Buffett and Berkshire have been staunch value investors for multiple decades, but could this transition indicate a shift in investment philosophy?\nI wouldn't be surprised if Berkshire becomes more aggressive with Abel at the helm, and maybe invests in an artificial intelligence (AI) stock or two. But which one will it buy?\nBerkshire already owns some AI stocks The number of companies that fall under the artificial intelligence investing umbrella is quite large. There are software applications, facilitators, hardware plays, or even infrastructure, including energy companies. Berkshire already owns a few stocks that I'd consider AI plays, including Amazon (NASDAQ: AMZN) and Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) . Berkshire added Alphabet to its portfolio during Q3 2025, and this recent addition has already made it a ton of money.\n\nThe next AI stock Berkshire may purchase could be one it already owns, and I wouldn't be surprised if Amazon is one of the next stocks it adds to. Berkshire first took a stake in Amazon in 2019 and has added to that position over time, but hasn't purchased any Amazon shares in a while. Berkshire owns an even 10 million shares of Amazon, which sounds like a ton. However, Amazon is only a 0.8% stake in Berkshire's investment portfolio. With Amazon being an undersize portion of Berkshire's portfolio compared to the outsize returns it could generate, it makes sense that the conglomerate may elect to add shares in 2026.\nAfter a so-so start to 2025, Amazon is really starting to gain momentum in the second half of 2025. Net sales rose 13% year over year to $180 billion, with recent high growth rates in several of its key business units. Amazon Web Services (AWS, its cloud computing segment) and advertising services each posted the best growth in multiple quarters. This is key, as both of these business units have much greater operating margins than other commerce-focused business units.\nIn Q3, AWS made up 66% of Amazon's total operating profit despite only generating 18% of total sales. With AWS' growth reaccelerating and it projected to continue that strength into 2026, that bodes well for Amazon's profit picture.\n\nStory Continues\nAmazon doesn't break out the advertising service's operating margin as it does with AWS. Still, if you look at other advertising-focused businesses like Alphabet and Meta Platforms (NASDAQ: META) , it's clear that this business unit likely has operating margins in the 30% to 40% range, which is far higher than the whole company's operating margin.\nContinued success of these two business units is key for Amazon, but is it enough for Berkshire to warrant purchasing shares?\nOne of the possible minds behind the first Amazon purchase is gone Buffett wasn't the only portfolio manager at Berkshire Hathaway. Todd Combs and Ted Weschler also had some purchasing power, and they were known to purchase more tech-focused investments than Buffett did. Todd Combs is no longer a part of Berkshire, as he accepted a position at JPMorgan Chase . If Combs was the original purchaser of Amazon shares, this may not bode well for Amazon's future inclusion in Berkshire's investment portfolio. But if it was Ted Weschler, it may be on his shopping list.\n\nOne of Berkshire's core investment philosophies is to buy great companies at good prices. Most investors would agree that Amazon is a great company, but what's a good price?\nThe best metric to value Amazon's stock is the operating price-to-earnings ratio. The standard P/E ratio isn't a great measure for Amazon, as it has a significant investment portfolio whose gains and losses can cause its diluted earnings per share (EPS) metric to rise and fall, even if Amazon didn't sell any of its investments. By this metric, Amazon is the cheapest it has been in some time.\nWith Amazon trading at the bottom end of its recent range and expected to have a strong 2026, I wouldn't be surprised if Berkshire decides to add some more Amazon shares to its portfolio. Time will tell where Greg Abel wants to lead this business, but I'd be shocked if he didn't start spending some of the cash Buffett piled up during his last few years as CEO.\n\nShould you buy stock in Amazon right now? Before you buy stock in Amazon, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Amazon wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $505,749 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,149,658 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 979 % — a market-crushing outperformance compared to 195% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 29, 2025\nJPMorgan Chase is an advertising partner of Motley Fool Money. Keithen Drury has positions in Alphabet, Amazon, and Meta Platforms. The Motley Fool has positions in and recommends Alphabet, Amazon, Berkshire Hathaway, JPMorgan Chase, and Meta Platforms. The Motley Fool has a disclosure policy .\nPrediction: This Will Be the Next AI Stock That Berkshire Hathaway Buys was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "06:45:05",
      "Source": "Zacks",
      "Title": "Why the Market Dipped But TSMC (TSM) Gained Today",
      "URL": "https://finance.yahoo.com/news/why-market-dipped-tsmc-tsm-224505328.html",
      "Content": "Why the Market Dipped But TSMC (TSM) Gained Today\n\nZacks Equity Research\nWed, December 31, 2025 at 2:45 PM PST 3 min read\n\nIn this article: TSM\n\nTSMWF\n\n^GSPC\n\n^DJI\n\nIn the latest close session, TSMC (TSM) was up +1.44% at $303.89. The stock outperformed the S&P 500, which registered a daily loss of 0.74%. Meanwhile, the Dow experienced a drop of 0.63%, and the technology-dominated Nasdaq saw a decrease of 0.76%.\nPrior to today's trading, shares of the chip company had gained 2.56% outpaced the Computer and Technology sector's gain of 0.14% and the S&P 500's gain of 0.79%.\n\nThe upcoming earnings release of TSMC will be of great interest to investors. The company is predicted to post an EPS of $2.72, indicating a 21.43% growth compared to the equivalent quarter last year. In the meantime, our current consensus estimate forecasts the revenue to be $32.6 billion, indicating a 21.26% growth compared to the corresponding quarter of the prior year.\nLooking at the full year, the Zacks Consensus Estimates suggest analysts are expecting earnings of $10.17 per share and revenue of $121 billion. These totals would mark changes of +44.46% and +34.32%, respectively, from last year.\nInvestors should also take note of any recent adjustments to analyst estimates for TSMC. Such recent modifications usually signify the changing landscape of near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the business outlook.\n\nOur research shows that these estimate changes are directly correlated with near-term stock prices. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.\nThe Zacks Rank system, which varies between #1 (Strong Buy) and #5 (Strong Sell), carries an impressive track record of exceeding expectations, confirmed by external audits, with stocks at #1 delivering an average annual return of +25% since 1988. Over the past month, there's been a 0.21% fall in the Zacks Consensus EPS estimate. Right now, TSMC possesses a Zacks Rank of #3 (Hold).\nLooking at its valuation, TSMC is holding a Forward P/E ratio of 29.47. For comparison, its industry has an average Forward P/E of 29.47, which means TSMC is trading at no noticeable deviation to the group.\n\nMeanwhile, TSM's PEG ratio is currently 1.03. The PEG ratio is akin to the commonly utilized P/E ratio, but this measure also incorporates the company's anticipated earnings growth rate. The Semiconductor - Circuit Foundry industry had an average PEG ratio of 1.03 as trading concluded yesterday.\nThe Semiconductor - Circuit Foundry industry is part of the Computer and Technology sector. Currently, this industry holds a Zacks Industry Rank of 108, positioning it in the top 44% of all 250+ industries.\n\nStory Continues\nThe Zacks Industry Rank is ordered from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nKeep in mind to rely on Zacks.com to watch all these stock-impacting metrics, and more, in the succeeding trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nTaiwan Semiconductor Manufacturing Company Ltd. (TSM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "06:43:46",
      "Source": "Investor's Business Daily",
      "Title": "Dow Jones, Stock Market Fall To Key Levels To End 2025; Tesla, Palantir, Nvidia Chipmaker In Focus",
      "URL": "https://finance.yahoo.com/m/57ea6d61-b23e-34a7-9d2f-99385d66cfd2/dow-jones%2C-stock-market-fall.html",
      "Content": "Dow Jones, Stock Market Fall To Key Levels To End 2025; Tesla, Palantir, Nvidia Chipmaker In Focus\n\nED CARSON\nWed, December 31, 2025 at 2:43 PM PST 6 min read\n\nIn this article: TSLA\n\nXPEV\n\nPLTR\n\nNVDA\n\n^GSPC\n\nThe stock market fell to end a solid 2025. Palantir and Nvidia chipmaker Taiwan Semi were in focus. Tesla deliveries loom.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "06:00:43",
      "Source": "Investor's Business Daily",
      "Title": "Dow Jones Futures: Market Tests Key Levels To End 2025; Tesla, Palantir, Nvidia Chipmaker In Focus",
      "URL": "https://finance.yahoo.com/m/57ea6d61-b23e-34a7-9d2f-99385d66cfd2/dow-jones-futures%3A-market.html",
      "Content": "Dow Jones Futures: Market Tests Key Levels To End 2025; Tesla, Palantir, Nvidia Chipmaker In Focus\n\nED CARSON\nWed, December 31, 2025 at 2:00 PM PST 6 min read\n\nIn this article: TSLA\n\nPLTR\n\nNVDA\n\n^DJI\n\n^GSPC\n\nThe stock market fell to end a solid 2025. Palantir and Nvidia chipmaker Taiwan Semi were in focus. Tesla deliveries loom.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "05:53:53",
      "Source": "MT Newswires",
      "Title": "US Equities Fall in Final 2025 Session; Indexes Still Post Solid Annual Gains",
      "URL": "https://finance.yahoo.com/news/us-equities-fall-final-2025-215353579.html",
      "Content": "PREMIUM\nUS Equities Fall in Final 2025 Session; Indexes Still Post Solid Annual Gains\n\nMT Newswires\nWed, December 31, 2025 at 1:53 PM PST 2 min read\n\nIn this article: ^DJI\n\nTDG\n\nGFS\n\n^SPX\n\nAXSM\n\nUS equity benchmarks fell Wednesday in the final session of 2025 as stock gauges still logged solid\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "05:24:12",
      "Source": "MT Newswires",
      "Title": "Market Chatter: Taiwan Semiconductor Granted Annual License to Move US Manufacturing Equipment to China",
      "URL": "https://finance.yahoo.com/news/market-chatter-taiwan-semiconductor-granted-212412387.html",
      "Content": "PREMIUM\nMarket Chatter: Taiwan Semiconductor Granted Annual License to Move US Manufacturing Equipment to China\n\nMT Newswires\nWed, December 31, 2025 at 1:24 PM PST 1 min read\n\nIn this article: TSM\n\nSSNLF\n\n000660.KS\n\nTaiwan Semiconductor Manufacturing (TSM) has received an annual license from the US government to mo\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "05:18:18",
      "Source": "MT Newswires",
      "Title": "US Equity Indexes Lower Amid Mixed Economic Data",
      "URL": "https://finance.yahoo.com/news/us-equity-indexes-lower-amid-211818399.html",
      "Content": "PREMIUM\nUS Equity Indexes Lower Amid Mixed Economic Data\n\nMT Newswires\nWed, December 31, 2025 at 1:18 PM PST 2 min read\n\nIn this article: ^IXIC\n\n^GSPC\n\n^DJI\n\nCL=F\n\nNG=F\n\nUS equity indexes fell on Wednesday, with all sectors posting declines amid mixed macroeconomic data\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "04:59:33",
      "Source": "MT Newswires",
      "Title": "Sector Update: Tech Stocks Fall Late Afternoon",
      "URL": "https://finance.yahoo.com/news/sector-tech-stocks-fall-afternoon-205933305.html",
      "Content": "PREMIUM\nSector Update: Tech Stocks Fall Late Afternoon\n\nMT Newswires\nWed, December 31, 2025 at 12:59 PM PST 1 min read\n\nIn this article: MSFT\n\nTDG\n\nGFS\n\nTSM\n\nXLK\n\nTech stocks declined late Wednesday afternoon with the State Street Technology Select Sector SPDR ET\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "04:27:36",
      "Source": "Reuters",
      "Title": "U.S. grants TSMC annual licence to import U.S. chipmaking tools into China",
      "URL": "https://finance.yahoo.com/news/u-grants-tsmc-annual-licence-202736879.html",
      "Content": "U.S. grants TSMC annual licence to import U.S. chipmaking tools into China\n\nHyunjoo Jin\nWed, December 31, 2025 at 12:27 PM PST 1 min read\n\nIn this article: TSM\n\nSSNLF\n\n000660.KS\n\nBy Hyunjoo Jin\nSEOUL, Jan 1 (Reuters) - The U.S. government has granted an annual licence to Taiwan ​Semiconductor Manufacturing to import U.S. chip manufacturing ‌equipment to its facilities in Nanjing, China, the chipmaker said on ‌Thursday.\nThe approval \"ensures uninterrupted fab operations and product deliveries,\" the company said in a statement to Reuters.\n\nSouth Korea's Samsung Electronics and SK Hynix have also received similar import ⁠licences.\nPreviously, the Asian companies ‌had benefited from exemptions from Washington's sweeping restrictions on chip-related exports to China, part ‍of U.S. efforts to try to stay ahead of China in technological development.\nBut those privileges - known as validated end-user status - ​expired on December 31 and the companies had ‌to seek U.S. export licences instead for 2026.\n\"The U.S. Department of Commerce has granted TSMC Nanjing an annual export license that allows U.S. export-controlled items to be supplied to TSMC Nanjing without the need for ⁠individual vendor licenses,\" TSMC said ​in its statement.\nIt added the licence \"ensures ​uninterrupted fab operations and product deliveries\".\nThe Nanjing plant makes 16-nanometre and other mature node chips - ‍not TSMC's ⁠most-advanced semiconductors. TSMC also has a chipmaking plant in Shanghai.\nIn its 2024 annual report, TSMC said ⁠its Nanjing site generated about 2.4% of overall revenue.\n(Reporting by Hyunjoo ‌Jin and Wen-Yee Lee; Editing by Chizu ‌Nomiyama, Rod Nickel, Neil Fullick)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "04:27:36",
      "Source": "Reuters",
      "Title": "Washington grants TSMC annual approval for US chipmaking tool shipments to China",
      "URL": "https://finance.yahoo.com/news/us-grants-annual-approval-tsmc-202736751.html",
      "Content": "Washington grants TSMC annual approval for US chipmaking tool shipments to China\n\nReuters\nWed, December 31, 2025 at 12:27 PM PST 1 min read\n\nIn this article: TSM\n\nSSNLF\n\nSEOUL, Jan 1 (Reuters) - The U.S. government has granted an annual license to Taiwan ​Semiconductor Manufacturing to import U.S. chip ‌manufacturing equipment to its facilities in Nanjing, China, the chipmaker ‌said on Thursday.\nThe approval \"ensures uninterrupted fab operations and product deliveries,\" the company said in a statement to Reuters.\n\nTSMC joins South Korea's Samsung Electronics ⁠and SK Hynix ‌in gaining approval for shipments of U.S. chipmaking tools to China.\nThose Asian ‍companies had benefited from exemptions to Washington's sweeping restrictions on chip-related exports to China. But the privilege known ​as validated end-user status expired on December ‌31, meaning shipments of American equipment to chipmakers' factories in China from 2026 would require U.S. export licences.\n\"The U.S. Department of Commerce has granted TSMC Nanjing an annual export license that ⁠allows U.S. export-controlled items ​to be supplied to TSMC ​Nanjing without the need for individual vendor licenses,\" TSMC said in a statement ‍to Reuters.\n\"This ⁠license, issued before the December 31, 2025 expiration of existing Validated End-User (VEU) authorization, ensures ⁠uninterrupted fab operations and product deliveries,\" it said.\n(Reporting by ‌Hyunjoo Jin and Wen-Yee Lee; Editing by ‌Chizu Nomiyama, Rod Nickel)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "04:16:12",
      "Source": "MT Newswires",
      "Title": "US Equity Indexes Slip in Final Leg of Trading",
      "URL": "https://finance.yahoo.com/news/us-equity-indexes-slip-final-201612715.html",
      "Content": "PREMIUM\nUS Equity Indexes Slip in Final Leg of Trading\n\nMT Newswires\nWed, December 31, 2025 at 12:16 PM PST 1 min read\n\nIn this article: TSM\n\n^SPX\n\nSUUN\n\nNKE\n\n^GSPC\n\nUS equity indexes were lower ahead of the close on Wednesday, with all sectors posting declines amid\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "03:13:58",
      "Source": "Yahoo Finance Video",
      "Title": "Nvidia taps TSMC for more H200 chips due to China demand: Reuters",
      "URL": "https://finance.yahoo.com/video/nvidia-taps-tsmc-more-h200-191358361.html",
      "Content": "Nvidia taps TSMC for more H200 chips due to China demand: Reuters\n\nYahoo Finance Video\nWed, December 31, 2025 at 11:13 AM PST\n\nIn this video: TSM\n\nFMCC\n\nFMCCH\n\nFMCCK\n\nFMCCL\n\nYahoo Finance Markets and Data Editor Jared Blikre tracks Wednesday's top moving stocks and biggest market stories in this Market Minute .\nMortgage rates were at their lowest level of 2025 through Tuesday, with the 30-year rate at 6.15%, according to data from Freddie Mac ( FMCC ).\nNvidia ( NVDA ) has reportedly asked Taiwan Semiconductor Manufacturing Company ( TSM ) to ramp up production of its H200 artificial intelligence (AI) to meet high demand, according to Reuters .\nStay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.\n\nVideo Transcript\n\n00:03 Speaker A\nIt's time for Yahoo Finance's market minute.\n00:05 Speaker A\nUS stocks struggle for gains on the final day of the year.\n00:08 Speaker A\nLosses are dimming hopes for a so-called Santa Claus rally, but that window does not officially close until Monday, January 5th.\n00:14 Speaker A\nBut stocks still notching impressive gains for 2025 despite an eventful roller coaster trading year.\n00:19 Speaker A\nAnd mortgage rates hit a fresh 2025 low in the final week of the year.\n00:22 Speaker A\nThe average 30-year mortgage rate was 6.15% through Tuesday, according to Freddy Mac data.\n00:26 Speaker A\nRates began the year around 7%.\n00:28 Speaker A\nPlus, Nvidia is reportedly in a scramble to meet strong demand for its H200 AI chips.\n00:33 Speaker A\nAccording to Reuters, the chipmaker has approached chip fab company Taiwan Semi to ramp up production.\n00:39 Speaker A\nNvidia is facing Chinese tech company orders of over 2 million H200 chips for 2026, according to the report.\n00:44 Speaker A\nAnd that is your Yahoo Finance market minute.\n00:46 Speaker A\nScan the QR code below to track the best and worst performing stocks of the trading session.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "02:56:44",
      "Source": "MT Newswires",
      "Title": "Sector Update: Tech Stocks Lower in Wednesday Afternoon Trading",
      "URL": "https://finance.yahoo.com/news/sector-tech-stocks-lower-wednesday-185644869.html",
      "Content": "PREMIUM\nSector Update: Tech Stocks Lower in Wednesday Afternoon Trading\n\nMT Newswires\nWed, December 31, 2025 at 10:56 AM PST 1 min read\n\nIn this article: TSM\n\nGFS\n\nNVDA\n\nXLK\n\nTDG\n\nTech stocks declined Wednesday afternoon, with the State Street Technology Select Sector SPDR ETF (X\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "02:54:26",
      "Source": "MT Newswires",
      "Title": "US Equities Fall Intraday as Losing Streak Grows But Wall Street Eyes 2025 Gains",
      "URL": "https://finance.yahoo.com/news/us-equities-fall-intraday-losing-185426569.html",
      "Content": "PREMIUM\nUS Equities Fall Intraday as Losing Streak Grows But Wall Street Eyes 2025 Gains\n\nMT Newswires\nWed, December 31, 2025 at 10:54 AM PST 2 min read\n\nIn this article: ^GSPC\n\n^DJI\n\n^IXIC\n\nNVDA\n\nUS equity benchmarks were lower intraday with 2025 drawing to a close amid a four-day run of losses,\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "01:31:56",
      "Source": "Investor's Business Daily",
      "Title": "Nvidia's China Chip Sees Surging Demand, Stock Gains; Is Nvidia A Buy Or Sell Now?",
      "URL": "https://finance.yahoo.com/m/5adf8837-b47a-3ef6-a6b0-10429f92d31c/nvidia%27s-china-chip-sees.html",
      "Content": "Nvidia's China Chip Sees Surging Demand, Stock Gains; Is Nvidia A Buy Or Sell Now?\n\nVIDYA RAMAKRISHNAN\nWed, December 31, 2025 at 9:31 AM PST 4 min read\n\nIn this article: NVDA\n\nTSM\n\nNvidia stock rebounded from its 50-day moving average amid reports that demand for its China H200 chip is soaring.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "00:45:00",
      "Source": "MT Newswires",
      "Title": "Top Midday Stories: Nvidia Approaches TSMC in Quest to Boost H200 Chip Production; Corcept Faces Setback From FDA on Hypertension Drug",
      "URL": "https://finance.yahoo.com/news/top-midday-stories-nvidia-approaches-164500182.html",
      "Content": "PREMIUM\nTop Midday Stories: Nvidia Approaches TSMC in Quest to Boost H200 Chip Production; Corcept Faces Setback From FDA on Hypertension Drug\n\nMT Newswires\nWed, December 31, 2025 at 8:45 AM PST 2 min read\n\nIn this article: NVDA\n\nNKE\n\nAXSM\n\nDJT\n\nTSLA\n\nAll three major US stock indexes were down in late-morning trading Wednesday as the year winds to a\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "00:42:04",
      "Source": "Insider Monkey",
      "Title": "Intel Corporation (INTC) Falls as Nvidia Stops Testing its Intel 18",
      "URL": "https://finance.yahoo.com/news/intel-corporation-intc-falls-nvidia-164204662.html",
      "Content": "Intel Corporation (INTC) Falls as Nvidia Stops Testing its Intel 18\n\nTalha Qureshi\nWed, December 31, 2025 at 8:42 AM PST 2 min read\n\nIn this article: INTC\n\nNVDA\n\n^GSPC\n\nTSM\n\nIntel Corporation (NASDAQ: INTC ) is among the Best Performing Quantum Computing Stocks in 2025 . The share price of Intel Corporation (NASDAQ:INTC) fell around 3.54% on December 24, driven by Nvidia stopping the test run of Intel’s 18, which is a manufacturing process. The stock price has gained back 3.2% since the drop on Wednesday.\n\nIntel’s 18 is a process that makes chip-making more efficient and faster. According to a report by Bloomberg released on the same day, the investors are mainly concerned because this process, which Nvidia has halted, was expected to help Intel Corporation (NASDAQ:INTC) compete with Taiwan Semiconductor Manufacturing Company. The news has raised concerns regarding the company’s ability to push forward in this competition. Moreover, this halt comes despite Nvidia’s $5 billion investment in Intel.\nThat said, Intel Corporation (NASDAQ:INTC) has gained around 80% year-to-date, surpassing the S&P 500 and Nvidia’s performance. Recently, on December 22, Bank of America Securities upgraded the credit rating of the company to Overweight from Market Weight. The firm noted that the company’s lower exposure to the AI demand cycle can act as a protection from the broader AI investment overheating concerns.\n\nMoreover, the firm also raised its fiscal 2025 and 2026 EBITDA estimates by 20% and 18%. BofA sees the company’s leverage improving further in 2026, driven by improving balance sheets, strong AI-driven demand, and attractive valuation compared to its peers.\nIntel Corporation (NASDAQ:INTC) designs, develops, manufactures, markets, and sells computing and related products and services worldwide. It operates through Intel Products, Intel Foundry, and All Other segments.\nWhile we acknowledge the potential of INTC as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "00:13:10",
      "Source": "Insider Monkey",
      "Title": "Is TSMC (TSM) One of the Best Stocks for the Next Decade?",
      "URL": "https://finance.yahoo.com/news/tsmc-tsm-one-best-stocks-161310947.html",
      "Content": "Is TSMC (TSM) One of the Best Stocks for the Next Decade?\n\nMaham Fatima\nWed, December 31, 2025 at 8:13 AM PST 2 min read\n\nIn this article: TSM\n\nTSMWF\n\nNVDA\n\nTaiwan Semiconductor Manufacturing Co. Ltd. (NYSE: TSM ) is one of the best stocks for the next decade . Wall Street analysts continue to be bullish on TSMC.\nEarlier on December 7, Bernstein raised the firm’s price target on Taiwan Semiconductor Manufacturing Co. Ltd. (NYSE:TSM) to $330 from $290 with an Outperform rating. The firm highlighted that TSMC is ramping up its Chip-on-Wafer-on-Substrate capacity to 125,000 wafers per month by the end of 2026. While an increase, Bernstein noted that this capacity will barely suffice to meet the demand for Nvidia’s upcoming Blackwell and Rubin chip architectures through 2025 and 2026, leaving little room for additional projects.\nLater on December 10, the analysts at Bernstein SocGen Group reaffirmed their Outperform rating and $330 price target for Taiwan Semiconductor Manufacturing Co. Ltd. (NYSE:TSM) and noted that the firm is currently outpacing both its own fourth-quarter guidance and market consensus. This optimism follows a strong November revenue report, where TSMC recorded NT$344 billion, which marked a significant 24.5% increase year-over-year.\n\nThe company’s strategic importance in the AI ecosystem continues to attract bullish sentiment across Wall Street. Beyond Bernstein’s target, BofA raised its own price objective to $360, citing TSMC’s clear trajectory in the AI sector. With production ramping up for next-gen AI accelerators and the latest mobile processors, TSMC remains the primary gateway for the hardware required to power global high-performance computing.\nTaiwan Semiconductor Manufacturing Co. Ltd. (NYSE:TSM), together with its subsidiaries, manufactures, packages, tests, and sells ICs and other semiconductor devices in Taiwan, China, Europe, the Middle East, Africa, Japan, the US, and internationally.\nWhile we acknowledge the potential of TSM as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "00:09:14",
      "Source": "GuruFocus.com",
      "Title": "TSMC Shares Rise on AI Demand and Next-Gen Chip Launch",
      "URL": "https://finance.yahoo.com/news/tsmc-shares-rise-ai-demand-160914862.html",
      "Content": "TSMC Shares Rise on AI Demand and Next-Gen Chip Launch\n\nNauman Khan\nWed, December 31, 2025 at 8:09 AM PST 1 min read\n\nIn this article: TSM\n\nTSMWF\n\nNVDA\n\nAAPL\n\nThis article first appeared on GuruFocus .\nTaiwan Semiconductor Manufacturing (TSMC) shares rose about 2% on Wednesday morning after the company began mass production of its 2-nanometre (N2) chips.\nTSMC said the N2 technology, rolling out in the fourth quarter of fiscal 2025, offers high transistor density and improved energy efficiency. The company described the chips as the most advanced in the semiconductor sector.\n\nIs TSM fairly valued? Test your thesis with our free DCF calculator.\nThe Taiwanese contract chipmaker supplies components for devices ranging from smartphones to high-performance servers. Its clients include Nvidia ( NASDAQ:NVDA ) and Apple ( NASDAQ:AAPL ), both of which are investing heavily in artificial intelligence infrastructure and data centers.\nMore than half of global semiconductors, including nearly all high-end AI chips, are manufactured in Taiwan, giving TSMC a central role in global chip supply. The company has benefited from rising AI demand, with clients expanding spending on advanced chips, servers, and supporting infrastructure.\nIndustry analysts view the 2nm ramp as a critical step for TSMC to maintain technological leadership and capture growing AI-related revenue streams.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2026-01-01",
      "Time": "00:07:14",
      "Source": "GuruFocus.com",
      "Title": "Nvidia Seeks to Ramp H200 Supply",
      "URL": "https://finance.yahoo.com/news/nvidia-seeks-ramp-h200-supply-160714763.html",
      "Content": "Nvidia Seeks to Ramp H200 Supply\n\nMoz Farooque ACCA\nWed, December 31, 2025 at 8:07 AM PST 1 min read\n\nIn this article: NVDA\n\nTSM\n\nBABA\n\nTCEHY\n\nThis article first appeared on GuruFocus .\nNvidia ( NASDAQ:NVDA ) is running into a good problem to have : demand from China for its H200 AI chips is way ahead of what it can supply.\nAccording to Reuters, Chinese tech companies have already lined up orders for around 2 million H200 GPUs. Nvidia, meanwhile, is sitting on roughly 700K units, including about 100K of its GH200 Grace Hopper systems. That gap is big enough that Nvidia has reportedly gone back to Taiwan Semiconductor (TSM) to see if production can be ramped up. Those talks are said to be active, with extra output possibly starting as early as Q2 2026.\n\nWarning! GuruFocus has detected 5 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nThe timing isn't random. Chinese firms are opening their wallets again for AI hardware. ByteDance is reportedly planning to spend about $14 billion on Nvidia GPUs next year, while Tencent and Alibaba ( NYSE:BABA ) are finding workarounds to secure advanced chips.\nNvidia says approved sales to China won't hurt U.S. supply and stressed that it's constantly juggling its supply chain. Shares of Nvidia and TSM ticked higher premarket, as investors digested just how strong global AI demand remains.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "23:59:12",
      "Source": "GuruFocus.com",
      "Title": "Nvidia Seeks TSMC Talks as China Orders Outpace H200 GPU Supply",
      "URL": "https://finance.yahoo.com/news/nvidia-seeks-tsmc-talks-china-155912134.html",
      "Content": "Nvidia Seeks TSMC Talks as China Orders Outpace H200 GPU Supply\n\nKhac Phu Nguyen\nWed, December 31, 2025 at 7:59 AM PST 2 min read\n\nIn this article: NVDA\n\nTSMWF\n\nTSM\n\nThis article first appeared on GuruFocus .\nNvidia ( NASDAQ:NVDA ) has held discussions with Taiwan Semiconductor ( NYSE:TSM ) about potentially increasing production of its H200 GPUs as demand from China accelerates, according to Reuters. Sources cited by the report said Chinese technology companies have placed orders totaling around 2 million H200 GPUs, while Nvidia currently has roughly 700,000 units available, including about 100,000 GH200 Grace Hopper CPU-GPU combinations, with the remainder being H200 GPUs. While the exact scale of any additional production remains unclear, one source indicated that talks have already taken place and manufacturing could possibly begin as early as the second quarter of 2026.\n\nWarning! GuruFocus has detected 5 Warning Signs with PFE.\nIs TSM fairly valued? Test your thesis with our free DCF calculator.\nThe return of Nvidia's higher-end chips could be welcomed by Chinese technology firms navigating supply constraints. Separately, the South China Morning Post reported that ByteDance intends to spend about $14 billion on Nvidia GPUs in 2026 to support its computing needs. At the same time, Tencent ( TCEHY ) reportedly has access to Nvidia's Blackwell GPUs through a third party in Japan, while Alibaba ( NYSE:BABA ) has placed orders with AMD ( NASDAQ:AMD ) for some of its MI308 AI accelerators, underscoring how major Chinese players are diversifying sourcing strategies for advanced AI hardware.\nPolicy developments could still influence how much of this demand ultimately converts into shipments. Earlier this month, President Trump said he had approved the sale of Nvidia's H200 GPUs to China while requesting a 25% cut of the sales, adding that similar terms would apply to competitors including AMD and Intel ( NASDAQ:INTC ). China has not yet decided whether to allow imports of the H200 GPUs, and prior media reports have suggested authorities could limit them over concerns about domestic semiconductor development. Nvidia has already been approved to export its H20 chips, a less powerful China-specific version, after agreeing in August to pay the U.S. government 15% of related revenue, although China has restricted access to those H20 chips.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "23:35:29",
      "Source": "TipRanks",
      "Title": "Mixed options sentiment in Taiwan Semi with shares up 0.62%",
      "URL": "https://finance.yahoo.com/news/mixed-options-sentiment-taiwan-semi-153529381.html",
      "Content": "Mixed options sentiment in Taiwan Semi with shares up 0.62%\n\nTipRanks\nWed, December 31, 2025 at 7:35 AM PST 1 min read\n\nIn this article: TSM\n\nTSMWF\n\nMixed options sentiment in Taiwan Semi ( TSM ), with shares up $1.88, or 0.62%, near $302.80. Options volume roughly in line with average with 24k contracts traded and puts leading calls for a put/call ratio of 1.12, compared to a typical level near 1.11. Implied volatility (IV30) dropped 0.1 near 33.73,and below the 52wk median, suggesting an expected daily move of $6.43. Put-call skew flattened, suggesting a modestly bullish tone.Looking ahead: Taiwan Semi (TSM) will report earnings after the close on None.Option markets are pricing in a 50% probability of a move greater than 0.0% or $0.00.\n\nClaim 70% Off TipRanks This Holiday Season Unlock hedge fund-level data and powerful investing tools for smarter, sharper decisions\nStay ahead of the market with the latest news and analysis and maximize your portfolio's potential\nPublished first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>>\nSee Insiders’ Hot Stocks on TipRanks >>\nRead More on TSM:\nDisclaimer & Disclosure Report an Issue\nKey Chip Decision! U.S. Approves Samsung, SK Hynix Tool Shipments to China\n3 Best ETFs to Invest In, According to AI Analyst, 12/25/2025\nIntel Stock (NASDAQ:INTC) Slips Despite Power of Fab 52\nAMD and Google Tap Samsung’s Texas Fab for AI Chips\nTSMC Details Major Capex Approvals and NT$23.5 Billion Bond Issuance for November 2025\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "23:08:51",
      "Source": "24/7 Wall St.",
      "Title": "Market Movers: Nike Exploding Higher on Insider Buying",
      "URL": "https://finance.yahoo.com/m/eb4470cd-8230-3b86-95fd-46d425fab0e8/market-movers%3A-nike-exploding.html",
      "Content": "Market Movers: Nike Exploding Higher on Insider Buying\n\nIan Cooper\nWed, December 31, 2025 at 7:08 AM PST 3 min read\n\nIn this article: NKE\n\nAXSM\n\nTSMWF\n\nAAPL\n\nNVDA\n\nQuick Read Nike CEO Elliott Hill bought 16,400 shares for about $1 million. This follows news that Apple’s Tim Cook bought $3 million worth of Nike stock.\nThe U.S. FDA granted priority review of the Axsome’s marketing application seeking a label expansion for its depression therapy AXS-05 in Alzheimer’s disease agitation.\nNvidia asked TSMC to help ramp up production of its H200 artificial intelligence chips.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "22:51:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Has Barely Budged Since the End of July. What Gets It Going Again.",
      "URL": "https://finance.yahoo.com/m/586cab0b-f177-3383-83f7-a7f71f2dd3c2/nvidia-stock-has-barely.html",
      "Content": "Nvidia Stock Has Barely Budged Since the End of July. What Gets It Going Again.\n\nAdam Clark\nWed, December 31, 2025 at 6:51 AM PST 2 min read\n\nIn this article: NVDA\n\nAMD\n\nAVGO\n\nTSM\n\nTSMWF\n\nNvidia shares are drifting but reports of strong demand for its artificial-intelligence processors in China could point the way to future gains.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "22:30:39",
      "Source": "GuruFocus.com",
      "Title": "Nvidia Stock Rises as China Orders Surge for H200 AI Chips",
      "URL": "https://finance.yahoo.com/news/nvidia-stock-rises-china-orders-143039535.html",
      "Content": "Nvidia Stock Rises as China Orders Surge for H200 AI Chips\n\nNauman Khan\nWed, December 31, 2025 at 6:30 AM PST 1 min read\n\nIn this article: NVDA\n\nTSM\n\nThis article first appeared on GuruFocus .\nNvidia ( NASDAQ:NVDA ) shares rose about 1% on Wednesday morning after the company approached Taiwan Semiconductor Manufacturing ( NYSE:TSM ) to expand production of its H200 AI chips.\nChinese technology firms have placed orders for more than 2 million H200 units for delivery in 2026, while Nvidia holds roughly 700,000 chips in current inventory. Production at TSMC is expected to start in the second quarter of next year.\n\nWarning! GuruFocus has detected 5 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nThe H200 is part of Nvidia's Hopper architecture and uses TSMC's 4-nanometer process. Details on exact volumes and pricing remain private, sources familiar with the matter said.\nNvidia plans to ship the first batch from existing stock before the Lunar New Year in mid-February. Prices are reported around $27,000 per chip, varying by customer and volume.\nThe expansion comes as Nvidia prepares its next-generation Blackwell and Rubin chips. Analysts note the move may further tighten global AI chip supplies, as strong Chinese demand competes with limited availability elsewhere.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "22:24:47",
      "Source": "Yahoo Finance Video",
      "Title": "Nvidia asks TSMC to ramp up H200 production, Paramount's WBD offer",
      "URL": "https://finance.yahoo.com/video/nvidia-asks-tsmc-ramp-h200-142447946.html",
      "Content": "Nvidia asks TSMC to ramp up H200 production, Paramount's WBD offer\n\nYahoo Finance Video 及 Brian Sozzi\nWed, December 31, 2025 at 6:24 AM PST\n\nIn this video: NVDA\n\nTSM\n\nNKE\n\nWBD\n\nTSMWF\n\nYahoo Finance executive editor Brian Sozzi tracks several of the day's top trending stock tickers, including how Warner Bros. Discovery ( WBD ) is expected to reject Paramount Skydance's ( PSKY ) latest hostile takeover bid, Nike ( NKE ) shares gaining on CEO Elliott Hill purchase of $1 million in the company's stock, and Reuters reporting that Nvidia ( NVDA ) has asked Taiwan Semiconductor Manufacturing Company ( TSM ) to ramp up AI chip production to help with H200 orders.\nTo watch more expert insights and analysis on the latest market action, check out more Morning Brief .\n\nVideo Transcript\n\n00:00 Speaker A\nLet's hit some Yahoo Finance's trending tickers. We're watching Warner Brothers Discovery, Nike and Nvidia. First up, WBD.\n00:05 Speaker A\nThe media giant is reportedly set to reject Paramount's latest takeover bid next week after the board's upcoming meeting.\n00:11 Speaker A\nParamount recently took its bid hostile and made changes to sweeten its offer, including guaranteeing a backstop from Oracle billionaire CEO Larry Ellison, but it didn't raise the $30 per share price tag, which is higher than the Netflix deal.\n00:22 Speaker A\nNext, Nike. Shares are rising ahead of the opening bell, thanks to another insider stock buy, just days after a long time uh board director Tim Cook snapped up the beaten-down stock.\n00:32 Speaker A\nNike CEO Elliot Hill is also jumping in. According to a regulatory filing, he'll purchase roughly $1 million worth of Nike shares.\n00:41 Speaker A\nIt's Hill's first open market purchase of uh stock since taking over as CEO in October 2024.\n00:47 Speaker A\nFinally, Nvidia. The chip giant reportedly seeing strong demand for its H2 chips from Chinese tech companies and, according to Reuters, the company has approached Taiwan Semiconductor to ramp up production.\n00:56 Speaker A\nThe report says Nvidia has got on orders for 2 million chips, but only has an inventory of 700,000.\n1:02 Speaker A\nBut there's still a big risk for Nvidia. Despite the high demand, Beijing still has to approve any shipments of H200 chips, which hasn't happened yet.\n\n條款 及 私隱政策\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "22:06:46",
      "Source": "Investor's Business Daily",
      "Title": "Nvidia Asks TSMC To Boost H200 Production Amid China Demand",
      "URL": "https://finance.yahoo.com/m/c645cc88-356c-3955-9633-128b4510d9fe/nvidia-asks-tsmc-to-boost.html",
      "Content": "Nvidia Asks TSMC To Boost H200 Production Amid China Demand\n\nPATRICK SEITZ\nWed, December 31, 2025 at 6:06 AM PST 1 min read\n\nIn this article: NVDA\n\nTSM\n\nNvidia has asked contract chipmaker TSMC to increase production of H200 AI chips to meet strong China demand.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "21:54:43",
      "Source": "MT Newswires",
      "Title": "Exchange-Traded Funds, Equity Futures Lower Pre-Bell Wednesday on Last Trading Day of 2025",
      "URL": "https://finance.yahoo.com/news/exchange-traded-funds-equity-futures-135443950.html",
      "Content": "PREMIUM\nExchange-Traded Funds, Equity Futures Lower Pre-Bell Wednesday on Last Trading Day of 2025\n\nMT Newswires\nWed, December 31, 2025 at 5:54 AM PST 3 min read\n\nIn this article: BTC-USD\n\nETH-USD\n\nQQQ\n\nSPY\n\n^GSPC\n\nThe broad market exchange-traded fund SPDR S&P 500 ETF Trust (SPY) was down 0.1% and the actively tr\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "21:48:06",
      "Source": "MT Newswires",
      "Title": "Sector Update: Tech Stocks Lean Lower Pre-Bell Wednesday",
      "URL": "https://finance.yahoo.com/news/sector-tech-stocks-lean-lower-134806864.html",
      "Content": "PREMIUM\nSector Update: Tech Stocks Lean Lower Pre-Bell Wednesday\n\nMT Newswires\nWed, December 31, 2025 at 5:48 AM PST 1 min read\n\nIn this article: NVDA\n\nTSM\n\nXLK\n\nMRT\n\nTechnology stocks were leaning lower pre-bell Wednesday, with the State Street Technology Select Sec\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "21:32:24",
      "Source": "MT Newswires",
      "Title": "Sector Update: Tech",
      "URL": "https://finance.yahoo.com/news/sector-tech-133224256.html",
      "Content": "PREMIUM\nSector Update: Tech\n\nMT Newswires\nWed, December 31, 2025 at 5:32 AM PST\n\nIn this article: TSM\n\nXLK\n\nNVDA\n\nTechnology stocks were leaning lower pre-bell Wednesday, with the State Street Technology Select Sec\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "21:06:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Is Drifting. This Could Get It Going Again.",
      "URL": "https://finance.yahoo.com/m/586cab0b-f177-3383-83f7-a7f71f2dd3c2/nvidia-stock-is-drifting..html",
      "Content": "Nvidia Stock Is Drifting. This Could Get It Going Again.\n\nAdam Clark\nWed, December 31, 2025 at 5:06 AM PST 2 min read\n\nIn this article: NVDA\n\nAMD\n\nAVGO\n\nTSM\n\nTSMWF\n\nNvidia shares are drifting but reports of strong demand for its artificial-intelligence processors in China could point the way to future gains.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "20:20:16",
      "Source": "24/7 Wall St.",
      "Title": "Nvidia (NASDAQ: NVDA) Stock Price Prediction for 2026: Where Will It Be in 1 Year (Dec 31)",
      "URL": "https://finance.yahoo.com/m/fbc40b68-e691-3ac2-ac6e-c468b91245d1/nvidia-%28nasdaq%3A-nvda%29-stock.html",
      "Content": "Nvidia (NASDAQ: NVDA) Stock Price Prediction for 2026: Where Will It Be in 1 Year (Dec 31)\n\nJoel South\nWed, December 31, 2025 at 4:20 AM PST 6 min read\n\nIn this article: NVDA\n\nTM\n\nTOYOF\n\nTSM\n\nTSMWF\n\nShares of Nvidia Corp. ( NASDAQ: NVDA ) have retreated fractionally in the past week, after it announced a $14 billion order for chips from ByteDance and finalized a $5 billion investment in Intel. Nvidia’s stock is 18.7% higher than six months ago, outperforming the S&P 500 and Nasdaq in that time.\n\n24/7 Wall St. Key Points U.S.-China trade relations have presented headwinds, but Nvidia Corp. ( NASDAQ: NVDA ) is also the dominant AI chipmaker in the market, and the company’s profitability remains strong.\nHere is a look at where Nvidia stock could be headed for the rest of this year and into the next.\nA recent study identified one single habit that doubled Americans’ retirement savings and moved retirement from dream, to reality.",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "19:48:41",
      "Source": "Reuters Videos",
      "Title": "AI Weekly: Meta wants Manus, AI investors want more in 2026",
      "URL": "https://finance.yahoo.com/video/ai-weekly-meta-wants-manus-114841639.html",
      "Content": "AI Weekly: Meta wants Manus, AI investors want more in 2026\n\nReuters Videos\nWed, December 31, 2025 at 3:48 AM PST\n\nIn this video: META\n\nTSM\n\nNVDA\n\nSTORY: From Meta's plans for Manus... to the AI outlook for investors in 2026. This is AI Weekly. :: AI Weekly Meta has said it will buy Chinese-founded startup Manus as the tech giant accelerates efforts to integrate advanced AI across its platforms. Financial terms were not released, but a source told Reuters the deal values Manus at between $2 billion and $3 billion. Manus went viral early this year on X after it released what it claimed was the world's first general AI agent, capable of making decisions and executing tasks autonomously with less prompting than ChatGPT and DeepSeek. The company was cheered by Chinese state television, with commentators calling it China's next DeepSeek. Nvidia is reportedly scrambling to meet strong demand for its H200 artificial intelligence chips from Chinese technology companies. And according to sources, has approached contract manufacturer TSMC to ramp up production. They added that Chinese tech firms have placed orders for more than 2 million H200 chips for 2026, while Nvidia currently holds just 700,000 units in stock. SoftBank Group said it completed a $41 billion investment in OpenAI. The move is one of the largest-ever private funding rounds that would give the Japanese firm a stake of about 11% in the ChatGPT maker. Artificial intelligence software developer Eliza Labs has ended its lawsuit accusing billionaire Elon Musk’s X Corp of extracting valuable information from the company before launching copycat AI products. A federal judge in Texas dismissed the case, after Eliza Labs and X said that they agreed to dismissal with prejudice, meaning the case cannot be refiled. X had denied wrongdoing. And as global markets closed out the year, they remained buoyed by strong fundamentals and rising capital flows into growth markets, amplified by an AI-driven investment boom. And that is expected to continue into 2026 as investors keep channelling capital into AI-linked infrastructure, foundries and supply chains. As well as betting on growth from data centers, advanced chip making, and next-generation computing.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "18:30:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Stock Is in a Rut. This Could Get It Going Again.",
      "URL": "https://finance.yahoo.com/m/586cab0b-f177-3383-83f7-a7f71f2dd3c2/nvidia-stock-is-in-a-rut..html",
      "Content": "Nvidia Stock Is in a Rut. This Could Get It Going Again.\n\nAdam Clark\nWed, December 31, 2025 at 2:30 AM PST 2 min read\n\nIn this article: NVDA\n\nAMD\n\nAVGO\n\nTSM\n\nTSMWF\n\nNvidia shares are drifting but reports of strong demand for its artificial-intelligence processors in China could point the way to future gains.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "18:25:40",
      "Source": "Insider Monkey",
      "Title": "Is Advanced Micro Devices (AMD) the Best New Stock from David Tepper’s Portfolio?",
      "URL": "https://finance.yahoo.com/news/advanced-micro-devices-amd-best-102540614.html",
      "Content": "Is Advanced Micro Devices (AMD) the Best New Stock from David Tepper’s Portfolio?\n\nHamna Asim\nWed, December 31, 2025 at 2:25 AM PST 2 min read\n\nIn this article: AMD\n\nSSNLF\n\nTSM\n\nAdvanced Micro Devices, Inc. (NASDAQ:AMD) is one of the new stocks David Tepper has bought . As of December 29, the average price target for AMD suggests an upside of 34%; however, the Street high indicates an upside of 77%. In Q3 2025, David Tepper purchased 950,000 shares of AMD valued at $153.70 million, making it the billionaire’s largest new position during Q3. Since December 15, the market has been abuzz with speculation that Samsung could potentially strike a deal with AMD to provide 2nm AI chips. This comes in light of the N-2 rule likely hindering Taiwan Semiconductor from manufacturing its most complicated nodes abroad. Reports suggest that Samsung’s Executive Chairman, Lee Jae-yong, had a meeting with AMD CEO Lisa Su as well as other Big Tech executives, to discuss the company’s foundry business and consequent business arrangements. The 2nm chipsets could power AMD's CPUs in the future, and a deal with Samsung could be closed in January 2026.\nPhoto by JESHOOTS.COM on Unsplash Separately, Piper Sandler maintained an Overweight rating on Advanced Micro Devices on December 15, with a $280 price target, representing 33% upside from current levels. Overall, Wall Street analysts had a consensus Strong Buy rating on the stock. Piper remained optimistic about AMD’s short- and mid-term drivers, particularly noting the company’s ability to meet technical targets such as the MI300 series ramp and technical progress for the MI400 series rollout. Analysts also expect further sales growth this year. The firm also told investors that AMD is putting notable resources into the Helios rack, which is slated for release in mid-2026. The company intends to widen its clientele beyond OpenAI, even though part of its new business is expected from that partnership. Piper Sandler noted that AMD’s finances seem to be sorted, and it can fund its development plans. While we acknowledge the potential of AMD as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: Dow 20 Stocks List: Ranked By Hedge Fund Bullishness Index and 10 Unstoppable Dividend Stocks to Buy Now . Disclosure. None.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "18:01:37",
      "Source": "MT Newswires",
      "Title": "Update: Market Chatter: Nvidia Seeks to Boost H200 Chip Output as China Demand Surges",
      "URL": "https://finance.yahoo.com/news/market-chatter-nvidia-seeks-boost-100137937.html",
      "Content": "PREMIUM\nUpdate: Market Chatter: Nvidia Seeks to Boost H200 Chip Output as China Demand Surges\n\nMT Newswires\nWed, December 31, 2025 at 2:01 AM PST 1 min read\n\nIn this article: NVDA\n\nTSM\n\n(Update to add Nvidia's comment in the fifth and sixth paragraphs.) Nvidia (NVDA) has approached\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "17:32:03",
      "Source": "MT Newswires",
      "Title": "Taiwan Semiconductor Manufacturing Begins Volume Production of N2 Chips",
      "URL": "https://finance.yahoo.com/news/taiwan-semiconductor-manufacturing-begins-volume-093203837.html",
      "Content": "PREMIUM\nTaiwan Semiconductor Manufacturing Begins Volume Production of N2 Chips\n\nMT Newswires\nWed, December 31, 2025 at 1:32 AM PST\n\nIn this article: TSM\n\nTaiwan Semiconductor Manufacturing (TSM) has begun volume production of its 2nm, or N2, technology,\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nCondiciones y Política de privacidad\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "17:18:28",
      "Source": "MT Newswires",
      "Title": "Market Chatter: Nvidia Seeks to Boost H200 Chip Output as China Demand Surges",
      "URL": "https://finance.yahoo.com/news/market-chatter-nvidia-seeks-boost-091828089.html",
      "Content": "PREMIUM\nMarket Chatter: Nvidia Seeks to Boost H200 Chip Output as China Demand Surges\n\nMT Newswires\nWed, December 31, 2025 at 1:18 AM PST 1 min read\n\nIn this article: NVDA\n\nTSM\n\nNvidia (NVDA) has approached Taiwan Semiconductor Manufacturing (TSM) to meet strong demand for its\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "15:44:33",
      "Source": "Reuters",
      "Title": "Exclusive: Nvidia sounds out TSMC on new H200 chip order as China demand jumps, sources say",
      "URL": "https://finance.yahoo.com/news/exclusive-nvidia-sounds-tsmc-h200-074433953.html",
      "Content": "Exclusive: Nvidia sounds out TSMC on new H200 chip order as China demand jumps, sources say\n\nReuters\nUpdated Wed, December 31, 2025 at 3:10 AM PST 4 min read\n\nIn this article: NVDA\n\nTSM\n\nDec 31 (Reuters) - Nvidia ( NVDA ) is scrambling to meet strong demand for its H200 artificial intelligence chips from Chinese technology companies and has approached contract manufacturer Taiwan Semiconductor Manufacturing Co ( TSM ) to ramp up production, sources said.\nChinese technology companies have placed orders for more than 2 million H200 chips for 2026, while Nvidia currently holds ​just 700,000 units in stock, two of the people said.\n\nThe exact additional volume Nvidia intends to order from TSMC remains unclear, they said. A third source said Nvidia has asked ‌TSMC to begin production of the additional chips, and work is expected to start in the second quarter of 2026.\nThe moves raise concerns over whether there could be further tightening in global AI chip supplies as Nvidia now has ‌to strike the right balance between meeting robust Chinese demand and addressing constrained supplies elsewhere.\n\nThey could also intensify risks for Nvidia, as Beijing has yet to greenlight any shipments of H200 chips. The administration of U.S. President Donald Trump only recently allowed exports of the H200 to China.\nThe talks between Nvidia and TSMC and details of the Chinese demand have not been reported before. The pricing has also not been reported earlier - Nvidia has decided which H200 variants it will offer to Chinese clients and price them around $27,000 per chip, the sources said.\n\nNvidia said in response to a request for comment that it ⁠continuously manages its supply chain.\n\"Licensed sales of the H200 to authorised ‌customers in China will have no impact on our ability to supply customers in the United States,\" a spokesperson said.\n\"China is a highly competitive market with rapidly growing local chip suppliers. Blocking all U.S. exports undercut our national and economic security and only benefited foreign competition.\"\nTSMC declined to comment and ‍China's Ministry of Industry and Information Technology did not immediately respond to a request for comment. Reuters spoke to five people for this story, who declined to be named as the discussions are private.\nThe potential order would mark a significant expansion of H200 production at a time when Nvidia has been focused on ramping up its newer Blackwell and upcoming Rubin chip lines. The H200, part of Nvidia's previous-generation Hopper architecture, uses ​TSMC's 4-nanometer manufacturing process.\nNvidia plans to fulfil initial orders from existing stock with the first batch of H200 chips expected to arrive before the Lunar New Year holiday in mid-February, Reuters ‌reported earlier this month.\n\nStory continues\nCHINESE TECH GIANTS DRIVE DEMAND The bulk of the orders of over 2 million chips for 2026 has come from major Chinese internet companies, which view the H200 as a significant upgrade over chips currently available to them, two of the people said.\nOf Nvidia's current 700,000-unit inventory, around 100,000 are GH200 Grace Hopper superchips, which combine Nvidia's Grace CPU with the Hopper GPU architecture, while the remainder are standalone H200 chips, one of them said.\n\nBoth variants will be offered to Chinese clients, the person said.\nWhile Nvidia has indicated a pricing ballpark to the Chinese customers, it would vary based on purchase volume and specific customer arrangements, said two of the people.\nAn eight-chip module is expected to cost around 1.5 million yuan, making it slightly more expensive than the ⁠now-unavailable H20 module, which previously sold for around 1.2 million yuan, they said.\nHowever, given that the H200 delivers ​roughly six times the performance of the H20 - a downgraded chip Nvidia designed specifically for the Chinese market that ​was later blocked by Beijing from being shipped into China - the sources said Chinese internet firms view the pricing as attractive.\nThe price also represents a roughly 15% discount compared to grey-market alternatives, which currently retail at over 1.75 million yuan, according to the sources.\n\nByteDance plans to spend about 100 billion yuan on ‍Nvidia's chips in 2026, up from roughly 85 billion ⁠yuan in 2025, if China allows H200 sales, the South China Morning Post reported on Wednesday, citing sources.\nREGULATORY UNCERTAINTY PERSISTS The planned shipments follow Trump's decision earlier this month to allow H200 sales to China with a 25% fee, reversing the Biden administration's ban on advanced AI chip exports to China.\nHowever, Chinese officials are still deciding whether to allow ⁠H200 imports amid concerns that access to advanced foreign chips could slow development of the domestic AI semiconductor industry.\nBut they have not signaled immediate opposition. While Chinese chipmakers have managed to come up with products that rival the H20 ‌in performance, there are not yet any equivalents of the H200.\nOne proposal under consideration would require bundling each H200 purchase with a certain ratio of domestically produced ‌chips, Reuters previously reported.\n(Reporting by Liam Mo, Wen-Yee Lee and Brenda Goh; Editing by Muralikumar Anantharaman)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "15:44:33",
      "Source": "Reuters",
      "Title": "Exclusive-Nvidia sounds out TSMC on new H200 chip order as China demand jumps, sources say",
      "URL": "https://finance.yahoo.com/news/exclusive-nvidia-sounds-tsmc-h200-074433953.html",
      "Content": "Exclusive-Nvidia sounds out TSMC on new H200 chip order as China demand jumps, sources say\n\nReuters\nTue, December 30, 2025 at 11:44 PM PST 4 min read\n\nIn this article: NVDA\n\nTSM\n\nDec 31 (Reuters) - Nvidia is scrambling to meet strong demand for its H200 artificial intelligence chips from Chinese technology companies and has approached contract manufacturer Taiwan Semiconductor Manufacturing Co to ramp up production, sources said.\nChinese technology companies have placed orders for more than 2 million H200 chips for 2026, while Nvidia currently holds ​just 700,000 units in stock, two of the people said.\n\nThe exact additional volume Nvidia intends to order from TSMC remains unclear, they said. A third source said Nvidia has asked ‌TSMC to begin production of the additional chips, and work is expected to start in the second quarter of 2026.\nThe moves raise concerns over whether there could be further tightening in global AI chip supplies as Nvidia now has ‌to strike the right balance between meeting robust Chinese demand and addressing constrained supplies elsewhere.\nThey could also intensify risks for Nvidia, as Beijing has yet to greenlight any shipments of H200 chips. The administration of U.S. President Donald Trump only recently allowed exports of the H200 to China.\nThe talks between Nvidia and TSMC and details of the Chinese demand have not been reported before. The pricing has also not been reported earlier - Nvidia has decided which H200 variants it will offer to Chinese clients and price them around $27,000 per chip, the sources said.\n\nNvidia said in response to a request for comment that it ⁠continuously manages its supply chain.\n\"Licensed sales of the H200 to authorised ‌customers in China will have no impact on our ability to supply customers in the United States,\" a spokesperson said.\n\"China is a highly competitive market with rapidly growing local chip suppliers. Blocking all U.S. exports undercut our national and economic security and only benefited foreign competition.\"\nTSMC declined to comment and ‍China's Ministry of Industry and Information Technology did not immediately respond to a request for comment. Reuters spoke to five people for this story, who declined to be named as the discussions are private.\nThe potential order would mark a significant expansion of H200 production at a time when Nvidia has been focused on ramping up its newer Blackwell and upcoming Rubin chip lines. The H200, part of Nvidia's previous-generation Hopper architecture, uses ​TSMC's 4-nanometer manufacturing process.\nNvidia plans to fulfil initial orders from existing stock with the first batch of H200 chips expected to arrive before the Lunar New Year holiday in mid-February, Reuters ‌reported earlier this month.\n\nStory Continues\nCHINESE TECH GIANTS DRIVE DEMAND\nThe bulk of the orders of over 2 million chips for 2026 has come from major Chinese internet companies, which view the H200 as a significant upgrade over chips currently available to them, two of the people said.\nOf Nvidia's current 700,000-unit inventory, around 100,000 are GH200 Grace Hopper superchips, which combine Nvidia's Grace CPU with the Hopper GPU architecture, while the remainder are standalone H200 chips, one of them said.\n\nBoth variants will be offered to Chinese clients, the person said.\nWhile Nvidia has indicated a pricing ballpark to the Chinese customers, it would vary based on purchase volume and specific customer arrangements, said two of the people.\nAn eight-chip module is expected to cost around 1.5 million yuan, making it slightly more expensive than the ⁠now-unavailable H20 module, which previously sold for around 1.2 million yuan, they said.\nHowever, given that the H200 delivers ​roughly six times the performance of the H20 - a downgraded chip Nvidia designed specifically for the Chinese market that ​was later blocked by Beijing from being shipped into China - the sources said Chinese internet firms view the pricing as attractive.\nThe price also represents a roughly 15% discount compared to grey-market alternatives, which currently retail at over 1.75 million yuan, according to the sources.\n\nByteDance plans to spend about 100 billion yuan on ‍Nvidia's chips in 2026, up from roughly 85 billion ⁠yuan in 2025, if China allows H200 sales, the South China Morning Post reported on Wednesday, citing sources.\nREGULATORY UNCERTAINTY PERSISTS\nThe planned shipments follow Trump's decision earlier this month to allow H200 sales to China with a 25% fee, reversing the Biden administration's ban on advanced AI chip exports to China.\nHowever, Chinese officials are still deciding whether to allow ⁠H200 imports amid concerns that access to advanced foreign chips could slow development of the domestic AI semiconductor industry.\nBut they have not signaled immediate opposition. While Chinese chipmakers have managed to come up with products that rival the H20 ‌in performance, there are not yet any equivalents of the H200.\nOne proposal under consideration would require bundling each H200 purchase with a certain ratio of domestically produced ‌chips, Reuters previously reported.\n(Reporting by Liam Mo, Wen-Yee Lee and Brenda Goh; Editing by Muralikumar Anantharaman)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "08:36:48",
      "Source": "AFP",
      "Title": "TSMC says started mass production of 'most advanced' 2nm chips",
      "URL": "https://finance.yahoo.com/news/tsmc-says-started-mass-production-003648419.html",
      "Content": "TSMC says started mass production of 'most advanced' 2nm chips\n\nAFP\nTue, December 30, 2025 at 4:36 PM PST 2 min read\n\nIn this article: TSM\n\nNVDA\n\nAAPL\n\nTaiwanese tech titan TSMC has started mass producing its cutting-edge 2-nanometre semiconductor chips, the company said in a statement seen by AFP on Wednesday.\nTSMC is the world's largest contract maker of chips, used in everything from smartphones to missiles, and counts Nvidia and Apple among its clients.\n\n\"TSMC's 2nm (N2) technology has started volume production in 4Q25 as planned,\" TSMC said in an undated statement on its website.\nThe chips will be the \"most advanced technology in the semiconductor industry in terms of both density and energy efficiency\", the company said.\n\"N2 technology, with leading nanosheet transistor structure, will deliver full-node performance and power benefits to address the increasing need for energy-efficient computing.\"\nThe chips will be produced at TSMC's \"Fab 22\" facility in the southern port city of Kaohsiung.\nMore than half of the world's semiconductors, and nearly all of the most advanced ones used to power artificial intelligence technology, are made in Taiwan.\n\nTSMC has been a massive beneficiary of the frenzy in AI investment. Nvidia and Apple are among firms pouring many billions of dollars into chips, servers and data centres.\nAI-related spending is soaring worldwide, and is expected to reach approximately $1.5 trillion by 2025, according to US research firm Gartner, and over $2 trillion in 2026 -- nearly two percent of global GDP.\nTaiwan's dominance of the chip industry has long been seen as a \"silicon shield\" protecting it from an invasion or blockade by China -- which claims the island is part of its sovereign territory -- and an incentive for the United States to defend it.\nBut the threat of a Chinese attack has fuelled concerns about potential disruptions to global supply chains and has increased pressure for more chip production beyond Taiwan's shores.\n\nChinese fighter jets and warships encircled Taiwan during live-fire drills this week aimed at simulating a blockade of the democratic island's key ports and assaults on maritime targets.\nTaipei, which slammed the two-day war games as \"highly provocative and reckless\", said the manoeuvre failed to impose a blockade on the island.\nTSMC has invested in chip fabrication facilities in the United States, Japan and Germany to meet soaring demand for semiconductors, which have become the lifeblood of the global economy.\nBut in an interview with AFP this month, Taiwanese Deputy Foreign Minister Francois Chih-chung Wu said the island planned to keep making the \"most advanced\" chips on home soil and remain \"indispensable\" to the global semiconductor industry.\njoy-amj/abs\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "05:55:00",
      "Source": "Motley Fool",
      "Title": "Nvidia vs. Taiwan Semiconductor Manufacturing: What's the Better Buy?",
      "URL": "https://finance.yahoo.com/m/33155d40-0f2e-3ce8-8c48-0b8fde9f220b/nvidia-vs.-taiwan.html",
      "Content": "Nvidia vs. Taiwan Semiconductor Manufacturing: What's the Better Buy?\n\nManali Pradhan, CFA, The Motley Fool\nTue, December 30, 2025 at 1:55 PM PST 3 min read\n\nIn this article: NVDA\n\nTSM\n\nKey Points Nvidia boasts exceptional multiyear revenue visibility.\nTSMC is the clear leader in advanced chip manufacturing.\n10 stocks we like better than Nvidia ›\nNvidia (NASDAQ: NVDA) and Taiwan Semiconductor Manufacturing (NYSE: TSM) are key players at different points along the artificial intelligence (AI) value chain. While Nvidia is the leading designer of the graphics processing units (GPUs) used to handle most AI workloads, TSMC is the global leader in fabricating and packaging advanced logic and memory chips.\nBoth have benefited from the AI megatrend -- but which of these companies looks like a better long-term stock buy from here?\nNvidia Nvidia has visibility into nearly $500 billion in combined Blackwell and Rubin revenue from the start of 2025 through the end of calendar 2026, of which $150 billion has already been shipped. The company's networking business is also generating multibillion-dollar revenues, with its proprietary high-speed GPU interconnect NVLink, high-performance networking standard InfiniBand, and the AI-optimized Ethernet platform Spectrum-X becoming integral parts of AI deployments worldwide.\n\nProduction of Nvidia's next-generation Vera Rubin platform is also on schedule to ramp up in the second half of 2026; those platforms, which will combine its new Vera CPU with its Rubin GPU, will support cloud, enterprise, robotics, and physical AI workloads.\nHowever, Nvidia depends extensively on TSMC's ability to manufacture chips using the most advanced process nodes. Also, while President Donald Trump recently loosened some of the trade restrictions he had imposed that were preventing Nvidia from selling AI-optimized chips to Chinese companies, it is still prohibited from selling its most advanced chips to that market.\nTaiwan Semiconductor Manufacturing TSMC now earns a bulk of its revenue from producing advanced chips (7-nanometer and below), which are used heavily to handle high-performance computing workloads. The company is advancing its 2-nanometer (N2) process node toward volume production and recently highlighted its plans to start producing chips using its performance-enhanced N2P variant in 2026.\n\nTSMC is also working on its even more feature-dense and power-efficient A16 process node, with volume production scheduled for the second half of 2026.\nAdditionally, TSMC plans to scale its monthly Chip on Wafer on Substrate (CoWoS) advanced packaging capacity from current levels of 75,000 to 80,000 wafers to as high as 120,000 to 130,000 wafers by the end of 2026, directly addressing the major bottleneck constraining chip shipments.\n\nStory Continues\nYet the geopolitical risks faced by Taiwan cannot be ignored by TSMC investors.\nHence, I must conclude that Nvidia is better suited for long-term investors focused on upside potential, while TSMC may be a good pick for investors who would prefer a more resilient stock.\nShould you buy stock in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $507,744 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,153,827 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 983 % — a market-crushing outperformance compared to 195% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 29, 2025\nManali Pradhan, CFA has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy .\nNvidia vs. Taiwan Semiconductor Manufacturing: What's the Better Buy? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-31",
      "Time": "01:58:50",
      "Source": "Barchart",
      "Title": "Nvidia Just Officially Bought $5 Billion Worth of Intel Stock. Should You Buy INTC Too?",
      "URL": "https://finance.yahoo.com/m/38b3bafa-e6c2-39e6-9297-647ee0121b57/nvidia-just-officially-bought.html",
      "Content": "Nvidia Just Officially Bought $5 Billion Worth of Intel Stock. Should You Buy INTC Too?\n\nAditya Raghunath\nTue, December 30, 2025 at 9:58 AM PST 3 min read\n\nIn this article: INTC\n\nTSM\n\nNVDA\n\nNvidia (NVDA) has completed its $5 billion equity investment in Intel (INTC), the semiconductor giant confirmed in a filing on Monday. The announcement finalizes a deal first announced in September that positions the world's most valuable company as a roughly 4% stakeholder in its struggling rival.\n\nThe AI chip leader purchased over 214.7 million Intel shares at $23.28 apiece in a private placement, a price that now sits 36% below Intel's recent trading levels, according to the filing.\nMore News from Barchart Micron Technology Bear Put Spread Could Return 197% in this Down Move\nMicron Stock Stole the Show in 2025. Options Data Says It Will Trade at These Levels in 2026.\nQuantumScape Gained 100% in 2025 and Is Set to Generate Revenue for the First Time in 2025. Options Data Suggests You Should Play QS Stock Like This for 2026.\nGet exclusive insights with the FREE Barchart Brief newsletter. Subscribe now for quick, incisive midday market analysis you won't find anywhere else.\nThe transaction, which received regulatory clearance from the Federal Trade Commission earlier this month, could serve as a major financial lifeline for Intel after years of missteps and capital-intensive manufacturing expansions that have drained its resources.\nThe companies announced they will collaborate on multiple generations of custom data center and PC products, including Nvidia-designed x86 CPUs for AI infrastructure and system-on-chips combining Intel CPU cores with Nvidia RTX GPU chiplets.\n\nHowever, neither chipmaker has committed to moving Nvidia's crown-jewel GPU production away from Taiwan Semiconductor Manufacturing Company (TSM) to Intel's contract manufacturing services.\nIs Intel Stock a Good Buy Right Now? Valued at a market cap of $175 billion, INTC stock has returned almost 90% in 2025. Despite strong demand for its legacy chip, Intel is wrestling with manufacturing bottlenecks. Intel is undershipping its 10 nm and 7 nm chips for the personal computer and server markets right now. These products still account for the bulk of Intel’s production volume.\n\nCFO John Pitzer acknowledged that supply constraints could peak in Q1 of 2026 and ease gradually over the next few months. However, it suggests that Intel is unlikely to meet demand even beyond Q1. The silver lining is that server shortages are actually worse than PC shortages, as servers carry better margins.\nMultiple factors are driving server demand for Intel:\nFirst, hyperscalers spent the last few years focused on AI infrastructure buildouts while delaying refreshes of their existing server fleets.\nSecond, these same companies are now severely power-constrained, and replacing a five-year-old server with a new one delivers 80 percent better power efficiency.\nThird, and most intriguing, the shift from large language model training to agentic AI appears to be putting unexpected demand on traditional computing infrastructure.\n\nStory Continues\nOn the technology front, Intel's 18A node is advancing but remains a work in progress. The company shipped its first Panther Lake chip on schedule by year-end, though yields aren't in line with expectations.\nNew CEO Lip-Bu Tan has brought significant cultural changes since joining in March. The organization has been flattened from 11 or 12 management layers down to just five or six. Engineers now sit on the executive staff and are required to participate in customer conversations. The company has also implemented a return-to-office policy with employees back in the office four days per week.\n\nWhat Is the INTC Stock Price Target? Analysts tracking INTC stock forecast revenue to increase from $52.55 billion in 2025 to $74 billion in 2029. Investors are concerned about narrowing gross margins driven by early 18A ramp costs and pricing actions on newer products to manage tight supply. However, the company is projected to improve adjusted earnings per share from $0.34 in 2025 to $2.84 in 2030.\n\nAs Intel continues to invest in capital expenditures, its free cash outflow is expected to total $11 billion between 2025 and 2026. Notably, free cash flow is likely to improve from $640 million in 2027 to $4.32 billion in 2029. If INTC stock trades at 25x forward earnings, which is in line with its 10-year average, it could return 100% over the next three years.\nOut of the 42 analysts covering INTC stock, two recommend “Strong Buy,” one recommends “Moderate Buy,” 33 recommend “Hold,” one recommends “Moderate Sell,” and five recommend “Strong Sell.”\nThe average INTC stock price target is $36.74, which is similar to the current price.\nOn the date of publication, Aditya Raghunath did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "23:43:03",
      "Source": "Investor's Business Daily",
      "Title": "With Taiwan Semi Earnings Due, This Option Trade Is For The Bulls",
      "URL": "https://finance.yahoo.com/m/49a27481-c826-3d4e-a92a-eefa1256b71c/with-taiwan-semi-earnings.html",
      "Content": "With Taiwan Semi Earnings Due, This Option Trade Is For The Bulls\n\nGAVIN McMASTER\nTue, December 30, 2025 at 7:43 AM PST 2 min read\n\nIn this article: TSM\n\nHere's an option trade on TSM stock that assumes it will stay within an expected range on earnings with a positive response.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "22:25:00",
      "Source": "Motley Fool",
      "Title": "This Could Derail Intel's Comeback in 2026",
      "URL": "https://finance.yahoo.com/m/a3c3c0b1-515e-3b98-985f-d19243c24d76/this-could-derail-intel%27s.html",
      "Content": "This Could Derail Intel's Comeback in 2026\n\nTimothy Green, The Motley Fool\nTue, December 30, 2025 at 6:25 AM PST 5 min read\n\nIn this article: INTC\n\nAMD\n\nTSM\n\nKey Points Intel has a strong PC roadmap for 2026, including Panther Lake and Nova Lake.\nBoth CPU families will use the cutting-edge Intel 18A manufacturing process.\nSoaring memory chip prices could force PC price hikes and limit Intel's comeback in the PC market.\n10 stocks we like better than Intel ›\nOne of the issues plaguing Intel (NASDAQ: INTC) over the past few years has been an erosion of its PC CPU market share. Past manufacturing delays forced the company to use aging process nodes while rival AMD tapped TSMC 's top-tier manufacturing technology. Intel later outsourced manufacturing for its Lunar Lake and Arrow Lake chips, but the latter was a mixed bag that rubbed reviewers and consumers the wrong way.\nAgainst this backdrop, Intel's share of the desktop and laptop CPU market has tumbled. Intel remains the market leader, but AMD controlled approximately one-third of the desktop CPU market and more than one-fifth of the laptop CPU market in the third quarter. A decade ago, this kind of progress from AMD would have been unthinkable.\n\nIn 2026, Intel could regain some of the lost market share. Panther Lake for laptops and Nova Lake for desktops look promising, and both will be built on the new Intel 18A process node. However, soaring memory chip prices will likely increase PC prices and potentially dampen demand.\nIntel's 2026 roadmap shows promise Panther Lake will be the first mass-produced chip to be manufactured using the Intel 18A process, and it is expected to begin shipping in volume in early 2026. Intel 18A moves Intel to a new type of transistor and introduces backside power delivery, a technology that can boost efficiency by moving power circuitry to the back of the chip. The Intel 18A process is the first in the industry to implement backside power delivery.\n\nNova Lake will come later in 2026 for desktops, succeeding the troubled Arrow Lake family. In the meantime, the company is rumored to be launching a refresh of Arrow Lake, although the core problems with Arrow Lake are likely to remain unresolved until Nova Lake arrives. While Nova Lake's specifications are still unclear, rumors suggest high core counts and large amounts of cache for some models, which could better compete with AMD's 3D V-Cache chips.\nLaunching a new architecture on a new process node is always a challenge, but if Panther Lake and Nova Lake deliver solid improvements in performance and efficiency, they could be big winners for Intel.\nMemory prices could be a major problem Unfortunately for Intel, its Panther Lake and Nova Lake launches coincide with a severe and escalating shortage of DRAM memory. AI data centers need both high-bandwidth memory and standard DRAM memory in copious quantities. Memory chip manufacturers have been shifting production to HBM chips while being cautious about expanding overall production, creating a shortage of DRAM chips.\n\nStory Continues\nPC prices are almost certain to rise in 2026 as OEMs grapple with rising component costs. Dell is reportedly raising commercial PC prices by 10% to 30% in response to the memory chip crisis, a move that will likely be followed by other OEMs. Businesses could slow down upgrade plans in response. On the consumer side, higher prices and configurations with less memory are likely to be the prevailing themes in 2026.\n\nBeyond the potential for higher prices to hurt overall demand for PCs, lower memory configurations could hurt Intel's AI PC push. Panther Lake laptops will feature greater AI processing power than their predecessors, but a lack of memory could hinder usability. Microsoft requires at least 16 GB of RAM for a laptop to be labeled a Copilot+ PC, for example, because AI applications require significant amounts of memory.\nSoaring memory chip prices put Intel in a tough spot. Even if Panther Lake and Nova Lake are home runs, delivering performance and efficiency that top AMD, high PC prices could spoil the party. AMD is also impacted, so Intel won't be at a relative disadvantage and could still win market share. However, the size of the market could temporarily shrink as businesses and consumers resist price increases.\n\nWith memory chip production unlikely to increase meaningfully anytime soon, and with the AI boom still going strong, Intel's PC comeback in 2026 may be weaker than it could have otherwise been.\nShould you buy stock in Intel right now? Before you buy stock in Intel, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Intel wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $507,744 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,153,827 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 984 % — a market-crushing outperformance compared to 195% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 29, 2025\nTimothy Green has positions in Intel. The Motley Fool has positions in and recommends Advanced Micro Devices, Intel, Microsoft, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nThis Could Derail Intel's Comeback in 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "22:00:07",
      "Source": "Zacks",
      "Title": "Investors Heavily Search Taiwan Semiconductor Manufacturing Company Ltd. (TSM): Here is What You Need to Know",
      "URL": "https://finance.yahoo.com/news/investors-heavily-search-taiwan-semiconductor-140007099.html",
      "Content": "Investors Heavily Search Taiwan Semiconductor Manufacturing Company Ltd. (TSM): Here is What You Need to Know\n\nZacks Equity Research\nTue, December 30, 2025 at 6:00 AM PST 5 min read\n\nIn this article: TSM\n\nTSMWF\n\n^GSPC\n\nTSMC (TSM) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock.\nShares of this chip company have returned +4.6% over the past month versus the Zacks S&P 500 composite's +0.9% change. The Zacks Semiconductor - Circuit Foundry industry, to which TSMC belongs, has gained 3.2% over this period. Now the key question is: Where could the stock be headed in the near term?\n\nAlthough media reports or rumors about a significant change in a company's business prospects usually cause its stock to trend and lead to an immediate price change, there are always certain fundamental factors that ultimately drive the buy-and-hold decision.\nRevisions to Earnings Estimates Here at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock.\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\n\nTSMC is expected to post earnings of $2.72 per share for the current quarter, representing a year-over-year change of +21.4%. Over the last 30 days, the Zacks Consensus Estimate remained unchanged.\nFor the current fiscal year, the consensus earnings estimate of $10.17 points to a change of +44.5% from the prior year. Over the last 30 days, this estimate has changed -0.2%.\nFor the next fiscal year, the consensus earnings estimate of $12.2 indicates a change of +20% from what TSMC is expected to report a year ago. Over the past month, the estimate has changed -0.1%.\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, TSMC is rated Zacks Rank #3 (Hold).\n\nStory Continues\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n12 Month EPS Projected Revenue Growth While earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\n\nIn the case of TSMC, the consensus sales estimate of $32.6 billion for the current quarter points to a year-over-year change of +21.3%. The $121 billion and $146.22 billion estimates for the current and next fiscal years indicate changes of +34.3% and +20.8%, respectively.\nLast Reported Results and Surprise History TSMC reported revenues of $33.1 billion in the last reported quarter, representing a year-over-year change of +40.8%. EPS of $2.92 for the same period compares with $1.94 a year ago.\nCompared to the Zacks Consensus Estimate of $31.5 billion, the reported revenues represent a surprise of +5.06%. The EPS surprise was +12.74%.\n\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\nValuation Without considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects.\n\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\n\nTSMC is graded D on this front, indicating that it is trading at a premium to its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nConclusion The facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about TSMC. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nTaiwan Semiconductor Manufacturing Company Ltd. (TSM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "18:26:26",
      "Source": "MT Newswires",
      "Title": "Market Chatter: Samsung, SK Hynix Win US Approval for 2026 China Equipment Shipments",
      "URL": "https://finance.yahoo.com/news/market-chatter-samsung-sk-hynix-102626767.html",
      "Content": "PREMIUM\nMarket Chatter: Samsung, SK Hynix Win US Approval for 2026 China Equipment Shipments\n\nMT Newswires\nTue, December 30, 2025 at 2:26 AM PST 1 min read\n\nIn this article: TSM\n\nSSNLF\n\n000660.KS\n\nSamsung Electronics and SK Hynix received a license from the US Government to transport semiconducto\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "12:14:15",
      "Source": "Reuters",
      "Title": "US approves Samsung, SK Hynix chipmaking tool shipments to China for 2026, sources say",
      "URL": "https://finance.yahoo.com/news/samsung-wins-us-annual-approval-041415683.html",
      "Content": "US approves Samsung, SK Hynix chipmaking tool shipments to China for 2026, sources say\n\nHyunjoo Jin\nMon, December 29, 2025 at 8:14 PM PST 1 min read\n\nIn this article: SSNLF\n\n000660.KS\n\nTSM\n\nBy Hyunjoo Jin\nSEOUL, Dec 30 (Reuters) - The U.S. government has granted an annual licence to Samsung Electronics and SK Hynix ​to bring in chip manufacturing equipment to their facilities ‌in China for 2026, two people familiar with the matter said on Tuesday.\nThe ‌approval is a temporary relief for the South Korean firms and follows a U.S. decision earlier this year to revoke licence waivers given to some tech companies.\n\nOne of the sources said that Washington ⁠introduced the annual approval ‌system for exports of chipmaking tools to China.\nSamsung, SK Hynix and TSMC had benefited from exemptions to ‍Washington's sweeping restrictions on chip-related exports to China. But the privilege known as validated end user status will end on December 31, meaning shipments ​of American chipmaking tools to their factories in China after ‌that date will require U.S. export licences.\nSamsung and SK Hynix declined to comment while TSMC did not immediately respond to requests for comment. The U.S. Department of Commerce was not immediately available for comment outside business hours.\nKeen to limit China's access to advanced American ⁠technology, U.S. President Donald Trump's administration ​has been re-examining export controls that ​it thought were too relaxed under the Biden administration.\nSouth Korea's Samsung Electronics, the world's top memory chipmaker, and ‍second-ranked SK Hynix ⁠count China as one of their key production bases especially for traditional memory chips, whose prices have been surging due ⁠to demand from AI data centers and tightened supplies.\n(Reporting by Hyunjoo Jin; ‌Additional reporting by Wen-Yee Lee and Heekyong Yang; Editing by ‌Jacqueline Wong and Saad Sayeed)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "12:14:15",
      "Source": "Reuters",
      "Title": "US approves Samsung chipmaking tool shipments to China for 2026, source says",
      "URL": "https://finance.yahoo.com/news/samsung-wins-us-annual-approval-041415683.html",
      "Content": "US approves Samsung chipmaking tool shipments to China for 2026, source says\n\nHyunjoo Jin\nMon, December 29, 2025 at 8:14 PM PST 1 min read\n\nIn this article: SSNLF\n\n000660.KS\n\nTSM\n\nBy Hyunjoo Jin\nSEOUL, Dec 30 (Reuters) - The U.S. government has granted an annual licence to ​Samsung Electronics to bring in chip ‌manufacturing equipment to its facilities in China for 2026, a ‌person familiar with the matter said on Tuesday.\nThe approval is a temporary relief for the South Korean firm and follows a U.S. decision ⁠earlier this year ‌to revoke licence waivers given to some tech companies.\n\nThe source said that ‍Washington introduced the annual approval system for exports of chipmaking tools to China.\nSamsung, SK Hynix and TSMC ​had benefited from exemptions to Washington's sweeping ‌restrictions on chip-related exports to China. But the privilege known as validated end user status will end on December 31, meaning shipments of American chipmaking tools to their factories in ⁠China after that date will ​require U.S. export licences.\nSamsung, ​SK and TSMC did not immediately respond to requests for comment.\nKeen to limit ‍China's access ⁠to advanced American technology, U.S. President Donald Trump's administration has been re-examining export controls ⁠that it thought were too relaxed under the Biden administration.\n(Reporting ‌by Hyunjoo Jin; Editing by Jacqueline ‌Wong and Saad Sayeed)\n\n條款 及 私隱政策\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "05:31:24",
      "Source": "Benzinga",
      "Title": "Tim Cook's Nike Buy, AI Smart Glasses, Court Victory And More: This Week In Appleverse",
      "URL": "https://finance.yahoo.com/news/tim-cooks-nike-buy-ai-213124714.html",
      "Content": "Tim Cook's Nike Buy, AI Smart Glasses, Court Victory And More: This Week In Appleverse\n\nMohd Haider\nMon, December 29, 2025 at 1:31 PM PST 3 min read\n\nIn this article: AAPL\n\nNKE\n\n601138.SS\n\nTSLA\n\nTSM\n\nAs the weekend comes to a close, let’s take a look at some of the most intriguing stories that emerged in the tech and market world.\nWhy Tim Cook’s Buy Is Drawing Market Parallels Tim Cook , the CEO of Apple Inc. (NASDAQ: AAPL ), has recently purchased shares of Nike Inc. (NYSE: NKE ). This move has drawn parallels with Tesla Inc. ‘s (NASDAQ: TSLA ) market behavior earlier this year. The purchase coincided with a moment when pessimism appeared fully priced in, signaling a potential market bottom.\n\nRead the full article here .\nDon't Miss:\nIf there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it ?\n7 Million Gamers Already Trust Gameflip With Their Digital Assets — Now You Can Own a Stake in the Platform\nApple Targets 2026 Launch For AI Smart Glasses, Camera-Equipped Airpods, With Foxconn, TSMC Set To Play Key Roles: Report Apple Inc. is reportedly preparing to expand its artificial intelligence strategy beyond iPhones and Macs, with AI-powered wearable devices expected to debut in 2026.\nApple is planning to launch two new AI-driven wearable products — smart glasses and AI-powered AirPods — as early as 2026, according to a report from Taiwan’s Money UDN.\n\nRead the full article here .\nTim Cook Just Purchased $3 Million Worth Of Nike Shares Along With Another Company Director Apple Inc.’s CEO, Tim Cook, has made a significant personal investment in Nike Inc. Cook, who has been on Nike’s board since 2005, has acquired 50,000 shares in the company at an average price of $58.97 per share, in a transaction valued at $2.95 million.\nHis total position in the popular apparel retailer now stands at 105,480 shares following the purchase, valued at $6.04 million, based on the stock's closing price on Tuesday, at $57.34 per share.\n\nRead the full article here .\nSee Also: Deloitte's #1 Fastest-Growing Software Company Lets Users Earn Money Just by Scrolling — Accredited Investors Can Still Get In at $0.50/Share.\nApple And Google Score Court Victory As Judge Halts Texas Law Requiring Age Checks, Parental Consent For Apps A federal judge has blocked Texas from enforcing a child safety law aimed at app stores. The law would have required app stores and developers to verify users’ ages and obtain parental consent for minors, potentially violating the First Amendment.\nU.S. District Judge Robert Pitman in Austin issued a preliminary injunction against Texas’s App Store Accountability Act, which was set to take effect in January.\n\nRead the full article here .\nApple’s $200 ‘iPhone Sock’ Feels Pricey For A Christmas Gift, But The Tech Giant Has Made Some Even Stranger Stocking Stuffers Throughout The Years Apple has introduced a new product that has raised some eyebrows. The “iPhone Sock” is a 3D-knit cross-body pouch designed to carry an iPhone, AirPods, and a few small essentials. This limited-edition accessory, created in collaboration with the Issey Miyake Design Studio, blurs the line between fashion and tech.\n\nStory Continues\nDeveloped in collaboration with the Issey Miyake Design Studio, the Japanese fashion house behind Steve Jobs’ iconic black turtlenecks, the limited-edition accessory blurs the line between fashion and tech.\nRead the full article here .\nRead Next:\nMissed Tesla? EnergyX Is Tackling the Next $200 Billion Opportunity — Lithium\nHave $100k+ to invest? Charlie Munger says that's the toughest milestone — don't stall now. Get matched with a fiduciary advisor and keep building\n\nPhoto courtesy: jamesteohart via Shutterstock\nUp Next: Transform your trading with Benzinga Edge's one-of-a-kind market trade ideas and tools. Click now to access unique insights that can set you ahead in today's competitive market.\nGet the latest stock analysis from Benzinga:\nAPPLE (AAPL): Free Stock Analysis Report\nTESLA (TSLA): Free Stock Analysis Report\nThis article Tim Cook's Nike Buy, AI Smart Glasses, Court Victory And More: This Week In Appleverse originally appeared on Benzinga.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-30",
      "Time": "03:53:16",
      "Source": "Barchart",
      "Title": "Intel Stock Had a Banner Year But Is Still 50% Off Its Record Highs. Are More Gains in Store for 2026?",
      "URL": "https://finance.yahoo.com/m/a8b42796-9593-3d38-85b1-72805ec62ca2/intel-stock-had-a-banner-year.html",
      "Content": "Intel Stock Had a Banner Year But Is Still 50% Off Its Record Highs. Are More Gains in Store for 2026?\n\nWajeeh Khan\nMon, December 29, 2025 at 11:53 AM PST 2 min read\n\nIn this article: INTC\n\nAMD\n\nQCOM\n\nTSM\n\nAAPL\n\nIntel (INTC) stock has been a major outperformer this year as CEO Lip-Bu Tan’ strategic vision renewed investor confidence in the company’s ability to compete in the global AI arms race.\nUnder his leadership, the company secured billions in private and federal investments, paving the way to advance its foundry ambitions.\n\nMore News from Barchart Micron Technology Bear Put Spread Could Return 197% in this Down Move\nSanta Claus Rally, Fed Minutes and Other Can't Miss Items this Week\nMP Materials Gained 230% in 2025. Should You Buy, Sell, or Hold MP Stock for 2026?\nTired of missing midday reversals? The FREE Barchart Brief newsletter keeps you in the know. Sign up now!\nVersus their pandemic high, however, Intel shares remain down some 50%, suggesting persistent structural and executions risks continue to weigh on sentiment.\nWhat to Expect From Intel Stock in 2026 The latest setback for INTC stock came from Nvidia (NVDA) that’s reportedly scrapped plans of producing its advanced chips using Intel’s 18A node.\nStill, Daniel Newman – the chief executive of Futurum Group – believes the longer term bull case remains intact for one simple reason: Taiwan Semi (TSM) just “can’t produce enough chips.”\n\nThe unprecedented AI-driven demand is making big names like Apple (AAPL), Qualcomm (QCOM), and even AMD (AMD) explore alternatives, reinforcing Intel’s role as an auxiliary capacity provider.\nAnd since demand is truly explosive, being only an adjunct resource for the semiconductor space may prove sufficient in driving Intel stock higher in 2026, he told CNBC in a recent interview.\nINTC Shares Remain Inexpensive to Own Newman doesn’t see NVDA news as a major setback for Intel shares since Lip-Bu Tan had already broadcast that the initial ramp-up of the firm’s 18A node is optimized for and dedicated to its own internal products.\nAccording to him, the real inflection point for Intel will be its upcoming “14A” process, expected to enter volume production in 2028.\n\n“This is the one where rubber meets the road for companies like Nvidia, Apple, and others.”\nFrom a valuation perspective, INTC shares are just as attractive. Despite an explosive year-to-date rally, they’re going for just over 3x sales at the time of writing, versus more than 35x for Nvidia.\nWall Street Disagrees with Newman on Intel Wall Street analysts do not entirely agree with Newman’s constructive view on Intel stock, though.\nThe consensus rating on INTC shares remains at “Hold” only with the mean target of nearly $37 already in line with the price at which they are trading currently.\n\nStory continues\nThis article was created with the support of automated content tools from our partners at Sigma.AI. Together, our financial data and AI solutions help us to deliver more informed market headline analysis to readers faster than ever.\nOn the date of publication, Wajeeh Khan did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "23:38:00",
      "Source": "Barrons.com",
      "Title": "Nvidia Closes $5 Billion Purchase of Intel Shares",
      "URL": "https://finance.yahoo.com/m/006cf717-55ab-36ec-b7d9-9c3700ff24c7/nvidia-closes-%245-billion.html",
      "Content": "Nvidia Closes $5 Billion Purchase of Intel Shares\n\nAdam Levine\nMon, December 29, 2025 at 7:38 AM PST 2 min read\n\nIn this article: NVDA\n\nTSM\n\nTSMWF\n\nSFTBF\n\nSFTBY\n\nThe share purchase provides Intel with much-needed capital as it works to recover from years of setbacks.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "21:53:29",
      "Source": "Insider Monkey",
      "Title": "Taiwan Semiconductor Manufacturing Company Limited (TSM) Rebounded Strongly in Q3",
      "URL": "https://finance.yahoo.com/news/taiwan-semiconductor-manufacturing-company-limited-135329870.html",
      "Content": "Taiwan Semiconductor Manufacturing Company Limited (TSM) Rebounded Strongly in Q3\n\nSoumya Eswaran\nMon, December 29, 2025 at 5:53 AM PST 3 min read\n\nIn this article: TSM\n\nTSMWF\n\nHardman Johnston Global Advisors, an investment management company, released its “Hardman Johnston Global Equity Strategy” investor letter for the third quarter of 2025. A copy of the letter can be downloaded here . The portfolio underperformed in the quarter due to stock selection. The composite returned 5.02%, net of fees, compared to 7.62% for the MSCI AC World Net Index. In addition, please check the fund’s top five holdings to know its best picks in 2025.\n\nIn its third-quarter 2025 investor letter, Hardman Johnston Global Equity Strategy highlighted stocks such as Taiwan Semiconductor Manufacturing Company Limited (NYSE: TSM ). Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) manufactures, packages, tests, and sells integrated circuits and other semiconductor devices. The one-month return for Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) was 5.27%, and its shares gained 51.13% over the last 52 weeks. On December 26, 2025, Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) stock closed at $302.84 per share, with a market capitalization of $1.571 trillion.\nHardman Johnston Global Equity Strategy stated the following regarding Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) in its third quarter 2025 investor letter:\nTaiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) is in 9th position on our list of 30 Most Popular Stocks Among Hedge Funds . As per our database, 194 hedge fund portfolios held Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) at the end of the third quarter, compared to 187 in the previous quarter. In the third quarter of 2025, Taiwan Semiconductor Manufacturing Company Limited’s (NYSE:TSM) revenue increased 6% sequentially in NT. While we acknowledge the potential of Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\n\nStory Continues\nIn another article , we covered Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) and shared Harbor Capital Appreciation Fund's views on the company. In addition, please check out our hedge fund investor letters Q3 2025 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "19:17:39",
      "Source": "MT Newswires",
      "Title": "Taiwan Semiconductor Reportedly Evacuates Select Facilities After Earthquake",
      "URL": "https://finance.yahoo.com/news/taiwan-semiconductor-reportedly-evacuates-select-111739428.html",
      "Content": "PREMIUM\nTaiwan Semiconductor Reportedly Evacuates Select Facilities After Earthquake\n\nMT Newswires\nMon, December 29, 2025 at 3:17 AM PST\n\nIn this article: TSM\n\nTaiwan Semiconductor Manufacturing (TSM) said Saturday that a small number of its facilities in the\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "17:52:00",
      "Source": "Motley Fool",
      "Title": "1 Artificial Intelligence (AI) Stock I'd Buy on Every Dip and Never Sell",
      "URL": "https://finance.yahoo.com/m/75487e12-801e-31e0-841d-98574f7058c9/1-artificial-intelligence.html",
      "Content": "1 Artificial Intelligence (AI) Stock I'd Buy on Every Dip and Never Sell\n\nScott Levine, The Motley Fool\nMon, December 29, 2025 at 1:52 AM PST 4 min read\n\nIn this article: ASML\n\nTSM\n\nINTC\n\nKey Points Semiconductor makers like Taiwan Semiconductor and Intel rely on sophisticated equipment to produce chips at scale.\nA profound competitive advantage is a great sign that a company's stock may be worth purchasing.\nStrong free cash flows and low debt-to-equity ratios are green lights when I'm investigating potential stock buys.\n10 stocks we like better than ASML ›\n\nUnlike chefs, who can prepare savory meals without precisely measuring ingredients, pastry chefs require exactness when crafting their sweet treats. Just a little too much of one ingredient -- or not enough of another -- can be the difference between pastry perfection and dessert disaster.\nSimilarly, the companies that manufacture the sophisticated semiconductors capable of handling artificial intelligence (AI) applications also require meticulous levels of precision in order to sustain high-volume production of those chips. For this reason, ASML (NASDAQ: ASML) is high on my buy list. The company plays a pivotal role in the semiconductor industry, and I've long recognized its stock as a compelling way to expand my AI industry exposure.\nI plan to open a position in the coming weeks, and once it's initiated, I intend to click the buy button on ASML stock again during any dips.\nASML provides a unique AI investment opportunity Designing cutting-edge semiconductors -- the wheelhouse of companies like Nvidia and AMD -- is no small feat, yet it means little unless foundries can produce those chips at scale. This is where ASML comes in.\nWhile ASML provides a variety of equipment, software, and services to enable the large-scale fabrication of microchips, the products that make it most appealing to investors are its extreme ultraviolet (EUV) lithography machines. These machines use light at a 13.5-nanometer wavelength to print the most sophisticated chip designs on the market, making them indispensable tools for foundry operators like Taiwan Semiconductor Manufacturing and Intel .\n\nASML is the only company capable of building EUV machines, giving it an unparalleled position in the chip industry and providing it with a robust competitive advantage over its rivals.\nKicking the tires on the company's financials provides even more reassurance It's hard to argue with the allure of ASML, as it has a technological monopoly in a niche that is vital to the tech sector. The company's fundamentals further illustrate why its stock will be worth holding for the long term as the AI industry develops.\nFor one, the company generates extremely strong cash flow. In 2024 and 2023, for example, ASML reported free cash flow of $7 billion and $6.9 billion, respectively, according to Morningstar . Its results are even more impressive when stacked up against its semiconductor equipment peers, Lam Research and Applied Materials .\n\nStory Continues\nOver the past decade, ASML has consistently generated more free cash flow per share -- especially during the past two years as the AI industry has boomed.\nPair this with the fact that the company has a strong balance sheet with a conservative debt-to-equity ratio of 0.14 as of its most recent financial report, and its sound financial health becomes even more apparent.\n\nForget looking to Santa, I'm gifting ASML to myself this year I was uninterested in waiting for shares of ASML to appear under the tree, so I've made a plan to buy the stock in the coming weeks to get some skin in the game, and then gradually build my position as dips occur. Should another company ever debut an EUV lithography system, I'll have to reevaluate my position. For the time being, though, I'm eager to broaden my AI sector exposure with ASML stock.\n\nShould you invest $1,000 in ASML right now? Before you buy stock in ASML, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and ASML wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nScott Levine has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends ASML, Advanced Micro Devices, Applied Materials, Lam Research, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy .\n1 Artificial Intelligence (AI) Stock I'd Buy on Every Dip and Never Sell was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "01:08:38",
      "Source": "Motley Fool",
      "Title": "Better Emerging Markets ETF: Vanguard's VWO vs. iShares' EEM",
      "URL": "https://finance.yahoo.com/m/264626bf-966a-3397-85fe-ee24f1a3a566/better-emerging-markets-etf%3A.html",
      "Content": "Better Emerging Markets ETF: Vanguard's VWO vs. iShares' EEM\n\nRobert Izquierdo, The Motley Fool\nSun, December 28, 2025 at 9:08 AM PST 5 min read\n\nIn this article: TCEHY\n\nEEM\n\nVWO\n\nTSM\n\nKey Points VWO charges a fraction of EEM’s expense ratio and sports a higher dividend yield.\nEEM has delivered a stronger one-year return but saw a deeper five-year drawdown than VWO.\nVWO holds more stocks and is dramatically larger, but both funds are anchored by Taiwan Semiconductor and Tencent.\nThese 10 stocks could mint the next wave of millionaires ›\n\niShares MSCI Emerging Markets ETF (NYSEMKT:EEM) is costlier and more volatile, while Vanguard FTSE Emerging Markets ETF (NYSEMKT:VWO) offers broader holdings, a much lower fee, and a slightly higher yield — but lags EEM in recent total return.\nBoth EEM and VWO target large- and mid-cap stocks from emerging markets, with heavy exposure to Asia and big names like Taiwan Semiconductor Manufacturing (NYSE:TSM) and Tencent Holdings (OTC:TCEHY) . This comparison unpacks key differences in cost, performance, risk, and portfolio makeup to help long-term investors weigh which emerging markets ETF may appeal to their needs.\nSnapshot (cost & size) Metric\nEEM\nVWO\nIssuer\nIShares\nVanguard\nExpense ratio\n0.72%\n0.07%\n1-yr return (as of Dec. 18, 2025)\n26.8%\n19.0%\nDividend yield\n2.2%\n2.8%\nBeta\n0.99\n0.88\nAUM\n$20.5 billion\n$141.2 billion\n\nBeta measures price volatility relative to the S&P 500; beta is calculated from five-year weekly returns. The 1-yr return represents total return over the trailing 12 months.\nVWO is much more affordable than EEM, with an expense ratio that is 65 percentage points lower, and it also pays a modestly higher dividend yield at 2.8% versus EEM’s 2.2%.\n\nPerformance & risk comparison Metric\nEEM\nVWO\nMax drawdown (5 y)\n(39.82%)\n(34.33%)\nGrowth of $1,000 over 5 years\n$1,043\n$1,071\n\nWhat's inside VWO tracks over 2,000 stocks across emerging markets, with technology (23%), financial services (21%), and consumer cyclical (13%) as top sectors. Its largest positions are Taiwan Semiconductor Manufacturing, Tencent Holdings, and Alibaba Group Holding (NYSE:BABA) , and the fund’s 20.8-year track record makes it one of the oldest in the space. No leverage, currency hedge, or ESG overlays are present.\n\nEEM is a bit more concentrated, holding 1,215 stocks with similar sector tilts: technology (27%), financial services (22%), and consumer cyclical (12%). Its portfolio is anchored by Taiwan Semiconductor Manufacturing, Tencent Holdings, and Samsung Electronics (OTC:SSNL.F) , so the top holdings and sector exposures are closely aligned with VWO. Neither fund includes notable structural quirks.\nFor more guidance on ETF investing, check out the full guide at this link .\nWhat this means for investors The iShares MSCI Emerging Markets ETF (EEM) and Vanguard FTSE Emerging Markets ETF (VWO) offer similar exposure to emerging markets, considering the similarity in sector weighting and that their top two stocks are identical. However, performance will differ due to the differences in overall holdings.\n\nStory continues\nEEM includes stocks from South Korea, which is why Samsung is among its largest holdings, while VWO does not since the latter doesn't classify the country as an emerging market.\nConsequently, EEM's performance over the past year was significantly stronger than VWO's. Investors weighing which ETF to consider would have to decide if exposure to South Korean companies is important to them.\n\nOtherwise, VWO looks like the more compelling ETF. Its assets under management are much larger than EEM's, and this gives the ETF far greater liquidity. In addition, its substantially lower expense ratio means it's less costly for investors. VWO also offers a better dividend yield, adding to the gains investors can achieve with this ETF.\nGlossary Expense ratio: The annual fee, expressed as a percentage, that a fund charges to cover operating costs.\nDividend yield: The annual dividends paid by a fund, shown as a percentage of its current price.\nBeta: A measure of a fund’s volatility compared to the overall stock market, typically the S&P 500.\nAUM (Assets Under Management): The total market value of all assets managed by a fund.\nMax drawdown: The largest percentage drop from a fund’s peak value to its lowest point over a specific period.\nTotal return: The investment’s price change plus all dividends and distributions, assuming those payouts are reinvested.\nEmerging markets: Countries with developing economies and financial markets that are growing but not yet fully mature.\nSector tilt: When a fund has a higher allocation to certain industry sectors compared to a benchmark or the market.\nConcentration: The degree to which a fund’s assets are invested in a small number of holdings or sectors.\nLeverage: The use of borrowed money to increase potential investment returns, which also increases risk.\nCurrency hedge: A strategy to reduce the impact of currency exchange rate fluctuations on investment returns.\nESG overlays: Additional investment criteria that consider environmental, social, and governance factors when selecting securities.\n\nDon’t miss this second chance at a potentially lucrative opportunity Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nNvidia: if you invested $1,000 when we doubled down in 2009, you’d have $494,182 !*\nApple: if you invested $1,000 when we doubled down in 2008, you’d have $52,012 !*\nNetflix: if you invested $1,000 when we doubled down in 2004, you’d have $509,470 !*\nRight now, we’re issuing “Double Down” alerts for three incredible companies , available when you join Stock Advisor , and there may not be another chance like this anytime soon.\nSee the 3 stocks »\n*Stock Advisor returns as of December 22, 2025\nRobert Izquierdo has positions in Alibaba Group and Taiwan Semiconductor Manufacturing. The Motley Fool has positions in and recommends Taiwan Semiconductor Manufacturing, Tencent, and Vanguard International Equity Index Funds - Vanguard Ftse Emerging Markets ETF. The Motley Fool recommends Alibaba Group. The Motley Fool has a disclosure policy .\nBetter Emerging Markets ETF: Vanguard's VWO vs. iShares' EEM was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-29",
      "Time": "00:36:00",
      "Source": "Motley Fool",
      "Title": "What Is the Best Artificial Intelligence (AI) Stock to Hold for the Next 10 Years?",
      "URL": "https://finance.yahoo.com/m/92e033bd-467e-3790-a963-523cff98bcb6/what-is-the-best-artificial.html",
      "Content": "What Is the Best Artificial Intelligence (AI) Stock to Hold for the Next 10 Years?\n\nAdam Spatacco, The Motley Fool\nSun, December 28, 2025 at 8:36 AM PST 5 min read\n\nIn this article: TSM\n\nNVDA\n\nAMD\n\nAVGO\n\nMU\n\nKey Points Chip designers such as Nvidia, Advanced Micro Devices, and Broadcom serve as the backbone of generative AI development.\nWhile chip designers steal the spotlight, Taiwan Semiconductor Manufacturing is playing a hugely important supporting role in the background.\nAs demand for AI chips and data centers accelerates, Taiwan Semi is poised for explosive long-term growth.\n10 stocks we like better than Taiwan Semiconductor Manufacturing ›\n\nFor the last three years, investing in semiconductor stocks has proven to be a profitable decision given the critical role chips play in the development of generative artificial intelligence (AI). Companies such as Nvidia , Advanced Micro Devices , Broadcom , and Micron Technology have been some of the biggest contributors to the semiconductor industry throughout the artificial intelligence (AI) revolution.\nFlying under the radar is another chip company whose storyline seems muted compared to its peers. That's Taiwan Semiconductor Manufacturing (NYSE: TSM) , the pick-and-shovel specialist of the chip realm.\nLet's dive into Taiwan Semi's increasingly important role for the future of AI and assess why the stock looks like a no-brainer buying opportunity for investors with a long-term horizon.\nHow does Taiwan Semiconductor benefit from AI? Throughout the AI revolution, hyperscalers such as Microsoft , Alphabet , Amazon , Meta Platforms , and OpenAI have collectively poured hundreds of billions of dollars into AI-related capital expenditures (capex) -- namely, chips and networking gear for data centers.\nOn the surface, this is great news for the likes of Nvidia, AMD, and Broadcom. But underneath the surface, it's even better news for Taiwan Semi. Why is that?\n\nTSMC is the largest chip manufacturer in the world in terms of revenue. While Nvidia, AMD, and Broadcom design the most-in demand GPUs and custom application-specific integrated circuits (ASICs) on the planet, each of these giants relies heavily on Taiwan Semi's cutting-edge fabrication processes.\nIn other words, if Nvidia and its competitors represent the body of the car moving the AI narrative forward, TSMC holds the keys to the ignition.\nTSMC's growth is off the charts Over the last year, Taiwan Semi's revenue has been growing strongly thanks to ongoing demand for AI accelerators. What's interesting to point out is that the company's revenue trajectory is actually steepening. This is largely driven by rising demand for Nvidia's and AMD's next-generation Rubin and MI400 Series chips, as well as increasing investment in custom hardware from cloud infrastructure providers.\n\nStory Continues\nThe more subtle aspect from the financial picture above is Taiwan Semi's expanding profitability profile. Given its near-70% market share, TSMC is able to command enormous pricing power relative to competitors like Intel or Samsung .\nAgainst this backdrop, Taiwan Semi's gross margin is widening -- with excess cash flowing straight to the bottom line. The company is making the most of this new wave of capital by expanding its geographic footprint -- building additional foundries in Arizona, Germany, and Japan.\n\nIs Taiwan Semi stock a good buy right now? At the moment, TSMC boasts a forward price-to-earnings (P/E) multiple of 28.4 -- hovering near its highest level during the AI revolution. If you were to base your investment decision purely off of this metric, you may think Taiwan Semi is overvalued.\nSmart investors understand that TSMC's premium valuation could be warranted, though. McKinsey & Company is forecasting AI infrastructure to be a $7 trillion market through 2030 -- with the majority of spend allocated toward refining AI workloads.\nIn essence, building out AI-equipped data centers is expected to accelerate throughout the rest of the decade as training and inferencing models becomes more sophisticated and demanding. This is great news for TSMC as it paves the way for long-run visibility across the business.\n\nThe AI infrastructure chapter is still in its early innings. Over the course of the next several years, Taiwan Semi is positioned to benefit from the secular tailwind of rising investment in infrastructure both domestically and abroad.\nTaking this one step further, physical applications such as autonomous systems and robotics are yet to be deployed in a commercial sense. Looking beyond into the 2030s, these use cases are expected to drive additional trillions in economic value.\nShould they achieve some form of adoption and set the stage for the next wave of AI, Taiwan Semi has the potential to benefit immensely beyond where AI stands today -- building large language models (LLMs) and other software-based applications.\nWhen you consider the bigger picture and begin to think longer-term, TSMC's growth potential relative to its valuation looks compelling. So while the stock may not appear dirt cheap at first glance, I think there is ample room for meaningful valuation expansion over the course of the next decade -- making the stock a no-brainer buy right now in my eyes.\n\nShould you invest $1,000 in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nAdam Spatacco has positions in Alphabet, Amazon, Meta Platforms, Microsoft, and Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Intel, Meta Platforms, Microsoft, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nWhat Is the Best Artificial Intelligence (AI) Stock to Hold for the Next 10 Years? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-28",
      "Time": "20:50:00",
      "Source": "Motley Fool",
      "Title": "These 4 Billionaires All Have 1 Genius AI Stock in Common, and It's Set to Skyrocket in 2026 (Hint: It's Not Nvidia)",
      "URL": "https://finance.yahoo.com/m/297d9d65-f15a-327a-af8a-9d1d0d024b06/these-4-billionaires-all-have.html",
      "Content": "These 4 Billionaires All Have 1 Genius AI Stock in Common, and It's Set to Skyrocket in 2026 (Hint: It's Not Nvidia)\n\nKeithen Drury, The Motley Fool\nSun, December 28, 2025 at 4:50 AM PST 5 min read\n\nIn this article: TSM\n\nNVDA\n\nKey Points Taiwan Semiconductor is a broader way to play the AI buildout trend.\nData center capital expenditures are expected to rise through at least 2030.\nChip designers have one thing in common: they all turn to Taiwan Semiconductor.\n10 stocks we like better than Taiwan Semiconductor Manufacturing ›\nLooking at what stocks billionaire hedge fund managers own can be a smart investment strategy. While blindly following their trades isn't a smart move because of information delay, seeing what stocks they all have in common may reveal some great insights to investors.\n\nThe reason for the information delay is due to U.S. Securities and Exchange Commission (SEC) reporting requirements. Any money manager with more than $100 million in assets must report end-of-quarter holdings to the SEC. Then, that information is made available to the public 45 days after the quarter ends in a Form 13F . So, if you see that your favorite fund manager bought a position in a hot AI stock, they may have done it months ago.\nThe key is to find fund managers who don't make massive trades every quarter on a single position. Instead, they add or trim as necessary to manage their risk. One stock that popped up in multiple funds I follow is Taiwan Semiconductor Manufacturing (NYSE: TSM) , also known as TSMC. It's a huge holding in many portfolios, and I think it's set to skyrocket in 2026 as artificial intelligence demand ramps up.\nTaiwan Semiconductor plays a key role in the AI realm The four billionaires who all own shares of Taiwan Semiconductor are:\nChase Coleman at Tiger Global Management (4% of portfolio)\nSteve Mandel at Lone Pine Capital (6.2% of portfolio)\nDavid Tepper at Appaloosa Management (4% of portfolio)\nDaniel Loeb at Third Point (3.7% of portfolio)\nClearly, these four billionaires are very bullish on Taiwan Semiconductor's prospects, and it doesn't take a genius to figure out why.\n\nIt can be difficult to determine whose computing units are the best at any given time. For most of the AI arms race, Nvidia and its leading graphics processing units (GPUs) have dominated this conversation. However, rising competition from Advanced Micro Devices and custom AI accelerators from Broadcom has made this analysis more difficult.\nBut all three of these companies have one thing in common: They get most of their chips from Taiwan Semiconductor. This places TSMC in the ultimate neutral position, as it is supplying chips to competitors. So, as long as there are massive data center buildouts ongoing to develop generative AI technologies, Taiwan Semiconductor will be in an excellent position.\n\nStory Continues\nNvidia informed investors that it expects global data center capital expenditures to total $3 trillion to $4 trillion by 2030 -- a huge expansion from 2025's $600 billion. That's total capital expenditures, which is far broader than just computing. AMD offered a similar projection, estimating that computing will be a $1 trillion market opportunity by 2030.\n\nThis bodes well for one of the key providers of chips in the world, making it no surprise that these four billionaires own shares.\nIs Taiwan Semiconductor a buy now? As mentioned above, the information we have on the ownership of Taiwan Semiconductor among the four billionaires is old information. All we know is that they owned shares on Sept. 30. Since then, TSMC's stock has basically been flat, up around 3%. This likely means they still own the shares, as there haven't been any huge drops.\nFurthermore, Taiwan Semiconductor's stock is reasonably valued heading into 2026.\nAt 23 times 2026 earnings, Taiwan Semiconductor isn't all that expensive compared to its peers. Factor in its critical position and monster growth that's expected to persist for several years after 2026, and Taiwan Semiconductor looks like one of the best buys in the market.\nI think investors should follow these four billionaires' lead and take a hefty position in Taiwan Semiconductor. It's a critical company, and with massive spending expected to occur over the next five years, it's well-positioned to be a huge winner and could skyrocket in 2026 as a result.\n\nShould you invest $1,000 in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nKeithen Drury has positions in Broadcom, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool has positions in and recommends Advanced Micro Devices, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nThese 4 Billionaires All Have 1 Genius AI Stock in Common, and It's Set to Skyrocket in 2026 (Hint: It's Not Nvidia) was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-28",
      "Time": "18:20:00",
      "Source": "Motley Fool",
      "Title": "The Best Stocks to Invest $50,000 in Right Now",
      "URL": "https://finance.yahoo.com/m/782f1cd2-ec54-3866-bfc8-7e7ae9faa21c/the-best-stocks-to-invest.html",
      "Content": "The Best Stocks to Invest $50,000 in Right Now\n\nKeithen Drury, The Motley Fool\nSun, December 28, 2025 at 2:20 AM PST 4 min read\n\nIn this article: TSM\n\nAMZN\n\nGOOG\n\nKey Points Taiwan Semiconductor is a key part of the AI buildout.\nAlphabet's dominance is set to expand in 2026.\nAmazon is due for a comeback.\n10 stocks we like better than Alphabet ›\nAs the new year approaches, many investors are wondering where they should deploy some cash. While you may not have $50,000 sitting around, any sum of money is a great amount to get started with, especially if you have access to fractional shares in your brokerage account.\nI think these three stocks make for excellent starting positions and are slated to provide market-beating returns in 2026.\nTaiwan Semiconductor It's no secret that AI companies are dumping billions of dollars into artificial intelligence (AI) data centers. This isn't expected to slow anytime soon, and there are few better stocks to capitalize on this enormous buildout than Taiwan Semiconductor (NYSE: TSM) . Taiwan Semiconductor provides most chips to various computing providers, making it a great way to invest in the trend without having to determine who the ultimate winner will be.\n\nIt's also developing some innovative technology. Its 2nm (nanometer) chips are entering production right now, and consume 25% to 30% less power than the previous 3nm generation when configured to run at the same speed. Since energy availability is becoming a key concern in the AI buildout, this innovation is a welcome one.\nTaiwan Semiconductor is a top way to play the AI buildout, as data center construction is expected to accelerate in 2026 and beyond.\nAlphabet At the start of the year, Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) was an unpopular stock pick. There were questions surrounding the dominance of the Google Search engine, it was behind in generative AI technology, and was facing a court case that threatened to break up the company if it went the wrong way. All three of these questions were answered in 2025, and all of them were positive.\n\nThis allowed Alphabet to become one of the most successful investments of 2025, as its stock has risen more than 60% so far this year. So, if Alphabet did so well in 2025, why is it a great stock for 2026?\nAfter all of the questions surrounding Alphabet's stock disappeared, the market is free to value Alphabet's stock like the dominant business it is. Advertising revenue was strong in Q3, with its base Google Search engine revenue rising 15% year over year in Q3. Its cloud computing business is also thriving, with revenue rising 34% year over year.\nThis allows Alphabet to focus on being a winner in the AI revolution, and its latest Gemini model is one step closer to that reality. Alphabet is going to be a successful company in 2026, and its recent track record tells me that it's a great stock to own.\n\nStory Continues\nAmazon Amazon (NASDAQ: AMZN) is on the opposite end of the performance spectrum. While Alphabet has soared, Amazon's stock has lagged behind the market, rising about 6%. However, a poor 2025 is setting the stage for a big comeback in 2026. Amazon's business is doing incredibly well, with revenue rising 13% in Q3.\n\nThe biggest sign of Amazon's potential is Amazon Web Services (AWS), its cloud computing division, accelerating its growth for the first time in years during Q3. AWS has much higher margins than Amazon's core e-commerce business, and accounts for 66% of operating profit while contributing just 18% of revenue. So, if AWS' growth is accelerating, it's a great sign for Amazon.\nAnother positive sign is Amazon's valuation. Part of the reason Amazon's stock didn't perform well in 2025 is that it was growing into the high valuation it held at the start of the year. It is now trading at a reasonable level (when valued using operating profits), and I think now is a great time to invest in Amazon's stock.\nAmazon is due for a comeback in 2026, and I think it's one of the best investments you can make now.\nShould you buy stock in Alphabet right now? Before you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nKeithen Drury has positions in Alphabet, Amazon, and Taiwan Semiconductor Manufacturing. The Motley Fool has positions in and recommends Alphabet, Amazon, and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy .\nThe Best Stocks to Invest $50,000 in Right Now was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-28",
      "Time": "17:20:00",
      "Source": "Motley Fool",
      "Title": "5 Incredible Growth Stocks to Buy for 2026",
      "URL": "https://finance.yahoo.com/m/6854bf10-d056-395f-aa50-9c2b7273f1be/5-incredible-growth-stocks-to.html",
      "Content": "5 Incredible Growth Stocks to Buy for 2026\n\nJennifer Saibil, The Motley Fool\nSun, December 28, 2025 at 1:20 AM PST 5 min read\n\nIn this article: SOFI\n\nMELI\n\nLMND\n\nTSM\n\n^GSPC\n\nKey Points SoFi, MercadoLibre, and Lemonade are disrupting traditional financial services with technology.\nOn is developing its brand globally and gaining a loyal following.\nTaiwan Semiconductor has huge tailwinds in AI development.\n10 stocks we like better than SoFi Technologies ›\nAs the year comes to a close, it's been another double-digit gain for the S&P 500 , which is up almost 18% in 2025. The index is up about 80% during the past three years alone, demonstrating why investing in the S&P 500 is such a compelling thesis.\n\nHowever, you can bring it up a notch by investing in top growth stocks in 2026. There's no way to know whether the market can keep climbing this year and next, but over time, it grows much more often than it contracts. SoFi Technologies (NASDAQ: SOFI) , MercadoLibre (NASDAQ: MELI) , On Holding (NYSE: ONON) , Lemonade (NYSE: LMND) , and Taiwan Semiconductor (NYSE: TSM) can supercharge your portfolio this year, but more importantly, they all have incredible long-term opportunities.\n1. SoFi: Disruptive banking SoFi is a digital bank that's attracting new customers at a fast pace. Not only is it growing quickly, but revenue growth accelerated in the 2025 third quarter to 38% year over year. That's a phenomenal rate for any company, especially a bank, which is typically slow-growing as an industry.\nIt's a classic fintech company , combining traditional financial services with technology. These are the kinds of services that used to take up a lot of time and visits to bank branches that are now doable with the swipe of a finger. SoFi's niche is its simple-to-use app that's a game changer, and it's one-stop shop approach that makes total financial management available in one place.\n\nSoFi stock is up 79% this year (as of Dec. 26), and it could soar higher in 2026 and beyond.\n2. MercadoLibre: Tech powerhouse MercadoLibre is the leading e-commerce company in Latin America, holding its own against direct competition from Amazon and other global names. Its region is notably underpenetrated, giving it a long runway as it changes the retail narrative. It has also launched complementary fintech services that serve to create a diversified ecosystem of products. That gives it a dominant position and an edge in a growing market.\n\nIt's still in high-growth mode, with a 49% year-over-year sales increase (currency neutral) in the third quarter. It's balancing investments in its future with staying comfortably profitable, and it's constantly rolling out new features to attract customers and simplify the buying process. It has a huge growth runway for the foreseeable future.\n\nStory Continues\n3. On: The new name in premium activewear On is a fast-growing activewear brand that's gaining a loyal following. It sells premium products and competes with companies like Nike and Lululemon Athletica , and it's growing much faster than either of them. Its premium pricing leads to high gross margins, and its affluent consumer base is more resilient when under economic pressure.\n\nThe brand is still working its way around the world, developing brand awareness, and it's fairly small as compared with its peers. That gives it more room to expand as it builds its business, and it could skyrocket in 2026 and much longer.\n4. Lemonade: Insurance technology Lemonade is a disruptive insurance powerhouse, offering digital services and using artificial intelligence (AI) and machine learning to offer a better product. It has been attracting customers at a rapid pace since launching, but its algorithms are finally working well enough to move toward profitability. From here, management envisions the model becoming extremely efficient and profitable as the company continues to increase revenue.\n\nAfter years of investor disappointment, Lemonade stock is up nearly 450% during the past three years. However, it's expecting to become profitable on an adjusted earnings before interest, taxes, depreciation, and amortization (EBITDA) basis in 2026, and it could climb even higher.\n5. Taiwan Semiconductor: Underpinning AI development Nvidia and hyperscalers like Amazon and Alphabet may get the most attention for their developments in AI, but Taiwan Semiconductor plays a key role in making it happen. It manufactures the chips that are used for AI production, and it's the largest company of its kind. Since it makes chips for all kinds of applications, it's not limited by whatever the trend of the day is, and it can drive tech development in any area, giving it continued growth opportunities.\n\nHowever, for the sake of a 2026 discussion, it has potent tailwinds as hyperscalers increase AI spend and demand picks up for chips from many of its clients. Expect Taiwan Semi to enjoy more high gains in the coming year and longer.\nShould you buy stock in SoFi Technologies right now? Before you buy stock in SoFi Technologies, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and SoFi Technologies wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nJennifer Saibil has positions in Lemonade, MercadoLibre, On Holding, SoFi Technologies, and Taiwan Semiconductor Manufacturing. The Motley Fool has positions in and recommends Alphabet, Amazon, Lemonade, Lululemon Athletica Inc., MercadoLibre, Nike, Nvidia, On Holding, and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy .\n5 Incredible Growth Stocks to Buy for 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-28",
      "Time": "08:33:00",
      "Source": "Motley Fool",
      "Title": "4 Stocks to Hold for the Next 5 Years",
      "URL": "https://finance.yahoo.com/m/70005fbb-4e53-3b1a-9d3a-076dd513dd87/4-stocks-to-hold-for-the-next.html",
      "Content": "4 Stocks to Hold for the Next 5 Years\n\nRachel Warren, The Motley Fool\nSat, December 27, 2025 at 4:33 PM PST 7 min read\n\nIn this article: MELI\n\nMSFT\n\nTSM\n\nGOOG\n\nKey Points MercadoLibre is a leader in e-commerce and fintech.\nMicrosoft and Alphabet are making waves with their respective AI innovations.\nTaiwan Semiconductor is the top chip manufacturer in the world.\n10 stocks we like better than MercadoLibre ›\nInvesting for the long term requires a disciplined and resilient mindset to navigate the inherent volatility of the stock market. Managing the psychology behind your investment decisions is as crucial as selecting the right investments.\n\nThe market price of a stock is often driven by short-term emotions and news, while its true value is tied to the underlying company's long-term earning power and assets. A strong mindset allows you to view temporary price drops as potential buying opportunities for quality assets, not reasons to panic.\nLikewise, if you're focused on the long-term picture, you can select quality businesses with robust fundamentals that make sense as part of your portfolio without being swayed by short-term market volatility. If you have cash to invest in the stock market right now, here are four stocks to consider buying and holding for at least five years.\n1. MercadoLibre MercadoLibre (NASDAQ: MELI) is the clear e-commerce leader across over a dozen countries in Latin America, including major markets like Brazil, Mexico, and Argentina. It has a significant competitive advantage over global players like Amazon due to its established presence, brand recognition, and deep understanding of local market needs.\n\nThe company operates a vast tech ecosystem, including its e-commerce marketplace connecting buyers and sellers, which is powered by its integrated fintech arm Mercado Pago, its robust logistics business Mercado Envíos, and advertising services. It's worth noting that Mercado Pago has grown into a full digital financial services platform (e.g., payments, credit, savings, investments) that serves the region's large unbanked population and has created a sticky user base with high monetization potential.\nThe company is consistently profitable and boasts impressive growth metrics. In Q3 2025, it reported a 39% year-over-year revenue increase. Total net revenue reached $7.4 billion. Total payment volume reached $71 billion, up 41% year over year, and gross merchandise volume rose to $16.5 billion, a 28% year-over-year spike.\n\nRobust e-commerce performance in core markets like Brazil and Mexico bolstered MercadoLibre's quarterly performance. And, the number of successful items sold grew by 39% year over year to 635 million. If you want to invest in an e-commerce and fintech giant operating outside the U.S., MercadoLibre is a profitable and compelling leader to consider.\n\nStory continues\n2. Microsoft Microsoft (NASDAQ: MSFT) managed to effectively monetize generative AI faster than most peers by integrating it across its entire tech stack. AI services accounted for roughly 15 percentage points of the total Azure revenue growth in the first quarter of its fiscal year 2026. Over 70% of Fortune 500 companies have adopted Microsoft 365 Copilot, which has created a high-margin recurring revenue stream.\n\nThe company is investing heavily in AI capacity, and its capital expenditures have exceeded $30 billion per quarter to meet surging demand. Azure remains a primary catalyst for the business's long-term value and consistently delivers high growth even on a massive revenue base. For the full fiscal year 2025, Microsoft's annual revenue surpassed $281 billion, growing by 15% from the prior year. Azure revenue was more than $75 billion, a 34% increase year over year. Azure holds approximately 20% of the global cloud market.\nMicrosoft maintains one of the strongest balance sheets in the corporate world, which supports its consistent returns to investors. It's one of only two U.S. companies with a perfect AAA credit rating (that's higher than the U.S. government). The company generated over $100 billion in net income in fiscal 2025, so it continues to have massive flexibility for R&D and acquisitions.\n\nMicrosoft has raised its dividend for 20 consecutive years and regularly repurchases billions in stock (it returned almost $11 billion to shareholders in the most recent quarter alone through dividends and share repurchases). Management and analysts have set ambitious targets for the next five years. CEO Satya Nadella aims to exceed $500 billion in annual revenue by 2030, nearly double its current scale.\n3. Alphabet Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) is deeply integrating powerful AI models like Gemini across its massive ecosystem (e.g, Search, YouTube, Cloud). AI improves its search relevance, makes YouTube more engaging, and personalizes user experiences, which in turn can drive better engagement and more ad dollars. Instead of cannibalizing search, Alphabet's new tools like AI summaries are increasing ad impressions and conversions, and expanding its commercial pathways in search.\n\nAlphabet is also leveraging its custom TPUs (Tensor Processing Units) semiconductor chips to compete in cloud infrastructure. While historically the company had reserved most TPUs for in-house use and cloud services, it has recently begun selling some directly to third parties in specific bilateral deals. These include major AI clients like Anthropic as Alphabet creates a new high-margin revenue stream.\nAlphabet's TPUs are revolutionary, particularly because they are application-specific integrated circuits (ASICs) purpose-built for the core mathematical operations of deep learning applications. This specialized design provides significant advantages in performance, energy efficiency, and cost-effectiveness at scale compared to the more general-purpose graphics processing units (GPUs). Revenue from TPUs is a key driver of the overall Google Cloud segment's growth, which generated robust Q3 2025 revenue of $15.2 billion, a 34% year-over-year increase.\n\nAnalysts from firms like Morgan Stanley project that expanded external sales could add billions in new revenue to Alphabet's top line in the coming years (an estimated $13 billion for every 500,000 units sold by 2027). AI could also unlock opportunities in robotics (Waymo), healthcare, and enterprise solutions outside of Alphabet's traditional advertising and cloud businesses. Alphabet's strong balance sheet with substantial cash and low debt, and a generous history of providing enviable returns to shareholders, are icing on the cake for long-term investors in this storied business.\n4. Taiwan Semiconductor Manufacturing Taiwan Semiconductor Manufacturing (NYSE: TSM) or TSMC is the undisputed leader in semiconductor manufacturing and controls roughly 70% of the global foundry market. Unlike investing in a single chip designer, holding TSMC can allow investors to profit regardless of who wins the AI race. And the reality is that there will likely be many winners as the AI revolution heats up.\n\nThe demand for AI computing power is soaring, and only a few companies possess the capabilities to design the required chips. All major AI players -- including Nvidia , Apple , and Broadcom -- rely on TSMC to build their most advanced chips. The company produces at least 90% of the world's most advanced chips, which has created a massive technological moat that competitors like Intel and Samsung are currently struggling to bridge.\nManagement expects AI-related revenue to grow at a more than 40% compound annual growth rate (CAGR) over the next five years. TSMC had a very strong Q3 2025 financially and beat expectations with both record profits and revenue. Substantial and growing demand for AI chips and high-performance computing (HPC) drove revenue up over 30% year over year. Net income surged 40% year over year, and TSMC's gross margin improved to 59.5%.\n\nTSMC is aggressively expanding its manufacturing footprint outside of Taiwan. The company has committed $165 billion to build six advanced fabs in Arizona, with the first already being in volume production. Additional major investments are underway in Japan and Germany, and management aims to have 30% of its most advanced capacity located outside Taiwan by 2028. Shares are up about 40% year to date, and it may be wise to scoop some up before the business soars higher.\nShould you invest $1,000 in MercadoLibre right now? Before you buy stock in MercadoLibre, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and MercadoLibre wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nRachel Warren has positions in Alphabet, Amazon, and Apple. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Intel, MercadoLibre, Microsoft, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\n4 Stocks to Hold for the Next 5 Years was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-28",
      "Time": "04:50:00",
      "Source": "Motley Fool",
      "Title": "If I Could Only Buy and Hold a Single Stock, This Would Be It.",
      "URL": "https://finance.yahoo.com/m/9ed2688f-b42b-3930-880a-3eadbee0ad94/if-i-could-only-buy-and-hold.html",
      "Content": "If I Could Only Buy and Hold a Single Stock, This Would Be It.\n\nKeithen Drury, The Motley Fool\nSat, December 27, 2025 at 12:50 PM PST 4 min read\n\nIn this article: TSM\n\nKey Points Taiwan Semiconductor is a key part of the AI buildout.\nNew chip technology is launching in 2026.\nThe stock isn't that expensive for its vital position.\n10 stocks we like better than Taiwan Semiconductor Manufacturing ›\nSelecting a single stock to buy and hold isn't an easy task. It's also a terrible investing strategy. However, I think it's a good exercise for investors to go through to understand what they are most confident in, then position their portfolios accordingly.\nFor me, the best stock to buy and hold is one that is set up to win in the current market environment, with little worry of disruption. I think that Taiwan Semiconductor (NYSE: TSM) fits the bill, and I've got a few reasons why that's the case.\n1. Taiwan Semiconductor will be the ultimate winner of the AI buildout Companies are spending billions of dollars on artificial intelligence infrastructure, and are tripping over themselves to build data centers . They seemingly cannot get the computing power online fast enough to meet demand. There is also a bottleneck in computing, but while Nvidia 's graphics processing units (GPUs) have been the most widely used computing hardware, that dominance is coming into question.\n\nI believe Taiwan Semiconductor will be the ultimate winner in AI, as it provides chips for most computing units. While it has some competition, Taiwan Semiconductor has the best technology and the most production capacity, giving it an edge over some of its peers.\nBeing a neutral party in the AI race will pay off for Taiwan Semiconductor, as it's expected to continue growing as long as data center capital expenditures continue rising.\n2. Data center capital expenditures are expected to continue growing Many investors have balked at some of Nvidia's long-term projections, but most of those projections have come true. Its latest guidance is even more extreme, but Nvidia has more knowledge about the situation than many individual investors do. It projects that global data center capital expenditures will rise to $3 trillion to $4 trillion by 2030. That's huge growth from the $600 billion expected in 2025, and Taiwan Semiconductor will be a key provider of the chips used to realize this growth.\n\n3. Taiwan Semiconductor's new technology addresses key concerns Taiwan Semiconductor is known for consistently introducing new chip technology, and 2026 will be no exception. Its latest chip generation, 2 nanometers (nm), is currently entering production and features some incredible improvements that clients have been clamoring for.\n\nStory Continues\nThe AI buildout may be slowed by the limited availability of energy. There are a few ways to alleviate this problem, and one of them is to make more energy-efficient hardware. Taiwan Semiconductor has accepted this challenge, and its new 2nm chips consume 25% to 30% less power than previous generation 3nm chips when configured to run at the same speed. These chips will be crucial in securing the next wave of AI growth, and with even more energy-efficient chips in development, Taiwan Semiconductor is expected to provide the advancements AI hyperscalers need to complete their build-out.\n\n4. Taiwan Semiconductor's stock doesn't carry a large premium Many of the AI hyperscalers trade for an expensive price tag, but Taiwan Semiconductor is an exception.\nAt 23 times 2026 earnings, it's not priced at that high a premium compared to some of its peers. It's also expected to continue its rapid growth beyond 2026, so the price you pay now is well worth it.\nTaiwan Semiconductor is a key part of the AI buildout, and its chips power many of the devices used to create generative AI today. Its competition is far enough behind that Taiwan Semiconductor doesn't need to worry about losing its leadership role as long as it continues to innovate. It's my top stock to buy and hold now, and I'm confident in its ability to crush the market in 2026.\n\nShould you buy stock in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nKeithen Drury has positions in Nvidia and Taiwan Semiconductor Manufacturing. The Motley Fool has positions in and recommends Nvidia and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy .\nIf I Could Only Buy and Hold a Single Stock, This Would Be It. was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-28",
      "Time": "01:57:00",
      "Source": "Motley Fool",
      "Title": "Billionaire Chase Coleman Has Formed His Own \"Magnificent Seven\" and It's Even Better Than the Original",
      "URL": "https://finance.yahoo.com/m/8acc8d83-f1c7-3ebb-a71b-5848b544b190/billionaire-chase-coleman-has.html",
      "Content": "Billionaire Chase Coleman Has Formed His Own \"Magnificent Seven\" and It's Even Better Than the Original\n\nKeithen Drury, The Motley Fool\nSat, December 27, 2025 at 9:57 AM PST 5 min read\n\nIn this article: AAPL\n\nTSLA\n\nGOOG\n\nMSFT\n\nAMZN\n\nKey Points Apple and Tesla are excluded from the new grouping.\nBroadcom and Taiwan Semiconductor are key additions.\nProspects for Coleman's new grouping look promising.\n10 stocks we like better than Nvidia ›\nThe \"Magnificent Seven\" is a common grouping of stocks used to describe some of the largest and most influential stocks in the market today. The Magnificent Seven consists of these familiar names:\n\nNvidia (NASDAQ: NVDA)\nApple (NASDAQ: AAPL)\nAlphabet (NASDAQ: GOOG) (NASDAQ: GOOGL)\nMicrosoft (NASDAQ: MSFT)\nAmazon (NASDAQ: AMZN)\nMeta Platforms (NASDAQ: META)\nTesla (NASDAQ: TSLA)\nHowever, billionaire hedge fund manager Chase Coleman has created an alternative Magnificent Seven, and I think it's even better than the original. Which companies were cut and which ones were added? Let's take a look.\nAI is the theme in the new Magnificent Seven Investors have access to what hedge fund managers own. This is thanks to the Securities and Exchange Commission (SEC) requirement that managers with $100 million or more in assets must disclose their end-of-quarter holdings to the public 45 days after the quarter ends in a Form 13F . While this isn't up-to-date information, it's better than nothing.\n\nIn Tiger Global Management's third-quarter portfolio, we can see that Chase Coleman has heavily positioned his portfolio to take advantage of the massive artificial intelligence buildout. Some of his major holdings are:\nMicrosoft (10.5% of portfolio)\nAlphabet (8% of portfolio)\nAmazon (7.5% of portfolio)\nNvidia (6.8% of portfolio)\nMeta Platforms (6.4% of portfolio)\nTaiwan Semiconductor Manufacturing (NYSE: TSM) (4% of portfolio)\nBroadcom (NASDAQ: AVGO) (3% of portfolio)\nAltogether, these stocks make up 46.2% of Coleman's portfolio, which is a massive concentration. However, the track record of each company speaks for itself, and all of these have been great investments over the past few years.\nWhat's notable is that Apple and Tesla aren't included. I think there are a few reasons why, and I like the inclusion of Taiwan Semiconductor and Broadcom over these two in the new Magnificent Seven.\n\nApple lacks an AI focus, and Tesla's business model took a hit this year Apple has been a notable AI laggard in recent years. Its AI technology is really non-existent, and many of the features Apple promised users years ago still haven't been released. The only step left is for Apple to become a client of one of the major generative AI providers, which doesn't bode well for the future.\nFurthermore, Apple is surviving on past innovations, and hasn't released anything groundbreaking in the past few years. All the companies on this list have had incredible results, leaving Apple in the dust in terms of growth.\n\nStory Continues\nTesla is a bit different. It has an AI strategy for implementing self-driving capabilities in its cars. It also has a close partnership with xAI, another one of Elon Musk's companies. I think it shouldn't be excluded from the new Magnificent Seven based on AI alone.\nYet, it's impossible to ignore the shifting landscape in Tesla's primary market. Electric vehicles aren't as hot as they used to be, and with U.S. government subsidies ending, they aren't as attractive to consumers. This isn't to say the EV market is dead, but growth will be more difficult to come by in the future.\n\nAn investment in Tesla is a bet that its various aspirations, like robotaxis and humanoid robots, will be successful. These are far from surefire bets, unlike the other seven companies that are making money right now.\nTaiwan Semiconductor and Broadcom are great inclusions, as they are each thriving in the AI market. They are also large businesses, with Broadcom and Tesla often swapping places as the seventh and eighth largest companies, while Taiwan Semiconductor is the 10th largest in the world at a $1.5 trillion market cap.\nBroadcom is competing in the AI race with its custom AI accelerator chips, which are starting to grow in popularity as an alternative to Nvidia's graphics processing units (GPUs). Taiwan Semiconductor is a key provider of chips to nearly every company on this list. As long as more data centers keep being built, Taiwan Semiconductor will be an excellent stock pick.\n\nI'm confident that Chase Coleman's new Magnificent Seven will outperform the old Magnificent Seven in 2026. I think investors should consider moving on from Apple and Tesla and into Broadcom and Taiwan Semiconductor, as they are better positioned for the next few years.\nShould you buy stock in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nKeithen Drury has positions in Alphabet, Amazon, Broadcom, Meta Platforms, Nvidia, Taiwan Semiconductor Manufacturing, and Tesla. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, Taiwan Semiconductor Manufacturing, and Tesla. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nBillionaire Chase Coleman Has Formed His Own \"Magnificent Seven\" and It's Even Better Than the Original was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "23:08:43",
      "Source": "24/7 Wall St.",
      "Title": "One Avantis ETF Beat Vanguard’s Biggest Funds in 2025 and Could Keep Running in 2026",
      "URL": "https://finance.yahoo.com/m/2bad7ffd-c766-3853-a017-cf8a7c3555ab/one-avantis-etf-beat.html",
      "Content": "One Avantis ETF Beat Vanguard’s Biggest Funds in 2025 and Could Keep Running in 2026\n\nMichael Williams\nSat, December 27, 2025 at 7:08 AM PST 4 min read\n\nIn this article: VOO\n\nIEMG\n\nAVEM\n\nVTI\n\nTSM\n\nQuick Read AVEM returned 35% in 2025 and beat VOO and VTI by roughly 17 percentage points.\nThe fund holds $15.1B in assets with 6.35% in Taiwan Semiconductor.\nDollar weakness drove 2025 outperformance. A 9% dollar decline boosted emerging market returns.\nIf you’re thinking about retiring or know someone who is, there are three quick questions causing many Americans to realize they can retire earlier than expected. take 5 minutes to learn more here\n\nThe Avantis Emerging Markets Equity ETF ( NYSEARCA:AVEM ) delivered a 35% return in 2025, outperforming Vanguard's largest funds and signaling emerging markets might finally be having their moment. With $15.1 billion in assets and concentrated bets on Asian technology and financials, the fund beat both Vanguard S&P 500 ETF ( NYSEARCA:VOO ) and Vanguard Total Stock Market ETF ( NYSEARCA:VTI ) by roughly 17 percentage points. The question is whether 2026 brings more gains or if the rally has run its course.\nThis infographic details the Avantis Emerging Markets Equity ETF (AVEM), outlining its operational framework, ideal investor use cases, and a comprehensive list of its pros and cons for the 2025-2026 period.\nThe Big Picture: Dollar Weakness and China's Stabilization The most important macro factor for AVEM in 2026 is dollar strength. When the dollar weakens, as it did through much of 2025 with a 9% decline, emerging market assets become more attractive. Dollar-denominated debt gets cheaper to service, capital flows back into developing economies, and local currency returns improve for U.S. investors.\n\nWatch the dollar index weekly. If it breaks above recent highs and stays there, AVEM's momentum could stall regardless of individual company performance. Continued dollar weakness provides tailwinds. The Federal Reserve's rate decisions matter, but so do trade policy shifts and global growth expectations. Monitor monthly Federal Reserve policy statements and quarterly GDP reports from major emerging economies, particularly China and India.\nChina's economic trajectory is the second critical variable. With heavy exposure to Chinese tech giants like Tencent and Alibaba, plus significant positions in Chinese banks, AVEM rises and falls with Beijing's policy decisions. The government's recent pivot toward supporting the private sector and stimulus measures helped fuel 2025's gains. If that support continues or accelerates in 2026, AVEM benefits. If Beijing tightens or geopolitical tensions escalate, the fund faces headwinds.\n\nWhat's Under the Hood: Semiconductors and the Taiwan Risk AVEM's largest holding is Taiwan Semiconductor ( NYSE:TSM ) at 6.35% of the portfolio. Add Samsung Electronics, SK Hynix, and MediaTek, and semiconductor exposure dominates returns. This concentration delivered spectacular results in 2025 as AI chip demand surged, but creates vulnerability. If the semiconductor cycle turns or supply chain disruptions emerge, AVEM will feel it immediately.\n\nStory Continues\nThe more subtle risk is geographic. Taiwan represents a significant portion of holdings, creating geopolitical exposure that doesn't exist in broad U.S. market funds. Watch for any escalation in cross-strait tensions or changes in U.S.-China tech policy that could impact semiconductor companies. TSM's Arizona expansion reduces some risk over time, but the concentration remains meaningful.\n\nCheck the fund's monthly holdings file on the Avantis website to track any shifts in semiconductor weighting. The fund employs active management within its systematic framework, so position sizes can change based on valuations and market conditions.\nConsider IEMG for Simpler, Cheaper Exposure The iShares Core MSCI Emerging Markets ETF ( NYSEARCA:IEMG ) offers a straightforward alternative. With $117 billion in assets versus AVEM's $15.1 billion, IEMG provides significantly deeper liquidity. Its 0.09% expense ratio undercuts AVEM's 0.33% fee by a wide margin, and its pure index approach eliminates the active management overlay that Avantis employs.\n\nAVEM tilts toward smaller companies and undervalued stocks, while IEMG tracks the broader market-cap weighted index. In 2025, AVEM's approach paid off. Whether that continues depends on whether value and size factors keep working in emerging markets or if the largest companies reassert dominance.\nFor 2026, the key question is whether dollar weakness persists and whether AVEM's semiconductor-heavy positioning continues to capture AI-driven growth or becomes a source of volatility.\nThe New Report Shaking Up Retirement Plans You may think retirement is about picking the best stocks or ETFs, but you’d be wrong. Even great investments can be a liability in retirement. It’s a simple difference between accumulating vs distributing, and it makes all the difference.\nThe good news? After answering three quick questions many Americans are reworking their portfolios and finding they can retire earlier than expected. If you’re thinking about retiring or know someone who is, take 5 minutes to learn more here .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "22:20:00",
      "Source": "Motley Fool",
      "Title": "Billionaire Philippe Laffont Has a Third of His Portfolio in These 6 Incredible AI Stocks Poised to Dominate in 2026",
      "URL": "https://finance.yahoo.com/m/6c2faa4c-5689-3b9e-b308-1581937d3c57/billionaire-philippe-laffont.html",
      "Content": "Billionaire Philippe Laffont Has a Third of His Portfolio in These 6 Incredible AI Stocks Poised to Dominate in 2026\n\nKeithen Drury, The Motley Fool\nSat, December 27, 2025 at 6:20 AM PST 5 min read\n\nIn this article: NVDA\n\nTSM\n\nKey Points Laffont is a huge believer in the artificial intelligence (AI) investment trend.\nNvidia and TSMC are slated to thrive due to increased data center spending in 2026.\nThe AI hyperscalers all have strong core businesses to fund their AI buildouts.\n10 stocks we like better than Nvidia ›\nChecking up on what billionaire hedge fund managers have in their portfolios can be a smart idea for investors. This information is publicly released 45 days after a quarter ends through a Form 13F . While this doesn't give up-to-date information on what these hedge fund managers are doing, it at least informs investors on some potential solid stock picks.\n\nOne billionaire I follow is Philippe Laffont of Coatue Management. He has had some incredible success, and after examining some of his top portfolio holdings, it's clear he's bullish on artificial intelligence (AI). About a third of his portfolio is invested in six monster AI stocks, and I think each of these should be owned by individual investors in 2026.\nAll six stocks look primed to excel in 2026 The six AI-focused holdings Coatue Management has are:\nMeta Platforms (NASDAQ: META) (7.3% of portfolio)\nMicrosoft (NASDAQ: MSFT) (5.9% of portfolio)\nTaiwan Semiconductor Manucturing (NYSE: TSM) (5.5% of portfolio)\nAmazon (NASDAQ: AMZN) (4.7% of portfolio)\nNvidia (NASDAQ: NVDA) (4.5% of portfolio)\nAlphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) (4.3% of portfolio)\n\nAltogether, that adds up to 32.2%, or about a third of total portfolio assets. However, he also has exposure to other AI investments in his portfolio; these are just some of the largest ones. It's clear that this billionaire believes that these six will do well in 2026, and I think he's right on track.\nThe AI buildout is far from over Infrastructure players like Nvidia are set to do well in 2026. The demand for graphics processing units (GPUs) is insatiable, as the AI hyperscalers are looking to get as much computing power online as fast as possible. Nvidia told investors during its Q3 earnings release that it is \"sold out\" of cloud GPUs because demand is so high. This bodes well for anyone in this industry, including Taiwan Semiconductor, which is a major chip supplier to Nvidia.\n\nAI buildouts are expected to persist for many years. Nvidia expects global 2025 data center capital expenditures to reach $600 billion. However, that figure is expected to rise to $3 trillion to $4 trillion by 2030.\nIf that pans out, businesses like Taiwan Semiconductor and Nvidia make for incredible purchases right now. Combine that with the fact that each of these stocks is down a bit from its all-time high, and each seems like a smart purchase.\n\nStory Continues\nMoving to the AI hyperscalers, companies like Meta, Microsoft, Amazon, and Alphabet are all spending a ton of money on AI computing capacity. While investors may be getting a bit fed up with these expensive capital expenditures, all four believe that this investment is necessary to stay relevant in the future.\n\nOf these four, Meta may be the most intriguing. Meta's stock fell hard after Q3 earnings. While its growth and profitability were great, investors took issue with management's spending plans for 2026. As a result, the stock plummeted, and it's now the cheapest of these six when valued using next year's earnings.\nAt 21.8 times next year's earnings, Meta is priced about the same level as the S&P 500 index. With Meta expected to deliver market-beating growth, it seems like a no-brainer investment.\nAmazon, Alphabet, and Microsoft all operate leading cloud computing platforms. These will be long-term winners, as clients continue to need more and more computing capacity as generative AI workloads become more common. Furthermore, each of these companies also has its own generative AI model or has deep partnerships with one of the major players. This places them in a great position to succeed not only in 2026, but also in the years after.\n\nBillionaire Philippe Laffont has positioned his portfolio wisely to take advantage of the massive AI buildout. I think investors should do the same, and these six are a great place to start.\nShould you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nKeithen Drury has positions in Alphabet, Amazon, Meta Platforms, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool has positions in and recommends Alphabet, Amazon, Meta Platforms, Microsoft, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nBillionaire Philippe Laffont Has a Third of His Portfolio in These 6 Incredible AI Stocks Poised to Dominate in 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "16:43:00",
      "Source": "Motley Fool",
      "Title": "What Is One of the Best Tech Stocks to Hold for the Next 5 Years?",
      "URL": "https://finance.yahoo.com/m/4feac436-e6f3-3c7a-8f36-006f7ecc55fc/what-is-one-of-the-best-tech.html",
      "Content": "What Is One of the Best Tech Stocks to Hold for the Next 5 Years?\n\nJohn Ballard, The Motley Fool\nSat, December 27, 2025 at 12:43 AM PST 3 min read\n\nIn this article: TSM\n\nKey Points TSMC’s earnings per share are expected to grow at a 22% annualized rate.\nManagement expects chip revenue from AI to grow over 40% annually through 2029.\n10 stocks we like better than Taiwan Semiconductor Manufacturing ›\nShares of Taiwan Semiconductor Manufacturing Co. (NYSE: TSM) have nearly tripled in value over the past five years, turning a $1,000 investment into $2,800 at the time of writing. The growing demand for data center infrastructure presents a significant opportunity for TSMC, as high-performance computing chips currently account for the majority of its revenue.\nDespite the stock's strong run over the past few years, its valuation still allows for substantial upside over the next five years.\nGrowth at a reasonable price Analysts expect the company's earnings per share to grow at a 22% annualized rate over the next few years. The stock's valuation reflects the company's recent momentum, with the shares trading at a price-to-earnings (P/E) multiple of 30. However, this valuation does not fully account for future earnings growth, as the P/E multiple drops to 23 on 2026 earnings estimates.\n\nTSMC's third-quarter earnings per share jumped 39% year over year, reflecting its competitive moat in making the most powerful chips for other semiconductor companies. Management expects revenue from artificial intelligence (AI) chips to grow at a compound annual rate of over 40% through 2029.\nThis is a business with a long history of delivering above-average returns for shareholders. This is why it is a bullish sign that management is investing to expand its global manufacturing footprint, supporting demand. CEO C.C. Wei described the demand for AI chips as \"insane\" last quarter, which may also signal that investors are still underestimating the growth opportunity ahead.\nWith robust earnings growth and investments in expanding manufacturing capacity, Taiwan Semiconductor stock remains an excellent buy for investors seeking to outperform the market.\n\nShould you invest $1,000 in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $504,994 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,156,218 !*\n\nStory Continues\nNow, it’s worth noting Stock Advisor’s total average return is 986 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nJohn Ballard has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy .\nWhat Is One of the Best Tech Stocks to Hold for the Next 5 Years? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "06:20:00",
      "Source": "Motley Fool",
      "Title": "Better Artificial Intelligence Stock: ASML vs. Taiwan Semiconductor",
      "URL": "https://finance.yahoo.com/m/dc64db10-fed3-3e7f-806f-9f9a46032b25/better-artificial.html",
      "Content": "Better Artificial Intelligence Stock: ASML vs. Taiwan Semiconductor\n\nWill Healy, The Motley Fool\nFri, December 26, 2025 at 2:20 PM PST 5 min read\n\nIn this article: ASML\n\nTSM\n\nNVDA\n\nAAPL\n\nKey Points ASML's equipment is essential to producing the world's most advanced semiconductors.\nTSMC has effectively leveraged ASML's equipment to produce the world's most advanced chips.\n10 stocks we like better than Taiwan Semiconductor Manufacturing ›\nASML (NASDAQ: ASML) and Taiwan Semiconductor (TSMC) (NYSE: TSM) are arguably the two most essential artificial intelligence (AI) stocks in the hardware space. TSMC is well known for being the foundry of choice for Nvidia , Apple , and other top semiconductor companies.\n\nHowever, TSMC's success is not possible without ASML. It uses the extreme ultraviolet lithography (EUV) machines built by ASML to manufacture the world's most advanced chips.\nThis creates a harder job for investors trying to discern which stock is more likely to make the highest long-term gains. Although both companies are critical to this process, investors need to take a closer look to see which is the more suitable stock for them to own.\nThe case for ASML Investors should remember one thing about ASML. Despite ASML's importance, only a tiny client base is interested in its EUV machines, which can cost as much as $400 million each. Worse, political concerns bar what equipment it can sell to countries like China, further adding to that limitation.\nNonetheless, companies such as Samsung and Intel are among the companies buying EUV machines. Additionally, ASML operates in the deep ultraviolet lithography (DUV) market. Although the market has more competitors, it also allows it to earn business from foundry companies that produce other types of chips.\n\nFurthermore, such costly equipment needs periodic maintenance. With that, the Netherlands-based company runs a thriving maintenance business that accounts for more than one-third of ASML's revenue.\nAmid the growth in AI, its machines are more in demand, so much so that ASML earned almost 23 billion euros ($27 billion) in revenue in the first nine months of 2025, a yearly increase of 21%.\nAlso, ASML limited expense growth, leading to a net income of 6.8 billion euros ($7.9 billion), a 39% rise from year-ago levels. With the rising profits, the stock is up by almost 50% over the last year.\nInvestors should also note the price-to-earnings (P/E) ratio of 40. While that is above the S&P 500\naverage of 31, it closely approximates the company's average over the last five years. Considering the demand in AI, such a valuation is unlikely to deter investors from bidding the stock price higher over time.\n\nWhy investors might consider TSMC However, with a larger client base, investors might find TSMC stock more appealing. They might also like its dominance.\n\nStory Continues\nAs mentioned, TSMC makes the world's most advanced chips. While companies like Samsung and Intel have attempted to compete, TSMC's dominant market share continues to grow. As of the second quarter of 2025, that market share reached 70%, giving the company a tremendous competitive advantage.\nThis arguably makes TSMC's biggest threat operating in Taiwan, an island that has dealt with periodic threats of an invasion by China. Since Chinese companies also depend on its chips, the threat could be overblown. Still, it was concerning enough that Warren Buffett reversed a decision by his lieutenants to invest Berkshire Hathaway 's capital in the company.\n\nThat threat has not stopped TSMC's growth. The $87 billion in revenue TSMC earned in the first nine months of 2025 rose 36% compared to the same period last year.\nAlso, like with ASML, expenses grew more slowly than revenue. Still, with other comprehensive losses weighing on the bottom line, its comprehensive income of $35 billion in the first three quarters of 2025 increased by 30% year over year. If not including those losses, net income would have grown by 52%.\nAmid the rising demand and income, TSMC stock is up by almost 50% over the last year. Also, with a 30 P/E ratio, it is cheaper than ASML and trades at a valuation that closely matches the S&P 500 average.\nStill, TSMC has tended to trade at a discount, and for that reason, it is above its average earnings multiple of 25 over the last five years. That makes it unclear whether TSMC is a better bargain, or whether investors feel the geopolitical concerns justify the discounted multiples of the past.\n\nASML or TSMC? Considering these similarities, investors will likely win by choosing either or both stocks. However, choosing between the two probably comes down to risk tolerances.\nTSMC offers similar revenue and stock price growth at a lower valuation. Hence, if one is comfortable with the geopolitical risk, it might make sense to lean more toward TSMC.\n\nConversely, if one feels as Buffett does about the geopolitical concerns, ASML is probably the more suitable choice, as most of its manufacturing takes place far away from geopolitical hotbeds.\nUltimately, investors have the choice between two critical AI hardware stocks that are well-positioned to outperform the market. Thus, this is one case where they should assess their risk tolerances and act accordingly.\nShould you invest $1,000 in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $504,994 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,156,218 !*\nNow, it’s worth noting Stock Advisor’s total average return is 986 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nWill Healy has positions in Berkshire Hathaway. The Motley Fool has positions in and recommends ASML, Apple, Berkshire Hathaway, Intel, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy .\nBetter Artificial Intelligence Stock: ASML vs. Taiwan Semiconductor was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "21:04:09",
      "Source": "Insider Monkey",
      "Title": "Strong Demand Lifted Taiwan Semiconductor Manufacturing Company Limited (TSM) in Q3",
      "URL": "https://finance.yahoo.com/news/strong-demand-lifted-taiwan-semiconductor-130409738.html",
      "Content": "Strong Demand Lifted Taiwan Semiconductor Manufacturing Company Limited (TSM) in Q3\n\nSoumya Eswaran\nFri, December 26, 2025 at 5:04 AM PST 3 min read\n\nIn this article: TSM\n\nTSMWF\n\n^GSPC\n\nHarbor Capital Appreciation Fund, an investment management company, released its Q3 2025 investor letter. A copy of the same can be downloaded here . The Harbor Capital Appreciation Fund primarily focuses on investing in equity securities, targeting U.S. companies that have a market capitalization of at least $1 billion at the time of investment. US equities delivered solid results in the third quarter, driven by continued momentum in AI and strong corporate earnings. The Federal Reserve’s interest rate cut also supported the market at the end of the quarter. The fund returned 5.11% in the quarter compared to 10.51% for the Russell 1000® Growth Index and 8.12% for the S&P 500 Index. In addition, please check the fund’s top five holdings to know its best picks in 2025.\n\nIn its third-quarter 2025 investor letter, Harbor Capital Appreciation Fund highlighted stocks such as Taiwan Semiconductor Manufacturing Company Limited (NYSE: TSM ). Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) manufactures, packages, tests, and sells integrated circuits and other semiconductor devices. The one-month return for Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) was 3.05%, and its shares gained 44.82% over the last 52 weeks. On December 24, 2025, Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) stock closed at $298.80 per share, with a market capitalization of $1.55 trillion.\nHarbor Capital Appreciation Fund stated the following regarding Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) in its third quarter 2025 investor letter:\nTaiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) is in 9th position on our list of 30 Most Popular Stocks Among Hedge Funds . As per our database, 194 hedge fund portfolios held Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) at the end of the third quarter, compared to 187 in the previous quarter. In the third quarter of 2025, Taiwan Semiconductor Manufacturing Company Limited’s (NYSE:TSM) revenue increased 6% sequentially in NT. While we acknowledge the potential of Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\n\nStory Continues\nIn another article , we covered Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) and shared stock picks by Ken Fisher from growth stock portfolio. In addition, please check out our hedge fund investor letters Q3 2025 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money .\nDisclosure: None. This article is originally published at Insider Monkey.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 80
}