{
  "stock_id": "TSM",
  "last_updated": "2025-12-27T23:10:59.133Z",
  "source": "Yahoo Finance API",
  "news": [
    {
      "Date": "2025-12-28",
      "Time": "04:50:00",
      "Source": "Motley Fool",
      "Title": "If I Could Only Buy and Hold a Single Stock, This Would Be It.",
      "URL": "https://finance.yahoo.com/m/9ed2688f-b42b-3930-880a-3eadbee0ad94/if-i-could-only-buy-and-hold.html",
      "Content": "If I Could Only Buy and Hold a Single Stock, This Would Be It.\n\nKeithen Drury, The Motley Fool\nSat, December 27, 2025 at 12:50 PM PST 4 min read\n\nIn this article: TSM\n\nKey Points Taiwan Semiconductor is a key part of the AI buildout.\nNew chip technology is launching in 2026.\nThe stock isn't that expensive for its vital position.\n10 stocks we like better than Taiwan Semiconductor Manufacturing ›\nSelecting a single stock to buy and hold isn't an easy task. It's also a terrible investing strategy. However, I think it's a good exercise for investors to go through to understand what they are most confident in, then position their portfolios accordingly.\nFor me, the best stock to buy and hold is one that is set up to win in the current market environment, with little worry of disruption. I think that Taiwan Semiconductor (NYSE: TSM) fits the bill, and I've got a few reasons why that's the case.\n1. Taiwan Semiconductor will be the ultimate winner of the AI buildout Companies are spending billions of dollars on artificial intelligence infrastructure, and are tripping over themselves to build data centers . They seemingly cannot get the computing power online fast enough to meet demand. There is also a bottleneck in computing, but while Nvidia 's graphics processing units (GPUs) have been the most widely used computing hardware, that dominance is coming into question.\n\nI believe Taiwan Semiconductor will be the ultimate winner in AI, as it provides chips for most computing units. While it has some competition, Taiwan Semiconductor has the best technology and the most production capacity, giving it an edge over some of its peers.\nBeing a neutral party in the AI race will pay off for Taiwan Semiconductor, as it's expected to continue growing as long as data center capital expenditures continue rising.\n2. Data center capital expenditures are expected to continue growing Many investors have balked at some of Nvidia's long-term projections, but most of those projections have come true. Its latest guidance is even more extreme, but Nvidia has more knowledge about the situation than many individual investors do. It projects that global data center capital expenditures will rise to $3 trillion to $4 trillion by 2030. That's huge growth from the $600 billion expected in 2025, and Taiwan Semiconductor will be a key provider of the chips used to realize this growth.\n\n3. Taiwan Semiconductor's new technology addresses key concerns Taiwan Semiconductor is known for consistently introducing new chip technology, and 2026 will be no exception. Its latest chip generation, 2 nanometers (nm), is currently entering production and features some incredible improvements that clients have been clamoring for.\n\nStory Continues\nThe AI buildout may be slowed by the limited availability of energy. There are a few ways to alleviate this problem, and one of them is to make more energy-efficient hardware. Taiwan Semiconductor has accepted this challenge, and its new 2nm chips consume 25% to 30% less power than previous generation 3nm chips when configured to run at the same speed. These chips will be crucial in securing the next wave of AI growth, and with even more energy-efficient chips in development, Taiwan Semiconductor is expected to provide the advancements AI hyperscalers need to complete their build-out.\n\n4. Taiwan Semiconductor's stock doesn't carry a large premium Many of the AI hyperscalers trade for an expensive price tag, but Taiwan Semiconductor is an exception.\nAt 23 times 2026 earnings, it's not priced at that high a premium compared to some of its peers. It's also expected to continue its rapid growth beyond 2026, so the price you pay now is well worth it.\nTaiwan Semiconductor is a key part of the AI buildout, and its chips power many of the devices used to create generative AI today. Its competition is far enough behind that Taiwan Semiconductor doesn't need to worry about losing its leadership role as long as it continues to innovate. It's my top stock to buy and hold now, and I'm confident in its ability to crush the market in 2026.\n\nShould you buy stock in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nKeithen Drury has positions in Nvidia and Taiwan Semiconductor Manufacturing. The Motley Fool has positions in and recommends Nvidia and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy .\nIf I Could Only Buy and Hold a Single Stock, This Would Be It. was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-28",
      "Time": "01:57:00",
      "Source": "Motley Fool",
      "Title": "Billionaire Chase Coleman Has Formed His Own \"Magnificent Seven\" and It's Even Better Than the Original",
      "URL": "https://finance.yahoo.com/m/8acc8d83-f1c7-3ebb-a71b-5848b544b190/billionaire-chase-coleman-has.html",
      "Content": "Billionaire Chase Coleman Has Formed His Own \"Magnificent Seven\" and It's Even Better Than the Original\n\nKeithen Drury, The Motley Fool\nSat, December 27, 2025 at 9:57 AM PST 5 min read\n\nIn this article: AAPL\n\nTSLA\n\nGOOG\n\nMSFT\n\nAMZN\n\nKey Points Apple and Tesla are excluded from the new grouping.\nBroadcom and Taiwan Semiconductor are key additions.\nProspects for Coleman's new grouping look promising.\n10 stocks we like better than Nvidia ›\nThe \"Magnificent Seven\" is a common grouping of stocks used to describe some of the largest and most influential stocks in the market today. The Magnificent Seven consists of these familiar names:\n\nNvidia (NASDAQ: NVDA)\nApple (NASDAQ: AAPL)\nAlphabet (NASDAQ: GOOG) (NASDAQ: GOOGL)\nMicrosoft (NASDAQ: MSFT)\nAmazon (NASDAQ: AMZN)\nMeta Platforms (NASDAQ: META)\nTesla (NASDAQ: TSLA)\nHowever, billionaire hedge fund manager Chase Coleman has created an alternative Magnificent Seven, and I think it's even better than the original. Which companies were cut and which ones were added? Let's take a look.\nAI is the theme in the new Magnificent Seven Investors have access to what hedge fund managers own. This is thanks to the Securities and Exchange Commission (SEC) requirement that managers with $100 million or more in assets must disclose their end-of-quarter holdings to the public 45 days after the quarter ends in a Form 13F . While this isn't up-to-date information, it's better than nothing.\n\nIn Tiger Global Management's third-quarter portfolio, we can see that Chase Coleman has heavily positioned his portfolio to take advantage of the massive artificial intelligence buildout. Some of his major holdings are:\nMicrosoft (10.5% of portfolio)\nAlphabet (8% of portfolio)\nAmazon (7.5% of portfolio)\nNvidia (6.8% of portfolio)\nMeta Platforms (6.4% of portfolio)\nTaiwan Semiconductor Manufacturing (NYSE: TSM) (4% of portfolio)\nBroadcom (NASDAQ: AVGO) (3% of portfolio)\nAltogether, these stocks make up 46.2% of Coleman's portfolio, which is a massive concentration. However, the track record of each company speaks for itself, and all of these have been great investments over the past few years.\nWhat's notable is that Apple and Tesla aren't included. I think there are a few reasons why, and I like the inclusion of Taiwan Semiconductor and Broadcom over these two in the new Magnificent Seven.\n\nApple lacks an AI focus, and Tesla's business model took a hit this year Apple has been a notable AI laggard in recent years. Its AI technology is really non-existent, and many of the features Apple promised users years ago still haven't been released. The only step left is for Apple to become a client of one of the major generative AI providers, which doesn't bode well for the future.\nFurthermore, Apple is surviving on past innovations, and hasn't released anything groundbreaking in the past few years. All the companies on this list have had incredible results, leaving Apple in the dust in terms of growth.\n\nStory Continues\nTesla is a bit different. It has an AI strategy for implementing self-driving capabilities in its cars. It also has a close partnership with xAI, another one of Elon Musk's companies. I think it shouldn't be excluded from the new Magnificent Seven based on AI alone.\nYet, it's impossible to ignore the shifting landscape in Tesla's primary market. Electric vehicles aren't as hot as they used to be, and with U.S. government subsidies ending, they aren't as attractive to consumers. This isn't to say the EV market is dead, but growth will be more difficult to come by in the future.\n\nAn investment in Tesla is a bet that its various aspirations, like robotaxis and humanoid robots, will be successful. These are far from surefire bets, unlike the other seven companies that are making money right now.\nTaiwan Semiconductor and Broadcom are great inclusions, as they are each thriving in the AI market. They are also large businesses, with Broadcom and Tesla often swapping places as the seventh and eighth largest companies, while Taiwan Semiconductor is the 10th largest in the world at a $1.5 trillion market cap.\nBroadcom is competing in the AI race with its custom AI accelerator chips, which are starting to grow in popularity as an alternative to Nvidia's graphics processing units (GPUs). Taiwan Semiconductor is a key provider of chips to nearly every company on this list. As long as more data centers keep being built, Taiwan Semiconductor will be an excellent stock pick.\n\nI'm confident that Chase Coleman's new Magnificent Seven will outperform the old Magnificent Seven in 2026. I think investors should consider moving on from Apple and Tesla and into Broadcom and Taiwan Semiconductor, as they are better positioned for the next few years.\nShould you buy stock in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nKeithen Drury has positions in Alphabet, Amazon, Broadcom, Meta Platforms, Nvidia, Taiwan Semiconductor Manufacturing, and Tesla. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, Taiwan Semiconductor Manufacturing, and Tesla. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nBillionaire Chase Coleman Has Formed His Own \"Magnificent Seven\" and It's Even Better Than the Original was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "23:08:43",
      "Source": "24/7 Wall St.",
      "Title": "One Avantis ETF Beat Vanguard’s Biggest Funds in 2025 and Could Keep Running in 2026",
      "URL": "https://finance.yahoo.com/m/2bad7ffd-c766-3853-a017-cf8a7c3555ab/one-avantis-etf-beat.html",
      "Content": "One Avantis ETF Beat Vanguard’s Biggest Funds in 2025 and Could Keep Running in 2026\n\nMichael Williams\nSat, December 27, 2025 at 7:08 AM PST 4 min read\n\nIn this article: VOO\n\nIEMG\n\nAVEM\n\nVTI\n\nTSM\n\nQuick Read AVEM returned 35% in 2025 and beat VOO and VTI by roughly 17 percentage points.\nThe fund holds $15.1B in assets with 6.35% in Taiwan Semiconductor.\nDollar weakness drove 2025 outperformance. A 9% dollar decline boosted emerging market returns.\nIf you’re thinking about retiring or know someone who is, there are three quick questions causing many Americans to realize they can retire earlier than expected. take 5 minutes to learn more here\n\nThe Avantis Emerging Markets Equity ETF ( NYSEARCA:AVEM ) delivered a 35% return in 2025, outperforming Vanguard's largest funds and signaling emerging markets might finally be having their moment. With $15.1 billion in assets and concentrated bets on Asian technology and financials, the fund beat both Vanguard S&P 500 ETF ( NYSEARCA:VOO ) and Vanguard Total Stock Market ETF ( NYSEARCA:VTI ) by roughly 17 percentage points. The question is whether 2026 brings more gains or if the rally has run its course.\nThis infographic details the Avantis Emerging Markets Equity ETF (AVEM), outlining its operational framework, ideal investor use cases, and a comprehensive list of its pros and cons for the 2025-2026 period.\nThe Big Picture: Dollar Weakness and China's Stabilization The most important macro factor for AVEM in 2026 is dollar strength. When the dollar weakens, as it did through much of 2025 with a 9% decline, emerging market assets become more attractive. Dollar-denominated debt gets cheaper to service, capital flows back into developing economies, and local currency returns improve for U.S. investors.\n\nWatch the dollar index weekly. If it breaks above recent highs and stays there, AVEM's momentum could stall regardless of individual company performance. Continued dollar weakness provides tailwinds. The Federal Reserve's rate decisions matter, but so do trade policy shifts and global growth expectations. Monitor monthly Federal Reserve policy statements and quarterly GDP reports from major emerging economies, particularly China and India.\nChina's economic trajectory is the second critical variable. With heavy exposure to Chinese tech giants like Tencent and Alibaba, plus significant positions in Chinese banks, AVEM rises and falls with Beijing's policy decisions. The government's recent pivot toward supporting the private sector and stimulus measures helped fuel 2025's gains. If that support continues or accelerates in 2026, AVEM benefits. If Beijing tightens or geopolitical tensions escalate, the fund faces headwinds.\n\nWhat's Under the Hood: Semiconductors and the Taiwan Risk AVEM's largest holding is Taiwan Semiconductor ( NYSE:TSM ) at 6.35% of the portfolio. Add Samsung Electronics, SK Hynix, and MediaTek, and semiconductor exposure dominates returns. This concentration delivered spectacular results in 2025 as AI chip demand surged, but creates vulnerability. If the semiconductor cycle turns or supply chain disruptions emerge, AVEM will feel it immediately.\n\nStory Continues\nThe more subtle risk is geographic. Taiwan represents a significant portion of holdings, creating geopolitical exposure that doesn't exist in broad U.S. market funds. Watch for any escalation in cross-strait tensions or changes in U.S.-China tech policy that could impact semiconductor companies. TSM's Arizona expansion reduces some risk over time, but the concentration remains meaningful.\n\nCheck the fund's monthly holdings file on the Avantis website to track any shifts in semiconductor weighting. The fund employs active management within its systematic framework, so position sizes can change based on valuations and market conditions.\nConsider IEMG for Simpler, Cheaper Exposure The iShares Core MSCI Emerging Markets ETF ( NYSEARCA:IEMG ) offers a straightforward alternative. With $117 billion in assets versus AVEM's $15.1 billion, IEMG provides significantly deeper liquidity. Its 0.09% expense ratio undercuts AVEM's 0.33% fee by a wide margin, and its pure index approach eliminates the active management overlay that Avantis employs.\n\nAVEM tilts toward smaller companies and undervalued stocks, while IEMG tracks the broader market-cap weighted index. In 2025, AVEM's approach paid off. Whether that continues depends on whether value and size factors keep working in emerging markets or if the largest companies reassert dominance.\nFor 2026, the key question is whether dollar weakness persists and whether AVEM's semiconductor-heavy positioning continues to capture AI-driven growth or becomes a source of volatility.\nThe New Report Shaking Up Retirement Plans You may think retirement is about picking the best stocks or ETFs, but you’d be wrong. Even great investments can be a liability in retirement. It’s a simple difference between accumulating vs distributing, and it makes all the difference.\nThe good news? After answering three quick questions many Americans are reworking their portfolios and finding they can retire earlier than expected. If you’re thinking about retiring or know someone who is, take 5 minutes to learn more here .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "22:20:00",
      "Source": "Motley Fool",
      "Title": "Billionaire Philippe Laffont Has a Third of His Portfolio in These 6 Incredible AI Stocks Poised to Dominate in 2026",
      "URL": "https://finance.yahoo.com/m/6c2faa4c-5689-3b9e-b308-1581937d3c57/billionaire-philippe-laffont.html",
      "Content": "Billionaire Philippe Laffont Has a Third of His Portfolio in These 6 Incredible AI Stocks Poised to Dominate in 2026\n\nKeithen Drury, The Motley Fool\nSat, December 27, 2025 at 6:20 AM PST 5 min read\n\nIn this article: NVDA\n\nTSM\n\nKey Points Laffont is a huge believer in the artificial intelligence (AI) investment trend.\nNvidia and TSMC are slated to thrive due to increased data center spending in 2026.\nThe AI hyperscalers all have strong core businesses to fund their AI buildouts.\n10 stocks we like better than Nvidia ›\nChecking up on what billionaire hedge fund managers have in their portfolios can be a smart idea for investors. This information is publicly released 45 days after a quarter ends through a Form 13F . While this doesn't give up-to-date information on what these hedge fund managers are doing, it at least informs investors on some potential solid stock picks.\n\nOne billionaire I follow is Philippe Laffont of Coatue Management. He has had some incredible success, and after examining some of his top portfolio holdings, it's clear he's bullish on artificial intelligence (AI). About a third of his portfolio is invested in six monster AI stocks, and I think each of these should be owned by individual investors in 2026.\nAll six stocks look primed to excel in 2026 The six AI-focused holdings Coatue Management has are:\nMeta Platforms (NASDAQ: META) (7.3% of portfolio)\nMicrosoft (NASDAQ: MSFT) (5.9% of portfolio)\nTaiwan Semiconductor Manucturing (NYSE: TSM) (5.5% of portfolio)\nAmazon (NASDAQ: AMZN) (4.7% of portfolio)\nNvidia (NASDAQ: NVDA) (4.5% of portfolio)\nAlphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) (4.3% of portfolio)\n\nAltogether, that adds up to 32.2%, or about a third of total portfolio assets. However, he also has exposure to other AI investments in his portfolio; these are just some of the largest ones. It's clear that this billionaire believes that these six will do well in 2026, and I think he's right on track.\nThe AI buildout is far from over Infrastructure players like Nvidia are set to do well in 2026. The demand for graphics processing units (GPUs) is insatiable, as the AI hyperscalers are looking to get as much computing power online as fast as possible. Nvidia told investors during its Q3 earnings release that it is \"sold out\" of cloud GPUs because demand is so high. This bodes well for anyone in this industry, including Taiwan Semiconductor, which is a major chip supplier to Nvidia.\n\nAI buildouts are expected to persist for many years. Nvidia expects global 2025 data center capital expenditures to reach $600 billion. However, that figure is expected to rise to $3 trillion to $4 trillion by 2030.\nIf that pans out, businesses like Taiwan Semiconductor and Nvidia make for incredible purchases right now. Combine that with the fact that each of these stocks is down a bit from its all-time high, and each seems like a smart purchase.\n\nStory Continues\nMoving to the AI hyperscalers, companies like Meta, Microsoft, Amazon, and Alphabet are all spending a ton of money on AI computing capacity. While investors may be getting a bit fed up with these expensive capital expenditures, all four believe that this investment is necessary to stay relevant in the future.\n\nOf these four, Meta may be the most intriguing. Meta's stock fell hard after Q3 earnings. While its growth and profitability were great, investors took issue with management's spending plans for 2026. As a result, the stock plummeted, and it's now the cheapest of these six when valued using next year's earnings.\nAt 21.8 times next year's earnings, Meta is priced about the same level as the S&P 500 index. With Meta expected to deliver market-beating growth, it seems like a no-brainer investment.\nAmazon, Alphabet, and Microsoft all operate leading cloud computing platforms. These will be long-term winners, as clients continue to need more and more computing capacity as generative AI workloads become more common. Furthermore, each of these companies also has its own generative AI model or has deep partnerships with one of the major players. This places them in a great position to succeed not only in 2026, but also in the years after.\n\nBillionaire Philippe Laffont has positioned his portfolio wisely to take advantage of the massive AI buildout. I think investors should do the same, and these six are a great place to start.\nShould you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,470 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,167,988 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 991 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nKeithen Drury has positions in Alphabet, Amazon, Meta Platforms, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool has positions in and recommends Alphabet, Amazon, Meta Platforms, Microsoft, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nBillionaire Philippe Laffont Has a Third of His Portfolio in These 6 Incredible AI Stocks Poised to Dominate in 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "16:43:00",
      "Source": "Motley Fool",
      "Title": "What Is One of the Best Tech Stocks to Hold for the Next 5 Years?",
      "URL": "https://finance.yahoo.com/m/4feac436-e6f3-3c7a-8f36-006f7ecc55fc/what-is-one-of-the-best-tech.html",
      "Content": "What Is One of the Best Tech Stocks to Hold for the Next 5 Years?\n\nJohn Ballard, The Motley Fool\nSat, December 27, 2025 at 12:43 AM PST 3 min read\n\nIn this article: TSM\n\nKey Points TSMC’s earnings per share are expected to grow at a 22% annualized rate.\nManagement expects chip revenue from AI to grow over 40% annually through 2029.\n10 stocks we like better than Taiwan Semiconductor Manufacturing ›\nShares of Taiwan Semiconductor Manufacturing Co. (NYSE: TSM) have nearly tripled in value over the past five years, turning a $1,000 investment into $2,800 at the time of writing. The growing demand for data center infrastructure presents a significant opportunity for TSMC, as high-performance computing chips currently account for the majority of its revenue.\nDespite the stock's strong run over the past few years, its valuation still allows for substantial upside over the next five years.\nGrowth at a reasonable price Analysts expect the company's earnings per share to grow at a 22% annualized rate over the next few years. The stock's valuation reflects the company's recent momentum, with the shares trading at a price-to-earnings (P/E) multiple of 30. However, this valuation does not fully account for future earnings growth, as the P/E multiple drops to 23 on 2026 earnings estimates.\n\nTSMC's third-quarter earnings per share jumped 39% year over year, reflecting its competitive moat in making the most powerful chips for other semiconductor companies. Management expects revenue from artificial intelligence (AI) chips to grow at a compound annual rate of over 40% through 2029.\nThis is a business with a long history of delivering above-average returns for shareholders. This is why it is a bullish sign that management is investing to expand its global manufacturing footprint, supporting demand. CEO C.C. Wei described the demand for AI chips as \"insane\" last quarter, which may also signal that investors are still underestimating the growth opportunity ahead.\nWith robust earnings growth and investments in expanding manufacturing capacity, Taiwan Semiconductor stock remains an excellent buy for investors seeking to outperform the market.\n\nShould you invest $1,000 in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $504,994 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,156,218 !*\n\nStory Continues\nNow, it’s worth noting Stock Advisor’s total average return is 986 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nJohn Ballard has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy .\nWhat Is One of the Best Tech Stocks to Hold for the Next 5 Years? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-27",
      "Time": "06:20:00",
      "Source": "Motley Fool",
      "Title": "Better Artificial Intelligence Stock: ASML vs. Taiwan Semiconductor",
      "URL": "https://finance.yahoo.com/m/dc64db10-fed3-3e7f-806f-9f9a46032b25/better-artificial.html",
      "Content": "Better Artificial Intelligence Stock: ASML vs. Taiwan Semiconductor\n\nWill Healy, The Motley Fool\nFri, December 26, 2025 at 2:20 PM PST 5 min read\n\nIn this article: ASML\n\nTSM\n\nNVDA\n\nAAPL\n\nKey Points ASML's equipment is essential to producing the world's most advanced semiconductors.\nTSMC has effectively leveraged ASML's equipment to produce the world's most advanced chips.\n10 stocks we like better than Taiwan Semiconductor Manufacturing ›\nASML (NASDAQ: ASML) and Taiwan Semiconductor (TSMC) (NYSE: TSM) are arguably the two most essential artificial intelligence (AI) stocks in the hardware space. TSMC is well known for being the foundry of choice for Nvidia , Apple , and other top semiconductor companies.\n\nHowever, TSMC's success is not possible without ASML. It uses the extreme ultraviolet lithography (EUV) machines built by ASML to manufacture the world's most advanced chips.\nThis creates a harder job for investors trying to discern which stock is more likely to make the highest long-term gains. Although both companies are critical to this process, investors need to take a closer look to see which is the more suitable stock for them to own.\nThe case for ASML Investors should remember one thing about ASML. Despite ASML's importance, only a tiny client base is interested in its EUV machines, which can cost as much as $400 million each. Worse, political concerns bar what equipment it can sell to countries like China, further adding to that limitation.\nNonetheless, companies such as Samsung and Intel are among the companies buying EUV machines. Additionally, ASML operates in the deep ultraviolet lithography (DUV) market. Although the market has more competitors, it also allows it to earn business from foundry companies that produce other types of chips.\n\nFurthermore, such costly equipment needs periodic maintenance. With that, the Netherlands-based company runs a thriving maintenance business that accounts for more than one-third of ASML's revenue.\nAmid the growth in AI, its machines are more in demand, so much so that ASML earned almost 23 billion euros ($27 billion) in revenue in the first nine months of 2025, a yearly increase of 21%.\nAlso, ASML limited expense growth, leading to a net income of 6.8 billion euros ($7.9 billion), a 39% rise from year-ago levels. With the rising profits, the stock is up by almost 50% over the last year.\nInvestors should also note the price-to-earnings (P/E) ratio of 40. While that is above the S&P 500\naverage of 31, it closely approximates the company's average over the last five years. Considering the demand in AI, such a valuation is unlikely to deter investors from bidding the stock price higher over time.\n\nWhy investors might consider TSMC However, with a larger client base, investors might find TSMC stock more appealing. They might also like its dominance.\n\nStory Continues\nAs mentioned, TSMC makes the world's most advanced chips. While companies like Samsung and Intel have attempted to compete, TSMC's dominant market share continues to grow. As of the second quarter of 2025, that market share reached 70%, giving the company a tremendous competitive advantage.\nThis arguably makes TSMC's biggest threat operating in Taiwan, an island that has dealt with periodic threats of an invasion by China. Since Chinese companies also depend on its chips, the threat could be overblown. Still, it was concerning enough that Warren Buffett reversed a decision by his lieutenants to invest Berkshire Hathaway 's capital in the company.\n\nThat threat has not stopped TSMC's growth. The $87 billion in revenue TSMC earned in the first nine months of 2025 rose 36% compared to the same period last year.\nAlso, like with ASML, expenses grew more slowly than revenue. Still, with other comprehensive losses weighing on the bottom line, its comprehensive income of $35 billion in the first three quarters of 2025 increased by 30% year over year. If not including those losses, net income would have grown by 52%.\nAmid the rising demand and income, TSMC stock is up by almost 50% over the last year. Also, with a 30 P/E ratio, it is cheaper than ASML and trades at a valuation that closely matches the S&P 500 average.\nStill, TSMC has tended to trade at a discount, and for that reason, it is above its average earnings multiple of 25 over the last five years. That makes it unclear whether TSMC is a better bargain, or whether investors feel the geopolitical concerns justify the discounted multiples of the past.\n\nASML or TSMC? Considering these similarities, investors will likely win by choosing either or both stocks. However, choosing between the two probably comes down to risk tolerances.\nTSMC offers similar revenue and stock price growth at a lower valuation. Hence, if one is comfortable with the geopolitical risk, it might make sense to lean more toward TSMC.\n\nConversely, if one feels as Buffett does about the geopolitical concerns, ASML is probably the more suitable choice, as most of its manufacturing takes place far away from geopolitical hotbeds.\nUltimately, investors have the choice between two critical AI hardware stocks that are well-positioned to outperform the market. Thus, this is one case where they should assess their risk tolerances and act accordingly.\nShould you invest $1,000 in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $504,994 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,156,218 !*\nNow, it’s worth noting Stock Advisor’s total average return is 986 % — a market-crushing outperformance compared to 196% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nWill Healy has positions in Berkshire Hathaway. The Motley Fool has positions in and recommends ASML, Apple, Berkshire Hathaway, Intel, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy .\nBetter Artificial Intelligence Stock: ASML vs. Taiwan Semiconductor was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-26",
      "Time": "21:04:09",
      "Source": "Insider Monkey",
      "Title": "Strong Demand Lifted Taiwan Semiconductor Manufacturing Company Limited (TSM) in Q3",
      "URL": "https://finance.yahoo.com/news/strong-demand-lifted-taiwan-semiconductor-130409738.html",
      "Content": "Strong Demand Lifted Taiwan Semiconductor Manufacturing Company Limited (TSM) in Q3\n\nSoumya Eswaran\nFri, December 26, 2025 at 5:04 AM PST 3 min read\n\nIn this article: TSM\n\nTSMWF\n\n^GSPC\n\nHarbor Capital Appreciation Fund, an investment management company, released its Q3 2025 investor letter. A copy of the same can be downloaded here . The Harbor Capital Appreciation Fund primarily focuses on investing in equity securities, targeting U.S. companies that have a market capitalization of at least $1 billion at the time of investment. US equities delivered solid results in the third quarter, driven by continued momentum in AI and strong corporate earnings. The Federal Reserve’s interest rate cut also supported the market at the end of the quarter. The fund returned 5.11% in the quarter compared to 10.51% for the Russell 1000® Growth Index and 8.12% for the S&P 500 Index. In addition, please check the fund’s top five holdings to know its best picks in 2025.\n\nIn its third-quarter 2025 investor letter, Harbor Capital Appreciation Fund highlighted stocks such as Taiwan Semiconductor Manufacturing Company Limited (NYSE: TSM ). Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) manufactures, packages, tests, and sells integrated circuits and other semiconductor devices. The one-month return for Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) was 3.05%, and its shares gained 44.82% over the last 52 weeks. On December 24, 2025, Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) stock closed at $298.80 per share, with a market capitalization of $1.55 trillion.\nHarbor Capital Appreciation Fund stated the following regarding Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) in its third quarter 2025 investor letter:\nTaiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) is in 9th position on our list of 30 Most Popular Stocks Among Hedge Funds . As per our database, 194 hedge fund portfolios held Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) at the end of the third quarter, compared to 187 in the previous quarter. In the third quarter of 2025, Taiwan Semiconductor Manufacturing Company Limited’s (NYSE:TSM) revenue increased 6% sequentially in NT. While we acknowledge the potential of Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\n\nStory Continues\nIn another article , we covered Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) and shared stock picks by Ken Fisher from growth stock portfolio. In addition, please check out our hedge fund investor letters Q3 2025 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money .\nDisclosure: None. This article is originally published at Insider Monkey.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "14:37:00",
      "Source": "Motley Fool",
      "Title": "1 Reason I Am Buying Taiwan Semiconductor Stock to Hold Forever",
      "URL": "https://finance.yahoo.com/m/807caf35-b368-33cd-8155-b68ee0fd241a/1-reason-i-am-buying-taiwan.html",
      "Content": "1 Reason I Am Buying Taiwan Semiconductor Stock to Hold Forever\n\nStefon Walters, The Motley Fool\nWed, December 24, 2025 at 10:37 PM PST 4 min read\n\nIn this article: TSM\n\nKey Points TSMC's foundry models allow it to manufacture specialized chips that tech companies design themselves.\nTSMC has a virtual monopoly on artificial intelligence (AI) chip manufacturing.\nA dominant market position has given TSMC pricing power that has improved its margins.\n10 stocks we like better than Taiwan Semiconductor Manufacturing ›\n\nIf you look around your house, you'll likely see a smartphone, TV, laptop, tablet (especially if you have young kids), gaming console, or even smart appliances. One thing all those items have in common is that they rely on semiconductors (chips) to function properly.\nIf you dig deeper into what those chips have in common, they were likely manufactured by Taiwan Semiconductor Manufacturing (NYSE: TSM) (TSMC). TSMC is by far the world's leading chip manufacturer, and that's the reason why I'm loading up on the stock to hold forever.\nMuch of the physical tech world begins with TSMC TSMC operates on the foundry model. Instead of manufacturing chips for general sale, it manufactures chips on order to meet the specific needs of other companies.\nFor example, Apple would design the chips it needs for its latest iPhone, Nvidia designs the chips for its GPUs , and Amazon will design chips for its cloud servers. In all those situations, TSMC is often the company that brings these blueprints to physical life.\n\nManufacturing chips with the precision, reliability, and consistency of TSMC isn't easy for even the most tech-forward companies in the world. It requires tens of billions of dollars in investment, tons of specialized engineers, and world-class plants, which is why companies would rather rely on TSMC to do it than make the investments to build their own (less effective) plants or spend on the engineering talent.\nA monopoly on AI chips When it comes to manufacturing chips for items like smartphones or computers, TSMC holds a commanding market share. However, when it comes to manufacturing artificial intelligence (AI) chips, TSMC is essentially the only game in town. Its market share is well into the upper-90% range.\nAs tech companies (especially hyperscalers) commit to spending more on building out their AI infrastructure, TSMC will be a natural beneficiary. It won't supply the systems that fills data centers, but it will undoubtedly supply the chips those machines we built around.\nThis reliance on TSMC has boded well for its finances in recent years, too. Its high-performance computing (HPC) segment, which includes its AI chips, accounted for 57% of its $33.1 billion in revenue in the third quarter.\n\nStory Continues\nMaybe more noteworthy, though, is how TSMC's leadership position has given it pricing power that has strengthened its margins. In the third quarter, its gross margins increased from 57.8% to 59.5%, and its operating margins increased from 47.5% to 50.6%.\nRegardless of how beneficial AI chips have been to TSMC's business over the past couple of years, the company is far from dependent on them; they're just a massive plus.\nTSMC has a strongstrong foothold inmanufacturing for virtually all major tech companies, which makes it a stock I'm comfortable holding for the long haul.\n\nShould you invest $1,000 in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $504,239 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,159,896 !*\nNow, it’s worth noting Stock Advisor’s total average return is 985 % — a market-crushing outperformance compared to 195% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nStefon Walters has positions in Apple and Taiwan Semiconductor Manufacturing. The Motley Fool has positions in and recommends Amazon, Apple, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy .\n1 Reason I Am Buying Taiwan Semiconductor Stock to Hold Forever was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "01:47:45",
      "Source": "GuruFocus.com",
      "Title": "Leak Hints at First Intel Nvidia Chip After $5 Billion Partnership",
      "URL": "https://finance.yahoo.com/news/leak-hints-first-intel-nvidia-174745114.html",
      "Content": "Leak Hints at First Intel Nvidia Chip After $5 Billion Partnership\n\nMoz Farooque ACCA\nWed, December 24, 2025 at 9:47 AM PST 1 min read\n\nIn this article: INTC\n\nNVDA\n\nAMD\n\nTSM\n\nThis article first appeared on GuruFocus .\nIntel ( INTC , Financials ) and Nvidia ( NVDA , Financials ) may be preparing to ship their first jointly developed chip , according to leaked details about a laptop processor called Serpent Lake. The leak, shared by YouTube channel RedGamingTec, suggests the chip will combine Intel CPUs with Nvidia RTX graphics in a single design.\n\nWarning! GuruFocus has detected 5 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nSerpent Lake is expected to pair Intel's upcoming Titan Lake CPU architecture with Nvidia's RTX Rubin graphics, manufactured on TSMC's 3-nanometer process. The chip is reportedly aimed at competing with AMD's Strix Halo by delivering stronger graphics performance in high-end laptops.\nOne notable feature is memory bandwidth. The design is said to support up to 16 channels of LPDDR6 memory, a move intended to avoid bottlenecks that have limited graphics performance in competing processors.\nThe leak appears to offer the first real glimpse of what Intel and Nvidia's $5 billion partnership could produce. While Intel says it remains committed to its own Arc graphics roadmap, Serpent Lake points to deeper collaboration between the two companies, with a potential launch in late 2025 or early 2026.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-25",
      "Time": "00:57:13",
      "Source": "24/7 Wall St.",
      "Title": "Uh-Oh! Did Nvidia Just Signal Problems with Intel’s Comeback?",
      "URL": "https://finance.yahoo.com/m/7543d356-0a38-3696-b5bf-15da91a3ccb7/uh-oh%21-did-nvidia-just-signal.html",
      "Content": "Uh-Oh! Did Nvidia Just Signal Problems with Intel’s Comeback?\n\nRich Duprey\nWed, December 24, 2025 at 8:57 AM PST 4 min read\n\nIn this article: INTC\n\nNVDA\n\nAVGO\n\nTSM\n\nQuick Read Intel ( INTC ) secured $8.9B from the U.S. government and $5B from Nvidia ( NVDA ) to revive its foundry business.\nNvidia halted testing of Intel’s 18A chip manufacturing process and stopped moving forward with production plans.\nIntel’s foundry turnaround depends on 18A attracting major customers beyond smaller deals with Microsoft and Amazon .\nIf you’re thinking about retiring or know someone who is, there are three quick questions causing many Americans to realize they can retire earlier than expected. take 5 minutes to learn more here\n\nIntel ( NASDAQ: INTC ) has experienced a dramatic shift in fortunes over the past year. Once viewed as a failing chipmaker losing ground to competitors like Broadcom ( NASDAQ: AVGO ), Taiwan Semiconductor Manufacturing ( NYSE: TSM ), and Nvidia ( NASDAQ: NVDA ), Intel faced speculation that rivals were circling its foundry business and other assets.\nBy the middle of the year, however, Intel regained momentum through significant backing from the Trump administration, which converted CHIPS Act grants into an equity stake worth approximately $8.9 billion, or 10% of the company, making the U.S. government its largest shareholder. This was followed by a $5 billion investment from Nvidia, giving it roughly a 4% stake, as well as partnerships aimed at joint product development in data centers and PCs.\n\nThese moves indicated renewed confidence, positioning Intel as a key player in U.S. semiconductor manufacturing once again. Yet, a Reuters report today suggests a big potential setback, raising questions about whether Intel's revival is beginning to falter.\nA Promising Rebound Built on Execution Intel's recent progress has been notable, driven by strategic investments and a focus on revitalizing its core businesses. The Trump administration's equity stake provided essential capital and aligned Intel with national priorities for domestic chip production.\nWeeks later, Nvidia's $5 billion commitment further supported Intel's turnaround, with the two firms agreeing to collaborate on custom x86 CPUs for Nvidia's AI platforms and integrated system-on-chips for PCs. An Intel spokesperson emphasized that 18A technologies are \"progressing well.\"\n\nDespite these positive developments, the rebound has always hinged on Intel's ability to execute, particularly in its foundry business. The 18A process node has been central to its plans for regaining manufacturing leadership, as it is intended to enable high-volume production of advanced chips and attract customers.\nNvidia's Decision Raises Questions About 18A According to the Reuters article, Nvidia recently evaluated whether to manufacture its next-generation chips using Intel's 18A process but halted the testing and stopped moving forward. Two sources familiar with the matter confirmed this to Reuters, though Nvidia declined to comment.\n\nStory Continues\nThis development comes despite Nvidia's earlier investment and ongoing product collaborations, which explicitly did not include commitments to use Intel's foundry. Intel has previously noted strong interest in 18A, and the company continues to highlight progress on the node, with products like Panther Lake and Clearwater Forest ramping up toward production.\n\nThe reasons for Nvidia's decision remain unclear, but earlier reports indicated both Nvidia and Broadcom conducted tests on 18A. While testing is a standard step, not all evaluations lead to production commitments.\nIf technical or yield issues contributed to the halt, it could signal challenges for Intel in convincing major designers to shift volume from established leaders like Taiwan Semiconductor. Intel's foundry has faced scrutiny over quality and scalability before, though the company maintains that 18A is on track and sees interest shifting to the subsequent 14A node for even more advanced applications.\nBroader Implications for Intel's Foundry Strategy Winning high-profile customers has been a key goal for Intel Foundry, which has invested heavily to compete as a contract manufacturer. Deals with Microsoft ( NASDAQ:MSFT ) and Amazon ( NASDAQ:AMZN ) for custom chips on 18A have been announced, and Apple ( NASDAQ:AAPL ) might go with Intel for its entry-level M-series chips in 2027, but volumes from such clients are relatively small compared to demands from AI leaders like Nvidia.\n\nNvidia halting the testing -- while not a definitive rejection -- underscores the high bar set for advanced nodes. Competitors continue to dominate high-end production, and Intel must demonstrate reliable yields and performance to secure larger commitments.\nKey Takeaway Investors should not read too much into Nvidia's decision to pause 18A testing at this stage, as qualification processes are lengthy and multifaceted. However, greater caution is warranted moving forward.\nMuch of Intel's turnaround depends on the success of the 18A process in delivering competitive manufacturing capabilities. If the node falls short of expectations in attracting major business from customers, it could complicate the company's path to foundry profitability and an overall recovery.\nThe New Report Shaking Up Retirement Plans You may think retirement is about picking the best stocks or ETFs, but you’d be wrong. Even great investments can be a liability in retirement. It’s a simple difference between accumulating vs distributing, and it makes all the difference.\nThe good news? After answering three quick questions many Americans are reworking their portfolios and finding they can retire earlier than expected. If you’re thinking about retiring or know someone who is, take 5 minutes to learn more here .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "23:51:00",
      "Source": "Motley Fool",
      "Title": "3 Artificial Intelligence Stocks You Can Buy and Hold for the Next Decade",
      "URL": "https://finance.yahoo.com/m/3893a052-cb25-3c43-881a-e2a7a4c936f4/3-artificial-intelligence.html",
      "Content": "3 Artificial Intelligence Stocks You Can Buy and Hold for the Next Decade\n\nLeo Sun, The Motley Fool\nWed, December 24, 2025 at 7:51 AM PST 5 min read\n\nIn this article: NVDA\n\nTSM\n\nASML\n\nKey Points Nvidia’s chips are still the best picks and shovels for the AI gold rush.\nTSMC manufactures Nvidia’s chips with its best-in-breed foundries.\nASML’s lithography systems enable TSMC to produce those chips.\n10 stocks we like better than Nvidia ›\nThe artificial intelligence ( AI ) market has expanded rapidly over the past decade as more powerful chips and generative AI platforms have entered the market. Those AI services became practical tools that could quickly crunch, analyze, and predict trends for businesses and mainstream users.\n\nThe AI market could grow at a CAGR of 30.6% from 2026 to 2033, according to Grand View Research, as more organizations use AI to automate, accelerate, and optimize their operations. To capitalize on this expansion, investors should consider buying and holding these three top tech stocks for the next decade and beyond: Nvidia (NASDAQ: NVDA) , TSMC (NYSE: TSM) , and ASML (NASDAQ: ASML) .\nNvidia Nvidia is the world's top producer of discrete GPUs for data centers, which are used to process complex AI tasks. Most of the top AI companies -- including OpenAI, Meta , and Microsoft -- use its GPUs. It also locks in those clients with CUDA (Compute Unified Device Architecture), a proprietary programming platform for its own chips.\n\nAs the producer of the best picks and shovels for the AI gold rush, Nvidia still has plenty of room to grow. It might face tougher competition from AMD 's cheaper GPUs, first-party AI chips from some of its top customers, and other types of AI accelerators -- but its first-mover edge, best-in-breed reputation, and sticky ecosystem will fuel its long-term growth. Tighter export curbs could throttle its shipments to China over the next few years, but it can offset that pressure with its growth in the U.S., Europe, and other Asian markets.\nFrom fiscal 2025 (which ended in January) to fiscal 2028, analysts expect Nvidia's revenue and adjusted earnings per share ( EPS ) to grow at a CAGR of 46% and 29%, respectively. Even though its stock has already soared nearly 23,000% over the past decade, it still looks reasonably valued at 25 times next year's earnings. Therefore, Nvidia should remain one of the simplest ways to profit from the AI boom over the next decade.\n\nTSMC Nvidia outsources the production of its top-tier GPUs to TSMC, the world's largest and most advanced contract chipmaker. TSMC is the only foundry capable of manufacturing Nvidia's smallest, densest, and most power-efficient chips.\nTSMC also produces chips for other leading fabless chipmakers like AMD, Apple , and Qualcomm . It manufactures its most advanced chips in Taiwan, which is exposed to potential trade and military conflicts with China; however, it has been mitigating this risk by building more plants in the U.S., Europe, and Japan.\n\nStory Continues\nIn its latest quarter, TSMC generated 57% of its revenue from the high-performance computing (HPC) market, which includes Nvidia's data center GPUs. That segment is driving its near-term growth and reducing its dependence on the cyclical PC, smartphone, and automotive markets.\nFrom 2024 to 2027, analysts expect TSMC's revenue and EPS to grow at a CAGR of 24% and 27%, respectively, as the AI market expands and its more cyclical markets stabilize. Those are strong growth rates for a stock that trades at 19 times next year's earnings, and it will remain a linchpin of the expanding semiconductor sector for the foreseeable future.\n\nASML TSMC couldn't manufacture its chips without the Dutch semiconductor equipment maker ASML. ASML is the world's leading producer of lithography systems, which optically etch circuit patterns onto silicon wafers. It's also the only supplier of extreme ultraviolet (EUV) lithography systems, which produce the smallest and most densely packed chips.\n\nASML perfected its EUV technology over the past two decades, and the high costs of producing those massive systems prevented its potential competitors from gaining any ground. Its EUV systems currently cost $200-$400 million, require multiple planes and trucks to ship, and must be reassembled at the foundries by its own teams.\nASML's monopolization of that market makes it another linchpin of the semiconductor sector, and the world's most advanced AI chips couldn't exist without its cutting-edge technology. The export curbs against China (where it's barred from selling its higher-end systems) are throttling its near-term sales, but its growth across other regions should offset that pressure.\nFrom 2024 to 2027, analysts expect its revenue and EPS to grow at a CAGR of 11% and 18%, respectively, as it ramps up its shipments of its latest \"high-NA\" EUV systems for manufacturing even smaller and denser chips. Its stock isn't a bargain at 35 times next year's earnings, but its scale, guaranteed long-term growth, and pricing power justify that higher valuation.\n\nShould you buy stock in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $504,239 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,159,896 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 985 % — a market-crushing outperformance compared to 195% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nLeo Sun has positions in ASML, Apple, and Meta Platforms. The Motley Fool has positions in and recommends ASML, Advanced Micro Devices, Apple, Meta Platforms, Microsoft, Nvidia, Qualcomm, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\n3 Artificial Intelligence Stocks You Can Buy and Hold for the Next Decade was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "22:40:01",
      "Source": "Bloomberg",
      "Title": "Intel Shares Fall on Report Nvidia Halts Production Test",
      "URL": "https://finance.yahoo.com/news/intel-shares-fall-report-nvidia-131413697.html",
      "Content": "Intel Shares Fall on Report Nvidia Halts Production Test\n\nJake Rudnitsky\nWed, December 24, 2025 at 6:40 AM PST 2 min read\n\nIn this article: INTC\n\nNVDA\n\nTSM\n\n(Bloomberg) -- Intel Corp. shares fell Wednesday after a report said that Nvidia Corp. halted a test to use Intel’s production process to make advanced chips.\nNvidia recently tested the so-called 18A process but stopped moving forward, Reuters reported, citing two unidentified people familiar with the matter.\n\nMost Read from Bloomberg\nNew York's Congestion Pricing Is Working. Five Charts Show How\nWith Mamdani, the Humble Bus Gets Its Due\nAs Zipcar Leaves London, Car-Share Boosters Are Looking for a New Ride\nWhen It Comes to US Transportation, 2025 Had Some Wins, Too\nSpokespeople for Nvidia and Intel didn’t immediately respond to requests for comment. An Intel spokesperson told Reuters that the company’s 18A manufacturing technologies are “progressing well.”\nIntel’s shares fell about 2.2% as trading got underway in New York.\nIntel recently opened a new factory at its Ocotillo site in Arizona known as Fab 52 that’s the first to go into mass production with the 18A technique. The company says it’s the most cutting edge production technology developed and deployed in the US. Intel’s push to make advanced chips domestically is an attempt to challenge the global leader, Taiwan Semiconductor Manufacturing Co., and reassert American leadership in the industry.\n\nNvidia agreed to invest $5 billion into Intel in September, following the US government’s decision to take a roughly 10% stake in the company. The investment by the world’s most valuable company and a key designer of chips for the artificial intelligence boom was seen as a boost for Intel, which has struggled to stem losses and catch competitors that have surpassed it in recent years. However, the deal didn’t include a commitment for Intel to make Nvidia chips.\n18A is a bid to return to making Intel’s best offerings in-house. The technology contains two new features that Intel says are breakthroughs for the industry.\nThe first relates to transistors, the microscopic switches that give semiconductors their function. Modern chips cram tens of billions of transistors into a small area. In order to make chips more efficient and use less energy, the ability to switch these transistors on and off becomes critical.\n\nThe 18A products will be the first to have transistors made with so-called gate-all-around technology, a technique that allows finer control over this process, Intel said. That will allow for chips with more transistors — and the ability to handle growing amounts of data — that consume less power.\nThe second innovation pertains to how the chips are powered. The ultimate promise is that chips can have more transistors and be more efficient.\n\nStory Continues\n(Updates shares in fourth paragraph.)\nMost Read from Bloomberg Businessweek\nPrivate Equity Is Ruining a Beloved Fly-Fishing Brand, Retailers Say\nTariffs Unravel India’s Dream of Challenging China in Toymaking\nChina’s EV Battery Giant Is Trying to Find a New Road\nThe United States of Klarna\nUniqlo Founder and Japan’s Richest Man Loves a $32 Pair of Slacks\n©2025 Bloomberg L.P.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "22:34:54",
      "Source": "GuruFocus.com",
      "Title": "INTC: Intel Stock Falls After Nvidia Backs Out of 18A Chip Deal",
      "URL": "https://finance.yahoo.com/news/intc-intel-stock-falls-nvidia-140806180.html",
      "Content": "INTC: Intel Stock Falls After Nvidia Backs Out of 18A Chip Deal\n\nNauman Khan\nWed, December 24, 2025 at 6:34 AM PST 1 min read\n\nIn this article: NVDA\n\nINTC\n\nAVGO\n\nTSM\n\nThis article first appeared on GuruFocus .\nIntel ( NASDAQ:INTC ) stock slipped about 2% on early Wednesday after reports indicated that Nvidia ( NASDAQ:NVDA ) chose not to use Intel's 18A manufacturing process.\nThe two companies had tested the process earlier this year, but Nvidia reportedly decided against moving forward. Broadcom ( NASDAQ:AVGO ) also took part in similar trials.\n\nWarning! GuruFocus has detected 5 Warning Signs with INTC.\nIs INTC fairly valued? Test your thesis with our free DCF calculator.\nIntel's 18A technology is part of its effort to attract external chipmakers as customers, but early evaluations faced technical challenges, which may be affecting demand.\nShares of Nvidia remained mostly steady, suggesting minimal immediate impact on its production plans.\nThe company continues to rely heavily on Taiwan Semiconductor Manufacturing Company (TSM) for advanced chip fabrication.\nFor Intel, the decision underscores the competitive hurdles in winning high-profile foundry clients while trying to scale its advanced manufacturing capabilities.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "21:15:16",
      "Source": "24/7 Wall St.",
      "Title": "Nvidia (NASDAQ: NVDA) Stock Price Prediction for 2026: Where Will It Be in 1 Year (Dec 24)",
      "URL": "https://finance.yahoo.com/m/fbc40b68-e691-3ac2-ac6e-c468b91245d1/nvidia-%28nasdaq%3A-nvda%29-stock.html",
      "Content": "Nvidia (NASDAQ: NVDA) Stock Price Prediction for 2026: Where Will It Be in 1 Year (Dec 24)\n\nJoel South\nWed, December 24, 2025 at 5:15 AM PST 6 min read\n\nIn this article: NVDA\n\nTSM\n\nTSMWF\n\nMSFT\n\nTM\n\nShares of Nvidia Corp. ( NASDAQ: NVDA ) have popped 5.2% in the past week, after it announced it would begin shipping H200 chips to China in February and that it would invest $1.5 billion on a server farm in Israel. Nvidia’s stock is 30.2% higher than six months ago, outperforming the S&P 500 and Nasdaq in that time.\n\n24/7 Wall St. Key Points U.S.-China trade relations have presented headwinds, but Nvidia Corp. ( NASDAQ: NVDA ) is also the dominant AI chipmaker in the market, and the company’s profitability remains strong.\nHere is a look at where Nvidia stock could be headed for the rest of this year and into the next.\nIf you’re thinking about retiring or know someone who is, there are three quick questions causing many Americans to realize they can retire earlier than expected. take 5 minutes to learn more here\n\nNote that gains for the chipmaker in that time have helped wipe away the steep drop the stock suffered early in 2025, after it reported it would take a $5.5 billion charge tied to the H20 chip export restrictions to China. While some analysts have raised price targets, others caution about ongoing headwinds due to uncertainty surrounding future U.S.-China trade relations and the potential for stricter regulations. The third-quarter report was stellar on the top and bottom lines due to strong growth in the data center segment.\nDespite its challenges, the company's pivot to U.S. AI infrastructure investments signals resilience. With analysts eyeing robust data center demand, 24/7 Wall St. here explores whether Nvidia can sustain its recovery and drive further growth.\n\nWhy Invest in Nvidia? Nvidia faces significant hurdles as it navigates U.S.-China trade restrictions and intense market expectations. In the first quarter, export controls on its H20 AI chip—which had been designed specifically to circumvent export restrictions on advanced technology to China—led to the substantial write-down noted above. Analysts believed the ban could result in a $9 billion revenue hit. Some $700 million would affect fiscal first-quarter results, with the remaining $8 billion spread across the second and third quarters.\n\nU.S. tariffs and China’s retaliatory measures also threatened supply chain costs, particularly for components sourced globally, while competition from Huawei’s Ascend chips grows. These factors had analysts warning of margin pressure. Yet, Nvidia's profitability remains robust. The company has reportedly raised prices 10% to 15% on some of its most popular GPUs as a result of the tariffs. Gaming processor prices jumped 5% to 10%, while it hiked high-end AI GPUs as much as 15% to account for surging manufacturing costs and to keep its earnings stable.\n\nStory Continues\nYet investments in U.S. AI infrastructure, supported by Taiwan Semiconductor Manufacturing's $165 billion Arizona fab expansion, bolster Nvidia's supply chains and are backed by its $37.6 billion cash reserve.\nCEO Huang announced during his recent trip to South Korea that Nvidia will supply more than 260,000 advanced graphics processing units (GPUs) to South Korean firms, including Samsung and Hyundai Motor. He believes AI has reached a \"virtuous cycle\" where improvements in the models lead to more investment, which in turn leads to further improvement and investment. He also expressed hope that trade talks between the U.S. and China might lead to a change in policy that allows Nvidia to resume sales of state-of-the-art chips in China. As mentioned, the U.S. president has now allowed the company to sell its advanced H200 AI chips to China.\n\nThe AI market is projected to grow at a 37% CAGR through 2030, according to Grand View Research. This supports Nvidia’s $170 billion fiscal 2026 revenue forecast, a 30% increase over the $130.5 billion it generated in 2025.\nNvidia as a Company In its third-quarter earnings report, Nvidia revenue totaled a record $57.01 billion, including $51.2 billion from its data center division. The total was up 66% year over year, largely fueled by the voracious demand for its AI chips.\nThe chipmaker invested $3.2 billion in capital expenditures in fiscal 2025, expanding Blackwell accelerator production and AI infrastructure. The company's capex has spiked over 200% this year to more than $3 billion to meet hyperscaler demand.\n\nU.S.-China trade restrictions still pose risks, even with the seeming thaw, tariffs could raise costs, which would explain the price hikes reportedly implemented. A 36% operating expense increase to $5.8 billion for R&D offset Nvidia's adjusted operating income of $37.8 billion.\nYet, Nvidia's growth is not solely tied to data centers. The company expanded its automotive segment, with a 32% year-over-year increase to $592 million, driven by partnerships with Toyota and Aurora Innovation for autonomous vehicles. This diversifies Nvidia's portfolio amid tariff uncertainties.\nNvidia has projected fiscal third-quarter revenue of $65 billion, plus or minus 2%. This outlook exceeded analysts' consensus projection.\nNvidia as a Stock This has been a rollercoaster year for Nvidia shareholders. The stock dropped to a 52-week low of $86.62 in April. After an announced pause in U.S.-China tariffs and the first-quarter results, the share price recovered. It hit an all-time high of $212.19 in October, which had the company's market cap briefly over $5 trillion.\n\nWhile some insiders have been selling shares, analyst sentiment remains bullish. Of 64 analysts who cover the stock, 60 recommend buying shares, 11 of them with Strong Buy ratings. Their consensus one-year price target is $253.02, which signals over 38% upside potential from its current price. Targets range from $140 to $352 per share.\nCitigroup, J.P. Morgan, Morgan Stanley, and others recently maintained their Buy-equivalent ratings. Evercore ISI has the street-high target price. It cited accelerating revenue growth, strong demand for Blackwell chips, an improving supply chain, and a significant pipeline. Yet, renowned investor Michael Burry is bearish on Nvidia.\nEstimate\nPrice Target\nChange From Current Price\nLow\n$140.00\n−23.5%\nMedian\n$253.02\n38.3%\nHigh\n$352.00\n92.4%\n\nNvidia's AI dominance, 93% data center growth, and automotive partnerships with Toyota positioned the company for gains in 2025. However, tariff risks and DeepSeek’s competitive AI models require caution. The AI market's growth and the chipmaker's $47 billion second-quarter revenue position Nvidia to achieve its $170 billion full-year revenue target, while its cash buffer and Stargate Project role offer stability. Still, valuation concerns linger. Nvidia is a buy for growth-oriented investors, but others should use caution.\n\n24/7 Wall St.'s 2026 year-end price target for Nvidia is $300.14 per share, which would be a 640.% gain. That estimate accounts for tariff risks, competition from DeepSeek, and potential Blackwell supply constraints. It also reflects Nvidia's AI dominance and second-quarter 2026 revenue guidance.\nTime to Sell Nvidia Stock as Michael Burry Takes Aim?\n\nThe New Report Shaking Up Retirement Plans You may think retirement is about picking the best stocks or ETFs, but you’d be wrong. Even great investments can be a liability in retirement. It’s a simple difference between accumulating vs distributing, and it makes all the difference.\nThe good news? After answering three quick questions many Americans are reworking their portfolios and finding they can retire earlier than expected. If you’re thinking about retiring or know someone who is, take 5 minutes to learn more here .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "20:00:53",
      "Source": "Investing.com",
      "Title": "Intel shares slide after report Nvidia halts testing of 18A process",
      "URL": "https://finance.yahoo.com/news/intel-shares-slide-report-nvidia-120053021.html",
      "Content": "Intel shares slide after report Nvidia halts testing of 18A process\n\nSenad Karaahmetovic\nWed, December 24, 2025 at 4:00 AM PST 1 min read\n\nIn this article: NVDA\n\nINTC\n\nTSM\n\nInvesting.com -- Intel Corporation stock dropped 2.7% in premarket trading after Reuters reported that Nvidia stopped testing Intel’s 18A chip manufacturing process.\nAccordingly, Nvidia had been evaluating whether it could manufacture its chips using Intel’s advanced 18A production technology but decided not to move forward with the tests.\n\nAn Intel spokesperson told Reuters that the company’s 18A manufacturing technologies are \"progressing well,\" without providing further details about Nvidia’s decision to halt testing.\nThe news comes just months after the two semiconductor giants announced a major collaboration in September. Under that agreement, Intel would develop custom x86 CPUs for Nvidia’s AI infrastructure platforms, while also creating x86 system-on-chips integrating Nvidia RTX GPU chiplets for personal computing devices.\nAs part of the partnership, Nvidia had committed to investing $5 billion in Intel’s common stock at a purchase price of $23.28 per share, subject to regulatory approvals.\nThe reported testing halt raises questions about the technical viability of Intel’s advanced manufacturing process, which the company has positioned as crucial to its turnaround strategy and efforts to compete with Taiwan Semiconductor Manufacturing Company in the foundry business.\nRelated articles\nIntel shares slide after report Nvidia halts testing of 18A process\nThe 5 Best Gold Mining Stocks to Buy Now\nGold: $4K Breakout Faces First Real Test as Stocks and Sentiment Rise Together\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "19:20:00",
      "Source": "Motley Fool",
      "Title": "Prediction: These 3 Artificial Intelligence (AI) Stocks Will Be Big Winners Again in 2026",
      "URL": "https://finance.yahoo.com/m/0b954eed-e4d9-39b2-b35e-1eb8792e4ded/prediction%3A-these-3.html",
      "Content": "Prediction: These 3 Artificial Intelligence (AI) Stocks Will Be Big Winners Again in 2026\n\nBeth McKenna, The Motley Fool\nWed, December 24, 2025 at 3:20 AM PST 5 min read\n\nIn this article: NVDA\n\nAVGO\n\nTSM\n\nKey Points Nvidia stock is a top buy for tech investors, as the company's AI-enabling GPUs are largely powering the AI revolution.\nBroadcom stock is a top buy, thanks largely to the strong demand for the company's custom AI chips.\nTaiwan Semiconductor Manufacturing stock is a top buy because the world's largest chip foundry is profiting significantly from the powerful demand for AI chips, both GPUs and custom chips.\n10 stocks we like better than Nvidia ›\n\nArtificial intelligence (AI) stocks, as a group, have been among the best-performing groups in 2025, just as they were in 2024.\nThree AI stocks that were big winners in 2025, as of Dec. 23, and that I believe will be big winners again in 2026, are Nvidia (NASDAQ: NVDA) , Broadcom (NASDAQ: AVGO) , and Taiwan Semiconductor Manufacturing , or TSM (NYSE: TSM) .\n3 Top AI stocks to buy for 2026 Stocks are listed in order of 5-year return.\nCompany\nMarket Cap\nForward P/E\nWall Street's Estimated Annualized 5-Year EPS Growth\nYear-to-Date 2025 Stock Return\n5-Year Stock Return\nNvidia\n$4.8 trillion\n24.0\n48.5%\n40.9%\n1,359%\nBroadcom\n$1.7 trillion\n34.4\n35.9%\n52%\n813%\nTaiwan Semiconductor Manufacturing\n$1.2 trillion\n24.5\n30.4%\n52.4%\n211%\nS&P 500 Index\n--\n--\n--\n19%\n102%\n\nData sources: Yahoo! Finance and YCharts. P/E = price-to-earnings ratio . EPS = earnings per share. Data as of Dec. 23, 2025.\nNvidia: The dominant maker of AI chips and related tech Nvidia's graphics processing units (GPUs), its flagship semiconductors, are considered the gold standard for training artificial intelligence (AI) models and deploying AI applications.\nThe company's data center platform had been performing well for quite some time. But demand began skyrocketing for its AI-enabling products -- its GPUs and high-performance networking products -- soon after OpenAI released its ChatGPT chatbot in late 2022. This event demonstrated to company leaders and the general public the phenomenal capabilities of generative AI.\n\nIn late October at the company's GTC (GPU Technology Conference) in Washington, D.C., CEO Jensen Huang said that management has \"visibility\" into $500 billion of demand for its key data center technology over the next five quarters . This demand of $100 billion per quarter, on average, is truly mind-blowing. As context, in its fiscal third quarter (ended late October), Nvidia's total revenue was $57.0 billion, of which $51.2 billion was from the data center platform.\nBroadcom: The leading maker of custom AI chips Broadcom develops semiconductors for various end markets and also develops infrastructure software.\n\nStory Continues\nThe company's robust growth is being drven by strong demand for its custom AI-enabling application-specific integrated circuits (ASICs) and Ethernet networking products, both for data centers. Its acquisition of software maker VMware in late 2023 is proving to be a shrewd move, as this business is also growing nicely.\n\nBroadcom is the top partner for big tech companies seeking custom ASICs. As the name suggests, these chips are designed for specific applications. These include internal uses and, in some cases, for availability in their cloud computing services. By contrast, Nvidia's GPUs can be considered more general-purpose AI chips. There is a need for both GPUs and ASICs, so investors shouldn't be concerned that one of these types of chips will fully win out over the other.\nTSM: The world's largest chip foundry Taiwan Semiconductor Manufacturing is the world's largest chip foundry. That means it produces chips of various types for companies that contract out all or some of the manufacturing of chips they design.\nTSM is the largest producer of AI chips worldwide, which has led to significant financial growth in recent years, driven by surging demand for these chips.\n\nTSM's customers include nearly every major chip company, such as Nvidia, Broadcom, and Advanced Micro Devices (AMD), which is Nvidia's main rival in the AI-enabling GPU market. Moreover, it also manufactures chips, including AI chips, for major tech companies that have designed their own chips. This includes Apple , widely considered the company's largest customer, though some Wall Street analysts expect Nvidia to soon overtake Apple as TSM's top customer.\nAn added benefit for some investors is that TSM pays a decent dividend for a tech company. The dividend yield was 1.13%, as of the close of the market on Dec. 23.\nShould you buy stock in Nvidia right now? Before you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $502,783 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,126,057 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 975 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nBeth McKenna has positions in Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Apple, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy .\nPrediction: These 3 Artificial Intelligence (AI) Stocks Will Be Big Winners Again in 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "19:05:28",
      "Source": "Reuters",
      "Title": "How a Silicon Valley dealmaker charmed Trump and gave Intel a lifeline",
      "URL": "https://finance.yahoo.com/news/silicon-valley-dealmaker-charmed-trump-110528784.html",
      "Content": "How a Silicon Valley dealmaker charmed Trump and gave Intel a lifeline\n\nMax A. Cherney and Jeffrey Dastin\nWed, December 24, 2025 at 3:05 AM PST 11 min read\n\nIn this article: INTC\n\nNVDA\n\nAMD\n\nOPAI.PVT\n\nAMZN\n\nBy Max A. Cherney and Jeffrey Dastin\nSAN FRANCISCO, Dec 24 (Reuters) - It was a Thursday before dawn in Silicon Valley when Intel ( INTC ) CEO Lip-Bu Tan found himself under attack by the president of the United States.\n“The CEO of INTEL is highly CONFLICTED and must resign, immediately,” U.S. President Donald Trump wrote on his Truth Social platform at 4:39 AM Pacific Time on August 7. Before he was Intel CEO, Tan had been a prolific investor in companies in China.\n\nTrump and Tan had not met. While technology leaders from Nvidia , AMD, OpenAI , Amazon, Google and Palantir had all recently traveled to see Trump, the head of America’s most storied chipmaker had not spent time with the president since joining Intel in March.\nPolitics was not Tan’s top priority. It had been more than 20 years since Tan, 66, had donated to a presidential election campaign. Though ​he spoke with a handful of U.S. government leaders, including Commerce Secretary Howard Lutnick in April, the Intel CEO did not fill the company’s top policy job in Washington for months after its prior holder, a Democrat, resigned.\n\nAlmost immediately after Trump’s attack, Intel scrambled to lock down time with the president, two people with knowledge of the situation said. That culminated in the most pivotal, roughly 40-minute meeting of Tan’s decades-long career.\nPreviously unreported details about Tan and Intel show ‌how a man Trump had accused of supporting China’s interests came away from the meeting with a commitment from the U.S. government to invest billions of dollars for a nearly 10% stake in the company.\n\nThe deal gave Intel a too-strategic-to-fail aura and opened doors to potential partners who might want to win the president’s favor. It also may pave the way for the government to take more equity stakes in businesses the administration deems strategic, in what some investors previously described to Reuters as ushering in a new era of U.S. industrial policy.\nIntel’s share price has risen around 80% since Tan’s appointment, outpacing the percentage gains of the ‌S&P 500 ( ^GSPC ) and Nvidia ( NVDA ) in that time.\nReuters spoke with around 20 people who are current and former Intel employees, government advisers, and Tan’s industry contacts. Some of them questioned whether Tan has the technical acumen to restore Intel’s lead in chip manufacturing and find a winning artificial intelligence strategy, even as his skills as a dealmaker served him well in the Oval Office and elsewhere.\nThough Intel’s chips powered some of the first mass-produced PCs, years of dysfunction had allowed foreign competitors such as TSMC to eclipse Intel in high-end chip production.\n\nStory Continues\nIn statements, an Intel spokesperson said Tan needed no persuading to engage with the Trump administration. Early on, he elevated government affairs, among other functions, to report to him. Intel announced in December that a Trump economic adviser would helm the unit.\n“Lip-Bu Tan has a long, and well-established history of engagement in Washington, both before and after joining Intel,” the spokesperson said. Intel declined to make Tan available for an interview.\n\nA White House spokesperson said President Trump was using his executive power to get “the best bargain for the American taxpayer” and safeguard U.S. security.\n“The Administration’s historic deal with Intel is one of many initiatives to reshore semiconductor and other critical manufacturing back to the United States,” the White House spokesperson said.\n40 MINUTES IN THE OVAL OFFICE Before heading into the White House, Tan called on his own allies who had forged relationships with the president, including Microsoft ( MSFT ) CEO Satya Nadella and Nvidia CEO Jensen Huang, to vouch for him, said two people familiar with the discussions.\nTan “spoke, as he does often, with confidantes who would have relevant insight and perspective ahead of his meeting with President Trump,” the Intel spokesperson said. Nvidia and Microsoft did ⁠not comment for this story.\n\nPrior to the meeting, Tan strategized with his advisors on how to convince Trump he was an American patriot by discussing his personal story and his ‌commitment to the United States, the two people said. He also prepared to discuss his China holdings, the people said.\nTan has made some 600 investments in China, some linked to the country’s military, according to Reuters reporting. Those connections to China are what ultimately landed him in the crosshairs of the president. Two of Tan's investment firms — Walden International and Walden Catalyst — did not answer requests for comment. A third, Celesta Capital, said it had made one China investment that it exited in 2020.\nHis dealmaking acumen, Celesta Capital said, is a key reason Tan “is so well suited to lead Intel’s current moment.”\n\nJust two cabinet members joined the meeting between Trump and Tan in the Oval Office: Lutnick and Treasury Secretary Scott Bessent, one of the people said. Trump questioned the Intel CEO about how he planned to ‍turn the company around, the person said.\nTan had already told Lutnick in a prior meeting that he did not want billions in handouts that the U.S. owed Intel as part of the CHIPS Act, the Commerce Secretary said in a video on X in August. Neither Lutnick nor Tan said why. The grant money had been offered to companies under the 2022 CHIPS Act in exchange for reviving domestic manufacturing so the U.S. could reduce its reliance on foreign semiconductor production.\nThe administration of former President Joe Biden had announced dozens of these awards to various chip-related companies.\n\nSo when Trump proposed that the U.S. receive equity in exchange for giving Intel more CHIPS Act money - an idea that two sources said Lutnick had talked about for weeks with government staff - Tan struck a deal. Intel declined to comment on the specifics of the private conversation, but Lutnick later said in the video that equity made the exchange “fair.”\nThe deal gave Intel a $5.7 billion cash infusion and set up the U.S. government to be its largest shareholder. After the initial meeting, Tan pledged to “make Intel great again” in the video that Lutnick posted on social media, with the caption, “The Art ​of the Deal: Intel.”\nWithin weeks of his White House coup, Tan finalized a partnership with Nvidia, securing $5 billion from its CEO Huang who called Tan his “long-time friend.” Unlike Intel, known for manufacturing chips called central processing units, Nvidia designs the world’s top chips for AI.\n\nTrump celebrated the deal on social media, posting an AI-generated image of himself staring at a chart of Intel’s stock and showing how the value of the U.S. stake had risen by 50% after Nvidia’s investment.\nINTEL’S VENTURE CAPITALIST CEO Born in Malaysia ‌to a Chinese-language journalist and a teacher, Tan started out in the hard sciences and had plans to become a nuclear engineer, but he ultimately went to business school and in or around 1983 got his first job in venture capital in California.\nDuring his career, Tan established himself as a man with a golden touch with startups that successfully were sold to other companies or went public. He amassed an estimated personal fortune well above $500 million.\n\nTan’s dealmaking savvy is helping Intel only to a point, three people with knowledge of the company said. For instance, Tan’s bid to buy SambaNova was the subject of internal debate given how the startup makes application-specific AI chips while the market favored general-purpose ones.\nAdditionally, these people said, chipmaking requires more engineering expertise than a typical tech business. Factories that make advanced chips rely on tools so precise they could pinpoint a U.S. quarter-dollar coin as far away as the moon. Some of its most successful executives, like Nvidia’s Huang, are electrical engineers by training.\nStill, some Wall Street analysts say Tan is an excellent choice for Intel CEO, with decades of chip-industry experience and a track record of delivering returns to shareholders.\n\n“Lip-Bu is deeply involved in technical decisions, including product roadmaps,” the Intel spokesperson said. “These are technical, hands-on changes that highlight the depth of his technical leadership.”\nTan was also “keenly aware” of Intel’s challenges when he took the CEO job, the Intel spokesperson said, because he had served on its board from 2022 until 2024.\nBut once inside Intel – which had around 100,000 staff when he joined - the complexity of the chip manufacturer was unlike anything Tan had faced as a CEO before, said two of the sources, who worked at Intel.\nThe company was bleeding cash to build factories for chip manufacturing, an effort begun under his predecessor Pat Gelsinger, and it needed an estimated $20 billion or more to have a shot at winning customers.\n\nTan called on top executives in his network and asked how they did things, one of the sources said. He likewise called on big customers – cloud providers like Amazon and Google – and asked what they wanted, said two people familiar ⁠with the matter.\nTan shook up Intel’s management team, similar to when he led the chip design company Cadence. There, he had worked with a deputy to draft a list of executives to fire, a person familiar with his Cadence days said. Cadence declined to comment.\nTan is cutting deeper still: ​laying off around 15% of Intel employees per securities filings, many of them managers.\nHe bypassed middle managers to have technical talent brief him directly, two of the people said. Tan named Intel engineering veteran Pushkar Ranade as his chief of staff and in December elevated him to interim chief technology officer.\n\nDespite the ​intensity of his task at Intel, Tan has split his time with his myriad other commitments, which include his investment firms. When evaluating potential deals for Intel’s venture arm, Tan would also ask his investment firms for their opinion, one of the former Intel employees said.\nAn alleged conflict of interest with his venture portfolio prompted Intel’s board to push back on Tan over an acquisition this year, Reuters reported this month.\nHis Intel employment requires that he spend “such time as is necessary” to perform his duties as CEO, a change from the prior Intel chief’s contract that had required “full business efforts and time to Intel.”\nCelesta Capital said Tan's time commitment to the firm is now minimal, and its team has received no request to review deals for Intel Capital. Walden International and Walden Catalyst did not answer requests for comment.\n\nIntel said Tan ‍is working daily on transforming the company and “acted decisively” to flatten its structure, adding he is a “highly engaged CEO” who is “helping to restore ⁠speed, accountability, and create an engineering-centric, customer-focused culture.”\nA ‘LIFELINE’ FOR INTEL So far, the U.S. investment has been a catalyst for Intel. Its Corporate Vice President John Pitzer said in a September interview that President Trump had just hosted top technology CEOs for dinner to discuss AI, and that their companies were potential Intel customers.\nThe deal was a “lifeline” for Intel, said technology lobbyist and Chamber of Progress CEO Adam Kovacevich. Without it, Intel could have been out a CEO if it had succumbed to Trump’s pressure, he said.\n\nThe same week as the White House deal, Intel announced a $2 billion investment from Masayoshi Son’s SoftBank, where Tan once was a board member.\nLutnick, who previously had no vested interest in phone calls to his office from business or government leaders about Intel’s manufacturing, now has an incentive to jump at them, said one of the sources, who is familiar with the administration. Lutnick has indicated that Americans have skin in the game for Intel ⁠to land a foundry deal that could bolster U.S. chip production, the person said.\nForeign chip manufacturers operating in the U.S. are concerned that government officials will tip the scales for customers to manufacture with Intel instead of with them, according to two sources familiar with these worries.\n\nA Commerce Department official said the U.S. stake gives Intel a shot at success but not a leg up, and Intel is not “too strategic to fail.” The official said further that Secretary Lutnick talks to all parties rather than prioritizing calls for Intel’s sake.\nWhile Intel is picking up steam on the deals front, its manufacturing unit has struggled to produce ‌quality in-house chips.\nNvidia recently tested out whether it would manufacture its chips using Intel’s production process known as 18A but stopped moving forward, two people familiar with the matter said. Nvidia did not answer a request for comment.\n\nSign up for Yahoo Finance's Week in Tech\n\nBy subscribing, you are agreeing to Yahoo's\n\nTerms\n\nand\n\nPrivacy Policy\n\nSubscribe\nAn Intel spokesperson said the company’s 18A manufacturing technologies that make advanced chips are “progressing well,” and it “continues to see strong interest” for its next-generation production process, called 14A, which is expected to produce chips that are more ‌powerful and efficient.\nNvidia made no commitment to manufacture with Intel in September when investing $5 billion in the chipmaker. “Right now we are focused on collaborations,” Tan told reporters while announcing the deal with Nvidia’s Huang.\n(Reporting by Max A. Cherney and Jeffrey Dastin in San Francisco)\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "16:05:00",
      "Source": "GlobeNewswire",
      "Title": "Advantest Wins Excellent Performance Award at TSMC’s 2025 Supply Chain Management Forum",
      "URL": "https://finance.yahoo.com/news/advantest-wins-excellent-performance-award-080500069.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nAdvantest Wins Excellent Performance Award at TSMC’s 2025 Supply Chain Management Forum\n\nAdvantest America, Inc.\nWed, December 24, 2025 at 12:05 AM PST 2 min read\n\nIn this article: ADTTF\n\nATEYY\n\nTSM\n\nAdvantest Wins Excellent Performance Award at TSMC’s 2025 Supply Chain Management Forum\nTOKYO, Dec. 24, 2025 (GLOBE NEWSWIRE) -- Leading semiconductor test equipment supplier Advantest Corporation (TSE: 6857) today announced that it has been named a winner of TSMC’s Excellent Performance Award, recognized in the category of Excellent Production Support. This was Advantest’s first time winning an award at TSMC’s annual Supply Chain Management Forum.\n\nHeld on November 25, SCM forum invited supplier partners from around the world to celebrate their contributions over the past year. Suppliers were recognized for their outstanding performance in driving improvements and efficiencies across the supply chain and related industries. This year, the award evaluation placed greater emphasis on performance in construction safety, sustainability, and localization.\nAdvantest was recognized for its flexibility in expanding its production capacity, leveraging tooling and manpower to fulfill urgent demand. Moreover, Advantest has been acknowledged for its support in project development, which has significantly enhanced its partnership with TSMC.\n“We are thrilled to be recognized by one of our most respected partners,” said Doug Lefever, representative director and group CEO, Advantest Corp. “Advantest is dedicated to serving its partners across the supply chain, and we look forward to continued collaboration to strengthen supply chain resilience and drive innovation.”\n\nDoug Lefever was present at this year’s forum to accept the award from TSMC Senior Vice President and Deputy Co-COO, Dr. Cliff Hou .\nAdvantest's broad product portfolio spans SoC and memory testers, handlers, software, system-level test (SLT), device interfaces, and field service support to provide customers with best-in-class solutions that span the entire semiconductor value chain. Advantest remains dedicated to developing cutting-edge solutions that support our customers as they strive for innovation.\nAbout Advantest Corporation\nAdvantest (TSE: 6857) is the leading manufacturer of automatic test and measurement equipment used in the design and production of semiconductors for applications including 5G communications, the Internet of Things (IoT), autonomous vehicles, high-performance computing (HPC), including artificial intelligence (AI) and machine learning, and more. Its leading-edge systems and products are integrated into the most advanced semiconductor production lines in the world. The company also conducts R&D to address emerging testing challenges and applications; develops advanced test-interface solutions for wafer sort and final test; produces scanning electron microscopes essential to photomask manufacturing; and offers system-level test solutions and other test-related accessories. Founded in Tokyo in 1954, Advantest is a global company with facilities around the world and an international commitment to sustainable practices and social responsibility. More information is available at www.advantest.com .\n\nStory Continues\nCassandra Koenig\ncassandra.koenig@advantest.com\nA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/e8c828cb-744b-4937-bb1f-5f6c78458d27\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "07:37:09",
      "Source": "Investor's Business Daily",
      "Title": "Dow Jones Futures: S&P 500 Hits Record Close; Nvidia, Google Flash Buy Signals",
      "URL": "https://finance.yahoo.com/m/c9ddbb9d-1d58-3eb6-bce5-f5630f975e57/dow-jones-futures%3A-s%26p-500.html",
      "Content": "Dow Jones Futures: S&P 500 Hits Record Close; Nvidia, Google Flash Buy Signals\n\nED CARSON\nTue, December 23, 2025 at 3:37 PM PST 4 min read\n\nIn this article: NVDA\n\nKLAC\n\nGOOGL\n\nGOOG\n\n^DJI\n\nMarket breadth was narrow Tuesday, but the S&P 500 set a record close as Nvidia and Google made bullish moves.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "06:45:05",
      "Source": "Zacks",
      "Title": "TSMC (TSM) Beats Stock Market Upswing: What Investors Need to Know",
      "URL": "https://finance.yahoo.com/news/tsmc-tsm-beats-stock-market-224505049.html",
      "Content": "TSMC (TSM) Beats Stock Market Upswing: What Investors Need to Know\n\nZacks Equity Research\nTue, December 23, 2025 at 2:45 PM PST 3 min read\n\nIn this article: TSM\n\nTSMWF\n\n^GSPC\n\n^DJI\n\nTSMC (TSM) closed the most recent trading day at $296.95, moving +1.25% from the previous trading session. This move outpaced the S&P 500's daily gain of 0.46%. On the other hand, the Dow registered a gain of 0.17%, and the technology-centric Nasdaq increased by 0.57%.\nThe chip company's stock has climbed by 3.04% in the past month, falling short of the Computer and Technology sector's gain of 4.54% and the S&P 500's gain of 4.22%.\n\nThe investment community will be closely monitoring the performance of TSMC in its forthcoming earnings report. The company's earnings per share (EPS) are projected to be $2.72, reflecting a 21.43% increase from the same quarter last year. Our most recent consensus estimate is calling for quarterly revenue of $32.6 billion, up 21.26% from the year-ago period.\nLooking at the full year, the Zacks Consensus Estimates suggest analysts are expecting earnings of $10.19 per share and revenue of $121 billion. These totals would mark changes of +44.74% and +34.32%, respectively, from last year.\nIt's also important for investors to be aware of any recent modifications to analyst estimates for TSMC. These recent revisions tend to reflect the evolving nature of short-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the business outlook.\n\nOur research demonstrates that these adjustments in estimates directly associate with imminent stock price performance. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.\nThe Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has moved 0.15% lower. At present, TSMC boasts a Zacks Rank of #3 (Hold).\nInvestors should also note TSMC's current valuation metrics, including its Forward P/E ratio of 28.8. Its industry sports an average Forward P/E of 28.8, so one might conclude that TSMC is trading at no noticeable deviation comparatively.\n\nIt's also important to note that TSM currently trades at a PEG ratio of 1. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. The Semiconductor - Circuit Foundry industry had an average PEG ratio of 1 as trading concluded yesterday.\n\nStory continues\nThe Semiconductor - Circuit Foundry industry is part of the Computer and Technology sector. This industry currently has a Zacks Industry Rank of 102, which puts it in the top 42% of all 250+ industries.\nThe Zacks Industry Rank is ordered from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nRemember to apply Zacks.com to follow these and more stock-moving metrics during the upcoming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nTaiwan Semiconductor Manufacturing Company Ltd. (TSM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-24",
      "Time": "05:45:43",
      "Source": "Investor's Business Daily",
      "Title": "Dow Jones Futures: Stock Market At Record Close As Nvidia, Google Lead",
      "URL": "https://finance.yahoo.com/m/c9ddbb9d-1d58-3eb6-bce5-f5630f975e57/dow-jones-futures%3A-stock.html",
      "Content": "Dow Jones Futures: Stock Market At Record Close As Nvidia, Google Lead\n\nED CARSON\nTue, December 23, 2025 at 1:45 PM PST 4 min read\n\nIn this article: NVDA\n\nGOOG\n\n^DJI\n\n^GSPC\n\n^IXIC\n\nMarket breadth was narrow Tuesday, but the S&P 500 set a record close as Nvidia and Google made bullish moves.\n\nContinue Reading\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "20:52:51",
      "Source": "MT Newswires",
      "Title": "Edgewater Wireless Systems Q2 Net Loss Narrows Slightly",
      "URL": "https://finance.yahoo.com/news/edgewater-wireless-systems-q2-net-125251986.html",
      "Content": "PREMIUM\nEdgewater Wireless Systems Q2 Net Loss Narrows Slightly\n\nMT Newswires\nTue, December 23, 2025 at 4:52 AM PST 1 min read\n\nIn this article: KPIFF\n\nTSM\n\nEdgewater Wireless Systems (YFI.V), which is focused on AI-powered Wi-Fi Spectrum Slicing silicon so\n\nPREMIUM\nUpgrade to read this MT Newswires article and get so much more.\nA Silver or Gold subscription plan is required to access premium news articles.\nUpgrade Already have a subscription? Sign in\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "19:56:00",
      "Source": "Business Wire",
      "Title": "Edgewater Wireless Reports Fiscal 2026 Q2 Results and Advances PrismIQ™ Wi-Fi Spectrum Slicing™ Silicon Program",
      "URL": "https://finance.yahoo.com/news/edgewater-wireless-reports-fiscal-2026-115600325.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nEdgewater Wireless Reports Fiscal 2026 Q2 Results and Advances PrismIQ™ Wi-Fi Spectrum Slicing™ Silicon Program\n\nBusiness Wire\nTue, December 23, 2025 at 3:56 AM PST 4 min read\n\nIn this article: KPIFF\n\nTSM\n\nOTTAWA, Ontario, December 23, 2025 --( BUSINESS WIRE )--Edgewater Wireless Systems Inc. ( TSXV: YFI ) ( OTC: KPIFF ) (\"Edgewater\" or the \"Company\"), the industry pioneer of AI-powered Wi-Fi Spectrum Slicing™ silicon solutions and IP, today reported financial results for the three and six months ended October 31, 2025 (Fiscal 2026 Q2). The Company’s interim financial statements and related Management’s Discussion and Analysis (\"MD&A\") are available on SEDAR+. All figures are in Canadian dollars and prepared in accordance with IFRS unless otherwise stated.\n\n\"Our progress this quarter reflects disciplined, capital-efficient execution across our PrismIQ™ roadmap—advancing AI-enabled capabilities and hitting key silicon program milestones,\" said Andrew Skafel, President & CEO . \"Just as importantly, our growing visibility—through invitations to speak alongside Silicon Catalyst and Arm at TSMC, and at Canada’s premier semiconductor symposium—signals that Edgewater’s star is rising as the industry shifts toward multi-link, multi-channel Wi-Fi architectures.\"\nHighlights and Corporate Update (Q2 FY2026)\nAI-enabled roadmap advancement: Initiated prototyping of an AI subsystem powered by Arm to enhance intelligent, edge-centric Wi-Fi performance in dense environments.\nCEO invited to speak at marquee Silicon Valley semiconductor forum: CEO Andrew Skafel selected to participate in Silicon Catalyst’s \"Catalysts of Innovation\" panel, hosted with Arm at TSMC—reinforcing Edgewater’s growing profile among semiconductor leaders, investors, and ecosystem partners.\nPrismIQ™ program milestone achieved: Completed RF front-end packaging for components slated for integration into the newly introduced PrismIQ™ product family—an on-time, on-budget milestone enabled by the Silicon Catalyst ecosystem.\nBalance sheet and capital structure enhancements: TSXV approved amendments extending the Company’s unsecured convertible debentures to September 1, 2027 and adding an acceleration feature (conversion permitted at the Company’s election if VWAP is $0.18+ for 10 consecutive trading days).\n\nSubsequent Events and Recent Visibility (Outside the Reporting Period)\nNational semiconductor thought leadership: Announced participation at Accelerated : Canada’s Semiconductor Symposium 2025 (Nov 25–26, Vancouver), where CEO Andrew Skafel spotlighted Edgewater’s AI-powered Wi-Fi Spectrum Slicing™ and Wi-Fi 8–ready silicon roadmap.\nSilicon Catalyst ecosystem engagement: Continued engagement across Silicon Catalyst’s network, including its Portfolio Company Update (Nov 5, 2025) convening semiconductor leaders and ecosystem stakeholders.\nDigital awareness program: Engaged Winning Media LLC for a two-month, omnichannel digital marketing program (US$50,000; subject to TSXV approval).\nAGM and governance: Shareholders approved all AGM resolutions, including the 2025 Equity Incentive Plan; the Board appointed Brian Imrie as Chair.\n\nStory Continues\nFinancial Summary (Three and Six Months Ended October 31, 2025)\nCash and liquidity: Cash at October 31, 2025 was $211,178.\nNet loss: Net loss for the quarter was $263,687 and for the six-month period was $623,643.\nOperating expenses: Operating expenses were $347,908 for the quarter and $707,644 for the six-month period, reflecting continued focus on advancing product development initiatives.\nNon-dilutive support: Recognized $48,499 (quarter) and $120,559 (six months) in other income related to reimbursable costs under the federal FABrIC program; recorded a $87,573 grant receivable at period end.\nCapital structure (as at October 31, 2025): Common shares outstanding: 237,902,445; stock options: 17,895,000; warrants: 67,837,139.\n\nEdgewater’s unaudited condensed interim consolidated financial statements and related MD&A for the three and six months ended October 31, 2025 are available on SEDAR+.\nAbout Edgewater Wireless\nWe make Wi-Fi. Better.\nEdgewater Wireless delivers unmatched Wi-Fi QoS—bar none—by intelligently mitigating congestion, managing spectrum allocation in real-time, and autonomously reconfiguring channel and link density—driving economic gains for service providers and their customers through reduced churn, improved efficiency, and high-performance connectivity in dense environments. Redefining Wi-Fi from the silicon up, Edgewater’s patented, AI-powered Spectrum Slicing platform—delivered through the PrismIQ™ product family—breaks the limits of legacy Wi-Fi by enabling multiple concurrent channels in a single band. Wi-Fi Spectrum Slicing delivers 10x performance and up to 50% lower latency, even for legacy devices. With 26 patents and a fabless model, Edgewater is transforming the economics of Wi-Fi for service providers, OEMs, and enterprises—powering scalable, standards-aligned/leading connectivity across residential, enterprise, and Industrial IoT markets. A Silicon Catalyst portfolio company, Edgewater is building the intelligence wireless foundation for the next era of global connectivity.\n\nVisit https://edgewaterwireless.com .\nForward-Looking Statements\nThis news release contains forward-looking statements and forward-looking information within the meaning of applicable securities laws. The use of any of the words \"expect\", \"anticipate\", \"continue\", \"estimate\", \"objective\", \"ongoing\", \"may\", \"will\", \"project\", \"should\", \"believe\", \"plans\", \"intends\" and similar expressions are intended to identify forward-looking information or statements. Although Edgewater Wireless believes that the expectations and assumptions on which such forward-looking statements and information are based are reasonable, undue reliance should not be placed on the forward-looking statements and information because Edgewater Wireless can give no assurance that they will prove to be correct. By its nature, such forward-looking information is subject to various risks and uncertainties, which could cause Edgewater Wireless’ actual results and experience to differ materially from the anticipated results or expectations expressed. These risks and uncertainties, include, but are not limited to access to capital markets, market forces, competition from new and existing companies and regulatory conditions. Readers are cautioned not to place undue reliance on this forward-looking information, which is given as of the date it is expressed in this news release or otherwise, and to not use future-oriented information or financial outlooks for anything other than their intended purpose. Edgewater Wireless undertakes no obligation to update publicly or revise any forward-looking information, whether as a result of new information, future events or otherwise, except as required by law.\nNEITHER THE TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN THE POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251223506547/en/\nContacts\nEdgewater Wireless Contacts:\nAndrew Skafel, President and CEO\nE: andrews@edgewaterwireless.com\nBill Mitoulas, Investor Relations\nE: ir@edgewaterwireless.com\nT: +1.416.479.9547\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "19:20:55",
      "Source": "GuruFocus.com",
      "Title": "TSMC Extends Foundry Lead in Q3",
      "URL": "https://finance.yahoo.com/news/tsmc-extends-foundry-lead-q3-112055714.html",
      "Content": "TSMC Extends Foundry Lead in Q3\n\nMoz Farooque ACCA\nTue, December 23, 2025 at 3:20 AM PST 1 min read\n\nIn this article: TSM\n\nTSMWF\n\nNVDA\n\nAMD\n\nAVGO\n\nThis article first appeared on GuruFocus .\nTaiwan Semiconductor Manufacturing ( NYSE:TSM ) continued to pull away from rivals in Q3 as the AI boom kept foundry demand humming.\nGlobal foundry revenue climbed 17% year over year to $84.8billion in the third quarter, Counterpoint Research said, with AI workloads driving heavy use of advanced manufacturing nodes. TSMC stood out again, growing revenue 41% from a year earlier and lifting its market share to 39%. The gains were fueled by a faster ramp in 3nm production and near-full utilization of 4nm and 5nm lines, largely tied to AI chip demand from Nvidia ( NASDAQ:NVDA ), AMD ( NASDAQ:AMD ), and Broadcom.\n\nWarning! GuruFocus has detected 1 Warning Sign with NVO.\nIs TSM fairly valued? Test your thesis with our free DCF calculator.\nElsewhere, growth was far more muted. Non-TSMC foundries posted just 6% growth as tariff-related pull-forward orders faded, even with help from China's subsidies. Analysts say the next challenge is capacity, with advanced nodes and CoWoS packaging already running close to full. AI demand is still strong, but physical limits could start slowing growth as 2026 approaches.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "13:16:14",
      "Source": "Insider Monkey",
      "Title": "Jim Cramer Says Eli Lilly’s GLP-1 Pill Is “Going to Revolutionize Everything”",
      "URL": "https://finance.yahoo.com/news/jim-cramer-says-eli-lilly-051614791.html",
      "Content": "Jim Cramer Says Eli Lilly’s GLP-1 Pill Is “Going to Revolutionize Everything”\n\nSyeda Seirut Javed\nMon, December 22, 2025 at 9:16 PM PST 2 min read\n\nIn this article: LLY\n\nCVX\n\nSLG\n\nAVGO\n\nAMD\n\nEli Lilly and Company (NYSE: LLY ) is one of the stocks Jim Cramer answered questions about . Inquiring if their portfolio is diversified, a caller highlighted that their top five holdings are LLY, SLG, MSFT, CVX, and TSM. Cramer said:\nPixabay/Public Domain\nEli Lilly and Company (NYSE:LLY) develops and markets medicines for diabetes, obesity, oncology, immunology, neuroscience, and other chronic conditions.\nWhile we acknowledge the potential of LLY as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "09:20:00",
      "Source": "Motley Fool",
      "Title": "1 No-Brainer Artificial Intelligence (AI) Stock to Buy With $1,000 in December and Hold for the Long Term",
      "URL": "https://finance.yahoo.com/m/002d6bde-8e02-3ad1-84e5-e554ed601019/1-no-brainer-artificial.html",
      "Content": "1 No-Brainer Artificial Intelligence (AI) Stock to Buy With $1,000 in December and Hold for the Long Term\n\nJennifer Saibil, The Motley Fool\nMon, December 22, 2025 at 5:20 PM PST 4 min read\n\nIn this article: TSM\n\nNVDA\n\nGOOG\n\nPLTR\n\nCRWV\n\nKey Points Taiwan Semiconductor is benefiting from the growth of AI, giving it excellent chances heading into 2026.\nIt works with 500 partners and powers 12,000 different products.\nThe company reports fourth-quarter results in January.\n10 stocks we like better than Taiwan Semiconductor Manufacturing ›\nArtificial intelligence (AI) has been an incredible market driver in 2025. Large companies , such as Nvidia and Alphabet, are enjoying strong gains, while companies like Palantir Technologies and CoreWeave are attracting investor attention and gaining at even faster rates.\nIt remains to be seen whether this trend will continue in 2026, but it appears likely. If you have $1,000 available to invest and are looking for a top AI stock to buy right now, Taiwan Semiconductor (NYSE: TSM) is a no-brainer.\nThe foundation of all AI What sets Taiwan Semi apart from almost any other AI stock is that it manufactures the chips designed by other companies. It's the manufacturer for the brand names, the foundation of their development. It's not the only game in town, but it developed the industry, and it's the biggest: It's been responsible for around 85% of semiconductor start-up product prototypes, and it has a 34% market share in the foundry business, which enables the fabrication of semiconductors.\n\nIt has contracts with nearly all the chip designers that are changing the world through AI. These are names like Nvidia, Alphabet, and Advanced Micro Devices . These companies are continually developing more powerful chips, and their trusted partner, Taiwan Semiconductor, is experiencing strong growth as a result.\nAs hyperscalers like Amazon and Microsoft pour billions of dollars into data centers and AI development, they require more chips. Regardless of which chipmaker they're working with, they're likely to count on TSMC as a partner at some point.\nThe company has expanded its operations and now has a U.S. presence in Arizona. The very first chip that came off the line was an Nvidia Blackwell chip in October, marking a significant win for both companies. It's already investing $165 billion in Arizona alone, and it's looking to expand into new U.S. facilities over the next few years, setting itself up for many years of growth. This is an important development, not only because it expands the company's capabilities, but it also allows it to get around the tariffs that have been so challenging for many companies doing business in the U.S. recently.\n\nLire la suite\nMore than AI Aside from its client diversification, which is an excellent feature, it's also diversified by industry. It's benefiting from the tailwinds of AI growth, but it has been around a lot longer than the recent AI craze. It manufactures chips for various types of technology, including smartphones, autonomous vehicles, and AI. It works with 500 companies, and its semiconductors power 12,000 different products.\n\nHowever, AI is definitely giving the company a big boost. High-performance computing, which includes AI products, accounted for 57% of total revenue in the third quarter. Total revenue has increased at a compound annual growth rate (CAGR) of 18.2% since going public in 1994. That is an outstanding performance, and it has accelerated recently; revenue was up 40.8% year over year in the third quarter. However, its highest-growing industries are Internet of Things (IoT) and smartphones.\nA stock price that's ready to jump A great stock is one that you can buy any time; the earlier the better. Taiwan Semiconductor has tremendous growth drivers and opportunities, making it a no-brainer choice for long-term growth.\nHowever, December appears to be an auspicious time to buy shares, as the stock has remained relatively stable over the past few months and is up 46% year to date. The company is expected to report fourth-quarter and full-year earnings in January, and the stock is likely to jump on positive results, giving you the chance to buy in before the next rise.\n\nShould you invest $1,000 in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,039 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,109,506 !*\nNow, it’s worth noting Stock Advisor’s total average return is 972 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 22, 2025\nJennifer Saibil has positions in Taiwan Semiconductor Manufacturing. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Microsoft, Nvidia, Palantir Technologies, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\n1 No-Brainer Artificial Intelligence (AI) Stock to Buy With $1,000 in December and Hold for the Long Term was originally published by The Motley Fool\n\nCGU et Politique de confidentialité\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "02:05:10",
      "Source": "GuruFocus.com",
      "Title": "INTC: Intel Foundry Push and Nvidia Backing Could Drive 2026 Growth",
      "URL": "https://finance.yahoo.com/news/intc-intel-foundry-push-nvidia-180510667.html",
      "Content": "INTC: Intel Foundry Push and Nvidia Backing Could Drive 2026 Growth\n\nNauman Khan\nMon, December 22, 2025 at 10:05 AM PST 2 min read\n\nIn this article: INTC\n\nNVDA\n\nSFTBF\n\nAAPL\n\nQCOM\n\nThis article first appeared on GuruFocus .\nIntel ( NASDAQ:INTC ) is entering 2026 with renewed investor interest after a management change and several large cash infusions, but its turnaround still hinges on landing a major external foundry client.\nNew CEO Lip-Bu Tan has trimmed costs and leaned on industry ties to steady the company after years of setbacks that left its manufacturing arm behind rivals.\n\nWarning! GuruFocus has detected 5 Warning Signs with INTC.\nIs INTC fairly valued? Test your thesis with our free DCF calculator.\nA rare U.S. government stake, plus investments from Nvidia ( NASDAQ:NVDA ) and SoftBank ( SFTBY ), bolstered the balance sheet, but analysts say the foundry needs scale to be viable.\nIntel's progress with advanced nodes, including its roadmap for 14A, will be watched closely. Success could persuade customers like Apple or Qualcomm to shift some production, analysts said, but longstanding ties to Taiwan's TSM ( NYSE:TSM ) complicate the pitch.\nInvestors say the next 12 to 18 months are critical: without a marquee external contract, Intel may struggle to justify continued heavy manufacturing investment.\nMarket watchers caution returns could be gradual even if technical milestones are met and shareholders.\n\nIs INTC Stock a Buy? Based on the one year price targets offered by 36 analysts, the average target price for Intel Corp is $36.79 with a high estimate of $52.00 and a low estimate of $18.00. The average target implies a upside of +0.13% from the current price of $36.74.\nBased on GuruFocus estimates, the estimated GF Value for Intel Corp in one year is $23.92, suggesting a downside of -34.89% from the current price of $36.74. gf value is gurufocus' estimate of the fair value that the stock should be traded at. it is calculated based on the historical multiples the stock has traded at previously, as well as past business growth and the future estimates of the business' performance. For deeper insights, visit the forecast page.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-23",
      "Time": "00:01:54",
      "Source": "Yahoo Finance",
      "Title": "Nvidia dominated the headlines in 2025 — these were its 15 biggest events of the year",
      "URL": "https://finance.yahoo.com/news/nvidia-dominated-the-headlines-in-2025--these-were-its-15-biggest-events-of-the-year-160154710.html",
      "Content": "Nvidia dominated the headlines in 2025 — these were its 15 biggest events of the year\n\nDaniel Howley · Technology Editor\nMon, December 22, 2025 at 8:01 AM PST 9 min read\n\nIn this article: NVDA\n\nSSNLF\n\n005380.KS\n\nAMD\n\nOPAI.PVT\n\nIt’s difficult to think of any single company that had a bigger impact on Wall Street and the AI trade in 2025 than Nvidia ( NVDA ).\nInvestors scrutinized CEO Jensen Huang’s every move, whether that was his meetings with President Trump or a night out with the heads of Samsung and Hyundai for fried chicken and beer.\n\nNvidia’s revenue soared in 2025, bringing in $187.1 billion, and its market capitalization continued to climb, briefly eclipsing the $5 trillion mark, before settling back in the $4 trillion range.\nThere were plenty of major highs and deep lows throughout the year, but these 15 were among the biggest moments of Nvidia’s 2025.\nJan. 6: CES 2025 Nvidia rang in the new year with a series of product announcements ranging from a new pint-sized AI chip to more powerful gaming cards at CES 2025. Huang’s keynote touched on an array of topics, including physical AI, otherwise known as robots; desktop-based AI systems; and a litany of AI software updates that set the stage for the company’s 2025.\n\nJan. 27: The DeepSeek moment Nvidia had an incredible year by seemingly every measure, but it started out with a shock. In January, DeepSeek released its R-1 model, which the company claimed it trained using less than state-of-the-art processors. That sent the AI trade into a meltdown, with the company shedding nearly $600 billion from its market cap in a single day.\nDespite the initial blowup, fears that AI companies would no longer need high-powered chips seem to have been overblown. That’s because training AI models and running them are two different operations, and according to Nvidia, running models with more powerful chips improves overall performance.\nMarkets eventually settled down as more companies agreed with the assumption, but Nvidia’s stock price didn’t return to pre-DeepSeek levels until June.\n\nMarch 18: Nvidia reveals Blackwell Ultra chips at GTC Nvidia’s annual GTC event, held in San Jose, used to be a moderately sized tech conference. But this year’s GTC was far different . Huang’s keynote filled the SAP Center, home of the San Jose Sharks hockey team, and Nvidia took over a large swath of downtown San Jose, which included an enormous collection of food tents and stalls that covered the 2.3-acre Plaza de César Chávez.\nDuring his speech, Huang debuted Nvidia’s Blackwell Ultra chip, the successor to its Blackwell GPU, and the GB300 superchip, which combined two Blackwell GPUs and one of Nvidia’s Grace CPUs.\nThe CEO said the offerings were built for the age of “AI reasoning” and said models like DeepSeek’s R-1 would run far better on Nvidia’s latest and greatest.\n\nStory Continues\nApril 2: 'Liberation Day' Trump’s decision to implement a series of tariffs on countries and goods on April 2, which he called “Liberation Day,” sent the stock market into such a nosedive that the president had no choice but to walk some of them back just a week later.\nNvidia wasn’t immune to the drop. The company saw its stock price decline from $110 on April 2 to $94.31 on April 4. Shares returned to pre-\"Liberation Day\" numbers by April 9, but continued to waffle until breaking out of their slump on April 25.\nApril 15: H20 effectively banned Nvidia’s April didn’t get much better when the Trump administration implemented new chip restrictions that called for Nvidia to receive a license to ship the H20 chip to China , effectively banning sales of the processor to the country.\nNvidia designed the GPU to meet restrictions set up during President Joe Biden’s administration. Trump, however, blocked the China-specific chip on security grounds. The company ended up writing down $4.5 billion in charges related to the H20 in Q1 and took an additional $4 billion in Q2.\n\nJuly 9: Nvidia hits $4 trillion Despite taking a hit from the DeepSeek meltdown and Trump’s China ban, Nvidia stock continued to perform, and in July the company became the first to see its market capitalization pass the $4 trillion mark .\nNvidia topped $1 trillion in 2023 and took just three years to add another $3 trillion, thanks to its leadership position in the AI chip market.\nJuly 14: Nvidia can sell H20 in China again In July, the on-again-off-again relationship between Washington and China was back on, with Nvidia announcing that the Trump administration had assured the company that it would allow sales of H20 chips to China .\nHuang successfully made the case that America would benefit from selling its technologies to China and risked falling behind if it completely cut itself off from the market, convincing Trump to allow Nvidia to sell to the country again.\n\nAug. 11: Nvidia to pay 15% cut on China sales Although the White House assured Nvidia it would approve the sale of its chips to China, the administration later announced that it would take a 15% cut of the sales . The same rule applied to Nvidia rival AMD ( AMD ).\nDespite the potential revenue haircut, investors on Wall Street weren’t too bothered by the announcement, figuring that 85% of the revenue from sales to the country was better than the 0% Nvidia was bringing in before.\n\nSept. 22: Nvidia says it will invest $100 billion in OpenAI In September, Nvidia announced it would invest upward of $100 billion in ChatGPT developer OpenAI . The partnership would let OpenAI ( OPAI.PVT ) build out 10 gigawatts or more of data center capacity, allowing it to train and run its GPT models.\nNvidia’s deals have raised eyebrows among analysts who warn that such circular investments, where a company (Nvidia) invests in a customer (OpenAI) and uses that cash to purchase chips from the investor (Nvidia), artificially boost AI spending.\nNvidia has faced criticism for a similar deal with CoreWeave ( CRWV ). Nvidia invested in the company, which then turned around and bought Nvidia chips. Such deals have driven at least part of the discussion around an AI bubble.\n\nOct. 17: Nvidia’s first Blackwell chip built in US The Trump administration, like the Biden administration before it, has made reshoring chip manufacturing a national imperative. And while Nvidia doesn’t build its own chips — it outsources that to TSMC — it did celebrate that company’s completion of the first Blackwell chip built in the US in October .\n\nOct. 29: Nvidia hits $5 trillion Nvidia’s market capitalization hit $5 trillion in late October , just a few months after crossing the $4 trillion mark.\nThe exuberance came as the company announced a number of new deals with companies like Uber at its first GTC event in Washington, D.C. It also followed word that Huang would meet with Trump in South Korea ahead of the president’s meeting with Xi Jinping to discuss a trade deal.\nThe hope was that Trump and Xi would reach an agreement to allow Nvidia to sell its chips in the country, but a deal never materialized.\n\nOct. 30: Viral fried chicken photo with leaders of Samsung and Hyundai Huang’s star exploded throughout 2025, so much so that in October, reporters and onlookers swarmed a South Korean fried chicken restaurant to catch a glimpse of him dining with the heads of Samsung and Hyundai. An image of the trio subsequently went viral .\nNov. 19: Nvidia to ship chips to the Middle East Nvidia received authorization to ship the equivalent of more than 60,000 Blackwell chips to Saudi Arabia and the United Arab Emirates in November as the company continued to vie for the opportunity to sell its processors to a wider array of countries.\nThe company has pushed the concept of sovereign AI throughout 2025, saying that it allows countries around the world to get access to their own AI data centers without having to rely on other nations.\nBut China hawks said the move could give the US adversary access to Nvidia chips, due to that country’s close relationship with the UAE.\n\nNov. 25: Nvidia’s Google tweet Nvidia has faced threats from its own customers, including Microsoft ( MSFT ) and Amazon ( AMZN ), building their own chips to power their AI platforms, but in November, a report that Google could provide Meta ( META ) with its own tensor processing units (TPUs) for the social media giant’s data centers seemed to spook Nvidia.\n\nThe company sent out a viral tweet in response to the story, congratulating Google on its chips’ performance, but pointed out that its own GPUs were a generation ahead of Google’s and noted that it’s the only chip that can run all AI models .\nDec. 9.: Nvidia H200 approved for China After a year of will he, won’t he, Trump wrote in a post on the Truth Social platform that he was greenlighting the sale of Nvidia’s H200 chips to China . The H200 is two generations behind Nvidia’s current Blackwell Ultra processors.\nTrump said that Xi responded positively to the deal, which, if fully approved by the countries, could provide a boost to Nvidia’s bottom line.\nStill, there’s no guarantee that the arrangement won’t fall apart. Nvidia has become a negotiating chip for the two countries, just as Apple was before, and could see its chips banned again.\nEmail Daniel Howley at dhowley@yahoofinance.com. Follow him on Twitter at @DanielHowley .\nFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here\nRead the latest financial and business news from Yahoo Finan ce.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "23:33:01",
      "Source": "GuruFocus.com",
      "Title": "AI Chips Are Driving a Foundry Boom. Why TSMC Is Winning the Most",
      "URL": "https://finance.yahoo.com/news/ai-chips-driving-foundry-boom-153301101.html",
      "Content": "AI Chips Are Driving a Foundry Boom. Why TSMC Is Winning the Most\n\nNauman Khan\nMon, December 22, 2025 at 7:33 AM PST 1 min read\n\nIn this article: TSM\n\nINTC\n\nNVDA\n\nAMD\n\nAVGO\n\nThis article first appeared on GuruFocus .\nGlobal semiconductor foundry revenue rose about 17% year over year to roughly $84.8 billion in the third quarter of 2025, supported by strong demand for artificial intelligence chips built on advanced manufacturing nodes, according to a research note from Counterpoint Research.\n\nTaiwan Semiconductor Manufacturing Company ( NYSE:TSM ) widened its lead, with market share edging up to about 72%. The gains followed higher output of its 3-nanometer process and solid utilization of 4- and 5-nanometer capacity, used heavily by AI accelerator customers such as Nvidia ( NASDAQ:NVDA ), Advanced Micro Devices ( NASDAQ:AMD ), and Broadcom ( NASDAQ:AVGO ).\nWarning! GuruFocus has detected 5 Warning Signs with INTC.\nIs INTC fairly valued? Test your thesis with our free DCF calculator.\nTSMC's foundry revenue grew more than 40% from a year earlier, outpacing the broader market. Counterpoint said most rival foundries posted slower growth, with non-TSMC players collectively expanding revenue by about 6%, reflecting softer orders after earlier tariff-related demand but some support from China's subsidy programs.\n\nLooking ahead, analysts said capacity limits at advanced nodes and constraints in advanced chip packaging, known as CoWoS, may cap sequential growth in the fourth quarter. Full-year 2025 foundry revenue growth is estimated at around 15%.\nCounterpoint expects the pure-play foundry segment to grow at a faster pace, helped by continued shipments of AI GPUs and custom AI chips. Texas Instruments ( NASDAQ:TXN ), Intel ( NASDAQ:INTC ), Infineon (IFNNY), and Samsung Electronics ( SSNLF ) maintained mid-single-digit market shares.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "22:25:35",
      "Source": "GuruFocus.com",
      "Title": "Nvidia and Micron Stocks Climb -- Wall Street Picks 2026 Semiconductor Winners",
      "URL": "https://finance.yahoo.com/news/nvidia-micron-stocks-climb-wall-142535246.html",
      "Content": "Nvidia and Micron Stocks Climb -- Wall Street Picks 2026 Semiconductor Winners\n\nNauman Khan\nMon, December 22, 2025 at 6:25 AM PST 1 min read\n\nIn this article: NVDA\n\nMU\n\nTSM\n\nThis article first appeared on GuruFocus .\nShares of Nvidia ( NASDAQ:NVDA ) and Micron Technology ( NASDAQ:MU ) moved higher on early Monday after Robert W. Baird named both companies among its top semiconductor picks for 2026, citing sustained artificial intelligence demand.\nNvidia climbed nearly 2% and Micron rose about 3% following the announcement.\n\nBaird analyst Tristan Gerra reiterated Buy ratings on both stocks following recent quarterly results that pointed to steady momentum across AI-linked markets.\nWarning! GuruFocus has detected 4 Warning Signs with NVDA.\nIs NVDA fairly valued? Test your thesis with our free DCF calculator.\nGerra lifted his price target on Nvidia to $275 and raised Micron's target to $443, pointing to improved earnings visibility and stronger end-market demand trends.\nFor Nvidia, Gerra said demand for next-generation AI processors remains ahead of supply, with attention likely to center on execution and manufacturing capacity as the company moves deeper into 2026.\nHe also noted that chip production remains closely tied to Taiwan Semiconductor Manufacturing (TSM), which plays a key role in meeting Nvidia's output needs.\nMicron, meanwhile, was highlighted for tightening memory supply and growing exposure to high-bandwidth memory used in AI workloads.\nGerra said pricing discipline and measured capital spending could support margins over the coming quarters.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "22:10:00",
      "Source": "Business Wire",
      "Title": "Onto Innovation Receives TSMC Honor for \"Excellent Production Support\"",
      "URL": "https://finance.yahoo.com/news/onto-innovation-receives-tsmc-honor-141000746.html",
      "Content": "This is a paid press release. Contact the press release distributor directly with any inquiries.\n\nOnto Innovation Receives TSMC Honor for \"Excellent Production Support\"\n\nBusiness Wire\nMon, December 22, 2025 at 6:10 AM PST 2 min read\n\nIn this article: ONTO\n\nTSM\n\nThe award recognizes Onto Innovation’s achievements leveraging artificial intelligence technologies in process control applications\nWILMINGTON, Mass., December 22, 2025 --( BUSINESS WIRE )-- Onto Innovation Inc. (NYSE: ONTO) today announced the Company has received the \"Excellent Production Support\" award from Taiwan Semiconductor Manufacturing Co., Ltd (TSMC) as part of its initiative recognizing the outstanding contributions of its global suppliers.\n\nOnto Innovation achieves ongoing success in integrating machine learning and predictive analytics into its metrology and inspection systems, which increases productivity for its customers. TSMC saluted Onto Innovation for supporting its 2025 deliveries through proactive supply chain management and manufacturing agility.\nThe award was presented by Cliff Hou, senior vice president and deputy co-chief operating officer and chief information security officer of TSMC, and accepted by Ramil Yaldaei, chief operating officer of Onto Innovation, during a ceremony on November 25.\n\"We are honored to receive this recognition from our partner TSMC, acknowledging both our technology as well as our execution,\" said Michael Plisinski, chief executive officer of Onto Innovation. \"I want to thank our team for the outstanding performance this year, acknowledged by this award. We look forward to another exciting year supporting our partners with the innovations to help them effectively ramp the new technologies that are changing our world.\"\n\nAbout Onto Innovation Inc.\nOnto Innovation is a leader in process control, combining global scale with an expanded portfolio of leading-edge technologies that includes un-patterned wafer quality, 3D metrology spanning chip features from nanometer scale transistors to large die interconnects, macro defect inspection of wafers and packages, metal interconnect composition, factory analytics, and lithography.\nOur breadth of offerings across the entire semiconductor value chain combined with our connected thinking approach results in a unique perspective to help solve our customers’ most difficult yield, device performance, quality, and reliability issues. Onto Innovation strives to optimize customers’ critical path of progress by making them smarter, faster and more efficient. Headquartered in Wilmington, Massachusetts, Onto Innovation supports customers with a worldwide sales and service organization.\nAdditional information can be found at www.ontoinnovation.com .\nSource: Onto Innovation Inc.\nONTO-IC\nView source version on businesswire.com: https://www.businesswire.com/news/home/20251222031722/en/\n\nStory Continues\nContacts\nInvestor Relations:\nSidney Ho, +1 408.376.9163\nsidney.ho@ontoinnovation.com\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "19:59:00",
      "Source": "Motley Fool",
      "Title": "Should You Buy TSM While It's Under $400?",
      "URL": "https://finance.yahoo.com/m/6d08eb63-3a02-3b72-b048-e7ec44defa44/should-you-buy-tsm-while-it%27s.html",
      "Content": "Should You Buy TSM While It's Under $400?\n\nManali Pradhan, CFA, The Motley Fool\nMon, December 22, 2025 at 3:59 AM PST 3 min read\n\nIn this article: TSM\n\nKey Points TSMC’s accelerating AI demand has improved long-term visibility for its foundry business.\nThe company is expanding its CoWoS packaging capacity.\nTSMC can continue to witness even more share price gains in 2026.\n10 stocks we like better than Taiwan Semiconductor Manufacturing ›\nTaiwan Semiconductor Manufacturing 's (NYSE: TSM) shares are already up by over 40% in 2025, but several Wall Street analysts believe that the rally may not be over. The most bullish among them is Susquehanna analyst Mehdi Hosseini, who increased TSMC 's price target from $300 to $400 ahead of its third-quarter earnings results. Hosseini highlighted the critical role of TSMC's advanced process nodes and unmatched manufacturing scale in enabling advances in artificial intelligence (AI) compute.\nHere's why a $400 price target seems plausible in 2026.\nStrong AI demand trends TSMC is experiencing accelerated demand for AI-optimized chips, with rising requests for foundry capacity not only from customers but also from customers' customers to support their businesses. TSMC expects AI accelerator demand to grow at a mid-40%s compound annual growth rate through 2029 and believes actual demand could even exceed this forecast.\n\nWith token usage (a metric of AI computational power) across AI models increasing at an exponential rate, the need for high-performance, energy-efficient chips has surged. That trend has benefited TSMC, as advanced nodes (7-nanometer and below) accounted for 74% of its wafer revenues in the third quarter.\nThis demand is already translating into robust top-line and bottom-line growth. In the third quarter, TSMC's revenues soared 41% year over year to $33.1 billion, while earnings per share surged 50% to $2.91.\nFuture catalysts TSMC is also focused on expanding its chip-on-wafer-on-substrate (CoWoS) packaging capacity, which is used to integrate logic and high-bandwidth memory on AI accelerators. In fact, according to industry estimates, TSMC will exit calendar year 2026 with CoWoS capacity of 120,000 to 130,000 wafers per month, a dramatic improvement from the current CoWoS capacity of 75,000 to 80,000 wafers per month.\n\nTSMC expects volume production of its N2P (extension of 2-nanometer family) and A16 technologies to commence in 2026, which could trigger another multiyear upgrade cycle in data centers, smartphones, and AI accelerators.\nConsidering all of these factors, TSMC seems well positioned to see meaningful share price growth in the coming year.\nShould you invest $1,000 in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this:\n\nStory Continues\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,039 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,109,506 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 972 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nManali Pradhan, CFA has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy .\nShould You Buy TSM While It's Under $400? was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "19:35:51",
      "Source": "CoinDesk",
      "Title": "Crypto Markets Today: Gold tokens shine as bitcoin rises to $89,000",
      "URL": "https://finance.yahoo.com/m/23701bf3-1d9f-36e8-8d3f-f002dbf2d23f/crypto-markets-today%3A-gold.html",
      "Content": "Crypto Markets Today: Gold tokens shine as bitcoin rises to $89,000\n\nOmkar Godbole\nMon, December 22, 2025 at 3:35 AM PST 3 min read\n\nIn this article: GC=F\n\nBTC-USD\n\n^GSPC\n\nXAUT-USD\n\nDX-Y.NYB\n\nGold surged to record, bringing cheer to digital tokens backed by the metal traditionally seen as a haven investment.\nTether gold (XAUT), the largest gold-backed token by market value, rose to an all-time high of $4,425 while PAXG (PAXG) and kineses gold (KAU) also rose, lifting the total market value of gold-backed tokens to $4.38 billion.\n\n\"The message is clear. Investors are still hedging macro uncertainty rather than leaning aggressively into risk. That divergence continues to cap enthusiasm for crypto, even as liquidity conditions improve,\" BRN&#x27;s head of research Timothy Misir, said in an email.\nBitcoin, referred to by some followers as digital gold, rose to $89,800 while the dollar index dropped and technology stocks lifted Asian equity indexes higher. Notably, heavyweight chipmakers Taiwan Semiconductor Manufacturing and Samsung Electronics gained, helping calm fears of an AI bubble. Futures tied to the S&P 500 advanced roughly 0.3%, pointing to a positive U.S. open on Monday.\nWhile the price uptick is encouraging, a sustained recovery will require a renewed appetite for institutional investment vehicles, which currently appear to have cooled. Last week, digital asset investment products listed worldwide registered a net outflow for the first time in four week, losing $952 million, according to data source CoinShares.\n\nDerivative insights Market stability has yet to galvanize demand for renewed risk taking. Futures are painting a mixed picture, with BTC, ETH, HYPE and BNB seeing small increases in open interest (OI) over 24 hours. Other major cryptocurrencies have seen capital outflows.\nBTC longs raised with borrowed money continue to rise on Bitfinex. Historically, this has been a feature of sustained bear markets.\nBTC&#x27;s 30-day implied volatility remains steady at around 45%, pointing to dull trading as the year draws to a close.\nEther&#x27;s 30-day implied volatility dropped to 70%, the lowest since Oct. 9.\nOn the CME, open interest in BTC futures dropped below 120K BTC for the first time since early 2024. That&#x27;s a sign of dwindling institutional participation.\nBCH, SHIB, WLFI and TON are seeing negative funding rates in perpetual markets, indicating a bias for short positions. Funding rates for majors remain mildly positive.\nOn Deribit, block flows paint a mixed picture, with both BTC call and put spreads crossing the tape. In ETH&#x27;s case, traders chased calendar spreads.\nOverall, BTC and ETH puts continue to trade at a premium to calls, although the put bias has weakened slightly since Friday.\n\nStory Continues\nToken Talk Curve DAO voted down a proposal to send 17.45 million CRV tokens, worth around $6.3 million, to Swiss Stake AG, a company led by Curve Finance founder Michael Egorov that handles core development for the decentralized exchange.\nThe protocol&#x27;s CRV token is up around 4% in the last 24 hours, outperforming the wider crypto market. The CoinDesk 20 (CD20) index rose 0.35% in the same period.\nThe proposal , which aimed to fund protocol development, infrastructure and security work for the 25-person team at Swiss Stake, failed with 54.46% of votes against and 45.54% in favor.\nWallets tied to Yearn Finance and Convex Finance, two major players in decentralized finance, cast nearly 90% of the votes opposing the measure, according to on-chain data.\nSome DAO members flagged concerns around the transparency of reporting of previous expenditures.\n“The DAO deserves an itemized and transparent list of expenses and shouldn’t be expected to authorize any more funding until this requirement is met and the community has the opportunity to openly discuss whether those expenses are reasonable,” a DAO member wrote.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "19:09:58",
      "Source": "AFP",
      "Title": "Stocks diverge as rate hopes rise, AI fears ease",
      "URL": "https://finance.yahoo.com/news/asian-markets-rally-wall-st-033519621.html",
      "Content": "Stocks diverge as rate hopes rise, AI fears ease\n\nAFP\nMon, December 22, 2025 at 3:09 AM PST 3 min read\n\nIn this article: GC=F\n\nSI=F\n\nSSNLF\n\nTSM\n\nRNECF\n\nStock markets diverged Monday and gold hit a record high as the latest round of US data boosted hopes for more interest rate cuts and concerns over AI spending subsided.\nIn the final business days before Christmas, tech firms led a rally in Asia, with South Korea's Samsung Electronics, Taiwan's TSMC and Japan's Renesas among the best performers.\n\nHong Kong, Shanghai, Sydney, Seoul, Singapore, Mumbai, Bangkok, Wellington, Taipei and Manila stock markets all saw healthy advances.\nTokyo was the standout, piling on 1.8 percent thanks to a weaker yen.\nHowever, London, Paris and Frankfurt fell.\n\"Tech stocks are leading this 'Santa Rally' and Europe is tech-light, so it may be a laggard as we start a new week,\" said Kathleen Brooks, research director at trading group XTB.\nGold, which benefits from lower US interest rates, hit a fresh record of $4,420.30, while silver also struck a new peak.\nThe precious metals, which are go-to assets in times of crisis, also benefited from geopolitical worries as Washington steps up its oil blockade against Venezuela and after Ukraine hit a tanker from Russia's shadow fleet in the Mediterranean.\n\nOil prices rose more than one percent amid the geopolitical tensions.\nEquity gains tracked a surge on Wall Street Friday led by the Nasdaq as technology giants rallied following a bumper earnings report from chip giant Micron Technology that reinvigorated the AI trade.\nThat came on top of news that Oracle will take a 15 percent stake in a TikTok joint venture that will allow the social media company to maintain operations in the United States.\nThe tech bounce came after a bout of selling fuelled by concerns that valuations had been stretched and questions were being asked about the vast sums invested in artificial intelligence that some warn could take time to see returns.\nForex traders are keeping tabs on Tokyo after Japan's top currency official said he was concerned about the yen's recent weakness, which came after the central bank hiked interest rates to a 30-year high on Friday.\n\nThe comments stoked speculation that officials could intervene in currency markets to support the yen, which fell more than one percent against the dollar Friday after bank boss Kazuo Ueda chose not to signal more increases early in the new year.\n- Key figures at around 1045 GMT -\nLondon - FTSE 100: DOWN 0.4 percent at 9,858.28 points\nParis - CAC 40: DOWN 0.4 percent at 8,115.74\nFrankfurt - DAX: DOWN 0.1 percent at 24,267.32\nTokyo - Nikkei 225: UP 1.8 percent at 50,402.39 (close)\n\nStory Continues\nHong Kong - Hang Seng Index: UP 0.4 percent at 25,801.77 (close)\nShanghai - Composite: UP 0.7 percent at 3,917.36 (close)\nNew York - Dow: UP 0.4 percent at 48,134.89 (close)\nDollar/yen: DOWN at 157.40 yen from 157.59 yen on Friday\nEuro/dollar: UP at $1.1736 from $1.1719\nPound/dollar: UP at $1.3438 from $1.3386\nEuro/pound: DOWN at 87.34 pence from 87.55 pence\nWest Texas Intermediate: UP 1.7 percent at $57.45 per barrel\nBrent North Sea Crude: UP 1.6 percent at $61.44 per barrel\ndan-ajb/rl\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "19:00:15",
      "Source": "Yahoo Finance Video",
      "Title": "The value that neocloud companies offer to major AI players",
      "URL": "https://finance.yahoo.com/video/value-neocloud-companies-offer-major-110015938.html",
      "Content": "The value that neocloud companies offer to major AI players\n\nYahoo Finance Video and Julie Hyman\nMon, December 22, 2025 at 3:00 AM PST\n\nIn this video: AVGO\n\nCRWV\n\nMU\n\nNVDA\n\nTSM\n\nMicron Technology ( MU ) stock continues to pop after boasting strong fiscal first quarter earnings results driven by demand around high-bandwidth memory chips for AI data centers. As more companies invest into large-scale AI infrastructure buildouts, what does this all mean for the broadening AI trade and even neocloud operators?\n\nFreedom Capital Markets Managing Director Paul Meeks talks about the three chip companies he still has at the top of his list and the upside that neocloud companies like CoreWeave ( CRWV ) could offer some of the bigger players, such as Nvidia ( NVDA ).\nAlso catch Paul Meeks explain how much higher he sees Micron's stock going.\nTo watch more expert insights and analysis on the latest market action, check out more Market Catalysts .\n\nVideo Transcript\n\n00:00 Julie\nHow does this sort of change the dynamics in the memory market? I mean, as you mentioned, it's an oligopoly, there are two other players. We've seen memory prices go crazy, not even the high bandwidth kind, the overall kind that goes into all kinds of devices. So what are some of the sort of knock-on effects in the industry that you're watching and other names that you're watching?\n00:24 Paul\nSo I continue to like the people that are benefiting from the uh spend. I recently initiated coverage with Coreweave, which is one of the neo clouds with a $100 price target. But believe it or not, I think there's upside in Nvidia, Broadcom, Taiwan Semi, some of these companies that when I get push back, what people will say, how can you possibly recommend Nvidia after it's done so well for all these years. Well, it's because I see even more greatness ahead of them. And you know, some of these stocks, Julie, have come down quite a bit in the last couple of weeks. I think it's a good buying opportunity for several of the names.\n01:21 Julie\nUm I'm curious about the the neo clouds in particular Paul, because there have been some questions about that business model, right? That if you were, you know, renting space from someone else, if you're trying to go out to the smaller providers, um as your clients, that maybe you're a little more vulnerable if there are chinks in the armor of this whole um AI thesis. What do you think about that?\n02:02 Paul\nanother excellent question. The way I look at it is you have to look at these contracts that they are signing very carefully. In the case of Core Weve, we have five and six-year deals with well-funded folks like Microsoft and Meta. and they are paying 15 to 25% of total contract value upfront. So there's some initial cash flow. And so I think that even though some of these companies are levered and Cory mind you is highly levered, that they have a nice runway and I think that over the next couple of years their plans are set and they're funded by the most well-funded companies almost on planet Earth.\n03:00 Paul\nAnd the other thing that's interesting about Core Weve, it has an interesting deal with Nvidia, which is also a 6% shareholder in which if Core Weve has any surplus capacity between now and April of 2032, it'll be socked up by Nvidia. So, some people will say that's a quote-unquote circular deal, but I actually like that deal a lot. And so I do think there's upside. Yes, it's speculative, yes, they're highly levered, but I think that this is all under control as long as the spending from the big boys continues. And I think all these companies when they announce their results in January or February, will confirm at least the 2026 capital expenditure spend.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "05:20:00",
      "Source": "Motley Fool",
      "Title": "The Best Stocks to Buy With $1,000 for 2026",
      "URL": "https://finance.yahoo.com/m/f469a50c-3362-3aa9-9da7-e9708ab9088d/the-best-stocks-to-buy-with.html",
      "Content": "The Best Stocks to Buy With $1,000 for 2026\n\nKeithen Drury, The Motley Fool\nSun, December 21, 2025 at 1:20 PM PST 4 min read\n\nIn this article: GOOG\n\nAMZN\n\nTSM\n\nKey Points Alphabet is considering selling its custom AI chips.\nTaiwan Semiconductor will thrive as long as AI spending stays elevated.\nAmazon is due for a comeback in 2026.\n10 stocks we like better than Alphabet ›\nWith 2026 quickly approaching, investors need to have a game plan for what stocks they will buy. Several interesting trends are brewing in the market, and may cause investors to think differently about how they want to invest. Still, I think some smart investments in the artificial intelligence (AI) realm could result in monster returns in 2026.\nThree smart stocks to buy with $1,000 right now for 2026 are Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) , Taiwan Semiconductor Manufacturing (NYSE: TSM) , and Amazon (NASDAQ: AMZN) . All three of these are primed to outperform the market in 2026, making them great buys now.\nAlphabet Alphabet has been one of the best performing stocks in 2025, rising more than 60% so far. Alphabet's performance can be tied to multiple successes, including the continued dominance of its core business, Google Search; developing a leading generative AI model in Gemini; and considering selling its custom Tensor Processing Units (TPUs) to outside clients.\n\nThose are all significant developments that have answered many outstanding questions surrounding Alphabet's stock at the start of 2025, clearing the way for another successful year in 2026. Wall Street analysts expect Alphabet to grow its revenue by nearly 14% next year, which is impressive considering its business maturity. That isn't going to dramatically outperform the market, but it should be enough to propel Alphabet over the 10% threshold that many investors wish to exceed when picking individual stocks.\nAlphabet has transformed from an artificial intelligence laggard to an AI leader in 2026, and I believe that trend will continue to power the stock higher in 2026 and beyond.\nTaiwan Semiconductor Manufacturing Keeping up with which company is providing the best computing unit possible is exhausting. While Nvidia and its graphics processing units (GPUs) have dominated so far, other companies like Alphabet are starting to challenge its dominance. This sparring will go back and forth forever, but what won't change is where most of the chips are sourced from.\n\nTaiwan Semiconductor is the world's largest foundry by revenue and is the primary source for high-end computing chips, such as those used in various computing units within AI data centers. As long as AI hyperscalers continue to build out their AI computing power, Taiwan Semiconductor will remain an excellent investment. With the AI hyperscalers informing investors that 2026 will be another year of record-setting capital expenditures, this thesis is on track.\n\nStory Continues\nTaiwan Semiconductor also trades for less than 23 times next year's earnings, making it the cheapest company on this list. Taiwan Semiconductor is set up for a great 2026 with all of the massive spending occurring, positioning it as a great stock to buy now.\nAmazon Amazon has had a disappointing 2025, with the stock essentially flat for the year. That's frustrating for investors, especially when stocks like Taiwan Semiconductor and Alphabet have done so well. However, this sets the stage for a comeback in 2026, especially behind the strength of its growing business units.\n\nWhile most view Amazon as an e-commerce company, that segment doesn't provide the majority of the profits. Instead, its cloud computing wing, Amazon Web Services (AWS), does. In Q3, AWS generated the majority of Amazon's operating profits while growing revenue at a 20% pace. That's faster than the companywide 13% growth rate. When the most profitable business unit is also growing faster than the overall business, that's an excellent sign for investors.\nAnother area to watch is Amazon's advertising business. Amazon's ad business is the company's fastest-growing division, rising 24% in Q3. It has also grown to become a huge part of the business, allowing it to boost Amazon's margins as well.\nThe continued strength of both segments is key for 2026, and if they continue to do well, Amazon will make a comeback and be an excellent stock to buy and hold in 2026.\n\nShould you buy stock in Alphabet right now? Before you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,039 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,109,506 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 972 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nKeithen Drury has positions in Alphabet, Amazon, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool has positions in and recommends Alphabet, Amazon, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy .\nThe Best Stocks to Buy With $1,000 for 2026 was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-22",
      "Time": "03:00:54",
      "Source": "Yahoo Finance Video",
      "Title": "Riding the AI wave? You need a 'strong stomach': Dan Ives' strategy",
      "URL": "https://finance.yahoo.com/video/riding-ai-wave-strong-stomach-190054666.html",
      "Content": "Riding the AI wave? You need a 'strong stomach': Dan Ives' strategy\n\nYahoo Finance Video and Julie Hyman\nSun, December 21, 2025 at 11:00 AM PST\n\nIn this video: PLTR\n\nCRWV\n\nAMD\n\nIVES\n\nMETA\n\nIn the AI trade, you \"can't just bet on one company,\" Wedbush Securities managing director and global head of technology research, Dan Ives, tells Yahoo Finance, highlighting the importance of diversification for AI investors.\nWatch the video above to hear more about Ives' AI thesis and the 30 stocks in the Dan IVES Wedbush AI Revolution ETF ( IVES ).\nTo watch more expert insights and analysis on the latest market action, check out more Market Catalysts .\n\nVideo Transcript\n\n00:00 Speaker A\nThere's another stock I want to ask you about, and that is CoreWeave, which as you know, has sold off pretty sharply. Maybe the company didn't sort of message very well about some delays at one of its um data centers in terms of construction or one of the data centers it's leasing, not that it owns. Um, are you worried about that name, you know, in terms of execution risk, in terms of debt, in terms of the business model?\n00:32 Speaker B\nYeah, I'm not I mean, because I look at Core Weave, Nebius is another one from some of the Neo clouds. Look, I just my view is like, you're going to see things quarter to quarter move out. You you're going to see some blemishes in this really fourth industrial revolution. But I don't view it as sort of these panic moments, everyone heads for the elevator, yelling fire in a crowd theater. I mean, I do think this is one where it's going to be hyperfocused, but the onus is on them to execute, communicate it. Because right now, like, investors are so sensitive naturally, right? In terms of like, is this a bubble? Again, like I've told you, I I think it's 10:30 p.m. in that AI party that goes to 4:00 a.m. but these are that the responsibility is on the companies to communite.\n01:21 Speaker A\nOkay, so let me ask you this then. Like, I understand the thesis on the whole AI space, but if there are ones that are maybe a little bit higher risk in terms of messaging and execution, why not avoid that one? Why just not buy the other ones that don't necessarily have that risk?\n01:40 Speaker B\nSure, and like in our ETF, like we have the 30 AI win, I mean Core Weave's one of them, but the point is like, you can't just like bet on one company. I think you do have to like whether it's Godfather of AI Jensen video, whether it's AMD, whether it's Micron, on the software and the hyperscalar side, bet on your Pounteers, the Mongo DBs, the energy companies, the GE Vernovas and others. So I do think like to that point\n01:54 Speaker A\nYou disperse it.\n01:55 Speaker B\nYou have because you have to think about like a barbell approach. If you just bet on one, there's risk, right? In terms of like what could happen with that company. WeWork would be a perfect example. I think when it comes to the best way to play AI revolution, you have to own some chip names, software,\n02:22 Speaker A\nBut But I guess I'm asking why not avoid say a Core Weave and an Oracle? Why not just leave them out?\n02:27 Speaker B\nYeah, look, but but my to that point is investors be like, oh, you don't touch them, they're toxic. But then let's say six, nine months from now, you're like, okay, how come I didn't buy Oracle at 180 when now it's 240. So, so my view is like, if there was structural issues, if I didn't believe in the thesis, if there was something that felt like it was a business model change, then you avoid them. But I don't believe that is, but it speaks to like, look, you need like you know, strong hands and sort of you know, a strong stomach to battle through some of these sort of like waves that we're going to see, the deep seek moments, liberation day. I mean, we'll have more in 26, right? But it speaks to my view like you'll be wearing a, you know, S&P 7,000 hat, an 8,000 hat in New York. Like that's my view where we're two more years left in the tech bull market. and again, the bears in hibernation mode, they can't see in their spreadsheets. They missed every transformational tech stock the last 20 years, focus on what could happen.\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-21",
      "Time": "23:05:00",
      "Source": "Motley Fool",
      "Title": "The Best Artificial Intelligence (AI) Stock To Buy in 2026 (Hint: It's Not Nvidia)",
      "URL": "https://finance.yahoo.com/m/374a181e-6e9b-3eb4-905a-dd0b845d1cf1/the-best-artificial.html",
      "Content": "The Best Artificial Intelligence (AI) Stock To Buy in 2026 (Hint: It's Not Nvidia)\n\nAdam Spatacco, The Motley Fool\nSun, December 21, 2025 at 7:05 AM PST 5 min read\n\nIn this article: GOOG\n\nNVDA\n\nTSM\n\nAVGO\n\nKey Points Alphabet is finally getting some recognition from investors for its AI accomplishments.\nThe search-engine giant has ample opportunities to benefit from increased AI spending.\nWhile the stock has gotten a bit expensive, it looks poised to fly higher in the long-run.\n10 stocks we like better than Alphabet ›\n\nThe rise of artificial intelligence (AI) has served as an unprecedented bellwether for technology stocks over the last three years. In particular, semiconductor stocks including Nvidia , Taiwan Semiconductor Manufacturing , and Broadcom were all ushered into the trillion-dollar club thanks to the AI revolution.\nAs investment in AI infrastructure continues to unfold, I think it's likely that chip stocks will remain sound investment choices. But as 2026 approaches, I see a different tech titan taking center stage: Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) .\nLet's dig into how Alphabet has built an AI fortress poised to dominate the future. From there, I'll explore the company's valuation trends and make the case for why now is a great time to buy Alphabet stock hand over fist.\nIt's been a quiet three years for Alphabet...until now The AI revolution kicked off almost exactly three years ago when OpenAI commercially launched ChatGPT. ChatGPT quickly captured the imaginations of people all over the world with its ability to answer virtually any question instantly.\nThe dramatic rise in popularity among large language models (LLMs) caused some on Wall Street to pose the idea that traditional search tools like Google were headed for doom. Think of the business stakes at hand here: Why would advertisers continue paying a premium on platforms like Google and YouTube when everyone's attention was flocking to chatbots?\n\nWhile Alphabet's advertising business did show some signs of stalling, the company's cash cow remained somewhat resilient. For a couple of years, revenue from Google and YouTube wasn't as robust as it once was, but it also wasn't plummeting at an alarming rate.\nWhat many investors were overlooking, however, was Alphabet's other ventures. At the beginning of the AI revolution, Google Cloud was operating at an annual revenue run rate of about $29 billion. Meanwhile, this segment of Alphabet's business was unprofitable.\nFast forward to today, and Google Cloud is now on pace for more than $50 billion of annual sales while boasting positive operating income. What's even more interesting is that Google Cloud has won major deals with both OpenAI and Anthropic -- the two LLMs that were once seen as the ultimate existential threat to Google's relevancy.\n\nStory Continues\nBesides the success of its cloud division, Alphabet has also successfully launched its own LLM -- called Gemini. According to management, Gemini has over 650 million monthly active users (MAUs) while search queries are increasing threefold quarter over quarter.\nWhy 2026 could be epic for Gemini For most of the AI revolution, I think the consensus view around Alphabet was one of uncertainty. While not everyone bought into the extinction of Google narrative, it's fair to say that it took some time for Alphabet to prove its AI ambitions were bearing fruit.\nOne of the biggest catalysts the company has going into next year is an extension of Google Cloud through commercializing custom hardware. Specifically, Alphabet's application-specific integrated circuits (ASICs), known as tensor processing units (TPUs), have seen some early traction with Apple and Anthropic.\n\nWhile TPUs aren't going to dethrone Nvidia's GPU business anytime soon, I think Alphabet is on the cusp of unlocking a new wave of growth in the cloud infrastructure market that's currently dominated by Amazon Web Services (AWS) and Microsoft Azure.\nAlphabet stock could soar to new highs next year As of this writing, Alphabet's forward price to earnings (P/E) ratio is hovering around 28 -- its highest level during the AI boom.\nNormally, I tend to stay away from momentum stocks. More times than not, by the time a company reaches a record high, it's dicey to buy the premium and expect shares to move materially higher.\nThis is a rare instance where I think the opposite is true. Alphabet's current price increase reflects two factors: An appreciation for the company's current operating performance and a bullish outlook that Alphabet will keep up its strong performance.\n\nAlphabet's ecosystem -- from search, cloud computing, consumer electronics, custom hardware, and more -- is a major differentiator compared to its mega cap peers. The company has a unique flexibility stitched into its DNA -- benefiting from AI across its various assets and subsidiaries during any market cycle. These dynamics position Alphabet as a particularly durable business for the long run.\nAs investments in AI infrastructure are expected to continue rising going into next year, I expect Alphabet to benefit from these tailwinds more so than any one singular chip designer or software developer.\nWith this in mind, I think Alphabet will continue to show signs of accelerating revenue and profit margin expansion across its entire business next year -- which should lead to even more buying from shareholders. Against this backdrop, I see Alphabet as the best opportunity in the AI landscape as 2026 approaches.\n\nShould you invest $1,000 in Alphabet right now? Before you buy stock in Alphabet, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,039 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,109,506 !*\n\nNow, it’s worth noting Stock Advisor’s total average return is 972 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nAdam Spatacco has positions in Alphabet, Amazon, Apple, Microsoft, and Nvidia. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Microsoft, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy .\nThe Best Artificial Intelligence (AI) Stock To Buy in 2026 (Hint: It's Not Nvidia) was originally published by The Motley Fool\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-21",
      "Time": "22:57:25",
      "Source": "Insider Monkey",
      "Title": "Where is Taiwan Semiconductor Manufacturing (TSM) Headed According to Analysts?",
      "URL": "https://finance.yahoo.com/news/where-taiwan-semiconductor-manufacturing-tsm-145725336.html",
      "Content": "Where is Taiwan Semiconductor Manufacturing (TSM) Headed According to Analysts?\n\nNoor Ul Ain Rehman\nSun, December 21, 2025 at 6:57 AM PST 2 min read\n\nIn this article: TSM\n\nTSMWF\n\nAMAT\n\nTaiwan Semiconductor Manufacturing Company Limited (NYSE: TSM ) is one of the most widely held stocks by hedge funds in 2025 . Reuters reported on December 17 that Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) is among the two stocks in the chip equipment space that Morgan Stanley is the most constructive on, with the other being Applied Materials. The firm told investors in a note that the biggest debate is AI semis for the third consecutive year, where the “index weighting is dominated by the processor names, and the (so far) insatiable appetite for compute is the most important variable to consider.”\nIn a separate development, Bank of America Securities analyst Mike Yang reaffirmed a Buy rating on Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) on December 10 and set a price target of $390.\nThe rating update followed Taiwan Semiconductor Manufacturing Company Limited’s (NYSE:TSM) release of its November 2025 revenue report. Revenue for November 2025 on a consolidated basis reached around NT$343.61 billion, reflecting a drop of 6.5% from October 2025 and an increase of 24.5% compared to November 2024.\n\nThe company further reported that revenue for January through November of 2025 reached a total of NT$3,474.05 billion, which translates to a growth of 32.8% compared to the same period in 2024.\nTaiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) is the largest contract semiconductor manufacturer in the world. Some of its prominent customers include semiconductor companies that outsource all or part of their chip production, including Advanced Micro Devices, Nvidia, Broadcom, and more.\nWhile we acknowledge the potential of TSM as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock .\nREAD NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now .\nDisclosure: None. This article is originally published at Insider Monkey .\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-21",
      "Time": "22:00:04",
      "Source": "Yahoo Finance",
      "Title": "Intel stock soared in 2025. But the chipmaker still has a long road ahead.",
      "URL": "https://finance.yahoo.com/news/intel-stock-soared-in-2025-but-the-chipmaker-still-has-a-long-road-ahead-140004121.html",
      "Content": "Intel stock soared in 2025. But the chipmaker still has a long road ahead.\n\nLaura Bratton\nSun, December 21, 2025 at 6:00 AM PST 5 min read\n\nIn this article: INTC\n\nSFTBY\n\nTSM\n\nNVDA\n\nSFTBF\n\nFor Intel ( INTC ), 2025 was an eventful year, but not one that necessarily changed its narrative .\nThe storied American chipmaker got a new CEO and won massive investments from the US government , Nvidia ( NVDA ), and SoftBank ( SFTBY ). Those developments helped push the stock up 86% for the year, ahead of gains for the \"Magnificent Seven\" Big Tech stocks and Intel rival Advanced Micro Devices ( AMD ). At the same time, Intel's crucial manufacturing segment still lacks a major external customer — something it needs to make the cash-bleeding business viable.\n\n\"Intel's exiting the year with some optimism that they will be a relevant chip manufacturer in the US at some point in time ... and that was definitely an uncertain statement at the start of the year,\" MorningStar analyst Brian Colello told Yahoo Finance.\nAt the same time, he noted, \"There wasn't the massive sort of deal that really establishes Intel, either, in manufacturing.\"\n\nThe company's technology is largely responsible for the digital revolution and Silicon Valley's reputation as a global innovation hub: Intel invented the world's first microprocessors, or computer chips, and the x86 architecture, a critical blueprint for designing computer chips. Its co-founder Gordon Moore created Moore's Law, a theory that defined the pace of innovation in the semiconductor industry for more than half a century. The company has continued to make its own computer chips, even as the rest of the industry has gone \"fabless\" — outsourcing manufacturing to firms like Taiwan's TSMC ( TSM ).\n\nBut years of missteps and poor investment decisions put Intel's manufacturing segment behind TSMC, which in turn caused its products to lose their edge to competitors. As its chips — CPUs for servers, laptops, and desktops — have lost market share to rivals AMD and Arm ( ARM ), its manufacturing business has been stripped of the scale it needs to remain viable.\nFour years of an aggressive turnaround effort by former CEO Pat Gelsinger to revive Intel's manufacturing arm by opening it to outside customers sent investors fleeing. The massive amount of spending required to reboot the foundry, along with its uncertain success, spooked Wall Street.\nThe arrival of Lip-Bu Tan , who was named chief executive in March following the board's ousting of Gelsinger in late 2024, began to renew faith in the company's potential turnaround. While Intel's strategy remains mostly unchanged under Tan, analysts explained, investors have applauded his sober tone, cost-cutting measures, and wide-ranging industry connections.\n\nStory continues\nThat tepid faith transformed into confidence when the US government made a rare $9 billion investment in the company — albeit funds Intel was supposed to get anyway from the Biden-era CHIPS Act — following Tan's tiff with President Trump over the CEO's business ties to China.\nOnshoring semiconductor manufacturing has been a focus of the US government since the pandemic highlighted the risk of a tech supply chain reliant on Taiwan. Escalating tensions with China, including the threat of a Taiwan invasion, have further intensified the sense of urgency.\n\n\"Semiconductors are not only economically important, they're actually important from a national security perspective,\" Technalysis analyst Bob O'Donnell told Yahoo Finance. \"Intel has by far the largest infrastructure in place as a true, real American company.\"\nMany critics believe the broader US turn toward state capitalism under Trump, exemplified by the Intel investment, raises questions about national security and the government's conflicting interests. But analysts say the US government's 10% stake in Intel could lead to various positive outcomes for the company, such as Intel having a say in trade policy that affects semiconductors. More importantly, the US could step in to incentivize or force a major company like Apple to use the chipmaker's foundry.\n\nA $2 billion investment from SoftBank and $5 billion from Nvidia further boosted investor sentiment on Intel stock. The cash infusion helped stem the company's steep losses as it figures out a path forward. Notably, though, the Nvidia deal didn't include an agreement for Intel's foundry business to manufacture the AI giant's chips.\n'Everything hinges on 14A' Intel's biggest potential customers for its foundry business — Nvidia, Apple ( AAPL ), and Qualcomm ( QCOM ) — are also, to some degree, competitors of its products arm and have longstanding relationships with TSMC. Not to mention, TSMC is building $165 billion worth of manufacturing capacity in the US, diminishing the geopolitical argument for those companies to use Intel to produce their chips.\nTo win those customers, Intel will need to prove that its latest generation manufacturing processes are up to snuff. The chipmaker's 18A process, a massive technological feat initially marketed to outside customers, is now being used primarily to make Intel's own products. Whether those products — Intel's upcoming Panther Lake chips for PCs and Clearwater Forest chips for data centers — succeed could help convince companies to use its next-generation processes called 18AP and 14A, analysts said.\n\nAlready, rumors have circulated that Apple could use Intel's manufacturing, specifically its 18AP process, for its lowest-end computer chips.\nIntel has 12 to 18 months to secure a big external customer for 14A in order for that process to continue as planned, BNB Paribas analyst David O'Connor estimated.\nHe called the process \"the crux of Intel being successful on the foundry business or not, or potentially even exiting manufacturing long term.\"\n\"Everything hinges on 14A and the success of that,\" O'Connor said.\nOther analysts gave longer timelines for when Intel would see a turnaround.\nBernstein analyst Stacy Rasgon said, \"It took 10 years to break it. Why would it take less than 10 years to fix it?\"\nLaura Bratton is a reporter for Yahoo Finance. Follow her on Bluesky @laurabratton.bsky.social. Email her at laura.bratton@yahooinc.com.\nClick here for the latest technology news that will impact the stock market\nRead the latest financial and business news from Yahoo Finance\n\nTerms and Privacy Policy\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    },
    {
      "Date": "2025-12-21",
      "Time": "16:50:00",
      "Source": "Motley Fool",
      "Title": "1 Must-Own Artificial Intelligence Stock for the Next Decade",
      "URL": "https://finance.yahoo.com/m/b1435591-154b-32bb-853f-b89e5ef4fb46/1-must-own-artificial.html",
      "Content": "1 Must-Own Artificial Intelligence Stock for the Next Decade\n\nJustin Pope, The Motley Fool\nSun, December 21, 2025 at 12:50 AM PST 5 min read\n\nIn this article: TSM\n\nKey Points The global semiconductor market could grow in value to $2 trillion by 2040.\nTaiwan Semiconductor Manufacturing dominates the foundry industry, and produces most of the AI chips sold today.\nAlthough there may be volatility along the way, TSMC is well positioned for profitable growth over the next 10 years.\n10 stocks we like better than Taiwan Semiconductor Manufacturing ›\n\nU.N. economic experts forecast that the artificial intelligence (AI) market will grow in value to $4.8 trillion by 2033, and it's likely to grow far larger than that in the decade that follows. Along the way, it's going to produce some life-changing investment opportunities, just as the internet era did before it.\nMoreover, you don't necessarily need to succeed in predicting the next big thing to profit from it. Some AI stocks already stand out as no-brainer winners for the future.\nTaiwan Semiconductor Manufacturing (NYSE: TSM) , often referred to as TSMC, is one of them. It's arguably the ideal pick-and-shovel stock for the AI era. The company has immense growth potential and has already begun to show signs of realizing it.\nDominating a $2 trillion market opportunity It may not seem like it yet, but artificial intelligence systems are destined to be embedded in far more places than data centers. Over the coming years, we can expect AI to infiltrate many existing industries and also to create new ones. Autonomous vehicles and humanoid robotics are already on the way.\n\nThe common denominator among data centers, AI models, robots, self-driving vehicles, and the rest of that developing technology? Semiconductors, aka chips. Research from Deloitte estimates that the global semiconductor industry could grow from $627 billion in 2024 to $1 trillion by 2030, and to $2 trillion by 2040.\nMost companies that sell chips don't actually manufacture them. Instead, they design them, but outsource production to a foundry specialist. TSMC has long been the global leader in that business, with an estimated market share of 72% as of the third quarter of 2025.\nTSMC's market share has actually increased since the AI boom began a few years ago. The company's advanced production technologies and capacity to manufacture large quantities of high-end chips give it tremendous competitive advantages over other foundries.\n\nIt also means that TSMC should capture a significant portion of the new growth that will flow into the industry as global semiconductor demand increases in the coming years.\nThe investment cycle likely isn't over yet The semiconductor industry has historically been cyclical, experiencing boom and bust phases as investments in chips fluctuate and production capacity lags and then exceeds demand. You can see how TSMC's revenue growth has followed that pattern over time. It's fair to wonder how long the current AI investment cycle will last, especially as some tech companies face questions about how they will fund their ambitious data center plans.\n\nLeer más\nWhile the current AI chip cycle will eventually turn over, it doesn't seem like it's on its last legs yet.\nNvidia has touted a $500 billion order book through the end of next year for its current top-of-the-line Blackwell GPUs and the Rubin architecture chips that will succeed them next year. Some hyperscalers, such as Amazon and Alphabet , have developed their own custom AI accelerator chips. Yet TSMC manufactures them, too.\n\nIn short, regardless of which chipmaker is selling a particular AI chip, TSMC is likely to have manufactured it.\nHow to profit amid potential volatility Even if AI infrastructure investments slow, it doesn't mean long-term investors should abandon Taiwan Semiconductor Manufacturing. Despite short-term fluctuations in its growth, the company's revenue has increased by 335% over the past decade. As long as the industry continues to grow over the long term, TSMC should grow with it.\n\nThe stock trades at a price-to-earnings ratio of 28 times full-year earnings estimates. That's a compelling valuation for a company that analysts estimate will grow earnings by 28% annually over the next three to five years.\nAdmittedly, it's also possible that its earnings could be near their peak for the current investment cycle. If AI spending declines and TSMC's revenue growth slows, that will hurt the stock's valuation and share price. Rather than trying to time these things, investors who want to add TSMC to their portfolios would probably be better off using dollar-cost averaging, building their investment slowly and reducing their risk of buying at a short-term peak.\nUnless the AI megatrend completely unravels, which doesn't seem likely given the public and private sector commitments to developing AI technology, TSMC is likely to see enough growth over the next decade to make it worthwhile to ride out the inevitable peaks and valleys.\n\nShould you invest $1,000 in Taiwan Semiconductor Manufacturing right now? Before you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $509,039 !* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,109,506 !*\nNow, it’s worth noting Stock Advisor’s total average return is 972 % — a market-crushing outperformance compared to 193% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor , and join an investing community built by individual investors for individual investors.\nSee the 10 stocks »\n*Stock Advisor returns as of December 15, 2025\nJustin Pope has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet, Amazon, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy .\n1 Must-Own Artificial Intelligence Stock for the Next Decade was originally published by The Motley Fool\n\nCondiciones y Política de privacidad\nCA Privacy Notice\nYour Privacy Choices\nOpted out of sale / share\nMore Info",
      "Language": "en"
    }
  ],
  "total_news_count": 41
}